{"altername_name": ["刺客信条：血缘"], "name": "Assassin's Creed: Bloodlines", "overview": "Assassin's Creed: Bloodlines is a PSP-exclusive game that continues the story of the first Assassin's Creed game and also builds up to its sequel Assassin's Creed II. Unlike the Assassin's Creed: Altaïr's Chronicles spin-off for mobile and portable devices, it offers the open world and nonlinear gameplay of the original game. The game is set one month after the events of the first game and takes place in the two cities Limassol and Kyrenia on the island of Cyprus. The Templars have moved there and Altaïr has followed them to find out what their plans are and to take all of them out if there is an opportunity. The main villain is Armand Bouchart, grand master of the Templars, who is hunting the apple of Eden, which will allow him to control the minds of anyone he chooses. Gameplay runs on similar vein to the original Assasin's Creed. Altaïr has the ability move freely through each of the cities in the familiar parkour style based on stealth and sneaking up on targets. Players can also opt to have Altaïr simply fight his way in at street level and go in through the front door. Altaïr's arsenal consists of his fists for melee (usually non-lethal) combat, his signature sleeve sword and a longsword. Bloodlines also features PS3 connectivity via USB, which allows you to unlock six new weapons in Assasin's Creed II when your PSP is hooked up to your PS3. These can also be used in the PSP version. In addition to this, any Templar coins you find in Bloodlines are carried over to Assassin's Creed II, and codex pages will give you a health boost.", "platform": "Sony PSP", "release_date": "November 17, 2009", "game_type": "Released", "esrb": "M - Mature", "developers": "Griptonite Games", "publishers": "Ubisoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "https://en.wikipedia.org/wiki/Assassin%27s_Creed:_Bloodlines", "video_link": "https://www.youtube.com/watch?v=U1qp35nXOxA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6776-assassins-creed-bloodlines\n"}