{"altername_name": [], "name": "Bunmei Kaika Aoiza Ibunroku", "overview": "Mito Aoi is a normal high school student living in a shrine with her childhood friend, Kaminari Sousuke. One day her mother asks them to clean their warehouse, where they find a silver mirror among the other antique stuff. Just before they go out, a thunder strikes outside and Aoi gets absorbed into the mirror. When she opens her eyes Aoi finds herself back in 1873, the Meiji era.. and in front of her is a group of travelling performers, Aoiza. Aoi immediately notices an older Sousuke in the group, but he introduces herself as Kaminari Kensuke and tells her she’s got the wrong person. For some reason the group also keeps calling her “Futaba Aoi”, making her even more confused. She follows Aoiza back to their headquarter, a shop called Miyoshino in Ueno, where she finally learns that “Futaba Aoi” is actually a sacred stone they’ve been protecting all this time. It’s a family crest with a strong magical power, but nobody knows of its existence except for Aoiza’s members. Today the stone suddenly disappeared from its box, and they finally found it on Aoi’s wrist. Because of this, they now think she’s the embodiment of “Futaba Aoi” itself. As for Aoi herself, she was born holding that stone. Her grandma said it might bring good luck to her someday, so Aoi keeps it with her all the time. Who would have thought that it’s going to play an important role in the past? The Aoiza members then asks her to stay with them, since she doesn’t know anything about this world. Plus, it would be easier for them to protect the stone as well. Aoi gladly takes their offer, and it marks the start of her journey with them.", "platform": "Sony PSP", "release_date": "August 18, 2011", "game_type": "Released", "esrb": "Not Rated", "developers": "HuneX", "publishers": "Furyu", "genres": "Visual Novel", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/120868-bunmei-kaika-aoiza-ibunroku\n"}