{"altername_name": [], "name": "Chessmaster: The Art of Learning", "overview": "Chessmaster: The Art of Learning expands the scope of chess to include broader principles of learning. Josh Waitzkin's much-anticipated book The Art of Learning is designed to pave the road to successful long-term growth on and off the chessboard. The eight-time National Chess Champion and two-time martial arts World Champion puts users in his shoes in some of the most riveting and formative moments of his chess career, including the legendary climactic game from the book and film Searching for Bobby Fischer. Waitzkin then turns to the classics, introducing beginners to brilliant games from some of the most important players in the history of chess. In his most revealing commentary ever, Waitzkin not only teaches the beginning chess player the fundamentals of the game, but also humanizes the road to mastery. Never has chess been so exciting. • PLAYER PROFILE -Four player profiles are supported, each profile stores the player’s progress and performance ratings. • LEARN CHESS - Extensive course on the basics of chess taught by International Chess Master Josh Waitzkin. - Tutorials inspired by Josh Waitzkin’s groundbreaking book The Art of Learning. • SINGLE-PLAYER - Training mode: Play one of many predefined opponents and analyze your game. - Ranked Play: Test your skills against a variety of opponents and establish your rating. - Set up a position to solve chess problems or reproduce famous positions. • MINI-GAMES / PUZZLES - Play one of six original mini-games including Fork My Fruit, Minefield, Masterpiece, Chain Reaction, Breaking the Lines, and Pawn Charge. - Sharpen your brain by solving up to seven different categories of chess puzzles meant to improve your skills. • MULTIPLAYER - Play one-on-one with a friend. - Master one of five new chess variants with friends, including Progressive Chess, Dark Chess, Extinction Chess, Losing Chess, and Los Alamos Chess.", "platform": "Sony PSP", "release_date": "February 12, 2008", "game_type": "Released", "esrb": "E - Everyone", "developers": "Ubisoft Romania", "publishers": "Ubisoft", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=kxxh9n4PmT0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27704-chessmaster-the-art-of-learning\n"}