{"altername_name": ["DanganRonpa: Kibou no Gakuen to Zetsubou no Koukousei", "Danganronpa: Trigger Happy Havoc", "弹丸论破: 希望的学园和绝望高中生"], "name": "Danganronpa: Hope's Academy and Despair's Students", "overview": "The story is shown from the point of view of the protagonist, Makoto Naegi, who starts a new year at the elitist private school Hope's Peak Academy which is renowned for educating students that are top of their expertise. These students are given the title of \"Ultimate\". However, every year the school hosts a raffle where every average student nation-wide is entered and a random student is picked and enters the school as \"Ultimate Good Luck\" - Makoto Naegi is one of whom. The story revolves around 15 students who are trapped in the school under the control of sadistic bear named Monokuma. To escape, the students must \"graduate\" the school. To do this, one must murder a classmate. After a body has been discovered, the rest of the students must work together to discover the culprit. If the culprit can fool the rest of their classmates, then they alone can graduate the school but the rest of the students will be punished. However, if the classmates uncover the true culprit, then they alone will be punished with a gruesome execution while everyone else remains unharmed. While Monokuma releases motives to encourage students to commit a murder, the students also try to uncover the secrets of the school, including why they were trapped there in the first place.", "platform": "Sony PSP", "release_date": "November 25, 2010", "game_type": "Released", "esrb": "Not Rated", "developers": "Spike ChunSoft", "publishers": "Spike Chunsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.73", "wikipedia": "https://en.wikipedia.org/wiki/Danganronpa:_Trigger_Happy_Havoc", "video_link": "https://www.youtube.com/watch?v=a75CLjuz56Q", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/19931-danganronpa-hopes-academy-and-despairs-students\n"}