{"altername_name": ["Los Cazafantasmas: El Videojuego"], "name": "Ghostbusters: The Video Game", "overview": "An official sequel to the two Ghostbusters movies, Ghostbusters: The Video Game puts the player in control of Rookie, the unnamed newest member of the Ghostbusters. Shortly after being hired a mysterious ghostly shock wave flows through New York City, prompting the Ghostbusters to begin an investigation. Over the course of the game they will return to many locations from the movies and meet returning characters as well as some new locations and characters. As the Rookie the player must explore levels to find and capture any ghosts while being assisted by fellow Ghostbusters following you. A ghost must first be weakened using any of the proton pack weapon modes it is vulnerable to, then by dragging the stunned ghost to a trap placed by the player or their teammates. Other enemy types must be defeated by first revealing a weak point and then pulling it out with the proton pack's blast stream, or by simply dealing enough damage to the enemy. If the Rookie takes too much damage themselves they will be knocked unconscious, and their allies will attempt to get to them and help them back up. The Rookie can do the same if any of their allies are knocked unconscious, and if all current members of the team are knocked down the game will return to the last checkpoint. Information about enemies and objects in the world can be obtained by scanning them, and concept art for the entries can be added by finding hidden pages in the levels. The Rookie receives upgrades to their proton pack automatically over the course of the game, and by finding enough scanner entries they can increase their health.", "platform": "Sony PSP", "release_date": "October 30, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "A.C.R.O.N.Y.M. Games", "publishers": "Atari Interactive", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.93", "wikipedia": "https://en.wikipedia.org/wiki/Ghostbusters:_The_Video_Game", "video_link": "https://www.youtube.com/watch?v=0M1DFujoyB4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18768-ghostbusters-the-video-game\n"}