{"altername_name": ["合金装备: 和平行者"], "name": "Metal Gear Solid: Peace Walker", "overview": "After the events of Metal Gear Solid 3, Snake isolates himself from the United States and sets up home in Colombia. Here, he creates Militaires Sans Frontières, a private military group that provides support for countries in need. One day, Snake is introduced to Ramón Gálvez, a peace teacher, and his student, Paz Ortega. The two want to ask for Militaires Sans Frontières hand in helping the country of Costa Rica. Recently, an unknown armed force with high-tech weapons has been creating trouble around the country and because Costa Rica's constitution forbids a military army, there's nothing anybody can do about it. Snake at first refuses to help, believing that it may cause more tension in Latin America, but after listening to one of Gálvez's cassette tapes, Snake faintly hears a voice similar to the one from The Boss in the recording. Believing that The Boss could still be alive, Snake agrees on Gálvez's offering. Then, Snake sets out on a journey, a journey to not only bring peace back to the land of Costa Rica, but also bring peace upon himself. Near the start of the game you will be given a central mother base to use for a number of different things. It is here where you can save your game, develop weapons, and play story or side missions. Developing and upgrading weapons is done by spending currency known as GMP, which you obtain doing missions. At Mother Base you will be able to assign your MSF staff into different teams depending on their abilities and skills. Putting the right people in the right place will open up more opportunities to develop more items and weapons. Metal Gear Solid: Peace Walker's story will explain the events which lead to Militaires Sans Frontières becoming Outer Heaven in later games, and Snake finally accepting his role as Big Boss.", "platform": "Sony PSP", "release_date": "June 8, 2010", "game_type": "Released", "esrb": "T - Teen", "developers": "Kojima Productions", "publishers": "Konami", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "4.47", "wikipedia": "https://en.wikipedia.org/wiki/Metal_Gear_Solid:_Peace_Walker", "video_link": "http://www.youtube.com/watch?v=mlpH_I4DTLk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/3711-metal-gear-solid-peace-walker\n"}