{"altername_name": ["Prinny: Ore ga Shujinkou de Iinsuka?", "プリニー ～オレが主人公でイイんスか?～", "普利尼: 俺当主角行吗"], "name": "Prinny: Can I Really Be the Hero?", "overview": "As a Prinny, one of the lovable, knife-wielding penguins from the Disgaea series, you have been given the task of searching the netherworld for your master Etna's stolen dessert. A nearly impossible task, due to the numerous demons which populate the netherworld, their quest is made all the more difficult by the Prinny tendency to explode when thrown. Fortunately, Etna has given one of her Prinnies an enchanted scarf which disables their explosive trait. If this Prinny should fall, the next Prinny in line must take the scarf and continue... A side-scroller, with an occasional 3D perspective (while air attacking), Prinny: Can I Really Be the Hero? gives you 1000 lives to begin this noticeably challenging quest. The Prinny has the standard jump, attack, and leaping attack moves, as well as a number of other maneuvers. Your Prinny can pirouette (spin) along the ground for momentary invincibility, sprint for short distances, jump then slam downward onto foes with a \"hip pound\" attack, hang onto ledges, and even pick up enemies or explosives and throw them. Occasionally, the player will come across vehicles, such as tanks, which the Prinny can use for limited periods of time. Between levels you can interact with Etna, several of the Prinnies, and a few other characters at the castle. These characters further the story, give hints, and allow for save functionality. Additionally, players may access in-game replays here, which can be saved after various events. These replays can be transfered to other PSP systems, so that your friends can watch you in action. Prinny: Can I Really Be the Hero contains two difficulty settings, a standard mode where you die after three hits, and \"Hell mode\" where it only takes one hit to perish.", "platform": "Sony PSP", "release_date": "February 17, 2009", "game_type": "Released", "esrb": "T - Teen", "developers": "Nippon Ichi Software", "publishers": "NIS America", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.62", "wikipedia": "https://en.wikipedia.org/wiki/Prinny:_Can_I_Really_Be_the_Hero%3F", "video_link": "https://www.youtube.com/watch?v=1-hwiuXy7hI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13595-prinny-can-i-really-be-the-hero\n"}