{"altername_name": ["Der Herr der Ringe: Taktiken", "El Señor de los Anillos: Tacticas", "Signore degli Anelli, Il: Tactics"], "name": "The Lord of the Rings: Tactics", "overview": "The Lord of the Rings: Tactics is a completely original strategy game set in Tolkien's Middle-Earth. Players experience the entire trilogy, from the earliest battle at Weathertop to the final conclusion at Minas Tirith and Mordor. Unlike other tactics games, which are strictly straightforward turn-based affairs, The Lord of the Rings: Tactics innovates in its system. Players assign their moves simultaneously with the AI, and then all the actions unfold. In this way, players must guess their opponent's intentions and try to block them before they actually happen. This keeps the action moving much faster than a traditional tactics game. The game features over 24 levels and includes the vast majority of characters from the films, such as Aragorn and Gandalf, the hobbits, as well as key villains such as Saruman and the Balrog. Players can choose between good and evil campaigns, so the entire game can be experienced from each of their perspectives. Characters can level up, gain abilities, and purchase equipment between levels, reminiscent of EA's The Third Age game. Since the battles are mostly small skirmishes, your characters' attributes and abilities (or lack thereof) can easily swing battles. Finally, the game also offers a multiplayer skirmish mode for up to four players. Players purchase units and allies using a flexible point system, choose a battle location, and try to take out each other's teams.", "platform": "Sony PSP", "release_date": "November 8, 2005", "game_type": "Released", "esrb": "T - Teen", "developers": "Amaze Entertainment", "publishers": "Electronic Arts", "genres": "Role-Playing", "max_players": "4", "cooperative": "No", "rating": "3.14", "wikipedia": "https://en.wikipedia.org/wiki/The_Lord_of_the_Rings:_Tactics", "video_link": "https://www.youtube.com/watch?v=8_jolMrZb7c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14006-the-lord-of-the-rings-tactics\n"}