{"altername_name": ["Disaster Report 3", "The Desperate City 3: Damaged Town and Her Song", "Disaster Report 3: A Fading City and Her Song"], "name": "Zettai Zetsumei Toshi 3: Kowareyuku Machi to Kanojo no Uta", "overview": "Players can choose to play as a boy (Naoki Kōsaka) or a girl (Rina Makimura), both of whom start the game trapped in a bus an underground tunnel after a large earthquake. Survivors the player can encounter include Saki Honjō, a nurse turned amateur musician, and Ayami Hazuki, a high school girl. The two player characters have slightly different attributes, which affect gameplay: Naoki is physically strong and self-confident, but becomes stressed more easily, while Rina is physically weak but has a calmer personality, which causes her stress levels to rise more slowly. During Zettai Zetsumei Toshi 3, the thirst and body temperature meter has been replaced by a stress meter. The meter rises after engaging in angry conversations and witnessing/experiencing various traumatic incidents. The player can choose from several responses during conversations, allowing them to choose how to behave towards fellow survivors. These responses allow the player to control the character's personality, and also have occasional effects on the character, such as lowering or raising their stress levels. High stress will affect the character's movements, causing them to have trouble walking. The character's health meter will drop during hazardous situations, such as touching fire or remaining in the vicinity of a gas leak. The character's status bars can be replenished or reduced by consuming food and medicine, or completely restored by resting on a bench, which also allows the player to save the game. A number of different outfits and compasses can be collected during the game. 2-4 players can play cooperatively via ad hoc connection, unlike the first two games, which were only single player.", "platform": "Sony PSP", "release_date": "April 23, 2009", "game_type": "Released", "esrb": "Not Rated", "developers": "Irem", "publishers": "Irem", "genres": "Action", "max_players": "1", "cooperative": "Yes", "rating": "3.6", "wikipedia": "https://en.wikipedia.org/wiki/Zettai_Zetsumei_Toshi_3:_Kowareyuku_Machi_to_Kanojo_no_Uta", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43137-zettai-zetsumei-toshi-3-kowareyuku-machi-to-kanojo-no-uta\n"}