{"name": "2 Games In 1: The SpongeBob SquarePants Movie + SpongeBob SquarePants and Friends in Freeze Frame Frenzy", "overview": "Nicktoons: Freeze Frame Frenzy is a side-scrolling picture-taking game involving characters from various Nickelodeon cartoons such as The Fairly OddParents, Spongebob Squarepants, Danny Phantom, and Rocket Power. An unknown antagonist has begun scrambling the different universes of the Nicktoons, characters being flung into each other's worlds as robotic copies try to integrate into their societies during the chaos. Assuming the role of one of the main characters from the represented franchises, players are instructed by Jimmy Neutron to head to the worlds of the Nicktoons and use a specially designed camera to return characters to their home dimensions while also finding and defeating the robot doppelgangers. Players are able to move their chosen character around a set walking area to avoid hazards and get better angles for their free-moving camera cursor. Taking pictures of objects in the environment can reveal characters, and many characters require repeated snapshots to perform actions or return to their home dimension. Each level has a score threshold that needs to be beaten by taking pictures of characters and interesting sights, with many smaller side objectives like photographing a specific interaction between characters providing point bonuses if they're completed. Boss fights also cap off each world where players must survive attacks and snap three good shots of the robot duplicates. In Spongebob Squarepants Movie someone has stolen King Neptune's crown, and Mr. Krabs is the main suspect. Despite having been passed over for a promotion by Mr. Krabs, SpongeBob and his faithful (but dimwitted) friend Patrick volunteer to make the perilous journey to Shell City to retrieve the crown and save Mr. Krabs' life. Play as SpongeBob or Patrick as they interact with characters from the movie, earn \"manliness\" points to gain power-ups, and explore vast environments in the \"Patty Wagon.\"", "platform": "Nintendo Game Boy Advance", "release_date": "October 21, 2005", "game_type": "Released", "esrb": "", "developers": "Altron Corporation", "publishers": "THQ Inc.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122817\n"}