{"name": "2 Games in 1: Cartoon Network Block Party / Cartoon Network Speedway", "overview": "This double pack has two Cartoon Network GBA games combined on one cartridge: Cartoon Network Block Party: Cartoon Network Block Party is a party game that keeps the game play fast and fun on the Game Boy Advance. Play as any of 6 characters from your favorite Cartoon Network cartoon properties: Johnny Bravo, Courage the Cowardly Dog, Cow and Chicken and Ed, Edd n Eddy. Challenge up to 3 friends on 4 colorful themed boards, each styled after Cartoon Network shows: Planet Johnnywood, Katz's Creepy Castle, The Tater Farm and Extreme Cul-De-Sac. Master 14 unique mini-games that challenge all of your skills: Riding Mower Grand Prix, Waterbomb Catch, Fish Frenzy, Backyard Boogie, Strike a Pose, Greased Porkbutt Catch, Fence Sitters, Weremole Waltz and many more. Cash mini-games reward players with money so they can pay for a competitive advantage or access passes to other areas of the board. Cartoon Network Speedway: It's time for the Cartoon Network Racing Championship! Players can pick their character, and race for the finish line. Cartoon Network Speedway is a racing game with plentiful power-ups, shortcuts, and unlockables. It includes a quick race (just a simple race of 1-5 laps), challenge (beat the star rating), championship (beat all the races), and two-player mode. The twist to this game is that it's not enough to come in first, but the player also has to be stylish. The star rating is used to unlock characters, tracks, and power-ups, and is increased by passing opponents, attacking opponents, collecting stars, setting records, and so on. Twelve tracks and characters are included, most locked at the beginning. 20 different power-ups can be found, for attacks, road hazards, speed, and odder effects.", "platform": "Nintendo Game Boy Advance", "release_date": "April 1, 2005", "game_type": "Released", "esrb": "E - Everyone", "developers": "DC Studios", "publishers": "Majesco Entertainment Company", "genres": "Adventure", "max_players": "4", "cooperative": "No", "rating": "3.55", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43751\n"}