{"name": "2 in 1: V-Rally 3 + Stuntman", "overview": "V-Rally 3 for the Game Boy Advance adapts the console game of the same name to the handheld platform, offering its own selection of cars, tracks, modes and a platform-appropriate graphics engine. The main game mode is V-Rally Mode. It takes players through a rally championship over seven different countries, with each country's course consisting of distinct stages. Stages are taken on in groups of two, allowing for changing of car setup and repairs after every pair. Car setup options include a choice of tires (appropriate to road and weather conditions) as well as suspension, steering, brakes and gearbox. Bumping into the roadside during a race damages the car, with body, suspension, brakes, steering and turbos getting individual damage ratings. The repairs must be possible to be carried out within a time window or there is no choice but to drive on with the damage. The game's second major mode is called V-Rally Cross and offers traditional circuit racing on five different tracks. Only one is available from the start, the others have to be unlocked by winning on the earlier tracks. Races are against three opponents and consist of two rounds of three laps each, one in forward, one in reverse direction. Performing well in the first round fills a boost meter that can be utilized in the second. Time Trial mode allows single runs utilizing cars and tracks unlocked in the other modes. Multiplayer is available via the link cable and offers two-player versions of V-Rally Cross and Time Trial. You play a stuntman who has the task of completing some difficult and challenging stunts for a film director. Get it right and he'll ask you on for another project, and pay you big time. Get it wrong, and it's time for a career change. Apart from the Movie Making mode, Precision Tests will have you completing courses of varying difficulty, where you'll have to drive forward and reverse, launch off of jumps, dodge through posts and then park inside a zone before time runs out. In Jump Tests, you'll be out to grab letters while jumping off of platforms to catch them while airborne. You can also play against a friend in the various multiplayer modes to see who has the best control over their car.", "platform": "Nintendo Game Boy Advance", "release_date": "June 23, 2005", "game_type": "Released", "esrb": "", "developers": "Velez & Dubail", "publishers": "Atari Europe S.A.S.U.", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3.05", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122829\n"}