{"name": "Crash & Spyro SuperPack Volume 1: Crash N-Tranced and Spyro: Season of Ice", "overview": "Crash Bandicoot 2: N-Tranced remains faithful to its predecessors, comprising dozens of into-the-screen, out-of-the-screen and side-scrolling levels. Crash has developed a couple of new-found abilities this time around including a new rocket-jump and a super-slide. Gameplay is largely the same as other Crash platformers - run, jump, kill enemies, collect apples and smash as many of those crates as you can. There are 40 levels in this outing and an additional three types of crates to expand gameplay that little bit further. The game world is especially varied this time around. The old beach location makes a welcome return, but Crash's adventures will also take him across ruins, caves, Egyptian skylines and even through space. It's a bandicoot-eat-bandicoot world out there - and a mighty playable one at that. In Season of Ice, Spyro and his friends, Hunter and Sparx, are all looking forward to a hard-earned, uninterrupted holiday at Dragon Shores. Some hope! Meanwhile, a lowly Rhynoc spell librarian sees his chance for that career change he's always wanted. Discovering a transforming spell in the Sorceress' magic library, he quickly recites it, turning his slight frame into a huge mass of brawn and brains. Unfortunately - and hilariously for the gamer - the book was upside-down as he read the spell. Grendoc now has two heads, and what's more, two blinding headaches! In typical supernatural style, the only known cure calls for the wings of 100 fairies. He captures Spyro's close pal Zoe, and starts to freeze fairies throughout the Fairylands, sending his Rhynoc associates to collect the frozen fairies. With the last bit of sparkle she can muster, Zoe sends a magic balloon to Spyro for help. So much for the peaceful holiday plans!", "platform": "Nintendo Game Boy Advance", "release_date": "June 22, 2005", "game_type": "Released", "esrb": "", "developers": "Digital Eclipse", "publishers": "Vivendi Universal Games, Inc.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.23", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122831\n"}