{"name": "Digimon Escape from Server Island", "overview": "Explore Server Island: A whole new map to explore, filled with all new characters, with unique dialogue, and all-new side missions! Discover new items, puzzle through new mazes, and unfold multiple layers of story and lore... Discover New Monsters: There are 164 unique Digimon, each with their own Signature Move. Digivolve and De-Digivolve your 'Mon through a Digivolution Web to add to their move set. Befriend new 'Mon and complete your Digidex by using rare Evolution Gems to transform your monster into any other monster! Each Digimon has a Tribe, as well as a Type, which you must master and understand in order to exploit with an attack's attribute. Battle in New Ways: With 164 brand-new moves, balanced in a brand-new manner, you'll be able to craft a playstyle unique to your team. Because the world of Digimon is based on raising monsters rather than catching them, improving your battle effectiveness is a matter of cultivating specific strengths and managing inevitable weaknesses among your small group of digital friends. As you battle your way across Server Island, you'll run into many familiar YouTube and Hollywood personalities, who are playing the game you yourself are trapped within. To them, it's just a game to play and review. But to you, it's a desperate battle to escape the Digital World and return home! Extremely Detailed Support: The download file includes not only the IPS patch, but also a detailed README file, and a Prima-Style Strategy Guide! In the README file you'll find a list of known issues and bugs, as well as recommended emulators listed by platform. The Strategy Guide, directly modelled after the Prima Guide for Pokémon Emerald, has an indexed and searchable list of all Digimon, learnable moves, abilities, Digivolutions, and Type/Tribe/Attribute-effectiveness chart! The creator is also directly available through multiple channels of communication, and is ready to respond to any and all questions.", "platform": "Nintendo Game Boy Advance", "release_date": "March 6, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Bijhan", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://youtu.be/VM3q-sYlBQY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123899\n"}