{"name": "Dragon Quest Monsters: Caravan Heart", "overview": "Following in the footsteps of the media phenomenon Pokémon, Dragon Quest Monsters lets players travel a fantasy world on a quest to capture monsters and train them in battles against other creatures. An aspect integral to the Monsters series from the start is the breeding or merging of monsters to create stronger offspring inheriting the parents' skill sets. Only released in Japan, Dragon Quest Monsters: Caravan Heart puts players once again in the role of prince Kiefer from Dragon Quest / Dragon Warrior VII. Like previous Dragon Quest Monsters games for the GameBoy Color whose plot took place before Dragon Quest VI, Caravan Heart is set before the events of the main series' part from which it was spun off. Hiding from the consequences of one of his infamous pranks again, young Kiefer is whisked away by the goddess Rubiss, known from Dragon Quest II and III, to the land of Alefgard. There he meets the boy Lewin whose parents have fallen ill. To cure them with the 'Ball of Roto' artefact and secure his passage home, Kiefer takes the lead of a monster caravan travelling through the country. The monster caravan, made up of the Dragon Quest series' iconic covered wagons, acts as players' mobile base from which they plan their monster hunts. Travelling with it consumes food rations, one of the game's resources. Unlike in the first Dragon Quest games, Kiefer can recruit monsters as well as human protagonists into his party which can take on various jobs. The monster breeding from previous titles was replaced by merging monsters, requiring the game's other resource, monster hearts.", "platform": "Nintendo Game Boy Advance", "release_date": "March 29, 2003", "game_type": "Released", "esrb": "Not Rated", "developers": "TOSE", "publishers": "Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.14", "wikipedia": "https://en.wikipedia.org/wiki/Dragon_Quest_Monsters:_Caravan_Heart", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18477\n"}