{"name": "Dune: Ornithopter Assault", "overview": "Frank Herbert’s Dune: Ornithopter Assault is a cancelled flying / shooter game made by Soft Brigade that was going to be published on the Gameboy Advance by Cryo Interactive. Development of the game started in 2001, but in summer 2002 the project was shelved, even if it was basically finished (all the missions are completable), before submission to Nintendo due to Cryo’s financial difficulties. ---------- Trained by Gurney Alleck, the most efficient and honoured officer of the House of Atreides, you are going to become a specialist in piloting and fighting ornithopters. Involved in all-out war for the spice, you must surpass all of your flying skill to survive the fall of the House of Atreides and help Paul and the Fremen in their fight for Arrakis. - Spectacular 3D Universe on Advanced Game Boy, seen from the cockpit of the ornithopter. - More than 20 different missions with various objectives simple recounting, escort duties, guarding, destroying troops and buildings, capturing vehicles, collecting spice and water, etc. - 5 solo and multiple player modes (using 2 cable linked Advanced Game Boy) with various levels of difficulty solo mission, campaign, joint campaign and deathmatch. - The first adaptation of Dune, the most famous of all science fiction universes, on hand held console. ---------- A quote from the Developer (found in YouTube comment section): \"Hello! I never imagined I could see this game on YouTube :) I just wanted to show some picture from the NET and found out this gem! I share you a short story about this project. - - - The game created by Soft Brigade in 2002 - a small team from Hungary/Budapest. We had a very talented programmer VZ (Zoltan) - who implemented his voxel engine with lots of assembly code behind C code. (He worked on Nexus the Jupiter incident and other stuff - but later he left the game industry and worked on medical CT systems). Nintendo not shared every feature with third party developers at that time to make them equal advantage. He started to reverse engineering the DS and succeeded :D The other interesting story that the official Nintendo compiler made slower and bigger code than the ARM compiler (DS had an ARM chip architecture) but for game release Nintendo didn't allow any other compiler to be used...(maybe for safety reasons - they have checked every third party code before release). We had only 4MB cartridge space for the whole game (code, music, sound, menu, game, graphics, etc.) because Cryo - the publisher - wanted the cheapest solution for the release. We used every trick to fit in (palettes, 4 bit instead of 8 bit etc. .... and most places were taken by the intro :D) We all liked XWing series / Freespace and we wanted lots of different missions in this game too. Transport the spice collector / search for spice in the desert - red spot / defend the collectors from the worms and enemies - fight or transport / rescue people / patrol area / follow convoy / attack enemy base enemy convoy, etc. We had one more programmer. He was a Bulgarian youngling Peter M who started help to VZ in the last 4 month - he made the gameplay/missions code and helped the menu system but most of the code was VZ. We had an agile project manager Peter W - he also made the music, sound fx and mission briefings for the game - and his friend who was a fluent English translator to helped us to translate everything. Rack - he came from a Magic 12 demo team - was officially the art director but he left the creativity to me :) he worked on font, HUD elements and he also made the code menu screen. I worked on the visual - voxel terrain, sprites, animated effects, figures, worm and the menu backgrounds, intro, briefing guy. I read the books in my childhood and i wanted a different style from the movie - less baroque/fragile and more \"blocky\" sci-fi. The ship and building sprites was rendered in 3D - 360 degree with 3 different angle - a bit top, full side and a bit bottom to make possible the feeling of altitude movement. (I'm alone who still in the game industry :/ ) Every animation was coded. We had only 6 month from scratch and finished everything in time! We were ready for the release..... Cryo payed us in monthly milestones but we didn't get the last two payouts because Cryo bankrupt. They silenced and we didn't know what happened. A few weeks later Peter found out the truth from the net! That was October. Due to the protracted bankruptcy proceedings, the american publisher finally withdrew from the contract because it would not have been able to publish the game that year. The Dune license has expired in that year and should have been renewed for the following year. For a little game it would have been very expensive. --- We tried found other publisher and started to make some other demo with this engine - a military chopper game like Comanche, a speedboat game with reflected water! in voxel environment, and a car game... the time was short and the luck was run out...and our small company closed down.\" -KugleeKuglee", "platform": "Nintendo Game Boy Advance", "release_date": "2002", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Soft Brigade", "publishers": "Cryo", "genres": "Flight Simulator", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=qwXEew58wV4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125410\n"}