{"name": "Fire Emblem: Vision Quest", "overview": "The continent of Yaska is home to six nations, but the largest and most powerful is Nevan, an Empire composed of states that swear allegiance to the Emperor. In the rural state of Belaro, Lord Gradin, head of state, imposes cruel taxes on the people and jails those that cannot pay. A young farmer, Storch, along with his hometown friends, fear the worst. Seeking to protect themselves and their families, they look to procure funds through less than savory means. Conflicted, the group begins their plunge into banditry in hopes for a better tomorrow. Hack Features & Details • Story set on a new continent, Yaska. • 41 chapters • 62 playable characters • Concept I’m calling ‘inverse branched promotions’ (ie There’s an unpromoted Axe Fighter and Bow Fighter class, then they promote into Warrior and gain the weapon they couldn’t use unpromoted.) • Custom weapons (and rehashes of Kaga-era weapons) • Early game Warp & Rescue. • Generic female enemies. • Armor knights with 5 move. (because I want you to use them) • Pared down skills to give units a niche without making anything wonky • Each class gets a skill at level 15 unpromoted, mono-weapon infantry get a crit bonus at level 5 promoted. Thieves come with steal/cunning and rogues get Steal+ at lvl 5. • Universal promotion items • Stronger bows (and no 1 range BS). • Fog of War • FE5 style trading • New (and old) tracks • Escape maps with spooky bosses. • Tellius style supports • Convoy Combine feature - can merge used items into a single item.", "platform": "Nintendo Game Boy Advance", "release_date": "May 24, 2021", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Pandan", "publishers": "Pandan", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160527\n"}