{"name": "MarioMon", "overview": "Story (Not yet implemented): Professor E-gad has developed a new technology for enslaving the various monsters of the Mushroom Kingdom. Using Mario as his spokesperson, he advertises this technology to the humanoid denizens of the Mushroom Kingdom as their cure to the constant invasions by Bowser and as a way for them to secure everlasting peace in their kingdom. Needless to say, the minions of the Mushroom World are in a panic as more and more of them are being enslaved and brainwashed away from the rule of their great King Bowser. Seeing the horrors of this new technology, Bowser breaks into E-gad's lair in order to liberate some of his loyal minions. However, Mario steps in just in time to stop Bowser from saving all of his minions. Wanting to add insult to injury, Mario decides to defeat Bowser with one of the very minions who once served him so loyally. Horrified by this, Bowser runs away, seeking a cure to the brainwashing effects of E-gad's twisted technology, and to attempt to liberate the trapped souls of the monsters. You'll play as Mario who will travel in an attempt to stop the \"evils\" of Bowser, attempting to save his comrades, and secure an everlasting peace for the denizens of the Mushroom Kingdom. Features: • 150 all new MarioMon, including sprites, evolution's, and attacks. • MUCH more balanced game play, with each fully evolved MarioMon roughly equalling each other in total stats. • Quality of life edits, such as removing the blackout in Rock Tunnel and the removal of the trainer that teaches you how to catch Pokémon. • Minor environmental and scripting hacks.", "platform": "Nintendo Game Boy Advance", "release_date": "2011", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://youtu.be/ZMUwvu7RvJ4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122289\n"}