{"name": "Mega Man Battle Network 7: Lost Dimension", "overview": "Story: The Year is 20XX. Advanced technology connects the world's nations via the Net. In an age where networks control each kind of device, NetCrime is the only cost of convenience, But the world has been at peace thanks to Lan Hikari and his trusted partner Megaman! Two Years after the events of Battle Network 6, The time has come for the World Net-Battle Tournament! But as Lan and Megaman prepare for this tournament, they come upon yet another threat. Deep within the depths of the Undernet, lies the Lost Dimension... This is the dreaded realm where the data of the deleted are sent... All of Megaman's past enemies lie in the Lost Dimension, trapped for eternity as junk data. Trouble looms in the distance as a rogue Navi named BASS meets a mysterious and sinister Navi, who plans to open the doors of the lost dimension. This mysterious Navi promises Bass the power to defeat MegaMan and become invincible. Upon unlocking the doors to the Lost Dimension, all the evil navis and bosses Megaman has encountered in the past has been revived. Terrifying forces such as Life Virus, Gospel, Alpha, Duo, Nebula, Cybeast Falzar, and Cybeast Gregar have all been unleashed into the Net. One by one, Bass will hunt down these enemies and fuse with them, to achieve an apocalyptic form; one that is strong enough to bring the internet to reality. But there is a stronger force at play. When the doors were unlocked, what also came out was the first virus ever to be discovered. Scientists deleted this virus when the internet was first created, and now it has returned; even stronger due to its ability to absorb the energy of deleted data. The presence of this virus will cause the human world to stop in time and converge with the Net. Now Lan and Megaman have to find a way to obtain the power to stop this virus, thwart BASS's plans for ultimate power, and succeed in becoming the world's best in the World Net-Battle Tournament! Ready for a New Adventure? Well then, JACK-IN! Megaman.EXE EXECUTE! Features: • Play as Megaman, and later recruit Protoman and other characters on to your team! • Brand New story! A fresh feeling of nostalgia and excitement for Megaman fans as well as a new experience for Pokémon fans! • Explore the vast Net as well as materialize into the Real World! Megaman uses COPYBOT technology from Battle Network 6! • Fresh and new gameplay experience, Net Battle using the Pokémon battle system! • Unique sprites and areas! The tiles will give you the feeling of being immersed within the world of Megaman! • Meet, battle, and venture with old characters such as Protoman, Roll, Gutsman, etc. as well as new characters and Navis! • Introducing Megaman's CORE FUSION: Megaman can evolve and fuse with his past enemies by using their CORE DATA, and this transformation will give Megaman a new appearance, boosted stats and abilities, new typing, and the chance to learn certain moves only obtainable through that fusion. Megaman can also devolve using an item and revert back to his original form! (Megaman can fuse with Protoman, Life Virus, Nebula Gray, GigaGregar (Megavirus fusion of Gospel and Cybeast Gregar), and Bass) • TM's are now Battle Chips (BC)! Collect and use all 50! • New and renamed moves with different typing and stats such as Mega Buster, Sword, Life Sword, Pyro Fist, Barrier, etc. • New Title Screen (Possibly in the future Megaman Game music) And other neat features that you can discover while playing the game!", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "DARKMIDNIGHTNOVA", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=9vmKSRzwjrY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123243\n"}