{"name": "Pokémon Dark Rising II", "overview": "STORY: The sequel to Dark Rising 1. This hack continues the story of you trying to rescue your father, releasing Arceus from it's sealed chamber, and defeating the dark entity known as Darugis. The Adventure Continues... You, the player, wake up from a sudden dream you had in the region known as Core, where you live. In the dream, a Pokemon told you of a dark force that has begun its reawakening & asks for your aid in stopping it from causing chaos upon the world. You soon discovered that your best friend also had the same dream as well. After helping your town's professor, you set out on your own adventure paired with your Dragon-Type Pokemon with many unanswered questions in your mind. What is Darugis, the dark force the Pokemon spoke of? Along your journey, you discover Darugis can control the minds of people and Pokemon alike. You meet a man named V, who was a former assistant of your father, who Darugis now has captured along with the Pokemon from your dream. As your journey continued, you met many enemies, some who became rivals, and even friends. Sydney, a young woman who watched Darugis' reawakening cause the death of her family and her village. Dray, a strong-willed Pokemon trainer who's father assisted your father in defeating Darugis years ago. And Florina, another strong trainer with a genius mind when it comes to technology. Together, along with your childhood friend, Pete, as well as assistance from a once enemy, Kayo, defeated Adrian, the champion of the Omni Region who happened to be one of Darugis' main puppets. Though this time, you've grown to become a very strong Pokemon trainer, even battling the likes of Ash Ketchum himself, the world's greatest trainer. You've also gained the ability to connect and bond with Legendary Pokemon. As some questions became clear with answers, more begin to grow in your mind. For example, what is the true connection between the 3 Chosen Ones? You have the power to Bond and communicate with Pokemon. A young man known as Light has the power to create Pokemon through energy. And your best friend, the 3rd Chosen One, what is his ability? There's still so much unanswered... Now, You and the rest of your friends(Team Dark Rising) have set off to the Omni Region in search of Darugis & saving your father. Three days have passed since the events at Malice Castle...The team has changed their gear and left all traces of events within the Core Region behind them, including their Pokemon(Except their Dragons). What awaits you & the Team at the Omni Region? Is there an even bigger threat than Darugis being formed? FEATURES: • Day/Night System • Physical/Special Split • Pokemon from Every Generation (1st-6th) • Even more New Moves. Including Grass Knot, Stone Edge, Earth Power, Scald, Flare Blitz, and more. • Hidden Abilities. Including Drought Vulpix, Drizzle Politoed, Speed Boost Torchic, and more. • Completely redone learned moves for every Pokemon in the hack. All Pokemon will learn their best egg moves & move tutor attacks by level up instead of breeding & teaching it to them for a price. Including Dragon Dance Tyranitar/Tyrantrum, Stealth Rock/Spikes/Leech Seed Ferrothorn, Ice Punch/Fire Punch Electivire, and more. • 12 Gym Leaders • Attacks that had their power changed in 6th gen will be changed in this hack as well. For example, Flamethrower/Thunderbolt/Ice Beam/Surf are now Base 90, instead of 95. (Hidden Power will remain the same as it did before 6th gen.) • New Original Music custom designed just for this hack. • All of the original Grass/Water/Fire Starters from Gen 1-5 will be available in specific areas in the hack with a 1% or 2% chance of them appearing. • Choose your Dragon Starter from Dark Rising 1 in it's final evolution as your first Pokemon or choose from the other two if you want to switch up this time around. (In other words, Dragonite/Salamence/Garchomp are the Starters)", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "DarkRisingGirl", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "https://youtu.be/sBT5aL4mFIs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78800\n"}