{"name": "Pokémon Emerald Enhanced", "overview": "Emerald Enhanced is currently a BETA game; it is updated weekly. Main Features: More Starters!: New! We now have 7 starters options, up from 3. The options are: Vulpix, Beldum, Mareep, Ralts, Spinarak, Gastly and Tentacool. They have been mostly modified and can hold up their own. Hardcore Difficulty: New! You cannot use Pokecenter but you still can use Marts. However, money gained has been reduced to 15%. Fainted Pokémon disappear from your party, EXP gain is vanilla and you deal 20% less damage while your opponent deals 20% more damage. Further Battle customization: New! EE now has customized abilities, IVs and Hidden Power for trainer battles and battle frontier. It's a feature unique to EE. Follower System: New! Followers will help you in battles against the E4 and in Title Defense when they are following you. The current followers are Shelly, Lanette and a new NPC, Minnie. You can dismiss them anytime, talk with them to do so. Followers can sometimes get a bit misaligned, to fix it open the Start Menu and press left or right. This should reset their location to behind you. Poké Ball Changer: New! You can now change the Poké Ball your Pokémon is currently held in by talking to the Ball Changer NPC. She's located in the Lilycove Department Store on the 5th Floor. To change Balls you need to pay 10.000 Pokédollars and have at least one of the corresponding balls. Autoscaling Trainers & Wild Encounters: New! Wild Pokémon encounters and Trainers now scale to the number of badges you own! Please note that they scale differently, with different ranges. Elite 4 Rematch Parties: New! After beating the game for the first time, the game will default to the E4 rematch parties. Check them out! IV Perfecting: You can get an egg with perfect IV's and desired nature by utilizing the Genetic Code Mapping System. • You can consign up to 31 of a certain species to increase your Genetic Code Value(GCV). • You can use the GCV to generate an Egg of your saved species. The species you generate will have IV's equal to the GCV in each stat. • When you generate the pokemon, you will get to choose a nature. • The generated pokemon will be an Egg that you have to hatch. Visit the Space center to get started. It's the computer in the top left corner. Frontier Bank: This lets you deposit money so that you don't lose as much when you lose. Eventually, this will give you interest daily based on difficulty. Visit the NPC in the Battle Frontier pokemart to check out this new feature! 5 Modes of play: • Hard mode is how my game was before the v2.5 update. It's vanilla experience gain. • Normal mode scales your EXP to the number of gyms you have beaten. It goes up by 12.5% per badge. • Easy mode is 4x base experience, for people who want to get through the game quickly, and aren't confident enough for harder modes. • Nuzlocke mode is an even harder variant of my game, with enforced nuzlocke rules. • Hardcore mode uses special rules. No pokecenters, Marts can be used but it's more expensive. • You gain less money and gain the default vanilla exp value. You deal less damage while receiving more damage. Nuzlocke Mode: • Marts cannot be used. • Pokecenters can only be used three times. • Pokemon that faint will actually disappear from your party. • If you have an empty party, you fail the challenge. The game is switched to Normal mode. • Base experience is doubled, to offset the challenge of my game in nuzlocke mode. • You are given items and healed for free when you defeat a Gym leader. You only get the items once when you beat them for the first time. • The Waystone can only be used 3 times, but the charges get restored when you get a new badge. • The rules get lifted once you become the Champion Re-Fighting the Elite Four: When you fight them again, you will get teleported to an alternate Champion room after you've cleared the E4. While you're in here, you walk to the middle, like how you walk to your throne in US/UM. At which point a random challenger will approach you and challenge you for your title. There are currently 8 possible challengers, and more will be added over time until I reach 16. This is how the game stays once you've met the requirements. Note that the tile that actually teleports you has a small delay before it takes effect. Just walk slowly for the last few squares of the final hall before the champion room. Other notable features: • Forecaster, an item that allows you to set any weather you want. • Completely custom jukebox. Use L in the start menu to activate, R to skip tracks sequentially. The currently playing track number is displayed in the top left corner of the screen when the start menu is open. • Music on routes and in pokecenters is randomized on map load, so that you don't hear the same track for a long amount of time. • Remote access to the PC available when you complete a certain quest. • EXP Drive item that stores some exp earned in battle to be given to a specific mon later. Or toggle earning exp in battle. • Imprinter item, which replaces the broken functionality of EV Reduce berries. The consumable imprints you get reduce EVs to zero, rather than increments of 10. • Waystone item, which replaces the HM Fly functionality. The waystone gives you more locations you can teleport to, including each of the 7 Frontiers. The new pokemon added to the game are as follows: (more in progress!) Also complete with their proper cries! • Gallade • Roserade • Mismagius • Glaceon • Leafeon • Weavile • Froslass • Dusknoir • Rhyperior • Yanmega • Sylveon • Togekiss • Gliscor • Mamoswine • Electivire • Magnezone • Honchkrow • Porygon-Z • Crystal Onix New Game + New game + becomes available starting from the first time you visit the Hall Of Fame. • Only Pokemon in your PC Boxes are retained, including held items. • Unique key items are retained.(Imprinter, EXP Drive, Remote PC, Forecaster). • Dex progress is mostly retained, but only for the species that are in your boxes** at the time of New Game +. • When you start New Game+ you get to choose between Hard, Nuzlocke and Hardcore modes. (**Example: If you have a Kabutops that was a Kabuto, only the page for the Kabutops will remain.) Quest Lines: Currently available and completed quest Lines: (** denotes relationship quest line) • Devon: Corporate • Devon: Scientist • Team Aqua: Shelly** • Team Aqua: Archie • Lana** • Dawn/Brendan** (Your rival, based on which gender you use) • Lanette** Planned quests that haven't been started on yet: • Team Magma: Courtney** • Team Magma: Maxie Current Bugs: • Using some HM moves still shows your pokemon as if they were using the move sometimes. (Notably with Strength and Waterfall) About Emulation Compatibility: My game is a custom compiled version of emerald with major core code changes. My game will only work properly on emulators that are accurate to real GBA hardware, or the actual hardware with supported flashcarts. The only emulator I can confirm has 100% compatibility is mGBA.(Including the mGBA core for RetroArch) Hardware Compatibility: • Real GBA, GBA SP (Flashcart. Must have support for SRAM, flash 1mbit save file, RTC) • Real NDS/DS Lite (Flashcart. See above) • 3DS (Virtual Console, mGBA port, special flash carts) • Nintendo Switch port of the mGBA emulator. You need cfw on your switch to use this. • Presumably, if you can figure out how to inject it, Nintendo Switch Virtual Console as well. Other emulators can work, but with limited compatibility. The most common issue is black screen freezes when transitioning to and from battle, and between maps. These are not issues I can fix. Emulation accuracy is key here, and mGBA is the most accurate emulator available. Beta Menu to help with save compatibility How to use the Beta Menu: • Open Start Menu • Turn off Jukebox if you have it on by holding L and pressing R • Highlight 'Close' • Hold R and press A", "platform": "Nintendo Game Boy Advance", "release_date": "2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Ryuhouji", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://youtu.be/eLFrptFwje4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/121873\n"}