{"name": "Pokémon Hollow Mysteries", "overview": "The Ontak region was once a calm and lax natured region in the world of Pokémon. Ontak is often a forgotten region and has few memorable moments. But not all is well, the mountainous lands have succumb to terrors that were previously thought unimaginable. Ontak on the exterior may seem peaceful, but there is an underground war that is being fought in Ontak. The only thing that keeps the population of Ontak in complete denial of their detriment is that nothing is out of the ordinary on the surface. But in the Underworlds there are sinister plots at hand. On one stormy night a young trainer was born in the Southern Plateau and since that night there has never been rain on the Western Side of the Ontak region. Some believe that this is nothing more than circumstance but some have faith that this is a trainer with capabilities that have previously been unimaginable. The only thing that is certain is that this trainer has a clear goal in life. That goal is to be the very best like no-one ever was. 1) This game has removed the need for all HM's with the exception of Surf and Strength. Some of the other HM's are available but there is no requirement to use them. 2) Players are able travel quickly between towns that they have already visited using the \"World Map Warp\". To remove people who block the way players must do one of the following; beat the gym in that town, complete an event in that town or simply talk to the individual blocking the path. This has completely removed the need for the HM Fly which has been removed since it is unnecessary. Players can use this along with the maps that are provided in the zip files to get an idea of the Ontak region.", "platform": "Nintendo Game Boy Advance", "release_date": "August 2, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Freddy F1shf1nger", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=tiADsuAynjs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122161\n"}