{"name": "Pokémon Cobalt", "overview": "Cobalt is a ROM Hack of Pokémon Firered BPRE in English. Entei, Raikou and Suicune are part of a trio known as the legendary Beasts. The Beasts all possess items of great power; the Molten Garnet, the Arctic Lapis-Lazuli and the Charged Topaz. If brought together, the items will create an energy with the potential of reshaping continents; flattening mountains; evaporate oceans. Team Aura have set out to capture the Beasts, to harness this energy. Your brother won the Felith Pokémon League a few years ago. Now it's your turn to have an adventure in the world of Pokémon! After choosing either Treecko, Torchic or Mudkip, your adventure begins! Along the way, you'll investigate the shady Team Aura, venture to the Hoenn region, discover new Pokémon, win badges, go to a virtual world, battle trainers, and, at the end of it all, become a Pokémon Champion! What are you waiting for? Leap into the world of Felith in Pokémon Cobalt! Features (in Beta 1.4): • Sinnoh, Unova and Kalos Pokémon. Be prepared to encounter Pokémon such as Sylveon, Sandile, Riolu and more! • Updated mechanics. The Generation 4 physical / special / status split, updated moves and learn sets, the Fairy-type, Generation 4, 5 and 6 moves and more. • Hidden Grottoes. These hold rare Pokémon and items! • Gold Poké Balls. Try and collect them all for special prizes. • Access to Hoenn. Connected via Slateport City, your journey will take you through both Felith and Hoenn! • Rock Climb and Climbable Walls. HM05 Rock Climb requires no badge to be used, and allows access to secrets and rewards! Known bugs and oddities: • Saving does not work. You must use Save States. • Refrain from using Autofire A or any speed up options when taking part in the • Berryfall Bridge Juicing Contest. • The textbox that says \"the caught Pokémon was sent to the Box\" does not display. • Juices have no sprites yet. • Running when dressed in the Team Aura uniform will glitch the sprite. • Moves without their new animations simply use Pound's animation. • Camouflage is just bugged - it doesn't do what it's supposed to, it hurts the user, and sometimes misses! • The Move Relearner's interface shows a Fairy-type icon. • Some Pokémon still do not have updated sprites.", "platform": "Nintendo Game Boy Advance", "release_date": "2011", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Spherical Ice", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/6e7E4yZ7U7A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123387\n"}