{"name": "Pokémon Deneb", "overview": "IMPORTANT: This is a Japanese ROM Hacks and there is no English translation available at this time. • For help, questions, or bugs please head over to their Bulletin Board System (BBS) which may be found on the index of their Wiki. Features: • The Fairy-Type is now implemented, and some Fakemon now turn into Fairy types. • Some Pokemon are no longer Version Exclusive, some Deneb-Exclusive Pokemon become Procyon-Exclusives, and some Procyon-Exclusives become Deneb-Exclusives. • The boxes with question marks means the Pokemon isn't implemented at this time. • Wikkin now becomes a Grass/Fairy-Type rather than a Grass/Ghost-Type. • Because Aurostice is now an Ice/Fairy-Type, it's fiery counterpart becomes a Fire/Fighting-Type. • Peacoptic is now a Ghost-Type rather than a Psychic-Type. • Ptervus is now #123 & Pteriarch is now #124 in the Pokedex. • It is possible to get Smalmon & Trojalmon. (Only accessible via AdvanceMap due to the Super Rod being inaccessible.) • Some Pokemon used by trainers changes if you are playing Deneb or Procyon. • A few places appear to have references to other games. • Numerous stuff are now different compared to the beta. (Ex: The Pokedex now functions differently) • Numerous Sprites are now redesigned, even their backsprites got redesigned. (Ex: Skarmory's backsprite is now it's animated backsprite from the DS Pokemon games.) • Despite #029, #032, #313, and #314 are Version Exclusives, it is possible to get them in the opposite Version, happens by breeding, and has a 50% chance. (However, I'm not counting this.) • Some Pokemon that weren't Version Exclusive now become Version Exclusives. (Ex: Skarmory is in Procyon while Tropius is in Deneb.) • New places have been added, and some places got altered as well. • It now has a ridiculously great soundtrack. Contributors note: I have played and almost 100% beaten Both Deneb and Procyon. It's a lot of fun. I'm not fluent in Japanese, if there was ever a move I was not completely sure about I would use the scan/picture option on the Google Translate app when playing on my handheld. For PC emulation I swap between Virtaal, Microsoft Translator App for Windows 10, and QTranslate each excel in their own ways. I wouldn't let the language barrier Keep you away from these two, they are astounding, especially with how far technology has come for translating, you have options. GL;HF!", "platform": "Nintendo Game Boy Advance", "release_date": "April 1, 2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "( )", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://youtu.be/prpUFGtFr0M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123552\n"}