{"name": "Pokémon Unbound Battle Tower", "overview": "Introduction: As of now, there are two versions available for Pokemon Unbound. The first, a slightly older version, contains content up to just past the second Gym. If you are more of a casual Pokemon player, then this is the version I'd recommend for you. The second, a relatively newer version, showcases Unbound's new battle engine by granting unrestricted access to the Battle Frontier. This version was created in the format of a mobile game; meaning daily rewards, monthly distributions, and unlimited playtime. If you enjoy battling, then you'll find no shortage of things to do with the over 100 different possible battle combinations. With that being said, enjoy Pokemon Unbound! Story: Welcome to the Borrius Region, a region rich in history. Many years ago the Borrius region fought a brutal war with the Kalos region. The people of the Borrius region summoned a dark force to help them defeat their enemies; however the war ended in defeat when the king of the Kalos region unleashed the ultimate weapon. With the war over, the dark force was sealed away never to be used again. However, many years later, an organization known simply as “The Shadows” seems bent on releasing the dark force once again. It’s up to you to stop them and save the Borrius region from ultimate destruction. Features: ▲ Updated Graphics: All of the Fire Red graphics have been updated to Gen IV styled graphics. This includes tiles, overworlds, sprites and even battle backgrounds. ▲ Updated Pokémon: All Pokemon from Gens 1-7 will be available in the game. The Fairy type is also present in the game. They will all have updated movesets and abilities to closely resemble the ones found in USUM. New evolution methods have also been added in order to closely resemble how the Pokemon truly evolve. ▲ Updated Mechanics: General improvements to gameplay to enhance the player's experience such as the Physical/Special split and Mega Evolution, as well as a BW Repel system and X/Y capture experience, all provided by the Complete FireRed Upgrade. • Eggs Hatch at Level 1 • Day and Night System • Sideways Stairs • Running Indoors • Trainer Facing • BW2 Repel System • The Physical/Special Split • Mega Evolution • New HMs such as Rock Climb and Dive • Hidden Grottoes • Decapitalization • IVs and Natures Highlighted • XY Capture Experience System • Inverse Battles ▲ More Items: The game features new held items, in addition to the Gen IV Poke Balls, and over 100 reusable TMs. In order to compensate for the increased item amount, the bag has been replaced with a digital device capable of holding an infinite amount of items. ▲ New Music: Music from many different Pokemon games is present in Pokemon Unbound. This music ranges from HGSS and BW, all the way Pokemon Mystery Dungeon. ▲ Side Quests: Many optional quests are present in Borrius. These quests may yield great rewards or drastically change what can be found in the region.", "platform": "Nintendo Game Boy Advance", "release_date": "2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Skeli", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "https://youtu.be/pAblb6mOX_Y", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123415\n"}