{"name": "Pokémon Emerald Hard Edition", "overview": "Introduction: Welcome to Pokémon Emerald: Hard Edition, this is what I call a 'enhancement' of Pokémon Emerald, which is basically Pokémon Emerald, same story-line, same trainers, same gym leaders etc. but with a few added features, this is not to impress anyone but to simply make this game a little more challenging and fun, I personally made this for myself just as a challenge for me but I thought why not share it and see how others enjoy it. I am aware there are others like this, i.e Pokémon Emerald 386, but this game focuses on the difficulty concept rather than All 386 Pokémon being catch-able, hence the name. Bare in mind that this game is still at early stages so it has very few features but if it's gets positive feedback then I will proceed to add more features and make this enhancement better, this is really just a test, you may think that this is simple and that it only takes a couple of hours to edit the features I have created in this but editing EVERY trainers, Gym Leaders, Rivals, Grunts, Elite Fours Pokémon takes A LOT of time, effort, coordination and patience as you have to get it correct and set the reasonable levels for that certain area, I found myself working on this for 3, nearly 4 days which included A LOT of planning and preporation and I think I've put quite a lot of hard work into this so I hope you enjoy this as I have tried to make it as hard, but fun as possible! Features: • Increased Difficulty • Gym Leaders all have teams of six with ALOT higher levels! • Trainers difficulty and level increased, including ALL trainers in Hoenn, ALL Magma/Aqua Grunts, Admins & Leaders and your Rivals team is much more complex, that's right, no more having to put up with Mamga & Aqua grunts using the same Pokémon over & over! • Rematch trainers edited to a very high level. This means EVERY trainer & Gym Leader registared into the Pokénav, when you rebattle them, their teams will be ALOT stonger, and tougher! • Elite Four Team tweaked, every member has 6 Pokémon plus higher levels. • EVERY trainer has been edited, some with there original team, some with different Pokémon and harder Pokémon, this also includes Team Magma & Aqua grunts, Admins, Leaders and your rival. • 386 Pokémon obtainable in the grass areas, caves, water, all around Hoenn! • Evolutions changed, i.e Kadabra would normally evolve to Alakazam via trade but now Kadabra evovles to Alakazam at level 40. (See List on pokecommunity) • No more constant Poochyenas & Zubats battles for Team Magma & Aqua! • More features to come!", "platform": "Nintendo Game Boy Advance", "release_date": "2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "blue Gucci", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/UTVFejck5H0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123792\n"}