{"name": "Pokémon Aquamarine", "overview": "Story/Themes: Pokémon Aquamarine starts out with the player having a strange dream, where the local Professor, Professor Palm, tells him/her that they've turned into a Mew. A group of Scientists (Team Tactix) inspired by the Mewtwo event that occurred in the Kanto region 7 years ago are supposedly responsible for the sudden change. When the player wakes up, he/she finds out that they've actually turned into a Mew. It is then the player's goal to figure out how to return to their human body. The plotline diverges whether the player chose to be male or female. Features: • New Region based off South America • New Subregions based off Hawaii, Galapagos, and Antarctica • Starter is Eevee • New Story with a diverging plot depending on gender • Added Pokémon from Sinnoh, Unova, Kalos, and Alola • Added custom \"Fakemon\" • Customized Trainers • Increased overall trainer level • Added Fairy Type • Added Physical/Special Split • Added new moves • Decapitalized a ton of stuff • All 400 Pokémon in-game are obtainable • Trade Evolutions obtainable through Level-Up • All Eevee Evolutions obtainable through Evolutionary Stones It also comes in different colors! Pokémon Aquamarine is one out of nine variants of the same game, each corresponding with Eevee or one of its evolutions. There aren't many major differences between the variations, but the title screens are different, and the team your rival uses changes depending on the version. If you're unsure of which to play, I suggest going with your favorite! These variations include: Opal- Eevee Aquamarine- Vaporeon Topaz- Jolteon Garnet- Flareon Amethyst- Espeon Onyx- Umbreon Turquoise- Leafeon Quartz- Glaceon Zircon- Sylveon", "platform": "Nintendo Game Boy Advance", "release_date": "2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "AquamarineVaporeon", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://youtu.be/0ZlTSBofhSk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123282\n"}