{"name": "Pokémon Diabound", "overview": "Rom Info: Base Rom: Pokémon Fire Red 1.0 Language: English Story: You and your mother recently move to the Yogen region from Johto. Yogen is said to be a peaceful region, prosperous without problem. And it has been so during the last centuries. But something feels uneasy, something is about to happen. You moved to the small Town Fernspruce, there you met two other young boys and a professor, you make great friends with the boys. One day, the Professor ask you all if you'd like to receive a rare Pokémon, all of you were surprised to this sudden gift, of course nobody declines it, but why where you given the Pokémon? Is something brewing that none of you know, but the professor? Could he be scheming something? Nobody knows, play it and find out! Features: • New Moves 131 Moves from the 4 and 5th generation with full custom animations and effects. • New Abilities There are about 60 new abilities from Gens IV-VI • Updated Effects Abilities and moves have been updated to match the newer generations. • Physical/Special/Status Split Moves now have the PSS Split. • Fairy Type Fairy type is in the game. • New Region Explore the Yogen region and meet new friends, solve mysteries and become the new champion! • Nature colored stats A nature that increases a stat is colored red, while blue signifys a decreased stat. • Decapitalisation Most if not the whole game has been decapitalised. • BW 2 Repel System Will automatically ask you if you wan't to use another repel, if you have more than one. • Pokémarts sell based on badges Pokémarts will now sell you items based on what badge you have, the higher the better. • Minor features Running indoors, functional sideways stairs that gives you the feel of elevation, the player will face trainers before battle.", "platform": "Nintendo Game Boy Advance", "release_date": "February 14, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "-Piccolo-", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://youtu.be/G1vTaPNlAPs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123681\n"}