{"name": "Pokémon Cosmic Emerald", "overview": "Description: Alright, so this hack has been a long time in the making - having been worked on in little phases at a time, ever since I started learning about ROM hacking several years ago. Can’t really remember when (maybe 2010?). It was put on hiatus several times due to life-stuff, and a couple of times I had even redone it from the beginning to find and remove any and all glitches/errors; I spent most of the time trying to figure out what the most minimalist/efficient ways to implement everything were. Finally it's here, and as of the latest update nearly all of the features I had planned are in! A change-log (different from the one here) has been kept documenting every single change that has been made (as well as dates-of editing, revisions and future ideas), for the sake of being able to quickly and easily pinpoint the cause of any errors. Choices in programs and how they were used have been carefully considered to avoid glitches. I am also trying to keep the save-data structure of the base ROM intact so that the regular Emerald's game saves will remain 'backwards/forwards' compatible (originally for testing scripts, graphics, etc.). This may change in the future, but it will be on a separate branch of this project. Gameplay/Summary: This is largely a \"quality of life improvement\" type of ROM hack, and does not alter the main storyline. It retains all the features the original Emerald has, but adds several things to the mix to make it more fulfilling and fun to play. Remember those days when myths like going to the Moon after a certain number of rocket launches/weeks were a thing? Several things like that will be accounted for, but with some changes/twists to how they are done. There is a moderate increase in difficulty (not really big, just aimed more towards veteran players), but there are rewards to compensate. Only a select few newer-generation features have been added, as I wanted to keep this hack’s gameplay as faithful to the pre-2007 scene as possible while still adding a few of the newer games’ improvements in function. However, I might add in a few newer-generation Pokémon as special appearances/events sometime in the distant future. Apparently, expanding the PokéDex could cause the game to require its own exclusive saves only, but I think that will be OK as long as one does not plan on using this hack's saves with the regular Emerald (or vice-versa, I think). You may want to also keep in mind that if I happen to release an expanded-Dex version at some point, it may not be compatible with a save file from the regular version of this hack. Regardless, I will not stop updating the regular one and will still release it as well if that is the case. I would also try to find a way to make the original saves compatible with the new one. Main Features: ▲ The PRNG glitch has been fixed by re-incorporating Emerald’s unused PRNG system. • May need someone to check this one, just to fully confirm that it has been implemented properly. ▲ All 386 Gen 1-3 Pokémon available. • A New Evo Stone that evolves Trade-Evo Pokémon. • More Roaming Legendaries, events, different sprites, etc. --- Some events based on Day/Night/etc and/or game completion status. • Pokémon from different PokéDex sections have their own battle music (based on region/availability in-game). --- i.e. Encounter a wild Pidgey somewhere, it will play Kanto’s Wild Battle theme; while Sentret has an exclusive Johto Wild Battle remix. • Most events/Legendaries have signature themes too (i.e. Suicune and its Crystal battle theme), though related ones share themes. • A special Event-Shiny somewhere. • Check the Game Corner prizes in Mauville City for a few surprises. • Mirage Island can now be reached in a much better (and honestly much more sane) way than in the original R/S/E. --- Available on Sunday mornings after capturing 180+ National Dex Pokémon. The National Dex always includes Hoenn Pokémon as well. ▲ Special Event Tickets are available via unlocking Mystery Gift and finding the MG Receptionist upstairs in all Pokémon Centers. • Obtaining the Nintendo Event Tickets in this hack uses the real Mystery Gift scripts that legitimately unlock them! :) • Mystery Gift is unlocked the same way as normal: Fill out the questionnaire in a PokéMart with \"LINK TOGETHER WITH ALL\". • How to obtain them this time: --- Eon Ticket: Become the Hoenn League Champion. --- AuroraTicket: Defeat Steven at least once. --- MysticTicket: Raikou, Entei and Suicune all defeated/fled from or captured (Like w/Crystal Version's Ho-oh, but more lenient). --- Old Sea Map: Get 180+ National Dex captures. ▲ Day & Night System (Early-Morning, Morning, Day, Afternoon, Twilight, Evening). • Affects battles too, and will eventually affect music on maps in a future update. ▲ Graphics have been altered in many different areas/aspects (nothing too fancy, but it is an improvement IMO). • (i.e. Meteor Falls looks very different now, many menus are new colors, trees/caves different texture, etc). • New Battle Backgrounds based off of HG/SS’s and recolored to match CosmicEmerald's altered environments. --- The tiled indoor trainer battle style and the Champion one were designed by me using Paint. • Edited Rayquaza’s backsprite so that its lower ‘fin’ points backwards instead of oddly forward. • New (but still similar) Title Screen! • You may find that certain maps look quite a lot different than they were previously. ▲ Upgraded B/W Repel System (lets you choose whether to use another and which type). ▲ TMs are reusable. ▲ All Pokéballs (except Safari Balls) are reusable until capture. • Are slightly less common and cost quite a bit more for balance’s sake. • No more worry about resets, savestate-abuse or running out of chances to capture a Shiny. ▲ Your Pokémon receive EXP when you capture another, like at the end of a normal battle. ▲ Pokémon’s Natures have color-coded stat boosts/drops. ▲ Rough Skin Ability Fix (from Gen IV). ▲ EVs cap at 252 instead of 255 (in order to not waste remainder points). ▲ Somewhat steeper difficulty curve than official games. • Storyline-based/secret trainers are stronger, Event-Legendaries stronger, etc), but nothing too insane. ▲ Running While Indoors. ▲ Final Trainer Card is no longer Gold, but is ‘Platinum’ (well, not that literally, but it’s totally different than before). ▲ Upgraded EXP system: All Pokémon directly participating in a battle will receive full EXP, not half unless you use EXP Share to avoid having to switch them out. This allows you to have more options for how to train. ▲ Steven can now be re-matched daily, and depending on when you face him, the Champion Battle theme might play (like in R/S). ▲ It is now possible to \"turn off\" the random calls on the PokéNav (except for the scripted ones in the story) by using Prof. Birch's machine in the lab. ▲ The clock in the player's room now lets you know what the day of the week is before showing the time (there is a minor bug on the Playstation Portable). Because of this, it can now help you know if the in-game day is correct when you want to do a special Event! ▲ The Safari Zone's expansion area is now split between nocturnal and diurnal Johto Pokémon (North and South, respectively). ▲ The bed in the player's room can now be used for sleeping, and possibly investigating a 'nightmare'. ▲ Lamps on maps that have them now have a lit/glowing animation during night hours. • Mt. Chimney's lava is also lit up at night. ▲ Features 4 new RSE-style music remixes I made (3 from G/S/C), + 2 hidden Crystal-Version tracks from the original. ▲ As another special feature for this ROM hack: Rayquaza and Jirachi have a 1/200 Shiny chance. ▲ A few Legendaries' movesets are very slightly different, for event battle purposes. Levels on most of them have increased, so be prepared. Some are also holding rare berries, and by researching these berries' tag info you can get an idea of who has which berry. See if you can steal them with Thief before they are used in battle. • Also, the roaming Legendary Bird Trio now have a catch rate of 5 instead of 3 to make things a tiny bit less frustrating. ▲ There are rumored 'prehistoric' Magikarp on Faraway Island, battle them a bit to see what is so special about them. ▲ Cave of Origin is now accessible permanently after fully completing the Jirachi event.", "platform": "Nintendo Game Boy Advance", "release_date": "August 15, 2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Skyvorpal A.K.A. SkyOfBlades", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "https://youtu.be/iG69UXla_lk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123391\n"}