{"name": "Pokémon Clay's Calamity II", "overview": "Game history: This game takes place several years after Clay’s Calamity I, where the main character, Clay, embarks on a quest through the open world of Kanto to become champion. After completing the league Clay then goes into hiding and is never seen again. Clay’s tremendous concurring of every trainer and gym leader shook Kanto so much that all the gym leaders became stronger in an attempt to never let someone wreck their world has hard again. What is your job? To find and defeat Clay! Journey through the completely open world of Kanto with Pokemon from all three generations and experience the most difficult Pokémon game ever created. Gym leaders are the strongest enemies (second only to the Elite Four) that you can face and Pokemon are greatly versified in type and level. Every Gym Leader you defeat will bring you one step closer to finding Clay. Solve the mystery and defeat Clay to complete this Pokémon game! ------------------------------- Game play: You will start the game with a Magikarp and a Master Ball. This is meant as a means to capture your very first Pokémon. You may travel anywhere you wish (because it is open world), but the Pokémon in the routes around Viridian are the best to start with (IE, the original 9 starters). After capturing your first Pokémon go to the Viridian City gym which is the starting point for this venture. From there piece together clues to find Clay, the most powerful Pokémon Master that ever rocked Kanto! ------------------------------- Hints: • Viridian Gym is a free-be gym. Go there to begin your journey. • Brock and Misty are the only push over gym leaders. • Hidden passages and secret warps are scattered throughout the Kanto region. ------------------------------- Features/Modifications: • Starting town is Viridian • Warp tiles added in multiple places for fast travel: (Viridian to Pallet, Pallet to Cinnabar, ect) • Increased wild Pokémon levels • Increased gym difficulties • Running shoes immediately • Open world with all minor obstacles removed (cut-able trees, optional paths, etc) • Secret passages to other routes • Increased variety of Pokémon • Moltres back in Victory Road • Mew available in areas based on folk-lore (from the original 1998 red/blue release) and Pokémon Adventure Manga. • Pokémon available based on level, type and surroundings (example: all Moon Stone evolutions are available around/inside Mt. Moon, top tear Pokémon surrounding MewTwo, etc). • Islands are optional (with fast warps to end triggers if wanted) • UPDATED! New Physical/Special Split", "platform": "Nintendo Game Boy Advance", "release_date": "2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "frabulator", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "https://youtu.be/ze2JGZg3DZQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123386\n"}