{"name": "Pokémon A GRAND DAY OUT", "overview": "Introduction: Do you like Team Rocket? Do you like crazy? Then you can be reasonably sure you'll enjoy this, my second mini-hack and the only hack I've ever made that doesn't have the word 'Version' in the title. Marvel as a young child is thrown out of his or her house! Wonder as Team Rocket attempt to blow up Route 1! Puzzle at Giovanni's unusual behaviour! All this and very little else except a Cubone! Information and Story: I call this a mini-hack because it consists of just an hour or two of gameplay. Originally, it was made for the Speedhacking contest at the last Pokécommunity Get-Together, but I never actually posted it here, and I figured that since I won't be releasing anything new for quite a while, I might as well share it. It follows a young Trainer through one day in his or her life - and it isn't an easy one. In the morning, they're almost blown up, and by lunchtime, he or she does is trying to figure out why Team Rocket keep trying to blow up roads, forests and mountains - with the help of Giovanni, of all people. I'd give more details, but if I did that I'd give away the entire plot, since it's really quite short. Features: Play as a Pokémon Trainer! Dress up as a Team Rocket member for a brief time! Catch a Cubone! Sorry, but there aren't actually any radically new features here. This is just the video game equivalent of an amusing short story; designed for immediate consumption and subsequent throwing away. Treat it as candy. It's fun (I hope), but ultimately there's no substance, and it may well rot your teeth. Although if you play A Grand Day Out and your teeth do rot, I will deny all knowledge of it and accept no responsibility.", "platform": "Nintendo Game Boy Advance", "release_date": "2012", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Cutlerine", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.08", "wikipedia": "", "video_link": "https://youtu.be/h-p27M30dFI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123246\n"}