{"name": "Pokémon Emerald Double Version", "overview": "About: Pokemon Emerald, but every trainer battle is a double battle. Yup, inspired by Colosseum and XD, every trainer battle will be changed to a double battle! There is also increased difficulty and level curve! Features: • Double battles everywhere! Every trainer completely reworked, with interesting (but still theme-consistent) teams, using a much greater variety of Pokemon! • Double wild battles in almost every location! (Except the water. Oh.) • A steeper level curve, to make the games a fresh challenge. Expect level 40s by the 4th Gym! • Emerald Battle Engine Upgrade- Physical/Special split, Fairy type, up-to-date moves/abilities/learnsets and more • Super tough main-character battles that challenge you with advanced moves and techniques, from Gym Leaders, your rival and Maxie/Archie! • An extra starter, Eevee, with methods provided early on to evolve, including Umbreon and Espeon! • TMs, especially double-centric moves, are now available early on in Pokemarts, and are now infinite use • General avoidance of HM requirements except Surf, Dive and Waterfall (7.8 too much water), especially in the late game • Rematches with Gym leaders have been enhanced for the post-game, and you can find Maxie and Archie... somewhere! • 386 obtainable Pokemon (breeding/evolving still required). • Secret extras! Known bugs: • U-turn does not work! To do with the battle engine, cannot fix. Please save often! • When you enter a double battle with only one Pokemon (in your party or not-fainted), the game will either clone your only Pokemon or bring a fainted Pokemon into the battle (who can't attack or gain EXP). Finishing the battle will enable normal progression • The bag sprites are glitched permanently. Cosmetic only. • When fighting a single trainer, if both you and your opponent lose a Mon, then when you put your replacement in, it says \"enemy trainer sent out your Pokemon.\" • Not all normal rematches are in. Okay, not a bug, and something I might change one day, but not for now. Check out the Pokecommunity thread for spoilers or to report bugs!", "platform": "Nintendo Game Boy Advance", "release_date": "May 20, 2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Saiklex", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/Ra5-6LT6HiY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123695\n"}