{"name": "Pokémon: Mirage of Tales The Ages of Faith", "overview": "The world has been receiving peace for a long time. Suddenly, bad omens appear everywhere. Wars are unavoidable. There are three main characters for this game. You can play through the stories of each one and know how they be involved with these wars – how they keep themselves and their people safe – how they overcome the obstacles in their way. You will experience an epic conflict, a political dispute, a holy war between forces. No choice for retreating will be made, right? Features: •Three different characters with their own stories: Prince Evandor, Princess Zhafira, Kala The Slave. •The Finance Chamber function allows you to build up points for rewards in game. With each year, you get 3 points. When having enough points, you can: collect a payout from the bank, access stronger Pokemon, have more training chances, have better items in your city. •The Alignment System decides how your character will be: Good – Neutral – Evil. •This will base on your in-game decisions. •The Strategy Map is an interactive in-game world map. Move your cursor around and see what is happening in each area. Surely you will use it many times in Council Chambers to make travel plans, battle strategies and decisions. •The sprites, graphics and soundtracks are suitable for the Middle Eastern atmosphere in this game. •Your Influence will be determined by in-game choices. •No Pokedex, no Pokeballs, no PC. •PokeCenters are Holy Temples of different Gods now. •Some Pokemon are ridable. No need to have a Bike here since this wasn’t the time of it. •You can extend your party to the number of 12 Pokemon at the same time with the Extension item. •Many newly customized items. •Physical/Special Split. •New moves, new abilities, new battle engine from Gen IV – Gen V – Gen VI.", "platform": "Nintendo Game Boy Advance", "release_date": "2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Avara", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=n79fhqpCDVM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122071\n"}