{"name": "Pokémon Clover", "overview": "ABOUT: Pokémon Clover is a ROM Hack of Pokémon Fire Red featuring the two brand new regions of Fochun and the Ebin Isles, as well as 386 original fakemon! Started in 2015 as a janky rehash of the base game, Pokémon Clover has since evolved into a complete overhaul with all-new characters, story, maps, and music. The main point of Clover is to be both a parody of 4chan’s imageboard culture as well as a parody of Pokémon as a whole, thus it contains themes and language not suited for the faint of heart. STORY: Pokémon Clover’s story follows a young Trainer from Veepier Town in the Fochun region as they get their starter from Professor Stump and go on a good old fashioned Badge-collecting journey, and battle the nefarious Team Karma, a mysterious group supposedly hunting for the most powerful meme in the world. FEATURES: • 386 original Fakemon • Enhanced audio sampling • Brand new custom made music • Physical/special split • Fairy type • Wonder Trading • Mugshots • New custom PokeBalls • Black/White 2 Repel system • Gen 6 style capture-experience system • New custom items • Reusable TMs • Forgettable HMs OTHER CONTRIBUTORS: Eiko - Sprite work Glaceo - Sprite work Digidex - Sprite work FoxDrive - Sprite work Kabocha - Sprite work StarGazr - Sprite work Fluxuator - Sprite work RellivaRaven - Sprite work yawningfawn - Sprite work Chemical Man - Sprite work Cappptier - Designed and sprited Edgie Kottbullar - Music composition StarMagician - Music composition TheLostRune - Music composition CrimsonFossil - Music composition MammothPlant - Music composition Jamiemes - Writing FireB - Translated maps from RPG Maker to the ROM before the reboot Palette Guy - Named for his palette editing skills in the ROM before the reboot NewDenverCity - Programmer before the reboot DIO - Clovermon designs Niglett - Clovermon designs DasWeit - Clovermon designs LizardFungus - Clovermon designs Satanicle - Designed Clovermon while high padz - Designed and sprited Biteki, plus some misc stuff. You will be missed. Megaloceros - Trainer manager back in the day Tainted - Custom Trainer overworld sprites Outside help Spherical Ice - Diving, sideways stairs and various other code, tileset additions mvit - Cacademon overworld resprite JPAN - Fire Red hacked engine Kalarie - Trainer overworld sprites Avatar - Trainer overworld sprites azurile13 - Move relearner expansion Tetrable - Dream Ball throwing sprites ipatix - Custom audio engine daniilS - Ball expansion pfero - Code KDS - Various code Sagiri - Various code Doesnt - Various code Jambo51 - Various code shinyquagsire23 - Various code Touched - Various code & personal help FBI Agent - Various code & personal help DizzyEgg - Battle engine code & discussion ShantyTown - Feebas-style fishing code jiangzhengwenjzw - EV & IV display screen Contributors to the MrDollsteak ROM base - Gen 4-6 attack animations, PSS icons, various code ChaoticCherryCake - Tiles Team Acanthite - Tiles", "platform": "Nintendo Game Boy Advance", "release_date": "June 1, 2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "aaaa", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.78", "wikipedia": "", "video_link": "https://youtu.be/0XR-ZvwevkU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90146\n"}