{"name": "Pokémon Dark Crystal", "overview": "Introduction/Story: In Hairo region, people and Pokémon live together in harmony. In times of camaraderie, they develop love and care. In times of battles, they develop confidence and strength. In times of crisis, they develop choices and solutions. All of these strengthens bonds. There are mysteries yet to be uncovered so, explore the great Hairo Region as you faces challenges that comes in your way in... On the present day, the professor have finally returned on Hairo from her visit on different regions. Upon arrival, she reminds a memory of her and three young children who were best friends and very potential to their dreams take a journey to become a great Trainers. The professor goes on Sketchy Town to visit the three children who are now grown-ups to give a task to complete a certain research, to challenge the Hairo League, and to achieve their dreams and goals as they take their journey. Catch, train, and battle your Pokémon as you step forward to be a Pokémon League Champion. Battle your Rivals, the greatest Gym Leaders, the intensive Elite Fours, and some special Trainers as you make companionship and camaraderie with them. Defeat, learn the goals, and seek truths from the villanous group called Team Enigma as they act terrorism and world domination to rule Hairo and the world. Seek, battle, and catch the great and powerful ancient, mythical Legendary Pokémon gathered in Hairo. Battle the decisive Frontier Brains as you step in an extensive battleground called Battle Frontier. Cross many paths as you make your own journey to become the greatest and awesome Pokémon Trainer ever. ★Awards★ First Place: Hack of the Month - September 2015 Features: • New Pokémon: 721 Pokémon as of Generation VI are added in the game with their respective forms, formes, and Mega Evolutions. Data updates such as moves list, stats, etc. across Generations are present. In the start, you will get to play a mixed list of 251 Pokémon. • New Moves: Some Moves as of Generation VI are added in the game such as Flare Blitz and Moon Blast. I also made some custom moves like you have never seen commonly in the real world of Pokémon. Move updates across Generations are present as well such as Crunch now decreases Defense. • New Abilities: Some Abilities as of Generation VI are added in the game such as Motor Drive and Mold Breaker. Ability updates across Generations are present as well such as Sturdy now leaving 1HP if hit by any full knock-out. • Fairy Type: The addition of the Fairy Type is in the game. • Physical/Special/Status Split: The Physical, Special, and Status split for moves is also in the game. Oh, yes! It also features an icon preview which you will also know which moves are Physical, Special, or Status. • New Repel System: Like in Black 2 and White 2, when your Repel's effect wares off, it automatically asks if you want to use another Repel without getting another Repel from the Bag again to use one. • Poison Survival Style: Nobody faints from Poison status anymore. Like DPPt and HGSS, it leaves 1HP and the Poison status fades away. • Infinite TMs: Using TMs are now infinite. It doesn't break after use. That means you can learn TMs as many times as you like. • Capture-Experience Gain System: You will also be rewarded Experience Points when you catch a Pokémon. • Rearranged Music: Of course, I planned to edit the music as well. My favorite themes from HGSS/BW/B2W2 are rearranged accoring to GBA voicegroups. • Missions: You can have missions in game in order to obtain rare items, unlock further events and catch uncommon Pokemon. • Easter Eggs: Seek out hidden events as you catch more uncommon Pokemon.", "platform": "Nintendo Game Boy Advance", "release_date": "2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Sky High", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://youtu.be/NdV0Ch6ViGk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123434\n"}