{"name": "Pokémon Emerald Omega", "overview": "About: It’s an Emerald Fan Version of Pokémon Fire Red Omega. Glitches & Bugs: • Pokemon Contest cannot be accessed due to a glitch. You can still get the Pokéblock case from the person outside. • When leveling up while catching a new Pokédex, the entry gets messed up at first glance. However, the glitch does not last and will be fine next time you check the entry. • Pokémon #5 in your party does not have a Poké Ball in the Pokemon Select screen. • Opposing trainers outspeeding you with U-Turn or Volt Switch will deny you your turn (No important trainer has either move). • Some music may be missing. • Fighting Snorlax freezes the game • A few evolutions and moves (Porygon -- Porygon2 and Substitute to some of the new Pokémon) New features include: • Physical/Special split from Gen IV and onwards. • 71 Moves from future generations with complete animations (No old move is replaced). • Elekid, Smoochum, and Magby are your starters just as in Fire Red Omega. • 450 Pokémon to catch. This is now the first English hack to be released with expanded Emerald Pokédex. • This hack is only playable in SET battle style. • Electabuzz, Jynx, and Magmar have raised stats and completely revamped move pools. • You cannot use healing items such as potions during battle, but you can use them outside of battle. However, items such as X Attack and Dire Hit can be used in battle. • The Fairy-type is in the game. • Boss fights now always use 6 Pokémon with good movesets. • Opposing trainers have custom IVs, Nature, and EVs. • Gym TRAINERS now have customized movesets and Pokémon. • Movesets inspired by the Pokémon X/Y movesets but edited since there are only 50 TMs. Be sure to visit the move relearner a lot. • Some weaker Pokémon have got stat changes. None has changed in type. I wanted to avoid changing the original too much. • Running shoes work inside houses. • All TMs can be used as many times as you like, to balance out the increased difficulty. However, some of them are now more difficult/expensive to obtain. • Eggs hatch at level 1. • You gain experience from catching a Pokémon. • Some HM moves have been changed to be more useful. • Every rematch in the game has been updated. You may now challenge the Gym Leaders and Wally to both 2on2 and 1on1 battles which are constantly increasing in difficulty until you face their strongest at level 100 with good EVs. • Steven has got an updated team when you team up with him against Team Magma to match the increased level curve. • Face off against Red at the very end of the game. • Frontier Brains have got updated movesets so they fit in with the Special/Physical split. • All trade evolutions and annoying evolutions can now be done within the game/are no longer annoying. • A few evolutionary items can be bought at Verdanturf, all at Lilycove. • Old Rod is obtainable before the first Gym. • In-game trades now give you Pokémon with good IVs. • A new dungeon, Cave Of Memories, is accessible after beating the Elite Four. • 1 New Ability (Skill Link). • Glitch fixes (Pomeg and one involving PRNG)", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "mamamama", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/NexbCBez4iE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123905\n"}