{"name": "Pokémon Adventure Green Chapter", "overview": "This game is based on the Pokemon Adventure Manga. The game follows the manga closely with nearly all the events inside. However, some events were changed to make it longer. The fact that the game follows the manga closely, you don't get to chose your own starter Pokemon. The game follows the storyline of Green. Most of the events that happen in this game weren't shown in the manga, but was implied happened. This is a spinoff of my Pokémon Adventure Red Chapter hack. Story: One day, a girl from Pallet Town was kidnapped by a mysterious flying Pokemon. Few years later, she returned to her home only to discovered life has moved on without her. Lost and enraged, she decided to get revenge on those who kidnapped her, which eventually got her entwined with Team Rocket and a boy named Red. Features: • Story follo ws the story of Green (female protagonist). • Only girl is playable. • Not all Pokemon are catch-able • Jigglypuff is the starter Pokémon. • Red and Blue will get their default name, while you can name Silver. • Silver debuts in this game. • New tiles, maps, textures, items, trainer class and Pokémon sprites. • Game would have OPTIONAL events that would change the storyline. • See the old and new Kanto. • The main character speaks in color text. • No HM FLY yet. • Several reference to the anime. • Some trainers have special Pokémon. • 3 new Pokémon types: Fairy, Shadow and Glitch. • Optional events that would affect the game's outcome. • Day and night system. • A bit of Hoenn and Johto Region is playable. • Gen VI attacks are in the game. • Mega Evolutions (Blastoise, Wigglytuff, Nidoqueen, Milotic and Parasect) • Primal Evolution (Cloyster) • Pokémon Contest is playable • Don't focus on badge collecting. • Able to create evolution items. • Pokeball Changer", "platform": "Nintendo Game Boy Advance", "release_date": "2013", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "c067912881", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.3", "wikipedia": "", "video_link": "https://youtu.be/8VK8IRecuvM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123294\n"}