{"name": "Pokémon Crimson", "overview": "Story: Approximately two years after the saga of a boy named Ethan, a new hero is about to be born in the Johto region. You are the younger sibling of the champion Ethan's best friend, Lyra, who is the current gym leader of New Bark Town. You decide to set off on your own journey, but collecting the badges of Johto isn't your first priority. You find out the legends of the mythical Pokemon of Johto, stop the infamous Team Rocket from their evil plots to take over the Pokemon world, and travel to other regions such as Kanto and Sinnoh to learn about their secret legends. While traveling throughout the region, you meet special people who too are discovering the myths that link the Hoenn and Sinnoh regions to Johto, such as the former champion Cynthia and the current holder of Suicune, Kris. But what is Team Rocket's motive? What are they doing again in the Johto region, after Ethan stopped Giovanni at Tohjo Falls and Silver helped defeat Team Rocket at the Goldenrod Radio Tower (due to Celebi's time travel), and Archer disbanded the team? The lowly grunt Ethan stopped in Kanto who stole the Machine Part has brewed up a plan to take over the regions of the Pokemon world. But the grunt alone did not revive Team Rocket. You again will meet the executives of this organization, such as Ariana and Proton. And they together have created the ultimate legendary, although artificial, that can destroy the regions. The Scarlet Pokemon, Scarleture. And you, but not just you alone, will help prevent the continuing madness that Team Rocket has brought to not just your home region, but the regions around it. Features: - Play as either Marvel (hero) or Cecelia (heroine). - Meet old favorite characters (such as Steven and Will) and new ones (like Rokya and Cryce). - Experience the Day & Night system introduced in Gen. II. - Notice the changes that has occurred in the Johto region (see list below). - Catch Sinnoh and Unova Pokemon! - Two new legendary Pokemon to catch for your team! - Travel to other regions for certain reasons (Kanto, Sinnoh, etc.). As said above, there are changes here in the Johto region just like Kanto had in Gen. II/IV: - Some gym leaders have been replaced or moved. - Blackthorn City was blown up and is now Blackthorn Valley, due to Scarlecture's signature move Atomic Light. - Union Cave has collapsed due to an unknown reason (play to find out why). - There are new Frontier Brains in the new Battle Frontiers (will implement later on). - The Burned Tower has now been burned to crisp due to Team Rocket's manipulation upon Ho-Oh, which revives Lugia from Whirl Island without the use of the Tidal Bell/Silver Wing. - The fountain at National Park is destroyed because of Team Rocket's motives underground.", "platform": "Nintendo Game Boy Advance", "release_date": "2011", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Destiny Demon A.K.A. Soul", "publishers": "", "genres": "", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "https://youtu.be/yRySlmz9gLU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123418\n"}