{"name": "Pokémon Fat Kid", "overview": "Story: You know him. He's the guy who was always there for you in the starter region to assure you one thing: technology is awesome. He's been to Hoenn. He's been to Johto. But now he is setting out for the Cheeto region..................... The Cheeto region is full of wonderful and new technology. It is also home to Bill, the one and only PC inventor. It also has one of the best donut shop chains in all the lands. Everything sounds great while heading in but once he arrives, something terrible happens: the Professor's lab is blown up..................... He inspects the rubble and finds only the Professor barely alive. As the Professor takes his last breath, the Professor gives him a pokéball. Inside is Porygon 5.0, the latest release. Together, Porygon and him must travel across Cheeto region to stop Team Hippy from completing their ultimate goal: destroying all technology. Can he do it? One way to find out. Follow him across the Cheeto region and see the events unravel. He has many obstacles in his way, but with his awesome technology, donuts and Pokémon by his side, he should be able to succeed. He is Fat Kid. Features: • No Professor intro (custom intro) • New hero sprite • New Pokémon trainer sprites • New enemy team - Team Hippy • Porygon starter + six interchangeable Porygon evolutions • Updated or new tiles • New music • New PokéCries • Donuts and apple pies • Lots of credible jokes and tasteful humor • New Pokémon type: Tech Type • Many updated items • HMs removed and replaced with items (i.e. grappling hook, water tube, shears, lock picks, etc) • The Fat Kid can run now. • You get a scooter instead of a bike.", "platform": "Nintendo Game Boy Advance", "release_date": "2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Le Pug", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5z_V8SGuZjg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123888\n"}