{"name": "Pokémon Delta Emerald", "overview": "Description: Pokémon Delta Emerald is a hack of Pokémon Emerald. While there are many similarities to the official version of Emerald, it provides a refreshing overhaul in numerous ways. There are a myriad of Pokémon Emerald ROM Hacks that have been made; Delta Emerald is among the top 10 of Emerald specific ROM Hacks . Story: When you were youngling, you would sit with your Grandmother in the closet, a grand fortress crafted with cotton, cashmere, and silk. She spoke of a tale, passed down through the generations of your family. She taught you about the three Pokémon deities: Groudon the shield of the land, Kyogre the commander of the seas, and Rayquaza the spear of the skies who sees all. These three ancient Pokémon engaged in a ferocious battle aeons ago, yet they weren't fighting each other, they were defending their mother, the Earth and all who adore it. After the calamity had been quelled, they resumed their blissful slumber in the ancient realm of The Emerald Dream. It is said: If this world is in danger, they will emerge from their slumber once more and fight with all their might to defend it. Many years have passed since you were told that tale, now you are near adulthood. Your dream is to journey through life, racking up as many experiences as you are able to, light and dark, happy and sad, stressful and calm. You yearn to be independent, walk the line between chaos and harmony, and most of all you desire to learn. The day you have fantasized about has arrived, the first task you must complete on your path to become a Champion. Today, you will choose your first Pokémon! Your first partner and dearest ally, forming a bond as thick as the blood that circulates through your veins, heart, and brain. All you have to do is leave your comfortable abode, a myriad of challenges may await you, yet you will analyze and conquer them as they come. You shiver with anticipation at the mere thought of being challenged and emerging triumphant. You stride confidently down the stairs and out the door to tackle the first day on the road to fulfilling your destiny! Features: • All Starter Pokémon may be captured (up to Gen X & Y). • Several other Pokémon from later generations have been added (up to X & Y). • Mega Pokémon acquired by leveling them up. • Slight increase in difficulty due to improved team composition, movesets, • tactics, and strategy used by AI. • Stores sell exotic TMs and other items. Note: • Fairy type not implemented.", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Ludovic", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "https://youtu.be/0qaxJ_HK4lc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123514\n"}