{"name": "Pokémon HarvestCraft", "overview": "21 years ago, Pokémon lived in harmony in the woods. The Pokemons there were ruled by the Pokémon Trevenant. One day, A group of people came and started cutting trees and building houses. There was no left home for the Pokémons. The Trevenant did not know what to do so it ask help on the Harvest Goddess. Harvest Goddess quickly responds and tried to punish the people. But she fell in love with one of them, and his name was Eric, which also fell in love with her. So Harvest Goddess forgave Eric and his townspeople. Trevenant didn't like her decision but he doesn't have any choice until he learned that If Harvest Goddess marries a human, she will lost all of her powers and pass it to Trevenant that's one thing Harvest Goddess didn't know about herself. Until 2 years later they got married (That's a long wait, huh?). At the end of the wedding, Harvest Goddess tried to use her powers to create fireworks but it didn't work, that's the time when she realized she lost all of her powers but she accepted it because she is happy with her husband. Trevenant is wondering why he still don't have Harvest Goddess' powers so he asked Kappa, Harvest Goddess' brother. Kappa said that he will only obtain Harvest Goddess' powers at the birth of the Harvest Baby.(Kappa didn't know about Trevenant's plan yet). One day, Kappa manage to find out Trevenant's plan, to trap the people inside the town and to kill the Harvest Baby so he tried to stop him but he failed. Kappa was trap inside a mine. Kappa told Trevenant that someone can stop him. A year later the Harvest Baby is born at that time Trevenant has obtained Harvest Goddess' powers and started the attack. He traps the people inside the town with cursed trees. Harvest Goddess' and ERIC tried to escape they put the baby in the basket. Eric and the baby escaped but Harvest Goddess' didn't get lucky, she got trap inside the town with the other people. Eric got away from the town with the baby. Knowing Trevenant is after the baby, he left the baby in front of a fosters house. (Why?!? Isn't he safer with you!?!?) You're an 21 year old who's just starting out on your journey but suddenly you got trapped in the town by Trevenant just for fun. Did he made a very bad thing to trap you in the town too? Can you stop this nonsense and free the townspeople? •The weather system affects your gameplay. •Time and Day will depend on your playing time. •Seasons change every 30 days. This can effects the items and wild Pokémon in the woods. •You can be a real farmer with many kinds of fruit. •A new system for Berries. You can find that they are regrown everyday. •No Gym Leaders and Elite Four at all. Instead, you will battle with shop owners for badges and Trevenant will be the champion. •Some new Pokémon from Gen IV to VI. •Cooking and crafting is also an interesting part of this game. •New items and moves. •The energy will be decreased when doing work. Replenish it by eating or sleeping. •A love system for the first time in Pokémon games! You can even propose NPCs when you have enough points. •The new Fairy Type.", "platform": "Nintendo Game Boy Advance", "release_date": "2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "quil09", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=WIpmdrZLXjo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122160\n"}