{"name": "Pokémon Order & Chaos", "overview": "In The Beginning... War, famine, and disease plagued the early settlers of the Mando territories as the God Dragon Chaosotra tormented the land. Eventually, the greater Dragon of the People, Orderana, defeated the chaos demon and civilization grew. Year 0 -A prophecy is made stating that if the region falls to chaos once more, a chosen 15 year old with his provinces surname shall rule and free the land from evil. Year 500 -Mando split into the two areas from sectional differences and the death of the king. The two provinces became known as Mandata, and Endo. Racism had emerged as a serious problem for generations. Usually, the strongest and most well-known man is crowned when a bloodline dies out, but no side wanted to give the other side power, there was no leader. War broke out and the people feared the legendary God Dragon of Chaos may have returned to punish them. Year 515 -Afraid, they turn to the prophecy and know that there is a child with the respected surname in both provinces. The only problem is, that in both regions there are not one but two children of the same age and blood, twins. Only being able to select one hero to be crowned champion of the entire Mando region the twins must face off against one another. The better will be blessed and start his journey to prove he is the strongest by collecting badges and challenging the Frontier League. Once he is champion he will enslave the other province and be worshiped as a God. You are one of the twins the prophecy spoke of and tomorrow you shall face your brother in a pokemon duel to decide who will represent the Endo province.", "platform": "Nintendo Game Boy Advance", "release_date": "2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "EasyBakeStudios", "publishers": "", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78828\n"}