{"name": "Pokémon Classified", "overview": "Story: A new island has been discovered in the middle of the ocean. Not many people are sure how or when the island appeared, but ever since it was discovered, people started to immigrate to it. Eventually, you and your familly did as well. There, you and your brother recive your first Pokémon and venture on a journey across the Secrien region! However, some things are not as they seem... Features: • A new region, new storyline and new characters. (And a few old ones...) • A level limit (Pokémon will stop obeying if they are overleveled and you don't have enough badges.) • Full decapitalisation, cause capitals are annoying. • Physical/Special Spilt. • All trainers have maximum AI and 50 IVs instead of 0 for added difficulty. • Pokémon and moves from gens 4, 5 and 6. • Custom level-up movepools. (They're very similar to XY/ORAS though.) • A fakemon. (Yup, just ONE fakemon.) • Some references to different games and anime. • Reusable and custom TMs. • Move tutors can teach moves multible times, in exchange for Shards. • HMs contain more useful moves. • A Hidden Power checker. • Some cursing words, nothing mayor though. • BW repel system. • Running indoors (Obviously) • Some trainer classed music. • Some Pokémon have their hidden abilities available. • The items sold at Pokémarts are based of how many badges you have. Bugs: • The professors glasses flash as he withdraws his Pokémon in the intro: Really minor and probably someting that's not worth fixing. • The Pokémon has a seadra cry, which it shouldn't: Again, very minor. • Your position on the town map is sometimes in the wrong place: I honestly don't know how to fix this...", "platform": "Nintendo Game Boy Advance", "release_date": "2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Submachine39 AKA Mechakhan", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/RQjKFSAPubA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123321\n"}