{"name": "Pokémon Crush", "overview": "STORY: Legends tell of a mysterious man; a caregiver, one of the happiest you'd ever find. He would spend countless hours with his pokemon, days even, just feeding them, playing with them, and caring for their wounds. One day, he found a weak Marowak; a wounded one that, as time went on, he grew more and more attached to. Being as fond of caregiving as he was, the caregiver discovered medicine that was helpful for curing pokemon, as well as others that weren't so effective. The man eventually came upon a terribly wounded Charmander. The pokemon demanded much of his time thanks to its condition, and as a result, the Marowak, who had grown strong thanks to the care and nurturing of the caregiver, felt that it had taken a backseat to the Charmander. It felt that it was being rejected. With sadness and regret in its heart, it began to isolate itself from the other pokemon. Charmander soon recovered thanks to the aid of the caregiver, and the Marowak felt a massive amount of resentment towards it, distancing itself from the caregiver. The resentment grew to the point where Marowak couldn't take it anymore. It confronted the Charmander and the two battled brutally and mercilessly. Marowak had the upperhand, and as it was ready to send Charmander the killing blow, the caregiver swept the Charmander up. This was the final nail in the coffin for Marowak, it no longer had a place in the caregivers heart. Realizing this, the Marowak fled the farm. ... Years passed. The caregiver went on as he previously did, though his heart was still heavy under the weight of Marowak's departure. Then, one day, he noticed the headline in a newspaper. \"Rogue Marowak Causes Fear Throughout Region\" The article went on to describe the acts of terror that it enacted. The caregiver was sure that the Marowak described was the same Marowak that had fled the farm all those years ago. He needed to go. He made to leave the farm and go to the last reported place that the Marowak has appeared. However, he wasn't given the time to leave. The Marowak had returned, and it darted towards the farm. It stopped just short of the farm gate, tired and angry, collapsing out of fatigue. It was incapacitated for many days, but after a time, it recovered. There was no time for any sort reunion, however, as police arrived at the farmhouse with a warrant for the Marowak. The caregiver tried to keep the pokemon safe, but due to his aide he was arrested for being an accomplice. The Marowak, however, managed to escape, and it did not forget what the caregiver had done for it. A week after the incident, along with a fellow Hitmonchan and Hitmonlee, the Marowak overran the jail, successfully saving and hiding the caregiver. Thus seemingly ending the tale of the caregiver...? Years have passed and the region has seen massive change. The government has been reformed, and lately you seem to notice that there is a lot of talk about something strange...", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "RedMort", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/rr2KTAekGtM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123440\n"}