{"name": "Pokémon Dark Blue", "overview": "TECHNICAL DATA: • Helpers: Reoneky; scripting support. • ROM Base: Emerald • Language: Spanish/English STORY: Who knows who you are? Who wants to know it? You're a mere character, you're involved in this adventure for your own, you've made your suit by yourself... You have adventures to draw on, you ought to pay attention to the tiniest details, to get lost in the landscape without falling into the abyss, no matter if you win or lose, it's all the same, just pick up your case full of dreams and hopefullness, 'cause sorrow and drama is too mainstream. CHARACTERS: • Yourself: You have no family, you're schizophrenic and it wasn't too long since you move to this region. You have a small house, which you inherited from your grandfather. No one feels right about the death of your relatives, so sometimes you have visions about a person called Cope, from who you don't know nothing about. People don't know about your dreams, which become true, and you found out about them. When you wake up, they are accompanied with a headache and blurry vision. • Reoneky: You only remember that he's a Pokémon Trainer, an old friend of yours. You're memory has gaps, however, you know that he's a good guy, he likes to joke about drugs and to call wild to anyone. • Professor Kagome: She lives in Coffee Village, she knows Sahori and Reoneky. You decide to tell her what happens with some of your dreams. She will bring you advices and some presents. • Sahori: A childhood friend, she's very nice, you love each others. • Lex: A Pokémon Trainer who travels around the region in search for his father, you won't know much about him but you'll eventually have several meetings with him, ocasions in which you'll measure your strength with him. • Cope: Everybody know that you'll discover that he exists, although you have to wait to know more about him. Just keep paying attention to the hack. • Panda: Secondary protagonist, it's just you disguised at Panda, very cute by the way. • Eing: Pokémon Trainer, somewhat enigmatic. He likes to raise his Riolu. He's hiding another life behind the mask he shows during your confrontations, he's burly. • Team Squad: Bunch of fools to who you kick in their faces. FEATURES: • New places and quests • Updated graphics • Brand new soundtrack ADDED POKEMON: • Riolu: Moveset similar to Pokemon Black/White one. • Lucario: Moveset similar to Pokemon Black/White one. • Buizel: Moveset similar to Pokemon Black/White one (ask for redemption, 'cause he kicks your ass). • Floatzel: Moveset similar to Pokemon Black/White one. GAMEPLAY: Inserting Pokemon that weren't present in the first three generations caused some problems. The amount of movements increased or just changed, so here are the changes: • Critical hits now inflicts x1.5 of damage instead of x2 • Surf: it hurts your allies Pokemon in double battles. • Toxic: it never fails if used by a Poison type. • Aqua jet: added attack, it works the same as in fourth generation. • Force Palm: added attack, it works the same as in fourth generation. • Feint: added attack, 30 damage, Fighting type, physic, it never fails. • Copycat: added attack, it works the same as in fourth generation.", "platform": "Nintendo Game Boy Advance", "release_date": "2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "LEX a.k.a. Jaizu", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://youtu.be/-HqqtDf3dzM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123448\n"}