{"name": "Pokémon Zandite", "overview": "There once were two brothers, their names were Luster and Solomen who loved each other while they were young, but were forced into a bit of rivalry for power. They created two separate teams (Lunar and Solar). Luster turned evil because he wanted use the moon for his own evil purposes. Luster thrived in the darkness leading him to create internal darkness using the Pokémon of Lunatone. He had an idea of modifying Lunatone genetically and using it to control the world. He did this by pleading to the boss of team rocket \"With the power of this Pokémon with modified changes, I will be able to capture jewels, valuables, and Pokémon\". Team Rockets' boss replied with \"I'll allow this under one condition, you capture for me Mewtwo\". He agreed to give him all the resources, money, and information. And in return he would capture Mewtwo. to give to the boss of Team Rocket. These Pokémon were more powerful than any other Pokémon besides the creator Arceus. The professor of the region eclipse and manager of team solar, had heard the intentions of Luster to create another evolution creating internal darkness. The professor also found out that Luster went to Team Rockets' base for help. He did not uncover the fact that Luster had promised in return he would give Giovanni the legendary Pokémon Mewtwo. It is up to the player (Solomen) to stop Team Lunar and his brother from disrupting the world. Features: • A new storyline • Completely new graphics • New music • Hard battles for more of a challenge • New maps, scripts and other. • DNS • ASM routines • Transparent textboxes • Shadow Pokemon! (you're joking right?) We will really be implementing Shadow Pokémon! • Gens 1-6 • 2 new regions • 1 new rival", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "LegendOfPerseus", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://youtu.be/Z3B9CKJXv_w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122281\n"}