{"name": "Pokémon Emerald Balanced", "overview": "Information: Once again, I have created a Pokemon hack that aims to balance the game. If you aren't familiar with some of my previous hacks simply look up \"Pokemon Balanced Edition\" and they will appear. The features in this hack are similar, but I will list them so that newcomers can see if this balancing concept appeals to them. Features: • 387 Pokemon are available,easier to catch, hold items more often, and give more Experience. • Honchkrow has been added to the game. • All Pokemon have revamped movepools, abilities and a BST(Base Stat Total) of 600. • All Pokemon have had their original Generation 3 Sprites and Icons replaced with newer ones, courtesy of MrDollSteak's Sugimori Pallete's Sprite Resource. • New Pokedex Entries have been added for Generation 3 Pokemon. • A few Pokemon have been re-typed, and Trade Evolutions have been removed. • Trainers are somewhat more difficult and their teams have more variety. They also give out more Money upon Defeat. • Moves have been revamped. Weak Moves like Ember now have priority like Quick Attack, Multi-hits deal more damage, Dragon type moves often have a low chance of inflicting either a burn, paralysis, or freezing, etc. • Pokemon Types have been revamped, Ice types have been buffed. Ice now resists Grass, Flying, and Normal types. Poison type moves are now super effective against Water types. • EV Training Spots have been added to the game • The National Dex can be obtained early by talking to an NPC in Oldale Town. • TL's Quick Enhancer has been used to make a Pokemon's stats colored based on its nature. The Quick Enhancer has been used for a few more things as well (Physical Special Split, etc.)", "platform": "Nintendo Game Boy Advance", "release_date": "2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Gegalix", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://youtu.be/u_Xe1yti10A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123784\n"}