{"name": "Pokémon: Fire Red 20XX", "overview": "The year is 20XX. Every Pokémon has managed to achieve perfection. Because of this, the winner of Pokémon battle depends solely on strategy and team building. The team building metagame has evolved to ridiculous levels due to it being the only remaining factor to decide matches. •Every single Pokémon is level 100 (no need for grinding. YAY!) •Revives CANNOT be used in battle. •EVs are nonexistent (Badge boosts are still in the game). •In the wild, you will find Pokémon at the latter evolutions than in the original game. •Since the game is centered around catching A LOT of Pokémon, Master Balls are purchasable for 10 Poke bucks in every mart. •Fully evolved wild Pokemon have weaker/ more situational movesets than their pre-evolved forms. (The movesets are still true to what the Pokemon can have in the main games (mostly). These are moves either gained by level, TMs, breeding or events) Depending on what you need, you can use the pre-evolved form or the evolved one. Movesets are heavily dependent on the stats of the Pokemon (either in a good or a bad way). •Your (already fully evolved) starter, however, has a solid moveset from the begining (not the best one, tho). •Standard evolution is gone. Now, you evolve every Pokémon with a Moon Stone (except the elemental eeveelotions). This means that you can transfer a better pre-evolved moveset to a evolved Pokemon. But there are only 3 Moon Stones in the game (in Vermilion, Rocket Hideout and Two Island). You should use them on the Pokemon, that you will truly require for a long time, or else you can get yourself in a lot of trouble. •Aditionally, all TMs are obtainable only once. Use those wisely as well. •HMs have been nerfed, because of their infinite usage. •Since Surf is now weak, Water types get a new strong water move. The TM for Water Pulse has been changed to Muddy Water, which functions almost exactly like Surf in the original games. •Move relearner now gives you 1 situationaly good move on a Pokemon in exchange for a Big Mushroom (Big Mushrooms can be bought in Celadon for 20000 Poke bucks). These moves can vary between different evolved forms, so you might miss out on something if you evolve early •You no longer have to fight Brock as the first Gym Leader (believe me, you don't want to try to beat Brock first). The map is opened to you until the Rock Tunnel entrance (you can access Route 9 and 10 without CUT). This means that Misty is the first required Gym Leader. •Gym Leaders are EXTREMELY tough. You will need form specific teams, that are capable of fighting them. •The three Sevii Islands now contain Pokémon from other regions. •Some in-game trades have been changed. The point of this hack is to (sort of) replicate the experience of playing a zero EXP run of Pokémon. The hack is still the basic Fire Red, but modified, so there is no need to grind (that's because it's impossible) and Pokemon are extremely easy to catch. With this, you can easily build many different teams very quickly, which can be used to stand a chance against very tough Gym Leaders. It is recommended to just throw balls at any Pokemon species that you haven't caught already (including different evolution stages). You may need to have a bit different mindset when playing this hack, compared to a regular Pokemon game. It is no longer around building a single team, but about strategizing on how to beat opponents, that are stronger than you. Pokemon you have a expendable, since there is no exp and that means, that you can SELF-DESTRUCT or DESTINY BOND as much as you want.", "platform": "Nintendo Game Boy Advance", "release_date": "March 1, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Manekimoney", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://youtu.be/nSONiK5cb-c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122066\n"}