{"name": "Pokémon Liquid Crystal", "overview": "Day & Night: Experience Real Time events and Visuals with the Day & Night system in Pokémon: Liquid Crystal! Travel through 5 different times including Morning, Day, Sunset, Evening and Night! Just as you would expect from a Pokémon Crystal Remake, the sun goes down and comes up again based on Real Time. Weekly events happening all over, with certain things happening every day in the game! When it goes dark in the real world, the sun goes down in Pokémon: Liquid Crystal. Relive Johto & Kanto: Relive the adventures of the Johto & Kanto regions with glorious Graphics and Music, and even some new faces! Experience a nostalgia attack like never before as you travel through the Routes and Towns of one of the best Pokémon regions ever created. Experience The Orange Islands: Take part in a completely new story line on the never before seen Orange Islands region! After the events of Johto & Kanto, Zane goes out of control in the Orange Islands. Play through a new chapter in the story and unlock some of the deepest secrets. Updated Graphics & Maps: Make your way through the game while setting eyes on some of the Greatest Graphics & Maps ever seen in a Pokémon Game! Every single map from the Original Crystal has been Revamped and Remastered into a set of amazing Maps like none before. With new Tiles & Palettes bringing Johto & Kanto to life once again! Revamped Battle Scenarios: Battle Trainers & Pokémon with Real Scenarios like Water, Sand and Grass! Just like in Pokémon Diamond & Pearl from the Nintendo DS, Pokémon: Liquid Crystal has enhanced battle scenarios to help make those battles even more realistic. Explore: Search far and wide to reach New Places and Hidden Areas never seen before! There are tons of new areas that were not there in the Original Crystal just waiting to be found. With the new Open Ocean, who knows what you will find! Dive Underground: Just like in Pokémon Ruby & Sapphire, you can dive down to the bottom of the ocean and explore deep caves to find new Items and Pokémon. Now, In Pokémon: Liquid Crystal you can Dive to the depths of Johto & Kanto to uncover deep secrets! The Viridian Trainer House, Evolved: For those that can remember the Original Crystal, you got to re-battle your linked friends at the Viridian Trainer House. Since linking isn’t a major part of Pokémon: Liquid Crystal, you battle yourself instead! Remastered Soundtrack: Listen to some of the Greatest musical pieces from the Original Pokémon Crystal Remastered for the GameBoy Advance! Relive those epic battles with the same epic music! There’s even some never before heard songs in a Pokémon Game, as well as some original songs featured in the Orange Islands! Updated Battle Mechanics: Battle your way through with a new Battle Mechanic unlike any other Pokémon Crystal Remake. Earn EXP like In Black & White! Pokémon: Liquid Crystal incorporates a unique system to any other GameBoy Advance Pokémon Game, with the enhanced EXP system it changes the way you battle forever! Also included is the Physical/Special Split introduced in the Generation 4 games for the Nintendo DS. Now you can make the most of your Pokémon’s Power while they use powers they could never use before! Real Weather: Travel through the vast lands while experiencing Real Time Season-based Weather Effects! Travel the lands while being hit with snow, rain, thunder and other weathers! Based on the Japanese weather patterns, expect to find yourself immersed in a downpour of fierce storms during spring, and heavy snow fall during the winter. Additional Features In addition to all the above features, we have implemented a ton of other amazing features like Berry Growing, Multiple Evil Teams & Rivals, Re-battle the Gym Leaders and much more that you wouldn’t expect from a Pokémon Crystal Remake!", "platform": "Nintendo Game Boy Advance", "release_date": "July 16, 2007", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "LinkandZelda", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.36", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=pGQs3f33F5s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115706\n"}