{"name": "Pokémon Emerald Advanced", "overview": "Information: This hack is somewhat similar to FireRed Advanced in that it's a dex-replacement hack, with a brand new Hoenn Pokédex of 250 Pokémon from generations 1-7. Some favourites from FireRed Advanced make their return, like Fur Coat Furret, Fairy-type Pixilate Delcatty, and Grass/Fire Drought Sunflora, while others are new to the scene, like Strong Jaw Mightyena, Corrosion/Regenerator Garbodor, and Darmanitan with Zen Mode that doesn't suck. Another thing this hack has in common with FireRed Advanced is that, while difficulty has generally been increased, my goal wasn't to make something soul-crushingly difficult, it was to make something enjoyable to play. Unlike FireRed Advanced, though, there are significant changes to Hoenn as a whole. Tons of NPCs have been edited, giving Hoenn a fresh feel. Many major characters have had their dialogue totally overhauled. One of the major unique features of the hack is that the Gym Leaders and Elite Four have completely switched positions. I won't spoil who's moved where (though you can check the documents if you want to know), but most gyms have been completely overhauled with new puzzles and challenges to fit their new leaders. There are a few new areas to see, too- the upper floor of every Pokémon Centre, which formerly contained boring link stuff that nobody cares about and I don't feel like bothering with, has been converted into a convenient lounge where you can take a break, meet some amusing characters, and occasionally get some nifty stuff. Shell out money to an Egg Vendor in Rustboro or grab some brand-new healing items for your team at the Verdanturf Café, or check out the gift shop on the lower level of the Oceanic Museum. Of course, there are also plenty of other features. 85 total TMs are available (and they're of course reusable), and the battle engine has been updated to gen 7 standards, with all that implies. Fairy-types, physical/special split, moves and abilities and items from gens 4-7, all that good stuff. Also every single Pokédex entry is custom made and they're worth reading, I promise General Advice: • Every available Pokémon is viable. Yes, including Delcatty. Yes, including Corsola. Yes, including Luvdisc. • Visit the second level of Pokémon Centres. • Talk to NPCs as often as possible. • A few beach routes, like Route 106, have dark sand where you can encounter wild Pokémon if you don't want to surf or fish. • The in-game trades are extremely worth it, although only one is available in the current beta. • The move deleter and move relearner have swapped places, so you can get rid of HMs in Fallarbor. • Don't stress over stone evolutions, they continue to learn moves after evolving. • The \"Detailed Dex\" document has all the info you need regarding the Pokémon available. • Altering Cave opens up after defeating the third gym, and the Desert Underpass opens up after beating the fifth and getting the fossil from Mirage Tower. Both are worth visiting. • Talk to gym leaders after battling them.", "platform": "Nintendo Game Boy Advance", "release_date": "2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Z-nogyroP", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/dgOX4Ku3FjU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123782\n"}