{"name": "Pokémon Dark Realm", "overview": "STORY: Pokemon Virtual is a game developed by X Company in the late 22nd century. The game connects directly to your neutrons which gives the best possible experience to player. One day something happened. While going to school, you get lost... In the Pokemon World! And that's where the story begins. Trying to escape from this world, you only get lost deeper and deeper into the story. On your journey, meet many human-form legends, discover untold stories, obtain a monster from the Dark Acient, and finally, from a devil become a hero. One day, the game is gone, everything is over, but our memory is still... FEATURES: ★ Branching Storyline • Depending on which gender you choose, the story splits. If you play as male, you can go to Sky Island and catch Shaymin. If you choose female, you can go to Atlantis and catch Latias. ★ Transparent Textbox • With an ON/OFF option. ★ Reusable TMs, • All TMs are reusable, they stored in an Ancient Lanturn. I have put a note where to find them in a txt file within the games files. ★ Name Rater, Move Deleter, and Move Relearner • Will be available in every Pokemon Center. the Move Relearner will teach your pokemon for free! ★ Mini safari • A place for catching rare pokemon, as well as grinding your level, Every mini safari now has a free healing spot. ★ Others • Mugshots for important characters. • Running inside enabled. • New legends: Rivengon and Leon. • Mega Evolution. (outside? of battle) • Ingame Cheats. (in progress) • Many mini games: Follow the Pikachu (Closed for now), Feeding Bunnelby Carrots, Racing (in progress), Dino Cave, Game Center, Safari is now Jurassic Park. • Bank System. • Tower 100: A tower of 100 levels. • Mini battle Towers. • Shiny Pokemon are easier to find! • Adoption Center. (Maybe in upcoming Beta) • BW/BW2 Repel System. • Generation 1-6 Pokemon. • TMs: Destiny S, Payday, and Headbutt are usable on all Pokemon.", "platform": "Nintendo Game Boy Advance", "release_date": "2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Duchuy", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://youtu.be/w6zAfXN3GCI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123441\n"}