{"name": "Pokémon Ash's Quest", "overview": "Overview The first season of the Pokemon anime was very popular, and I’ve seen numerous attempts at a full hack that recreated those events. Pokemon: Ash’s Quest is a complete translation of every important event from the first 82 episodes into an Advanced Hack. Everything you can think of – A.J.’s Gym, the School of Hard Knocks, the banned episodes, the singing Jigglypuff, the Pokemon League tournament – that you wish they would have included in the original games this hack has. There are NO random trainers or wild Pokemon. I’ve done extensive research and taken some otherwise unnoticeable details from the show to ensure that everything in this hack relates directly to the anime. Of course, several things – receiving the three starters, the St. Anne saga, the Sabrina arc - will play a prominent role and involve a complex series of events, but I’ve made sure every episode is represented as much as possible. When playing, just remember that this is what you’d have expected Gamefreak to have made if the games were based off the show, instead of the other way around. That said, longtime players who remember the anime can play it for nostalgia, while newer players can play it as a sort of “significantly updated” Fire Red. Bugs and other Problems (Original Version Only - Fixed Version does not have these Problems) When entering the St. Anne, enter through the right or center space, otherwise you'll end up directly at Porta Vista. This will be fixed into the updated version. After the St. Anne events, there is no way to return to Cerulean/Vermillion without Rock Smash. Thus, you MUST get the Squirtle before boarding. This will also be changed. There seems to be a bug in the first round of the Indigo Plateau, where you are unable to battle the Trainer. Thus, this hack ends there. The next version (coming out very soon) will rectify this. In Cerulean City, you MUST enter the gym and watch the show before battling Daisy, or else the Gym will remain empty.", "platform": "Nintendo Game Boy Advance", "release_date": "2008", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "ice_nine", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://youtu.be/4THF65HqcyU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123280\n"}