{"name": "Pokémon: Altered Emerald", "overview": "What happens when you take (almost) every move and ability from gen 1 to 7, add some new ones to the mix, and then cram them into just 386 Pokémon? You get a level of meta diversity the main games could only dream of. Over half the abilities are signature abilities, and moves are no different! You can catch all your favourites here, and you'll find them stronger and more defined than ever before. On top of that, I've rebalanced and re-teamed the trainers and gym leaders, then freshened up every route in Hoenn and added five new ones. And I love the puzzles: they're optional, fair, and absolutely devilish. On with the show! Starring: Dizzy Egg's/Chacha Dinosaur's emerald battle engine: most moves, many items, and all types, phys/spec split, abilities, capture xp, and all abilities (especially the cool ones) up to generation 7 are in the game The palette has been made more vibrant All routes have been remodeled, some islands have been added in the sea, victory road is completely new and exciting, and 5 new (fully optional) routes have been added: a canyon, a haunted house, an extension to route 119's river, a snowy mountain, and a mine. So many quality of life changes! Fly to routes Access Pokémarts downstairs in all Pokémon Centres Use Nature Power as a replacement for all of Strength, Rock Smash, Cut, Surf, Waterfall, and Dive, or just use the old HMs as usual Evolve your team into all their later generation evolutions Evolve trade evos that require items by just levelling them up while holding that item, and evolve all other trade evos at lv36 (or evolve gengar by happiness at night) Reuse tms and move tutors as much as you want Shiny rate doubled to match later generations Run indoors Delete all HMs Use the updated repel system, Access all the secret base items, A few storyline rewrites (the Magma Base is now an enjoyable little sneaking mission where you have to avoid getting seen. ) An ability switcher in Mauville An egg hatcher in verdanturf An IV checker and perfecter in the Battle Frontier (with the option to give you 0 base speed of course) Optional patch with cheesy joke dex entries Optional patch with 20 more type changes And even more QOL improvements!", "platform": "Nintendo Game Boy Advance", "release_date": "December 25, 2016", "game_type": "ROM Hack", "esrb": "T - Teen", "developers": "luuma", "publishers": "", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/147370\n"}