{"name": "Pokémon Zephyr", "overview": "The Astro region is a huge region in the world of Pokémon, and it is a neighbor of Hoenn. This region is very beautiful, with many forests, jungles, beaches, deserts, etc... Year 2000 October, The police have discovered a new criminal band in the Hoenn region, the Dakko Team, the most cruel criminal organization ever known after the disbanding of Team Rocket. There are reports that this criminal band has expanded and moved into the Astro region. Their first goal is to catch the legendary Pokémon of the Astro Region: Darkrai. When this Pokémon is together with Palkia, Dialga and the legendary Twilight Gem, it has the power of controlling time and space, and the entire world. Only a legendary Pokémon Trainer can save humanity and all of the Pokémon, a trainer with enough courage and power... Year 2001 February, Team Dakko has now built many headquarters in the Astro Region, as centres of investigation. They may be looking for Darkrai and other Pokémon. Year 2001 June. Brendan/May has arrived from Kanto to Astro in a failed attempt to get his/her Pokémon from the very famous Professor Oak. Brendan/May are from Hoenn, but because of some weird incidents there, such as droughts and terrible thunderstorms, Brendan/May get their Pokémon from the Prof. Ahgoo, the most famous Professor in the Astro region. Then your adventure begins. FEATURES • New Scenery • With new maps and new tiles, this will be the most exciting adventure of your life! • New Events • Scripts written from scratch, new dialogues that may include humoristic scenes. • D/P Pokémon • Yeah! 42 Pokémon from the 4th generation!", "platform": "Nintendo Game Boy Advance", "release_date": "2008", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Twilite Darkrai", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/mwb89SLQVz8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122292\n"}