{"name": "Pokémon Easter Revolution", "overview": "Status: Receiving complete remake Intoduction: Easter Revolution is the fourth installment in my Holiday Hack collection. When making the game, I tried to think of everything that would revolutionize the GBA ROM hacking scene. So I spent countless hours coming up with every method and routine I could to make the truely Revolutionary game. And with that I bring you Easter Revolution! Story: In the Eggomletai Region there was peace and prosperity all through out its development. Thousands of years passed with peace and harmony, until one day a mysterious tower appeared in a large explosion and clap of thunder. The black tower brought forth monsters and soldiers clad in a thick black armor with huge bunny ears. War burst out in the region and the prosperity and harmony quickly turned into a hell on earth. The regions government started a new army of the toughest and bravest citizens to go out and catch the monsters to be used against the black army. These brave souls were know as Trainers. The trainers went around the region capturing in the monsters inside of special capturing orbs made by the greatest inventors. Travel the region as one of the great trainers hired to help protect the region! Travel through and collect all 649 Pokemon! And defeat the many Black Commanders! Features: • Hatch your own starting Pokemon with the new egg minigame! • Capture every Pokemon from 1-649! Even legendary pokemon and starters! • No gyms, you must do story quests to earn medals, the equivalent of badges. • 3 full sized regions! Thats right, travel between Eggomletai, Sinnoh and Kanto! • Hunger system based of of play time! • Day night and seasons, based on play time instead of your computers time. • The follow me script perfected! Now have ANY Pokemon follow you no matter where you go! • FULL REAL TIME CHARACTER CUSTOMIZATION!!! You literally can create your own player overworld sprite! This includes in-battle back sprites and trainer card sprites! You want to were a scarf and look like Gary? SURE! You want to have oaks grey hair and wear a hat on your chest? SURE! You want to be badass like red and waer a cape? SURE! The limit is your imagination(and a max of 256 colors)!! • HG/SS gen 4 style sprites and graphics. • Mega Evolutions that are actually like gen 6, so no more fake mega evolutions by using evolution stones. Simply use the mega ring on a Pokemon in battle while holding a mega stone! It doesnt even take up a turn! • And so many more I dont want to waste time form playing the game to explain it all!!", "platform": "Nintendo Game Boy Advance", "release_date": "2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Joexv", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.83", "wikipedia": "", "video_link": "https://youtu.be/tFUVLhO9KYw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123726\n"}