{"name": "Pokémon Amnesia", "overview": "Story: You're 12 years old in the region of Verde. You've already beaten the Pokémon League and are well-known throughout most of the land. Life's going good, and one day you have a little friendly battle with your rival. Your rival's signature Pokémon, a Dusclops, prepares to execute a Curse move on your Pokémon. At the last second, as it unleashes the move, a small rock, a meteorite, 1/4 the size of a baseball, comes out of nowhere from the sky and streaks straight at you! The Dusclops is distracted and startled, and accidentally lays the curse on you. Your Pokémon floats upwards and moves almost instinctively, in front of you and straight in the meteorite's path, loyally risking its own life for YOU, it's Trainer. Your Pokémon is lethally pierced, and before you can comprehend, you're stricken, and you black out. Something strange happens...A mysterious force was at work during the meteor's hit. Later on, you somehow wake up 5 years later without your Pokémon. After having a mysterious dream with a somewhat-familiar figure in it, you suddenly wake up from your coma in your own room. After speaking to your mother, you visit the local doctor (who coincidentally earned his M.D. in Pokémon Research while you had been knocked out), who says that to help your amnesia, you should re-travel the land in which you had once already conquered...and to help the lazy doc get work done on the Pokédex project assigned to him. What happens next? Why aren't you dead, and who or what prevented this from happening? Play and find out! Features: • 386 Pokémon • Game focuses more on events and scripts rather than the Gym & Pokédex System • New Leaders • New Region • New Scripts • Different Palettes • OMGZ TEH PLAYER ACTUALLY SPEAKS!!11! • New Trainers", "platform": "Nintendo Game Boy Advance", "release_date": "2008", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Hedgehogger", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "https://youtu.be/XKkkAfkPGNI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123284\n"}