{"name": "Pokémon FireRed Backwards Edition", "overview": "About: Have you ever thought \"You know, man... if you like, went south of Pallet at the beginning of the game, you would TOTALLY be able to go through Kanto backwards\"? Yeah, didn't think so. But a while ago, I did, and I decided to make it a reality. Fire Red: Backwards Edition (also going by the title Der Erif when I try to seem slightly more creative), is a a hack of Fire Red in which the maps and scripts are messed with in a way that makes the player go through the gyms in the following order: Cinnabar Fuchsia Saffron Celadon Vermillion Cerulean Pewter Viridian. Other changes: • Many Pokemon have been buffed. In particular, plenty of bugs are stronger. • Some gym leader TMs have been changed so you don't get overpowered moves early. • Some typings have been changed. Not many, though. • Surf has been given a lower base power. • Cut has been given a higher base power and made steel type. • Naturally, every trainer has been changed. • Wild Pokemon have been changed as well. This hack has nearly every Pokemon between Gens I and III, with the exception of legendaries and a few others. • \"Teleport\" is now a psychic type explosion. • Pokemon appear in puddles, like Gen V. • There is a post-game, so be sure to make your file saves without savestates. Known Bugs: • Moltres doesn't disappear if you catch it, but it does if you kill it. • Some tiles in Saffron, the swamp, and Diglett's cave are clear when they should not be. • The rival grabs his Pokemon from the wrong spot.", "platform": "Nintendo Game Boy Advance", "release_date": "2012", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Slike", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://youtu.be/EL4i7oA7OpY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123884\n"}