{"name": "Pokémon Adamantite", "overview": "Story/Plot: The story begins with a dream,which depicts a clash between shadowy legendaries (Dialga/Palkia/Giratina), while other Legendaries (Darkrai, Cresselia, etc) watch. Suddenly a huge white void appears, and 2 gold eyes appear in the void. The screen begins to shake, and you wake up abruptly. When you wake up, you head downstairs, and leave the house, you are disoriented, and seem to be caught in a hallucination. By now, you are 13, 3 years after you defeated Cyrus and team Galatic and became the Sinnoh Champion, however, you can't remember any of it, as far as you are concerned, you are still a ordinary kid living @ home. However, after your dream, you start having Memorial Scream(signified by the screen flashing white), and disoriented, you wander into Lake Verity, and are attacked by a wild Pokémon. The wild Pokémon is a Shroomish, which confuses you even more, because Shroomish aren't native to Sinnoh. And without any pkmn on hand, you cannot do anything, however, a mysterious person behind you tosses you a briefcase. You open the briefcase to find the 3 Sinnoh starters (subject to change, if you want), after you choose 1, you battle the Shroomish, and win. After winning, you look behind you, and see that you were saved by Prof. Rowan (NOTE: Prof Rowan, and several other major characters have forgotten you ,due to memory loss), who then walks up to you saying: \"I see you were having a Memorial Scream, I too, have had these over time. And I have figured out the source. Someone, or something, has altered our memories, and I want to find out who\" (something along these lines, I'll buff them up in development) \"However, I can only trust people who are sensitive to the Universe, and are capable of Memorial Screams. Therefore, I would like you to keep that Pokémon, and recruit you into my research team, how about it?\" You must say yes. After being recruited, Dawn and Barry(can be renamed @ the start of the game) will appear from the lake entrance, and Prof Rowan will tell them that you've been recruited (NOTE: In this game, Barry has moved to Sandgem Town) Dawn will be happy & congratulate you, but Barry will be questioning about your faith and usefulness, and challenge you to a battle, he will have the starter with the opposing type that you chose, @ level 5 (don't worry, your Pokémon will be healed before the battle). After winning, Prof Rowan will complain about Barry's recklessness, and give you a pokedex and 5 Pokéballs, then he and the others will leave. Before leaving, Barry will tell you that you seem very familiar to him, and to meet him in his house in Sandgem Town. After that you will be forced to leave, and after you leave, Zepher (the leader of the new team) will appear and comment on your trainer ability, then he will make a ominous comment on how God will fall, and then he will disappear... Features: - An entirely new plot - A new team (the God Brigade) - New Items: God Orb, Spear Key, etc. - New Pokémon (only if I can get a GOOD spriter) - 8 new TMs - Uncatchable legends like Darkrai, Shaymin, & Arceus catchable - New post game events (ex. The Universe War) - New post game features/locations (ex. The Seperatist Islands, travel to Hoenn) - Maps of the entire Sinnoh region changed - New Pokedex (175 Pokémon)", "platform": "Nintendo Game Boy Advance", "release_date": "2009", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "rauzeruk", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "", "video_link": "https://youtu.be/po9mZ8VJx7A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123251\n"}