{"name": "Pokémon Saffron", "overview": "Azira is a dense region in South America that is home to many species of Pokémon while they migrate across the globe. Once every decade, a majority of the migration paths sync up and cause the region's Pokémon population to skyrocket! This event is known as the Great Migration. Trainers, gym leaders, professors, and adventurers come from far and wide to experience this grand event. Your family is from the Hoenn region, where your brother ventured out to become a Pokémon master! Now it is your turn. You and your mother have moved to Haba island, a small landmass located just off the coast of the mainland. Upon arriving, Professor Oak recruits you to help him with his studies. He believes the migration paths are directly related to the behavior of legendary and mythical Pokémon, and needs your help to collect data for his research on this phenomena. Explore Azira while you discover the secret to the migration routes, uncover Team Rocket's nefarious plan, and encounter some familiar faces along the way! Features: • Pokémon: The regional Pokédex consists of 287 Pokémon with a decent variety from every generation. All Pokémon have their stats, movesets, cries, evolutions, and sprites updated. The Physical/Special split has been implemented, along with over 100 moves and abilities from later generations. Legendary Pokémon events are spread throughout the game, not just post-game, so that your favorite legendary or mythical Pokémon can accompany you on your journey. • New Mechanics: Alongside many small updates (reusable TM's, BW Repel system, facing trainers, Fairy-Type, exp. gain on capture, etc.), new mechanics include a new field move system that does away with HMs entirely, Day/Night, Honey Trees, Berry Plants, Mega Evolutions, and more. • Updated Graphics: All graphics have been updated while staying true to the Gen III style. Everything from tiles and animations, to the trainer card, summary screen, world map, battle backgrounds, Pokémon sprites, trainer sprites, overworld sprites, etc. • Music: The soundtrack is a blend of music from FR/LG and R/S/E, as well as a few custom tracks.", "platform": "Nintendo Game Boy Advance", "release_date": "2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "mattymannnn", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/22KXDWKA1PA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123233\n"}