{"name": "Pokémon Clays' Calamity III", "overview": "Story: Ten years have passed sense an unnamed hero stormed Kanto and defeated the strongest Pokémon Master in the Indigo League, Clay. The battle lasted several days, resulting in the destruction of a city and the reduction of Pokémon gym. Without the minimum requirement of eight official gyms Kanto was knocked out of the Pokémon League Verified Regions. One decade has passed and Kanto has now been re-entered into the League. Gym Leaders have been re-evaluated and trainers have been raising their skills. Try your hand at this new take on an old generation of Pokémon; the conclusion of the open-world, Fire Red trilogy, Clay’s Calamity III. ------------------------------- What this game offers: This game, like the previous two, is an open world Pokémon patch of Fire Red. The available Pokémon have been greatly expanded upon and an attempt has been made to make every Pokémon (within the first three generations) available. All blocked passages, rival battle scripts, cuttable trees, locked doors and trainer blockers have been removed, making this a completely open world experience from the opening screen. Travel from city to city on boats, by foot or by hidden warp pads. This game, keeping with the aspect of the first two, has Pokémon locations based upon folk-lore, type regions, environmental factors (like moon stones) and level diversity. Hidden passages litter the region and secret trainers wait to be found. Continue the journey and follow this story to the epic conclusion! Changes: - Open world Pokémon Fire Red (duh...) - Mew is now usable - Deoxus is now usable - Trainers updated (more Mons, higher levels). Levels max at 36 before victory road for multi-mon trainers. Exceptions are gym trainers. - Special / Physical move split - Fighting Dojo is an official Gym - Flying Dojo added - Gym Leaders have a party of 6 - Gym Leaders levels increased - Some gyms have layout updates - ALL Pokemon are obtainable - Islands are optional (person blocking elite four has been removed) - Montres back in Victory Road - Updated NPC trading offers - Hidden legendaries - Level curve updated - Trainer AI difficulty increased - Warp tiles for easy fast travel - Some (not many) text dialogs have changed to give hints about 'special' changes - Magikarp merchant now sells Milotic - Safari Zone now has no cost and are regular wild encounters - Shop items have been updated (Elixers, Ethers, Moon Stones, Sun Stones, - Master Balls, Rare Candys, Left Overs, Etc.) - In-game trade side quest added - Saffron City has moved to Lavender Town after events in Clay's Calamity II", "platform": "Nintendo Game Boy Advance", "release_date": "2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "frabulator", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "https://youtu.be/ywazmyIOAsw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123389\n"}