{"name": "Pokémon Dark Violet", "overview": "STORY: This world is inhabited far and wide by creatures called Pokémon. For some people, Pokémon are pets. Others use them for battling. There are numerous mysteries surrounding them, and they are a popular subject of research. Either way, humans live in harmony with Pokémon, and they have done so for ages. Meanwhile, three teenagers, two from Pallet Town and one from Viridian City, decide to travel through the Kanto region to collect eight badges of Kanto, and to take on the Pokémon League Challenge. The names of the teens are Red, Green, and Blue, and they each have received a Pokémon from Professor Oak. They have no idea what awaits them, such as an increasingly threatening crime organization known as Team Rocket. The three of them will meet many people on their journey, some helpful, such as Blue’s older sister Daisy. They will also meet Kamon, a younger boy who claims to despise Team Rocket, and is always right on their tail. What are Kamon’s motives? Or more importantly, what are Team Rocket’s motives? FEATURES: • 210 Pokémon available • All 210 Pokémon will have sprites from my DS-style 64x64 Sprite Project • 113 new moves added. Over half of them are Gen IV moves, a few Gen V moves, and a few custom moves. No old moves were replaced, thus there is now a total of 467 moves. At the time of posting this thread, I have spent the past two months working on a ROM base that contains these added moves, which this hack is based off of • A few old moves have new animations • Physical/Special split • Important characters have their own battle theme • Lots of redone music • Custom instruments, such as the church organ and the \"orchestra hit\" sample • All 210 Pokemon have their moveset redone (new movesets are based closely off of B2/W2 movesets) • Entire game re-scripted & re-mapped from scratch • Map layouts and architectural design of the Kanto region will be based off of how it appears in HG/SS. However, unlike HG/SS, Route 23 will actually exist. • And much more… Ruby/Sapphire/Emerald-ified features: • R/S/E style graphics • Removal of the stupid flashback feature to make it more like R/S/E • Removal of first-person view artwork to make it more like R/S/E (and every single Pokémon game that's not FR/LG or HG/SS) • You literally face the trainer when another trainer walks up to you • Removal of colored-text based on gender • Proper item fanfares, instead of being limited to the level-up sound NEW GYM ORDER: 1. Brock 2. Misty 3. Lt. Surge 4. Erika 5. ??? (not Giovanni) 6. Koga 7. Sabrina 8. Blaine", "platform": "Nintendo Game Boy Advance", "release_date": "April 8, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Chaos Rush", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/OAvuDCWX_lI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123446\n"}