{"name": "Pokémon Aqua Blue", "overview": "Story: This takes place after the events of Fire Red. You are an average kid living in Saffron City. You're looking forward to your first ever Pokémon coming in through an ordering service, and after several weeks of waiting the day has finally arrived! Professor Oak contacts your mother and prepares to meet you in the Saffron City Pokecenter. However, when you arrive, things don't quite go as planned. During your visit at the Pokécenter, a meteor crashes into Silph. Co.! Before you know it, you're hurled into an adventure larger than you're prepared for. Upon arriving at Silph. Co., you find nothing but rubble and three mysterious figures who later reveal themselves to be Team Rocket. When things take a turn for the worst, you're forced to battle with them, and you find out the Pokémon you ordered was shiny! Despite your victory, they manage to steal the meteor. After a heated battle you black out only to wake up back in your home, being greeted by Professor Oak and your mother. Oak explains that the meteor is the cause of your Pokémon's alternate color, and instead of cataloguing the Pokédex, he asks you to collect fragments that fell off the meteor so they can further be studied. This adventure leads you all over Kanto, including regions previously only found in the Anime. Features: • Choose any starter from gens 1-3 • Brand new story using Kanto and adding just about all cities from the anime • Pokémon loot system (Wild fainted pokemon drop items) • Item crafting system, including new legendary held items • Cardboard Box able to sneak past trainers • Pokémon have a chance of dying when fainted. • Revives don't work in battle • Forced set battles. The option is completely removed and is unchangeable. You and the trainers you face are on equal footing. • LEGENDARY battles actually made Legendary. Multiple fights before you're able to capture them. • XX items and XXX items, capable of boosting stats to 5, or 8 respectively that trainers also use • Day & Night • Ability to see IVs in status screen • Item capable of modifying IVs (Only one in the game) • Shiny stones able to transform Pokémon into shiny Pokémon • Name change contracts, able to change even traded Pokémon's names • New upgradable Laptop Key Item capable of mowing grass, and flashing dark caves • Max Revive / Full Restore 6 pack items, capable of healing entire party • Ability to join Team Rocket • Rocket Balls able to capture opponent's Pokémon • Zonewide gameplay mechanics • New custom moves for each type called Special Machines • Mini Games • Updated Pokémon graphics (with custom art on select few) • Ride a Blastoise while surfing! • Advanced AI • Huge difficulty increase • Gym leaders scale to your level +3 and match how many Pokémon you have +1 • HG/SS Kanto Music • Face Trainers during battle • B/W Repel System • D/P Fonts • Infinite TMs • HMs are able to be unlearned • Vendor Prices increase or decrease depending on the day • XP when capturing Pokémon • Run jump off ledges • Inverse battles • Contests • Critical hit nerf • Only able to capture original 151 as well as some Fakemon, and Missingno and starters ofc. (not including those captured by team rocket balls) • Rates for shiny Pokémon increased in order to match story", "platform": "Nintendo Game Boy Advance", "release_date": "2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Criminon", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://youtu.be/3wRrv4lfQ94", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123283\n"}