{"name": "Pokémon Drab Conspiracy", "overview": "PLOT: Kanto. Some years after the Hoenn storyline. Have you ever wondered how a country would look like after hurricanes, earthquakes, volcanic eruptions and seaquakes? This ROM hack brings you back to the first Pokémon region, but with a new twist: Everything described above has already happened, because of the mess Maxie and Archie did in Hoenn. Yup, shit is bound to happen when you mess with the two continental Pokémons to terraform the planet... Follow an all-new experience set in a never before seen Kanto. Experience the untold story of a young trainer who's beginning his first grand adventure. But... Something's wrong. You'll meet people whose purpose is not to steal Pokémon or make money, nor do they use their Pokémons to change the climate or anything else. They... Don't use their Pokémons at all! Maybe their scheme is something beyond your comprehension. Maybe something has left them disappointed and has made them willing to fight... Who? Or what? Will those people get their revenge? Venture across this messed up Kanto, bigger but also more mysterious. Join the Protagonist along his journey, debunk conspiracies and become the very best, or... Die trying. TEAM (From PokemonHacking.it): IvanFGK, Andrea, Flygon, Lex@97, Gabriel, Stygian, Carl_J90 OTHER COLLABORATORS: Unix, DragonType, MasterNinja98, PacoScarso, Zeppho, Zer0, Spinda94, eMMe97, fuji97 CREDITS: 874521, Kyle-Dove, Speedialga, Sagaxxy, Crito, WesleyFG, 0RCV0, CriSH698 INFORMATION: WHY A BETA RELEASE AND WHAT IS ITS CURRENT STATUS? This beta contains a minimum of five/six hours of gameplay (probably more), so we decided it was a good starting point to show the game to ROM hack enthusiasts and see how it's received among the audience. With a bare minimum of five hours of gameplay, but probably more if you try to experience all the optional content the game offers, the beta it's currently a good indicator of how the game will play out in the future. We have also used this release as a beta testing program, so that we could fix bugs and glitches people found on their playthoughs. WHAT THE GAME LOOKS LIKE AT THE MOMENT? With the current release (1.5), we are proud to announce that the game is completely playable with barely any bug across the adventure. Just a sidenote for those who may have not noticed while reading: The game is NOT a remake, nor will it ever be one. Drab Conspiracy is a completely original adventure set in a Kanto built from the scratches, completely overhauled and with little similarities to the original region. We are not even using Fire Red, we're working on Ruby, so trust me when I tell you you won't find even a line of text from the original games. WHAT SETS OUR GAME APART FROM OTHER ROM HACKS? The maps are so big they could almost be considered \"open world\", and they are filled with optional content players can choose to experience or bypass altogether. Everywhere in the game are hidden items, quests, and sometimes even branching paths in the story. Will you help the lab's assistant or act as a frightened child? I'm not going to tell you how to live your adventure, but be aware: certain actions could have consequences... This doesn't mean our game is a sandbox experience, because it's not. It's a single player, story-driven game, and the plot takes a huge part on the adventure. But we wanted the adventure to be YOUR adventure, and so we've filled the game with content so that the player can choose how to live his own, personal experience. WHAT WILL THE FINISHED PRODUCT LOOK LIKE? We are trying our best to deliver the best possible experience to our players. This means we are working hard on building complex maps filled with secret content and subquests, shaping awe-inspiring graphics and orchestrating original and fun events, involving good story and fun characters. There will be a minimum of 15/20 hours of gameplay, but again, it could be more depending on how the player decides to live his adventure. We are not trying to ship a game comparable to the \"sacred cows\" of the genre, but we'll try our best to deliver the best possible experience to our players: We won't probably be the very best, but we'll at least deliver a fun, emotional game that can let you spend some hours without regretting it! HOW LONG WILL IT TAKE FOR THE FINISHED PRODUCT TO BE RELEASED? We don't have a release date to share at the moment. This is not a job, this is a fanmade project we work on during our free time. We hope to release the second beta during 2019 holidays, but of course it's still just a placeholder date. OUR STORY: our journey has begun way back on September 2 2015, as a Joke between myself, the founder (IvanFGK), and my friend Stygian. From there onwards, the most skilled among the italian ROM hacking community have gathered and participated in the development of the game. After a long hiatus in 2017, the development resumed during summer 2018, when most of the game have been shaped and the first beta released. It was a somewhat buggy release, and it would take six months for the game to be released in the current, definitive form (v1.5), with bugfixes and new content (two new maps, an old map completely redesigned, new events and gameplay balances). We consider ourselves skilled in what we do, but we've never worked on a project of this caliber - a game with new graphics, settings and original story and characters. As the founder, I'm proud of the work of everyone who has worked with me and all the support they have given me during these years.", "platform": "Nintendo Game Boy Advance", "release_date": "June 19, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "E²VaN", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/GNauIaKa7Uo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123686\n"}