{"name": "Pokémon Eruption", "overview": "About: The game was designed to play as the Male character. Imagine yourself in Silver's shoes. Yes, Silver from the Pokémon Gold/Silver and Pokémon Chronicles. You're a fourteen-year old boy born, and raised in Johto. You used to be a bad kid, but ever since you're fight with Jimmy(also from the Gold/Silver) at age thirteen, you've changed. Now, in that decision to change, you'd like to start over. You're mom still thinks that it's 'exciting' to get you're first Pokemon, but why wouldn't she? She loves the new you! Well, you think it would be like the Pokémon show's on TV, where everything runs smooth. But in an effort to get your first Pokémon, you discover another Evil Organization, Team Knox! They want to control every single Pokémon in the world, to make cash, dollars, yen, euro, etc. Either way you put it, it all comes down to money. They want to make the world fear them, and by doing that they become all-powerful. You see them stealing CYNDAQUIL at Walby Cave terrace, then and there you secretly made up your mind. You want to stop them at all costs! Your goal (without being told, in-game) is to stop them from gaining control of the Legendary Pokémon on an exciting adventure with tons of scripts, jaw-dropping events, and eye teasing tiles in Pokémon Eruption! Features: • Play as Silver! • Experience a Hack, where the plot is ridiculously mind-blowing • Experience New scripts and events!, all in a • Brand new region; SéNJO • Battle with New rivals, and friends! • Travel through SéNJO with stunning tiles! • Mini-Quests to keep you busy. • Maps designed to look and feel real! • Field Moves to unlock new areas ^_^ • POWER HOUSES in place of Gyms, Plays significant role in Plot! • Tons more features, but all reserved, for you to find as you play!", "platform": "Nintendo Game Boy Advance", "release_date": "2009", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "cooley", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://youtu.be/KfvoYE2e_xs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123900\n"}