{"name": "Pokémon Mystery Dungeon: Red Rescue Team", "overview": "The player starts out as a human who turned into a Pokémon, which can be one of sixteen Pokémon (Bulbasaur, Charmander, Squirtle, Pikachu, Meowth, Psyduck, Machop, Cubone, Eevee, Chikorita, Cyndaquil, Totodile, Treecko, Torchic, Mudkip and Skitty) and is determined by a personality quiz taken at the beginning of the game. The player chooses a partner Pokémon which is one of ten Pokémon (which excludes the last six stated above and the Pokémon of the same type). The game is mission-based with many jobs, which can be found on the bulletin board, requested by mail, or initiated through story events, and include rescuing Pokémon, delivering items, and escorting clients. If the player successfully completes a job, they receive a reward, and Rescue Points, which increase a team's rank. These jobs take part in dungeons, of which the layout is randomized. The objective is to either finish a job, or go through all the floors to find the exit. In the dungeon, there are wild Pokémon that battle with the player's team. These battles are turn-based, and take place in the dungeon map. Pokémon fight using the four moves they know, by using a standard 'A button' attack, or using projectiles and other items. While going through the dungeon, the player gets hungry and has to eat food, either found in the dungeon or bought in advance. The player will fail if the main character is defeated. Before the credits, the player will also fail if the partner is defeated. However, supplementary allies (including the partner, after the credits) can be lost, at which point they will return to the base.", "platform": "Nintendo Game Boy Advance", "release_date": "September 18, 2006", "game_type": "Released", "esrb": "E - Everyone", "developers": "Chunsoft", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.15", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Mystery_Dungeon:_Blue_Rescue_Team_and_Red_Rescue_Team", "video_link": "https://youtu.be/8Dh1E_DiZRU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2250\n"}