{"name": "Pokémon Super Rising Thunder", "overview": "Welcome to a world with no Gyms..., no Marts..., no Pokémon Centers..., and no Pokéballs. Once busy roads are cracked and overgrown with weeds, and cities - bustling once upon a time - lay in moldering ruins, home only to scavenging beasts and forgotten history. The residents of your little village whisper about a story - passed down to them through untold generations - detailing a series of devastating, terrible Flashes that had destroyed what was once, it is said, was Eden. The Flashes came from nowhere, the villagers say, and vaporized everything in their paths, leaving terrible sickness in their wake. Nothing that lived anywhere near the Flashes survived - including a mysterious race of creatures who were said to possess great magic. This is the world you and your sister were born into - small, helpless, and innocent; and warned from your youngest days to never take a step from the secluded forest village where your small band of survivors huddled. You listened - after all, you were a timid child, and not willing to tempt fate - but something ached within you, all the same. Was the Earth ever really an Eden? What of the magic-wielding creatures - did they still exist? Had they ever existed? The answers the villagers gave to these questions contradicted each other - what was the truth? And was there such thing as a better life? After a horrible tragedy, you fall into a deep sleep and have a mysterious dream - a great Lord, who dwarfs you in size and in majesty, appears before you and gives you dire news...and a miraculous gift. A terrible evil that could destroy all that remains of the world is lurking in the far frozen North - and although you are young, and although you are small, the Lord trusts in your great strength of soul to vanquish the evil - and perhaps pave the way for Eden to begin anew. The power of \"Super Rising Thunder,\" and the inner strength of a timid young soul - is it enough to save your crumbling world? But as brave as you are deep inside, there is one catch... You're a Pichu.", "platform": "Nintendo Game Boy Advance", "release_date": "2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Perri Lightfoot", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "0.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bHFRZNOJdkg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122039\n"}