{"name": "Pokémon Electric Yellow", "overview": "The Story: Its the same from the series but will only show Red's and Yellow's side of the story (well that's what it mostly is in the series) and although the regular events from the series will be there I will tweek a little bit of it to make it have its good parts. Pokémon Adventures is divided into several distinct parts, and these, in turn, are divided further into volumes and many smaller chapters. There are seven major division at present, with five of them published as manga in 26 volumes.he first story is based on the Red, Green, and Blue versions of the game. It is 3 volumes long as to reflect the 3 original versions of the game, with volume one being on a red pallette, 2 on green, and the 3rd on blue. It shows Red, the protagonist, and how he received Bulbasaur from Professor Oak and gets his Pokedex to start on his Pokemon journey, collecting Pokemon and battling gym leaders for the eight coveted gym badges. He later meets his rival Blue (who received Charmander) and is oddly enough, Oak's own grandson. Later in his journey, he encounters con artist Green, who sells him fake Pokemon items. She has stolen a Squirtle, the one stolen from Oak’s lab and evolved it into a powerful Wartortle. During the series Blue developes feelings for Green and hides it with his attitude. Red goes on to battling gyms after having been informed of them by the overweeny rival and he manages to receive the Boulder Badge, Cascade Badge, and the Rainbow badge from Brock, Misty and Erika respectively (who are plotting to defeat Team Rocket). He also teamed up with Misty (the Cerulean City gym leader) to foil the plans of Team Rocket on Mt. Moon and retrieved her brainwashed Gyarados, which later became his own. Other achievements include his capture of various Pocket Monsters, namely Pikachu in Pewter City, Snorlax when it blocked a route in a bike tournament, Eevee, who had been experimented on by Team Rocket, Aerodactyl from the Old Amber, Misty's Gyarados, and so on and so forth with less-used Pokemon. In addition, his Bulbasaur evolves into Venusaur and his Poliwhirl to Poliwrath. Later, Oak had been kidnapped by Team Rocket for creating a Mewtwo, and Red, Blue and Green arrive at Saffron City to take on the elite of Team Rocket. Red’s opponent is Electric-type trainer Lt. Surge, Blue’s opponent is Poison-type ninja trainer Koga, and Green’s opponent is the Psychic gym leader of Saffron City, Sabrina, with each Rocket boss having one of the three legendary winged Pokemon, Articuno, Zapdos and Moltres. They managed to defeat Team Rocket and save Oak. Red's Ivysaur evolves into Venusaur in the process, and Green's Clefairy into Clefable utilising Red's Moon Stone. Red then travels to the Indigo Plateau to battle his rival Blue, having gained seven badges, but also prevails against the evil bio-weapon Mewtwo and Team Rocket's leader and legendary missing Viridian Gym Leader, Giovanni, on the way. Red later battles Blue in the Pokémon League Championships and emerges victorious, claiming the title of champion of the Pokemon League. Blue is second place, and Green finishes third, after Professor Oak withdraws from the competition. The next storyline is very loosely based on the Yellow version of the game, serving mainly as an original story to bridge the gap between the original adventure and the events in Johto. It is 4 volumes long. Red has disappeared after receiving a challenge letter sent to him by Lorelei of the Elite Four. They plan to lure him to them, so as to get information on Giovanni’s whereabouts. They also needed his Earth Badge. Only Red’s Pikachu, Pika, managed to escape, Red having been encased in ice. Yellow decided to go look for Red, as Red had helped her catch a Rattata before. Yellow asked Blue to train her in the skills of battling. Later, Lorelei catches up with Yellow and Bill, who found his way to Yellow. Lorelei traps them inside a cave using her Dewgongs's Ice Beam. Dewgong's Ice Beam merged with Cloyster's Spike Cannon to make deadly missiles. Yellow attached Pika's Pokéball to her fishing rod and used a small opening to cast Pika outside to see this. Yellow used her Viridian Forest-given ability to see what Pika saw. Anticipating Lorelei's actions, Yellow does the same with an empty Pokéball to have Lorelei destroy the decoy. A well-placed Ratatta breaks the ice with its teeth. Before she leaves, Yellow says her name was \"Amarillo del Bosque Verde\" (Spanish for Yellow of the Viridian Forest). Yellow, Blaine, Blue, Green, Bill, Lt. Surge, Koga and Sabrina join forces to bring down the Elite Four together. They found out that Lance’s master plan was to use the Gym Badges and create an amplifying effect at Cerise Island to power up a mysterious Legendary Pokémon and destroy all humans in the world except themselves. They felt that humans and Pokémon were not meant to coexist. Red turned up later at Cerise island to help Surge and Bill defeat Bruno. It is also revealed that Giovanni was the one who rescued Red from his ice coffin. The trainers send their power to Yellow, and with their combined strength she manages to defeat Lance. The third adventure is based on the Gold, Silver, and Crystal versions of the game. It also includes the trainers from the First and Second chapters. It is 7 and a half volumes long, which is slightly longer than the first and second storylines combined. It features the protagonists Gold, Silver and Crystal, and is centered mostly around the Johto region. In accordance with the games, Team Rocket tries to make a comeback, but instead of being defeated before Gold reaches the Pokémon League (as it happens in the game), Team Rocket actually attacks the League. Also, the main goal in the story is not for Gold or Crystal to collect all the badges, but for Gold, it is to team up with a Cyndaquil and get Totodile back from Silver (who stole it), and for Crystal, it is to complete the Pokédex.", "platform": "Nintendo Game Boy Advance", "release_date": "2008", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Melash", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "https://youtu.be/1qExTe8fxAc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123736\n"}