{"name": "Pokémon Alternate Nusantara", "overview": "Story: There are two Pokemon Academies in the Point Region: RFTC and POTC. Since the day they were found and established, they have been rivals of each other. And you are a student of the RFTC Academy. You have been studying here for a very long time with two of your closest friends, Dallas and Seriva. Day by day, you three enjoy the meals – take part in the daily sport activities – study in the Pokémon classes – join the simulated Pokémon battles – etc. Finally, you three have graduated and get the necessary license to freely do as you want. Together, you start a journey called A Wandering Adventure because you just want to travel around the world and beat the Gym Leaders to get their badges. Well, nothing is easy for you. Along your way, you have to deal with many trainers come from POTC. They tell you that your RFTC Academy is actually a criminal organization. And your RFTC also tell you the same thing. Well, surely you will be confused, and you do not know who is right who is wrong in this story. There is only one way to know the truth: keep travelling around and search for the necessary information before concluding! And so, you continue your journey. You will meet a lot of famous trainers from several clans and create a bond with them. Features: • The basic language was remained the same, although not too much. • New starters and Pokémon from different regions. • The name of the clans in this game are the names of the famous Pokémon Communities in Indonesia: PSI – PI – MBI – PDA – POINTS. • Many Pokémon from Gen IV and Gen V. Also with Moves. • New TMs. • Physical/Special Split. • Move sets from XY-Competitive.", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Marsya Modeus Herdamas", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/J0M8aK0svyY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123287\n"}