{"name": "Pokémon Rocket Strike", "overview": "Introduction: This is a Hack of Pokémon FireRed US. Status: 100% completed So what're the differences to Pokémon FireRed? Here's a little list: -Play on the side of Team Rocket! -Catch over 380 Pokémon, most of them catchable before the Pokemon League! -Slight evolution changes for a few Pokémon: For example, Trapinch evolves at Level 30 instead of 35, but Vibrava will evolve at level 50. -Relive Kanto as it should've been(at least for me)with new areas to explore and new challenges awaiting you! -BW-Pokémon-Sprites! -Gen 4 & 5 Pokémon! -Pokémon which acquired special circumstances to evolve(like trading or happiness) will evolve more easily through level up(or evolution stones). -Much humor and many references to real life happenings and characters! Some may like it, some won't, that's only up to you. -Your adventure is far from over after the Pokemon League! -The story has been noticeably changed(isn't that obvious anyway?)! -Difficulty has been increased as I think that the original FireRed(and by the way most of the Pokémon games are way too easy)lacks difficulty! -Meet familiar faces from other Pokémon games who'll be either friend or foe(rather foe, better than if it was the opposite, right?)! Very important: Read this before you play! -Make sure to get the National Pokédex or most of your Pokémon won't evolve! You get the National Pokédex pretty early in the beginning. -Some road blocks will only vanish if you got the right badge! For example, the policeman at Route 107 will only disappear if you got 2 badges(Sometimes you need to leave and come back. -Talk to everyone. Seriously, even if you don't like to hear(read) what Youngster Joey has to say about his Rattata, listen to the people. I hope you won't regret this. -Open your eyes. Pokémon is about discovering on your own. When you've spent at least a month, and you still can't progress, then feel free to post your problem here. After the main story: If you want to continue, you need to have captured at least 60 Pokémon!, and then talk to you-will-know-who. It doesn't matter if they're originally from Kanto or from other regions!", "platform": "Nintendo Game Boy Advance", "release_date": "", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "AmazingCharizard", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124556\n"}