{"name": "Pokémon Darkfire", "overview": "Pokémon Darkfire is a Pokémon Emerald ROM Hack started in April 2018. STORY: Pokémon have been acting strange lately. Some are even going missing completely from their trainers. Others won't respond to commands. The region's most formidable scientists have blamed it on a severe virus and any evidence is non-conclusive. You are a young boy living in the beautiful region of Tenjo, east of Hoenn. Your friend, Tyler, thinks it's a good idea to set off with you and explore the region and its many mysteries. After some time exploring, you are confronted by a suspicious man who says he has been watching you battle and could use your talent in a much more brutal kind of battling, and the riches and fame that will come with this battling is something not to be ignored. He then tells you to \"keep it up\" and disappears. From this point, Tyler starts acting strange and suggests it's better to explore alone, and disappears into his own adventure. After this, You begin to see symbols of this suspicious man everywhere. One day on your journey, Tyler's mom calls you one day crying, telling you Tyler has gone missing. And you set off to find him. As you meet new friends, they begin to assist you in the search for Tyler. What's worse, frightening things are about to unfold... You'll be involved in secret underground battling. These type of battles have no rules. Participants make Pokémon fight to the death for money, power and fame, and the crime rate is at an all-time high. Through plot-twists and complete freak-outs, you will experience everything from brutal underground battles, to missing legendaries and missing people. Some say a human is running the underground corruption, others are saying no human can be so cold and it is an evil Pokémon pulling the strings. Who will be the leader of this evil organisation? Where is Tyler? Why are the Pokémon acting so strangely? FEATURES: • Brand New Region to Explore! • Completely Custom Music • Gen 7 Battle Mechanics • Double Wild Battles • Beautiful Battle Backgrounds • Gyms Replaced With Battle Tournaments • EXP From Catching Pokémon • Dizzyegg's Amazing Battle Engine • Dark & Gritty Storyline • Infinite TMs • 252 EV Cap • Stat Nature Colors • Running Indoors • Battle Tournaments Are Randomized • Brand New Movement Mechanics IMPORTANT: This hack has been getting updated quite frequently, check out the Darkfire Discord for newer versions.", "platform": "Nintendo Game Boy Advance", "release_date": "May 24, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Karl", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://youtu.be/rPgZ-2u2NV8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123449\n"}