{"name": "Pokémon Distortion Black", "overview": "Introduction: Hi, I'm Nex. I've been hacking Pokemon for years now on and I want to release my hack here on Pokecommunity! In my opinion, it's my best hack so far and I learned a lot in the meantime (but not too much XD),and this hack should contain a lot of features. Now to the game: The Xenon Region is a mysterious and wonderful region filled with hidden secrets and unknown places,it's said that a legend called \"Giratina\" lives in the Region. It's your mission to discover all hidden secrets in the Xenon Region and stop Team Crisis from their evil plans! Freatures: • New graphics • New region • Pokemons from other regions • New story • Quests • Side areas • 2D side scrolling areas • Unique dialogue Story: You're 14 and wake up from a bad nightmare. Today, you will get your first pokemon from Prof. Brick after leaving your house. After you got your Pokemon, Prof.Bricks says he is busy and has to go, you should meet him in his lab.When you arrive at his lab, a scientist says that Prof. Brick is not here.. What happened to him? Where has he gone? Was he kidnapped? After that you go to a cave in the next route. You see a mysterious man jumping down a ledge and going to the exit of the cave some guys with a \"C\" written on their shirts are following him...You try to follow this guy and arrive at the next city. You want to go to the gym, but the same guys with the C on the shirt are running out of it! You talk to the gym leader and he says that they stole his pokemon! What happens next? Who were those guys? Where are they now? It's your mission to find out!", "platform": "Nintendo Game Boy Advance", "release_date": "2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Nex", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/50oPPUhck9Y", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123691\n"}