{"name": "Pokémon Theta Emerald", "overview": "This is a project that I have been working on for almost a year, and now I can finally say that this game is ready for a release. This is completely different from the regular Emerald game you are used to. However, it is different, in a very fun and cool way :) Features: 650 Pokémon: This may not be the first Emerald sideshow game to have more Pokémon than just 386, but, as of May 2015, this is the Emerald sideshow game with the most Pokémon to catch. Not only that, but every single one of them is catchable, either through an event, or in the wild. Not only that, but the Trainers, Gym Leaders, Evil Teams, Elite Four, and Champion have new Pokémon as well. 100+ new moves: In order to compensate with the new Pokémon, there has been quite a few new moves added to game to add to everyone's movesets. Some with new animations, and some with new effects. Physical/Special Split: To make the game more current, a proper Physical/Special Split has been implemented to the game, including icons to denote each move. \"Have Specific Pokémon\" Events: In order to encounter certain Pokémon, or more specifically, legendary Pokémon, you must have one to three Pokémon in your party in order for the event to work. Fairy-type: Yes, the Fairy-type that has been shown in Pokémon X & Y, has been added to the game. Updated Stats: Also, Pokémon that got their stats updated in X & Y now have them updated in this game. New Evolution Methods: Pokémon that evolved through trade have a different means of evolving. Not only that, but because of the new Pokémon, completely new evolution methods have been added, like Map Name Evolution, Move Evolution, etc. That, and three new evolution items have been added. The Dawn Stone and Dusk Stone from Diamond and Pearl, and the Link Cable from Pokémon Mystery Dungeon. Running Shoes Update: Like the newer generation games, you can use the running shoes to run inside of buildings. Reusable TMs: Introduced in Pokémon Black & White, TMs can be used as many times as you like. Egg Hatching Level: The levels of eggs that hatch are now at Level 1, just like in the newer games. Catch EXP: A mechanic introduced in X & Y, now when you capture a Pokémon, your Pokémon will gain EXP. De-capitalization: NO MORE OF THIS. Maybe a few spots, but I'll fix them as time goes on.", "platform": "Nintendo Game Boy Advance", "release_date": "May 20, 2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "LCCoolJ95", "publishers": "LCCoolJ95", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90878\n"}