{"name": "Pokémon Sweet Version", "overview": "Hack name: Pokémon Sweet Version Hack of: Pokémon FireRed US Version 1.0 ROM Language: English Reminder: When you play this game in VBA make sure to change the emulator's save settings to Flash 128k or you can't save! \"Hey, wouldn't it be cool if Kanto turned into Candyland?...THAT ACTUALLY HAPPENED?!\" Welcome to Pokémon Sweet Version, where battles are carried out with the power of dessert! Travel through a confectionate wonderland that resembles Kanto but is quite different, as those who explore will soon discover! Capture 151 candified Pokémon and fill up the pages of your Cookbook! We've spared no expense in making the experience unique, which is why there is a brand-new type chart consisting of twelve flavors of ice cream. (Apple is totally a flavor of ice cream.) And if you're sick of Kanto, you'll be pleased to know this is totally not Kanto, no matter how much it seems to be. As the world is designed to reward exploration, there's something waiting in every map that may not have been there before, whether it's a cleverly hidden item or a dreadfully bad pun. (We have plenty of those.) The PokéSweets themselves are as delicious as they look, and they look good enough to eat! Features: - Brand-new type chart with 12 types (Note: there is no physical/special split) - 151 PokéSweets to capture (no trading necessary) - PokéSweets are based on Pokémon from all five generations (plus three from Gen 6) - Kanto has been dessertified (this is now a word) - Most trainer battles are Double battles - 50% more enjoyable than Fire Red - Two rivals...okay, three, but the third guy's lame. - Capture PokéSweets or craft them from berries - Two factions looking to steal your sweetrolls - New music in many areas - Re-match the gym leaders as much as you like", "platform": "Nintendo Game Boy Advance", "release_date": "", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Ephraim225, Channini", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124577\n"}