{"name": "Pokémon Emerald Green", "overview": "Story: The game takes place in the KANTO Region, except a slight twist has changed the way everyone interacts and battles with each other. The successful crime syndicate Team Rocket has partnered with a new company called the Trade Bureau, an organization that makes profit through buying and selling Pokémon. Together, they send operatives to catch and steal wild Pokémon by the hundreds to the HOENN Region. Meanwhile, agents in HOENN return the favor by shipping exotic HOENN Pokémon back. Because of this mess, all the KANTO Region Pokémon have decided to migrate to HOENN, while all the HOENN Pokemon did the vice versa. This event was marked as the HOENN Migration, which, in the game, happened not long ago. You, the hero, are a new trainer starting in this HOENN infested region. Grabbing the last KANTO Pokémon, you must fight your way through the region, and help the cause to destroy the corrupt Trade Bureau from causing more regional trouble. Utilizing the wild HOENN Pokémon, you will battle trainers who still have Kanto Pokemon, and ultimately, be forced to face the unstoppable heads of both Team Rocket and the Trade Bureau. The game is a true region vs. region fight, and the outcome as to which one wins is up to you. Features Pokémon Emerald Green isn’t the best rom hack out there, but it puts some quite challenging twists on the gameplay. It is recommended you Nuzlocke the game. Now, here are the core aspects of the game: • All KANTO Pokémon in the wild have been replaced with their HOENN counterparts. However, the trainers keep their KANTO Pokemon for the most part. This gives the region vs. region flare • National Pokédex is given to you at the start of the game. • Edited Storyline and Dialogue to help you immerse yourself into the game. • Boss Battles, such as Rival, Gym Leaders, and Giovanni, have much stronger teams with unique movesets. Some have both KANTO and HOENN Pokémon! • Safari Zone is better, it includes a wide variety of Pokémon. Bugs: -Some dialogue boxes are slightly messed up. Doesn’t affect gameplay.", "platform": "Nintendo Game Boy Advance", "release_date": "2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Sulfurous", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/JZmhuUBH8n8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123791\n"}