{"name": "Pokémon Eternal Snow", "overview": "A Pokémon ROM/Game hack by Reshiram using Pokémon Emerald Codebase/Engine in English. It is available to download now. The last update happened on January 24, 2018. Pokémon Eternal Snow: Do you know Reshiram? Do you fall in love with its beautiful appearance? The hack Pokémon Eternal Snow will let you enjoy that feeling with Reshiram. In this game, Reshiram is the embodiment of snow. One day, a dark and powerful force attack Reshiram. After fighting so long, it lost its power and covered itself in a mountain of snow. From that fight, the entire region is covered in snow. You know about this, you want to save your people and Reshiram also. Do not hesitate anymore. Features: There are 650 Pokemon in total. Their stats – evolutions – movesets – Dex entries – sprites are updated. The new Fairy type gets its old and new Pokemon – moves also. Eevee can now evolves in eight different forms. There are 4 new evolution items like Dawn Stone – Dusk Stone – Shiny Stone – Link Cable have been added. New evolution methods like Map Name, Move Name. No trading evolution anymore. More than 100 new moves with new animations – new descriptions – new move effects. The old moves are adjusted with Powers – Accuracy – Effects. The TMs are reusable now. You can hatch Eggs at Level 1. You can run indoor. You will get EXP after capturing a Pokémon. There are 3 different rounds of stories. You will face 18 different types of Gym in this game. 10 gyms have been added in the second period of the storyline. 3 different leagues. The trainers and battle backgrounds are replaced with the Diamond/Pearl style. More than 22 new Pokémon (XYZ Legendaries, Mega Evolution, etc). Some specific moves of Groudon – Kyogre – Rayquaza – Hoopa – Diance – Volcanion. After defeating the first league, you can set your foot on a planet like Mars – Venus – Pluto. There will be some snowy places. In the second and the third region, you will face a lot of new trainers. The Day/Night and especially the weather system is very beautiful.", "platform": "Nintendo Game Boy Advance", "release_date": "April 1, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Reshiram white as snow", "publishers": "", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "https://youtu.be/m6KjLDlfRtk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115012\n"}