{"name": "Pokémon: A New Dawn", "overview": "Intro First off I just want to say that this hack is meant to look plain graphically. That's the whole point. For reasons I would rather not get into in this it will almost definitely not receive a full blown tile/ow makeover. So if you're looking for a hack that is just all new tiles then this is NOT the hack for you. As some of you may know, I'm Joexv, creator of Pokémon Blackened Night and The Holiday hack Series. Long long ago, I joined this site to start working on Pokémon hacks. After about a year of learning, I released Pokémon Blackened Night. As it continued to grow and I grew in my hacking skills I decided it was time to write up stories for a sequel and possibly a prequel to the game. Each game being its own story line I could easily release and create them as I saw fit. It wasn't until I stopped major production on BN that I actually got down to working on the sequel as a possible project to replace my main focus. And that is how A New Dawn was born. Not only a new project to me, but a project for all. A New Dawn, will feature a revolutionary story line system that is created by you, the players. A New Dawn will feature multiple stories and countless side stories that are created by players. Any one can submit a story line or side story for the hack. Not all stories will be accepted of course. But if your story is approved, then you can expect it to be added into the game, one way or another. for more information on approval and regulations on stories please read the section marked STORIES. Prologue The black sun. A calamity caused by the power of the Arcanate Machine turned Black by the Black stone. Team Night caused the Arcanate Machine to produce a dark light that would cause the fabled \"Darkness\" to rise from its tomb to envelop the world into an endless night know once as the \"Eternal Night\". Team Night's plans were foiled by a young orphan from Southfalls City who's family was killed by the \"Darkness\" when he was a small baby. 3 years later the Altar Region has grown and prospered. Until one day a new threat to their peace rises up from the shadows. A threat with ambitions so high that it will reach the heavens.... Story Excuse any and all grammar errors or typos as this is only a rough draft of the story: 3 years after the \"Eternal Night\" crisis, the Altar Region has returned to peace and prosperity. 4 young adults begin a new chapter in their lives as students of the famous Professor Rose of the Altar Insula. Little did they know hidden in the shadows and ruin of the failed Team Night, sinister Pokémon cloaked in shadows start to appear in the Isles. Just as the students begin their journey, Professor Rose mysteriously disappears sending the students' journey down many dark paths. Features • New Regions(obviously) • 2 different Pokemon Leagues, each with 4 gyms, and their own champion. Plus • an additional champion of both regions. • FR/LG style tiles with a nice needed twist, to keep that nostalgic feel while creating anew atmosphere • Over 10 different starter options • Travel with companions • Gameplay is setup as chapters • Community driven chapters! • Side Quests! • Pokédex split into two to reflect the northern and southern half of the Altar Insula • There will roughly be 350 Pokémon between the two regions(Northern and Southern) • Shadow Pokémon(Yes another hack with Shadow Pokémon. But we're taking a little spin with it) • Shadow Pokemon act like Primal Mega Evolutions - Release your Pokémon's inner darkness! • Pokémon will become corrupted if they are not friendly with their trainers", "platform": "Nintendo Game Boy Advance", "release_date": "2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Joexv", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.83", "wikipedia": "", "video_link": "https://youtu.be/K2tKhQJfUp4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123248\n"}