{"name": "Pokémon Kanlara Ultimate", "overview": "Kanlara is the region where you were born. You spawn here, and you meet up with your childhood friend and rival. You are informed that the Professor wants to see the both of you. At the Lab, Professor Woke lets you know that apparently, Kanlara is under attack by a group known as Team Rocket. You recieve your first Pokémon, and together you and your rival set out on your adventure. Your goal is to become the best trainer you can, but also to put a wrench in Team Rocket's plans and make sure they're put in their place. Later, it becomes apparent that Team Rocket is gaining too much power, and the entire fate of Kanlara will rest on your shoulder as you embark on your path towards the final battle, that will decide it all... •Travel through the new region of Kanlara •Explore a new story •Catch and battle 386 different Pokémon from generations 1-7 •P/S/S split, EXP on capture, running indoors, and more •Fairy type and a brand-new type called 'Demon' •Expanded move list including Shift Gear, Coil, X-Scissor •Custom TM list •24 original Demon Pokémon • Around 25 original moves with custom move effects •Level-up lists for Gen 3 Pokémon have been updated to Gen 7 (US/UM) standard •Sprites for nearly all Gen 3 Pokémon have been updated to Gen 4-style sprites Q: What is Kanlara Ultimate? A: Kanlara Ultimate is the sister game to Kanlara Adventures. It is supposed to provide the most enjoyable way of exploring the region of Kanlara yet. Q: What's the difference between Kanlara Ultimate and previous versions of Kanlara Adventures? A: The main thing is polish. There are fixes in the town map, updated move effects to have them work properly, added new cries for Gen4+ Pokémon, added the Fairy type, etc. There is also an adjusted level curve to make the game less of a struggle to get through, while still keeping some of the difficult key battles from the original Kanlara Adventures. The story has also been changed a bit", "platform": "Nintendo Game Boy Advance", "release_date": "October 25, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Sakakii", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=kskdsmrrDdY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122164\n"}