{"name": "Pokémon Elemental Rift", "overview": "Basic information: • a Fire Red (BPRE) hack • 386 Pokemon • English language • Entirely new characters/region/plot • No Fakemon The Plot: You’re a young boy/girl from the sheltered Longpalm Island, located in the south of the Davoa region. The rain has been relentless – it’s the wet season, it’s supposed to be – but it has been particularly malicious this time around. A storm has blown some of the city’s wooden fixtures into the water, and your Dad has asked you to make the quick trip to Main Island to get some supplies. The storm has caused the otherwise peaceful coastline to rise up over the beachfront, and as such wild Pokemon can attack you. Because of these more dangerous conditions, Professor Greatbeard has allowed you to take one of his Pokemon for protection. The unknowing hero makes the trip to Main Island, meeting researchers from the mainland that are currently studying the storm. Their attempts to glean the answer from some native Pokemon aren’t working, unfortunately. Your journey leads you to Aquamaria Isle, where after a battle with Leader Fenton, you learn that the ancient elements are angered, and this is causing the disturbance. Fenton requests that you journey to the mainland, to learn about each of these ancient and powerful elements, and if you can, to quell their rage. Will you step up to the challenge? Features: Hacks are being released every day, all with a laundry list of changes and additions that could pretty much be copied and pasted. It’s my job to differentiate this game from the others – to give you, the player, a unique experience that you won’t find playing other hacked games (for a while, at least). With that said, a brief list of the features Pokemon: Elemental Rift offers you includes: • EVERY Pokemon has been modified to some extent – either in it’s type, base stats, ability, movepool, or evolution method (obviously, for some). • Physical/Special Split. It is on every other hack too, but this time, all Pokemon are going to be able to take full advantage of it thanks to the changes mentioned above. • A compelling story, not necessarily fueled by an evil team that wants to take over the world, or other equally as cliché plots. • Emulating the VGC tournaments you might be familiar with, all Gym Leader battles are 2v2. • Randomised Gym Leader battles (not yet implemented). • An alchemy-esque system for making items from the reagents you find off the ground. • Less (read: virtually no) reliance on HMs. • An entirely new evolution mechanic, making its debut in Pokemon: Elemental Rift. • I know the difference between your/you’re and there/their/they’re.", "platform": "Nintendo Game Boy Advance", "release_date": "2013", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "shamus24", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/6psoP60wpiY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123776\n"}