{"name": "Pokémon Dark Rising", "overview": "Story: The Story begins in a dream. A Pokémon suddenly appears and chooses you, a young boy/girl, to save not only it, but the world itself. You awake asking yourself questions. Deciding to ignore the dream for now, you step out into your home town known as Fells in the Core Region. Your best friend, who also had the same dream, stops you at the front door to inform you of an emergency message from the town's Professor. When you encounter the professor, he quickly informs you of the disasters and climate changes occurring all over the Core Region. His workers in panic, he asks you to visit the delivery station and pick up a package for him from Prof.Oak. As you set out on this simple task, you encounter a mysterious girl who appears to know knowledge of the dream you've had about a creature name Darugis. After receiving the package, a powerful Pokémon is within you and your friend, Pete, sight. Eager to test your early skills against a powerful Pokémon, you quickly engage in a battle with it. The Pokémon uses it's powerful winds, easily defeating your Pokémon and knocking you out in the process. After awakening in your room, you see Pete and your mother patiently waiting for your recovery. You soon begin to realize this is the start of a journey into many mysteries and powerful mon you can't wait to challenge. Features: • 386 Pokemon from Kanto, Johto, Hoenn, Sinnoh and Unova • Newer generation moves • Dream World Abilities • Pokemon will learn some of their best egg moves by level up instead of breeding • Challenge Nurse Joy for exp", "platform": "Nintendo Game Boy Advance", "release_date": "2012", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "DarkRisingGirl", "publishers": "DarkRisingGirl", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://youtu.be/KNprdRhBRCg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78290\n"}