{"name": "Pokémon Eclipse", "overview": "Information: Name: Pokemon Eclipse Hack of: Fire Red Language: English Progress: This version goes up to Wisteria Town, and four badges are obtainable Story: You're a young boy/girl living in Lapis Village, where your parents own a Mareep farm. Oak has visited your village and gifted Pokemon to a few people, including Anya, your childhood friend. After proving to your parents you're mature enough, they allow you to leave home to become a Pokemon Trainer. Your aim is to follow your father's footsteps and join the Ace Trainers, a division of the Devon Corporation of the Soala region. But to do so you must become a skilled Trainer, so you decided to take on the Pokemon League. But the Soala region isn't very peaceful at the time. Wild pokemon are behaving strangely and violently for unknown reasons, and a gang of thieves is stirring up trouble in towns and cities. People are claiming they have been seeing mirages, or been trapped in illusions. Who is behind these incidents? Are they related? It's up to you to solve the mysteries! Features: • Traverse the Soala region: Though modern, the region of Soala has a lot of history behind it relating • Darkrai, Cresselia, and the Forces of Nature, and a variety of environments to explore. • The Dream World: Your journey will also take you to the mysterious Dream World! What wonders are to be found in this surreal realm? • Catch them all! 721 Pokémon will be in the game, and most of their forms. The majority, if not all, of them will be catchable, in a variety of ways. More interactable Pokémon, an Egg Shop and gift Pokémon. • Updated battle mechanics: Mechanics will be updated to match Generation 6, meaning the Physical/Special • Split, new moves and abilities, the Fairy type and an updated type chart. • New TMs/HMs and Field Moves: A new set of 50 TMs is available, and TMs can be used as many times as you like, just like in the newer generations. New field moves include Dive, Rock Climb and Hurricane. Headbutt is also available as a Technical Machine, and can be used to encounter Pokémon hiding in big trees. • Post-game side stories and side quests: A lot of side stories are being planned for the post-game, with familiar characters and legendary Pokémon. Side quests are also available all around the region in the form of missions, which can get you rare items and Pokémon as rewards.", "platform": "Nintendo Game Boy Advance", "release_date": "July 12, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Christos", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://youtu.be/0QBOsQskCx4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123731\n"}