{"name": "Pokémon Emerald Final", "overview": "List of features include: • Physical/Special Split with icons (thanks to DoesntKnowHowToPlay) [optional • patches to remove the PSS] • Optional patches for alternate starters from Kanto or Johto • National Pokedex enabled from the start • 386 Pokemon are available through catching/breeding and in-game events, all event items available at Lilycove mart. • Trade evolutions changed to stones or levelup (all evolution stones available at Lilycove mart) • Included READMEs have lists of changed evolution methods, where to catch each Pokemon, AND the encounter rates on each route • TM's are reusable • HM moves are eraseable [Thanks to JPAN and kleenexfeu] • Running allowed indoors • Visual day/night cycle for the overworld (thanks to prime-dialga) [optional patch to remove] • Both the Mach and Acro bikes are available to purchase at the Mauville Pokemart (I hate switching between them) • Move Tutors are now reusable • Catching Pokemon gives experience [Thanks to Logan and DoesntKnowHowToPlay] • EVs are capped at 252 [Thanks to Touched and Artemis64] • The in-game time can now be changed (activated next to Shoal Cave to allow easier access to both tides) this doesn't affect the Day/Night cycle because it is tied to your system time [thanks to Chaos Rush] • The entire Safari Zone is open from the start and it provides you with the PokeBlock case • The fishing system is now much easier to deal with, hitting 'A' too early or too late won't lose the pokemon on the hook and you only ever get one \"Oh! A bite!\" message (Thanks to DizzyEgg) • Mirage Island spawns after The Elite Four (thanks to igorfs10) • The summary screen now has stats affected by natures color coded (Red for increased stat, Blue for decreased stat) [Thanks to DizzyEgg] • Rare berries now purchaseable (PokeBlock ingredients in the Contest Hall, battle oriented berries in The Battle Frontier mart) • Altering Cave is now an EV Training area, just interact with the signs inside the cave to initiate battles with high EV yield pokemon (no more random encounters inside) There is also an NPC to heal your pokemon and show EV/IVs inside the cave. • Flash now lights up the whole screen [Thanks to MWisBest] • Black and White's repel system (asks you if you want to use another when one expires) [thanks to Chacha Dinosaur] • Ability Switcher in the Daycare [thanks to Chacha Dinosaur] • NPC in the Daycare who will show your party's EVs and IVs [thanks to jiangzhengwenjzw] • Maximum money is 9,999,999 [thanks to Chacha Dinosaur] • Game fully de-capitalized [thanks to Le pug] optional patch to revert to FULLY CAPITALIZED STATE • Berries ask to be watered when planted and replanted after picking (thanks to igorfs10) • Auto turn around after healing at a Pokecenter (got the idea from Crystal Clear) • Changes to learnsets to include not only FR/LG exclusive moves, but also prior evolution moves (it always made no sense to me how Shiftry and Ludicolo lose access to their movepool almost entirely) this includes a few instances of baby • Pokemon being able to be taught by move tutor but not their evolved form, they now can use the tutors like the pre-evolution • IV Perfector in Devon Corp (the scientist on the second floor at the bottom left desk) Steven must be defeated before he will work • Optional patches to update moves to gen 5 or 6 stats • Nature switching at the Battle Frontier • NPC that can set your Pokemon's level to 50 at the Battle Frontier • Birch no longer ASKS you to go see his kid after being saved, autofire B with aplomb (as I usually do for the beginning) • Obtain the Exp. Share upon delivering the letter rather than having to backtrack • Optional updates to overworld poison and Rough Skin", "platform": "Nintendo Game Boy Advance", "release_date": "2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "dearman4", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://youtu.be/B8a-g_XIaYA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123789\n"}