{"name": "Pokémon Conversion Emerald", "overview": "INTRODUCTION: The main goal of this hack is REBALANCING EVERY POKEMON to be competitively(OU) viable, either through changing their base stats, or by changing their Type. The secondary goal is to make strong Pokemon easier to obtain and raise, by making important items more accessible, and by making weaker moves more useful. DEVELOPMENT: This hack was created by me (Ravendeth) and my wife Taelle over the course of one month, for a friend who was going to go through head surgery and would have nothing to do while sitting around. FEATURES: • NEW TYPES : Many redundant or oddball pokemon have been given new secondary types to better fit their movepools or the team niche that they try to fill. • Fairy type is also implemented. • REBALANCED BASE STATS : Most of the pokemon in the game have been given increased base stats to better show off their strengths, mostly based on their previous placements on the tier list. • MORE ACCESSIBLE ITEMS : Prices reduced, important items easier to come by. • ALL 386 POKEMON CATCHABLE (75% done) : the goal is to have 6 pokemon catchable in each area, to increase variety and teambuilding choices. • TYPE VARIETY : Redundant types diversified. No more rat/bird/fishpocalypsemon. Many humanoid pokemon have been changed into Fairy types rather than the animal-based Normal type. Less psuedodragons and more Dragon types. • QUALITY OF LIFE CHANGES : Reusable TMs, Rewriteable HMs, shorter annoying texts, clearer and concise descriptions. • TYPE REBALANCING : Ice type resists Normal and Flying attacks. Fairy type is weak to Bug attacks. • IMPROVED BREEDING : Any two pokemon can breed, like in many other monster games. Egg hatch times halved. • Shiny Pokemon : Shiny rate is 0.5% (one in 200), making them uncommon instead of impossible to find during a casual playthrough. Many pokemon have new shiny colors. • Special Evolution : Pokemon who have trade or other special evolution methods can now also evolve through friendship. • Catch Rates : Pokemon have a flat 10% added to their catch rates. Similar feel, helps with sableye and legendary PTSD. • Surfing/Fishing : Surf encounter rates reduced. Fishing now finds non-magikarp and 1 new pokemon for each rod tier. • Day/Night System : Caves also use natural illumination to make your nature hike and evolutions more memorable. • System Time : The Gamecube at your house can be used freely to change the system time. • HM sanity : Pokemon with wings can use Fly, pokemon with claws can use Cut, etc. • Egg Move sanity : Many pokemon have improved learnsets with important moves such as Will-o-Wisp, Dragon Dance, Heal Bell, and Baton Pass. • Run anywhere : Able to use running shoes indoors. KNOWN BUGS/ISSUES: 1. Some pokedex entries are missing, seems to be a vanilla emerald bug? This will get filled in for the release version. 2. Old legendaries and sea caves, safari zone, victory road not yet finished. 3. Brandon rides a missingno in the intro (compressed graphics corruption). Not sure how to fix this. 4. Ocean Route 124 (Relic Reef) is filled with Pupitar (L1-50). Not sure how to fix this, seems to be a bug caused by the map editor. 5. The important features should have NPCs or signs to explain them in the release version. 6. Some attack descriptions don't fit (bad linebreaks) due to the rushed nature.", "platform": "Nintendo Game Boy Advance", "release_date": "2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Ravendeth", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/e80GuxjUMzs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123390\n"}