{"name": "Pokémon Cyan", "overview": "Intro: Pokémon Cyan is Firered hack located in the tropical archipelago of Celia, featuring a decision-based storyline, a mix of official Pokémon and high quality Fakemon and a brand new region with updated graphics among other things. It is also my second serious attempt at a hack so I'd love to hear any feedback you can offer on it. Story: Team Rocket was once a powerful force in Kanto, until one day, a boy named Red defeated them in their base - Silph Co. and went on to defeat their leader again in his GYM. The leader disappeared, and Team Rocket disappeared into the shadows... 3 years later, they attacked the region of Johto and took their radio tower, but again, a boy named Gold defeated them. The last of Team Rocket finally dissolved and the regions were peaceful once again... until now... Giovanni has come back and resurrected Team Rocket from the grave, and launched an attack on the region of Celia. Pokémon have been mysteriously disappearing from Celia, what's happening to them? What are team rocket doing with them? It's your 12th birthday, meaning you're finally allowed to go on a Pokémon Journey, just like you've always wanted to! You get a Pokémon and head out to earn badges, become a Pokémon Master, and collect all the Pokémon in the Pokédex! Whilst travelling through the Celia archipelago, you stumble upon team rocket attempting to catch Regice, one of the the legendary regis! You soon discover their plans, and it's up to you, whether to join team rocket and help them achieve their goals, or help the regis and save Celia from their plan! What will YOU choose?... Features: • Explore the tropical and exotic Celia archipelago • The return of Dive and Whirlpool HMs • Many new Fakémon • 4th and 5th Gen Pokémon • Berry trees • Sidequests • New Music • Decision-based Storyline • New Moves/Abilities • Physical/Special Split • Updated Graphics • Custom ASM • Updated graphics", "platform": "Nintendo Game Boy Advance", "release_date": "September 8, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Chrunch", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://youtu.be/V5ZBSj-zA2c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78746\n"}