{"name": "Pokémon Clays' Calamity", "overview": "Game Production/History: This was the very first open world Pokemon game. Created in early 2016, this patch was never meant to be released to the public as it was a custom mod for a friend. However, since Clays Calamity II has been growing in popularity, many people are requested the first game be released. ------------------------------- Game Story: In this first ever open-world expansion of Kanto you play as Clay; an overly cocky and thorough Pokemon trainer. Clay has one mission on his mind, to contour and beat every gym leader like no one has ever beaten them before. He has a plan, and he is going to follow through. How? By being the best. Why? Because he can. He starts his travels with a Magikarp and a Master Ball. All he needs in order to sweep every trainer, gym leader and organized crime syndicate in Kanto. He knows he is the best, and no one stands a chance. Play Clays Calamity now and see how he does it! ------------------------------- Game Play: The game plays exactly as Fire Red with a couple exceptions. 1. The over world maps of ALL routes/towns have been edited for an open world, go anywhere environment. 2. Gym leaders have increased in difficulty and are meant to be battled after all trainers are defeated. If you have played Clays Calamity II don’t think this game is on the same level of difficulty. The leaders in this game are much lower leveled. 3. All rival battles have been removed. 4. Islands are skippable. 5. Pokemon have been added to routes (all starters within gen three are available within the first couple of routes). 6. No starter Pokemon from Oak. Instead you are given a Master Ball. Catch whichever Pokemon you want to start with. Post Game: Unlike Clays Calamity II there is no Post Game in this patch. When Mewtwo/Champion is defeated (because of it being open world, either of those could be done before/after one another) the game is over. ------------------------------- Features: • There is NOT a Special/Physical split • ONLY Pokemon from Gen 1- Gen 3 are available • Master Balls are purchasable once at the Elite Four • Hidden passages are strung throughout Kanto (not as many as Clays Calamity II though)", "platform": "Nintendo Game Boy Advance", "release_date": "2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "frabulator", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/muGiV3VnNKU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123371\n"}