{"name": "Pokémon Saiph", "overview": "Name: Pokemon Saiph Type: GBA Hack of: FireRed Language: English Creator: #Vytron ________________________________________ Description The game takes place some years after the events of Pokémon Rangers Shadows of Almia. After the Shadow Crystal getting purified, scientists found a way to use its energy as a resource. Almia's citizens feared the crystal and wanted it to be as far from them as possible, so the government sold it to Hoenn because of the distance between to two regions. The Old Mauville was renovated as a Power Plant for the Crystal and its energy was inherited there. Things were going great and peacefully. One day, the Old Mauville has exploded, and started to spread huge waves of radiation. The Crystal was moved to a hidden laboratory in Colen and was protected as a Top Secret weapon. The entire West Hoenn had to be evacuated, including your home town, Littleroot Town. These people were moved to the Colen Region, a region relatively close to Hoenn. 10 years later you can have a Pokémon and start your own journey, as you explore the great world, you bump into Team Void, a mysterious criminal organization that has some sort of a connection to the long \"lost\" Shadow Crystal. When Darkrai's rampage was stopped people who stuck in the shadow Pokémon's void were sealed inside the Shadow Crystal. The evil organization will try to steal the crystal to find Shenow's lost father inside the crystal, and use it to rule everything with Darkrai. You'll need to stop their plan and bring peace back to Colen, and probably the entire world! Maybe doing what the rangers did back in 2008 will solve this chaos as well... ________________________________________ Features •", "platform": "Nintendo Game Boy Advance", "release_date": "", "game_type": "", "esrb": "", "developers": "#Vytron", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124571\n"}