{"name": "Pokémon Chronicles of Soala", "overview": "•3 new regions •Travel through two whole new regions, Soala and Osenia, and explore the •Orange Archipelago! Collect all 20 badges, 8 from each region and 4 from the •Orange Islands, and enter the Pokémon Championship! •Variety of different environments, including space and the past •Travel through snowy mountains, underwater temples, tropical islands, volcanoes, swamps, jungles and more! You also get to travel to Space with one of the organizations you will encounter to investigate the recent sightings of Jirachi. With the help of the Chronos Tribe and Celebi's power, you also get to travel back in time, and discover the origins of the regions and their secrets. •9 rivals •Not just one, but 9 rivals to battle you along your way to be the best trainer there is! Some are new, and some are old, including Red, Crystal and Ritchie! The best part about this is that you are able to choose how to interact with each one, which means you can ignore/avoid/get rid of most of them should you choose to. However, you will be rewarded if you keep them all around by the end of the game, since every one of them is important in their own way. •Decision-based storyline •In the game you will encounter several organizations, small, big, evil, good, each with its own dreams. After finding out about their goals and intentions, you get to choose which one to side with, or even two. You can even not side with any organization and oppose them all. The decisions you make will heavily affect the final part of the game and the ending. •Latest generation Pokémon •Currently, there are only 673 Pokémon catchable in this game. the 649 from all 5 generations and 24 from Gen VI. I'm currently working on the sprites of the rest of the Gen IV Pokémon, and I'm hoping to release a new patch with all 719 Pokémon available soon! •New moves and abilities •The majority the new moves and abilities of the newer games have been implemented. Some new ones have also been added as well. Just like with the •Pokémon sprites, a patch with all moves and abilities so far will be released in the near future. •New music •Almost all the tracks in this hack have been changed. Some are familiar tracks from the latest generations, some are completely new, thanks to Link and his team from Pokémon: Phoenix Rising. •Side quests •Attend the Pokémon Ranger academy and become a Pokémon Ranger! Rangers can take on side quests to help people in need from all the regions. There are over 30 side quests of varying difficulty, some have special rewards and new characters involved. By completing them, you get Quest Points which can be redeemed for rare items. This game was released by Christos as an April Fools joke claiming to have features like 3 regions, 9 rivals and a decision-based storyline. It's actually a short game with a few puzzles and a final boss fight. It should take around 30 minutes to complete.", "platform": "Nintendo Game Boy Advance", "release_date": "April 1, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Christos", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/uuKjnj-YlvQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122076\n"}