{"name": "Pokémon Theta Emerald EX", "overview": "Background: It's been over a year since I really updated the original Theta Emerald, with only 650 Pokémon. Then I released an alpha of Theta Emerald EX...which I still hate to this day. I wanted to recreate the game, start from scratch, and start over. That's what I did, and now I can finally that the new Theta Emerald EX is officially released! Features: -721 Pokémon: Every Pokémon from Bulbasaur, all the way to Volcanion, is in this game, and they are all available to catch! -600+ Moves: All moves (up to Gen VI) are in the game, and work as they do in Gen 6! -Proper Physical/Special Split: I mean, why not?! -100+ Abilities: All abilities (up to Gen VI) are in the game, and work as they do in Gen 6! -Fairy-type: Fairy-type has been included, and given to their respective Pokémon and moves! -New/Updated Items: There are battle ready items to collect, where they can be bought, or found on wild Pokémon! -Item Pocket Extension: I couldn't find a better way to say it. The Main Items Pocket has been extended to hold 200+ Items! -100+ REUSABLE TMs: How else can I describe it haha! -Proper Mega Evolution/Primal Reversion: I hated the way Mega Evolutions were in the dumb alpha, so it works as intended now! -Battle Frontier Updated: I did this for the fun of it. The Battle Frontier has no limits to which Pokémon you bring (You can use your Mega Rayquaza holding a Life Orb). But the Trainers there are allowed to use them as well ;) -Running Indoors: Way more convenient, in my opinion. -New Repel System: Instead of hunting through your bag for a Repel, the game will ask you if you want to use another one! -Gain EXP from capturing a Pokémon: Now with no more Pokédex glitch! -Deletable HMs: THANK GOD! -Level 1 Eggs: No other way to describe this! -New Battle Backgrounds: It makes it look a little more updated! -Harder Difficulty (as of 2-5-2017): I've received complaints of the game being too easy, so the game has been adjusted accordingly. -Level 250 (as of 2-5-2017): 7.8/10 too much level Known Glitches: -When you beat the game, on the hall of fame screen, some new Pokémon will show up as one of the original 386. It might have to do with some limiter somewhere. -When leveling up, some new Pokémon will have a different colored icon if they leveled up while not in battle. As I said, a limiter needs to be fixed somewhere. -When selecting multiple Pokémon in a box, some new Pokémon will have a different colored icon. Same thing, unknown limiter somewhere.", "platform": "Nintendo Game Boy Advance", "release_date": "December 25, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "LCCoolJ95", "publishers": "", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129937\n"}