{"name": "Prince of Persia: The Sands of Time & Lara Croft Tomb Raider: The Prophecy", "overview": "In Tomb Raider: The Prophecy, Lara discovers a manuscript that tells of a power, known as 'magic', that would bring devastation to the Earth at the beginning of the new millennium. The prophecy also tells of three legendary stones, resting in three places in the world, that will bring destruction as a punishment since 'magic' has been long forgotten by mortals. Being the enterprising and inquisitive archaeologist that we all know and love, Lara embarks on a quest to uncover these holy stones, travelling across the globe, from Norwegian mountains to Aztec temples. Aided by a seductive princess and the absolute powers of the Sands of Time, in this Prince of Persia instalmment, you guide the young Prince on a quest to reclaim the Palace's cursed chambers and restore peace to the very fabric of Time itself. You must tread this world carefully, however, because in this land there is only one rule - master the Sands, or be buried. And these 'Sands' are what make up a key element to the proceedings throughout the game. Amidst the general platform-jumping, combat and puzzle-solving, you also have to master the ability to control time. Aided by the powers of the Sands, the Prince has the ability to perform a range of time-manipulating maneouvres, such as the Power of Revival (rewind up to two seconds); the Power of Delay (slow-motion); The Power of Restraint (freeze enemies in time); and The Power of Gathering (rebuild specific objects). Making use of these powers is key to progression through the game, and both your life gauge and a number of the game's puzzles rely on them.", "platform": "Nintendo Game Boy Advance", "release_date": "April 28, 2006", "game_type": "Released", "esrb": "", "developers": "Ubisoft", "publishers": "Ubisoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122833\n"}