{"name": "Sheep", "overview": "Sheep for the Game Boy Advance is based on the game of the same name for console and computers, but only takes the general concept, adapting it with its own graphical style, completely new levels and different playing modes. Sheep is a real-time puzzle game. In more than 24 levels displayed in isometric view, the player controls a sheep dog and must herd sheep, moving them into a truck within a time limit. This is mainly done by approaching the sheep, which makes them move into the opposite direction. This way they must be guided around obstacles and away from dangers. The dog can also grab a sheep to carry it, bark to encourage movement further and leave treats behind for the sheep to follow him. Players can select from two different dogs at the start of the game who differ in attributes like speed and strength. Further dogs can be unlocked by playing through the game's various modes. The main mode is called Normal Mode and presents the levels grouped into four different stages. Within a stage, the levels can be tackled in any order, but only once all levels are done the next stage opens up. Before a level, the type of sheep to be herded can be selected. Some types are more difficult to control, resulting in a higher score multiplier. The game's second mode is called Arrange Mode. It features the same stages and levels, but introduces a new element: the leveling up of sheep and dog. The dog levels up by reaching a certain score, which increases his abilities. The sheep also level up, mainly be performing certain feats within a level. This can become problematic if a sheep reaches a higher level than the dog, making it prone to disobedience. Once one of the regular modes is finished, a Training Mode opens up that allows one to select any level directly.", "platform": "Nintendo Game Boy Advance", "release_date": "May 31, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/3334\n"}