{"name": "Sorry! / Aggravation / Scrabble Junior", "overview": "The first game in this collection is Sorry!. As you likely know, the idea behind Sorry! is to move four pawns around a game board from start to home. Players take turns picking up cards to see how far they will be able to move one pawn. The cards can show a number between one and twelve, or the word \"sorry\". Drawing a one or two will let you remove one of your pawns from start, and a \"sorry\" card will let you move one of your pawns from start to any space occupied by an opponent's pawn, knocking them back to their starting space. Some cards have special effects; for instance, an eleven will let you trade places with someone else, while a four will make you move backward! The second game is Aggravation. While Sorry! only allows up to four players, Aggravation allows up to six. Like Sorry!, Aggravation challenges you to be the first player to move from start to home. A dice is used to determine how far you can move in this game. You must roll a one or a six to exit the starting area, and rolling a six at any time will let you immediately roll again. Once again, landing on a space that's already occupied will send the original occupant back to their starting space. Once again, there are \"shortcuts\" than can be used to your advantage. If you roll the right number, you can move to a special space in the middle. You must roll a one to leave the space, but when you do, you can move very close to your home area! If you land on the other spaces nearest this center space, you can jump around these spaces to get around the board quickly. Scrabble Junior features two modes: an \"easy game\", and an \"advanced game\". The easy game is completely different from traditional Scrabble. At the start of the game, each player is given seven tiles, each with a letter on it. For every tile a player uses, they receive a replacement, until there are no more tiles left to hand out. A game board is displayed with a number of words displayed in a crossword puzzle-like fashion. Your goal is to place letter tiles on the board that match the letters shown. The catch is that you can only place tiles in the first available space nearest the beginning of a word. You score by placing the tile that finishes a word, and the player who finishes the most words throughout the game is the winner. If it's possible for you to place a tile somewhere, you HAVE to place one, so you can’t just refuse to build on a word so that someone else can't finish it. You are able to see other players' tiles, so you can try to delay their finishing a word if you have multiple options for which tile to put where.", "platform": "Nintendo Game Boy Advance", "release_date": "August 21, 2005", "game_type": "Released", "esrb": "E - Everyone", "developers": "Gravity-I", "publishers": "Destination Software Inc (DSI)", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "3.8", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=eXwKs4BvgbQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91944\n"}