{"name": "SpongeBob SquarePants: SuperSponge", "overview": "SpongeBob SquarePants: SuperSponge features the same story and general gameplay concept as its counterpart on the PlayStation, but with different level designs and gameplay mechanics. SpongeBob wants to get a present for his friend Patrick's birthday, and decides to get him an autograph from his favorite superheroes, Mermaid Man and Barnacle Boy. The two will however only help SpongeBob if he runs several errands for them first, like getting them a meal or a facial treatment. The game is a traditional side-scrolling platformer consisting of five worlds of four levels each. In every level, the goal is to collect one particular ingredient for fulfilling the latest errand. Swimming or lying in SpongeBob's way are various hostile sea creatures he can dispatch with a slap from his giant red glove. In addition, he can pick up several items that allow more options, like several different weapons, including a fishing net, a coral blower and a jelly gun - all can be used to collect ammunition in the form of jellyfish or coral which can then be fired. A balloon allows SpongeBob to glide. A beating heart shows SpongeBob's health - should it get too low, he can refill it by picking up fast food items like milkshakes, fries and burgers. He can also collect spatulas - picking up 50 of them awards an extra life. Extra lives can also be found in the form of an extra pair of underpants. Every world ends with a boss battle. One level takes place in Sandy Cheeks' home tree. There, SpongeBob must periodically refresh himself at a water puddle or dry out and lose a life.", "platform": "Nintendo Game Boy Advance", "release_date": "November 5, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "The Climax Group", "publishers": "THQ Inc.", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/21669\n"}