{"name": "Superman Returns: Fortress of Solitude", "overview": "Superman Returns: Fortress of Solitude is a tie-in to the 2006 film Superman Returns. Unlike most Superman games, which have a heavy action focus, Fortress of Solitude is instead primarily a puzzle game, with only minor action elements. The game consists of twenty chapters, each consisting of a set of crystals in the Fortress of Solitude. Behind each crystal is one puzzle challenge. There are two kinds of puzzles: Kryptonex is a Sudoku variant with crystals instead of numbers. The board of cells must be filled with crystals, with only one kind of crystal per row, column and group allowed. The board is pre-filled with some crystals so players can deduce where to begin. The second type of puzzle is called Crystallization. In this game, rows and columns must be filled with crystals. Completing a row or column energizes it and removes the crystals. The goal is to energize the entire board. Crystals (taken from a group of three, with random additions after removal) can only be placed next to other crystals that have either the same shape or color. Only wild card crystals can be placed anywhere. Superman's powers can be used to help in puzzle completion. Each use of a power depletes a power meter which slowly recharges. In Kryptonex, Superman can show the correct crystal placement of the entire board for a short time or put the correct crystal into the current cell. In Crystallization, he can energize fields without having to complete a row or column. In both games, he can also stop the clock for a short while. The puzzles come in three different difficulties, with higher ones being played on larger boards. Some of the crystal challenges require playing several boards in a row. All puzzles within a chapter must be completed within a time limit. It is possible to replay puzzles to improve the completion time, leaving more time for the remaining tasks. Completing a chapter unlocks a digitized picture from the movie. Besides the puzzling, there is also a small action game. During each chapter, one of Superman's arch-enemies (including the likes of Metallo, Brainiac, or Mr. Mxyzptlk) will attack and send his minions. In a side-scrolling shooter level, it is then Superman's task to shoot down the minions, who come in red and blue varieties. Red ones must be taken out with super breath; blue ones with heat vision. Shooting down a group leaves a red or blue crystal. Collecting enough crystals before the level ends is necessary to defeat the bad guy.", "platform": "Nintendo Game Boy Advance", "release_date": "November 20, 2006", "game_type": "Released", "esrb": "E - Everyone", "developers": "Santa Cruz Games", "publishers": "Electronic Arts", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/21681\n"}