{"name": "Titeuf: Ze Gag Machine", "overview": "Titeuf: Ze Gag Machine is an action game based on the Titeuf comic books series. Players control Titeuf as he attempts to play tricks on people in his environment. The challenge mode consists of a series of levels with specific objects. In each one Titeuf runs around in an environment such as the school or a playground. He can pick up objects such as bananas, firecrackers, exploding cans, toy cars etc. He needs to launch these at the people in the environment to scare them or to make them slip. The opponents have three alert states: blue, yellow and red. Blue means it is safe to launch the object, yellow means he is spotted and red makes them chase after Titeuf. Titeuf can be moved in eight directions. He receives points (trophies) for completing a gag. When an enemy has a red alert state, the player quickly need to press B to sprint and avoid a confrontation. If he is caught, a life (a red star) is lost, but additional ones can be picked up sometimes. After a while chasing opponents will become tired and return to a blue state. There are various objectives to complete, such as performing a number of gags, collecting other types of items, or sprinting for a certain amount of time. When the objective is complete, the exit is opened up. After each completed challenge Titeuf's performance is rated, also taking into account the amount of time. The second mode, crash test, is a practice mode where all objects are available right away, there is an unlimited amount of lives and there is no time limit. A password system based on objects can be used to continue playing a next time.", "platform": "Nintendo Game Boy Advance", "release_date": "November 29, 2002", "game_type": "", "esrb": "", "developers": "3D Lights", "publishers": "Infogrames", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=2-Btcz9wtxY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32632\n"}