{"name": "War Room Challenge 2012: Advance Wars 2", "overview": "This was a wildly out of control result of what was supposed to be a one-month hack to develop a new War Room challenge for Advance Wars 2. Instead, it has turned into something that’s taken over a year to put together, complete with a large amount of refinements and gameplay additions. Complete with new COs from the AW series, plenty of challenging maps and a bundle of hand-coded new features, this is a definitive hack to play for Advance Wars fans (or people who like turn based strategy games!). All the challenges present are hand-crafted by Xenesis and many, many members of the Advance Wars community with over a year’s worth of refinement. Game Features: - 30 New War Room Maps to play on - Some remixes of existing maps, most brand new from the AW Community. - Tutorial map with summary of game rules, scoring and new hack features. - Each map has an info dossier with the par time and author of the map. - Each CO has unique combat abilities in the War Room setting. Some COs from Advance Wars Dual Strike and Days of Ruin make an appearance as well! - Improved high score support - The game records S-ranks achieved on each map with each CO. - Improved status screens - The unit status screen now shows CO abilities more accurately and with more stats. - Pre-deployed maps provide unique army compositions depending on your CO selection - a feature returning from Advance Wars 1! - New deterministic weather rules for fairer scoring! - Extended Status Screen - Shows your rank in progress and whether you have S-Ranked this map with the current CO. - Improved Enemy AI - Enemy COs no longer use CO powers when they’d have no reason to use them and use them more intelligently! - Unlockables - Earn more COs by scoring S Ranks on maps! - Play against or as the series’ evil villains - Caulder, Sturm and Von Bolt", "platform": "Nintendo Game Boy Advance", "release_date": "June 18, 2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Xenesis", "publishers": "Xenesis", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130526\n"}