{"name": "Zone of the Enders: The Fist of Mars", "overview": "In the distant future, mankind is at the brink of war with it's colonies on the moon, Mars and Jupiter. You take control of a young man who, after a series of events, finds himself in possession of a new type of L.E.V. (a giant combat robot) and stranded on Mars, where he joins forces with the Anti-Terrestrial League. Zone of the Enders: The Fist of Mars is a side-story in the Zone of the Enders series. The gameplay alternates between story sequences and tactical turn-based combat, in which the player controls a number of L.E.V.s on a square grid map. There are different types of L.E.V.s that differ in speed, durability, movement range and armament. Unlike close ranged weapons, long range weapons cannot be used after an L.E.V. has already been moved. When two units engage in combat, the I.A.S. (interactive action system) comes into play. When attacking, the player is given a limited amount of time to move a cross-hair over your target. Critical hits can be delivered by successfully aiming at certain weak-spots of your enemies. When attacked by an enemy, the player must try to keep his/her own target icon away from the enemy's. The IAS can be toggled on and off in the options menu. At the end of each chapter the player is able to upgrade the controlled L.E.V.s or equip them with certain items that can sometimes be found during missions. The \"balance\" sub-screen allows to determine whether an L.E.V. should focus on attack power or accuracy, evasion or minimizing damage.", "platform": "Nintendo Game Boy Advance", "release_date": "February 12, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Winky Soft", "publishers": "Konami", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.57", "wikipedia": "https://en.wikipedia.org/wiki/Zone_of_the_Enders:_The_Fist_of_Mars", "video_link": "https://www.youtube.com/watch?v=_WjuDp1sb40", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/3935\n"}