{
  "name": "S.I.M.I.S.",
  "shortName": "simis",
  "description": "<em>S.I.M.I.S.</em> stands for the names of the games and items on the card. They are <b>S</b>nakeByte, <b>I</b>nvaders, <b>M</b>ines, <b>I</b>solation, and <b>S</b>pecials, which are the demos.<br><br><b>SnakeByte</b><br>\nThis game is like one of many <a href=\"https://www.mobygames.com/search/quick?gamegroup=Snake+Games\">snake games</a>. In <i>SnakeByte</i>, you are a snake moving about the screen, eating apples. You must not touch the walls or your own body. Each time you eat an apple, you grow longer, making maneuvering that much harder. In later levels, you have objects in the playing field to also avoid.<br><br><b>Invaders</b><br>\nThis is the game <a href=\"https://www.mobygames.com/game/nes/space-invaders________\">Space Invaders</a> that has been ported to the Atari Lynx. Rows of invaders move across the scree, firing down at you. When they reach the edge of the screen, they drop down then move towards the opposite side. You are a cannon at the bottom that moves left and right. You must shoot all the invaders before they get to the bottom of the screen. You have three shields to hide behind. Occasionally, a mother ship moves across the screen that can be shot for points.<br><br><b>Mines</b><br>\nThis game is very similar  to the game <a href=\"https://www.mobygames.com/search/quick?game=Minesweeper\">Minesweeper</a>. You must make your way across the room, from the upper left to the lower right. There are hidden mines in the room. You use your mine detector to see how many mines are one step away from you. Use your detonator to destroy all mines one step away. You are timed and if you fail to get to  the exit in time, all mines will go of, losing you the game. If you use your detonator next to the exit door, you also lose.<br><br><b>Isolation</b><br>\nThe playing area in an eight by six area of tiles. You can move one step in any direction then once you move, you must remove a tile from around you.  You and your opponent do this, alternatively, until one of you has nowhere to move and is the loser.<br><br><b>Specials</b><br>\nThis is four playable game demos that the authors are developing.",
  "publishedBy": "Telegames, Inc.",
  "developedBy": "",
  "released": "1998",
  "alsoFor": "",
  "genre": "Action, Strategy / tactics",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/lynx/simis",
  "visual": "",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Lynx",
      "releases": [
        {
          "publisher": "Telegames, Inc.",
          "developer": "",
          "ported": "",
          "country": " Germany, United Kingdom",
          "releaseDate": "1998",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/651720-s-i-m-i-s-lynx-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Other",
      "country": "Germany",
      "platforms": "Lynx"
    },
    {
      "link": "/images/covers/l/651721-s-i-m-i-s-lynx-media.jpg",
      "scanOf": "Media",
      "packaging": "Other",
      "country": "Germany",
      "platforms": "Lynx"
    },
    {
      "link": "/images/covers/l/651722-s-i-m-i-s-lynx-media.jpg",
      "scanOf": "Media",
      "packaging": "Other",
      "country": "Germany",
      "platforms": "Lynx"
    }
  ]
}