{
  "name": "4-Get-It",
  "shortName": "4-get-it",
  "description": "<i>4-Get-It</i> is a tile matching puzzle game. The goal of each level is to remove all tiles within a time limit. To reach this goal, the player moves the cursor over a tile, selects it and moves it over the field. When two or more tiles with the same motive are moved next to each other horizontally or vertically (not diagonally), they vanish. However, tiles are affected by gravity and fall down when they are moved over an empty space or when a tile under them vanishes. The player has to watch for special blocks which influence the tiles' movement (e.g. ice blocks for continued sliding or warp blocks) and special tiles which have special effects after they vanish (e.g. anti-gravity blocks reverse gravity in the whole area or bomb tiles which destroy surrounding blocks).<br><br>Those mechanics mean the level can be maneuvered into an unwinnable state and therefore the game includes the option to reset a level. This feature is only available a limited amount of times, but each five levels more tries are rewarded. Passwords are given all five levels (starting from level ten) and allow access five levels before the password was acquired, e.g. the level ten password loads level five.",
  "publishedBy": "TRR Development, Inc.",
  "developedBy": "SilverFox SoftWare",
  "released": "1992",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/4-get-it",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "TRR Development, Inc.",
          "developer": "SilverFox SoftWare",
          "ported": "",
          "country": " United States",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/702942-4-get-it-amiga-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/702943-4-get-it-amiga-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/702946-4-get-it-amiga-screenshot-the-basic-goal-of-each-level-bringing.png",
      "caption": "The basic goal of each level: bringing together tiles with the same motive. Of course in later levels it gets more challenging than in the first."
    },
    {
      "link": "/images/shots/l/702945-4-get-it-amiga-screenshot-gravity-causes-the-higher-tile-to.png",
      "caption": "Gravity causes the higher tile to fall down because we moved it over the edge. It will fall between the other two blocks and cause all three to disappear."
    },
    {
      "link": "/images/shots/l/702944-4-get-it-amiga-screenshot-this-level-introduces-the-bomb-tiles.png",
      "caption": "This level introduces the bomb tiles which explode when they are cleared."
    }
  ],
  "cover": []
}