{
  "name": "Adventure in Humongous Cave",
  "shortName": "adventure-in-humongous-cave",
  "description": "How to best demonstrate the capabilities of your text adventure authoring system (the Master's Edition of the <a href=\"https://www.mobygames.com/search/quick?gamegroup=GAGS+%2f+AGT+games\">Adventure Game Toolkit</a>) but to port the latest and greatest hit title using it?  Well, one outta two ain't bad -- the programmer focused on re-implementing <i><a href=\"https://www.mobygames.com/search/quick?game=Adventure\">ADVENTURE</a></i>, the revolutionary mid-'70s faux-fantasy treasure-collecting cave crawl text adventure.<br><br>But why ape a project if you can't add anything new to it?  <i>ADVENTURE</i> was faithfully reproduced, and then enhanced: starting from the early tally of 350 points, the new content from <a href=\"https://www.mobygames.com/search/quick?developer=David+Platt\">David Platt</a>'s 550-point version was incorporated... and then further subsequent embellishments and expansions added up ultimately to 1000 mighty points of puzzling.  (The <a href=\"https://www.mobygames.com/search/quick?gamegroup=Z-code\">Inform</a> port goes one further, for a &quot;lousy last point&quot; total of 1001.)<br><br>An additional bonus challenge to be the first to uncover 10 &quot;secret words&quot; contained in the game was incorporated into this release, initially boasting a cash prize of $100! ... and later left in as an optional, prizeless challenge atop the game's classic hunt for virtual treasures.",
  "publishedBy": "",
  "developedBy": "",
  "released": "Dec 01, 1992",
  "alsoFor": "DOS | Combined View",
  "genre": "Adventure",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/adventure-in-humongous-cave",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [],
  "cover": []
}