{
  "name": "Arnhem: The 'Market Garden' Operation",
  "shortName": "arnhem-the-market-garden-operation",
  "description": "<i>Arnhem</i> is a first entry in <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,3629/\">R. T. Smith</a>'s World War II trilogy, including <a href=\"https://www.mobygames.com/game/desert-rats-the-north-africa-campaign\">Desert Rats</a> and <a href=\"https://www.mobygames.com/game/vulcan-the-tunisian-campaign\">Vulcan</a>. It simulates the assault operation initiated by Allied forces in September 1944 to take over the bridge of Arnhem, the Netherlands. There are British, Irish, Welsh, Polish, and American units of Allied forces against German forces and 5 scenarios, including advance to Eindhoven, operation 'Garden', operation 'Market', the bridge too far, and entire campaign from start to finish.<br><br>The gameplay is shown on scrolling map in turns. The player of Allied forces places airborne units all over the map on clear places and waits while they are landing. After that the player selects the units and gives them orders to travel, dig in, or change size. Units move on the grid of rectangular cells. The bombard attack is possible for certain units. Axis forces defend from the attacks. Historically, Axis won this battle, and it is player's opportunity to alter the history.<br><br>The game comes with detailed instruction booklet and includes historical notes on the campaign, maps and photographs. Two players representing Allied and Axis may be computer or human.",
  "publishedBy": "Cases Computer Simulations Ltd.",
  "developedBy": "",
  "released": "1991",
  "alsoFor": "Amstrad CPC, Amstrad PCW, DOS, ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/arnhem-the-market-garden-operation",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Cases Computer Simulations Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}