{
  "name": "Atom Smasher",
  "shortName": "atom-smasher",
  "description": "The basic idea behind this one comes from Pengo, with a maze containing various arrangements of blocks as well as several baddies, who are all one square in size. You kill them by firing blocks at them, which carry on moving until they hit a bad guy (in which case both are destroyed and you get some points) or another block (in which case it comes to a stop). The way the level layouts change as you play allows you to potentially box in some enemies, so you can deal with them gradually.<br><br>There are also exploding bad guys (drawn as Lemmings), so watch out for the warning as they prepare. Some blocks are icy, meaning that they can’t be pushed, and they destroy any block that hits them. Collectible power ups include a short-term baddy-freeze and short-term invincibility. There’s a co-operative 2-player mode, in which you can, unusually, harm your team-mate.<br><br>An extremely sophisticated editor was tucked away in the game, allowing you to not only design a maze and position the baddies (including regenerating ones, set to come in at any interval), but also change their speed and how frequently they fire hazards out\n",
  "publishedBy": "",
  "developedBy": "",
  "released": "1992",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/atom-smasher",
  "visual": "",
  "gamePlay": "Arcade, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/70744-atom-smasher-amiga-screenshot-title-screen.gif",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/70745-atom-smasher-amiga-screenshot-gameplay-on-the-first-level.gif",
      "caption": "Gameplay on the first level"
    },
    {
      "link": "/images/shots/l/70746-atom-smasher-amiga-screenshot-lookout-it-s-lemmings.gif",
      "caption": "Lookout, it's Lemmings!"
    },
    {
      "link": "/images/shots/l/70747-atom-smasher-amiga-screenshot-try-to-smash-the-bad-guys-with.gif",
      "caption": "Try to smash the bad guys with blocks..."
    },
    {
      "link": "/images/shots/l/70748-atom-smasher-amiga-screenshot-a-tough-maze-like-level.gif",
      "caption": "A tough, maze like level"
    }
  ],
  "cover": []
}