{
  "name": "Bazza 'n' Runt",
  "shortName": "bazza-n-runt",
  "description": "In <i>Bazza 'n' Runt</i>, the player takes the role of Bazza in search for Old Man Misty who is said to hold the knowledge of the perfect platformer storyline. Which is appropriate, because this game is a series of one-screen platformer levels.<br><br>To finish a level, a certain amount of targets need be destroyed with bombs. Bazza has a limited amount with him which can be dropped and explode after a few seconds. However, Bazza should be gone by then because the bombs are deadly to him, too (except when the option was disabled in the options). The good news is that the bombs also kill the enemies which wander around the levels on fixed routes. When Bazza runs out of bombs, he needs to get new ones by catching icons which constantly fall from the sky. In addition, there are fruits (bonus points for the high-score) and letters to catch. When Bazza caught enough letters, he gets to participate in a mini game after finishing the current level. There are also other power-ups which, for example, freeze all enemies.<br><br>The two-player mode is competitive. Both players, the second one taking control of Runt, try to destroy the most targets. I this mode, there are special power-ups which have negative consequences for the other player character, e.g. removing all bombs.",
  "publishedBy": "Lionheart Software Creations",
  "developedBy": "Crew AV",
  "released": "1995",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/bazza-n-runt",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Lionheart Software Creations",
          "developer": "Crew AV",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1995",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}