{
  "name": "Biniax 2",
  "shortName": "biniax-2",
  "description": "<i>Biniax 2</i> is the sequel to the puzzle game <a href=\"https://www.mobygames.com/game/biniax\">Biniax</a>. It keeps the core puzzle mechanics and expands mainly through new game modes. The Arcade mode is the closest to the original version. It is an endless game on a fixed-screen board where blocks, made up out of two differently coloured pieces each, gradually drop down over the entire width of a field. The player controls a single piece with one colour and can freely move it around the board as long as there is room.<br><br>To create a match the player moves the active piece directly into a block where one of the two pieces has that colour. Both pieces disappear and the player takes control of the remaining piece, with a different colour. This mechanic is used to clear a field quickly and to prevent it from reaching the bottom which will lead to the end of the game. There is a timer on the right that shows when the rows are moving down next, but the player can move as fast as possible regardless of that.<br><br>The second game mode is the Tactic mode. It is a slower puzzle mode where only a limited amount of moves are available to prevent the rows from constantly reaching the bottom. The final mode is the competitive multiplayer mode with local multiplayer for two players simultaneously, each controlling a piece on the same screen.<br><br>All platforms listed <a href=\"http://www.tuzsuzov.com/biniax/download2.html\">here</a>. Windows date: readme file - <a href=\"https://play.google.com/store/apps/details?id=com.biniax.sdl\">Android</a> - Linux: file date - <a href=\"http://aminet.net/package/game/think/Biniax2-mos\">Amiga</a> (MorphOS) - <a href=\"https://sourceforge.net/projects/biniax2apple/files/Biniax2/\">Mac</a> - <a href=\"https://dl.openhandhelds.org/cgi-bin/gp2x.cgi?0,0,0,0,25,2783\">GP2X</a> - <a href=\"http://console-news.dcemu.co.uk/biniax2psp-v1-0-105000.html\">PSP</a> - Xbox: <a href=\"http://the-eye.eu/public/xbins/XBOX/Console%20Based%20Applications/games/Biniax2/\">1</a> - <a href=\"https://www.1emulation.com/forums/topic/31517-biniax-2-new-ported-puzzle-game-by-freakdave/\">2</a> - <a href=\"https://gbatemp.net/threads/some-homebrews-biniax-maryo-chronicles-etc.337187/\">Wii</a>",
  "publishedBy": "",
  "developedBy": "",
  "released": "Feb 03, 2008",
  "alsoFor": "Android, GP2X, Linux, Macintosh, PSP, Wii, Windows, Xbox | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/biniax-2",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [],
  "cover": []
}