{
  "name": "Bridge Strike",
  "shortName": "bridge-strike",
  "description": "<h3>iTunes Store Description (from <a href=\"https://www.mobygames.com/game/bridge-strike/adblurbs\">Ad Blurbs</a>)</h3>Get behind the controls of our plane and fight for peace. You are our last hope!<br><br>Far, far away, there was a land where the tidiness lasted for many years... <br><br>Our secret service reports on the great enemy forces that are going towards our border. We must answer strongly and take them by surprise.<br><br>Be invisible to the enemy who lurks everywhere.<br><br>The mission takes place in glens where the river flows.\nA collision with rocks or enemy units is always deadly for our aircraft. The task is to destroy enemy units visible on the game map. <br><br>Some enemy units cannot be destroyed with rockets, so you simply have to avoid them. Sometimes there appear islands connected by a bridge which must be destroyed.<br><br>The player get points for all destroyed objects. When last aircraft crashes, the game ends.<br><br>The goal of the game is to fly in a glen to avoid detecting our aircraft by a network of enemy radars. It will not be a simple task, the enemy has arranged many dangerous units ready to thwart our plans.&quot;,<br><br>The enemy has a large range of various weapons, from ordinary patrol boats to complex automatic rocket systems. Fortunately, your aircraft has been equipped with the latest technological achievements in the form of endless rockets.<br><br>Rockets combined with your great pilot skills will help you achieve your goal and reach the last bridge.<br><br>Bridge Strike has stunning old school pixel graphics, a dedicated chiptune soundtrack and SFX and features several types of terrain across diverse and demanding missions.<br><br>Bridge Strike is not usual SHMUP arcade shooting game, where you fly anywhere with autofire and destroy enemies. You have to think while you fly in this shoot'em up game. You need to be careful, because not everytime faster means better :)<br><br>If you are good enough you will be able to change you flying machine to e.g. heli, hovercraft or even a boat!<br><br># RAID #<br><br>In this mode you have to destroy as many bridges as possible. Fly as far as you can, fight with enemies and get many points. Thanks to the points you will get attention from other pilots around the world! Yeah, there are LEADERBOARDS and ACHIEVEMENTS!<br><br># CAMPAIGN #<br><br>Build you pilot rank. Complete various missions, collect coins and buy new machines!<br><br># LOCATIONS #<br><br>Villages, cities, deserts and even mountains. Sooo big terrain to discover!<br><br># WEATHER #<br><br>When there is a sun don't wait. Just fly. Unfortunately, sometimes there is a rain or storm with thunders (clouds are dangerous when there are thunders, you may crash).<br><br>Flying in the mountains? Be prepared for snow or snowstorm!<br><br>What is the worst scenario?<br><br>Flying alone.. at night, during the storm with thunders. Nobody said it will be an easy task? :)<br><br># ENEMIES #<br><br>Watch out for boats, helis, jeeps, airships and tanks. Ah yeah.. there are also magnetic mines :)<br><br># HANGAR #<br><br>Destroy enemies and collect coins. You can exchange coins in HANGAR for new machines. Fly faster, collect more coins and get your flying machine as best as you can.<br><br># FEATURES #<br><br>- TRUE pixel perfect 2D graphics\n- classic arcade gameplay\n- fantastic sounds and music\n- two game modes: RAID and CAMPAIGN\n- various weather conditions\n- really cool locations\n- leaderboards and achievements\n- different machines: jet, heli, boat, hovercraft and more!\n- addictive gameplay<br><br>Hint: to destroy the mines you have to &quot;fly&quot; on the ground or in the river.<br><br>Project R3D is a small group of game enthusiasts. We are 100% independent indie games studio. Studio producing games by fans of games for game fans.<br><br>Good luck!",
  "publishedBy": "Project R3D",
  "developedBy": "Project R3D",
  "released": "2019",
  "alsoFor": "Android, iPad, iPhone, Nintendo Switch | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/bridge-strike",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Project R3D",
          "developer": "Project R3D",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2019",
          "ean13": "",
          "comments": "mail order release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}