{
  "name": "Champions of Dawn",
  "shortName": "champions-of-dawn",
  "description": "The year is 2469. Six months ago the Earth was plunged into thermonuclear war and 96% of its population was wiped out in a matter of hours. What was left were hit by radiation poison and mutated unspeakably, and left to live as savages. Ironically the only civilized areas left on the earth were controlled by the government which started the war, CY-COR. Realizing the advantage they held over the world they took it upon themselves to wipe out what was left of humankind. For this purpose the CY-COR mutation &quot;cleansers&quot; were created. Their job was to get rid of whatever the bombs left behind. Fortunately a faction of these cleaners rebelled against CY-COR in an attempt to right the wrongs CY-COR had done to the planet. As the leader of the rebellion you must overthrow the CY-COR government by invading their headquarters. Caution must be taken however as their base is heavily guarded and the surrounding landscapes are dangerous. The only way to gain access into the fortress is by finding 4 crystal keys. Without these the world is surely doomed.<br><br><em>Champions of Dawn</em> is a freeware RPG for the Amiga similar to <a href=\"https://www.mobygames.com/game/amiga/dungeon-master\">Dungeon Master</a>, with some <a href=\"https://www.mobygames.com/game/doom\">Doom</a> FPS elements. Like that RPG game, it is controlled using the mouse and keyboard. On the screen is a box with six arrows in it. Clicking on these moves forward, backward, left, right, or turns. The keyboard can also be used to control movement. Pressing the right mouse button brings up the inventory, where objects found can be stored in slots. Besides these slots, there is a mouth icon. Dropping food items on it nourishes the character. Below the mouth, two hands surround a black square. Placing weapons on this square activates them. Guns are fired by clicking the left mouse button. At the top of the screen there are two yellow bars. The first one is health, the second is ammunition. Food consumption and the use of health kits boosts the former, while ammunition clips increase the latter.",
  "publishedBy": "",
  "developedBy": "Zsoft",
  "released": "1996",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/champions-of-dawn",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/234770-champions-of-dawn-amiga-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/234771-champions-of-dawn-amiga-screenshot-game-start.png",
      "caption": "Game start"
    },
    {
      "link": "/images/shots/l/234772-champions-of-dawn-amiga-screenshot-lightning-archs.png",
      "caption": "Lightning archs"
    },
    {
      "link": "/images/shots/l/234773-champions-of-dawn-amiga-screenshot-inventory.png",
      "caption": "Inventory"
    },
    {
      "link": "/images/shots/l/234774-champions-of-dawn-amiga-screenshot-gun-ready.png",
      "caption": "Gun ready"
    },
    {
      "link": "/images/shots/l/234775-champions-of-dawn-amiga-screenshot-more-electricity.png",
      "caption": "More electricity"
    },
    {
      "link": "/images/shots/l/234776-champions-of-dawn-amiga-screenshot-an-opening.png",
      "caption": "An opening"
    }
  ],
  "cover": []
}