{
  "name": "Clown-O-Mania",
  "shortName": "clown-o-mania",
  "description": "In <i>Clown-O-Mania</i> the player takes the role of the clown Beppo who leaves his old profession behind in search of the land of magic crystals. To reach it, he needs to solve 82 isometric levels by collecting all balls and diamonds spread out over the tiles. The levels also have different plains which are changed by either using a ladder or jumping. However, jumps and shots for his gun need to be picked up first - which is made more difficult by the fact that the symbols move over the level. <br><br>Over the course of the game the difficulty and complexity rises at a steady rate, e.g. at first there are no enemies, later the enemies walk on pre-defined ways and even further down the path they actively try to hunt down Beppo. It also introduces more and more gameplay elements along the way, e.g. one-way tiles, teleports, funnels, speed-up tiles or death tiles. Some tiles change their colour when walking over them and having them all in the same colour when finishing the level gives major bonus points. Also useful are two different pyramids which stop or kill enemies when dropped in their way.",
  "publishedBy": "Starbyte Software",
  "developedBy": "",
  "released": "1989",
  "alsoFor": "Atari ST | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/clown-o-mania",
  "visual": "2D scrolling, Isometric",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Starbyte Software",
          "developer": "",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/601717-clown-o-mania-amiga-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/601718-clown-o-mania-amiga-screenshot-the-first-level-the-goal-is.png",
      "caption": "The first level: The goal is to collect all diamonds."
    },
    {
      "link": "/images/shots/l/601719-clown-o-mania-amiga-screenshot-we-just-stepped-on-an-teleporter.png",
      "caption": "We just stepped on an teleporter and were transported to another location."
    },
    {
      "link": "/images/shots/l/601720-clown-o-mania-amiga-screenshot-the-second-level.png",
      "caption": "The second level."
    }
  ],
  "cover": []
}