{
  "name": "Colorix",
  "shortName": "colorix",
  "description": "In this puzzle game you have to match a predefined colored pattern so that you fill a certain percentage with the rotatable fragments you have before you run out of matching fragments.<br><br>For example, in level 1 you have a 12x12 square, whereby the outer ring is purple, then blue, then red, then green, and finally a yellow block in the center.<br><br>Now you have a fragment for placing into the square, which you can rotate in any of the four directions. Once you placed it, those colored blocks will become gray and can't be used anymore. This also means that the next fragment must be placed totally into the colored area, overlapping isn't possible. And of course, you can only place them in a matching area of colored blocks.<br><br>And here comes the problem. Those fragments aren't just a square, they can be in unusual complex forms, and you have to carefully think where to place them, because once set, they can't be removed. And on top of this, you only have a few seconds to think. If the timer for a fragment runs to zero, you get a new fragment, but only if you have a bomb remaining, which is used when the time runs out. When you start a level, you have 5 bombs available.<br><br>Good news are that you normally don't have to fill all blocks, before you start the level, the game will tell you how much, in percent, you have to fill.<br><br>The game offers 100 different levels, one more complex then the other. This means, that the basic geometric figure will be more complex, but also the colored patterns inside the figure.<br><br>After completing a level, you get a level code for the following level, so you don't have to play all 100 levels in one row.",
  "publishedBy": "",
  "developedBy": "Mac Soft",
  "released": "1992",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/colorix",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [],
  "cover": []
}