{
  "name": "Computer Baseball",
  "shortName": "computer-baseball",
  "description": "<i>Computer Baseball</i> is a game of both strategy and statistics. Managers manipulate pinch hitters, infield positions, relief pitchers and base runners. 28 major league teams are provided to choose from and data for new teams can be entered as well.<br><br>Starting the game, you have four options to choose from: playing a game against the computer, playing a two player game, entering data for a new team and reviewing or editing data in an existing team data file. The display screen will consist of a scoreboard, batter and pitcher status information, and a representation of the playing field. The bottom of the screen is used for inputs on actions being taken.<br><br>There are seven different defense actions to choose from: setting the infield position, setting the outfield position, how close to hold base runners, making pitching changes, making a defensive substitution, saving the current game status and how to pitch to the batter. Some of the defensive actions taken will branch out to further options to select. There are three different offense actions to choose from: selecting a base running strategy, putting in a pinch hitter and choosing how you want the batter to hit the ball. Selecting any three of the offense actions will branch out to further options to select. <br><br>Player injuries are possible during game play, which the computer will specify while also determining how long the player will be injured (in days). It is also possible for a player to be ejected from the game for arguing with the umpire. On the event of a player being injured or ejected, the computer will ask for a substitute player. If a pitcher throws too many innings in one game, he will begin to tire, and another pitcher must be warmed up.  Bringing in a pitcher who isn't warmed up in the bullpen properly will reduce his effectiveness.<br><br>Before the game begins, you can stipulate which players and pitchers on each roster are unavailable for that game.<br><br>There is no functionality to save statistics or game results. ",
  "publishedBy": "Strategic Simulations, Inc.",
  "developedBy": "",
  "released": "Sep, 1986",
  "alsoFor": "Apple II, Atari 8-bit, Commodore 64, DOS, Macintosh | Combined View",
  "genre": "Sports, Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "Baseball",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/computer-baseball",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Strategic Simulations, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep, 1986",
          "ean13": "",
          "comments": "Released in fall 86'"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/897139-computer-baseball-amiga-screenshot-title-screen-game-needs.png",
      "caption": ""
    },
    {
      "link": "/images/shots/l/897140-computer-baseball-amiga-screenshot-credits.png",
      "caption": "Credits"
    },
    {
      "link": "/images/shots/l/897141-computer-baseball-amiga-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/897142-computer-baseball-amiga-screenshot-playfield.png",
      "caption": "Playfield"
    }
  ],
  "cover": []
}