{
  "name": "Der Produzent: Die Welt des Films",
  "shortName": "der-produzent-die-welt-des-films",
  "description": "In <i>Der Produzent: Die Welt des Films</i> the player is a film producer. The goal is to earn one billion Deutschmark within 20 years by producing and marketing popular movies.<br><br>The first step in making a picture is of course the script which is either purchased under several scripts for sale or as a commissioned work. The next step is to employ actors and a director with values in different character traits as charisma or experience. Besides the obvious budget restrictions the player has to consider antipathies, e.g. a vain actor might not want to work under a inexperienced director. Then the player has to rent one of six studios and one of four recording studio. The last action is to set the budget of the movie in six categories such as special effects and scenery. During the shooting there is the possibility of several random events, e.g. a fire or arguments between the actors. <br><br>After the making comes the marketing of the movie. Costly is the direct marketing in movie theaters or video stores. Then the player has to care for advertising in TV, radio or magazines. On the other hand extra cash can be made with the official CD or video game. Easier is it to sell the movie to a TV station or sell the whole rights to another publisher. <br><br>The main menu is a picture of a office. There the player chooses his actions respectively submenu either by clicking on the corresponding office items or the icon bar. Every action costs time and after a certain time the round, which represents one day, ends.",
  "publishedBy": "Games 4 Europe",
  "developedBy": "Silver Style Entertainment e.K.",
  "released": "1996",
  "alsoFor": "DOS | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/der-produzent-die-welt-des-films",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Games 4 Europe",
          "developer": "Silver Style Entertainment e.K.",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1996",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}