{
  "name": "?di?um",
  "shortName": "dium",
  "description": "<b>Story</b><br><br>Mutants have been found in the bombed out Polish city codenamed 'Gorky 17' near Lubin, and a trio of soldiers (Sullivan, Owicz and Trantigne, each of different nationalities) enter the city to find out what happened and find any member of the first squad previously sent there. You control the team and direct them through the world of surprises and mysteries that wait to be resolved. <br><br><b>Gameplay</b><br><br>The game is composed mainly of two playing modes. The (tentatively named) &quot;Adventure mode&quot; is displayed in a top down view point, with the team walking around the city in real time, interacting with objects, picking up weapons, ammunition from item chests and key items (such as keycards) and use them to advance to new areas. At fixed locations, the team will be ambushed by mutants, and the gameplay switches to the (again, tentatively named) &quot;Battle mode&quot;, featuring a battle field divided into square grids and an isometric perspective. Each side takes turn moving, attacking, defending and using items; the battle ends when all mutants die, or one of the main characters dies. The battle field would sometimes have items like exploding barrels, or item chests similar to those in &quot;Adventure mode&quot;.<br><br><b>Character Advancement</b><br><br>Each time the soldier hits and wounds a mutant, they gain experience; once the character gains enough experience, he levels up and gains stat points which can be used to improve attributes such as hit point, accuracy, etc. Also, each time the character successfully use a weapon, their experience with that particular weapon will be improved, and at the highest level (level 10) the weapon will deal its intended maximum damage (displayed as &quot;max damage&quot; in the weapon info). <br><br><b>Items and Weapons</b><br><br>The soldiers can equip themselves with melee weapons (crowbars, axe), conventional small arms (pistol, shotgun, assault rifle), special weapons (tranquilizer dart gun, stun gun) to heavy and sci-fi weapons. All weapons have limited range and most firearms can only shoot in certain directions (for example, pistols can shoot up, down, left, right, while assault rifles can also shoot diagonally); some fires in bursts or have splash damage meaning they can hit multiple enemies. Mutants also have varying degrees of protection against weapons (armor) and some have immunities for special effects of weapons (such as stun), which the game kindly takes notes once such information is found out.<br><br>In both &quot;Adventure mode&quot; and &quot;Battle mode&quot;, characters can transfer and equip weapons and body armor if available, or heal themselves or each other. The character are 3D models and the environment are pre-rendered 2D background, which is similar to games like <a href=\"https://www.mobygames.com/search/quick?game=Resident+Evil+2\"> Resident Evil 2 </a>. At certain points in the game, the characters may be joined by surviving soldiers or citizens, and will occasionally encounter boss-like monsters.",
  "publishedBy": "Hyperion Entertainment CVBA",
  "developedBy": "Metropolis Software House",
  "released": "Oct 19, 2015",
  "alsoFor": "Linux, Macintosh, Windows | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/dium",
  "visual": "",
  "gamePlay": "Tactical RPG",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Hyperion Entertainment CVBA",
          "developer": "Metropolis Software House",
          "ported": "Hyperion Entertainment CVBA",
          "country": " Worldwide",
          "releaseDate": "Oct 19, 2015",
          "ean13": "",
          "comments": "physical release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/429391-odi-um-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Worldwide",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/429392-odi-um-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Worldwide",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/429393-odi-um-amiga-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "Keep Case",
      "country": "Worldwide",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/429395-odi-um-amiga-media.jpg",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "Worldwide",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/429394-odi-um-amiga-other.jpg",
      "scanOf": "Other",
      "packaging": "Keep Case",
      "country": "Worldwide",
      "platforms": "Amiga"
    }
  ]
}