{
  "name": "Drip",
  "shortName": "drip_",
  "description": "<i>Drip</i> is a single player, keyboard controlled, shareware game for one or two players.<br><br>Drip is a cool drop and he's partying. Some dastardly person/thing has tapped into his network of pipes and has stopped his supply of party juice so Drip has to race around all the pipes and rust them in order to restore the flow. <br><br>So the objective in this game is to travel round a pipe network covering every pipe within a time limit. Naturally this is too easy so there are obstacles and problems to overcome so apart from the bad guys chasing him Drip has to avoid acid, plasma, ice-cubes, electric bubbles and lasers as contact with any of these will cost a life. There are also fluffy clouds which, when they touch a pipe will un-rust it.<br>\nThere are a couple of things that will aid Drip, he can travel off the top/bottom/edge of the screen and re-appear at the other side, stars occasionally appear on the screen and these give him a shield which kills enemies on contact, and then there are the party balloons. Balloons are essential on some levels, catching one allows Drip to float around the screen free of the pipe network, thus he can bypass his pursuers but more importantly he can reach pipe sections that are not connected to the rest of the network.<br><br>The game has sixteen levels which appear in a random order apart from the final boss level. The levels are themed Acid, Ice and Fire and are coloured green, blue and orange accordingly. \n",
  "publishedBy": "",
  "developedBy": "",
  "released": "1989",
  "alsoFor": "",
  "genre": "Action, Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/drip_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/817555-drip-amiga-screenshot-the-title-screen.png",
      "caption": "The title screen"
    },
    {
      "link": "/images/shots/l/817556-drip-amiga-screenshot-the-story-behind-the-game.png",
      "caption": "The story behind the game"
    },
    {
      "link": "/images/shots/l/817557-drip-amiga-screenshot-one-of-the-acid-levels-note-the-short.png",
      "caption": "One of the acid levels. Note the short pipes mid left and mid right of the screen. They are not connected to anything so the only way to get to them is by hopping on a passing balloon"
    },
    {
      "link": "/images/shots/l/817558-drip-amiga-screenshot-one-of-the-fire-levels-br-the-white.png",
      "caption": "One of the Fire levelsThe white line is either a fault in the way the emulator works or a lazer. Drip died before he got there, hit by a fireball"
    },
    {
      "link": "/images/shots/l/817559-drip-amiga-screenshot-game-over.png",
      "caption": "Game Over"
    },
    {
      "link": "/images/shots/l/817560-drip-amiga-screenshot-the-high-score-table-comes-pre-populated.png",
      "caption": "The high score table comes pre-populated"
    }
  ],
  "cover": []
}