{
  "name": "Elysium",
  "shortName": "elysium",
  "description": "Europe 390 A.D. - the Migration Period: As the Western Roman Empire struggles to repel migrating Germanic tribes fleeing from the incursion of the Huns into Eastern Europe, several of its provinces are breaking away seeking independence.<br><br>In &quot;Elysium&quot;, you rule one of these independent provinces. Your goal is threefold:\n(1) survive politically until the fall of the Western Roman Empire in 476 A.D.;\n(2) make your country the most livable for your people, turning it into an &quot;Elysium&quot;, an island of the blessed in those turbulent times;\n(3) (optionally) build an empire of your own by conquering other provinces.<br><br>Your challenges are firstly foreign and secondly domestic: ward off pillaging barbarian tribes such as the Vandals or the Huns and defend against legions of Roman troops sent by the Emperor to forcibly reintegrate you into his failing Empire. This requires building, equipping and maintaining a whole army of militia, career soldiers and mercenaries, financed by a vibrant domestic economy. Thus your tasks at home include the production of agricultural and other goods and building the necessary infrastructure, trade by sea and land, law enforcement and taxation, and most importantly: stay in power by keeping the masses happy with &quot;bread and circuses&quot;.",
  "publishedBy": "Magic Bytes",
  "developedBy": "Deep Thought",
  "released": "1993",
  "alsoFor": "DOS | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/elysium",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Magic Bytes",
          "developer": "Deep Thought",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/84930-elysium-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Austria , Germany  and Switzerland",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/84931-elysium-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Austria , Germany  and Switzerland",
      "platforms": "Amiga"
    }
  ]
}