{
  "name": "Enemy: Tempest of Violence",
  "shortName": "enemy-tempest-of-violence",
  "description": "<i>Enemy: Tempest of Violence</i> is an action game shown from the side. A seemingly abandoned space ship was the goal of a research team. Unfortunately aliens were still there and assaulted the humans. Now the player's mission is to purge all 34 floors. There is a fix set of objectives which have to be completed within a time limit, e.g. rescuing survivors, destroying alien eggs, finding weapons or killing aliens. Some of the objectives are not at the same place in each playthrough.<br><br>The defying feature of this game is variety in gameplay and objectives. It introduces more gameplay elements as it goes on and the player has to solve sections which rely on quick action, solving puzzles or both. Besides the expected movement options, the player character also has some more exotic moves like double jumps and walking backwards while shooting; equipment includes a variety of weapons, e.g. grenades or a silencer, and tools like a automap illustrator (complete maps can be found on computer terminals) or a movement sensor. During the course of the game the player may have temporary assistance by AI controlled characters. The game also features an optional help system which blends in symbols representing the next course of action, e.g. a light bulb means that there is a puzzle to solve and a white flag means the level is in an unwinnable state. ",
  "publishedBy": "Anachronia",
  "developedBy": "Anachronia",
  "released": "1997",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/enemy-tempest-of-violence",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Puzzle elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Anachronia",
          "developer": "Anachronia",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1997",
          "ean13": "",
          "comments": "EasyPlay version (freeware)"
        },
        {
          "publisher": "Alive Mediasoft",
          "developer": "Anachronia",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1999",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}