{
  "name": "Euro Soccer",
  "shortName": "euro-soccer",
  "description": "The game represents the most powerful European teams of 1992 season. England, Germany, Scotland, Netherlands, Italy, Spain, France, and Sweden propose the best teams of their premier divisions such as Bayern München, Manchester United, Celtic, Ajax, AC Milan, Real Madrid, FC Barcelona, Monaco, IFK Göteborg, etc. for player's choice.<br><br>Gameplay flows in side view, where soccer players are controlled either by human or CPU. There are two modes of playing. The first one is &quot;Friendly match&quot; for 2 players (playable only if a joystick is installed along with keyboard). The second one is &quot;Euro Cup tournament&quot; for 1 player. Different options such as match length (2/4/6/8 minutes), weather conditions (wet/dry), formation of the teams (4-4-2/4-3-3/4-2-4), and national anthems (on/off) may be adjusted.<br><br>Simulation of the players` team actions lies in the following. When the ball is near the player of your team, this player is selected as active and becomes controllable. As this player you should run to the player of the opposite team and take the ball, after that you may run with the ball, which is stuck to your feet, give a pass to another player of your team, or strike the ball. Your player may be moved in 8 directions. Your goalkeeper keeps your gates by himself. Camera follows the ball but with some delay, so the ball is often not in the center of the playscreen as well as nearest player of your team is not visible.<br><br>There is no ability to save the game in progress. So tournament should be played from the very beginning 'til the end during a single game session.",
  "publishedBy": "Flair Software Ltd.",
  "developedBy": "Flair Software Ltd.",
  "released": "1992",
  "alsoFor": "DOS | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/euro-soccer",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Flair Software Ltd.",
          "developer": "Flair Software Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/89893-euro-soccer-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "France , Germany , Italy  and United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/89894-euro-soccer-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "France , Germany , Italy  and United Kingdom",
      "platforms": "Amiga"
    }
  ]
}