{
  "name": "Exodus 3010: The First Chapter",
  "shortName": "exodus-3010-the-first-chapter",
  "description": "<i>Exodus 3010: The First Chapter</i> is set in 3010, shortly before Earth is lost for humanity. The player takes control over a huge space ship with 3 million settlers; the big goal being to find a new home planet. Unfortunately the settlers are all frozen up and there is only a small amount of resources on the ship which makes it more or less defenseless. <br><br>The game is a mostly menu-based strategy game. Most actions center around producing more smaller ships and weapons. However, everything needs resources which are gained by sending ships on gathering missions on meteors. By experimenting with the resources at hand, the player can either discover new items to produce or make a unhealthy bang. The smaller ships are piloted by settlers which have to be unfrozen and trained individually. Their statistics influence their successes during missions and fights. The latter may occur when the player meets other ships while travelling through space. Besides attacking on sight, there is the possibility to have a multiple-choice conversation with them. Optionally the player can participate in missions or fights by taking the role of a space ship. This plays out as first-person action which controls similar to <a href=\"https://www.mobygames.com/search/quick?game=Elite\">Elite</a>.",
  "publishedBy": "Demonware Softwarehaus GmbH",
  "developedBy": "",
  "released": "1991",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/exodus-3010-the-first-chapter",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Demonware Softwarehaus GmbH",
          "developer": "",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}