{
  "name": "Extase",
  "shortName": "extase",
  "description": "<i>Extase</i> is an action puzzle game, spiritual sequel to the brain bowler game in <a href=\"https://www.mobygames.com/game/purple-saturn-day\">Purple Saturn Day</a>. The screen display depicts a symmetrical network of wires, some buttons, some fuses, some switches, and a picture of a female android in the middle. The overall aim is to restore sensory functions to the android, one in each level. All of this is done against an opponent, either human or computer, who controls the opposite half of the board.<br><br>This is done by guiding electrical pulses through each of the wires, however this can only be done once the wires have been woken up. You are in control of a cursor, which can click on the activation buttons to release a ball, which you direct using the cursor to reactivate wires on its path. Switches must be set to make all parts of this available – this can only be done when no ball is active.<br><br>Electrical sparks move around to make life harder, by destroying balls and fuses. Fortunately these can be 'zapped' using the cursor. New fuses can be generated by guiding a power beam into the fusebox, which is located centrally – simply pick up and place a generated fuse.<br><br>Better still, you can steal your opponent's, which is one of many ways the game becomes directly competitive. The two cursors cannot occupy the same space on screen, so hitting your opponent's cursor will jolt it. You can also adjust switches on both sides of the board, and summon sparks for your opponent to deal with. As the android is reactivated during the level it shows a range of facial expressions as a visual reward and measure of your progress.",
  "publishedBy": "Virgin Mastertronic Ltd.",
  "developedBy": "Cryo Interactive Entertainment",
  "released": "1990",
  "alsoFor": "Atari ST, DOS | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/extase",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Virgin Mastertronic Ltd.",
          "developer": "Cryo Interactive Entertainment",
          "ported": "",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}