{
  "name": "Fatal Heritage",
  "shortName": "fatal-heritage",
  "description": "<i>Fatal Heritage</i> lives up to it's name: the protagonist of the game inherits a farm including a big treasure. Unfortunately said farm is far away and the local crime syndicate has an interest in the treasure, too. The game takes place in various locations all over the world.<br><br>The game is played in first-person with static screens which want to be explored with the mouse cursor. The interaction with the game world uses a traditional graphic adventure approach: first the action is chosen on the icon bar and then the player clicks on an object in the game world. This way the player solves the mostly inventory based puzzles, e.g. finding the misplaced will. There are also some multiple-choice conversations and friends which may accompany the player for a limited time. Those have special abilities, insights and objects which are important to solve some puzzles. The inventory is limited to 15 objects and when the player wants to take an additional one, an old has to be permanently destroyed which opens up the way for dead ends. <br><br>There is a constant time limit: a bar at the top of the screen shows how near the syndicate killer are. If the time is up, the player needs to finish the current location or the killers will end the game violently. To earn money, there are a few cards and dice mini games to participate in.",
  "publishedBy": "Delta Konzept GmbH",
  "developedBy": "EGOSOFT GmbH",
  "released": "1990",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/fatal-heritage",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Delta Konzept GmbH",
          "developer": "EGOSOFT GmbH",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1024354-fatal-heritage-amiga-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/1024355-fatal-heritage-amiga-screenshot-examining-a-bookshelf-one.png",
      "caption": "Examining a bookshelf. One of the books contains a secret code."
    },
    {
      "link": "/images/shots/l/1024356-fatal-heritage-amiga-screenshot-this-game-lets-you-examine.png",
      "caption": "This game lets you examine objects in the strangest places. A broom closet for example."
    },
    {
      "link": "/images/shots/l/1024359-fatal-heritage-amiga-screenshot-notary-on-the-line-with-an.png",
      "caption": "Notary on the line with an important message for me."
    },
    {
      "link": "/images/shots/l/1024358-fatal-heritage-amiga-screenshot-having-not-reacted-quickly.png",
      "caption": "Having not reacted quickly enough in the quick-time event, it is game over and I must restart the whole adventure again."
    },
    {
      "link": "/images/shots/l/1024357-fatal-heritage-amiga-screenshot-when-caught-up-by-the-mobs.png",
      "caption": "When caught up by the mobs the game suddenly turns into an unexpected quick-time event."
    }
  ],
  "cover": []
}