{
  "name": "Fighter Duel: Corsair vs. Zero",
  "shortName": "fighter-duel-corsair-vs-zero",
  "description": "<i>Fighter Duel: Corsair vs. Zero</i> is a combat flight simulation game for 1-2 players.<br><br>For single player, one can choose from training or combat (CAP) against an AI pilot. The training consists of a basic/advanced manoeuvres area, two basic/advanced gunnery areas and finally landing back on the carrier - remember to deploy the tail hook. Near the carrier, the guns are disabled, and instead there is a landing slope display active.<br><br>In single player combat, the player starts on the deck of one carrier, and does the 1 vs 1 combat in three areas located in the sea 12nm from the carrier, each area centered around a geographical feature, either two towers, a tall arch, or two islands. The friend/foe aircraft can be one of the two title models, Chance-Vought F4-U-1D &quot;Corsair&quot; or Mitsubishi A6M5a &quot;Zero&quot;.<br><br>In two player mode, the players start in the air in one of the three areas of Tower, Arch or Islands. Both players have to select the same area and also opposite starting headings (North/South) or the session fails to launch. Also the opposing aircraft must be different, you cannot duel against the same aircraft.\nThe carriers modelled are U.S.S. Bunker Hill (CV-17) and Imperial Japanese Navy carrier Shokaku.\nEnvironment colours can be changed in setup, if the default setting is not suitable.",
  "publishedBy": "Jaeger Software, Inc.",
  "developedBy": "",
  "released": "Dec, 1991",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/fighter-duel-corsair-vs-zero",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Jaeger Software, Inc.",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Dec, 1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/813262-fighter-duel-corsair-vs-zero-amiga-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/813263-fighter-duel-corsair-vs-zero-amiga-screenshot-main-menu.png",
      "caption": "Main menu"
    }
  ],
  "cover": []
}