{
  "name": "Fighter Duel Pro 2",
  "shortName": "fighter-duel-pro-2",
  "description": "<i>Fighter Duel Pro 2</i> is an enhanced version of the original <a href=\"https://www.mobygames.com/game/fighter-duel-pro\">Fighter Duel Pro</a>, with nine added aircraft. All of the previous aircraft and game modes are still present, while new game modes also have been added.<br><br>New is a single player mode with up to 1 vs. 4 computer controlled aircraft, and a multiplayer mode with 2 human vs. 2 computer controlled aircraft, either in pilot/gunner or lead/wingman configuration. A wingman can also be computer controlled, in single play 2 vs. 2. Gunnery is redesigned with a lead-computing gunsight. There is also an Anti-Aircraft gunner mode, where the player is defending his position from the ground against incoming enemy aircraft. <br><br>Hardware support for AGA graphics chipset makes the simulation faster on Amiga 1200 &amp; 4000 models, though original chipsets are still supported. Sky shading is improving on the old uniform blue color, and the aircraft configuration interface has been updated. More aircraft damage types are added, and view control using a joystick hat switch is supported. Ingame chat can be used in-flight.<br><br>Total number of aircraft are now 25 types, all the previous 16 plus 9 new:\n<ul>German:\n<li>Me-262 Schwalbe\n<li>Me-163 Komet\n<li>Focke-Wulf Ta152H\n<li>Me-110</li></ul>\n<ul>Japanese:\n<li>Ki-84</li></ul>\n<ul>Russian:\n<li>Yak-3</li></ul>\n<ul>US:\n<li>F2G Corsair\n<li>P-61 Black Widow</li></ul>\n<ul>British:\n<li>Spitfire Mk XIV</li></ul><br><br>",
  "publishedBy": "Jaeger Software, Inc.",
  "developedBy": "",
  "released": "Jan, 1994",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/fighter-duel-pro-2",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Jaeger Software, Inc.",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan, 1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}