{
  "name": "Frenetic",
  "shortName": "frenetic",
  "description": "The Earth has been under siege by evil aliens from the planet MOZONE for centuries. The planet can not be saved - it's time to find a new home for humanity. A heavily armed ship is sent ahead to scout for such a place - naturally, lots of MOZONE ships stand in the way.<br><br>Frenetic is a traditional vertically scrolling shoot'em'up. The action moves through eight levels, set both in space and on the ground (with such environments as a jungle planet and a water world). While most levels have a technological theme, some feature organic enemies and backgrounds, reminiscent of games like <a href=\"https://www.mobygames.com/search/quick?game=R-Type\">R-Type</a> or <a href=\"https://www.mobygames.com/game/xenon-2-megablast\">Xenon 2</a>. Going with tradition, each level has a huge end boss.<br><br>The player's ship can collect a variety of power-ups: lasers and missiles, shooting to the front, the back or the sides. Speed-ups and shields are also available. Power-ups are revealed by destroying certain enemies or special bonus capsules, and several are given to the player for free at the start of a level. The weapons can be upgraded by collecting the same power-up several times.<br><br>The game features a two-player mode, with two ships moving against the aliens at the same time.",
  "publishedBy": "Core Design Ltd.",
  "developedBy": "Core Design Ltd.",
  "released": "1991",
  "alsoFor": "Atari ST | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/frenetic",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Core Design Ltd.",
          "developer": "Core Design Ltd.",
          "ported": "",
          "country": " France, Germany, Italy, United Kingdom",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}