{
  "name": "Fun School 3: for the over 7s",
  "shortName": "fun-school-3-for-the-over-7s",
  "description": "<i>Fun School 3: for the over 7s</i> is an educational package which is part of the <i>Fun School</i> series. This package is aimed at the over sevens and consists of six programs with four games starring Robbie the Robot and two utilities. Each game has various skill levels and can be adjusted to suit the child's needs. The games are:<br><br><b>Wordsearch:</b> On screen is a list of words and the child has to find them hidden in a grid of letters. <br><br><b>Planet Maths:</b> Each maths sign (addition, subtraction, multiplication, division) can be played on its own or all together as a maths problem scrolls from right to left towards a force field. Get the answer right and the problem fires a missile that destroys the force field.<br><br><b>Treasure:</b> There are various pictures and on each one are directions (north, south, east and west) to the treasure, and distance in either cm or mm. <br><br><b>Sentences:</b> A paragraph with spelling and grammar mistakes is seen on screen. The child must adjust the mistakes to move on to the next paragraph.<br><br>The two utilities consist of:<br><br><b>Robot Draw:</b> The child can draw various shapes with a turtle on the screen. The child must click on various options to tell the turtle where to move by direction, angle and distance.<br><br>\n<b>Database:</b> This utility gives the child the chance to use a database by putting in their own information with the use of various options. A quiz on the information entered can also be played.",
  "publishedBy": "Database Educational Software",
  "developedBy": "Database Educational Software",
  "released": "1990",
  "alsoFor": "Amstrad CPC, Amstrad PCW, Atari ST, BBC Micro, Commodore 64, DOS, ZX Spectrum | Combined View",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/fun-school-3-for-the-over-7s",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Database Educational Software",
          "developer": "Database Educational Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "9 781872 084435",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}