{
  "name": "Halls of Montezuma: A Battle History of the United States Marine Corps",
  "shortName": "halls-of-montezuma-a-battle-history-of-the-united-states-marine-",
  "description": "The military is often painted in terms of precision.  Orders are expected to be followed exactly.  But what happens when those giving the orders are blind?  Blindness is a fact of life for commanders, who have to wait for their men to call in with information.  This game puts the player in the shoes of a Corps commander—a man responsible for several divisions—for the lives of thousands of men.  The player will command some of the most famous battles in U.S. history, and will have to deal with the same lack of face-to-face contact that plagues every higher-level military leader.<br><br>In this game the player replays historical battles in the wars with Mexico, World War I, World War II and the Korean War.<br><br>Think for a moment about war from the perspective of the Marine.  Out in the field, their duty is to carry out orders to the best of their ability.  They must try to cope with the unexpected that interferes with their progress—weather, enemies, terrain, fatigue, lack of supplies... Unfortunately, it is a fact that there is a disconnect between soldiers in the field and the commanders in the command centers. Commanders don't have a personal connection to each person under them.  They rely on those underneath them to report in...<br><br>This game gives some insight to the problems of command.  There are hundreds of units to keep track of, and the player needs a way to keep them organized.  The units become symbols on a map-board.  Contact with the units is limited to the reports that they send back and the orders that the player sends out.  Once the orders are given, the situation is really out of your control.  Will they be able or willing to follow orders exactly?  What happens if they are interrupted by the enemy, by weather, by terrain.  Is the information on enemy movements accurate, or did the player just send a division (thousands of men) to their deaths?<br><br>Most soldiers and Marines have never had the opportunity to see just what goes on inside the command centers, where the orders that they must follow come from.  This game recreates the command center.",
  "publishedBy": "Strategic Studies Group Pty Ltd.",
  "developedBy": "Strategic Studies Group Pty Ltd.",
  "released": "1990",
  "alsoFor": "Apple II, Apple IIgs, Commodore 64, DOS | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/halls-of-montezuma-a-battle-history-of-the-united-states-marine-",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Strategic Studies Group Pty Ltd.",
          "developer": "Strategic Studies Group Pty Ltd.",
          "ported": "",
          "country": " Australia",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/91061-halls-of-montezuma-a-battle-history-of-the-united-states-marine-corps-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Australia",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/91062-halls-of-montezuma-a-battle-history-of-the-united-states-marine-corps-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Australia",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/91063-halls-of-montezuma-a-battle-history-of-the-united-states-marine-corps-amiga-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Australia",
      "platforms": "Amiga"
    }
  ]
}