{
  "name": "Hexuma: Das Auge des Kal",
  "shortName": "hexuma-das-auge-des-kal",
  "description": "<i>Hexuma - Das Auge des Kal</i> is interactive fiction with graphics and a point-and-click interface.<br><br>This German-only game is the last of three text adventures created by the Weltenschmiede team, the other two being <i>Das Stundenglas</i> and <i>Die Kathedrale</i>. <i>Hexuma</i> sends you into an old, supposedly haunted mansion, which turns out to be a gateway to six different periods in Earth’s history. Travel from the age of dinosaurs to the distant future and bring back six crystal shards to battle the sinister god Kal.<br><br>Otherwise a conventional text adventure in its design and functionality, <i>Hexuma</i> is aiming for the versatility record: the game knows six different ways to enter a command. You can simply type it in. You can click on objects in the graphic window to trigger the most probable action. You can piece your sentence together in an icon menu. You can consult a list of pre-fabricated commands tailored to the situation. You can click on any word in the text screen to copy it in the command bar. And, strangest of all, you can enter your command letter by letter with the mouse on a display of a keyboard. Talk about German diligence.<br><br>There are a few puzzle dead-ends, so you might consider saving frequently.",
  "publishedBy": "Software 2000",
  "developedBy": "Weltenschmiede",
  "released": "1992",
  "alsoFor": "DOS | Combined View",
  "genre": "Adventure",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/hexuma-das-auge-des-kal",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Software 2000",
          "developer": "Weltenschmiede",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/963154-hexuma-das-auge-des-kal-amiga-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/963155-hexuma-das-auge-des-kal-amiga-screenshot-hawthorn-house-lone.png",
      "caption": "Hawthorn House, Lone Hill. The storm is raging, the lightning bolts are zapping and the music is a bit ominous. Nice Place!"
    },
    {
      "link": "/images/shots/l/963156-hexuma-das-auge-des-kal-amiga-screenshot-your-name-is-charles.png",
      "caption": "Your name is Charles McMullighan. You're an employee in Bedford Mortimer Real Estate, Galway, Ireland, and you are here, in this old &quot;haunted&quot; house to prepare it for a client viewing."
    },
    {
      "link": "/images/shots/l/963161-hexuma-das-auge-des-kal-amiga-screenshot-right-clicking-mouse.png",
      "caption": "Right clicking mouse calls up this handy menu with the most used commands in the game. Good idea to familiarize yourself with them."
    },
    {
      "link": "/images/shots/l/963162-hexuma-das-auge-des-kal-amiga-screenshot-you-also-can-bring.png",
      "caption": "You also can bring up this window with the preset commands suitable for this specific location. Later on you learn that some of them are just trolling you."
    },
    {
      "link": "/images/shots/l/963167-hexuma-das-auge-des-kal-amiga-screenshot-just-like-the-game.png",
      "caption": "Just like the game description says, there's an option to bring up a screen keyboard in German, and click away to your heart's delight on it. I've used it only to learn where is which letter."
    },
    {
      "link": "/images/shots/l/963168-hexuma-das-auge-des-kal-amiga-screenshot-just-as-you-are-wondering.png",
      "caption": "Just as you are wondering whether to start with mopping the floors or dusting the shelves, doorbell rings. A package has arrived, fashionably 70 years late. Surprise!"
    },
    {
      "link": "/images/shots/l/963169-hexuma-das-auge-des-kal-amiga-screenshot-after-finding-a-way.png",
      "caption": "After finding a way to open it and reading the documents inside, you have a chance to find out first-hand why the locals consider the place haunted or cursed. The evening stopped being boring fast."
    },
    {
      "link": "/images/shots/l/963170-hexuma-das-auge-des-kal-amiga-screenshot-auto-map-feature.png",
      "caption": "Auto-map feature. I guess back in 1992 that was a huge deal!"
    },
    {
      "link": "/images/shots/l/963172-hexuma-das-auge-des-kal-amiga-screenshot-the-ancient-shrine.png",
      "caption": "The Ancient Shrine, also known as Time and Space Travel Machine. The most guarded secret of the old mansion, the hub for your adventures, and the only way out with that monster on the loose."
    },
    {
      "link": "/images/shots/l/963174-hexuma-das-auge-des-kal-amiga-screenshot-catskill-mountains.png",
      "caption": "Catskill Mountains, Albany, United States of America, roughly 4560es. Poking around quickly informs you about really welcoming flora, fauna and merciless heat."
    },
    {
      "link": "/images/shots/l/963175-hexuma-das-auge-des-kal-amiga-screenshot-cruising-with-style.png",
      "caption": "Cruising with style on a rusty ACV."
    },
    {
      "link": "/images/shots/l/963176-hexuma-das-auge-des-kal-amiga-screenshot-arriving-to-baltimore.png",
      "caption": "Arriving to Baltimore, one of the only remaining cities."
    },
    {
      "link": "/images/shots/l/963177-hexuma-das-auge-des-kal-amiga-screenshot-baltimore-district.png",
      "caption": "Baltimore, District 10, City Centre. Population: a few robots."
    },
    {
      "link": "/images/shots/l/963178-hexuma-das-auge-des-kal-amiga-screenshot-this-one-roboss-for.png",
      "caption": "This one Roboss, for example, is hell-bent on hurting you. Run like the wind."
    },
    {
      "link": "/images/shots/l/963179-hexuma-das-auge-des-kal-amiga-screenshot-and-this-cute-little.png",
      "caption": "And this cute little Cleaning Bot would gladly help you out, if you can distract the Roboss somehow."
    },
    {
      "link": "/images/shots/l/963180-hexuma-das-auge-des-kal-amiga-screenshot-ice-age-looks-like.png",
      "caption": "Ice Age. Looks like you have landed right into somebody's old camp. Better loot it for warm clothes stat!"
    },
    {
      "link": "/images/shots/l/963181-hexuma-das-auge-des-kal-amiga-screenshot-after-many-hours.png",
      "caption": "After many hours of wandering about in the blinding polar day and freezing winds, you will finally stumble across a weird monolith. Hmm..."
    },
    {
      "link": "/images/shots/l/963182-hexuma-das-auge-des-kal-amiga-screenshot-next-stop-is-oceania.png",
      "caption": "Next stop is Oceania, early XIX century. Welcome aboard, mate!"
    },
    {
      "link": "/images/shots/l/963183-hexuma-das-auge-des-kal-amiga-screenshot-despite-the-very.png",
      "caption": "Despite the very short time period you spend with these two characters, they manage to make your life so much exciting by a whole bunch of methods."
    },
    {
      "link": "/images/shots/l/963184-hexuma-das-auge-des-kal-amiga-screenshot-next-instant-a-french.png",
      "caption": "Next instant a French Navy brig appears and makes a really short work of the pirate ship."
    },
    {
      "link": "/images/shots/l/963185-hexuma-das-auge-des-kal-amiga-screenshot-sooner-or-later-you.png",
      "caption": "Sooner or later you end up on a nice tropical beach. Seems like an idyllic place! But why is it called the Devil's Island then?"
    },
    {
      "link": "/images/shots/l/963186-hexuma-das-auge-des-kal-amiga-screenshot-welcome-to-the-late.png",
      "caption": "Welcome to the late Cretaceous! The goal of this level is to take away the favourite toy from a baby T-Rex."
    },
    {
      "link": "/images/shots/l/963187-hexuma-das-auge-des-kal-amiga-screenshot-its-mother-is-going.png",
      "caption": "Its mother is going to file an objection to that motion, however, considering you a nice snack for her kids instead."
    },
    {
      "link": "/images/shots/l/963188-hexuma-das-auge-des-kal-amiga-screenshot-hold-up-a-second.png",
      "caption": "Hold up a second... What is a Smilodon doing in the Mesozoic Era?"
    },
    {
      "link": "/images/shots/l/963189-hexuma-das-auge-des-kal-amiga-screenshot-literally-everything.png",
      "caption": "Literally everything in this place is hell-bent on eating or killing you. Even the herbivores. Run!"
    },
    {
      "link": "/images/shots/l/963190-hexuma-das-auge-des-kal-amiga-screenshot-eventually-you-end.png",
      "caption": "Eventually, you end up god knows where, and god knows when. It's a huge mine, full of overworked slaves and mean looking guards itching for a fight."
    },
    {
      "link": "/images/shots/l/963191-hexuma-das-auge-des-kal-amiga-screenshot-but-if-you-manage.png",
      "caption": "But if you manage to sneak past them, then after wandering around the tunnels a bit, you run into a weird old man that's strangely somehow familiar to you..."
    }
  ],
  "cover": []
}