{
  "name": "Hurrican",
  "shortName": "hurrican",
  "description": "<i>Hurrican</i>, a freeware Windows remake of <a href=\"https://www.mobygames.com/game/turrican\">Turrican</a>, is a fast-paced side-scrolling platformer. The player has to explore 9 levels and fight many different types of enemies at once. Rather than only recreating the original game graphically, there are many new features and redesigns.<br><br>The player has 3 lives and each level is time-limited. Starting with 700 seconds, additional time is added when 50 diamonds are collected. There is only one weapon, but with three modes: spreadshot (red), laser (blue) and bounce (green). Each weapon has unlimited ammo can be upgraded multiple times, but these are lost when the character dies. Another function is lightning. By charging, the player can either create a blue blast and swing it around, or launch it as a projectile. It can be upgraded as well and cannot be used unlimitedly. In difficult situations, a powerline can be activated - a double vertical line of fire that covers the entire screen. The player can also go into wheel mode, during which the character is invincible. This can be used to go through narrow passages while optionally dropping bombs. Additionally, there are grenades, a shockwave, and a smartbomb filled with a power-up.<br><br>The player can shoot in five directions (270 degrees clockwise to 90 degrees), crouch and jump. Holding the jump button longer has the character jump higher and by holding the shoot button, there is autofire, but the rate can also be increased by tapping the button quickly. Enemies attack from all directions and often originate from nests that spawn them. There are multiple routes to cross the levels and signs guide the player to the exit. As in the original game, the levels are filled with secret areas, hidden behind destructible walls or on hard to reach places. Next to diamonds, there are different power-ups, health items, a shield, and bonuses to collect.<br><br>Each level ends with a level boss and there is an option to save the game before continuing. The character can take multiple hits and the current health is shown in a red circle in the top left corner. There are 4 difficulty levels and an option to play the game cooperatively with another human player. The game is mod-friendly and custom-made level packs, with new graphics and sounds, are supported.",
  "publishedBy": "",
  "developedBy": "Poke 53280",
  "released": "Jul 04, 2012",
  "alsoFor": "Windows | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/hurrican",
  "visual": "",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [],
  "cover": []
}