{
  "name": "Indian Mission",
  "shortName": "indian-mission",
  "description": "Professor of occult sciences Clark Bokel has found that an old Hindu named Tai has hidden secret manuscripts in an old house in Normandy before his death. Taking his colt pistol just in case, Clark decides to visit this house. During the search, he realizes that four cursed gods will awake soon and he should stop them. To achieve this, he should travel to Indian city Nagpour and further to the plateau, where he must learn three skills allowing him to turn into fire, mouse, and bird, in order to fight the cursed gods. Finally, to get to their territory he has to pass through temple gardens labyrinth, acquiring the keys and following path of light.<br><br>The game mechanics are similar those of a <a href=\"https://www.mobygames.com/search/quick?gamegroup=Gobliiins\">Gobliiins</a> game, though the player controls a single character with the ability to turn into three other beings. Stages are usually rather small, though not always restricted to one screen. The player has to collect items, such as bullets, knives, or sprays to use them on blocking opponents in order to bypass them. Often, additional items such as keys, money, a passport, an airline ticket, etc. should be collected to finish a stage. Sometimes flying in a helicopter or traveling by boar is required. Time limit is imposed on the main character's mission.",
  "publishedBy": "Coktel Vision",
  "developedBy": "Coktel Vision",
  "released": "1988",
  "alsoFor": "Atari ST | Combined View",
  "genre": "Adventure",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/indian-mission",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Coktel Vision",
          "developer": "Coktel Vision",
          "ported": "",
          "country": " France",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/997839-indian-mission-amiga-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/997840-indian-mission-amiga-screenshot-story.png",
      "caption": "Story"
    },
    {
      "link": "/images/shots/l/997841-indian-mission-amiga-screenshot-game-start.png",
      "caption": "Game start"
    }
  ],
  "cover": []
}