{
  "name": "Jonathan",
  "shortName": "jonathan",
  "description": "German small-town quietness erupts in a whirl of obscure horror, aggression and uninhibited sexuality as an ancient force stirs and warps minds. As Kronstadt drifts into chaos in the course of eleven days in November, a teenager bound to the wheelchair dabbles in Celtic mysticism and discovers his talent for magic. Bourgeois bliss, late-80’s youth culture, occultism and photorealistic nudity mix into a psychedelic nightmare that stands out as the most perplexing German adventure game.<br><br>The successor to <a href=\"https://www.mobygames.com/game/holiday-maker\">Holiday Maker</a> and <a href=\"https://www.mobygames.com/search/quick?game=Stadt+der+L%c3%b6wen\">Stadt der Löwen</a>, and <a href=\"https://www.mobygames.com/search/quick?company=Phoenics\">Phoenics</a>’ (formerly <a href=\"https://www.mobygames.com/search/quick?company=PM+Entertainment\">PM Entertainment</a>) third (and last) adventure game, <i>Jonathan</i> was a child of the dusk of Germany’s vibrant Amiga scene, where a maximum of finesse met a new minimum of public interest. <br><br><i>Jonathan</i> is unconventional to the brink of schizophrenia, both in style and gameplay. The actual adventure actions in a colorless, messy interface are contrasted with the sumptuous high-res artworks of the frequent cutscenes. Many of these revolve around the members of the protagonist Jonathan’s clique, who are essential to the game – the disabled young man must rely on their help to do things he is unable to do. <br><br>As the game switches perspective and explores the minds of Jonathan’s friends, it focuses on their sexuality with a unabashed bluntness that should have shocked the pampered German audience, had anyone bought it.",
  "publishedBy": "Software 2000",
  "developedBy": "Phoenics",
  "released": "Feb, 1993",
  "alsoFor": "DOS | Combined View",
  "genre": "Adventure",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/jonathan",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Software 2000",
          "developer": "Phoenics",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Feb, 1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}