{
  "name": "Lord of Alcandria: Chapter III",
  "shortName": "lord-of-alcandria-chapter-iii",
  "description": "<i>Lord of Alcandria: Chapter III</i> is a fantasy point &amp; click adventure game. As in Chapter II, you play Krilok Rainwood, a scythe-wielding member of the undead. The game opens on a bright sunny morning as Krilok wakes up by the side of a winding road that leads off to a castle in the distance. He meets a group of rebels hiding out in the forest nearby, and with their help, he hatches a plan to infiltrate the King's stronghold.<br><br>The interface splits the screen vertically, where the top half of the screen shows the current scene from a third-person perspective, and underneath is a panel that lists the inventory items you are carrying as well as nine action buttons (&quot;Pick up&quot;, &quot;Look at&quot;, &quot;Talk to&quot;, &quot;Use&quot;, &quot;Give&quot;, &quot;Open&quot;, &quot;Close&quot;, &quot;Push&quot; and &quot;Pull&quot;). Left-clicking the mouse is used to select an action button or an inventory item, and also used on the scene to direct the main character to walk towards the clicked point. Right-clicking is used to perform an action on a scene object or character. There are 10 savegame slots that you can save to by holding down the shift key and pressing one of the function keys F1-10, and later load from by pressing the same function key without holding down shift.",
  "publishedBy": "",
  "developedBy": "Masterkey Software",
  "released": "1999",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/lord-of-alcandria-chapter-iii",
  "visual": "",
  "gamePlay": "Graphic adventure",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/869462-lord-of-alcandria-chapter-iii-amiga-screenshot-first-location.png",
      "caption": "First location"
    },
    {
      "link": "/images/shots/l/869463-lord-of-alcandria-chapter-iii-amiga-screenshot-at-the-castle.png",
      "caption": "At the castle"
    }
  ],
  "cover": []
}