{
  "name": "Manchester United Premier League Champions",
  "shortName": "manchester-united-premier-league-champions",
  "description": "After Manchester United won the English League championship for the first time since 1967, it was no surprise that Krisalis re-used their existing license for a third licensed football game. Little did they know that the club was entering an unprecedented run of success that has continued well into the 2010s.<br><br>The basic control system will be familiar to anyone who’s played <a href=\"https://www.mobygames.com/search/quick?gamegroup=Kick+Off\"> a Kick Off game</a>, as it involves holding fire to trap the ball under your player’s foot, and releasing fire to pass, although the ball will be kicked onwards if it is moving fast when it comes to you. Other gameplay features include diving headers, variable pitch conditions, penalty shoot-outs and accurate deflections. 2500 players featured in the game all had a range of varied ability statistics, as well as different skin tones.<br><br>As well as individual matches and custom-created tournaments (which have much the same range of features as <a href=\"https://www.mobygames.com/search/quick?game=Sensible\">Sensible Soccer</a>, plus full calculation of injury and suspension severities, including disciplinary points and differing injury lengths), you can play out a full season of matches for any club in England’s top 5 divisions – all domestic league and cup matches are included, with promotions and relegations taking place after each season. The Tacti-Grid editor allows for advanced match tactics to be configured and experimented with.",
  "publishedBy": "Krisalis Software Ltd.",
  "developedBy": "Krisalis Software Ltd.",
  "released": "1994",
  "alsoFor": "Amiga CD32, DOS | Combined View",
  "genre": "Action, Simulation, Sports",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/manchester-united-premier-league-champions",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Krisalis Software Ltd.",
          "developer": "Krisalis Software Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}