{
  "name": "Marbles",
  "shortName": "marbles",
  "description": "<em>Marbles</em> is a puzzle game where you control a blue marble in an abstract tile based world with the aim of reaching the goal tile on each stage. Before you can do so you must collect all gems on the stage. You move one square at a time, and tiles that you roll over will disappear after you have visited them. Thus you must plan your route carefully so make sure that you do not get trapped and have to start over.<br><br>Some tiles have special functions, symbolized by its icons. There are one-way arrows, teleports, keys that open keyholes, deadly skulls and bombs that remove them. Most such tiles can be moved around: By right clicking on it you put it in your &quot;pocket&quot; (shown at the left side of the screen). Now you can right click on another tile and the two will be swapped. By moving tiles around like this you can rearrange the level tiles to create a route that takes you to the goal!<br><br>The game is divided into several &quot;worlds&quot;, each with its own music and background image. Each world contains a number of stages, and a password feature allows you to jump directly to a world. The game also contains a level editor if you want to build your own levels.<br><br>The game was published as freeware on the 17bit PD library (disk 3305). In 2002 a sequel called <a href=\"https://www.mobygames.com/game/marbles-deluxe\">Marbles Deluxe</a> was released for the PC.",
  "publishedBy": "17-Bit Software",
  "developedBy": "",
  "released": "1991",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/marbles",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "17-Bit Software",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/163928-marbles-amiga-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amiga"
    }
  ]
}