{
  "name": "Mobile Warfare",
  "shortName": "mobile-warfare",
  "description": "Mobile Warfare is a turn based strategy game. The game starts with a mission briefing in the office of General Armstrong. The government in Romania has been overthrown. In your first mission you are to clear the village of Ploiesti from terrorists so that the UN forces can make way to the village and assess the situation from there. After the briefing you are taken to the game screen where you can see the whole battlefield from an isometric view. To the right of this is the information area where you can see your units statistics (attack, defend and movement points), a compass for unit movement and options.<br><br>Several units are available in Mobile Warfare. Some of them are riflemen, nurses, tanks and bazooka men. Units are moved around on the battlefield one block at a time. To attack an opposing unit you have to be adjacent to it. Once your unit is next to the target, you must move one more square in the direction of the target, and the combat will begin. You can also destroy some non-unit objects, for example one mission where civilians are held hostage and you have to use your bazooka man to blow a hole in the fence that surrounds the hostages. ",
  "publishedBy": "Epic Marketing",
  "developedBy": "Applaud Software Ltd",
  "released": "1998",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/mobile-warfare",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Epic Marketing",
          "developer": "Applaud Software Ltd",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1998",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}