{
  "name": "Moria",
  "shortName": "moria",
  "description": "<i>Moria</i> is a member of the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Rogue+Variants\">roguelike</a> RPGs. It features several innovations, like a town level and dungeons levels that are bigger than one screen, and was the first open source and freeware roguelike.<br><br>The goal of <i>Moria</i> is to descend in the dungeons of Moria and defeat the evil Balrog who is cowardly hiding on the lowest level. Other than this, there are no other references to J.R.R. Tolkien in this game.<br><br>You begin the game by creating your character, choosing your sex and one of eight available races. You can then roll your stats and, when you got some which suit you, choose your class from six available classes (you can only some of them, depending on your stats). After entering a name, you're ready to roll.<br><br>The game is entirely played in turns, feature text-only graphics showing your environment from above, and is played by entering character commands.<br><br>You start in town, where you can visit several shops to buy weapons, armor, torches, food and other useful -- and sometimes magic -- items. You can barter with the shopkeepers to get reduced prices.<br><br>The dungeon levels are randomly generated. They contain a variety of monsters, some of which invisible, and items, as well as traps and secret doors. Each level has more than one exit. As in other roguelikes, you explore the dungeons, kill monsters as you go, and try to accumulate as much treasure as possible.",
  "publishedBy": "",
  "developedBy": "",
  "released": "1988",
  "alsoFor": "Acorn 32-bit, Atari ST, DOS, GP32, Macintosh, Mainframe, OS/2 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/moria",
  "visual": "",
  "gamePlay": "Roguelike",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/800115-moria-amiga-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/800116-moria-amiga-screenshot-character-creation-process.png",
      "caption": "Character creation process."
    },
    {
      "link": "/images/shots/l/800117-moria-amiga-screenshot-the-game-starts-in-a-town.png",
      "caption": "The game starts in a town."
    },
    {
      "link": "/images/shots/l/800118-moria-amiga-screenshot-do-some-shopping-before-entering-the.png",
      "caption": "Do some shopping before entering the dungeon."
    },
    {
      "link": "/images/shots/l/800119-moria-amiga-screenshot-the-game-is-controlled-by-keyboard.png",
      "caption": "The game is controlled by keyboard commands or menus."
    },
    {
      "link": "/images/shots/l/800120-moria-amiga-screenshot-soon-you-will-meet-hostile-monsters.png",
      "caption": "Soon you will meet hostile monsters."
    }
  ],
  "cover": []
}