{
  "name": "Regnum",
  "shortName": "regnum",
  "description": "<i>Regnum</i> is a turn-based strategy game for up to six players. To win the game, players have to either conquer all cities on the map or be the only remaining player in the game. Human and computer players alternate after each turn.<br><br>Each player starts out with one city at the beginning of a new game. Cities produce goods such as food, gold, energy and raw materials. These goods can be traded on a market which is used by all players. Cities which are not conquered yet produce goods that can be bought on the market. The goods are used to finance and supply the player's armies, forts ands ships as well as the construction of new cities. Each city produces only one type of good, which can be selected by the player.<br><br>Moving a unit costs energy, which is recharged after each round. Small armies can be combined to generate even larger armies. Players can attack each other simply by moving their army onto a field occupied by an enemy. Defenders in general have a higher defense value, while larger armies have greater attack values.<br><br><i>Regnum</i> is controlled entirely with the mouse and viewed in a top-down perspective, with two scroll bars for horizontal and vertical scrolling. All strategic decisions can be made from a menu on the right of the screen.",
  "publishedBy": "Markt &amp; Technik",
  "developedBy": "",
  "released": "1989",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/regnum",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Markt &amp; Technik",
          "developer": "",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/133396-regnum-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Other",
      "country": "Germany",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/133397-regnum-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Other",
      "country": "Germany",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/133395-regnum-amiga-media.jpg",
      "scanOf": "Media",
      "packaging": "Other",
      "country": "Germany",
      "platforms": "Amiga"
    }
  ]
}