{
  "name": "Scrabble",
  "shortName": "scrabble_____",
  "description": "<i>Scrabble</i> is a licensed version of the popular <a href=\"https://www.mobygames.com/search/quick?company=Spear%27s+Games\">Spear's </a> game developed by <a href=\"https://www.mobygames.com/search/quick?company=U%2eS%2e+Gold+Ltd%2e\">U.S. Gold Ltd.</a> <br><br>Scrabble is a word game for 2 - 4 players. \nIt is played by forming inter-locking words, cross-word style, on a Scrabble playing board. The Scrabble board is a grid on which there are bonus squares, playing a letter on one of these squares doubles or triples the score for either the letter or the entire word.\nPlayers have seven letters, or tiles, each and at the end of each turn they take new letters from a pile, unseen, to replace the letters used. <br><br>This game has the following features:<ul>\n<li>multi-player game<br> 2, 3, or 4 players can play the game together. Players can be human or computer controlled.</li>\n<li>sound effects and music.</li>\n<li>a practice mode.<br>This mode of play enables the following features:<ul>\n<li>no time limit,</li>\n<li>a hint mode where the game shows the best move with the letters at the players disposal,</li>\n<li>an advice feature which, after the player has taken their turn, shows how many higher scoring moves could have been made,</li>\n<li>the option to see what tiles remain unplayed,</li>\n<li>a peek facility that allows the player to see other player's tiles,</li>\n<li>if an illegal word is played it will not be allowed but the player will not lose their turn,</li></ul>\n<li>a competition mode.<br>\nIn this mode each player has 25 minutes in which to play all of their game moves and for each minute over that limit the player is fined 10 points.<br>\nThe 'hint' and 'advice' features of the practice session are not available and the 'unused letters' option will show only the number of letters and not a full breakdown of the tiles remaining. If it is the players move then the timer cannot be stopped, and the game cannot be saved and re-loaded.<br>\nOnly game scores achieved in competition mode will be entered into the 'Top Scores' table.</li></ul>This game is based on the Chambers English Dictionary and the Official Scrabble Words books current at the time of release.",
  "publishedBy": "U.S. Gold Ltd.",
  "developedBy": "Cygnus Cybernetics Corporation",
  "released": "1993",
  "alsoFor": "Acorn 32-bit, Atari ST, DOS | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/scrabble_____",
  "visual": "",
  "gamePlay": "Board game, Word construction",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "U.S. Gold Ltd.",
          "developer": "Cygnus Cybernetics Corporation",
          "ported": "Arc Developments",
          "country": " United Kingdom",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}