{
  "name": "Shogo: Mobile Armor Division",
  "shortName": "shogo-mobile-armor-division",
  "description": "Sanjuro is a commander in the army of United Corporate Authority and a pilot of a Mobile Combat Armor (a giant mech) in the far future. The UCA is fighting the Fallen, a terrorist organization. This conflict has its victims: Sanjuro's brother, best friend and girlfriend all died while completing a mission years ago, and only recently he has been somewhat succeeding in putting the past behind him. Now Sanjuro is given a mission to find and kill Gabriel, a new leader of the Fallen. But during this assignment, ghosts of the past will come back to haunt him.<br><br><i>Shogo: Mobile Armor Division</i> is a first-person shooter that incorporates ideas from anime and the <a href=\"https://www.mobygames.com/search/quick?game=MechWarrior\">MechWarrior</a> concept. On some levels, the player controls Sanjuro while he is on foot, infiltrating enemy buildings and fighting with handheld firearms. Sanjuro can find health power-ups, more powerful weapons and ammo. Both Sanjuro and the enemies will randomly score critical his, which not only cause more damage, but also replenish a small portion of health.<br><br>On other levels, the player pilots one of the four available MCAs, which differ a little in characteristics. This giant mech can walk, jump and crouch just like a human being, and controlling it is very similar to controlling Sanjuro. The player guides this colossus through city districts swarming with enemy soldiers and mechs. It is also possible to transform the mech into a vehicle, though it can not defend itself in that state.<br><br>The story progression is linear for the most part. However, at one point, the player is prompted to make a choice that will affect the rest of the plot and the ending.",
  "publishedBy": "Titan Computer GbR",
  "developedBy": "Monolith Productions, Inc.",
  "released": "May 05, 2001",
  "alsoFor": "Linux, Macintosh, Windows | Combined View",
  "genre": "Action",
  "perspective": "1st-person, Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/shogo-mobile-armor-division",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Titan Computer GbR",
          "developer": "Monolith Productions, Inc.",
          "ported": "Hyperion Entertainment CVBA",
          "country": " United States",
          "releaseDate": "May 05, 2001",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}