{
  "name": "Sid Meier's Colonization",
  "shortName": "sid-meiers-colonization",
  "description": "<i>Sid Meier's Colonization</i> is a strategy game which puts you in the role of Viceroy of the New World. You are sent by your King and country to establish colonies in the newly-discovered Americas that lie to the west. You face many of the same challenges that faced colonial organizers of the time-competition\nfrom other Old World powers, strange native cultures, the problems of establishing profitable trade programs, and the problems of organizing an army from a rag-tag band of colonists.<br><br>The game begins with the European discovery of the Americas (1500) and continues until approximately the time of the American\nRevolution (1800). In the beginning of the game you are given a trading/exploration ship and a small group of colonists. You have no knowledge of what lies ahead of your ship, so you must explore until you find a suitable spot to lay down your first colony. As your\ncolonies grow larger and larger, you inevitably encounter native populations and are confronted with competing imperial powers from the Old World.<br><br>Each of your colonies is populated by a number of colonists, who you can assign to various tasks. Some chop wood, mine for ore and collect plants outside the colony, some others stay inside to turn those raw materials into more valuable cargo - such as rum (made from sugar), coats (made of furs) or hammers (made of lumber). Hammers which aren't a cargo you can sell, but represent the speed with which you construct new buildings in your colony. Some colonists are specialists, and thus are more effective at a certain job. <br><br>The cargo you collect and produce is an important thing. You can take it to Europe to sell, and earn money to buy some other necessary things, hire colonists (though new, willing colonists appear in Europe by themselves) or buy ships and artillery. You can also trade it with the Indians or colonies of other nations. <br><br>You'll construct various buildings in your colonies. They have a lot of different functions: some of them can improve the speed with which you produce valuable cargo, others allow you to defend yourself from attacks more easily or construct ships and artillery. Some buildings require you to spend a number of valuable Tools when constructed, though you can make new Tools out of ore. <br><br>As you explore the land, you'll come across the Indian villages and some &quot;places of interest&quot; which can be investigated. A colonist that enters an Indian village can be welcomed with open hands, and the natives will reveal a map of nearby lands, or teach him a profession. Investigating places of interest has various consequences: sometimes you'll find nothing, sometimes you'll be killed for trespassing on ancient burial ground, but sometimes you'll find treasure! (Taking this treasure to Europe can be difficult though - if you don't have a sufficiently big ship, the King will agree to transport it for you... if you give him 50% of the gold). <br><br>To defend yourself from enemies, you'll want to have some military units. Just give a colonist a musket and he'll turn into a Soldier, give him a horse, and he's a Scout or a Dragoon. However, such a warrior is typically inexperienced, though he might gain military experience in battle. Artillery is also good at defense, but don't try to leave your colonies with it - in the open field, it is useless. <br><br>As you progress in the game, you'll feel that working for the King is getting more and more annoying, especially since he keeps raising your taxes, thus decreasing your income from sold goods. Your colonies produce &quot;Liberty Bells&quot;, which increase rebel sentiment in the colonies. If the majority of colonists supports your yearning for freedom, you can declare independence. But when you do that, you'll have to deal with the King's expeditionary force arriving to teach you a lesson. If you manage to defeat all his incoming armies and emerge victorious from the American Revolutionary War, you've won! ",
  "publishedBy": "MicroProse Software, Inc.",
  "developedBy": "MPS Labs",
  "released": "May 31, 1995",
  "alsoFor": "DOS, Linux, Macintosh, Windows, Windows 3.x | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/sid-meiers-colonization",
  "visual": "",
  "gamePlay": "4X, Managerial / business simulation, Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "MicroProse Software, Inc.",
          "developer": "MPS Labs",
          "ported": "",
          "country": " United States",
          "releaseDate": "May 31, 1995",
          "ean13": "",
          "comments": "version 1.11"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/239113-sid-meier-s-colonization-amiga-screenshot-the-start-game-options.png",
      "caption": "The Start Game Options Screen"
    },
    {
      "link": "/images/shots/l/239114-sid-meier-s-colonization-amiga-screenshot-select-your-nationality.png",
      "caption": "Select your nationality"
    },
    {
      "link": "/images/shots/l/239115-sid-meier-s-colonization-amiga-screenshot-after-a-short-voyage.png",
      "caption": "After a short voyage you come across a New World"
    },
    {
      "link": "/images/shots/l/239116-sid-meier-s-colonization-amiga-screenshot-which-you-can-name.png",
      "caption": "...which you can name as you wish"
    },
    {
      "link": "/images/shots/l/239117-sid-meier-s-colonization-amiga-screenshot-the-orders-pull.png",
      "caption": "The orders pull down menu allows you to carry out various actions (Note: I have Magic Menu installed so these are activated as pop-ups)"
    },
    {
      "link": "/images/shots/l/239118-sid-meier-s-colonization-amiga-screenshot-you-soon-come-in.png",
      "caption": "You soon come in contact with the locals - Do you want peace or war?"
    },
    {
      "link": "/images/shots/l/239119-sid-meier-s-colonization-amiga-screenshot-later-in-the-game.png",
      "caption": "Later in the game it is very convenient to select your destination port using this menu"
    },
    {
      "link": "/images/shots/l/239120-sid-meier-s-colonization-amiga-screenshot-the-colony-menu.png",
      "caption": "The colony menu allows you to allocate labour, build improvements and train settlers."
    },
    {
      "link": "/images/shots/l/239121-sid-meier-s-colonization-amiga-screenshot-back-in-the-home.png",
      "caption": "Back in the home port you can trade, recruit and purchase goods, specialists and ships."
    },
    {
      "link": "/images/shots/l/239122-sid-meier-s-colonization-amiga-screenshot-as-your-colony-grows.png",
      "caption": "As your colony grows you can recruit Founding Fathers who give various benefits - who you choose depends on your game strategy."
    },
    {
      "link": "/images/shots/l/239123-sid-meier-s-colonization-amiga-screenshot-various-game-options.png",
      "caption": "Various game options can be accessed from the pull down menus"
    },
    {
      "link": "/images/shots/l/239124-sid-meier-s-colonization-amiga-screenshot-sending-a-settler.png",
      "caption": "Sending a settler to an Indian village allows them to be trained in that village's speciality"
    },
    {
      "link": "/images/shots/l/239125-sid-meier-s-colonization-amiga-screenshot-at-the-end-of-your.png",
      "caption": "At the end of your turn the computer makes its moves, thankfully just a matter of seconds"
    },
    {
      "link": "/images/shots/l/239126-sid-meier-s-colonization-amiga-screenshot-from-time-to-time.png",
      "caption": "From time to time your King makes you some generous offers but are they worth it?"
    },
    {
      "link": "/images/shots/l/239127-sid-meier-s-colonization-amiga-screenshot-pioneers-are-essential.png",
      "caption": "Pioneers are essential to improve your colony's land and production abilities"
    },
    {
      "link": "/images/shots/l/239128-sid-meier-s-colonization-amiga-screenshot-keeping-on-the-friendly.png",
      "caption": "Keeping on the friendly side of the native's has its benefits and of course you don't need lots of soldiers"
    },
    {
      "link": "/images/shots/l/239129-sid-meier-s-colonization-amiga-screenshot-enemy-nations-will.png",
      "caption": "Enemy nations will send privateers to plunder your ships"
    },
    {
      "link": "/images/shots/l/239130-sid-meier-s-colonization-amiga-screenshot-various-info-menus.png",
      "caption": "Various info menus are available to gauge your progress"
    },
    {
      "link": "/images/shots/l/239131-sid-meier-s-colonization-amiga-screenshot-a-comprehensive.png",
      "caption": "A comprehensive game encyclopaedia is available"
    },
    {
      "link": "/images/shots/l/239132-sid-meier-s-colonization-amiga-screenshot-check-how-your-people.png",
      "caption": "Check how your people are doing in comparison to the competition"
    },
    {
      "link": "/images/shots/l/239133-sid-meier-s-colonization-amiga-screenshot-this-screen-shows.png",
      "caption": "This screen shows the status of the native tribes you have contacted"
    },
    {
      "link": "/images/shots/l/239134-sid-meier-s-colonization-amiga-screenshot-once-you-retire.png",
      "caption": "Once you retire you get your reward..."
    },
    {
      "link": "/images/shots/l/239135-sid-meier-s-colonization-amiga-screenshot-and-a-place-on-the.png",
      "caption": "...and a place on the Hall of Fame"
    },
    {
      "link": "/images/shots/l/239136-sid-meier-s-colonization-amiga-screenshot-if-it-s-all-too.png",
      "caption": "If it's all too much, there is always this option - if you know the code, that is."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/69549-sid-meier-s-colonization-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/69550-sid-meier-s-colonization-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/69551-sid-meier-s-colonization-amiga-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/239877-sid-meier-s-colonization-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/239878-sid-meier-s-colonization-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/239879-sid-meier-s-colonization-amiga-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Amiga"
    }
  ]
}