{
  "name": "Software Tycoon: Der Spielemanager",
  "shortName": "software-tycoon-der-spielemanager",
  "description": "<i>Software Tycoon</i> lets you try your hands on managing a game development company. You start your business in the early nineteen-eighties, with a certain amount of money to invest. You have to handle all aspects of the business. This includes designing game concepts, hiring employees for the different aspects of game development, assigning tasks of a current project to them, packaging and production of a finished game plus marketing and sales. Along with that you can grant money to research efforts that will enhance the base technology of the different development areas (like moving from 4-color graphics to 256-color graphics). Also, research will all you to use &quot;new&quot; game genres. Game concepts can also be spiced-up with movie licenses, if you were able to obtain them in an auction-like bidding process.<br><br>Any finished game can be released to the &quot;game shop&quot; from where you can control its sale price and watch statistics on the monthly and all-time top selling games. This also includes those of your competitors. For newly released games of any company you can also read an abstract magazine review, which rates the different aspects of them. If you are able to deliver quality games it will increase your overall reputation.<br><br><i>Software Tycoon</i> offers several scenarios in which you have to achieve a certain goal (like producing a game that gets the &quot;game of the year&quot; award) and a &quot;free-style&quot; mode with no certain goal.",
  "publishedBy": "e.p.i.c. interactive entertainment gmbh",
  "developedBy": "destraX Entertainment Software GbR",
  "released": "2002",
  "alsoFor": "Linux, Macintosh, Windows | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "3rd-person (Other), Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/software-tycoon-der-spielemanager",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "e.p.i.c. interactive entertainment gmbh",
          "developer": "destraX Entertainment Software GbR",
          "ported": "",
          "country": " Germany",
          "releaseDate": "2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}