{
  "name": "Space Job",
  "shortName": "space-job",
  "description": "In an unique and interesting experiment, German department store giant Karstadt created a game that was advertisement and job recruitment in one box, and used its retail power to push it in the market at mid-price level.<br><br><i>Space Job</i> is in essence a scifi life simulation; a 2350 adolescent strives for the fastest spaceship, the most beautiful girlfriend and the best career, but strictly within the confines of Karstadt's interplanetary empire. Starting as a trainee in one of four department store sections, you earn job reputation through stoic repetition of menial tasks - learning product prices by heart, sorting items in shelves, tidying up the storeroom in a <a href=\"https://www.mobygames.com/search/quick?game=Sobokab\">Sokoban</a>-style crate pushing subgame.<br><br>The quicker you do your daily chores, the more time remains for entertainment and private development - fitness training, gambling, movies, flirting, night school. An energy system balances your daily activities with periods of rest. Show endurance and personal progress, and promotion will unlock the full glory of department store management.<br><br>Despite its advertising character and indecent product placement, <i>Space Job</i> mediates commercialism with lots of tongue-in-cheek humor and light-hearted wordplay.",
  "publishedBy": "Karstadt AG",
  "developedBy": "",
  "released": "1993",
  "alsoFor": "DOS | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/space-job",
  "visual": "",
  "gamePlay": "Casino / gambling",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Karstadt AG",
          "developer": "",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}