{
  "name": "Sraz",
  "shortName": "sraz",
  "description": "Credited as the first ever Croatian computer game, <i>Sraz</i> (freely translated as <i>Clash</i>) involves two to four players answering questions along the tiles of a board. Each tile is assigned to questions of one of the following fields: sports, history, geography, nature, music, general knowledge, art, and science, while some tiles are marked as &quot;random&quot;, meaning a question from any of the other eight fields can appear. When a question is answered correctly, the player's peg moves to that tile. If not, he stays where he is. When five correct answers have been given with an individual peg, the peg ranks up, meaning he can attempt to visit one additional tile for each rank. There are three ranks: serf (default), soldier and knight.<br><br>A peg can enter a tile occupied by another player's peg. If both of two questions are answered correctly, the attacking peg ranks up and the opponent's peg is pushed back to a free adjacent tile and one rank is removed. If he is already a serf, he is removed from the board. However, if the attacking peg answers either question incorrectly, he is stripped of a rank (unless he is already a serf). A player's turn ends after all pegs adjacent to free tiles have moved or after a finished battle (regardless of the outcome).<br><br>The goal of the game is to prove the player's knowledge by advancing enough to eliminate all opponents' pegs and reach all opponents' flags found in the corners of the board. The game has a total pool of 1000 questions.",
  "publishedBy": "32bita d.o.o.",
  "developedBy": "32bita d.o.o.",
  "released": "1993",
  "alsoFor": "DOS | Combined View",
  "genre": "Simulation",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/sraz",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "32bita d.o.o.",
          "developer": "32bita d.o.o.",
          "ported": "",
          "country": " Croatia",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}