{
  "name": "Suspended",
  "shortName": "suspended",
  "description": "On a space settlement named Contra, a human being serves as a regulator for the planet's vital systems: he controls transportation, weather, and manages resources all while being in a deep sleep, through the neural power of his brain. Such a regulator is called Central Mentality. However, after five hundred years of stasis, the current Central Mentality suddenly awakens, greatly troubled by reports of computer malfunctioning and resulting problems in weather condition, food production, and transport. He must now act, and act quickly: the crew members assumed that he has gone insane, and are coming to disconnect his mind. But what can he do if his state of suspended animation prevents him from moving?<br><br><i>Suspended</i> is a text adventure game with a twist: instead of navigating the protagonist, the player indirectly controls six robots that do his bidding, exploring the environment and interacting with it. Each robot has different functions and has its own way of seeing reality and reacting to events around it. Iris is the only robot that can see and therefore visually describe locations and objects; Whiz can provide technical information obtained from computers; the sonar-powered Waldo is good at holding items; Auda is an expert in sounds; the cryptically speaking Poet senses the flow of electric currents; finally, Sensa can detect magnetic and photon emissions. The player advances in the game by using the different abilities of the robots and solving puzzles.",
  "publishedBy": "Infocom, Inc.",
  "developedBy": "Infocom, Inc.",
  "released": "1986",
  "alsoFor": "Amstrad CPC, Amstrad PCW, Apple II, Atari 8-bit, Atari ST, Commodore 16, Plus/4, Commodore 64, CP/M, DOS, Macintosh, PC Booter, Tatung Einstein, TI-99/4A, TRS-80 | Combined View",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/suspended",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Infocom, Inc.",
          "developer": "Infocom, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/247195-suspended-amiga-screenshot-opening-screen.png",
      "caption": "Opening screen"
    }
  ],
  "cover": []
}