{
  "name": "Swamp Defense 2",
  "shortName": "swamp-defense-2",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/swamp-defense-2/adblurbs\">Ad Blurbs</a>)</h3>Swamp Defense 2 is a classic tower defense game with unique weapons and \nmonsters as enemies for any beginner or defensive specialists.<br><br><br><br><br><br>Fight countless enemies with a huge selection of gun turrets (in the \nform of comic heroes) and additional helpers (mines, air support, block \nwall) on more than 60 maps. Earn coins to obtain improvements in the \nintegrated shop system and to buy new towers.<br><br><br><br><br><br>History:<br><br>\nIn a once very peaceful village, a strange professor tried to build a \nmachine (Arcade Klonomat) that was intended to clone cows and increase \nmilk production. Already in the first tests, he found out that cows \ncould not be cloned due to the high protein content of the milk. In \nshort, the professor secretly sank the Arcade Klonomat in a nearby \nswamp. Favored by toxic fumes from the waste stored there from the local \nnuclear power plant, the Arcade Klonomat has been creating terrible \nswamp monsters since that day who wreak havoc in the neighborhood.<br><br><br><br><br><br>Courageous villages fight an almost hopeless fight against the spawn of \nthe swamp without suspecting that the valued professor is to blame for \nthis problem. Instead of trying to find a solution, he built an Arcade \nKlonomat for people and demanded money for its use. Since this is only a \nvery small village, the few residents are forced to clone themselves in \norder to compete against the swamp monsters as an army.<br><br><br><br><br><br>Get rid of the evil breed and fight against the swamp attack of the \nmonsters!<br><br><br><br><br><br><br><br>\nTD features:<br><br>\n- Shop system for buying and improving towers and for purchasing special \nweapons<br><br>\n- 9 defense towers, capable of improvement (2 improvements each within a \nbattle)<br><br>\n- Support towers, special attacks and elements that can be placed along \nthe path<br><br>\n- Unique opponents - 54 unlockable maps + 9 bonus maps<br><br>\n- Tower control (control of direction and aim of a tower)<br><br>\n- Power-up for each tower: damage, rate of fire, range<br><br>\n- can be placed along the path: mine, adhesive cream fence, block wall<br><br>\n- Supporters: fire power expansion, range expansion<br><br>\n- Global help: area bomb, atomic bomb, air support",
  "publishedBy": "EntwicklerX",
  "developedBy": "EntwicklerX",
  "released": "Mar 07, 2015",
  "alsoFor": "Android, iPad, iPhone, Nintendo Switch, Windows Phone | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/swamp-defense-2",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Tower defense",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "EntwicklerX",
          "developer": "EntwicklerX",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Mar 07, 2015",
          "ean13": "",
          "comments": "Amiboing release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}