{
  "name": "Talespin",
  "shortName": "talespin",
  "description": "<i>Talespin</i> is an adventure game creation system made by <a href=\"https://www.mobygames.com/search/quick?developer=Mark+Heaton\">Mark Heaton</a> and his family (wife and their five children), which allows you to create interactive graphic- and text-oriented adventure games, demos, books, tutorials, or whatever application you can think of. It offers graphics, 100 development commands, mouse control, no copy protection, hard drive support, and <i>Telltale</i>, a run-only module that allows users without <i>Talespin</i> to see your work.<br><br><i>Talespin</i> also includes two sample adventure games: <i>The Grail</i> made by 19-year-old <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,362140/\">Rudyard Heaton</a> and <i>The Wolf</i> made by another artist<br><br>The design idea that drives <i>Talespin</i> is a &quot;page&quot; built from drawings, text, and sound. Conditions and variables control the text, graphic, and action/solution possibilities, and all pages are linked to form a complete story sequence. The Chain To Title At Page option lets you connect one story to another, linking new or continuing tales across more than one disk.<br><br>The paint/drawing program offers Pencil, Spray, Mini-Spray, Block, Blob, Line, and Fill functions. The Lens option allows magnification of a screen area for detailed work; Undo removes the most recent drawing action. Although <i>Talesplin</i> can handle 512 colors, the ST can display only 16 at a time (due to a hardware limitation); therefore, all drawings on a page must use the same palette. Pictures can be copied from other stories as well as sounds.<br><br>Variables let you control the flow of text entries and drawings. Variables must be defined (CONVERSATION, for example), set to a level, and given conditions that will determine further text actions or movement to different pages. The proper setting of variables, their values, and their conditions provides for more than one action or solution for a given puzzle or problem.<br><br>All the menu selections are controlled with the mouse: the pointer highlights, the left button selects. Clicking the right button brings up the dvelopment menu. The only oddity about <i>Talespin</i> concerns text. Clicking a character's head brings up a bubble, within which will appear the currently available choices. The mouse pointer is used to highlight either question; the left button selects it; the program will then take the appropriate action.",
  "publishedBy": "MicroDeal Ltd.",
  "developedBy": "",
  "released": "1989",
  "alsoFor": "Atari ST | Combined View",
  "genre": "Adventure, Compilation",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/talespin",
  "visual": "",
  "gamePlay": "Graphic adventure, Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "MicroDeal Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}