{
  "name": "Tales of Gorluth: The Tear Stone Saga",
  "shortName": "tales-of-gorluth-the-tear-stone-saga",
  "description": "<i>Tales of Gorluth: The Tear Stone Saga</i> is an action adventure in old-school retro style. The game sets you in the role of Karn, a young warrior who is on a quest in the land of Gorluth. In the introduction, we see Karn as a child in a classroom, being tought the history of an old war with the Elves. As the game proper starts out, Karn is now a grown-up warrior, returning to his home village after a long time of training in the capital Aasan, finding it in disarray after someone had stolen a valued statue of the village founder, and made off with it - to a nearby crypt. Now the villagers are unhappy and some have left the village to look for a better place to live, since who could stand having a villainous thief so close by?<br><br>So what is Karn to do now, with the thief long gone? Go search the crypt to find the statue, of course. While he tries, but fails to find the statue, someone in the village is kidnapped, and from there the adventure continues to save the villager, uncover the thieves hideout and explore the rest of the Gorluth world. The game is divided into three chapters: Turmoil in Middle Land, The Call of the Wild North, In the Lair of Evil. The story is told as text monologues by various side characters Karn meets, while the action is done by Karn on his own.<br><br>Karn is equipped with shield and sword, and the user interface shows his stats with a life bar and a shield bar, which can be replenished by finding power-up's and items on the ground or in chests. The action consists of walking around the underground or forest maps, using a single button to talk/open/examine/destroy/attack whatever is in front of Karn; it looks like Karn is throwing multiple copies of his sword toward the enemies, vertically, horizontally or diagonally. Some enemies only have close quarter attacks, while others can throw weapons across the screen just like Karn does. There are also quest items to pick up, that will carry the story further.",
  "publishedBy": "AMIworx Software",
  "developedBy": "AMIworx Software",
  "released": "Jul, 2014",
  "alsoFor": "",
  "genre": "Action, Adventure",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/tales-of-gorluth-the-tear-stone-saga",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "AMIworx Software",
          "developer": "AMIworx Software",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jul, 2014",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}