{
  "name": "Tom Clancy's The Cardinal of the Kremlin",
  "shortName": "tom-clancys-the-cardinal-of-the-kremlin",
  "description": "<i>The Cardinal of the Kremlin</i> is a global management simulation.<br><br>It is the time of the Cold War. An American ground reconnaissance satellite discovers a strange structure near the northern border to Afghanistan. It is identified as project &quot;Bright Star&quot; - the Soviet laser ICBM defense system, capable of destroying satellites and airplanes with a beam of energy. At the same time, the USA is busy developing their own SDI project, code name &quot;Tea Clipper&quot;. And as the race for the deployment of a space-based laser defense system begins, KGB and CIA agents swarm out to infiltrate the laboratories. Among them: The United States' top spy in Moscow, the Cardinal of the Kremlin.<br><br>Based on the popular novel of the same name by US author Tom Clancy, <i>The Cardinal of the Kremlin</i> puts you in the position of US project leader. Your task is to build, test and deploy a network of laser defense satellites before the Russians manage to do so. In this time of crisis, however, all your actions are overshadowed by the threat of espionage and treachery. The scientists that you hire may be geniuses, but are they trustworthy? The more technology tests you schedule, the easier it is for Russian spies to steal your knowledge. If you tighten up security on the other hand, the overprotection will throttle research efficiency. As you race against time and an invisible enemy, the word &quot;paranoia&quot; gains a whole new quality.<br><br>Luckily, the counter-intelligence department is at your command, too. CIA agents in Moscow not only supply you with information on the Soviet project's progress, but also on KGB operations in the USA. How accurate the reports are, however, is for you to judge. You must also supply the Afghan warlords Archer with weapons and equipment, as only he can launch a desperate attack on the Bright Star base that will hopefully throw back the Soviet project for months. You conduct battles in a simple top-down action sequence.",
  "publishedBy": "Accolade, Inc.",
  "developedBy": "Capstone Software",
  "released": "1991",
  "alsoFor": "DOS | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/tom-clancys-the-cardinal-of-the-kremlin",
  "visual": "",
  "gamePlay": "Managerial / business simulation, Real-time strategy",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Accolade, Inc.",
          "developer": "Capstone Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}