{
  "name": "Ultima IV: Quest of the Avatar",
  "shortName": "ultima-iv-quest-of-the-avatar",
  "description": "Following the defeat of the evil triad in the previous three <i>Ultima</i> games, the world of Sosaria changed beyond recognition: continents rose and sank, and new cities were built, heralding the advent of a different civilization. Unified by the reign of the benevolent monarch Lord British, the new world was renamed Britannia. Lord British wished to base people's well-being on the ethical principles of Truth, Love, and Courage, proclaiming the Eight Virtues (Honesty, Compassion, Valor, Justice, Sacrifice, Honor, Spirituality, and Humility) as the ideal everyone should strive for. The person who could accomplish full understanding and realization of these virtues would serve as a spiritual leader and a moral example for the inhabitants of Britannia; he alone would be able to obtain holy artifacts, descend into the Stygian Abyss, and access the Codex of Ultimate Wisdom. This person is the Avatar.<br><br>The fourth game in the <i>Ultima</i> series features an improved game engine, with color graphics and enhanced character interaction: the player can have conversations with non-playable characters by typing names of various topics. However, the main difference between <i>Ultima IV</i> and its predecessors in the series (as well as other role-playing games) lies in the game's objectives and the ways to fulfill them. <br><br>Instead of building up a character by any means possible in order to face a villain in the end of the game, in <i>Ultima IV</i> the player is trying to become the Avatar, a role model for people. This means upholding the Eight Virtues, basically trying to become a better person. Making morally conscious decisions and helping other people is not done expecting a material reward, but because it is the actual goal of the game and the main focus of its gameplay. The game frowns on behavior typical of most other RPGs, such as backstabbing fleeing enemies or picking up everything that isn't nailed down even if it does not belong to the protagonist. This different approach established the game's reputation as the first &quot;true&quot; <i>Ultima</i>, influencing the design philosophy of later installments and the overall spirit of the series.<br><br>Character creation is done by choosing responses to morally ambiguous questions. Each of the Eight Virtues corresponds to a character class; by determining the player's personal priorities in the virtues, the game assigns a class and a starting location for the Avatar. After emerging in Britannia, the player is free to explore it in various ways (on foot, moongate teleportation, on horseback, by ship, etc.). Certain items must be collected in any order to enter the Stygian Abyss and complete the game. The Avatar also has to reach the highest level in all virtues. This is achieved by various means: donating blood increases Sacrifice, not fleeing from combat increases Valor, etc. The process, however, is not irreversible: should the Avatar overpay a blind seller, he gains Compassion points; should he, on the other hand, cheat the seller by underpaying, his level in several virtues would decrease.<br><br>These unorthodox features of the game co-exist with plenty of traditional RPG elements, such as dungeons to explore and hostile monsters to kill. Enemies are encountered on the world map as well as in dungeons; combat takes place on separate top-down screens, allowing player-controlled and enemy parties freely move on them. Characters accumulate experience points and level up, gaining higher amount of hit points and access to stronger magic spells. Like in the previous installments of the series, world map, town exploration and combat are presented from a top-down view, while the dungeons are pseudo-3D and are explored from first-person perspective.<br><br><i>Ultima IV</i> also introduces several new gameplay features to the series and role-playing games in general. A number of initially non-playable characters living in various areas of the game world are able to to join the party and fight alongside the hero, replacing traditional player-generated characters or mercenaries and adventurers available only in special locations. Additional new elements include buying and combining reagents in order to cast spells, puzzle rooms in dungeons, and others.<br><br>The FM Towns version, while identical to the others in gameplay, introduces upgraded graphics similar to those used in <a href=\"https://www.mobygames.com/game/ultima-v-warriors-of-destiny\">next</a> installment of the series.",
  "publishedBy": "ORIGIN Systems, Inc.",
  "developedBy": "ORIGIN Systems, Inc.",
  "released": "1988",
  "alsoFor": "Apple II, Atari 8-bit, Atari ST, Commodore 64, DOS, FM-7, FM Towns, iPad, iPhone, Macintosh, MSX, NES, PC-88, PC-98, Sharp X1, Sharp X68000, SEGA Master System, Windows | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/ultima-iv-quest-of-the-avatar",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "ORIGIN Systems, Inc.",
          "developer": "ORIGIN Systems, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "MicroProse Software Limited",
          "developer": "ORIGIN Systems, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "5 015661 042042",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/512561-ultima-iv-quest-of-the-avatar-amiga-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/512566-ultima-iv-quest-of-the-avatar-amiga-screenshot-making-a-player.png",
      "caption": "Making a player disk"
    },
    {
      "link": "/images/shots/l/512567-ultima-iv-quest-of-the-avatar-amiga-screenshot-starting-a.png",
      "caption": "Starting a new game"
    },
    {
      "link": "/images/shots/l/512568-ultima-iv-quest-of-the-avatar-amiga-screenshot-a-vision-of.png",
      "caption": "A vision of a moongate"
    },
    {
      "link": "/images/shots/l/512569-ultima-iv-quest-of-the-avatar-amiga-screenshot-you-spot-a.png",
      "caption": "You spot a renaissance fair"
    },
    {
      "link": "/images/shots/l/512570-ultima-iv-quest-of-the-avatar-amiga-screenshot-the-mysterious.png",
      "caption": "The mysterious ankh gets you free admission"
    },
    {
      "link": "/images/shots/l/512571-ultima-iv-quest-of-the-avatar-amiga-screenshot-could-your.png",
      "caption": "Could your fate be decided in that gypsy wagon?"
    },
    {
      "link": "/images/shots/l/512572-ultima-iv-quest-of-the-avatar-amiga-screenshot-she-wears-an.png",
      "caption": "She wears an ankh as well, what could that mean?"
    },
    {
      "link": "/images/shots/l/512573-ultima-iv-quest-of-the-avatar-amiga-screenshot-these-aren.png",
      "caption": "These aren't your usual tarot cards."
    },
    {
      "link": "/images/shots/l/512574-ultima-iv-quest-of-the-avatar-amiga-screenshot-moral-decisions.png",
      "caption": "Moral decisions must be made and how you answer the questions determines what class your character will be in the game."
    },
    {
      "link": "/images/shots/l/512551-ultima-iv-quest-of-the-avatar-amiga-screenshot-i-think-i-ll.png",
      "caption": "I think I'll choose Spirituality over Sacrifice."
    },
    {
      "link": "/images/shots/l/512552-ultima-iv-quest-of-the-avatar-amiga-screenshot-where-you-start.png",
      "caption": "Where you start in the game is determined by your choices. Spirituality is the virtue of the Ranger class, so I appear by the Ranger town of Skara Brae."
    },
    {
      "link": "/images/shots/l/512553-ultima-iv-quest-of-the-avatar-amiga-screenshot-exploring-skara.png",
      "caption": "Exploring Skara Brae. Provisions are important to purchase as you constantly eat them during your travels. Run out and you will starve to death."
    },
    {
      "link": "/images/shots/l/512554-ultima-iv-quest-of-the-avatar-amiga-screenshot-shamino-is.png",
      "caption": "Shamino is the main NPC ranger. If you start as any other class you can recruit him to your party."
    },
    {
      "link": "/images/shots/l/512555-ultima-iv-quest-of-the-avatar-amiga-screenshot-the-only-way.png",
      "caption": "The only way off the island without a boat is to wait for a moon gate to appear."
    },
    {
      "link": "/images/shots/l/512556-ultima-iv-quest-of-the-avatar-amiga-screenshot-i-ve-taken.png",
      "caption": "I've taken the moon gate and am now lost somewhere in Brittania being chased by skeletons."
    },
    {
      "link": "/images/shots/l/512557-ultima-iv-quest-of-the-avatar-amiga-screenshot-combat-takes.png",
      "caption": "Combat takes place on a separate screen where you make tactical decisions. "
    },
    {
      "link": "/images/shots/l/512558-ultima-iv-quest-of-the-avatar-amiga-screenshot-i-defeated.png",
      "caption": "I defeated the skeleton and he dropped this chest for me to loot."
    },
    {
      "link": "/images/shots/l/512559-ultima-iv-quest-of-the-avatar-amiga-screenshot-traveling-through.png",
      "caption": "Traveling through a mountain pass. Rough terrain such as hills and forests take slow your movement."
    },
    {
      "link": "/images/shots/l/512560-ultima-iv-quest-of-the-avatar-amiga-screenshot-snakes-are.png",
      "caption": "Snakes are bad news for a low level character. I've been poisoned and continue losing health even after the snake is dead."
    },
    {
      "link": "/images/shots/l/512562-ultima-iv-quest-of-the-avatar-amiga-screenshot-i-succumbed.png",
      "caption": "I succumbed to the poison and died, but thankfully Lord British has brought me back from the void."
    },
    {
      "link": "/images/shots/l/512563-ultima-iv-quest-of-the-avatar-amiga-screenshot-the-prison.png",
      "caption": "The prison in Lord British's castle has monsters and miscreants behind bars."
    },
    {
      "link": "/images/shots/l/512564-ultima-iv-quest-of-the-avatar-amiga-screenshot-just-outside.png",
      "caption": "Just outside the castle of Lord British. You can see the nearby town of Britain to the Northwest."
    },
    {
      "link": "/images/shots/l/512565-ultima-iv-quest-of-the-avatar-amiga-screenshot-iolo-the-jester.png",
      "caption": "Iolo the jester joins my party. One NPC of every class aside from your own can join your party."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/274170-ultima-iv-quest-of-the-avatar-amiga-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/274171-ultima-iv-quest-of-the-avatar-amiga-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Amiga"
    },
    {
      "link": "/images/covers/l/274172-ultima-iv-quest-of-the-avatar-amiga-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Amiga"
    }
  ]
}