{
  "name": "Wembley Rugby League",
  "shortName": "wembley-rugby-league",
  "description": "Having previously recreated the more internationally famed rugby union with <a href=\"https://www.mobygames.com/game/world-class-rugby\">World Class Rugby</a>, Audiogenic switched their attention to Rugby League, using the same game engine.<br><br>The main differences in the league game is that a team has to give up possession after being tackled six times – which often leads to some bold moves on the 5th tackle, especially as if you retrieve the ball an opposition player, you get a fresh set of six tackles – and that after a tackle, play restarts by flicking the ball back to another player (inexplicably knows as the ‘Play-the-Ball’), while the entire teams (of 13 players, not the 15 in Union) remain on their side of the ball. Instead of line-outs, the ball going out of play at the side results in a scrum, as does a knock-on (fumbling attempts to control a pass or recieve a kick) if those are switched on.<br><br>The gameplay is viewed from either a <a href=\"https://www.mobygames.com/search/quick?game=Kick+Off\">Kick Off</a>-style overhead view or a forced-perspective 3D one, with a scanner on screen to show where your team-mates are (this is more important than in football). Passing is pulled off by pressing fire and directing the pass, whereas holding down fire will kick the ball up ahead. Tackling involves aiming at the player, and diving if necessary. Set-piece kicks involve aiming the direction and angle by pressing fire at the right times to stop a crosshair.",
  "publishedBy": "Audiogenic Software Ltd.",
  "developedBy": "Dentons",
  "released": "1994",
  "alsoFor": "DOS | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "Rugby",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/wembley-rugby-league",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Audiogenic Software Ltd.",
          "developer": "Dentons",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}