{
  "name": "Where Time Stood Still",
  "shortName": "where-time-stood-still_",
  "description": "This is an unofficial reverse-engineered version of the Atari ST version of <a href=\"https://www.mobygames.com/game/atari-st/where-time-stood-still\">Where Time Stood Still</a>. It is for the most part a 1:1 conversion, but with a new comic book style intro sequence and improved music.<br><br>While flying three members of the same family, your planes crash-lands in an area where it soon becomes clear that time has stood still - dinosaurs still roam the area, and the humans are primitive and carnivorous. Your task is to guide them to safety through the complex isometrically viewed world (using the same basic game engine as <a href=\"https://www.mobygames.com/search/quick?company=Dentons\">Denton Designs</a>' <a href=\"https://www.mobygames.com/search/quick?game=the+Great+Escape\">Great Escape</a> license).<br><br>Hazards to be faced include the aforementioned dinosaurs and cavemen, as well as sea monsters, precarious mountainous ledges and dilapidated bridges. Objects including weapons and first aid kits can be collected. Each character has his own distinct behaviour - one becomes hungry easily, while another is only really competent while his fiancé survives. Although the ultimate aim is to save all four characters, you can continue while at least one is alive.",
  "publishedBy": "",
  "developedBy": "Denton Designs",
  "released": "Jul 29, 2014",
  "alsoFor": "Amiga CD32 | Combined View",
  "genre": "Action, Adventure",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/where-time-stood-still_",
  "visual": "Isometric",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/850117-where-time-stood-still-amiga-screenshot-title-screen.png",
      "caption": "Title Screen"
    }
  ],
  "cover": []
}