{
  "name": "Wizkid: The Story of Wizball II",
  "shortName": "wizkid-the-story-of-wizball-ii",
  "description": "The Wiz and his cat Nifta have successfully restored colors to the world. Both got married (though most probably not to each other) and begot children: the Wiz had a son, Wizkid, and Nifta had eight kittens. Their peaceful life ended when the evil mouse magician Zark kidnapped the Wiz, Nifta, and all the kittens, imprisoning them in different parts of the world. Wizkid must venture into unknown realms and rescue his father together with the feline family.<br><br><i>Wizkid: The Story of Wizball II</i> is a sequel to <a href=\"https://www.mobygames.com/game/c64/wizball\">Wizball</a>. This game deviates from the original in many ways. The screen does not scroll and Wizkid does not bounce around like his predecessor. The player has full control over Wizkid and his movements. He has to be moved around the screen, bashing into bricks (which come in different shapes and sizes) so that the flying bricks collide with the onscreen enemies. Once the screen is cleared of all the enemies, coins are dropped, which must be picked up quickly before they disappear and the player proceeds to the next screen. <br><br>Killing multiple enemies with a single brick releases a bubble that will sometimes offer a nose (to juggle bricks) or teeth (letting Wizkid grab hold of bricks), but more often they turn into colored notes. These must be combined to form tunes, as patterned at the top of the screen. Once the player completes a tune, you are taken to a shop where you can buy items needed to progress to the next stage.<br><br>If Wizkid has bashed all the bricks on a screen, but failed to remove all the enemies, the player may be taken to a puzzle screen, where he must solve Crossword 2091 for bonus money. The player has a number of words to put on the screen, but they must all overlap each other and use each other's letters. Each move has a time limit. If the player fails to complete the puzzle he is taken back to the level.<br><br>When exiting a shop the player can choose either to exit as a head or a body, which is Wizkid with arms and legs. Assembles in this way, Wizkid is now limited by gravity and can jump around and use onscreen objects such as ringing bells or cranking wells. He may also come across interactive elements which he will need to use with items in his pockets. Most such levels require the player to solve inventory-based puzzles.",
  "publishedBy": "Ocean Software Ltd.",
  "developedBy": "Sensible Software",
  "released": "1992",
  "alsoFor": "Antstream, Atari ST, DOS | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga/wizkid-the-story-of-wizball-ii",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amiga",
      "releases": [
        {
          "publisher": "Ocean Software Ltd.",
          "developer": "Sensible Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Hit Squad, The",
          "developer": "Sensible Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Dec, 1993",
          "ean13": "",
          "comments": "Budget re-release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/220007-wizkid-the-story-of-wizball-ii-amiga-screenshot-opening-animation.png",
      "caption": "Opening animation"
    },
    {
      "link": "/images/shots/l/220521-wizkid-the-story-of-wizball-ii-amiga-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/220522-wizkid-the-story-of-wizball-ii-amiga-screenshot-boot-camp.png",
      "caption": "Boot camp - the training level"
    },
    {
      "link": "/images/shots/l/220525-wizkid-the-story-of-wizball-ii-amiga-screenshot-map-screen.png",
      "caption": "Map screen"
    },
    {
      "link": "/images/shots/l/220526-wizkid-the-story-of-wizball-ii-amiga-screenshot-ying-yang.png",
      "caption": "Ying Yang bricks"
    },
    {
      "link": "/images/shots/l/220527-wizkid-the-story-of-wizball-ii-amiga-screenshot-jewels-bricks.png",
      "caption": "Jewels bricks"
    }
  ],
  "cover": []
}