{
  "name": "A5",
  "manufacturer": "Olivetti",
  "type": "Professional Computer",
  "origin": "Italy",
  "year": "1974",
  "production": "Unknown",
  "language": "Unknown",
  "keyboard": "QWERTY mechanical keyboard with numeric keypad",
  "cpu": "Mostek 6048 ?",
  "speed": "Unknown",
  "coprocessor": "Unknown",
  "ram": "1 KB",
  "vram": "",
  "rom": "Unknown",
  "text": "Text output via paper sheets",
  "graphics": "None",
  "colors": "2 printing colors ?",
  "sound": "None",
  "size": "Unknown",
  "ports": "Unknown",
  "power": "Built-in power supply",
  "price": "Unknown",
  "description": "\nOlivetti introduced a mainframe about 1960 which was called ELEA, then in 1965 the Programma 101 - which was probably the world\u0027s first real desktop computer. Then a little later they introduced the Audiotronic range of \u0026quot;office computers\u0026quot;. The first was the A770, which was replaced by the A7. The A5 was the desktop version.\n\nThe Olivetti Audit 5 or A5 was largely an electro mechanical computer. It printed via a golf ball typewritter mechanism at the astonishing speed of 16 character per second (CPS).\n\nIt was a machine that was designed to meet a use that was quickly dying out at the time, visual record computers, that is electronic ledger machines. These were fast being replaced by screen based computers.\n\nAccording to a former australian computer reseller (Geoff Greig), the A5 and A6 models had problems were they would catch on fire!\n\nHe also recalls: \u0026quot;Some of the customers I had would start printing a report at close of business one day and come in the next morning to find it still printing. However the print mechanism being so mechanical often such a big print run would result in a breakdown. I tink Olivetti in Australia made more money out of Maintaince agreements than selling computers.\nAnd the sound was liike a machine gun. Not the sort of thing you would was to having printing beside you. Some people even made giant sound boxes to put them it to try and reduce the noise.\nThe 2030 had a dot matrix printer that printed at the outstandind 100 cps and was much more reliable.\u0026quot;\n\nThe BCS 2030 (BCS stands for Business Computer System) was a vast improvement on the the machine the Olivetti A5. The BCS 2030 Floppy disk version replaced the A6. The A6 being an A5 with a dual 128K floppy drives and still the 16 CPS printer.\n\nHere is what www.storiaolivetti.it says about the A5:\n\u0026quot;The Audit A5, introduced in 1974, is an accounting system with the characteristics of a real computer. It has a central unit (Micro 8, designed Olivetti), RAM, hard disk and removable disks, magnetic cards, adjustable, built-in printer, the programming language BASIC owner (LIMO, Interactive machine language Olivetti). As the \u0026quot;elder brother\u0026quot; A7, presented simultaneously, the system A5 is designed with the logic of modular and can be expanded according to user needs, such as the A7 has no video, but unlike \u0027 A7, which looks like a desk job, the A5 is a desktop machine. The design is reminiscent of the typewriter, also to be more easily accepted by the environment secretary. E \u0027marketed with an extensive library of programs for various applications in the accounting and administration.\u0026quot;\n\n______\n\nContributors: Daniel Moffat, Geoff Greig.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;THE OLIVETTI A5\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Daniel Moffat for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/olivetti_a5_1m.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;INSIDE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Daniel Moffat for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/olivetti_a5_inside.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PRINTING HEAD\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The printing head is sized like a golf ball.\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Daniel Moffat for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/olivetti_a5_inside_2.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ACCOUNTING SYSTEMS A5 AND A7\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Systems A5 and A7, presented in 1974, contributing significantly to shifting the focus towards the supply Olivetti computer. These machines have the characteristics of a real computer, and hence a discontinuity from the previous accounting and billing are mainly based on mechanical technology. The new machines meet the favor of the European market and in 1975 the Swiss magazine Information, which specializes in computer and office products, a dedicated their cover.\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Picture courtesy of \u0026lt;a href\u003d\u0026quot;http://www.storiaolivetti.it\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;http://www.storiaolivetti.it\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/olivetti_a5a7_pub1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [
    "http://www.storiaolivetti.it/fotogallery.asp?idPercorso\u003d616\u0026amp;idOrd\u003d17#viewfotogallery"
  ],
  "image": "http://www.old-computers.com/museum/photos/olivetti_a5_1s.jpg",
  "builtInGames": "Unknown",
  "controllers": "",
  "media": "Paper magnetic card with 256 bytes storage",
  "numGames": "",
  "peripherals": "Unknown",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}