{
  "name": "PLUS 4 - C232/264/364",
  "manufacturer": "Commodore",
  "type": "Home Computer",
  "origin": "U.S.A.",
  "year": "1984",
  "production": "",
  "language": "Commodore BASIC 3.5. Built-in machine code monitor (12 commands)",
  "keyboard": "Full stroke 67 keys with 4 function keys and 4 cursor keys",
  "cpu": "7501",
  "speed": "0.89 MHz or 1.76 MHz",
  "coprocessor": "",
  "ram": "64 KB (60 KB free for user, and 48 KB free when used in high resolution)",
  "vram": "",
  "rom": "64 KB",
  "text": "40 chars x 25 lines",
  "graphics": "several modes, maximum : 320 x 200 dots",
  "colors": "121 (15 colours x 8 luminances + black)",
  "sound": "two channels; 4 octaves + white noise",
  "size": "42.3 (W) x 23.9 (D) x 6.7 (H) cm",
  "ports": "Tape, Cardridge, Joystick (2), User port, Composite (CVBS) video port, memory expansion bus port, serial port, power, RF video",
  "power": "",
  "price": "?249",
  "description": "\nAmong the Commodore news from the Summer CES 1984 was the renaming of the C\u003d264 to Plus/4. This renaming came along with a slight change in the built-in software: you could not choose between many different programs anymore, but each Plus/4 was delivered with the 3-plus-1 software.\n\nThe built-in software is not worth the silicon it is etched in: a word processor (only with 40 columns and can manage documents with only 99 lines of 77 columns), a very small spreadsheet (only 17 columns and 50 lines), a poor graph generator program (which can graphically display data from the sheets, but only in text mode) and a small database (999 records with 17 fields each and only 38 characters by field).\nMost of these programs can only be used with a floppy drive. \n\nThe Plus/4 can use some of the peripherals of the C\u003d64 or the VIC-20, like the famous MPS-801 dot-matrix printer and the 1541 Disk Drive run well with it but it can\u0027t use C\u003d64 programs (unfortunately, it cannot use the same joysticks \u0026amp; Datasette as the C\u003d64/VIC-20).\n\nThis machine wasn\u0027t built to be a competitor of the C\u003d64, but it wasn?t meant to replace it either. It has an improved BASIC compared to the C\u003d64?s, this one features graphic and sound instructions and a built-in assembler, but has lost lots of interesting C-64 features like great sound chip (SID: Sound Interface Device) or hardware sprites.\n\nThe Commodore Plus/4 was an error in the Commodore marketing policy and had no success.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PLUS4 BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/commodore_plus4_box_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOX #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/commodore_plus4_box_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;INSIDE PLUS/4\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;An original and nice design, a serious keyboard, a mother board fitted with maximum RAM and ROM capacity (both 64 Kb.), but limited compatibility with the previous models (C64 and Vic 20). The Commodore Plus 4 never had great success, as it was launched too late : some competitor models had more attractive features, and the first 16 bit home computers were about to enter the market. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(1)\u0026lt;/b\u0026gt; Each of the 4 function keys can call two different commands using the Shift key. The user can also define new functions (128 char. maximum). \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(2)\u0026lt;/b\u0026gt; Arrow keys. Original design, but not very practical. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(3)\u0026lt;/b\u0026gt; Power connector. Power is supplied by an external transformer. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(4)\u0026lt;/b\u0026gt; Power switch. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(5)\u0026lt;/b\u0026gt; System reset button. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(6)\u0026lt;/b\u0026gt; 7501 microprocessor, compatible with the 6502 instruction set, but able to manage more than 64 Kb. of memory. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(7)\u0026lt;/b\u0026gt; 8 chips holding 64 Kb RAM, totally available for Basic programs (except in graphic mode). \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(8)\u0026lt;/b\u0026gt; Extension connector used by ROM cartridges and the disk drive unit. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(9)\u0026lt;/b\u0026gt; 64 Kb ROM. Microsoft Basic and built-in software are stored in 3 ROM chips. 2 ROM sockets are left available. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(10)\u0026lt;/b\u0026gt; An imposing specialized circuit (Arithmetic and logic unit) is protected by a metal case to avoid radio interference. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(11)\u0026lt;/b\u0026gt; TV video signal modulator.\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(12)\u0026lt;/b\u0026gt; RGB video output and sound connector. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(13)\u0026lt;/b\u0026gt; 2 joysticks connectors, not compatible with Atari standard. It is undoubtedly this kind of detail which slowed down the sales of the Plus/4. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(14)\u0026lt;/b\u0026gt; Serial user connector. It can manage several peripherals simultaneously. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(15)\u0026lt;/b\u0026gt; Cassette recorder connector, once more specific to the Plus/4. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(16)\u0026lt;/b\u0026gt; Serial connector used by some Commodore peripherals. \u0026lt;br\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/Commodore_Plus4_Inside_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;C-232 PROTOTYPE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Commodore had planned for a new line-up of computers based on their new TED processor. They were comprised of the Commdodore 232 at the low end with 32k on board, the 264 in the mid-range with 64k and the choice between four different preinstalled software modules, and finally the V364 at the top of the product line.\u0026lt;br\u0026gt; These products were touted in numerous pre-release press articles and advertising circulars. But, typical of Commodore, just prior to beginning production, the entire line was canned, and the 264 was retooled into the Plus/4. It was the only model with the TED to hit the store shelves.  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/Commodore_232_System_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;C-264 PROTOTYPE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The following information comes from Death Adder.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; With the first Commodore 264 prototype inofficially presented on the Winter Consumer Electronics Show (CES) in January (?) 1984, the developers had obviously not yet agreed about the keyboard layout; some keys are unlabelled, the right shift key is missing, instead it has a key which seems to be meant as a line feed key. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; It was planned that when buying a C264, you could choose between these programs: \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; 3 plus 1 (word processor, data base, spread sheet, windowing)\u0026lt;br\u0026gt; Superscript (professional word processor)\u0026lt;br\u0026gt; Magic Desk (word processor, data base, spread sheet, calculator)\u0026lt;br\u0026gt; Logo\u0026lt;br\u0026gt; Pilot\u0026lt;br\u0026gt; Easycalc 264 (spread sheet)\u0026lt;br\u0026gt; COM 264\u0026lt;br\u0026gt; Financial Advisor\u0026lt;br\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The C264 should then be delivered with the selected program built in. The remaining programs could only be used with cartridges for the expansion port. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The official presentation of the C264 series took place on the Hannover fair in 1984. Luckily, the developers didn\u0027t eliminate the right shift key in the final keyboard layout. The formerly unlabelled keys bear a label now: the key that used to be the \u0027\u0026lt;-\u0027 (left arrow) key on the C64 and the VC20 says \u0027Esc\u0027, the key between \u0027@\u0027 and \u0027*\u0027 bears the English pound sign, and the key that was labelled \u0027SHIFT LOCK\u0027 on all 8-bit computers Commodore ever produced now says - guess what - \u0027SHIFT LOCK\u0027 :-) (must have been a hard decision between SHIFT and CAPS lock). \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/commodore_264.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;V-364 PROTOTYPE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This prototype was a C264 with a bigger keyboard (86 keys including a numeric keypad) and with a built-in speech synthesizer with a vocabulary of 261 words (which could be expanded by either diskettes or modules). Commodore dropped this model and decided to sell a separate speech module (Magic Voice) for the C64. \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/Commodore_364_System_s1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;LAST +4 SALES, APR. 1986\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_Plus4_Advert_s1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [
    {
      "platform": "MS DOS emulator",
      "name": "Minus4 - Plus4 Emulator for DOS \u0026amp; Windows",
      "link": "http://minus4.plus4.net/"
    },
    {
      "platform": "Windows emulator",
      "name": "WinEMU",
      "link": "http://winemu.emuunlim.com/",
      "description": "C16 / Plus4 emulator for Windows \u0026amp; DOS, developed by Zsolt Prievara"
    },
    {
      "platform": "Windows emulator",
      "name": "YAPE",
      "link": "http://YAPE.PLUS4.NET",
      "description": "PLUS/4 Emulator for Windows"
    },
    {
      "platform": "Amiga OS emulator",
      "name": "FLAMINGO",
      "link": "http://www.amiga.hu/amigos/rachy/projects.html",
      "description": "Plus/4 emulator for amiga, developed by Rachy"
    },
    {
      "platform": "Multiplatform emulator",
      "name": "VICE",
      "link": "http://www.viceteam.org/",
      "description": "VICE emulates a bunch of 8-bit Commodore computers including the Plus 4"
    }
  ],
  "link": [
    "computer.asp?st\u003d1\u0026amp;c\u003d1125",
    "computer.asp?st\u003d1\u0026amp;c\u003d97",
    "http://plus4.emucamp.com/",
    "http://YAPE.PLUS4.NET",
    "http://www.commodore16.com/",
    "news:comp.binaries.cbm",
    "news:comp.binaries.cbm",
    "news:comp.sys.cbm"
  ],
  "image": "http://www.old-computers.com/museum/photos/commodore_plus4.jpg",
  "builtInGames": "Commodore BASIC 3.5. Built-in machine code monitor (12 commands)",
  "controllers": "",
  "media": "Cassette unit. Provision for 170 KB 5.25\u0027\u0027 floppy disc unit",
  "numGames": "",
  "peripherals": "",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}