{
  "name": "BIT 60",
  "manufacturer": "Bit Corporation",
  "type": "Home Computer",
  "origin": "Korea",
  "year": "1983",
  "production": "",
  "language": "Basic",
  "keyboard": "QWERTY, full-stroke keyboard (47 keys) or chicklet keyboard (46 keys) depending models",
  "cpu": "MOS 6502",
  "speed": "1 Mhz",
  "coprocessor": "",
  "ram": "2 kb (up to 32 kb)",
  "vram": "",
  "rom": "8 kb",
  "text": "26 x 24",
  "graphics": "196 x 156",
  "colors": "128 colors",
  "sound": "2 channels",
  "size": "Unknown",
  "ports": "Cartridge slot, TV aerial (HF modulator) video output, 2 x joystick ports (Atari standard), cassette interface",
  "power": "External PSU",
  "price": "Unknown",
  "description": "\nThis obscure computer is said to be compatible with the Atari VCS 2600 game system. This feature is typical of eastern countries such has Korea or Honk-Kong where copyrights were not very respected. The Laser 2001 for example is also known to accept Colecovision and Atari cartridges through a special extension. The Hanimex Pencil II was also supposed to accept Colecovision cartridges. And indeed, the cartridge slot of the BIT-60 seems very similar to the VCS-2600 one !\n\nIt seems that there has been at least two different version of the BIT-60 (see more pictures section). The one picture here with a chicklet keyboard, two joystick ports on the front side and two buttons on the left of the cartridge slot (start \u0026amp; select ?), and a later model with a different case, a mechanical keyboard and no more joystick ports on the front...\n\nThe BIT-60 and its brother the BIT-90 had no success and disappeared quickly surely because of copyright issues.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MECHANICAL KEYBOARD MODEL\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This model is different from the early one, as it has a mechanical keyboard. The two joystick connectors cannot be seen at the front anymore...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/bit-corp_bit-60_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;GERMAN ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is a German advertisement for the BIT-60 and BIT-90 models. Atari VCS-2600 cartridges are scattered in front of the BIT-60, to show that the BIT-60 is really compatible with the VCS-2600 ! But strangely enough, there is no picture displayed on the TV. Were these models really  working ? ;-)\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/bit-corp_bit60-90_ad_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/bit-corp_bit60_chicklet.jpg",
  "builtInGames": "Basic",
  "controllers": "",
  "media": "",
  "numGames": "",
  "peripherals": "Memory expansion",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}