{
  "name": "Orchid?e",
  "manufacturer": "SYMAG Informatique",
  "type": "Professional Computer",
  "origin": "France",
  "year": "September 1983",
  "production": "",
  "language": "",
  "keyboard": "Full-stroke keyboard with numeric keypad and 10 function keys",
  "cpu": "Z80 (4 Mhz) or Intel 80186 (8 Mhz)",
  "speed": "",
  "coprocessor": "",
  "ram": "256 Kb, expandable to 1Mb",
  "vram": "",
  "rom": "",
  "text": "25 lines x 80 char.",
  "graphics": "768 x 576 pixels",
  "colors": "8 (optional)",
  "sound": "",
  "size": "",
  "ports": "1 x Serial RS232, 1 x Parallel Centronics, IEEE488, SCSI",
  "power": "Built-in PSU",
  "price": "from $6252  to $8858 depending models (France, september 1983)",
  "description": "\nThe last computer made by Symag presents an original concept : using the same central unit, user can choose between several processors. Back then, the Symag chairman said : \u0026quot;No other computer in the world combines as much innovative features\u0026quot;. And indeed, on the paper, the Orchydee was very promising, being, for example, power-cut proof.\n\nThe basic model is provided with either an 8 bits Z80 microprocessor, or a 16 bits 80186, thus allowing the system to be used with 8 bits and 16 bits O.S. (CP/M, CP/M86 or MS-DOS). Each microprocessor is delivered in a cartridge to be inserted in front of the computer. Smaller ROM software cartridges can also be inserted into this bigger cartridge. The 80186 version of the Orchidee is partially compatible with PC standard.\n\nThe Orchyd?e was first presented at the SICOB show (Paris, France) in october 83, but in june 84 not a single computer has been sold ! Indeed in may 84, the Symag loss are equal to 4 millions FF, for a turnover of 25 millions FF instead of the 38 millions FF planned. This brutal change is officialy due to a subcontractor failing, which prevented the Orchyd?e from being produced. The failure concerns the main case of the Orchyd?e. Christian Coeur, the Sales Manager, says : \u0026quot;We have been betrayed by one of our suppliers who couldn\u0027t fulfill our quality requests. It was then necessary to find another subcontractor to replace the first one\u0026quot;.\n\nAnother official explanation was : \u0026quot;Before the SICOB 83 we had 4 persons working nights and days on the Orchyd?e and thanks to them we could present the project on time at the Show. But after that we employed 15 persons who were finishing work at 5.00 PM (!), and the four guys of the beginning were on the road to promote the product. Realize the we had 50 millions francs worth of placed orders, and we didn\u0027t fulfilled any !\u0026quot;\n\nBut unofficialy, the true explanation is that all the innovative features announced could not be totally realised in laboratories :\n- first, only one ROM cartridge out of the many promised was effetively produced, and it was only used to start the MOTUS wordprocessor, which was partially stored on a floppy disk (!).\n- Symag encountered many technical problems conceiving the promised high-resolution monochrom monitor, and the solution was only found after the company went bankrupt.\n- Symag had also quite a lot of difficulties to implement the 80186 cpu working at 8 Mhz, and the first Orchyd?es equiped with this CPU were only delivered after the bankruptcy.\n- the 13Mb hard-disk : Symag chosed a common controler (hard-disk \u0026amp; floppies) which creates 8 sectors per track on the floppies, whereas the controler implemented on the models without the hard-disk, creates 9 sectors per track. The result is that floppies created on one model couldn\u0027t be read by an other ! Symag had to send technicians to modify the ROMs of each Orchyd?es sold (not that many you will tell me)...\n- the power-cut security feature : Symag promised a way to save the work in progress in case of power cut. In fact only 256 bytes could be saved, which was of course not enough to save the user work in progress.\n\nThus, whereas the production should have started from january 84, it is still not operative in june 84. The objective of 1000 Orchyd?es produced in 1984 is logicaly reduced to 500, and investors start to be more than upset.\n\nMoreover, the original concept of the Orchyd?e will not be enough to insure commercial success compared to cheaper PC \u0026amp; compatible computers, and the Symag company, based in Grenoble (France), will collapse a few months later. Indeed in June 1984 Symag goes bankrupt and while the company is restructured in a 3 companies holding, Control Data is chosen to produce 60 Orchyd?es a month from September. Only high-end models with hard-disks and color monitors will be produced.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;THE ORCHID\u0026Eacute;E\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This black \u0026amp; white picture shows the mouse and the light-pen.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/symag_orchidee_nb_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This advert dated september 1983 says : \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026quot;\u0026lt;b\u0026gt;Orchid\u0026eacute;e : the fabulous computer\u0026lt;/b\u0026gt; (!)\u0026lt;br\u0026gt; With Orchidee, discover you can drive a formula 1 computer and never open the hood. Orchidee offers power and speed of a real professional computer with, as a gift, a lot of innovations never yet combined : interchangeable processors, including the fabulous IAPX 186, removable software cartridges, mouse, light pen. Whether you are a computer specialist or not, you have a fabulous professional tool.\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/symag_orchidee_pub_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/symag_orchidee_1.jpg",
  "builtInGames": "One or two 5\u0027\u00271/4 floppy-discs (1Mb)10 Mb Hard-disk (optional)",
  "controllers": "",
  "media": "One or two 5\u0027\u00271/4 floppy-discs (1Mb)10 Mb Hard-disk (optional)",
  "numGames": "",
  "peripherals": "12\u0027\u0027 color monitor ($1228), 11.2 Mb 5.25\u0027\u0027 hard-disk ($1633), Light Pen ($258), Mouse ($331), 8 colors graphic card ($1456)",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}