{
  "name": "TS-802",
  "manufacturer": "Televideo",
  "type": "Professional Computer",
  "origin": "U.S.A.",
  "year": "1982",
  "production": "",
  "language": "None",
  "keyboard": "Full_stroke 103 keys with 11 function keys \u0026amp; numeric keypad",
  "cpu": "Z80-A",
  "speed": "4 Mhz.",
  "coprocessor": "",
  "ram": "64 KB",
  "vram": "",
  "rom": "Unknown",
  "text": "80 columns x 25 lines",
  "graphics": "None",
  "colors": "Monochrome",
  "sound": "Beeper",
  "size": "Unknown",
  "ports": "2 x RS232, high speed port for Televideo expansion cards",
  "power": "Built-in power supply unit",
  "price": "$3,495 (Dual F.D. version), $5,995 (H.D. version)",
  "description": "\nIn 1982, T?l?vid?o was one of the first companies selling passive video terminals. These devices were used as monitors/keyboards for mainframes. Their major competitor was Digital and its VT100 terminal, which became the reference model and was later on copied by several companies.\n\nThe same year, Digital and Televideo had the same idea: to convert their video terminal into a business computer. The digital solution was called the VT-180.  Televideo offered their solution under the name TS-802. \n\nThe TS-802 was a traditional Z80 and CP/M based system. There were two versions: one equiped with double 5.25\u0027\u0027 disk drives, and another with a 10 MB hard disk (TS-802H). Like all CP/M systems manufacturers of the time, Televideo offered a free software suite called TeleSolutions. It included the two MicroPro editor bestsellers: WordStar (wordprocessor) and CalcStar (agenda/spreadsheet).\n\nInitially, these computers were used by large companies as single user, stand alone systems. Then, they were connected to multitasking mainframe units (Televideo TS-806 or TS-816 for example) and used for many years as intelligent satellite stations.   \n_______________________",
  "shot": [],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The memo from the company president:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; Your purchase request for six personal computers just reached my desk.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; What gives?\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; I thought you understood our grouth plans, Jack, but the computers you have recommanded are dead ends. They might do the job today, but what about tomorrow? They don\u0027t connect together to form any kind of functional system. The 8 bits aren\u0027t compatible with the 16 bits models. And I doubt the software that run on the computers you want will be of any use later when we\u0027re forced to buy computers that work together.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; You saved us a little now, Jack, but your decision will cost us a bundle as we grow into the future. We are growing, Jack, and I\u0027m sure that you want to be part of the growth.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; See me before you go home tonight.\u0026lt;br\u0026gt; Tom\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;/font\u0026gt; Cheer up Jack!\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Now the advert:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; If you don\u0027t want your boss to limit you growth, don\u0027t limit the growth of the company. Consider small business computers that can keep up with your business by giving you options for expansion in the future.\u0026lt;br\u0026gt; With Televideo Systems Inc. you get what no other small business computer can offer...\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Perhaps jack was right...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Televideo_TS802_Advert_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/Televideo_TS802_System_1.jpg",
  "builtInGames": "None",
  "controllers": "",
  "media": "Dual 5.25\u0027\u0027 500 KB F.D. drives or 10 MB hard disk",
  "numGames": "",
  "peripherals": "",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}