{
  "name": "CSD",
  "manufacturer": "Amstrad",
  "type": "Professional Computer",
  "origin": "United Kingdom",
  "year": "1990",
  "production": "",
  "language": "",
  "keyboard": "No keyboard",
  "cpu": "Zilog Z80A",
  "speed": "4 MHz",
  "coprocessor": "",
  "ram": "64 Kb",
  "vram": "",
  "rom": "32 KB + Main ROM cartridge",
  "text": "Not used",
  "graphics": "160 x 200 x 16 colours, 320 x 200 x 4 colours, 640 x 200 x 2 colours",
  "colors": "4096 (at least in welcome screen)",
  "sound": "3 stereo voices, 8 octaves +1 white noise channel",
  "size": "Unknown",
  "ports": "None",
  "power": "Built-in power supply unit",
  "price": "Amstrad probably gave them to dealers",
  "description": "\nAt the time when the Amstrad GX 4000 game console and the CPC+ computers were launched, Amstrad had designed this metallic box to be used by dealers as a demonstration model. It was mainly used in the UK by Dixons chain dealers. Of course, very few models were produced.\n\nWhen opening the front side of the sturdy aluminium case, one finds a metal plate covering the main board, actually a CPC 464+ motherboard, and a daughterboard holding 13 cartridge connectors. The first connector always holds a custom main cartridge which controls the CSD system. Twelve connectors remain free for standard game cartridges. The two boards are connected together through the cartridge and parallel ports of the motherboard.\n\nWhen the cartridges are inserted and the front cover is closed, a superb Welcome picture appears on the screen with a 4096-colour wave background. It is then possible to select a cartridge and run a game, or let the machine run all the games successively. A timer then allows the user to select how long each game will be played.\n\nThanks to Charles da Silva and his site for information and pictures.\n\nCharles also adds:\nAs Roland Perry told me, Amstrad used not only CPC 464+ motherboards but also GX-4000 PCBs. In fact, they used whatever they could find.\nAnother interesting thing is that the CSD was delivered to dealers in a nice wooden stand, like the ones we can find today for the Sony PS2 or Microsoft Xbox.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;INSIDE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;font color\u003d\u0026quot;blue\u0026quot;\u0026gt;(1)\u0026lt;/font\u0026gt; Game cartridges\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;blue\u0026quot;\u0026gt;(2)\u0026lt;/font\u0026gt; Main cartridge\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;blue\u0026quot;\u0026gt;(3)\u0026lt;/font\u0026gt; Daughterboard holding the cartridge connectors\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;blue\u0026quot;\u0026gt;(4)\u0026lt;/font\u0026gt;  CPC-464+ mainboard\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy \u0026lt;b\u0026gt;amstrad.cpc.free.fr\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/Amstrad_csd_Opened_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOOT SCREEN\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The boot screen allows a game cartridge to be selected. If no game is selected, the machine will run all the games successively.\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy \u0026lt;b\u0026gt;amstrad.cpc.free.fr\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/Amstrad_csd_BootScreen_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MOTOROLA AD.\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;In fact, this advert didn\u0027t promote the Macintosh II computer but the 68020 microprocessor.\u0026lt;br\u0026gt; Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; ...While Apple\u0027s choice of the MC 68020 was a smart move, there\u0027s no licence on genius: the 68020 is the microprocessor of choice in advanced business system design by such industry leaders as Altos, Alpha Micro, Casio, C.Itoh, Fujitsu, Honneywell Bull, NEC, NCR, Olivetti, Plexus, Ricoh, Sanyo, Sharp, TI, Toshiba and Unisys...\u0026lt;/font\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Apple_MacII_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;GERMAN AD #3\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Part of a software advert\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;www.sharpmz.org\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Sharp_MZ700_Advert_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US AD (JULY, 1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Eric Buczynski for this advert\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/spectravideo_SV318_ad_us_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT #3\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Picture courtesy of \u0026lt;a href\u003d\u0026sect;http://www.sbrowning.com/vintage\u0026sect;\u0026gt;Steve Browning, www.sbrowning.com/vintage\u0026lt;/a\u0026gt;.\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/commodore_vic20_ad_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;These in an advert from 84, for 3 models of Hectors (Hector 16k, Hector 2HR+ 48k \u0026amp; Hector HRX 64k).\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/micronique_hector_advert_surdoue_s.gif"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (DEC. 1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;Your personnal computer for 670 F\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sinclair_zx81_pub_670f_s.gif"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BRAZILIAN ADVERT #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.museo8bits.com\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;www.museo8bits.com\u0026lt;/a\u0026gt; for this advert\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/prologica_cp400_advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;AUSTRALIAN TANDY CATALOGS (1993)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;WP-3 model\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/tandy_wp3_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0027\u0027The memory tool\u0027\u0027\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/basis_108_advert_outil-memoire.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0027\u0027The Best\u0027\u0027\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/olivetti_m10_advert_the-best.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1977) #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;An advert d\u0026eacute;dicated to Polymorphic BASIC language features and to a new version of the system named System 0.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The \u0026lt;b\u0026gt;System 0\u0026lt;/b\u0026gt; was intended for the users who already have a S-100 Bus based system and wanted to transform it into a Poly 88 system. It consisted of the central processor card with ROM monitor, the video card and the cassette interface, all in kit form. Price: $525 \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Polymorphic_Poly88_Advert_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (JAN. 1980)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/datasoft_vdp80_ad_1980.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;HOMO-COMPUTERUS\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This image is from a brochure of a Dutch exhibition called \u0026quot;The office of the future\u0026quot;  \u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of the \u0026lt;b\u0026gt;Computer museum of the University of Amsterdam\u0026lt;/b\u0026gt; \u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Holborn_9100_leaflet_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.K. AD. (DEC. 1985)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Special Christmas offer with 12 games.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Monochrome version: \u0026lt;b\u0026gt;\u0026pound;199\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; Colour version: \u0026lt;b\u0026gt;\u0026pound;299\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Amstrad_cpc464_UKadvert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (NOV. 1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;Enter the game of computing\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/mattel_intellivision_ad-fr_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #19\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What kind of diskettes do you recommend for use with the FD-8?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have our diskettes manufactured by the Dysan Corporation. They are packaged for us under the MSI label and have proven to be the most reliable diskettes available for use with the FD-8. We have tried other manufactur\u0026shy;ers but have found none to be as reliable as Dysan. We pay more money for Dysan diskettes and, as a result, cannot offer them at a price quite as competitive as some other manufac\u0026shy;turers. However, we feel that the reliability is most important. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does the FD-8 use IBM compatible format?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 is not IBM compatible since we use hard-sectoring on the diskette. Our format uses 16 sectors of 256 data bytes each per track. In addition, track and sector identification, checksum (CRC), and other error checking information is written on each sector in addition to the data. This gives a total capacity of 315,392 bytes of data which can be stored per diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are diskette hardholes, and what do they do?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Hardholes are small mylar doughnuts which may be affixed to the center hole of a diskette for additional protection. It is possible to damage the center hole of a diskette if it is not properly centered at the time the disk drive door is closed. The mylar doughnut serves to reinforce the center hole of the diskette and give it additional protection against damage. The hard hole also provides for additional fric\u0026shy;tion between the diskette and the clamping hub in order to provent slippage of the diskette dur\u0026shy;ing rotation. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does MSI offer application software packages?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI is in the process of developing ap\u0026shy;plication software for use with the FD-8 System. We will be offering a library of standard busi\u0026shy;ness programs for accounting, inventory and mail list applications in the near future. These programs will be written in BASIC using the disk data file capability of the FD-8. The availability of application software will be announced in periodic MSI newsletters and will be made available to FD-8 users for a small copying charge plus the cost of the diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does a user program library exist for the MSI FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We are in the process of organizing a user group for the FD-8. Users of the FD-8 System are encouraged to submit programs which may be included in the user library. Member\u0026shy;ship in the user group may be achieved by either submitting a program for publication or by payment of a nominal membership fee. Membership then entitles the user to receive periodic listings of user library contents and newsletters. Programs contained within the user library will be made available for a small copying charge. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between MSI TAPE BASIC and MSI BASIC used with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have added several features to the MSI version of BASIC. We offer multiple statements per line, user defined verbs, a string\u0026shy;length command which allows strings up to 128 characters to be used, and have increased the speed of execution. In addition, we have completely removed the dependence upon the MIKBUG ROM and MIKBUG RAM areas. The stack pointers have been moved to the user program area, and the input/output routines for each of the ports are fully documented so that these can be easily changed. Interrupts are now allowed and can be used to vector the program to a user subroutine and then return to BASIC. We are also developing multi-user BASIC which will be released in the near future. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can MSI BASIC and the disk operating system be relocated?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Essentially, no difference exists between the two versions of BASIC insofar as the BASIC interpreter is concerned. The tape version has disk and DOS commands removed from its library. The interpreter resides from memory location $0100 to $1 FFF in both versions. In addition, memory locations below $0100 are used as pointers. In the Disk version, memory locations from $2000 - $2FFF are used to con\u0026shy;tain disk driver subroutines, DOS, and other file handling routines. User memory begins at $2000 for the tape version and $3800 in the Disk version of BASIC. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between SWTP 8K BASIC and MSI BASIC?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; It is not considered feasible to attempt relocation of these programs since so many of the individual routines which are used in the disk operating system are integrated. It would require a major revision of the disk operating system, BASIC, coresident assembler/editor and other associated utility programs before such a relocation could be performed. However, a version of MSI BASIC will soon be available on PROM which will reside at a high memory location. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; How difficult is it to run MSI BASIC and the disk operating system on the Motorola Ex\u0026shy;orciser, or other 6800 based microcomputer systems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The primary changes which must be made are in the input and output character routines. These routines must be changed in all MSI software so as to be compatible with the sys\u0026shy;tem on which software is running. In addition, the PIA Interface which communicates with the disk, the FD-8, is presently located at mem\u0026shy;ory address $801 C. A PIA residing at this ad\u0026shy;dress will also be necessary, or alternatively, this address must also be changed in the disk driver subroutines. Several different versions of the MSI software package are currently being developed for use with other 6800 systems. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle tape commands as well as disk?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the commands TSAVE AND TLOAD are used with the tape, whereas the commands SAVE and LOAD are reserved for use with the disk. It is also possible to place a label at the front of a block which is saved on tape. When this label is specified during a LOAD opera\u0026shy;tion, the program will search for the appropriate block on tape before loading in the information which has been stored on the tape. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle data files?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, both random and sequential data files are available for the disk system under MSI BASIC. Named files for object code, source code, BASIC program, and BASIC data files are all available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have heard that 1702A PROMs are too slow for use with 6800 systems running at full clock speed. Is this true?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; This is not true, if the memory addressing scheme employed by MSI is used to address the 1702A PROMs. The MSI PROM/RAM Board does not employ Phase 2 of the clock in the memory addressing scheme. This permits a tolerable memory access time of approxi\u0026shy;mately 9OQns. MSI uses 650ns access time 1702A PROMs in all applications. This provides completely satisfactory reliability of operation. We have experienced no problems whatsoever when using fast 1702As. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I buy a Bootstrap routine on PROM in order to bring the disk system into operation quickly?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, MSI is presently delivering a 512 byte Bootstrap Program known as Short Boot. This routine is available on a two-PROM set using 1702A PROMs for use with the MSI PROM/RAM Board. Short Boot and the PROM Board are delivered with most Disk Systems. This allows the disk to be placed into operation by simply executing the Bootstrap routine which is orged at $COOO. The system then responds immediately with DOS READY and programs may then be called immediately by file name. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I am interested in purchasing MSI software but am having a hard time evaluating its use\u0026shy;fulness. May I purchase the documentation for your disk system and BASIC separately for evaluation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the complete operating manual for the FD-8 Disk System may be purchased sep\u0026shy;arately for $35.00. This manual includes as\u0026shy;se\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s19.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT #5\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;\u0026lt;a href\u003d\u0026quot;http://www.aci.com.pl/mwichary/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;Attached\u0026lt;/a\u0026gt;\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Sinclair_ZX81_Advert_s5.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;GERMAN BROCHURE #3\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;b\u0026gt;Volken\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/GermanBrochure_s3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MONROE ADVERT, FEB. 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Monroe_8820_Advert0283_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;EQUIPED FOR COMPETITION\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;French advert (december 1984)\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/thomson_to770_pub_compet.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Picture courtesy of \u0026lt;a href\u003d\u0026quot;http://www.sbrowning.com/vintage\u0026quot;\u0026gt;Steve Browning, www.sbrowning.com/vintage\u0026lt;/a\u0026gt;.\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/apple_advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT #5 (1979)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt;Compare the built-in features of leading microcomputers with the Atari personal computers. And go ahead, compare apples and oranges. Their most expensive against our least expensive: the Atari 400...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Atari_400-800_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.K. ADVERT (1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Kaypro_II_KaycompAd_6.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;DIAGRAMS\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;PMI-80 diagram located in the case cover.\u0026lt;br\u0026gt; If you are interested in more diagrams of the PMI-80, dowload this zipped \u0026lt;a href\u003d\u0026quot;http://www.old-computers.com/Museum/downloads/Tesla_PMI80_Diagrams.zip\u0026quot;\u0026gt;file\u0026lt;/a\u0026gt; holding three diagrams of the whole system.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Tesla_Pmi80_CaseCover_s1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/Amstrad_csd_System_1.jpg",
  "builtInGames": "None",
  "controllers": "",
  "media": "None",
  "numGames": "",
  "peripherals": "",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}