{
  "name": "Falcon",
  "shortName": "falcon_",
  "description": "Spectrum HoloByte's series of hardcore flight simulations makes its only appearance on a console with <i>Falcon</i> for TurboGrafx. Owing to the limited control options, the game is more action and less simulation, but still opts for a certain amount of realism.<br><br>Players control an F-16 Falcon in combat against a terrorist group planning to construct a nuclear bomb. Before the main campaign, several training scenarios allow the practice of bombing ground targets, intercepting bombers, engaging in dogfights and facing flak guns or SAM sites. The same kinds of scenarios are faced in the campaign. Before taking off, players can outfit their plane with the correct weapons for the mission at hand, including various realistic models of air-to-air and air-to-ground missiles and bombs as well as  ECM pods and extra fuel tanks.<br><br>Takeoffs and landings are taken care of automatically. Gameplay is seen through a cockpit perspective patterned after a real F-16, with the environment and air and ground targets rendered as flat-shaded polygons. The directional pad is used to steer the plane, Select to change weapons and Button II to fire. Button I is a multi-purpose button that changes the functions of the other buttons, allowing the pilot to set the throttle, bank, shift the radar lock, and fire countermeasures. Realistic features during flight include red and blackouts, and of course, stalls and crashes.<br><br>The game features a high score table and saves mission progress via passwords (or to battery-backed RAM with a Turbo Booster Plus). A unique feature is a head-to-head mode supported on TurboExpress handhelds via Turbo Link cable.",
  "publishedBy": "Turbo Technologies, Inc.",
  "developedBy": "Spectrum Holobyte, Inc.",
  "released": "1992",
  "alsoFor": "",
  "genre": "Action, Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/turbo-grafx/falcon_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "TurboGrafx-16",
      "releases": [
        {
          "publisher": "Turbo Technologies, Inc.",
          "developer": "Spectrum Holobyte, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/901603-falcon-turbografx-16-screenshot-title-screen.png",
      "caption": "Title screen."
    }
  ],
  "cover": []
}