{
  "name": "Power Eleven",
  "shortName": "power-eleven",
  "description": "<i>Power Eleven</i> is a top-down soccer game with three playing modes: multiplayer, penalty kicks (shown from the back of the transparent goalkeeper) and a tournament mode. The latter is the main mode for solo players and features twelve national soccer teams. Then the player needs to defeat the other teams with rising difficulty to win the Hudson Cup. Regarding rules, the game features no fouls or off-sides.<br><br>Each athlete has a rating in the five statistics (run, dribble, kick, technique and power) which influences his performance on the field. The player can also choose between different formations and after successful matches athletes can be substituted. The most unusual aspect of the game is the power rating which is lowered when using the power mode which allows faster movement and forceful shots. However, the power does only get completely refilled after a match so it needs to be used with care. Because the activation of this mode takes up a button, there is no dedicated passing button to be found. The distance of a shot is chosen by pressing the fire button quickly or holding it. ",
  "publishedBy": "Hudson Soft Company, Ltd.",
  "developedBy": "Westone Co., Ltd.",
  "released": "Jun 21, 1991",
  "alsoFor": "Wii | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/turbo-grafx/power-eleven",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "TurboGrafx-16",
      "releases": [
        {
          "publisher": "Hudson Soft Company, Ltd.",
          "developer": "Westone Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 21, 1991",
          "ean13": "4 988607 200411",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/550809-power-eleven-turbografx-16-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/550810-power-eleven-turbografx-16-screenshot-main-menu.png",
      "caption": "Main Menu"
    }
  ],
  "cover": []
}