{"altername_name": ["Comando Noturno"], "name": "Comando Noturno", "overview": "Comando Noturno! (Night Commando!) is a combat flight simulator. The player controls a fighter plane on a night mission, and his task is to take off, destroy the target, avoid enemy attack and return to base. The plane is controlled both with the joystick and the keyboard. With the joystick, the player controls the plane's direction (up, down, left or right) and weapon (with the action button). With the keyboard, he controls the several plane's instruments. The game is seen from the plane's cockpit in a first person perspective. There's a main display, which will show (by player's request via keyboard) the plane's speed (M key), height (H), fuel (F), distance to target (T), distance to base (B), ammunition amount (W), weapon selected and friend/foe status. Above the main display, four lights can be seen, showing which weapon is selected: cannon (C), bomb (B), ground missile (G) and air missile (A). To the right, a direction and level indicator can be seen, and below it an infrared sensor. After taking off, the player must raise the landing gear (U) before the plane exceeds Mach 0.5 speed, or else the plane will be destroyed. Once in the air, after locating a target the player must identify (I) if it is a friendly or enemy aircraft. Shooting friendly airplanes or vehicles will terminate the mission. After destroying the targets, the player must land the plane. To do so, he needs to be at low speed, with the landing gear down and aligned to the ground. After touching the ground, the plane must hit the end of the runway as slow as possible. Failing to achieve these conditions will make the plane crash. The plane will be also destroyed if it gets hit by an enemy, hits the ground, or runs out of fuel.", "platform": "Magnavox Odyssey 2", "release_date": "January 1, 1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Philips", "publishers": "Philips", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "2.4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=WzC3kF0MUMA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22179-comando-noturno\n"}