{"altername_name": ["I've Got Your Number"], "name": "I've Got Your Number!", "overview": "Press 1 on the alpha-numeric keyboard. The screen will display a giant electronic blackboard filled with orbiting numbers and symbols. Player 1 appears at the left side of the screen. Player 2 appears at the right side of the screen. Each player stands on a scoring box which will automatically count up each correct answer. The left hand control unit activates the left hand player on the screen. The right hand control unit activates the player at the right hand of the screen. Push the joy stick away from you to walk your player toward the top of the screen. Pull the joy stick toward you to walk your player to the bottom of the screen. Push the joy stick left to go left. Push it right to go right. An addition, subtraction or symbol problem will appear at the base of the screen. The answer will appear somewhere in the orbiting numbers and symbols. Each player races to the correct number or symbol with the electronic figure. When a player catches a correct answer, a point is scored and the solution is displayed at the bottom of the screen. A new problem will then be presented. If a player catches an incorrect answer, he is sent back to the starting position and the incorrect number or symbol is automatically removed from the screen. This process of elimination will eventually guide the players to the correct answer through a positive learning experience. The winner is the first player to score ten correct answers. The winner receives an electronic pat on the back and a musical salute. A new game will automatically start after each ten point round. Some correct answers will appear in the center of the orbits and will be more difficult to reach. Press the action button to lower the electronic figure's head to duck through the orbit without touching a wrong answer. This game is programmed so that it may be played by children who do not yet comprehend numbers. At the first level, a child may enter a matching symbol and it will score as a correct answer. The level of play will move up as the players grow more proficient.", "platform": "Magnavox Odyssey 2", "release_date": "January 1, 1979", "game_type": "", "esrb": "", "developers": "Magnavox", "publishers": "Magnavox", "genres": "", "max_players": "1", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22198-ive-got-your-number\n"}