{"altername_name": ["Math-A-Magic + Echo", "Mathematicien + Echo"], "name": "Math-A-Magic / Echo", "overview": "MATH-A-MAGIC! (one or more players) Press 1 on the alpha-numeric keyboard for conventional math problems. The computer will ask if you want to add, subtract, multiply or divide. Press the appropriate symbol on the alpha-numeric keyboard. The computer will then ask you to select a skill level from 1 to 3. The higher the number, the harder the problem. Press the skill level desired on the alpha-numeric keyboard. The first problem will appear on the screen. If the problem is displayed on a horizontal format, enter the solution from left to right. A. 7 + 8 = ? A. 7 + 8 = 1 A. 7 + 8 = 15 If the problem is displayed in vertical form, enter the solution from right to left. You will be guided by a flashing question mark. Press the ENTER key. The computer will tell you if you've answered correctly. A right answer will automatically present you with another problem to solve. A wrong answer will give you one more try. (You can change your answer before pressing ENTER by pressing the CLEAR key.) If you give two incorrect answers to the same problem, the computer will tell you the correct answer and allow all the time you need to study the solution. You must press the ENTER key to display the next problem. A digital clock at the upper left of the screen will keep track of your time. A digital scoreboard will keep track of your correct answers. If more than one person is playing, the winner is the player solving ten problems in the least amount of time. The computer sings out a jingle for every 10 correct solutions given. To solve algebraic problems, push RESET and press 2 on the alpha-numeric keyboard. To practice addition and multiplication tables, push RESET and press 3 on the alpha-numeric keyboard. The computer will ask you if you wish to practice addition or multiplication. Press + or x on the alpha-numeric keyboard. The computer will then ask for the number you wish to practice. Press that number on the keyboard. ECHO! (One or more players) Press the RESET key on the alpha-numeric keyboard. SELECT GAME will appear on the screen. Press 4 on the alpha-numeric keyboard. Four numbers will appear on the lower part of the screen. A message from the computer will ask you to WAIT. It is the computer's turn first. It will light up one of the numbers on the screen and sound a tone. The computer will then signal it is YOUR TURN on the screen. Light up the same number displayed by the computer by pressing the corresponding number on the alpha-numeric keyboard. The computer will then light up two numbers in succession during the next WAIT cycle. When it's YOUR TURN, enter the same numbers into the keyboard in the same sequence. The computer will add one number to its challenge every time you successfully ECHO its challenge. If you make an error, the computer will repeat the challenge. It will even give you a third chance to succeed. But after the third error, the computer will declare GAME OVER on the screen. A digital read-out on the screen keeps track of your score. If more than one player is challenging the computer, the player with the highest score per round is the winner. To play again, press RESET and then press 4 on the alpha-numeric keyboard.", "platform": "Magnavox Odyssey 2", "release_date": "December 1, 1978", "game_type": "Released", "esrb": "Not Rated", "developers": "Magnavox", "publishers": "Magnavox", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22209-math-a-magic-echo\n"}