{"altername_name": [], "name": "Monkeyshines!", "overview": "In Monkeyshines! one or two players will try to tag as many monkeys as they can while avoiding being tagged back. The players can move and jump over platforms where the monkeys are hanging and moving around. If a player catches a monkey, he has to press the \"action\" button to tag the monkey and throw it in any desired direction. Once tagged, the monkey will become red for a while and try to tag back the player. If the player is tagged, he's out of the game. The game ends when both player characters are tagged. The computer keeps track of how many monkeys were tagged. If more than 10 are tagged, the monkeys start to stay red for a longer period of time and it becomes harder for the players to avoid being tagged. The difficulty levels can be skipped without having to score points by pressing the \"+\" key once (for the second level) or twice (for the third). The main gameplay is called Monkey Tag! Additional variations can be played by the introduction of keyboard commands: Tailspin!: by pressing R the players randomize the platforms' position every few seconds. Pressing S will stop it; Shuteye!: by pressing I the platforms become invisible to the players. Pressing V makes them visible again; Monkey Chess!: in this variation, one of the players (or an additional one) can edit the playfield by adding or removing bars. To do so, the player types the coordinates of the desired vertical (number, letter) or horizontal (letter, number) bar and press \"clear\" to remove it or \"enter\" to add it.This way \"ladders\" and \"cages\" can be built to help the players; Bananas!: this variation consists in a combination of all the previous ones.", "platform": "Magnavox Odyssey 2", "release_date": "January 1, 1981", "game_type": "Released", "esrb": "Not Rated", "developers": "Ed Averett", "publishers": "North American Philips Consumer Electronics", "genres": "Action", "max_players": "3", "cooperative": "No", "rating": "2.8", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=yTUzaXM6KMM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22210-monkeyshines\n"}