{"altername_name": [], "name": "Nimble Numbers Ned", "overview": "Nimble Numbers Ned was one of the three games specifically designed to use the resources of the Voice. It is a math game where the objective is to make Nimble Numbers Ned jump over 100 numbered stones, avoiding his barrels of fun. To do so, the player has to run through one of the three minigames. At the start of the game, the computer will ask \"which drill?\" to what the player has to answer entering a number on the keyboard (1, 2, or 3). At the start of each drill, the computer will ask \"how good you are?\", to what the player has to answer with a number for the skill level (from 1 to 5). The games selected by the numbers are the following: Name the Shapes: in this mini game the player has to identify correctly shapes on the screen. As one shape blinks on the screen, the computer will say \"this is a [name of the shape]\". The player has then to answer \"Y\" or \"N\". Each correct answer in the first try gives the player a chance to jump the barrels. The higher the skill level, the more chances the player get. Multiplication Runthrough: this is a multiplication game with one and two place operations. The computer asks \"what is XX x X?\" and the player has to answer entering the numbers on the answer from right to left. As in the previous game, each correct answer gives an extra chance of jumping, depending on the skill level. Function Machine: in this game the player has to solve functions with unknown variables. The computer will ask questions such as \"if the number is X, what is the number plus Y?\", to which the player answers entering the numbers from right to left. Higher skill levels imply in more complex functions. As in the previous two games, correct answers grant the player extra chances to jump depending on the skill level. There's also a jumping practice game, selected by pressing 0. In this game, the player can train to jump the barrels, but the progress won't be saved.", "platform": "Magnavox Odyssey 2", "release_date": "January 1, 1982", "game_type": "", "esrb": "", "developers": "Magnavox", "publishers": "Magnavox", "genres": "", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22217-nimble-numbers-ned\n"}