{"altername_name": ["Pong"], "name": "Pong for Odyssey 2!", "overview": "Prototype First press ‘RESET’ The text “SELECT GAME” will appear on the screen. Next press ‘0’ (zero) to ‘9’ or ‘Space.’ Each number or the space key will start a different version of Pong! Squash (Practice) Key 0: 1 player, low ball speed Key 1: 1 player, high ball speed Squash (left controller, blue, goes first) Key 2: 2 players - low ball speed Key 3: 2 players - high ball speed Tennis (right controller, red, goes first) Key 4: 2 players - low ball speed Key 5: 2 players - high ball speed Pong Classic (Squash) Key 6: 1 Player Key 7: 2 players - (left controller goes first) Pong Classic (Tennis) Key 8: 2 players - (right controller goes first) Pong-Analog (Squash) Key 9: 1 player Pong-Analog (Tennis) Space: 2 players - (right controller goes first) Pong - Games 0 though 5 System Screen These games start with a blue system screen, which displays four system parameters on three display lines. The first line on this screen shows the television type and language of the console, displayed as ‘SYS: (NTSC or PAL) / (EN or FR).’ NTSC or PAL refers to the television type the game is running on, and EN or FR is the system language, either English or French. The second line displays whether or not a Voice Module is detected. This is shown as ‘VOICE: (NO or YES).’ The last line, ‘GFX: (STD or PLUS),’ shows if the system is Standard or has Plus graphics capability. This detects a regular or G7400 game system. Note that this game does not have Plus graphics! You can skip the ‘System Screen’ by pressing the Action Button on the Right controller. Game Title Screen The second screen is the title screen, which shows the game title and systems that it was designed for (Odyssey2 and Philips). This screen can be skipped by pressing the Action button on the Left controller. Voice Games 0 through 5 are Voice enhanced. If you have the cartridge plugged into your system through the Voice, you will get various comments and words when a ball is hit or missed. Game Play In games 0 though 5, you can move your paddle in all eight joystick directions. Unlike some Pong games, you can move both horizontally and vertically. The Left joystick controls the blue paddle, while the Right joystick controls the red paddle. Press and hold the Action button during play to speed up the movement of your paddle. This can be very useful in the game with a high ball speed. During game play, you can change the ball speed by using the keyboard. Press ‘1’ for low ball speed, or ‘2’ for fast ball speed. End of Game The game ends when one of the players has reached a score of 40 points. The winner is the player with the highest score. In one player games, there is no winner, but you can try to beat the clock, getting a better time as you play. Press any key except ‘Reset’ to start a new round of Pong with the same settings. Press ‘RESET’ to select a different game. Classic Pong These games are based off of the Pong: AY-3-8500, which was a popular Pong chip made by GI and was used in a lot of Pong consoles. Game Play Options 6 through 8 are Classic Pong. These versions of Pong have no Voice, clock, color, startup screens, and have no horizontal movement of the paddles. In the two-player squash game (option 7), players ‘must’ take turns hitting the ball. When one player has hit the ball, he cannot touch it anymore until the other player has hit it. Ball speed can be changed by pressing ‘1’ for slow speed and ‘2’ for fast speed. Paddle speed can also be increased by holding down the Action button. End of Game Classic Pong games end when the score reaches 15. Pong-Analog These two games are based on the Pong: ES2201 style game, which was an early analog Pong game made by Philips. This game is also called ‘Telespiel.’ These games have no sound, score, and the players do not have the possibility to change the angle of the ball. There are six different horizontal ball speeds. Each time you press‘ 2’ the speed increases, up to six levels. Each time ‘1’ is pressed, the ball speed is decreased, until level one is reached. There is no automatic server. You have to press the Action button to serve the ball after it has left the play-field. The Action button will not increase the speed of the paddle. Since there is no score in Pong-Analog, these two games do not end!", "platform": "Magnavox Odyssey 2", "release_date": "", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "", "publishers": "Unreleased Prototype", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4.4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22252-pong-for-odyssey-2\n"}