{"altername_name": [], "name": "Power Lords", "overview": "Power Lords is a game released for the Odyssey 2. It is based on the toy line from the 1980s that bears this name. To start the game, press 1 on the keyboard. You have just arrived at Volcan Rock - an artificial planetoid defended by a laser-eyed space serpent and other minions of the evil Extra-Terrestrial Alliance! Use the joystick of the right hand control to fly the space sled. Press the action button to fire your lasers. Warning! Your space sled can be destroyed by falling lava, rocks, contact with the space serpent's body or a blast from it laser eyes. Gryptogg, Raygoth and Arkus of the Extra-Terrestrial Alliance, will periodically open doors in the volcano to fire a gravitational ray. The higher your score, the stronger the artificial gravity fields will become and the more likely you will be drawn to your doom. Direct hits of your lasers will stun the space serpent and destroy falling rocks. You can defeat the gravitational ray by blasting the door in the volcano. SCORING: - Blasting lava during volcanic eruption: 3 points - Stunning the space serpent: 15 points - Hitting an open door: 45 points - Destroying lava rock: 75 points - Surviving a volcanic eruption: 1000 points The score of your current game appears at the lower right of your screen. The high score in a series of games will appear at the lower left of your screen. Two question marks request the initials of the high scoring player. The high scoring player enters his or her initials through the keyboard. The high score and the high scoring player's initials will remain on the screen until a higher score is achieved in succeeding games. To start a new scoring round press RESET and then press 1.", "platform": "Magnavox Odyssey 2", "release_date": "January 1, 1983", "game_type": "", "esrb": "", "developers": "Magnavox", "publishers": "Magnavox", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.71", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22224-power-lords\n"}