{"altername_name": ["Gunfighter", "Showdown in 2100 AD"], "name": "Showdown in 2100 A.D.", "overview": "Press 1 on the alpha-numeric keyboard. An authentic acre of the old west will appear on your screen - along with two android gunfighters. The left hand control activates the gunfighter on the left - the right hand control activates the gunfighter on the right. Push the joy stick forward. Your gunfighter will swagger to the top of the screen. Pull the joy stick toward you to walk him to the bottom. Push right to go right. Push left to go left. Press the action button to activate your gunfighter to draw and fire. Each gunfighter has six bullets in his revolver. The number of bullets remaining in each six shooter is indicated by the ammunition counter at the base of the screen. The left hand gunfighter's score appears at the bottom left of the screen. The score of the right hand gunfighter appears at the bottom right corner of the screen. The first player to score ten hits wins the round. Ricochets off trees and the top and bottom edges of the screen count as hits. A gunfighter may shoot through the branches if he is positioned right up against the tree. But if he is even slightly away from the tree, the bullet will hit the tree trunk and ricochet back to him. Reloading. Each gunfighter has more ammunition hidden in the tree which matches the color of his outfit. Each gunfighter can reload at any time by touching the tree where his bullets are hidden. You can play SHOWDOWN alone and shoot it out with the computer. Use either hand control. The computer will automatically take control of the other gunfighter. If you activate the game without touching either of the hand controls - the computer will automatically assume control of both gunfighters and play itself. The computer will automatically reset itself for a new ten point SHOWDOWN at the end of each ten point series.", "platform": "Magnavox Odyssey 2", "release_date": "January 1, 1979", "game_type": "Released", "esrb": "Not Rated", "developers": "Magnavox", "publishers": "Magnavox", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22230-showdown-in-2100-ad\n"}