{"altername_name": [], "name": "SID the Spellbinder", "overview": "Press 0 on the numeric section of the keyboard. The Voice will ask you to \"SELECT SKILL.\" Choose 1 or 2. Press 1 for the first skill level. Press 2 for the second skill level. (If you don't press either, the computer will automatically deliver skill level 2 after about 15 seconds.) The Voice will immediately announce: \"MONSTER ATTACK! OPEN FIRE!\" Sure enough! Giant Sid the Spellbinder snakes across the screen. Your only defense is a missile launcher at the bottom of the screen. Use the joystick of either hand control to move your missile launcher to the right or left. Press the action button to fire a missile. Your ammunition supply is indicated by the number at the lower right hand corner of the screen. You get thirty missiles at skill level 1 and twenty missiles at skill level 2. If you do not completely destroy Sid the Spellbinder before it reaches the opening at the lower left and right sides of the screen, it will eat your reserve missile supply starting with the second turn. Sid the Spellbinder consumes five missiles for each of its segments that make it to the opening. Your score appears at the lower left hand corner of the screen. Every segment you hit is worth progressively more points. The first segment you hit is worth 1 point. The second is worth 2 points. The third is worth 3 points - and so on up through ten. If your score is less than 200, Sid the Spellbinder will squeeze its remaining segments together when it goes off the screen. When your score goes over 200, the game gets harder. The gaps will remain open and Sid the Spellbinder moves faster and faster. The spelling fun starts when you hit all ten segments of Sid the Spellbinder - or when it reaches the bottom of the screen. - eats some of your missiles - but leaves you with some in reserve. The Voice will ask you to spell a word. Type in the letters on the alphabet section of the keyboard. If you make a mistake in typing, press CLEAR. When you think you have typed in the correct spelling, press ENTER. You get 10 missiles for every word spelled correctly at skill level 1. You get 5 missiles for every word spelled correctly at skill level 2. You will get a chance to spells three words in each round of the game. If you don't spell a word correctly the first time, the computer will ask you to try again. If you don't spell the word correctly on the second try, the computer will spell it for you so you'll know how to spell it next time. After each series of three words, Sid the Spellbinder will attack and try to eat your missiles. The game ends when you have no missiles left. To start a new game, press RESET and then press 1 (for skill level 1) or press 2 (for skill level 2).", "platform": "Magnavox Odyssey 2", "release_date": "December 1, 1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Philips", "publishers": "Philips", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "2.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22228-sid-the-spellbinder\n"}