{"altername_name": ["Smithereens", "Stone Sling"], "name": "Smithereens!", "overview": "Press 1 on the numeric section of the Odyssey2 keyboard. You have just arrived in days of old when knights were bold. Football has yet to be invented - and castle crumbling is one of the most popular national sports. The left hand control activates the soldier and catapult at the left side of your screen. The right hand control activates the catapult at the right side of the screen. To launch a boulder, move the joystick in any direction and release it. The longer you hold it back, the farther the boulder will travel. If you hit your opponent's catapult, he will move it out of range to make the necessary repairs. You should make the most of this opportunity to intensify your bombardment. Every time a boulder strikes your opponent's castle, a section of it will disappear. If a boulder strikes your opponent's soldier, he will go to the nearest off-screen first aid station. You can wreak unmolested devastation until he returns. The winner of each battle receives the number of points scored during the battle multiplied by the number of the battle. Example: Player One scores 110 points during the third battle. Player One receives 330 points (110 x 3 = 300) The computer automatically adds the battle score to the total score of the winner. The loser gets no points. The winner of a battle is the player who still has part of his castle standing. There are ten battles to a war. Battle scores are displayed on the screen during each battle. Total scores are displayed at the end of each battle. They will remain on the screen until one of the action buttons is depressed to start a new battle in the series. The winner will celebrate with a fanfare of trumpets. The loser will display a white flag. Scoring: - EACH DIRECT HIT ON A CASTLE: 3 POINTS - DIRECT HIT ON A SOLDIER: 7 POINTS - DEMOLISHING A CATAPULT: 13 POINTS Soldiers and catapults returning from off screen cannot be destroyed until they have returned to their battle stations. To start a new game, press RESET and then press the key code (1, 2 or 3) for one of the three available catapult tension settings. (The higher the number, the faster the reaction time required.)", "platform": "Magnavox Odyssey 2", "release_date": "January 1, 1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Magnavox", "publishers": "Magnavox", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22231-smithereens\n"}