{"altername_name": ["Wasabi Produce: Street Dancer", "Wuz up b? Produce: Street Dancer"], "name": "Wuz↑b? Produce: Street Dancer", "overview": "Street Dancer is a rhythm game starring the crew of wuz↑b? a Japanese pop music performance group. The game features a line of button prompts scrolling across the bottom of the play that you will have to press, when they reach the center of the screen. Before you start a game, you will be asked to select a member of the wuz↑b? crew; Nana, Kaoru, Shino, or U. As you press buttons, the chosen terpsichorean will shake it or stare at you in stupefaction, depending on your performance. A 'life bar' is presented on the screen. If you fail to perform well the bar will go down, when it is empty your game ends. To clear a stage and unlock a new background with a harder song, you'll have to get about a 60% perfect score. You can always record your performances to watch over and over again. When a stage is clear you unlock new dance moves, these dance moves will appear in the game and in the \"Step Book\". In the step book you can watch the members of wuz↑b? perform all their signature moves. You can also have the dancers perform in any way you like which you can record and repay for your friends. Three different musical styles are represented: jazz, hip hop, and rock. The game makes each of these modes unique, not just by changing musical tone but, by having the player change the way he holds the WonderSwan for each genre. A multiplayer mode is also included for two people on one system. Both players take one set of the WonderSwans directional buttons and both players select different dancers. The multiplayer mode takes place in the vertical \"lockin'\" style, with two columns of press commands scrolling on the right. Both players are instructed by one of the columns, the player that is doing better will have their chosen dancer displayed on the screen.", "platform": "WonderSwan", "release_date": "April 27, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Fortyfive", "publishers": "Bandai", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27903-wuzb-produce-street-dancer\n"}