{"name": "Birds of Prey", "overview": "Birds of Prey is a Vectrex game similar to the Galaxian series, some might call it a homebrew port of Phoenix. The gameplay is similar to Galaga and consists of five waves that simply loop with increasing difficulty. Instead of using the analog stick you press buttons 1-2 to move left and right, while button 4 fires. It takes a few minutes to adjust but once you do you'll find the control scheme works fine. By pressing button 3 you can activate a shield once per wave (or re-use it if you lose a life) and this protects you from incoming fire and enemies. It's very handy and you'll want to use it when you're surrounded. The first wave sees you trying to blast down small birds but you can only fire one bullet at a time. The birds can spray multiple bullets at once and they often swoop in on you. The difficulty is high so don't expect to be eased in! The second wave is more of the same but this time you can fire two shots simultaneously which makes things more manageable. The third and fourth waves are the weakest as they feature large, flapping birds that take forever to shoot as their hit box is small (you need to hit them dead-centre). While they occasionally fly towards your ship they tend to only move from side-to-side making these waves easier than the preceding ones. The last wave is interesting as it features a boss battle, seldom seen on the system. You face a giant mother ship with a gaping hole in the centre; you instinctively know where to shoot but it's protected by swarms of birds that try to attack you. If you manage to beat the boss it explodes in a satisfying manner! As this is a high score game it's tempting to continually fire your weapon at will. However, I found it's better to be strategic and follow attack patterns as enemies will frequently line themselves up for a perfect shot.", "platform": "GCE Vectrex", "release_date": "1999", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "John Dondzila", "publishers": "Classic Game Creations", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=osU3VQwDueY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126385\n"}