{"name": "Mail Plane", "overview": "Mail Plane is an unreleased flight simulator that uses both a standard controller and the Vectrex Lightpen. The objective is to load five packages into your plane and deliver each one to a specific city before you run out of fuel. To increase the challenge, clouds must be avoided, otherwise you risk being hit by lightning and losing one of your five lives. What's most impressive is how the game is split into multiple sections to immerse the player. Prior to takeoff, you have full control over the flight path, allowing you to map the most efficient route; this is great for replayability and adds layers of strategy. Careful planning is crucial, and I found it helpful to take a picture of the drop-off points beforehand for navigational purposes! Next up is the mail loading sequence where you drag packages into the plane; the Lightpen lacks true precision, but for the purposes of what's required here it works fine. You then accelerate and takeoff using the controller, and enter the heart of the action; here, the game adopts a top-down view as you dodge clouds and search for the correct cities. It's slow-paced and relaxing like Pilotwings (1991, SNES) and controls beautifully. The threat of lightning is an integral part of the challenge, as without it, flying around and delivering packages would be easy! Its inclusion cleverly forces you to watch your fuel meter (as dodging clouds takes away precious fuel) while trying to be economical at all times. My only annoyance is that the flight path screen isn't always accurate, and it can fool you into thinking a city is located towards the right when it's actually diagonally-right. Once you've navigated to the correct location you simply press Up on the controller to land, use the Lightpen to unload, and repeat the process until each package has been delivered. As a whole, the gameplay is tons of fun and I love that the map and cities change each time you complete a route.", "platform": "GCE Vectrex", "release_date": "1983", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "GCE", "publishers": "", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83387\n"}