{"name": "Tour De France", "overview": "There's two different track layouts (Game 1 and Game 2 options) and the objective is to place first while obtaining the quickest possible time. Pressing Left or Right on the analog stick moves your rider across the road, while Up is used for acceleration. The face buttons allow you to change gears (Slow, Medium or Fast), pause the game (a rarity on the Vectrex!), as well as grab the occasional water bottle from the side of the road (required to maintain energy levels so you don't slow down). The gameplay involves avoiding the sides of the track, while dodging debris and fellow riders; failing to do any of these results in your rider crashing and losing precious seconds. What's impressive is that the tracks aren't flat, and instead feature rolling hills that even seem to affect how fast your bike can move while ascending. The action is fast but the biggest problem is that it's completely unplayable once you move into the highest gear; here, the action becomes a flickering mess and it's almost impossible to avoid the obstacles and opponents with any sense of precision. The trick is to cycle constantly between second and third gear, but even then you'll never be able to build up enough speed to place in the top two riders. There's also a very thin line between successfully grabbing the water bottle and crashing into the side of the road; as a result you'll never feel in full control, and instead find yourself bracing every time you try to obtain it. Annoyingly, following on from a crash opponents frequently run you over once you begin cycling which stops you in your tracks and sees more seconds tick off the clock. The Game 2 option features a slightly different layout and more debris on the road; while it's nothing too interesting it's nice that the developers added a bit more content.", "platform": "GCE Vectrex", "release_date": "", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "GCE", "publishers": "Never Published (Prototype)", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "2.18", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=BhP6uBPe5SA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81634\n"}