{"altername_name": [], "name": "Pets Rescue", "overview": "Psytronik Software is proud to present another stunning game for the Commodore Plus/4 and Expanded C16*. PETS RESCUE is a sprawling arcade adventure featuring 24 massive scrolling levels to explore! Thanks to the amazing work by the +4 All Stars team this is another release that pushes the technology of the Plus/4 & Expanded C16 to the limit!! * Requires 64K RAM expansion to work on a C16. Pets Rescue Pets Rescue is NOW AVAILABLE in three different formats. The Collector's Edition Box Set contains the game presented in a gorgeous glossy box, soundtrack CD and a whole host of extra goodies. The PREMIUM+ DISK EDITION of the game is presented with full colour artwork in a plastic disk case. The BUDGET DISK EDITION features a 5.25\" floppy disk presented in a full colour glossy disk-sleeve with a glossy vinyl label & printed instruction art card. Pets Rescue ** PETS RESCUE STORY ** The sun of a new day makes the windows shine at Dr Dree's veterinary center. She's Dr Andrea Brown wearing a lab coat, but she becomes Afro Dree when singing! Meanwhile, Dree's assistant Dr Edward Vil practices his sick science in the dark. Suddenly, a strange explosion rips through the building. Never mess with DNA! Pets turn into evil beings, wreaking havok in the centre! The mutated pets have sneaked through the door, go and rescue them, Dr Dree!! Pets Rescue ** PETS RESCUE FEATURES ** · Runs on a standard Plus/4 or expanded C16! · Excellent presentation + intro sequence. · Huge scrolling levels to explore. · Animated backgrounds. · Great gameplay with controllable mid-air jumps. · Fantastic game graphics. · Superb soundtracks. · Gigantic final boss. · Stunning end sequence. Pets Rescue ** PETS RESCUE CREDITS ** Coded by Stefan Mader (Mad) Graphics by KiCHY & Luca Additional gfx by Nero & Carrion Music by Luca, Degauss & 5tarbuck Cover Art by Trevor Storey A 2018 +4 All Stars Production", "platform": "Commodore Plus 4", "release_date": "February 25, 2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Stefan Mader", "publishers": "Psytronik Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=gFpA2lOrvFw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117695-pets-rescue\n"}