{"altername_name": ["Starburst"], "name": "Starburst: A Walk on the Wild Side", "overview": "You are here in your Corastron Ship to save the galaxy after scientists on the planet Sistasis blew up the planet trying to discover what made the planets core active and now dangerous Plastron Boulders are loose. The game is split into three stages with each stage played on one screen as you try to control the boulders. Stage One: There are three coloured boulders bouncing around the screen and the yellow and purple boulders must be directed into their home slots while the grey boulder will disrupt the stage but is needed when the coloured boulders are in their slots. You must move around the screen and shoot the two coloured home slots until they turn lighter and finally start flashing. When the yellow home slot is flashing your ship turns into a bat. You must now direct the two coloured boulders into the slots at a clean 45 degree angle. If a boulder is in it's slot and the grey boulder touches it then the boulder starts bouncing around the screen again. Once both coloured boulders are home then you must direct the grey boulder into all four corners. The coloured boulders can still be knocked out of their slots. Your energy gauge is just the yellow and purple bars and you lose energy when you touch any boulder. Once both gauges are empty then it is game over. Stage Two: You now have four different coloured boulders bouncing around and the aim is to keep shooting the force field bit by bit until it disappears from the top or bottom of the screen. You can move around the whole screen but can't hit the force field from the sides. While shooting you must avoid touching any boulder as this will lose part of your energy bar. You now have four parts of your energy gauge and once again it's game over when it is empty. The more of the force field you destroy the more boulders that enter the screen. Stage Three: The final stage will see you trying to round up six different coloured boulders by shooting each boulder in the correct sequence. When the correct boulder is weakened by your constant shooting it jumps up the line to the next boulder. Keep doing this until you weaken the last coloured boulder. There are other coloured boulders but don't react to your shooting and is just wasting time shooting them. A red boulder will bounce around the screen and if you touch it then the line of boulders reset and you have to start again. You have a full gauge and touching boulders decreases it and it is game over when it is empty. Between each stage is a bonus round to build up your score. Pick up pods to make yourself bigger and when happy with your size (this dictates the amount of boulders as well) you can move into the playing screen and try to deflect boulders into your character to score points. When your energy gauges are empty you move on to the next stage. A joystick is used to control your ship.", "platform": "Commodore Plus 4", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Tony Takoushi", "publishers": "Ariolasoft UK", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164559-starburst-a-walk-on-the-wild-side\n"}