{"altername_name": [], "name": "Summer Events", "overview": "Summer Events is a Olympic multi-event game where up to four players can compete in seven separate events. After the opening ceremony the players enter their names and pick a country listening to the national anthem. The players are presented with various options and they include, play all events, compete in some events, and practise the events. The seven events are: Butterfly Swimming: The screen is split into two parts showing two swimmers viewed from the side with the screen scrolling. The swimmers have to swim the butterfly stroke for two lengths of the pool as fast as possible. Pole Vault: Viewed from the side on a single screen, each player has to first choose a height before having three attempts to clear the bar at the selected height. Javelin: The thrower is viewed from the side and the screen scrolls as the player runs towards a line and has to throw the javelin as far as possible. Skeet Shooting: A single screen viewed from a 1st person perspective has each player having to shoot as many skeets from various positions. The player has five rounds and has to reload when the gun is empty. Platform Diving: A single screen viewed from the side, each diver has four diving options to select from before attempting to complete as many somersaults as they can and entering the water cleanly. Cycling: The screen is split into two parts showing two cyclists viewed from the side with the screen scrolling. The cyclists have to ride their bike along a straight course from left to right as fast as possible. Weight Lifting: A single screen which sees a lifter facing the player and has to lift weights in two disciplines, Snatch and Clean and Jerk. After choosing the weight the lifter has to lift the weights above their heads and hold it there for a short time.", "platform": "Commodore Plus 4", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Udo Gertz", "publishers": "Anco Software", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "4.2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=9junqS3geK8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115052-summer-events\n"}