{"altername_name": [], "name": "The Pit", "overview": "It has been quite a few years since we last saw Prospector Pete in action (around about 34 years I think!). But he is back, and he is still wandering around abandoned mine workings looking for treasure. Having managed to escape from the old Klondike mine (which was infested with monsters and kept flooding) he stumbled across another abandoned mine to explore. This one used to be owned by a rather unscrupulous mining company called 'Rock Bottom Mining Corporation'. They were looking for gems, and found lots, but they also found some other things down there too. Some good, some not so good. Eventually, despite the riches that they were extracting from the mine, they had to abandon it. They left lots of things down there in their rush to leave... Pete is now on his new quest – to get through all the caves of the mine workings, gathering as many gems on the way as he can, solving puzzles, fighting monsters, and trying not to get stuck. He will encounter lots of obstacles on the way. The caves are littered with boulders, which will come crashing down if he is not careful. Pete has been working out, and he is able to push and pull boulders to clear a path, and attack things. There are numerous monsters lurking in the mine. Some have very poor eyesight and will feel their way around by following the walls. They are often quite anti-social and do not like meeting other types of monsters. Maybe he can use that to his advantage? Some other monsters (who appear to have escaped from a 1980's classic arcade game) are a bit smarter. They wander the caves and are always on the lookout for Pete, or one of their opposite number. If they see Pete, they will chase him down, unless he can outwit them. If they see one of their opposite number, its best to stand clear! The deeper parts of the mine can contain a mysterious and much prized substance called Gemanium. Looking and behaving a lot like a boulder, it twinkles in the darkness. Be warned: it is radioactive, and if you get too much of It together in one place it will reach critical mass. Stand back!", "platform": "Commodore Plus 4", "release_date": "August 8, 2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Doug Turner", "publishers": "Public Domain/Freeware", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?time_continue=1&v=o-qoc70HAyk&feature=emb_logo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136544-the-pit\n"}