{"name": "World of Sports", "overview": "World of Sports, is, as its name suggests, a sports game. These events were already present on computer versions of World Games, but if the game was renamed World of Sports on GX 4000 is simply that, we find here only 4 of the many events present on the original version. So let's go over the 4 parts of the game.<br><br>First of all the bike cross event, entitled BMX. The cap well pressed on the skull, gloved hands gripping the handlebars, you're ready to go. You have a minute to complete the course of moguls, descents, haystacks. Points will be awarded if you browse all this in style (but if metal tubes and wheels that can have style). There is mess in the air.<br><br>In the slalom race, we stay on a track, but it is white and cold because it is snow. Your skier goes with the joystick, skid, acceleration, all responding perfectly to the player's orders. You have 45 seconds to hit the track, and points will score two points per pass. Fun and difficult to make a faultless course in record time.<br><br>The third test is surfing titled Surfing very cleverly. With tanned skin, blond hair in the wind, and the board underfoot, you will have to ride a huge wave and do tricks in the air to score a maximum of points. As in other events, everything happens in a limited time. The character is animated, and the wave is composed of a gradient of pretty blue.<br><br>Accapulco its beaches, its sun, its rocks, and at the top of the rocks, its crackers who plunge dizzying heights shouting \"Yaaaaawaaaayaaaaa\" and crashing in a few meters of water that goes and comes. You may not know it, but you are part of this race of the unconscious. Admit to the best dive possible by avoiding to smash you on the rock face, or to smash your skull at the bottom of the water. After each jump, a bird passes by with a beak, a banner indicating the note that you obtained for your modest performance. If you blow your mouth, a pelican covers his eyes with his wings. Funny. The animation and the neat graphics, make this event too, a success.", "platform": "Amstrad GX4000", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Epyx", "publishers": "Epyx", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76366"}