{
  "url": "https://www.generation-msx.nl/software/topia/legendly-knight/3157/",
  "originalTitle": "대마성",
  "translatedTitle": "Legendly Knight (English)",
  "developedBy": "Topia",
  "year": "1988",
  "system": "MSX",
  "sound": "PSG",
  "kind": "Game",
  "inputDevicesSupported": "Keyboard, Joystick",
  "genre": "Platform",
  "maxPlayers": "1",
  "maxSimultaneous": "1",
  "usesKanji": "",
  "license": "",
  "licence": "Commercial",
  "language": "",
  "note": "This game is obviously inspired by Fairyland Story.\n\nFrom http://www.hardcoregaming101.net/korea/part1/company-topia.htm:\n\nLegendly Knight was the first product of three big names in the Korean gaming history: Lee Sangyoun and Lee Kyuhwan should later form the software house Phantagram, which is very well known internationally for the Kingdom Under Fire series. Lee Sanghun (who was only 15 at the time Legendly Knight was released!) was responsible for many more console games in the first half of the 90s, and was even contracted by Sega to program the Game Gear version of GP Rider.\n\nFor the first time a Korean developed game couldn\u0027t be routed back to a single dominant inspiration, but elements of various action platformers, like Bubble Bobble and Knightmare II are combined into a unique mixture. The player leads a well-rounded (literally) knight through the many single-screen stages of a castle, to rescue the princess, who is featured on the cover but never seen on screen. In the beginning, he is only armed with a small sword, but in the halls of the castle are hidden better weapons, like a throwing lance and several magic spells. Like all other items, those are invisible at first and only reveal their position when a certain spot on the map is hit by a weapon. Until the knight wields ranged weapons, finding those spots can get quite aggravating. If players don\u0027t find the key to the boss\u0027 chambers among the nine rooms of every stage, they\u0027re sent back to the beginning of the current wing of the castle. Good for those who own a pair of spectacles and knows which room the key is to be found, as they reveal it instantly. Other items help the knight to survive multiple passes through the dungeon: A potion restores life points, a ring grants invincibility for a short time. Finally, there\u0027s an armor and a scuba suit, whose use doesn\u0027t really need any explanation.\n\nThe game starts out pretty fun, but later levels grow only more annoying instead of more challenging. Enemies take forever to kill, items can hardly even found anymore without the rare spectacles, and some of the bosses are downright unfair. At least the current status can be preserved through one of the weirdest password systems ever: Passwords aren\u0027t entered in a simple line, but a strange diamond shape.\n\nFrom a technical standpoint, Legendly Knight is pretty solid, although the flickering can get extremely heavy when too many sprites end up on the same scanline. Overall, the game shows a lot of potential, but also a big weakness that should haunt a high percentage of Korean games for many years to come: Balancing.",
  "tagooDatabaseEntry": "",
  "credits": "",
  "mentions": [],
  "conversions": [],
  "releases": [
    {
      "title": "",
      "productCode": "",
      "pirated": "",
      "publisher": "Topia",
      "country": "Korea  (30,000 Won)",
      "media": "ROM "
    },
    {
      "title": "",
      "productCode": "",
      "pirated": "",
      "publisher": "",
      "country": "",
      "media": " "
    }
  ],
  "medias": [
    {
      "url": "//images.generation-msx.nl/cover/5d0281dd.png",
      "type": "image",
      "title": "Photo"
    },
    {
      "url": "//images.generation-msx.nl/cover/f4c5f694.png",
      "type": "image",
      "title": "Photo"
    },
    {
      "url": "//images.generation-msx.nl/cover/ec963b3b.png",
      "type": "image",
      "title": "Photo"
    },
    {
      "url": "",
      "type": "image",
      "title": ""
    },
    {
      "url": "//images.generation-msx.nl/software_title/ab8935ee.png",
      "type": "image",
      "title": "Title screen."
    },
    {
      "url": "//images.generation-msx.nl/software_game/9d8fb3ce.png",
      "type": "image",
      "title": "Game screen."
    },
    {
      "url": "//images.generation-msx.nl/software_extra/2e243637.png",
      "type": "image",
      "title": ""
    },
    {
      "url": "",
      "type": "image",
      "title": ""
    }
  ]
}