{
  "url": "https://www.generation-msx.nl/software/zemina/won-si-in/3243/",
  "originalTitle": "원시인",
  "translatedTitle": "Won-Si-In (English)",
  "developedBy": "Zemina",
  "year": "1991",
  "system": "MSX",
  "sound": "PSG",
  "kind": "Game",
  "inputDevicesSupported": "",
  "genre": "Shoot-\u0027em-up (All)",
  "maxPlayers": "",
  "maxSimultaneous": "",
  "usesKanji": "",
  "license": "",
  "licence": "Commercial",
  "language": "",
  "note": "MSX1 version of \u0026quot;The New Type\u0026quot; (新人類) for NES.\n\nFrom http://www.hardcoregaming101.net/korea/part1/company-zemina.htm:\n\nWonsiin is a port of the Famicom game Shin Jinrui: The New Type (Adventures of Dino Riki in the US), which apparently gave Zemina opportunity to exploit their vertical shmup code even once more. Typically, the scrolling is choppy here, too. There have been several other small compromises, but overall Wonsiin is a decent port of the Knightmare inspired game. Especially some elements that one would think would have been sacrificed on the MSX, most impressively the attacking dinosaur skeletons, are intact. Still, Wonsiin ends after three stages, leaving out the final challenges. Those are based on the first three tilesets, so they probably wouldn\u0027t have used up much space, so maybe Zemina thought them unnecessary.\n\nLike in the NES game, the caveman shoots his way through the autoscrolling vertical stage, upgrading his weapon from spears to stone axes, boomerangs and a flame thrower(!) and has to jump over the odd obstacle to finally reach the bosses. For some reason, those are switched around between stages, and also got their patterns improved a bit. The final boss looks suspiciously similar to Bowser. The game is very tough, but not The Three Dragon Story tough.\n\nIn early 1992, Zemina announced the sequel Wonsiin 2, which didn\u0027t get finished before the development staff left to form Open, and was most likely realized as Wonder Kid.",
  "tagooDatabaseEntry": "",
  "credits": "",
  "mentions": [],
  "conversions": [],
  "releases": [
    {
      "title": "",
      "productCode": "",
      "pirated": "",
      "publisher": "Zemina",
      "country": "Korea ",
      "media": "ROM "
    },
    {
      "title": "",
      "productCode": "",
      "pirated": "",
      "publisher": "",
      "country": "",
      "media": " "
    }
  ],
  "medias": [
    {
      "url": "//images.generation-msx.nl/cover/739beb52.jpg",
      "type": "image",
      "title": "Front"
    },
    {
      "url": "",
      "type": "image",
      "title": ""
    },
    {
      "url": "//images.generation-msx.nl/software_title/94ac33e3.png",
      "type": "image",
      "title": "Title screen."
    },
    {
      "url": "//images.generation-msx.nl/software_game/8250ebb2.png",
      "type": "image",
      "title": "Game screen."
    },
    {
      "url": "//images.generation-msx.nl/software_extra/ee230e87.png",
      "type": "image",
      "title": ""
    },
    {
      "url": "",
      "type": "image",
      "title": ""
    }
  ]
}