{
  "url": "https://www.generation-msx.nl/software/msx-computer-magazine-nl/7-games-squeek/4839/",
  "originalTitle": "7 games: Squeek!",
  "translatedTitle": "",
  "developedBy": "MSX Computer Magazine (NL)",
  "year": "1989",
  "system": "MSX",
  "sound": "PSG",
  "kind": "Game",
  "inputDevicesSupported": "Keyboard",
  "genre": "Variety",
  "maxPlayers": "",
  "maxSimultaneous": "",
  "usesKanji": "",
  "license": "",
  "licence": "Pd/freeware",
  "language": "",
  "note": "A number of entries into the match, which are worth to show to a wider audience.\n\nSqueekie a Pacman-like game for MSX-2 which is brilliant in its simplicity, but gets harder as you progress. Beautiful scenes and you really need to move or be eaten. Squeekie was written by Michel v.d. Dig out Ridderkerk.\n\nJoyrider, MSX 1. You get a new car from dad, that you can get to wreck. Fun, fast and hard. A product of \u0026quot;Pissebedware\u0026quot;, behind which Bas v.d. Werk from Capelle a / d IJssel is hiding.\n\nUno, from Marc Duchi from Harelbeke, Belgium, for MSX-2. It is a kind of card game which one wins by first loosing all once cards. You just have to call \u0026quot;uno\u0026quot; if you only have one card left, otherwise you get another two.\n\nUnder the name Shadow Soft, Roman van der Meulen from Leeuwarden has also been very busy. He programmed a number of games that are also put on this disk: Get-It, Funny-Bunny and Try-Out. Get-It is somewhat similar to the famous Lode Runner and is also fun to play. Funny-Bunny is very original and shows great graphic inventiveness that also has been converted into a playable product. Try-Out is yet another version of Snake, very familiar but still fun to play.",
  "tagooDatabaseEntry": "",
  "credits": "",
  "mentions": [],
  "conversions": [],
  "releases": [
    {
      "title": "",
      "productCode": "B16/1",
      "pirated": "",
      "publisher": "MSX Computer Magazine (NL)",
      "country": "Netherlands  (10 NLG)",
      "media": "Single Side Disk "
    },
    {
      "title": "",
      "productCode": "",
      "pirated": "",
      "publisher": "",
      "country": "",
      "media": " "
    }
  ],
  "medias": [
    {
      "url": "",
      "type": "image",
      "title": ""
    },
    {
      "url": "",
      "type": "image",
      "title": ""
    }
  ]
}