{
  "name": "Bimbo",
  "shortName": "bimbo",
  "description": "<i>Bimbo</i> is an arcade race/pursuit game where the player controls a rabbit (named Bimbo) in a multi-level maze race, hunting for carrots, while being pursued by black 'killer rabbits'.<br><br>(The game plays similar to a racing game, with rabbits instead of cars, and carrots instead of fuel.)<br><br>To slow the competitors down the player can drop green apples in their path, which they stop to eat. There is an energy bar you need to watch, as energy is used by moving, and if it runs out, you lose a life. To keep Bimbo's energy up, you need to find and eat carrots. Extra points are also given for eating clovers.<br><br>Each level has ten carrots hidden in a maze larger than the screen, and you use a carrot-radar to show their location. In addition to the killer rabbits, you have to watch out so Bimbo does not fall into pitholes in the maze. <br><br>Once all ten carrots are eaten, you get to the next level, and the number of enemy rabbits increase by one, up to a maximum of ten pursuers. <br><br>Every fourth level is without enemies, and you just race against the clock while finding the carrots.<br><br>Getting caught by a black rabbit, falling in a pit or running out of time also loses a life; you have five extra lives per game.<br><br>Scoring depends on how fast you found the carrots, and how many extra clovers you ate.<br><br>There is no hall of fame list, only a single high score to compare your current score with.",
  "publishedBy": "Joe the Lion",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/bimbo",
  "visual": "2D scrolling",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Joe the Lion",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}