{
  "name": "Biniax 2.0",
  "shortName": "biniax-20",
  "description": "<i>Biniax 2.0</i> is a remake of the <a href=\"https://www.mobygames.com/game/biniax-2\">Biniax 2</a> game, brought over to the developer's adult <i>Nanako</i> series. Nanako's hometown is surrounded by four powerful countries (Land of Canutoz, Realms of Tuberya, Desert of Kekhalo and Hills of Pasokhulo) whose queens continuously fight over the control over her village. Fed up with it she visits the Oracle just like in the <a href=\"https://www.mobygames.com/game/nanako-descends-to-hell\">previous game</a>. He tells her such disputes can be resolved by playing the game Biniax. It has been used by their ancestors and the gods to settle disputes over land possession without bloodshed. Nanako takes on the challenge to defeat the four queens.<br><br>The game can be played in a regular mode, challenging another character, or in an endless mode. The game is played on a fixed-screen board with room for 35 blocks in a 5x7 layout. Blocks, made up out of two differently coloured pieces each, gradually drop down over the entire width of the field. The player controls Nanako holding a single piece with one colour and can freely move her around the board as long as there is room. To create a match the player moves the active piece directly into a block where one of the two pieces has that colour. Both pieces disappear and the player takes control of the remaining piece, with a different colour. This mechanic is used to clear a field and to prevent it from reaching the bottom which will lead to the end of the game.<br><br>After a certain number of moves an entire row drops in the field and the amount of moves left before the next drop is shown. When stuck and no further move is possible Nanako loses up to three pieces of clothing until she eventually has to surrender the game. The left side of the screen shows the queen Nanako is playing against. A round is won after a set amount of blocks, also displayed on the screen, is removed. The game then moves on to a new stage. Up to three to five boards need to be cleared to win an entire stage and the opponent on the left side of the screen loses a piece of clothing with each round won.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "May 22, 2009",
  "alsoFor": "",
  "genre": "Action, Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/biniax-20",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "May 22, 2009",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/582591-biniax-2-0-zx-spectrum-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}