{
  "name": "Bonanza Bros.",
  "shortName": "bonanza-bros",
  "description": "Mobo and Robo Bonanza are enjoying their favorite television show when the picture crackles and a shadowy figure of a mysterious stranger appears on screen. This figure asks them to collect certain items that he has placed inside various buildings to test his security force. If they return the items successfully, Mobo and Robo will be rewarded. The two of them state that they will get the job done in just three minutes. However, little do they know that each building is packed with security guards who will raise the alarm if they are caught red-handed. Fortunately both Mobo and Robo are equipped with bullets that can knock the guards unconscious for a few seconds. An $100 reward will be given out if Mobo and Robo are apprehended.<br><br>As either Mobo or Robo, you must collect all the treasures before leaving the ten buildings and shoot any security guards that get in your way. Remember that you are under a time limit. An in-game map will help you locate the treasures. There is a bonus stage after three buildings, where the object is to collect the gold bars in a limited amount of time without  one of the three spotlights shining on you. If it is possible, hide behind open doors. If you manage to get all the gold bars, 10,000 points is added to your score. There are three of these bonus stages, but each of them varies.",
  "publishedBy": "U.S. Gold Ltd.",
  "developedBy": "SEGA Enterprises Ltd.",
  "released": "1992",
  "alsoFor": "Amiga, Amstrad CPC, Arcade, Atari ST, Commodore 64, Genesis, Linux, Macintosh, Sharp X68000, SEGA Master System, TurboGrafx CD, Wii, Windows | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/bonanza-bros",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "U.S. Gold Ltd.",
          "developer": "SEGA Enterprises Ltd.",
          "ported": "U.S. Gold Ltd.",
          "country": " United Kingdom",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/473620-bonanza-bros-zx-spectrum-screenshot-load-screen.png",
      "caption": "Load screen"
    },
    {
      "link": "/images/shots/l/473621-bonanza-bros-zx-spectrum-screenshot-game-options.png",
      "caption": "Game options"
    },
    {
      "link": "/images/shots/l/473622-bonanza-bros-zx-spectrum-screenshot-game-start-i-play-the.png",
      "caption": "Game start. I play the bad guy on the left, outside the house. Inside are two robots, maybe more but I didn't get too fat into this game"
    },
    {
      "link": "/images/shots/l/473623-bonanza-bros-zx-spectrum-screenshot-instead-i-moved-the-wrong.png",
      "caption": ".. instead I moved the wrong way and got squashed"
    },
    {
      "link": "/images/shots/l/473624-bonanza-bros-zx-spectrum-screenshot-lost-a-lot-of-lives-coz.png",
      "caption": "Lost a lot of lives 'coz as soon as I stood up I got flattened again. Here I'm making a dash for the back of the house"
    },
    {
      "link": "/images/shots/l/473625-bonanza-bros-zx-spectrum-screenshot-after-each-game-the-tape.png",
      "caption": "After each game the tape has to be rewound and reloaded to play again"
    },
    {
      "link": "/images/shots/l/473626-bonanza-bros-zx-spectrum-screenshot-i-later-found-i-could.png",
      "caption": "I later found I could hide in an alcove and the robots search pattern did not find me"
    },
    {
      "link": "/images/shots/l/473627-bonanza-bros-zx-spectrum-screenshot-the-robots-can-be-shot.png",
      "caption": "The robots can be shot from behind - but they don't stay down for long"
    }
  ],
  "cover": []
}