{
  "name": "Cheman",
  "shortName": "cheman",
  "description": "<i>Cheman</i> is a 2D platform game starring the character Cheman with two variations: Game A and Game B, selectable from the main menu. In Game A players need to help Cheman to get to the concert hall so he can attend the gig of the band The Gods of Metal. The neighbourhood is overrun with batukadas who are part of a dance group that have organized their own festival. To win the game Cheman needs to defeat all batukadas by jumping on top of them and he also needs to locate power medallions. The medallions can be carried, one by one, to one of the several totems around the level.<br><br>The level consists of multiple single-screen rooms connected both horizontally and vertically using the flip-screen mechanic, offering freedom to explore in any direction. The top of the screen displays some information, including the remaining medallions and batukadas. Certain sections are gated and require a key to progress. There is a limited amount of lives and a life is lost almost right away when hit by an enemy, but Cheman immediately respawns in the same room. A life can be regained by collecting a cup of coffee. Controls are limited to moving around, jumping and carrying medallions. Certain enemies can be defeated by jumping on top of them, while with other enemies the same approach can be used to use them as platforms.<br><br>Game B has similar gameplay, but with much tougher platforming. There are no tutorial messages any more and there is completely different setting. There are also new hazards such as spikes. Instead of coffee, diamonds can be collected.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Oct 23, 2019",
  "alsoFor": "Amstrad CPC, NES | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/cheman",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Oct 23, 2019",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/624044-cheman-amstrad-cpc-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC and ZX Spectrum"
    },
    {
      "link": "/images/covers/l/624045-cheman-amstrad-cpc-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC and ZX Spectrum"
    },
    {
      "link": "/images/covers/l/624046-cheman-amstrad-cpc-spine-sides.png",
      "scanOf": "Spine/Sides",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC and ZX Spectrum"
    }
  ]
}