{
  "name": "Cheril of the Bosque",
  "shortName": "cheril-of-the-bosque",
  "description": "<i>Cheril of the Bosque</i> is about the wild girl Cheril who lives in the Badajoz jungle, wearing fur, swinging vines, hunting animals and so on. But one day she is fed up with the life there and decides to go to the big city she has heard about. This game is about her preparing for this journey. She has to walk thirteen days on foot, so she needs to take along enough food. The player has to help her collect thirteen giant nuts so she has enough to go by for her journey.<br><br>Cheril needs to be guided through a level that consists of several single-screen rooms connected both horizontally and vertically using the flip-screen mechanic offering an mount of freedom to explore. She has no means to attack, so she has to avoid enemies or hazards such as spikes, poisonous mushrooms or carnivorous plants. When thirteen nuts have been picked up the game ends right away. She starts with 99 health and the meter is drained as long as she stays in contact with an enemy or a hazard. Sometimes revisiting screens is rewarded with pieces of chicken that restore some health.<br><br>There are also some minor puzzle elements to the game involving locating keys to open gates and pushing boxes to create passages. When leaving the screen and returning the original position of the boxes is restored, so it is not possible to become stuck.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Feb 05, 2010",
  "alsoFor": "Amstrad CPC | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/cheril-of-the-bosque",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Feb 05, 2010",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/583201-cheril-of-the-bosque-amstrad-cpc-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC and ZX Spectrum"
    }
  ]
}