{
  "name": "Cheril in Cadàveriön",
  "shortName": "cheril-in-cadverin",
  "description": "In <i>Cheril in Cadàveriön</i> Cheril meets her nemesis. After she became pretty much a goddess in <a id=\"d0f73d73633fa2111c833339047035539\" href=\"https://www.mobygames.com/search/quick?game=Cheril+the+Goddess\">Cheril the Goddess</a>, this has drawn the attention of the evil witch Soraya, who hatches a plan. Cheril receives an invitation by the beautiful wizard Rigoberto Brioso for a walk in his garden. But when she arrives she senses something is wrong. The wizard is nowhere to be seen and the mansion has turned in an old, dark and decrepit place. Soraya has set a timer on each floor of the mansion. As soon as Cheril enters a floor time starts ticking leading up to an explosion. Even though Cheril has become immortal, she is not invincible and does not want to live in pieces, so she starts running ...<br><br>There are some differences compared to earlier games in the series. The careful platforming has been replaced with a much faster pace and a bird's eye perspective. The mansion consists of four floors and only a minute is provided for each one. Each floor consists of five chambers (single-screen rooms connected using the flip-screen mechanic) and to progress Cheril needs to avoid enemies while pushing statues to solve some minor environment based puzzles. To open a gate to the next room every statue needs to be pushed to its base. It is possible to get stuck and then the room can be reset by activating the blue tile available in each room. Along the way some hourglasses can be collected for a time extension. She starts with ten lives and every collision with an enemy removes one.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Oct 14, 2013",
  "alsoFor": "NES | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/cheril-in-cadverin",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Oct 14, 2013",
          "ean13": "",
          "comments": "The Mojon Twins download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/583979-cheril-in-cadaverion-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}