{
  "name": "Drakkar",
  "shortName": "drakkar",
  "description": "<i>Drakkar</i> is an action game where you take the role of Erik, a viking that has been contacted by the gods and was told to to collect the three objects that will let him become the king of his people: the parchment of wisdom, the Caesar laurels and the trophy of war. But he will not face his path disarmed, the gods have given him a shield that will protect him from the Roman arrows.<br><br>Erik has travelled back in time with a magical drakkar (the ancient viking ship) and has to pass a forest that takes directly to ancient Rome, where there are his goals, but first he must consult the gods (in the game presented in the form of dragons) as the order for collecting the objects varies depending on the game.<br><br>Our hero is armed with a truncheon and shield that has been given by the gods, but the biggest drawback is that such a weapon (plus the axes that he can get later) serves only to certain enemies, while in other occasions he should just avoid any kind of contact with them.<br><br>The first group of enemies, namely the ones that can be destroyed, belongs to bats and the Roman soldiers armed with swords, maces or arches. The second group belongs to snakes and rats from the forest, fish in the ponds, the notes to the angels of heaven, which in addition to subtracting energy to Erik, leave him immobilized at the mercy of their enemies, and chandeliers, that although lethal, can just be found in the rooms near the parchment.<br><br>But not everything was going to be bad for Erik, and so, besides the shield of the gods and axes, he can also recharge part of his energy through pears and fish, succulent delicacies have been distributed for the comprehensive mapping.",
  "publishedBy": "Delta Software, S.L.",
  "developedBy": "Diabolic Soft",
  "released": "1989",
  "alsoFor": "Amstrad CPC, MSX, PC Booter | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/drakkar",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Delta Software, S.L.",
          "developer": "Diabolic Soft",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/483406-drakkar-zx-spectrum-screenshot-this-screen-displays-while.png",
      "caption": "This screen displays while the game loads"
    },
    {
      "link": "/images/shots/l/483408-drakkar-zx-spectrum-screenshot-next-comes-part-of-the-story.png",
      "caption": "Next comes part of the story. This scrolls up the screen to reveal more text.It ends with the company name and copyright information"
    },
    {
      "link": "/images/shots/l/483409-drakkar-zx-spectrum-screenshot-action-keys-can-be-redefined.png",
      "caption": "Action keys can be redefined"
    },
    {
      "link": "/images/shots/l/483410-drakkar-zx-spectrum-screenshot-the-game-starts-with-a-storm.png",
      "caption": "The game starts with a storm at sea which is not good news for Erik's ship (this shot is mid lightning flash)"
    },
    {
      "link": "/images/shots/l/483411-drakkar-zx-spectrum-screenshot-the-game-starts-here-erik-is.png",
      "caption": "The game starts here. Erik is the little yellow man with the big nose on the right. He can move to the left but no further than the tree"
    },
    {
      "link": "/images/shots/l/483412-drakkar-zx-spectrum-screenshot-screen-2-travelling-right-the.png",
      "caption": "Screen 2 travelling right. The white thing reduced Erik's health, shown by the VIDA bar. It cannot be killed with his current weapon."
    },
    {
      "link": "/images/shots/l/483413-drakkar-zx-spectrum-screenshot-one-life-lost-trying-to-kill.png",
      "caption": "One life lost trying to kill an un-killable thing. Erik will re-incarnate at this signpost."
    },
    {
      "link": "/images/shots/l/483414-drakkar-zx-spectrum-screenshot-screen-3-colour-bleed-is-quite.png",
      "caption": "Screen 3 : Colour bleed is quite bad here. Erik is walking into the red patch on the left. The owls seem to be just part of the scenery. The bats must be killed "
    },
    {
      "link": "/images/shots/l/483415-drakkar-zx-spectrum-screenshot-the-red-ground-is-not-some.png",
      "caption": "The red ground is not some fatal river of lava, its just a change in scenery"
    },
    {
      "link": "/images/shots/l/483416-drakkar-zx-spectrum-screenshot-screen-4-more-bats-to-kill.png",
      "caption": "Screen 4 : More bats to kill here, just as well Erik can jump quite high"
    },
    {
      "link": "/images/shots/l/483418-drakkar-zx-spectrum-screenshot-screen-5-the-bats-have-been.png",
      "caption": "Screen 5 : The bats have been killed. Eric cannot pass the tree. What do those confusing sign posts mean?"
    }
  ],
  "cover": []
}