{
  "name": "Durak",
  "shortName": "durak",
  "description": "<i>Durak</i> or Fool is a simple recreation of a card game by the same name that is popular in Russia. Each player is served six cards from the deck and then a trump suite is selected with a card placed under the remaining deck. The goal of the game is to get rid of one's cards. <br><br>Then players trade attacks in turns, where cards can be beaten by either a higher rank or a card with the trump suit. Several cards of the matching rank can be used during the attack, including the ones your opponent used to beat your cards. If a player can't beat the cards, he's gotta take them into his hand and the attacker has to replenish missing cards from the deck. The last remaining player is 'durak'.<br><br>As an additional rule, cards of the same rank can be used to redirect the attack back at the player or pass it down the line if there are several players. This version includes only the basic variety and only supports one player against the computer. The cards feature simple graphics and the game is played using a simple menu with &quot;take&quot;, &quot;beat&quot; and &quot;play&quot; options.",
  "publishedBy": "Copper Feet",
  "developedBy": "Copper Feet",
  "released": "1991",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/durak",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Copper Feet",
          "developer": "Copper Feet",
          "ported": "",
          "country": " Russia",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1016879-durak-zx-spectrum-screenshot-loading-screen.jpg",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/1016880-durak-zx-spectrum-screenshot-game-in-progress.jpg",
      "caption": "Game in progress"
    }
  ],
  "cover": []
}