{
  "name": "ESWAT: Cyber Police",
  "shortName": "eswat-cyber-police",
  "description": "Crime is getting out of control in Liberty City, and to combat the problem, the LCPD establishes a new unit, called ESWAT (Enhanced Special Weapons and Tactics). Police officers who are promoted to this unit wear a cyber-suit that contains state-of-the-art military equipment including two Turbo-Booster Thrusters, extra ammunition, and increased protection. In order to become an ESWAT member, all a dedicated police officer has to do is arrest enough criminal masterminds to progress through the ranks, which include Captain, Assistant Chief, and Chief.<br><br><i>ESWAT: Cyber Police</i> is a horizontal-scrolling beat 'em up where you have to make your way from left to right and defeat a mastermind. There are 15 stages to complete, and have you patrolling through Liberty streets, car yards, stadiums, restaurants, the CBD, construction sites, and boat docks. While you're out on patrol, you can pick up ammunition, and the amount you get varies. For example, on some levels, ammo may be worth 10 bullets, while in others, you may get 60 bullets. Once you have obtained the cyber-suit, you wear it for the duration of the game.<br><br>",
  "publishedBy": "U.S. Gold Ltd.",
  "developedBy": "SEGA Enterprises Ltd.",
  "released": "1990",
  "alsoFor": "Amiga, Amstrad CPC, Arcade, Atari ST, Commodore 64, SEGA Master System | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/eswat-cyber-police",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "U.S. Gold Ltd.",
          "developer": "SEGA Enterprises Ltd.",
          "ported": "Creative Materials",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/118103-eswat-cyber-police-zx-spectrum-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/118102-eswat-cyber-police-zx-spectrum-screenshot-on-patrol.png",
      "caption": "On patrol"
    },
    {
      "link": "/images/shots/l/118101-eswat-cyber-police-zx-spectrum-screenshot-game-start.png",
      "caption": "Game start"
    }
  ],
  "cover": []
}