{
  "name": "Games Pack 1",
  "shortName": "games-pack-1",
  "description": "<i>Games Pack 1</i> is a compilation of 4 original releases not published individually. <br><br><ol>\n<li>Iceberg\n<li>Android Pit Rescue\n<li>Battle\t\n<li>Destroyer\n</ol><br><br>The pack is made out of two different types of games, rescuing and ambushing. <i>Iceberg</i> and <i>Android Pit Rescue</i> are based on the first genre and <i>Battle</i> and <i>Destroyer</i> to the second.<br><br><h3>Iceberg</h3>\nIn <i>Iceberg</i> the player commands an icebreaker and has to save a group of scientific researchers trapped in the freezing waters of the Arctic. <br><br>The icebreaker can only carry one group of people at a time and if it tries to pick another one while doing so, the second group will be killed when touched by the ship.<br><br>After picking a group of people, the player has to drop them at the port located at the upper left corner of the screen. Only then, he may continue his rescuing mission. The colours green and yellow of the icebreaker indicate that the ship is unloaded and prepared to carry people or already carrying a group.<br><br>There are two types of ice formations: pack-ice and icebergs. Pack-ice can be passed through but may generate deadly icebergs in an instance.<br><br><h3>Android Pit Rescue</h3>\nIn <i>Android Pit Rescue</i>  the principle is the same as in <i>Iceberg</i>. The player commands an android that was created to save trapped miners from the mines of the planet <i>Zarqon</i> in the event of flooding.<br><br>There are constant fluxes of water which may flood and freeze certain parts of the mine maze paths. The miners and the android wear safe suits and are protected from the waves of water if standing still, but although the android is coated with a special repellant he still cannot move in water without being destroyed.<br><br>To succeed in his task the android has to rescue all the miners by carrying them one by one to the surface which is represented by the upper part of the screen.<br><br><h3>Battle</h3>\n<i>Battle</i> is a strategic war game where the main goal is to successfully annihilate the enemy's offensive power which is composed by tanks, SAMs and ICBMs and return safely to the player's base. The scenario is randomly generated and takes place on an island composed of rivers and palm trees.<br><br>The player commands a heavy tank armoured with 20 anti-tank missiles and indefinite short range mortars. The anti-tank missiles can destroy anything except palm trees and can be neutralized by the water of the rivers. When fired at enemy positions or tanks the missiles are automatically guided by infra red systems although the player still has to instruct their respective correct range. The mortars can be used simply by moving the player's tank onto the enemy positions.<br><br>The only dangers that can threaten the player's tank are the enemy tanks that come one by one armoured with missiles and mines. The player's tank can resist these attacks no more than 5 times.<br><br>To succeed on the main task of the game, the player has to destroy more than 9 enemy tanks, score higher than 600 points and return the tank to the border which is located at the upper left corner of the screen.<br><br><h3>Destroyer</h3>\nIn <i>Destroyer</i>, which carries the name of the ship the player commands, the goal is to escort some merchant ships that are sailing from the right to the left of the screen and intercept the enemy submarines with dropping charges before they can emerge and fire their precise deadly missiles against them. Every time an enemy missile is allowed to be fired a merchant ship will be lost.<br><br>The player has to destroy 5 enemy submarines before 10 of the merchant ships are sunk. The lower the casualties, the higher the player's score will be.<br><br>The destroyer will not be targeted by the enemy, but itself could pose a deadly threat both to the merchant ship and the player if a collision occurs between them. The game is immediately over if that situation occurs, or if the player wasn't able to safely sail away from the blast of his own charge. These two situations are the only direct threats to the destroyer.<br><br>The enemy submarines can only fire if they are on the surface and then they are represented by the submarine's periscope. If the destroyer is sailing near an enemy submarine, it will not surface. If the player can't visually observe the enemy, he can instead detect them with his sonar, where a higher pitch indicates a short distance an enemy is located from the destroyer. If it turns green, then a ship is in range to blast an enemy submarine by dropping a charge.",
  "publishedBy": "Abacus Programs",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "",
  "genre": "Compilation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/games-pack-1",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Abacus Programs",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1982",
          "ean13": "",
          "comments": "all games were originally published in this compilation"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/839919-games-pack-1-zx-spectrum-screenshot-1-iceberg-instructions.png",
      "caption": "1. Iceberg: Instructions 1."
    },
    {
      "link": "/images/shots/l/839920-games-pack-1-zx-spectrum-screenshot-1-iceberg-instructions.png",
      "caption": "1. Iceberg: Instructions 2."
    },
    {
      "link": "/images/shots/l/839921-games-pack-1-zx-spectrum-screenshot-1-iceberg-starting-the.png",
      "caption": "1. Iceberg: Starting the game.\nThe scenario is randomly generated and originally the only present obstacles on the screen are pack-ice forms which are inoffensive."
    },
    {
      "link": "/images/shots/l/839922-games-pack-1-zx-spectrum-screenshot-1-iceberg-formation-of.png",
      "caption": "1. Iceberg: Formation of icebergs.\nEven if these pack-ice forms can only delay the navigation they too can generate icebergs, which are deadly. The icebreaker is green meaning it's unloaded."
    },
    {
      "link": "/images/shots/l/839923-games-pack-1-zx-spectrum-screenshot-1-iceberg-carrying-a-group.png",
      "caption": "1. Iceberg: Carrying a group of scientists.\nThe colour of the icebreaker turned to yellow meaning that it is presently carrying a group of scientists."
    },
    {
      "link": "/images/shots/l/839924-games-pack-1-zx-spectrum-screenshot-1-iceberg-transporting.png",
      "caption": "1. Iceberg: Transporting Scientists.\nThe icebreaker has to transport the scientists to the base. Only then it can safely continue his rescuing mission."
    },
    {
      "link": "/images/shots/l/839925-games-pack-1-zx-spectrum-screenshot-1-iceberg-drowning-scientists.png",
      "caption": "1. Iceberg: Drowning Scientists.\nIf the icebreaker was already carrying a group of scientists and tried to pick another one, the second will be drowned and the player will be called murderer!"
    },
    {
      "link": "/images/shots/l/839926-games-pack-1-zx-spectrum-screenshot-1-iceberg-titanic-br-after.png",
      "caption": "1. Iceberg: Titanic.\nAfter rescuing many groups of scientists many packs of ice were already turned into icebergs, and that's when the player has to be careful not to become a Titanic."
    },
    {
      "link": "/images/shots/l/839927-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-instructions.png",
      "caption": "2. Android Pit Rescue: Instructions 1."
    },
    {
      "link": "/images/shots/l/839928-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-instructions.png",
      "caption": "2. Android Pit Rescue: Instructions 2."
    },
    {
      "link": "/images/shots/l/839929-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-generating.png",
      "caption": "2. Android Pit Rescue: Generating.\nThe maze inside the mines is randomly generated."
    },
    {
      "link": "/images/shots/l/839930-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-starting.png",
      "caption": "2. Android Pit Rescue: Starting the game.\nThe player's android is located on the upper left corner of the screen identified as green.\n"
    },
    {
      "link": "/images/shots/l/839931-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-rescuing.png",
      "caption": "2. Android Pit Rescue: Rescuing a miner.\nThe android is carrying a miner to the surface. A flow of water is being generated by then."
    },
    {
      "link": "/images/shots/l/839932-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-reaching.png",
      "caption": "2. Android Pit Rescue: Reaching the surface.\nA single miner can only be carried at a time. Miners have special coats (as the android) to prevent them to drown. "
    },
    {
      "link": "/images/shots/l/839933-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-firing.png",
      "caption": "2. Android Pit Rescue: Firing.\nThe android is armoured with 8 charges. They can destroy walls helping the android to carry his rescue when a stream of water blocks a path of the maze."
    },
    {
      "link": "/images/shots/l/839934-games-pack-1-zx-spectrum-screenshot-2-android-pit-rescue-destroying.png",
      "caption": "2. Android Pit Rescue: Destroying the android.\nOnly if the android crosses the water he'll be destroyed."
    },
    {
      "link": "/images/shots/l/839975-games-pack-1-zx-spectrum-screenshot-3-battle-instructions.png",
      "caption": "3. Battle: Instructions 1.\n"
    },
    {
      "link": "/images/shots/l/839976-games-pack-1-zx-spectrum-screenshot-3-battle-instructions.png",
      "caption": "3. Battle: Instructions 2.\n"
    },
    {
      "link": "/images/shots/l/839977-games-pack-1-zx-spectrum-screenshot-3-battle-instructions.png",
      "caption": "3. Battle: Instructions 3."
    },
    {
      "link": "/images/shots/l/839978-games-pack-1-zx-spectrum-screenshot-3-battle-starting-the.png",
      "caption": "3. Battle: Starting the Game.\nA random scenario is generated. Palm trees are represented in green, SAMs in cyan, ICBMs in magenta, the enemy tank in black and water in blue."
    },
    {
      "link": "/images/shots/l/839979-games-pack-1-zx-spectrum-screenshot-3-battle-destruction-br.png",
      "caption": "3. Battle: Destruction.\nThe player's tank is represented in red. A yellow (*) in a red square represents the player is successfully firing at something."
    },
    {
      "link": "/images/shots/l/839980-games-pack-1-zx-spectrum-screenshot-3-battle-miss-br-the-white.png",
      "caption": "3. Battle: Miss.\nThe white (*) in a yellow square represents the enemy tank missed a charge against the player's tank. The white icons represent mines dropped by the enemy tank."
    },
    {
      "link": "/images/shots/l/839981-games-pack-1-zx-spectrum-screenshot-3-battle-being-hit-br.png",
      "caption": "3. Battle: Being Hit.\nThe yellow tank in a red square represents the player was hit. The black tank in a yellow square represent an enemy casualty.\n"
    },
    {
      "link": "/images/shots/l/839982-games-pack-1-zx-spectrum-screenshot-3-battle-being-hit-br.png",
      "caption": "3. Battle: Being Hit.\nYour tank is about to get destroyed."
    },
    {
      "link": "/images/shots/l/839995-games-pack-1-zx-spectrum-screenshot-3-battle-the-game-is-over.png",
      "caption": "3. Battle: The game is over."
    },
    {
      "link": "/images/shots/l/839983-games-pack-1-zx-spectrum-screenshot-3-battle-using-a-mortar.png",
      "caption": "3. Battle: Using a mortar.\nMoving through an enemy SAM is equal to use a mortar against it."
    },
    {
      "link": "/images/shots/l/839984-games-pack-1-zx-spectrum-screenshot-3-battle-game-complete.png",
      "caption": "3. Battle: Game complete.\n9 tanks were destroyed, more than 600 points won, and the player's tank was successfully driven to the border."
    },
    {
      "link": "/images/shots/l/839996-games-pack-1-zx-spectrum-screenshot-4-destroyer-instructions.png",
      "caption": "4. Destroyer: Instructions 1."
    },
    {
      "link": "/images/shots/l/839997-games-pack-1-zx-spectrum-screenshot-4-destroyer-instructions.png",
      "caption": "4. Destroyer: Instructions 2."
    },
    {
      "link": "/images/shots/l/839998-games-pack-1-zx-spectrum-screenshot-4-destroyer-instructions.png",
      "caption": "4. Destroyer: Instructions 3."
    },
    {
      "link": "/images/shots/l/839999-games-pack-1-zx-spectrum-screenshot-4-destroyer-starting-game.png",
      "caption": "4. Destroyer: Starting game - Top line.\nFrom left to right: depth set on the last charge; speed; the sub depth if in range."
    },
    {
      "link": "/images/shots/l/840000-games-pack-1-zx-spectrum-screenshot-4-destroyer-collision.png",
      "caption": "4. Destroyer: Collision with the merchant ship.\nIf your destroyer collides with the merchant ship, it's immediate game over."
    },
    {
      "link": "/images/shots/l/840001-games-pack-1-zx-spectrum-screenshot-4-destroyer-enemy-submarine.png",
      "caption": "4. Destroyer: Enemy submarine firing.\nAt a certain distance from your destroyer, the enemy can emerge and fire a missile. At this time it's represented by its periscope."
    },
    {
      "link": "/images/shots/l/840002-games-pack-1-zx-spectrum-screenshot-4-destroyer-enemy-submarine.png",
      "caption": "4. Destroyer: Enemy submarine firing.\nThe merchant ship was destroyed."
    },
    {
      "link": "/images/shots/l/840003-games-pack-1-zx-spectrum-screenshot-4-destroyer-destroying.png",
      "caption": "4. Destroyer: Destroying yourself.\nYour destroyer's speed wasn't fast enough to avoid the blast of your own charge."
    },
    {
      "link": "/images/shots/l/840004-games-pack-1-zx-spectrum-screenshot-4-destroyer-setting-a.png",
      "caption": "4. Destroyer: Setting a charge.\nWhen an enemy sub is submerged, the player can locate it by the quickness of the beeps of the sonar indicating proximity. This nasty is at 5 level depth."
    },
    {
      "link": "/images/shots/l/840005-games-pack-1-zx-spectrum-screenshot-4-destroyer-enemy-on-target.png",
      "caption": "4. Destroyer: Enemy on target.\nThe destroyer ship turns green when is navigating right above a close zone where the enemy sub is located. This one is at 4 level depth and will be destroyed."
    },
    {
      "link": "/images/shots/l/840006-games-pack-1-zx-spectrum-screenshot-4-destroyer-enemy-carcasses.png",
      "caption": "4. Destroyer: Enemy carcasses.\nA representation of a sunken sub indicating that you successfully charged the bomb within the right depth at the right zone."
    },
    {
      "link": "/images/shots/l/840007-games-pack-1-zx-spectrum-screenshot-4-destroyer-the-explosion.png",
      "caption": "4. Destroyer: The explosion of a charge.\nAnother destroyed target and the moment of the explosion of another successful charge (eventually)."
    },
    {
      "link": "/images/shots/l/840008-games-pack-1-zx-spectrum-screenshot-4-destroyer-the-escape.png",
      "caption": "4. Destroyer: The escape of a Merchant Ship.\nEven though you successfully managed the merchant ship to safely escape, this is not fundamental for the success of the game."
    },
    {
      "link": "/images/shots/l/840009-games-pack-1-zx-spectrum-screenshot-4-destroyer-end-of-game.png",
      "caption": "4. Destroyer: End of game.\nAll the necessary enemy submarines (5) were destroyed and just 2 of 10 merchant ships were sunken by the enemy."
    }
  ],
  "cover": []
}