{
  "name": "Goku Mal",
  "shortName": "goku-mal",
  "description": "<i>Goku Mal</i> is a 2D fangame starring Goku from the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Dragon+Ball\">Dragon Ball</a> series. The Serious Monkey and inventor Eleuterio has become lonely after Cheril left to become a goddess in <a href=\"https://www.mobygames.com/search/quick?game=Cheril+the+Godess\">Cheril the Godess</a>. So he uses his knowledge to build himself a new female friend with a mixture of fluids, vegetables, proteins and phosphor. But something goes wrong and instead of a smart and intelligent girl, a brawny short man with a funny face and spiky hair is created: Goku Mal! Eleuterio becomes angry and throws him into a mountain of dirty socks which he burns right away. But the newly formed Goku Mal awakes in time. Realizing his state the becomes very angry and goes after Eleuterio for revenge.<br><br>This 2D platformer consists of several single-screen rooms connected both horizontally and vertically using the flip-screen mechanic, offering an amount of exploration. Goku completes platforming sections often with moving platforms and ladders. He needs to avoid hazards marked in a bright colour. There are many enemies and these can be shot. Goku has an unlimited amount of bullets and can shoot in four directions. He starts with six lives and additional ones can be earned by picking up large hearts. Enemy collisions remove a life right away. There is a time limit with a timer counting down for the entire game, so Goku needs to move quickly. Every now and then hourglasses can be picked up and these reset the time limit. The game consists of five zones or levels played in succession. There is a secret lab, a sections with sewers, a level with a broken bridge, a church and finally an industrial zone. A password is provided after completing one.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Nov 26, 2013",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/goku-mal",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Nov 26, 2013",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/584041-goku-mal-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}