{
  "name": "Horace Goes to the Tower",
  "shortName": "horace-goes-to-the-tower",
  "description": "<i>Horace Goes to the Tower</i> is an unofficial game starring the iconic Horace character from the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Horace+games\">Horace series</a>. Horace was once a well known computer game star, but money troubles have driven him to other computer systems. The transfer went largely unnoticed and did not make him wealthy, and he was slammed in the gutter press on top of it. In shame he turned himself in and the police put him in the Tower of London where he would be beheaded. There he meets Sabreman who offers him a way out. As a sellout he would go to gamer hell after his death, but he can avoid it by burning the master copies of his C64 games and other sellout titles. Sabreman opens the door for him if he promises to destroy the C64 master copies of <a href=\"https://www.mobygames.com/search/quick?game=Sabre+Wulf\">Sabre Wulf</a> and <a href=\"https://www.mobygames.com/game/underwurlde\">Underwurlde</a> as well.<br><br>This 2D platform game has a single level composed of several single-screen rooms connected both horizontally and vertically using the flip-screen mechanic to offer an amount of exploration. Horace needs to collect ten master tapes and then the game is won right away. He has no means to attack and needs to complete platforming sections while dodging enemies and hazards such as spikes. Some sections are locked and first require an unlocker (a key) to be found.<br><br>He starts with 40 health and every encounter with an enemy or a hazard drains some. By returning to previously visited screens a large red heart can sometimes be picked up, restoring some health. There are also some small environment based puzzle elements involving pushing blocks (checkered and green) to create platforms leading to areas you can otherwise not reach. When stuck pushing platforms the R key can be pressed to reset the room.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Aug 30, 2011",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/horace-goes-to-the-tower",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Aug 30, 2011",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}