{
  "name": "Jinxter",
  "shortName": "jinxter",
  "description": "Aquatania has recently become the land of misfortunes, due to a group of plotting witches. The task of finding five charms and a magic bracelet to put things right falls on you.<br><br>And you need a change of luck, because events in this game often emphasise the slings and arrows of outrageous fortune. You get hit by a car, fall a great height, sprayed with cheese sandwich and more! Being the guinea pig in this strange world will drive you insane - if this jinxed land doesn't do it first. <br><br><i>Jinxter</i> is an interactive fiction with graphics title that takes a realistic world of people and situations, and then plays with the boundaries to create a strange and puzzling world. Characters are all getting on with their own tasks, and getting them to help you is usually a case of making sure something's in it for them.<br><br>Dialogue aims to add a comic touch to proceedings. Puzzles can often be solved in multiple ways, but the most obvious way is not always the correct one. Due to the presence of a Guardian, you can't actually die.",
  "publishedBy": "Rainbird Software",
  "developedBy": "Magnetic Scrolls",
  "released": "1988",
  "alsoFor": "Acorn 32-bit, Amiga, Amstrad CPC, Amstrad PCW, Apple II, Atari 8-bit, Atari ST, Commodore 64, DOS, Macintosh, ZX Spectrum Next | Combined View",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/jinxter",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Rainbird Software",
          "developer": "Magnetic Scrolls",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "5 012439 103035",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/503477-jinxter-zx-spectrum-screenshot-this-screen-is-displayed-after.png",
      "caption": "This screen is displayed after a short delay while the game loads. There's no title screen, no music and no pictures - straight into the detailed text ..."
    },
    {
      "link": "/images/shots/l/503478-jinxter-zx-spectrum-screenshot-that-continues-onto-a-second.png",
      "caption": "... that continues onto a second screen"
    },
    {
      "link": "/images/shots/l/503479-jinxter-zx-spectrum-screenshot-after-exiting-the-bus-the-player.png",
      "caption": "After exiting the bus the player is immediately placed in mortal peril"
    },
    {
      "link": "/images/shots/l/503480-jinxter-zx-spectrum-screenshot-luckily-there-s-a-guardian.png",
      "caption": "Luckily there's a guardian nearby who saves the player from a squishy demise"
    },
    {
      "link": "/images/shots/l/503481-jinxter-zx-spectrum-screenshot-the-guardian-hands-the-player.png",
      "caption": "The guardian hands the player a document and thus begins the mission. "
    },
    {
      "link": "/images/shots/l/503482-jinxter-zx-spectrum-screenshot-it-took-me-ages-to-realize.png",
      "caption": "It took me ages to realize that the document referred a real document that's included in the game's packaging. \nGames can be saved to disk to be continued later"
    }
  ],
  "cover": []
}