{
  "name": "La Aventura Original",
  "shortName": "la-aventura-original",
  "description": "In the mid-'70s, an unusual phenomenon took place: two Americans, <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,15632/\">Willie Crowther</a> and <a href=\"https://www.mobygames.com/search/quick?developer=Don+Woods\">Don Woods</a> wrote <a href=\"https://www.mobygames.com/search/quick?gamegroup=Adventure+versions\">the first text adventure game</a>: it was the Original Adventure and was written in Fortran for a DEC PDP-10 and occupied more than 300 K of memory. It gathered a cult following from the elite programmers who knew how to connect to the data bank where it was located, and like all cults, it had its first &quot;martyrs&quot;; several important programmers were fired after becoming &quot;addicted&quot; to it, found playing it late at night while understood to be working overtime instead.<br><br>In the United States it was the base that inspired <a href=\"https://www.mobygames.com/search/quick?developer=Scott+Adams\">Scott Adams</a> to begin with <a href=\"https://www.mobygames.com/search/quick?company=Adventure+International\">his famous adventures</a>. In Great Britain, <a href=\"https://www.mobygames.com/search/quick?developer=Peter+Austin\">Peter Austin</a>, founder of <a href=\"https://www.mobygames.com/search/quick?company=Level+9+Computing%2c+Ltd%2e\">Level 9</a>, the most prestigious English adventure game company, confessed to be impelled by it from his beginnings as a game designer (<a href=\"https://www.mobygames.com/game/colossal-adventure\">one of his first adventures</a> was a version of the Original Adventure). In Spain, there was a similar story, since the first Spanish company dedicated exclusively to text adventures (Aventuras AD), made its reputation based on a game curiously called &quot;La Aventura Original&quot; (yes, based on the legendary one), the fruit of 8 months of investigation and work.<br><br>This version, aside from being in Spanish, has with several points worth mentioning, such as having more than 100 detailed locations with graphical illustrations; a special routine of exit descriptions (indispensable for guiding the adventurer through this complex world); and the possibility of using accents, &quot;ñ&quot;'s and opening interrogation and exclamation signs. As well, every object of your inventory is described in text and graphic form. The characters also use the PSI system, so they are not mere objects with human names, but will listen to you and respond -- but most importantly, will act according to how you treat them.",
  "publishedBy": "Aventuras AD",
  "developedBy": "Aventuras AD",
  "released": "1989",
  "alsoFor": "Amiga, Amstrad CPC, Atari ST, Commodore 64, DOS, MSX | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/la-aventura-original",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Aventuras AD",
          "developer": "Aventuras AD",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/501776-la-aventura-original-zx-spectrum-screenshot-the-game-s-title.png",
      "caption": "The game's title screen"
    },
    {
      "link": "/images/shots/l/501779-la-aventura-original-zx-spectrum-screenshot-you-go-in-search.png",
      "caption": "You go in search of the great cavern, the origin of legends of fabulous wealth and great danger. Is it myth or a reality? Is it magical? You survival depends on your luck"
    },
    {
      "link": "/images/shots/l/501784-la-aventura-original-zx-spectrum-screenshot-this-is-a-brick.png",
      "caption": "This is a brick cabin surrounded by trees. To the south a rive flows. Time passes. They do not return."
    },
    {
      "link": "/images/shots/l/501785-la-aventura-original-zx-spectrum-screenshot-an-open-field.png",
      "caption": "An open field. From the east comes the smell of sulphur"
    },
    {
      "link": "/images/shots/l/501786-la-aventura-original-zx-spectrum-screenshot-from-the-hill.png",
      "caption": "From the hill you see the volcano. A footpath starts off for the East and to the South it is the forest. You can see the electrical battery. Whoopee - an object!"
    },
    {
      "link": "/images/shots/l/501787-la-aventura-original-zx-spectrum-screenshot-i-appear-to-be.png",
      "caption": "I appear to be well and truly lost in a wood. After five minutes looking for an exit this is effectively game over."
    }
  ],
  "cover": []
}