{
  "name": "Leovigildo",
  "shortName": "leovigildo",
  "description": "In <i>Leovigildo</i> Duke Benoit Rundown, heir of the great house of Salvalamalvadetierra, is in trouble. His addiction to watermelon peanuts has made him squander his entire fortune on the delicacy. He fires his 101 servants and sells all art and valuables to survive. The only one to stay is Leovigildo, his trustworthy butler. The duchess Dona Marie Antoinette is fed up with her husband and plots to take away the only thing left he owns: the deed to his mansion. She tasks Leovigildo with stealing the deed and that puts him in a difficult position: serve his master or betray him for the duchess, whom he is secretly in love with as well. Kidnapping her with chloroform is also an option.<br><br>This 2D game consists of four parts. The first three parts are interactive. They consist of several single-screen rooms connected both horizontally and vertically using the flip-screen mechanic, offering an amount of freedom. In the first part the player controls Leovigildo and the player decides what he needs to do. Based on his actions prior to talking to the duchess four different endings can be reached. He completes platforming sections, dodging enemies with no means to attack. He can pick up boxes and needs this technique to solve some environment based puzzles to progress. There are also several important items to collect and these can be used to interact with the environment. He starts with five lives. Only four items can be carried at all times.<br><br>In the second part eighteen single-screen platform levels need to be completed playing as Leovigildo in an escape through the forest. He is much stronger now and can pick up boxes to launch them at enemies, taking them out. When stuck the room has a special tile that can be used to reset the environment. There is also a time limit per room.<br><br>In the third part the duchess is controlled. Arriving at a circus she reveals her true history and plans. She needs to complete several screens to reach her destination and there are new mechanics. She can carry boxes that are used as a trampoline to reach higher areas. However, carrying a box drains her energy. She starts with 50 energy and the only way to restore it is by picking up a large red heart. She needs to collect three items to complete the sequence.<br><br>The fourth and final chapter contains the ending to the story and does not contain any gameplay. It can only be reached after completing the third chapter, after which a password is provided to access it. Through the different levels there are also many sequences with conversations where the story is furthered.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Nov 05, 2014",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/leovigildo",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Nov 05, 2014",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/584089-leovigildo-zx-spectrum-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/584090-leovigildo-zx-spectrum-full-cover.jpg",
      "scanOf": "Full Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/584088-leovigildo-zx-spectrum-spine-sides.png",
      "scanOf": "Spine/Sides",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}