{
  "name": "Lirus",
  "shortName": "lirus",
  "description": "Lirus is a traditional arcade shoot'em up and it takes place on a sci-fi environment resembling a spacial complex. The game has as its main goal to exterminate an invading occupying force which behaves like a virus. Each one of the virus cells sprawls and multiplies indefinitely until its clusters fill all the empty space of the complex.<br><br>To fight this menace, the player commands a ship armoured with limited ammo. It can be recharged and fixed by capturing two different types of objects found on many places of a scenario. These can be replaced indefinitely by short periods of time at the original locations where they were found. <br><br>To eradicate the virus the player needs to properly manage the acquisition of both energy and ammo. It's also necessary to resort to specific strategies for each scenario since the disposition of the several elements of the game vary from level to level. <br><br>Each scenario can contain one or more types of weapons, strategically crucial for the characteristics of the scenarios. The virus clusters may be initially imprisoned by magnetic walls at the beginning of a level. On this cases it's only by the player's intervention that the viruses are set free.<br><br>The 2015 release added new levels and implementations to the original 1998 version.",
  "publishedBy": "RetroSouls",
  "developedBy": "",
  "released": "1998",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/lirus",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Puzzle elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "RetroSouls",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "1998",
          "ean13": "",
          "comments": "original release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/355168-lirus-zx-spectrum-manual.png",
      "scanOf": "Manual",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}