{
  "name": "Makao",
  "shortName": "makao",
  "description": "<i>Makao</i> is an adaptation of the eponymous card game, a variant of &quot;Mau Mau&quot;. In this four-player game (three players controlled by the computer), each player starts with a hand of five cards. Each turn, a player can place a card on the table, as long as it's of the same suit or value as the card already on the table (or if it is a joker); if the player has no eligible cards, they instead have to draw a card from the drawing stack. Some cards have special rules when placed. Placing an ace allows the player to change the color of the card on the table. Placing a two, a three, or a king forces the next player to draw two, three or five cards; placing a four forces the next player to skip a turn. However, if the next player manages to place a card with the same value, or a joker, the penalties are passed onto the player after him. <br><br>A deal ends when a player has gotten rid of all his cards or has more than 15 cards. All players are then given score, according to the hands of cards they still have, and a new deal can begin. The game ends when one of the player has at least 1000 points; the score is then tallied. ",
  "publishedBy": "",
  "developedBy": "",
  "released": "1985",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/makao",
  "visual": "",
  "gamePlay": "Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/569876-makao-zx-spectrum-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/569877-makao-zx-spectrum-screenshot-the-rules-makao-is-the-kind-of.png",
      "caption": "The rules. Makao is the kind of a game where the rules vary between various playing groups. "
    },
    {
      "link": "/images/shots/l/569878-makao-zx-spectrum-screenshot-playing.png",
      "caption": "Playing"
    },
    {
      "link": "/images/shots/l/569879-makao-zx-spectrum-screenshot-game-is-over-and-i-have-won.png",
      "caption": "Game is over, and I have won"
    },
    {
      "link": "/images/shots/l/880643-makao-zx-spectrum-screenshot-shuffling.png",
      "caption": "Shuffling"
    },
    {
      "link": "/images/shots/l/880644-makao-zx-spectrum-screenshot-selecting-card.png",
      "caption": "Selecting card"
    }
  ],
  "cover": []
}