{
  "name": "Maritrini: Freelance Monster Slayer",
  "shortName": "maritrini-freelance-monster-slayer",
  "description": "<i>Maritrini: Freelance Monster Slayer</i> is a top-down shooter starring Maritrini, a former actress known for her part in the <i>Maritrini, Monster Slayer</i> TV series. Out of her job after a change in management she tries to cash in on her past success by advertising as a real monster hunter, but most of the days are spent getting rid of hangovers and working towards new ones. Until she gets a call from her former boss Paul Duran. His only daughter is kidnapped by an evil organization which experiments to genetically modify human beings and turn them into monsters. Maritrini takes on the job, even though she is suspicious because Duran has never mentioned a daughter before. The hunt will take her to the forest and surroundings of Duran's mansion, his daughter's high school and a set of mines leading to an underground lab.<br><br>This is the first scrolling game by the developer, all previous games use the single-screen flip-screen mechanic to combine rooms into levels. It is also much faster and arcade-like with large numbers of monsters attacking Maritrini all at once. She needs to explore the surroundings and kill everything in sight. Certain sections are locked off and first require a key to be picked up. Enemies often appear in endless waves until the spawning points is destroyed, but she has an unlimited number of bullets. Every now and bottles can be picked up to provide some health. Maritrini starts with 200 health. There are five environments with four stages each, so twenty levels in total. The game keeps track of the score.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Jan 26, 2012",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/maritrini-freelance-monster-slayer",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 26, 2012",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}