{
  "name": "Moggy Adventure",
  "shortName": "moggy-adventure",
  "description": "<i>Moggy Adventure</i> builds on the concept of the 2005 title <a href=\"https://www.mobygames.com/game/moggy\">Moggy</a>, largely by the same developers. After the horrible events of the original game Moggy has done away with the vices of life, especially alcohol and weed. He has travelled the world and now returns to his pink friends in Canutos Forest. Everyone is so happy for his return that they throw a large party with copious amount of alcohol and binge eating. Everyone gets terribly drunk, especially Moggy. When he wakes up he discovers all his friends are spread out in the surroundings, but it is now filled with strange creatures.<br><br>Just like in the first game he needs to collect all his friends by moving over them. Moggy is controlled directly, but once again his alcohol levels make precise control of his movement difficult. The game requires careful navigation to avoid hazards and the creatures roaming the field as Moggy has no means to attack. Unlike the original game with its separate single-screen stages, this game uses the flip-screen mechanic to link many screens together both horizontally and vertically, offering exploration in a single, large environment. There are small environment based puzzle elements. Certain sections are fenced off and require a key to open a gate and progress. In other screens cyan boxes can be pushed to create a passage.<br><br>There are 31 friends to collect and then the game is finished right away. Moggy starts with 99 health, but every encounter with a hazard or an enemy drains it quickly as long as he remains in contact with them.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "2010",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/moggy-adventure",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2010",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}