{
  "name": "Museum Guide",
  "shortName": "museum-guide",
  "description": "<i>Museum Guide</i> is an advergame made for <i>History Worth Playing</i>, a campaign for the Computer Spiele Museum of Berlin in Germany because of the museum's 20th anniversary and the ZX Spectrum's 35th anniversary. The browser version can be played on the official website historyworthplaying.com. To capture and obtain the game for the ZX Spectrum the player has to record a sound on a cassette tape while playing the audio on the official website and then play the tape on a ZX Spectrum to load it.<br><br>The game is set in the museum and some games have gone missing. The player has to locate the games and bring them back to the correct exhibit. At the start of the game there is an option to choose between a male and female character. The character is guided around using four keys. The museum consists of several single-screen rooms connected both horizontally and vertically to offer a large amount of exploration. Items such as discs, boards and cartridges can be picked up and are stored in an inventory with room for four items. There they can be examined and then the player has to find the correct exhibit to put it back. Both items and exhibits have descriptions that can be read for some more information about video games history.<br><br>Many rooms contain enemies that need to be avoided. When the character collides with any of them it disappear but a life is lost. When all five lives are gone the game is over. The game contains a number of secrets and easter eggs involving hidden keys. Players can also discover a code they can enter when purchasing a ticket online with a chance to win a private tour in the museum.",
  "publishedBy": "Gamehouse GmbH",
  "developedBy": "Mojon Twins, The",
  "released": "Mar 01, 2017",
  "alsoFor": "Browser | Combined View",
  "genre": "Action, Educational",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/museum-guide",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Gamehouse GmbH",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Mar 01, 2017",
          "ean13": "",
          "comments": "historyworthplaying.com audio release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/580934-museum-guide-browser-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Browser and ZX Spectrum"
    }
  ]
}