{
  "name": "Mutan Zone",
  "shortName": "mutan-zone",
  "description": "Scorpio was one of the most beautiful space colonies of all the galaxy and its raw materials were one of the fundamental points of the terrestrial wealth. But, one day, the explosion of a Supernova altered the genes of the inhabitants of the planet, turning them into strange beings who hate the human specie and want to destroy it. In such a situation, the Earth space services sent a series of scientists in order to study the mutation and the way for solving it. But they were captured and forced to work for the scorpians in the creation of a definitive weapon that would make disappear our planet of the Solar System. Only a Rainbow-Command could avoid it and your help will be indispensable for the attainment of the mission.<br><br>The game is composed of two parts, within which there are two introduction sub-games that will allow you to obtain some additional lives before starting the game itself. On the first part you will have to face a series of natural obstacles while shooting to everything with strange looks, for that, you count with a laser and a cosmic hammer, but you also should take batteries for your portable radar that informs to you of the enemy situation. <br><br>Once finished this part, you will start the last one, in which you must be careful in not crashing your newly-acquired motorcycle with the multiple obstacles you will find, at the same time you get rid of the mutants, whereas you go to the laboratory where you will have to liberate the kidnapped scientists.  It won't be easy - you will find the head of the mutants who is anxious to give you a warm welcome.",
  "publishedBy": "Opera Soft S.A.",
  "developedBy": "Opera Soft S.A.",
  "released": "1989",
  "alsoFor": "Amstrad CPC, Amstrad PCW, DOS, MSX | Combined View",
  "genre": "Action",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/mutan-zone",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Opera Soft S.A.",
          "developer": "Opera Soft S.A.",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/482923-mutan-zone-zx-spectrum-screenshot-this-screen-displays-while.png",
      "caption": "This screen displays while the game is loading"
    },
    {
      "link": "/images/shots/l/482924-mutan-zone-zx-spectrum-screenshot-the-game-displays-a-side.png",
      "caption": "The game displays a side scrolling help text, ENTER to start, Q &amp; A are up &amp; down, O &amp; P are left &amp; right, SPACE is fire"
    },
    {
      "link": "/images/shots/l/482925-mutan-zone-zx-spectrum-screenshot-the-game-starts-here-with.png",
      "caption": "The game starts here with the spaceman being dropped onto the planet surface. There's a big scanner dish thing above his head that shows a picture in the screen below"
    },
    {
      "link": "/images/shots/l/482926-mutan-zone-zx-spectrum-screenshot-dead-straight-away.png",
      "caption": "Dead straight away!"
    },
    {
      "link": "/images/shots/l/482927-mutan-zone-zx-spectrum-screenshot-spaceman-cannot-walk-past.png",
      "caption": "Spaceman cannot walk past that crater / column and must jump. He cannot maneuver while in the air so must take a run at it and jump while moving"
    },
    {
      "link": "/images/shots/l/482928-mutan-zone-zx-spectrum-screenshot-zapped-by-something-that.png",
      "caption": "Zapped by something that's off-screen! Dead again"
    }
  ],
  "cover": []
}