{
  "name": "Nightwing",
  "shortName": "nightwing",
  "description": "<i>Nightwing</i> is a text adventure set in the far future The player is transported from the far past into the far future. They find themselves in a huge dome that was built by their distant descendants. After many wars the earth lay in ruins it's atmosphere polluted and radioactive so the last remnants of humanity sheltered in this dome where they survived and eventually left for other worlds. That was long ago and the game has taken the player to a time when the earth has healed, the atmosphere is no longer toxic, and the lands outside the dome are inhabited by the barbarous Animen. The player's task therefore is to unlock the dome's secrets and bring mankind back to reclaim their homeworld.<br><br>The game screen is divided horizontally into two parts by an information bar. The top half of the screen contains a picture of the current location while the bottom part contains a description and the response to any command the player enters. The information bar contains one line which lists the available exits and a second line into which all commands are entered.<br><br>This game supports the standard shortcuts such as N/S/E/W for North/South/East/West as well as full sentence analysis which allows the player to issue complex commands such as 'GET THE LIQUID AND GO NORTH AND DRINK THE LIQUID AND GO SOUTH'.",
  "publishedBy": "Softel",
  "developedBy": "Ulterior Motives",
  "released": "1989",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/nightwing",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Graphic adventure, Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Softel",
          "developer": "Ulterior Motives",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/880910-nightwing-zx-spectrum-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/880911-nightwing-zx-spectrum-screenshot-the-first-game-screen-this.png",
      "caption": "The first game screen. This game does not have a series of introductory story screens"
    },
    {
      "link": "/images/shots/l/880912-nightwing-zx-spectrum-screenshot-the-player-s-commands-are.png",
      "caption": "The player's commands are entered above the description"
    },
    {
      "link": "/images/shots/l/880913-nightwing-zx-spectrum-screenshot-all-locations-seem-to-have.png",
      "caption": "All locations seem to have a picture"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/382484-nightwing-zx-spectrum-extras.jpg",
      "scanOf": "Extras",
      "packaging": "Other",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    }
  ]
}