{
  "name": "Nixy the Glade Sprite",
  "shortName": "nixy-the-glade-sprite",
  "description": "Nixy the glade sprite is charged with protecting the Gaia stone. This stone gives life to the vegetation of the forest but it's been corrupted and now flowers, plants, and the once-friendly Mushroom people have been mutated into dangerous monsters. To restore things back to normal, the Gaia stone must be collected and cleansed with water from the sacred pool.<br><br><i>Nixy the Glade Sprite</i> is a traditional collecting based platform exploration game. Gameplay involves moving through a flip-screen map, avoiding enemies that move in set patterns and traversing the platforms using perfectly timed jumps and climbing vines. You must first find and collect the Gaia stone and take it to the Moon Pool. Then you must find and collect ten Moon Blooms and take them to the pool to energise the stone, Finally, you must return the stone back to its rightful place in the forest.<br><br>You start with only three lives and lose one on the first contact with an enemy or from a high fall. More lives can be earned by collecting the red toadstools scattered through the map. However, these are protected by life-taking traps, providing an additional risk vs. reward element.",
  "publishedBy": "Bubblesoft Games",
  "developedBy": "Bubblesoft Games",
  "released": "May 19, 2018",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/nixy-the-glade-sprite",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Bubblesoft Games",
          "developer": "Bubblesoft Games",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "May 19, 2018",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}