{
  "name": "Park Patrol",
  "shortName": "park-patrol",
  "description": "Do you have what it takes to become a park ranger? This game will test you to see if you're really up to the job. You play a park ranger, whose job is to collect twelve items scattered around the park, such as soda cans, bottles, and balls. Unfortunately, getting these items is not as easy as it sounds, as your task gets difficult by swimmers, swamps, snakes, turtles, and ants. To make matters worse, your energy gets depleted quickly, so to restore it, you can either return to your hut, or snatch food off an ant's back in later levels. More often than not, some of the turtles will follow you into the lake. If they enter the lake, you can run them over for 500 points before they decide to jump back out again.<br><br>Besides collecting items, you also must rescue swimmers that are about to drown in the lake. Fail to rescue a swimmer in a limited amount of time, and you'll also drown, and the same can be said if you bump into snakes. Rather than collecting items, you  can also roll on logs. Doing this will earn you 5000 points if you manage to roll for a long time. There are five levels of <i>Park Patrol</i> to complete, and once you complete all of them, the diffculty level gets higher and the game becomes much more difficult. To give you an example, the turtles will stop at nothing to kill you, and there will be more than one swimmer to rescue at once.<br><br>This game can have two players. <i>Park Patrol</i> even provides you with a menu, in which you can alter the number of turtles, ants, swamps, swimmers, and snakes in each of the five levels. With the menu, you can have none of these in every level, but what's the fun of completing a level without any enemies to avoid? Also, you can play as a boy or a girl.\n",
  "publishedBy": "Firebird Software",
  "developedBy": "Activision, Inc.",
  "released": "1987",
  "alsoFor": "Amstrad CPC, Commodore 64 | Combined View",
  "genre": "Action, Simulation",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/park-patrol",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "Activision, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": "Silver 199 Range"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/122417-park-patrol-zx-spectrum-screenshot-the-standard-firebird-loader.png",
      "caption": "The standard Firebird loader - numbers are in hex, which I'm sure confused many a kid"
    },
    {
      "link": "/images/shots/l/122414-park-patrol-zx-spectrum-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/122415-park-patrol-zx-spectrum-screenshot-the-tasks-for-each-level.png",
      "caption": "The tasks for each level"
    },
    {
      "link": "/images/shots/l/122416-park-patrol-zx-spectrum-screenshot-game-start.png",
      "caption": "Game start"
    },
    {
      "link": "/images/shots/l/122413-park-patrol-zx-spectrum-screenshot-on-the-move.png",
      "caption": "On the move"
    },
    {
      "link": "/images/shots/l/122418-park-patrol-zx-spectrum-screenshot-i-hit-that-log-and-i-m.png",
      "caption": "I hit that log, and I'm drowning"
    },
    {
      "link": "/images/shots/l/122419-park-patrol-zx-spectrum-screenshot-merrily-riding-on.png",
      "caption": "Merrily riding on"
    },
    {
      "link": "/images/shots/l/122420-park-patrol-zx-spectrum-screenshot-but-not-for-very-long.png",
      "caption": "But not for very long"
    }
  ],
  "cover": []
}