{
  "name": "Paul McCartney's Give My Regards to Broad Street",
  "shortName": "paul-mccartneys-give-my-regards-to-broad-street",
  "description": "Based on a flop 1984 movie of the same name, you play as music star <a href=\"https://www.mobygames.com/search/quick?developer=Paul+McCartney\">Paul McCartney</a> whose master tape for his new album has been accidentally erased.  The engineers have managed to recover all the tracks except the first single &quot;No More Lonely Nights&quot;.  The group's backer, Rath, has given you until midnight on Saturday to remix the track and McCartney must drive around London searching out 7 band members who each have part of the tune then return to Abbey Road Studios in order to complete the track.  You must read each person's profile to anticipate their movement and go to major London locations or subway Tube stations where they might appear.  A large scale map of London and a Tube map were supplied with the game, the player can use these to help plan their movements in the game.<br><br>The upper two-thirds of the screen usually shows a top-down view of the roads and your car as you guide it.  It then will show a scene when you encounter a band member.  The lower portion of the screen is your car's on-board computer showing an image of the next person to meet, the Tube station they will go in or out of and the time remaining.  There's also a small map of your surrounding location and a blip showing where you are, and also the name of the nearest Tube station and the remaining time and music parts in your quest.  As you drive the roads, you must avoid crashes and Rath's thugs who will be following you.  You must also time your arrivals at the Tube stations because if you arrive too early and wait around too long, a parking authority will clamp your car.",
  "publishedBy": "Argus Press Software Ltd.",
  "developedBy": "Concept Software Ltd.",
  "released": "May, 1985",
  "alsoFor": "Commodore 64 | Combined View",
  "genre": "Puzzle, Racing / driving",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/paul-mccartneys-give-my-regards-to-broad-street",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Argus Press Software Ltd.",
          "developer": "Concept Software Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "May, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/526317-paul-mccartney-s-give-my-regards-to-broad-street-zx-spectrum.png",
      "caption": "The game's title screen displays as the game loads"
    },
    {
      "link": "/images/shots/l/526318-paul-mccartney-s-give-my-regards-to-broad-street-zx-spectrum.png",
      "caption": "This is the main game screen. Here, before the game starts, its being used for controller selection"
    },
    {
      "link": "/images/shots/l/526319-paul-mccartney-s-give-my-regards-to-broad-street-zx-spectrum.png",
      "caption": "The game starts at Abbey Lane Studios."
    },
    {
      "link": "/images/shots/l/526320-paul-mccartney-s-give-my-regards-to-broad-street-zx-spectrum.png",
      "caption": "The next part of the game is spent driving around London.  'A' accelerates the car, 'Z' stops it, and 'N' &amp; 'M' steer it. The player must stay on the road as they search for band members "
    },
    {
      "link": "/images/shots/l/526321-paul-mccartney-s-give-my-regards-to-broad-street-zx-spectrum.png",
      "caption": "As the player enters different areas of London the scanner tracks a different band member"
    }
  ],
  "cover": []
}