{
  "name": "Petulant Poogslay Powerful Parade",
  "shortName": "petulant-poogslay-powerful-parade",
  "description": "<i>Petulant Poogslay Powerful Parade</i> is a 2D game about the girl Lala who, through a series of events, makes it from her school's restroom to the south pole of the planet Pipí Felí by stealing a space ship. Unfortunately the ship crashes and the navigation circuits are scattered over the planet's surface. In order to return she needs to collect the twelve pieces.<br><br>The player guides Lala through an environment with platforming sections, but there is a twist. Because she is at the planet's south pole, everything is reversed. That means the game is played upside-down as if the screen were rotated 180 degrees, but the HUD is still shown normally. Lala starts with 50 health and has no means to attack, so she carefully needs to dodge enemies and avoid coming into contact with hazards. The level consists of several single-screen rooms combined both horizontally and vertically using the flip-screen mechanic, offering an amount of freedom to explore. Every now and then a big red heart can be picked up for some extra health. Certain sections are locked and first require Lala to locate a key. Once all twelve circuits have been found the game is over right away.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Nov 03, 2010",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/petulant-poogslay-powerful-parade",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Nov 03, 2010",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}