{
  "name": "Phantomas en la luna",
  "shortName": "phantomas-en-la-luna",
  "description": "<i>Phantomas en la luna</i> is a fangame starring the android thief character from the 1986 game <a href=\"https://www.mobygames.com/game/phantomas\">Phantomas</a>. It is the fourth fangame based on the franchise by the developer. In this linear 2D title he needs to get past the security systems of Cape Canaveral to steal a rocket and get to the moon after the events of <a href=\"https://www.mobygames.com/game/phantomas-v\">Phantomas V</a>. The game consists of several single-screen rooms. Once a side is reached the next room is loaded using the flip-screen mechanic. The character has three lives and a single hit is fatal.<br><br>In the first phase of the game some minor platforming needs to be done to get past the police androids guarding the base in about ten screens. Phantomas can only move and jump, so he has to dodge the guards or wait until they are out of the way to get past them. Water also needs to be avoided. Sometimes he goes underground where the green ovolvoloids beings roam. Once inside the rocket there are no more enemies and a key needs to be formed by collecting phrases from three terminals and then putting them in the correct order.",
  "publishedBy": "LOKOsoft S.A.",
  "developedBy": "LOKOsoft S.A.",
  "released": "Jun, 1992",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/phantomas-en-la-luna",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "LOKOsoft S.A.",
          "developer": "LOKOsoft S.A.",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jun, 1992",
          "ean13": "",
          "comments": "revised version (download release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}