{
  "name": "Phantomasa",
  "shortName": "phantomasa_",
  "description": "<i>Phantomasa</i> is an adult 2D game about a female android and a fangame loosely based on the universe of the 1986 game <a href=\"https://www.mobygames.com/game/phantomas\">Phantomas</a>. The player controls a female android known as Android LB-A02823BX, built to steal. But something is different, the android is self aware and is quickly discarded as trash. When she wakes up again she has been rescued by a sorcerer. He explains it is not a mistake that she was built as a female robot, but that there is a higher purpose to it. To discover her destiny she has to locate another robot from Andromeda who became intelligent and escaped: Phantomas. She must infiltrate his mansion near Earth-Gamma and attack him with her breasts.<br><br>The robot is guided through several single-screen puzzle environments where pushing boxes is an important element to complete the platforming sections. A next section involved beating a security system using a game of Rock, Paper, Scissors and it ends with a fighting sequence similar to a classic fighting game.<br><br>After the initial release a revision was released. It is a general refinement of the first version of the game for the gameplay and graphics, but the content is largely the same. It makes the game available in both English and Spanish. Even though it is a download release it comes with two files, one for each side of the tape. When opening side two a code of 5 numbers needs to be entered.",
  "publishedBy": "LOKOsoft S.A.",
  "developedBy": "LOKOsoft S.A.",
  "released": "1993",
  "alsoFor": "",
  "genre": "Action, Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/phantomasa_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "LOKOsoft S.A.",
          "developer": "LOKOsoft S.A.",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "1993",
          "ean13": "",
          "comments": "initial version (download release)"
        },
        {
          "publisher": "WOPR2K",
          "developer": "LOKOsoft S.A.",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "1993",
          "ean13": "",
          "comments": "revised version (download release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}