{
  "name": "Phantomasa 2 (v2.0)",
  "shortName": "phantomasa-2-v20",
  "description": "<i>Phantomasa 2 (v2.0)</i> is a revised version of <a href=\"https://www.mobygames.com/game/phantomasa-in-the-land-of-the-grunge-wizards\">Phantomasa in the Land of the Grunge Wizards</a> updated afterwards after the first version was made for a competition which it won. After the events of the first game Phantomasa, the android heroine from Andromeda, hones the thievery she was programmed for by stealing the gold from the Grunge Wizards in Ogonshiro Castle.<br><br>The game consists of a single large level (larger than the one of the original version) made up out of several single-screen rooms connected both horizontally and vertically through a flip-screen mechanic offering some room for exploration. The game consists of 35 screens and each one contains a bag of gold that needs to be picked up. She starts with 100 health and coming in contact with enemies or hazard drains it. She has no means to attack and hazard include lava pits and falling stalactites. Some screens have battery pick-ups that restore health as gold no longer provides a little health as in the first version of the game. There are now also lighting pick-ups that briefly make the character invulnerable. Fall damage is introduced: falling down the height of the entire height of a screen does damage now.<br><br>There are a lot of changes compared to the original version of the game. For movement the game know adds acceleration to the movement, so Phantomasa will gradually accelerate when pressing left or right until she reaches the maximum speed. The same applies to jumping, so a high and long jump first requires speeding up and then pressing the jump button a long time. Enemies also no longer follow a fixed pattern but actively chase the character and they can move through walls.<br><br>There are two versions of the game, one for 48K systems and one for 128K, but any version can be loaded into any Spectrum. The 128K version has 15 additional screens and thus 15 additional bags of money to collect, 200 health instead of 100, AY sound effects instead of beeps, and a different music track. There are also some differences in the graphics and the 128K version is slightly slower and easier.",
  "publishedBy": "Computer Emuzone Silver Games Studio",
  "developedBy": "Mojon Twins, The",
  "released": "2007",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/phantomasa-2-v20",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Computer Emuzone Silver Games Studio",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2007",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/582015-phantomasa-2-v2-0-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/582017-phantomasa-2-v2-0-zx-spectrum-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/582019-phantomasa-2-v2-0-zx-spectrum-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/582016-phantomasa-2-v2-0-zx-spectrum-full-cover.jpg",
      "scanOf": "Full Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/582018-phantomasa-2-v2-0-zx-spectrum-spine-sides.png",
      "scanOf": "Spine/Sides",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}