{
  "name": "Post Mortem",
  "shortName": "post-mortem_",
  "description": "<i>A ZX Spectrum programmer decides to write a new game about death called &quot;Post Mortem&quot;. One night, while working on it, he is visited by death itself that claims him by electrocution. He goes to the Purgatory, where he learns that he must find three items to be able to reincarnate: a &quot;concentrated miracles&quot; pill, a videotape with his future recorded and a reincarnation certificate.</i><br><br>\n<b>Post Mortem</b> is a Spanish adventure game with an icon-based interface similar to the one in <a href=\"https://www.mobygames.com/game/cobras-arc\">Cobra's Arc</a>. The screen is divided in five areas:<br><br>\n- at the top of the screen there is a window for the illustrative graphics;<br><br>- to the right of that there is a window for the collected items;<br><br>- next comes the game title and the developer name;<br><br>- in the middle of the screen there is another window for the text output;<br><br>- and at the bottom there is a tray with all the icons. They are, from left to right:<br><br>\n? Three pairs of feet pointing to the left, upwards and right  to go west, up/north and east respectively;<br><br>? A magnifying glass to look around;<br><br>? Two speech balloons with the words &quot;Sí&quot; and &quot;No&quot; (&quot;Yes&quot; and &quot;No&quot;) to answer occasional questions;<br><br>? A &quot;Help&quot; flag as a on-line hint system;<br><br>? A text description of the keyboard controls: &quot;O - Left P - Right N - Interact;<br><br>? A &quot;STOP&quot; sign as a pause button.<br><br>\nThe player interacts with these icons by moving a animated mouse with the keyboard (<b>O</b> to move it left, <b>P</b> to make it go right) over the desired icon and selecting it by either pressing the <b>SPACE</b> bar or the <b>N</b> key. The game has several instantaneous death screens, with no hint of the danger ahead. Therefore, gameplay is basically a trial-and-error affair, without any form of saving progress.",
  "publishedBy": "Iber Soft",
  "developedBy": "Genesis Soft",
  "released": "1988",
  "alsoFor": "MSX | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/post-mortem_",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Iber Soft",
          "developer": "Genesis Soft",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/485009-post-mortem-zx-spectrum-screenshot-this-screen-displays-as.png",
      "caption": "This screen displays as the game loads"
    },
    {
      "link": "/images/shots/l/485010-post-mortem-zx-spectrum-screenshot-this-is-the-game-s-main.png",
      "caption": "This is the game's main interface screen. In the bottom window is a mouse that's moved left / right by the O &amp; P keys to the appropriate action, SPACE then selects"
    },
    {
      "link": "/images/shots/l/485011-post-mortem-zx-spectrum-screenshot-you-died-electrocuted-when.png",
      "caption": "You died, electrocuted when you plugged in the Spectrum. You get reincarnated to finish the programming of the adventure 'Post Mortem'."
    },
    {
      "link": "/images/shots/l/485012-post-mortem-zx-spectrum-screenshot-your-mission-begins-now.png",
      "caption": "&quot;Your mission begins now. Your soul floats vaguely in the ether. Inert, you see your body. You can only go up.&quot;  So the mouse moves to the upward pointing feet and ..."
    },
    {
      "link": "/images/shots/l/485013-post-mortem-zx-spectrum-screenshot-looks-like-we-re-moving.png",
      "caption": "Looks like we're moving toward the light. This is a feature of the game. Move, get a big picture, then the same picture appears, smaller, in a game window"
    },
    {
      "link": "/images/shots/l/485014-post-mortem-zx-spectrum-screenshot-you-are-in-a-tunnel-without.png",
      "caption": "&quot;You are in a tunnel without end, with a strong glow at the bottom. Notes guide someone mentally. You can go to the bottom, left or right.&quot;"
    },
    {
      "link": "/images/shots/l/485015-post-mortem-zx-spectrum-screenshot-i-turned-left-and-this.png",
      "caption": "I turned left and this greeted me. It does not look good.\nThis is the game-over screen. From here the player is taken to the main interface screen."
    },
    {
      "link": "/images/shots/l/485016-post-mortem-zx-spectrum-screenshot-you-have-fallen-into-the.png",
      "caption": "You have fallen into the clutches of Satan and he has eaten you as programmer soup with garlic. End of the Game. Keystroke. Try again ..."
    },
    {
      "link": "/images/shots/l/485017-post-mortem-zx-spectrum-screenshot-if-i-d-gone-right-instead.png",
      "caption": "If I'd gone right instead of left ...\n&quot;You are in the great plains of heaven. You can go up and right&quot; "
    },
    {
      "link": "/images/shots/l/485018-post-mortem-zx-spectrum-screenshot-going-right-resulted-in.png",
      "caption": "Going right resulted in another trip to Satan. Straight on comes here"
    },
    {
      "link": "/images/shots/l/485019-post-mortem-zx-spectrum-screenshot-you-have-entered-the-control.png",
      "caption": "You have entered the control  and monitoring room of the Guardian Angels.\nYou can go right or forward"
    },
    {
      "link": "/images/shots/l/485020-post-mortem-zx-spectrum-screenshot-next-screen-you-are-in.png",
      "caption": "Next screen.\nYou are in the world of nightmares: there are fauns and monsters. You can go right or forward"
    },
    {
      "link": "/images/shots/l/485021-post-mortem-zx-spectrum-screenshot-who-have-we-here.png",
      "caption": "Who have we here?"
    },
    {
      "link": "/images/shots/l/485022-post-mortem-zx-spectrum-screenshot-einstein-begins-to-tell.png",
      "caption": "&quot;Einstein begins to tell his discoveries. Hold on for a while and do not despair.&quot;  \nThe game actually pauses for a while here"
    },
    {
      "link": "/images/shots/l/485023-post-mortem-zx-spectrum-screenshot-if-the-game-is-going-to.png",
      "caption": "If the game is going to pause then this must be the end / beginning of a section. A good time to save methinks."
    }
  ],
  "cover": []
}