{
  "name": "Psytron",
  "shortName": "psytron",
  "description": "To keep the Betula 5 Installation running smoothly and to protect it, it is run by one central computer called <i>Psytron</i> which keeps the oxygen levels stable, allocates food and duties and most importantly it protects the installation from any saboteurs or attacks. The game allows you to take the role of <i>Psytron</i> but instead of throwing you into the deep end and overwhelm the player, you play over five levels which introduces new tasks on each level to help you get used to the game before you attempt to play level six, The Final Conflict. You must play each level over five times and your aim is to get an average score of 50% or more to move on to the next level. The levels are:<br><br>Level One: The alien invaders are beaming down Tri-Pedroids into the airlock service tunnel which circles the whole base. Their aim is to damage the airlocks so you control a Pursuit Droid which must move along the tunnel and destroy any saboteur you encounter over a period of five minutes. Even though the airlocks get damaged and you can see ships in the sky your only objective is to blast the saboteurs on this level. A radar on the bottom of the screen shows the location of any saboteur and your position.<br><br>Level Two: You now need to defend the skies above and you control a crosshair and you must move around the installation to shoot any alien ship that intends to bomb the installation for five minutes once again. A radar shows the position of the ships and your position as well as if the alien ship is about to bomb.<br><br>Level Three: This level combines level one and two and you must switch between game modes to protect the installation from being bombed or the airlocks being damaged over a period of ten minutes.<br><br>Level Four: As well as defending the installation from the skies and the service tunnel you must now send crews to repair any damaged airlock or building. To help you, you can use freezetime which slows the game down but you only have limited use and also fuel which enables freezetime. You have ten minutes to survive but require an average score of 60%.<br><br>Level Five: The last level before The Final Conflict and now you combine levels one to four as well as having to keep the installation supplies at their correct levels using freezetime once again. You need to take into account the weight the supply ship can carry and the length of time it takes to arrive and unload. Once again you have ten minutes but with an average score of 65%.<br><br>The Final Conflict: You now have full control of <i>Psytron</i> and you must keep the installation running, deploy crews and defend the base from bombings and saboteurs. You try to keep the installation running for as long as possible with the aim being one hour. <br><br>There was actually a competition where the best score won you a Q.L. Computer, with your score combining the score from the Final Conflict and your average scores from the previous levels.",
  "publishedBy": "Beyond",
  "developedBy": "Psy-Sci",
  "released": "1984",
  "alsoFor": "Commodore 64 | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/psytron",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Beyond",
          "developer": "Psy-Sci",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/715456-psytron-zx-spectrum-screenshot-loading-screen.png",
      "caption": "Loading Screen"
    },
    {
      "link": "/images/shots/l/715457-psytron-zx-spectrum-screenshot-protect-the-base.png",
      "caption": "Protect the base"
    },
    {
      "link": "/images/shots/l/715458-psytron-zx-spectrum-screenshot-looking-for-saboteurs.png",
      "caption": "Looking for Saboteurs"
    },
    {
      "link": "/images/shots/l/715459-psytron-zx-spectrum-screenshot-shoot-it.png",
      "caption": "Shoot it"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/302958-psytron-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/302959-psytron-zx-spectrum-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/302960-psytron-zx-spectrum-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    }
  ]
}