{
  "name": "Pub Games",
  "shortName": "pub-games",
  "description": "Pub games is a themed compilation of seven games that have been popular in public houses (drinking establishments) in the United Kingdom for decades. \nThis package is aimed at young teens with the inlay card containing words like 'Here's your chance to find out what it's like in those smoke-filled haunts of adulthood'.\nAll the games are two player games of the 'hot seat' variety - with the exception of Table Football where both players have their own action keys\nThe games can be played either as a 'Full Pub Games Run' - which takes the player(s) through all the games and will take around two hours to complete, or a practice mode which allows the player(s) to select and games in any order.<br><br>Scoring in each game is self explanatory but in the 'Full Pub Games Run' players win £1 per game so the winner at the end of the run is the one with the most money.<br><br>The games are split on both sides of the cassette\nSide 1 - Menu, Darts, Bar Billiards, and Dominoes\nSide 2 - Table Football, Pontoon, Poker, and Skittles<br><br><b>The Menu.</b><br>\nYou must go through this at the start of the game to enter the players names and choose which mode is being used, 'full run' or practice mode. <br><br><b>Darts</b><br>\nThis is played as the best of three games starting at either 501 or 301 and finishing on a double. In the pub run the winner of each game gets £1.\nThere's a choice of colours for the dart board.\nPredefined keys are used to position the cursor over the board to make the shot, however the cursor does not stay in one place, it circles erratically, so the skill is in pressing the 'fire' key as it passes over the desired target. Every dart will hit the board though it is possible not to score by either missing the scoring segments or hitting the wire.\nWhen a shot is made there's a little animation on the left of the screen showing a man throwing a dart. No option for lady players though. <br><br><b>Bar Billiards</b><br>\nThis game is played with eight balls (7 white and one red). The object is to pot any ball down any of the nine holes in the table. The red ball starts on the table and any score made with it in any break is doubled. Any foul shot, a ball returning to baulk, failing to hit another ball in play, or knocking down a skittle, ends and zero's the break. As in the 'real' game, for the first ten minutes balls potted are returned. After that the balls are not returned and the game continues until all balls have been potted. An on-screen timer is provided.\nTo play this game predefined keys are used to position the cue ball, and the cue, and to set the power of the shot.\nOnly one game is played in the 'pub run' and the winner gets £1.<br><br><b>Dominoes</b><br>\nBoth players are dealt a set of dominoes. These are displayed face down so that they cannot be seen. As each player takes their turn they reveal their remaining dominoes, select one, and position it on the board using predefined keys. \nThis is played as the best of three games and the winner of each game gets £1. <br><br><b>Table Football</b><br>\nThis is the only game that requires two players to use the keyboard at the same time.\nThis isn't really a pub game, this is the game that's in fun-fairs, arcades, student common rooms and the break room of some enlightened work places around the world. It's the game with players on metal rods that slide and twist to block and shoot the ball past a keeper into a net.\nPlayers have one key each action up/down/back/kick but they have three lines of 'men' to maneuver. The game gets round this by only applying the action key to the line of men nearest to the ball.\nOnce the ball is kicked it keeps on moving until it is either kicked again or a goal is scored. No getting stuck in the corners here!\nIn the 'Pub Run' this game is played as 'best of three' games with nine balls per game and the winner of each game gets £1, the practice mode is best of three games. <br><br><b>Pontoon</b><br>\nOtherwise known as Blackjack. Each player starts with a £10 stake and you can bet between £1 and £5 per hand.Bets are placed and after the second card is dealt players can twist, stick or buy. No sticking is allowed below 16.\nThe game is played as ten consecutive hands for each player and in the 'Pub Run, the final kitty is added to your score, so this is one game where one player can leap ahead of their opponent.<br><br><b>Poker</b><br>\nHere the player is again given a £10 stake and is dealt a series of ten consecutive hands. Players do not compete against each other, they gamble on the hand they can make. The game pays out 2-1 for a pair, 4-1 for 2 pairs, 6-1 for a flush, 8-1 for a prial (three of a kind), 10-1 for a run, full house, or four of a kind, and 20-1 for a running flush. Again in the 'Pub Run, the final kitty is added to your score which means a good win here with a high value hand could be all a player needs to win the match.\nFor each hand of cards dealt the player chooses which cards to reject. The entire hand can be re-dealt if necessary.<br><br><b>Skittles</b><br>\nIn the 'pub run' this is played as the best of five games with ten balls per game. Players get £1 per win or per draw\nThe practice game is played as five games with two balls per player per game.\nA lane is drawn on screen and six skittles are set at the end of it. The ball to be bowled moves back and forth  at the end of the lane 'nearest' to the player. A target moves back and forth at the end of the lane behind the skittles - but at a different speed. When the two are positioned to give the perfect bowling line the player hits a key, launches the ball and watches the results. It's very hard not to hit something, and equally hard to knock them all down.\nEach player bowls all their balls consecutively. Ten points are awarded per skittle knocked down. All skittles are reset for each ball bowled.<br><br>\n",
  "publishedBy": "Alligata Software Ltd.",
  "developedBy": "Dollarsoft",
  "released": "1986",
  "alsoFor": "Amstrad CPC, Commodore 64 | Combined View",
  "genre": "Compilation, Simulation, Sports",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/pub-games",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Board game, Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Alligata Software Ltd.",
          "developer": "Dollarsoft",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/459202-pub-games-zx-spectrum-screenshot-splash-screen-crediting-alligata.png",
      "caption": "Splash screen crediting Alligata and Dollarsoft. This displays at the start of the load process"
    },
    {
      "link": "/images/shots/l/459204-pub-games-zx-spectrum-screenshot-first-game-screen-names-must.png",
      "caption": "First game screen. Names must be entered. After the first five characters are entered you must wait for the game to accept them before it allows you to enter the second name."
    },
    {
      "link": "/images/shots/l/459206-pub-games-zx-spectrum-screenshot-first-menu-screen-where-either.png",
      "caption": "First menu screen where either a 'Full Pub Run' or practice mode is selected."
    },
    {
      "link": "/images/shots/l/459205-pub-games-zx-spectrum-screenshot-if-practice-mode-is-selected.png",
      "caption": "If practice mode is selected then you get to choose a game from this menu"
    },
    {
      "link": "/images/shots/l/459207-pub-games-zx-spectrum-screenshot-in-practice-mode-after-selecting.png",
      "caption": "In practice mode after selecting a game you're prompted to reposition the tape ready to load that sub game. Here it must be turned over and rewound so that Pontoon can be loaded"
    },
    {
      "link": "/images/shots/l/459208-pub-games-zx-spectrum-screenshot-darts-the-has-loaded-the.png",
      "caption": "Darts : The has loaded. The default dart board is shown along with the instruction to stop the tape."
    },
    {
      "link": "/images/shots/l/459209-pub-games-zx-spectrum-screenshot-darts-other-coloured-boards.png",
      "caption": "Darts : Other coloured boards can be selected. This is the yellow board, there's also a blue board and ...."
    },
    {
      "link": "/images/shots/l/459210-pub-games-zx-spectrum-screenshot-darts-this-one-better-stick.png",
      "caption": "Darts : ... this one. Better stick to the default."
    },
    {
      "link": "/images/shots/l/459211-pub-games-zx-spectrum-screenshot-darts-the-game-screen-before.png",
      "caption": "Darts : The game screen before the any play has taken place. Top of screen shows how many darts remain to be thrown, bottom centre shows the score of each dart"
    },
    {
      "link": "/images/shots/l/459212-pub-games-zx-spectrum-screenshot-darts-there-s-a-little-animation.png",
      "caption": "Darts : There's a little animation as each dart is thrown. Frank just scored 100. the score of each dart is shown at the bottom of the screen."
    },
    {
      "link": "/images/shots/l/459214-pub-games-zx-spectrum-screenshot-darts-going-for-the-winning.png",
      "caption": "Darts : Going for the winning shot and I've hit the wire! How close is that"
    },
    {
      "link": "/images/shots/l/459213-pub-games-zx-spectrum-screenshot-darts-frank-s-just-won-all.png",
      "caption": "Darts : Frank's just won all three games. The game does let you know when you need a double. "
    },
    {
      "link": "/images/shots/l/459215-pub-games-zx-spectrum-screenshot-bar-billiards-the-basic-table.png",
      "caption": "Bar Billiards : The basic table at the start of the game. The red ball is on it's spot and all the skittles are standing"
    },
    {
      "link": "/images/shots/l/459216-pub-games-zx-spectrum-screenshot-bar-billiards-the-game-s.png",
      "caption": "Bar Billiards : The game's been going a while. There's another ball on the table and the cursor, that's the 'x', is positioning the cue ball for the next shot "
    },
    {
      "link": "/images/shots/l/459217-pub-games-zx-spectrum-screenshot-bar-billiards-the-cue-ball.png",
      "caption": "Bar Billiards : The cue ball has been positioned, it's the red ball that's been recently potted. The yellow bar below the table is the shot power setting that's retained from the previous shot"
    },
    {
      "link": "/images/shots/l/459221-pub-games-zx-spectrum-screenshot-bar-billiards-just-knocked.png",
      "caption": "Bar Billiards : Just knocked a skittle down, for demonstration purposes only, however that's a foul and it wiped out the massive break I'd scored."
    },
    {
      "link": "/images/shots/l/459302-pub-games-zx-spectrum-screenshot-dominoes-the-game-has-loaded.png",
      "caption": "Dominoes : The game has loaded"
    },
    {
      "link": "/images/shots/l/459303-pub-games-zx-spectrum-screenshot-dominoes-the-game-begins.png",
      "caption": "Dominoes : The game begins"
    },
    {
      "link": "/images/shots/l/459304-pub-games-zx-spectrum-screenshot-dominoes-the-game-selects.png",
      "caption": "Dominoes : the game selects the first tile and places it. The blank piece at the bottom of the screen is used later when a player selects a tile"
    },
    {
      "link": "/images/shots/l/459305-pub-games-zx-spectrum-screenshot-dominoes-player-1-s-tiles.png",
      "caption": "Dominoes : Player 1's tiles are on the left, hidden. Instructions are on the right. Tiles played are in the centre"
    },
    {
      "link": "/images/shots/l/459306-pub-games-zx-spectrum-screenshot-dominoes-now-player-2-is.png",
      "caption": "Dominoes : Now Player 2 is not looking, Player 1 reveals their tiles and selects one. The selected tile is coloured red."
    },
    {
      "link": "/images/shots/l/459307-pub-games-zx-spectrum-screenshot-dominoes-positioning-the.png",
      "caption": "Dominoes : Positioning the selected tile means moving the red box around the screen. Note that the tile at the bottom shows the value of the tile being moved."
    },
    {
      "link": "/images/shots/l/459311-pub-games-zx-spectrum-screenshot-dominoes-tile-positioned.png",
      "caption": "Dominoes : Tile positioned, ready for player 2 to come take their turn"
    },
    {
      "link": "/images/shots/l/459229-pub-games-zx-spectrum-screenshot-table-football-start-screen.png",
      "caption": "Table Football : start screen"
    },
    {
      "link": "/images/shots/l/459230-pub-games-zx-spectrum-screenshot-table-football-game-in-progress.png",
      "caption": "Table Football : Game in progress. The ball's at the top on the right and the blue player is going to miss it"
    },
    {
      "link": "/images/shots/l/459231-pub-games-zx-spectrum-screenshot-table-football-this-is-what.png",
      "caption": "Table Football : This is what a goal looks like. Notice the players names have changed"
    },
    {
      "link": "/images/shots/l/459232-pub-games-zx-spectrum-screenshot-pontoon-once-loaded-the-game.png",
      "caption": "Pontoon : Once loaded the game does what any good dealer would do - it spends a minute shuffling the cards"
    },
    {
      "link": "/images/shots/l/459233-pub-games-zx-spectrum-screenshot-pontoon-the-main-game-screen.png",
      "caption": "Pontoon : The main game screen, Frank to go first"
    },
    {
      "link": "/images/shots/l/459289-pub-games-zx-spectrum-screenshot-this-holding-screen-is-for.png",
      "caption": "This holding screen is for poker but you get one before every game"
    },
    {
      "link": "/images/shots/l/459268-pub-games-zx-spectrum-screenshot-poker-and-the-dealer-starts.png",
      "caption": "Poker : and the dealer starts by shuffling"
    },
    {
      "link": "/images/shots/l/459290-pub-games-zx-spectrum-screenshot-poker-after-the-shuffle-it.png",
      "caption": "Poker: After the shuffle it's Frank to play first - and here's where my version of the program resets itself"
    },
    {
      "link": "/images/shots/l/459298-pub-games-zx-spectrum-screenshot-skittles-pretty-flashing.png",
      "caption": "Skittles : Pretty flashing lights before each game. This is the only game that does this"
    },
    {
      "link": "/images/shots/l/459299-pub-games-zx-spectrum-screenshot-skittles-start-of-match-once.png",
      "caption": "Skittles : Start of match. Once a key is pressed the player gets to bowl all their balls consecutively"
    },
    {
      "link": "/images/shots/l/459300-pub-games-zx-spectrum-screenshot-skittles-player-1-ball-2.png",
      "caption": "Skittles : Player 1, ball 2. Note :  All the skittles reset.  A running total is maintained on the display either side of the lane"
    },
    {
      "link": "/images/shots/l/459301-pub-games-zx-spectrum-screenshot-skittles-near-the-end-of.png",
      "caption": "Skittles : Near the end of the match here. This is a good shot. Most of the skittles are up in the air"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/195500-pub-games-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/195501-pub-games-zx-spectrum-inside-cover.jpg",
      "scanOf": "Inside Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/195499-pub-games-zx-spectrum-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/195498-pub-games-zx-spectrum-media.jpg",
      "scanOf": "Media",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    }
  ]
}