{
  "name": "Robore",
  "shortName": "robore",
  "description": "<i>Robore</i> is a 2D title re-using graphics from one of the developer's earlier games, the 1992 title <a href=\"https://www.mobygames.com/game/phantomas-v\">Phantomas V</a>. It stars Phantomas, the android thief from the 1986 ZX Spectrum title <a href=\"https://www.mobygames.com/game/phantomas\">of the same name</a>. Just like one of the developer's earlier games <a href=\"https://www.mobygames.com/game/petulant-poogslay-powerful-parade\">Petulant Poogslay Powerful Parade</a> the story starts in a restroom. Thinking he is going to be robbed for a change Phantomas wants to surprise an intruder, but it turns out to be Yasmina, princess of Monrania and model of swimsuits without face from the Venca catalog. She had been looking for him for months as his home country in the Andromeda Galaxy is invaded by the yellow Robores that want to turn everything into a polka dot pattern. Phantomas decides to take them on.<br><br>It is a fast-paced arcade title with several stages each set in a single-screen environment. It always starts with Phantomas and a number of Robores in his vicinity who immediately and relentlessly chase him. To win a stage Phantomas needs to lure them into a green rhomboid trap so they are defeated. He can also use the sides of the screen to appear on the other side. Later stages introduce a variety of obstacles that hinder his movement and make it more difficult to dodge the Robores. He starts with five lives and touching a single Robore immediately makes him lose a life and ends the stage.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Nov 08, 2010",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/robore",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Nov 08, 2010",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/583255-robore-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}