{
  "name": "Serpenti",
  "shortName": "serpenti",
  "description": "<i>Serpenti</i> is a kind of combination of <i>Pac-Man</i> and <i>Snake</i>. The player controls a snake (designed more like a segmented bug or larva) and is chased around a 2D maze by three enemy snakes. The goal is to eat/kill all the enemy snakes, then the player can advance to the next level, which presents a new maze.<br><br>The player's snake can move a little bit faster than the enemies. A snake can pass through itself and enemy snakes can pass through each other. A snake can bite an opposing snake, with several rules of growing, shrinking or dying, depending on the bite location and snake sizes. There is one more character that looks like a small frog, that appears from time to time and jumps around the maze (it can pass through walls). A snake can eat the frog and grow by one piece. <br><br>Snakes can only grow up to a maximum length, and a snake that is reduced to its head instantly dies. From time to time, a snake will automatically lay an egg, losing one piece from its tail. Opposing snakes can eat the eggs (and grow), and the frog can eat them too. Enemy eggs can hatch into new snakes during a level (if not eaten quickly). The player's egg only hatches at the end of the level, becoming an extra life.",
  "publishedBy": "",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/serpenti",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/930929-serpenti-zx-spectrum-screenshot-start-screen-menu.png",
      "caption": "Start screen / menu"
    },
    {
      "link": "/images/shots/l/930930-serpenti-zx-spectrum-screenshot-playing-in-black-white-mode.png",
      "caption": "Playing in black &amp; white mode (default)"
    },
    {
      "link": "/images/shots/l/930931-serpenti-zx-spectrum-screenshot-playing-in-color-mode.png",
      "caption": "Playing in color mode"
    }
  ],
  "cover": []
}