{
  "name": "Sgt. Helmet: Training Day",
  "shortName": "sgt-helmet-training-day",
  "description": "<i>Sgt. Helmet: Training Day</i> is the second game in the <i>Sgt. Helmet</i> series and this release has very different gameplay. It is inspired by <a href=\"https://www.mobygames.com/game/ikari-warriors\">Ikari Warriors</a> and was developed in five days. After the rescue mission in Khartadmocia in the first game he receives a new mission to blow up the Defence Ultra Large Level (DULL) computer by setting five bombs. This mission is set on a training field designed by his fellow soldiers so he would not get bored.<br><br>The game consists of a single, large level with many single-screen rooms linked together vertically. Sgt. Helmet needs to progress upwards, collect five explosives and reach the computer at the very end. Once the bombs are set he needs to return to the base and then the game is completed. He can move around freely in eight directions and needs to shoot soldiers that spawn endlessly. He starts with 20 lives and 99 bullets. Additional ammo can be picked up by walking over a gun icon. There are deadly electrical fences that can be shot to create a passage and boulders can be moved as well, leading to small sections of environment based puzzle-solving. Certain gates can only be opened by locating key cards first.<br><br>Next to the different colours the NES version has an additional mission. It was made available as a download and as a limited cartridge release through a crowdfunding campaign.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Sep 24, 2013",
  "alsoFor": "Amstrad CPC, NES | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/sgt-helmet-training-day",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Puzzle elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Sep 24, 2013",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/580190-sgt-helmet-training-day-amstrad-cpc-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC, NES and ZX Spectrum"
    }
  ]
}