{
  "name": "Shaken but Not Stirred",
  "shortName": "shaken-but-not-stirred",
  "description": "Shaken but Not Stirred is a text adventure video game in which agent James Bond must stop Dr. Death and his plot to destroy London with a nuclear warhead. Playing as James Bond, the player has a choice of three weapons that can be used throughout the game. The game contains two stages. In the first stage, the player traverses the world in search of clues -- presented to the player as anagrams -- that will determine the location of Dr. Death's island lair. During the first stage, the player must battle against various enemies, including priests, muggers, and midgets. At any time during the first stage, the player may return to London to restore lost health and ammunition. In the second stage, Bond must explore Death's island to locate the entrance to his underwater lair. Upon entering, the player must navigate through a three-dimensional maze (switching from the text adventure gameplay) to find the room with the warhead, while avoiding Death's steel-fisted henchman, Paws. Once the warhead is found, the player must complete a puzzle mini-game to diffuse it. Bond then returns to London to enjoy a vodka martini, &quot;shaken, not stirred.&quot;",
  "publishedBy": "Richard Shepherd Software Ltd",
  "developedBy": "Richard Shepherd Software Ltd",
  "released": "1982",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "1st-person, Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/shaken-but-not-stirred",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Richard Shepherd Software Ltd",
          "developer": "Richard Shepherd Software Ltd",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}