{
  "name": "Shark Trap",
  "shortName": "shark-trap",
  "description": "<i>Shark Attack</i> is a single player arcade style game pitting the player, in the form of a scuba diver, against an array of  four sharks which cannot be killed. Your diver is attempting to corral the sharks, using armor nets which he employs to isolate them, and by that action create larger and larger areas of the screen which are free of danger. This continues until there has been created a safe zone, constituting roughly 85% of the screen, allowing movement to the next level. <br><br>This task is complicated by the necessity of avoiding the attacks which are triggered by close proximity to these creatures, as well as the unnerving tendencies for the sharks to chew their way through the nets to freedom. In the early levels, the sharks are moving about lazily. One strategy that can prove effective early is to quickly corral the sharks in a small area, then to very rapidly lay your nets around the remainder of the screen.<br><br>As the game evolves, the sharks become more rapid in their movements, and become able to home in on the diver from a greater distance. Additionally, with each new level, 2 octopi are added to this equation. They are stationary, but their 8 moving tentacles can spell disaster if touched while trying to lay your nets. For each level you are allowed three lives with which to accumulate net laying points. When you reach the 10.000 point level the sharks suddenly acquire increased speed, darting about and creating havoc with your net laying capacity. They will occasionally attack and eat half an octopus, but the remaining half still remains dangerous to your touch.\n",
  "publishedBy": "Romik Software Ltd",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "BBC Micro, Electron, VIC-20 | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/shark-trap",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Romik Software Ltd",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/714995-shark-trap-zx-spectrum-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/714996-shark-trap-zx-spectrum-screenshot-there-s-the-sharks.png",
      "caption": "There's the sharks"
    },
    {
      "link": "/images/shots/l/714997-shark-trap-zx-spectrum-screenshot-making-enclosures.png",
      "caption": "Making enclosures"
    },
    {
      "link": "/images/shots/l/714998-shark-trap-zx-spectrum-screenshot-killed.png",
      "caption": "Killed"
    }
  ],
  "cover": []
}