{
  "name": "Shoot Redux: Marifrisky Space Warrior",
  "shortName": "shoot-redux-marifrisky-space-warrior",
  "description": "<i>Shoot Redux: Marifrisky Space Warrior</i> is a short game made for the Computer EmuZone (CEZ) mini-games label to quickly test new programming techniques in small projects. It is a top-down shooter simulating a vertically scrolling environment with parallax. It was also created as a remake of <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,1020793/\">Bert Vierstra's</a> 1984 ZX Spectrum title <a href=\"https://www.mobygames.com/search/quick?game=Shoot%21\">Shoot!</a> The character Marifrisky is running out of coffee and now she has to go to the grocery store of La Otra Punta, a planetary system located across the domains of the evil Petruccio Prepuccio. The minions of Prepuccio have been led to believe Marifrisky was actually the winner of the Venus wet T-shirt contest of the previous year. Fortunately their missiles are loaded with coffee, so when they burst it spills into space and it will keep Marifrisky awake until she reaches the grocery store.<br><br>The player controls a space ship that can only be steered left or right. The third key is used to shoot. Yellow stars and space ships appear from the top of the screen. The ships need to be avoided or can be shot. The goal of the game is to destroy all the red stones that hover near the top of the screen. A point is scored for each destroyed red stone. If a player's shot hits an enemy missiles additional red stones appear. The game keeps track of the score and the high scores as well. A small number of lives is provided and the goal is to destroy all red stones. At the start of the game a difficulty level is chosen, ranging from 0 to 9.",
  "publishedBy": "Computer Emuzone Games Studio",
  "developedBy": "Mojon Twins, The",
  "released": "2008",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/shoot-redux-marifrisky-space-warrior",
  "visual": "2D scrolling",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Computer Emuzone Games Studio",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2008",
          "ean13": "",
          "comments": "downlaod release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/583090-shoot-redux-marifrisky-space-warrior-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}