{
  "name": "Sir Ababol II: The Ice Palace",
  "shortName": "sir-ababol-ii-the-ice-palace",
  "description": "<i>Sir Ababol II: The Ice Palace</i> is the sequel to the 2010 game <a href=\"https://www.mobygames.com/game/sir-ababol\">Sir Ababol</a>. It runs on the new La Churrera 4.0 / MT Engine MK 2 engines which introduce a number of improvements and new features, also demonstrated in the original game's updated release <a href=\"https://www.mobygames.com/game/sir-ababol-dx\">Sir Ababol DX</a> that was released along with this title.<br><br>After the events of the first game Sir Ababol has settled in the lands of Belchite. One day three rooks visit him with a message from king Yoghourteric, from the lands of Freezia, province of Badajoz, with a plea for help. He jumps on his horse Anastasio but is not sure what his quest is until he uses Minstrelbook, the Middle Ages social network, and discovers eight young princes and princesses are held prisoner in six towers in Fridgeland. There is more to it as a device has been invented which can extract knowledge for the brain. The king wants to use this device against the evil alchemist-druid Alastor de la Babucha, duke of Freezia and marquis of Fridgeland who challenge him to a game of gañote, but it accidentally turns every young prince into a bat. In this game Sir Ababol needs to climb the six towers of Freezia, fight the royalty-turned-bats and then destroy Alastor.<br><br>In most versions of the original game Ababol could only avoid enemies. In the sequel he has a sword right away which he can use to strike in any direction. When hit by his sword, enemies freeze. The sword also adds to the platforming with some environment based puzzling as it can shatter blocks of ice and glass. Certain blocks can also be carried and put down somewhere else. The game consists of fixed-screen rooms linked horizontally and vertically offering some exploration. Often keys need to be located to open gates to progress. Some blocks contain items such as coins or extra lives. The bats at the top of the towers are tough opponents that can take multiple hits and fly around the screen in an irregular pattern. Some fights have two bats at the same time. There is a shop at the top of every tower to use the coins collected on the way to buy extra lives or a password.<br><br>When played on a 128K Spectrum system there is vastly improved music and sound compared to the 48K system.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Dec 25, 2014",
  "alsoFor": "Amstrad CPC | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/sir-ababol-ii-the-ice-palace",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Dec 25, 2014",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/580275-sir-ababol-ii-the-ice-palace-zx-spectrum-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/580596-sir-ababol-ii-the-ice-palace-zx-spectrum-full-cover.jpg",
      "scanOf": "Full Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/580595-sir-ababol-ii-the-ice-palace-zx-spectrum-spine-sides.png",
      "scanOf": "Spine/Sides",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}