{
  "name": "Sir Ababol DX",
  "shortName": "sir-ababol-dx",
  "description": "<i>Sir Ababol DX</i> is an updated release of the 2010 game <a href=\"https://www.mobygames.com/game/sir-ababol\">Sir Ababol</a> and made available to coincide with the release of the sequel <a href=\"https://www.mobygames.com/game/sir-ababol-ii-the-ice-palace\">Sir Ababol II: The Ice Palace</a>. The core game is largely identical, but with a number of changes largely made possible by bringing over the team's MT Engine MK 1 to the new MT Engine MK 2. The health/lives has been tweaked to be more in line with the later Amiga and NES versions of the first game: instead of the large amount of lives only a few are provided with some pieces of chicken to gain additional ones. All sections that contain water, which was able to hit Ababol multiple times, now have spikes instead of water.<br><br>Overall the game becomes more difficult that way with not much room for mistakes. In the original game all enemies needed to be avoided except for the Amiga and NES versions where it became possible to jump on top of them. This game does it differently. All enemies still need to be avoided until a magical item is located and from then on it becomes possible to kill them.<br><br>The new engine also brings about better collision detection and faster gameplay. After collecting the 24 flowers the game now provides an entirely new underwater stage with bright colours comprising 20 new screens in total, and different gameplay through a swimming mechanic for that level.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Dec 25, 2014",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/sir-ababol-dx",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Dec 25, 2014",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/580263-sir-ababol-dx-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "ZX Spectrum"
    }
  ]
}