{
  "name": "Sol Negro",
  "shortName": "sol-negro",
  "description": "A millenarian spell, transmitted from parents to children, turned the muscular Bully into a fish and the indomitable Mónica into a hawk. Every full moon one of them suffers a transformation and the other recovers his normal form, which prevents them to be together. Only an extraordinary phenomenon can break the spell, something as extraordinary as a sun eclipse... the Black Sun. In order to break the spell, Bully must free Mónica (the hawk) of her cage for, turned he in fish, arrive on time together at the sacred submarine temple of the sun, a grotto located beyond the borders of the city submerged of Hidrionis, just at the moment in which the moon is embraced with the sun and a huge shade crosses the planet.<br><br>The objective in the first stage is to rescue Mónica, turned a hawk, for which you will have to locate the key of the cage on which she is imprisoned and go to rescue her, you will count with the help of a jet pack and a M-92 rifle laser; once done, face together with her all the dangers until arriving at the magical palace. The second stage is developed at the heart of the ocean. Mónica must protect Bully in his form of fish and together with him arrive at the submarine grotto. Mónica counts with an aquatic propellent and a hydro leak pistol with which she will have to defended herself against the submarine enemies.",
  "publishedBy": "Opera Soft S.A.",
  "developedBy": "Opera Soft S.A.",
  "released": "1988",
  "alsoFor": "Amiga, Amstrad CPC, Amstrad PCW, Atari ST, DOS, MSX | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/sol-negro",
  "visual": "2D scrolling",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Opera Soft S.A.",
          "developer": "Opera Soft S.A.",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/58756-sol-negro-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cassette Case",
      "country": "Spain",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/58755-sol-negro-zx-spectrum-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cassette Case",
      "country": "Spain",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/58757-sol-negro-zx-spectrum-media.jpg",
      "scanOf": "Media",
      "packaging": "Cassette Case",
      "country": "Spain",
      "platforms": "ZX Spectrum"
    }
  ]
}