{
  "name": "Sports-A-Roni",
  "shortName": "sports-a-roni",
  "description": "<i>Alternative World Games</i> Is a series of mini games based around the theme of an Olympiad for the non-sporting minded. It is intended to be a spoof on all serious sporting simulations.<br><br>There are eight games in this compilation, some are one player and some are two player. The minimum number of players names that can be entered is two, the game setup insists that a second player is named because thee are two player games. The maximum number of names that can be entered is six.<br><br>The game menu selection screen has been designed to look like a bank of nine TV screens. Each TV is displaying a sporting channel name. The player selects the channels to be played and presses 'Fire'. This causes an animation to commence on the appropriate TV. The player can select either one or all eight games. Channel nine is used to allow the player to select between competition and practice modes.<br><br>At the end of each game the scores are displayed. After the last game has been played the game displays the medal table, there can be a long wait while the game reads to the end of the tape to find this program.\nWhen the selected game(s) have been played the medal table is displayed and the gaming session is over. If further game-play is desired, e.g. for a rematch, then the whole game must be reloaded and the player selection process has to be repeated.<br><br>The eight games are;<ul>\n<li>The Sack Race<br>\nThis race takes place in Mexico. The objective is to be the first across the finish line. Speed is achieved by pressing left / right alternately while using the up / down keys to steer around open man-hole covers which are the obstacles in this event. Players can play against each other or the computer.\n<br></li>\n<li>The Pile Of Plates<br>\nThis race takes place in Pisa, Italy. Each player takes it in turn to compete. before starting the up / down keys are used to set the number of plates to be carried. Once set the same keys are used to determine the speed at which the character moves, too fast and plates will fall. A countdown timer starting at 100 is used to ensure that the race is completed in a reasonable time. When the characters are moving the left / right keys can be used to move the characters arms to counteract the wobble.\nPoints are scored for speed of completion, number of plates carried and points are lost for plates dropped, thus a player who carries eight plates across successfully will score more points than a player who started with 30 and finished with 14.\n<br></li>\n<li>Boot Throwing<br>\nThis event takes place in Italy by the Colosseum. Each player has three turns to see who can throw the boot the furthest. There is a choice of a throwing the boot empty, which means it's lighter so the player has longer to build up speed, or a boot full of water, which is heavier but takes more effort.\nThe player uses the left / right action keys to make the character swing the boot around in a circle. A power indicator shows how much speed has built up, swing for too long however and your character will get tired and lose that turn. At an appropriate point in the swing the player presses 'FIRE'. When all players have thrown the furthest throw wins.\n<br></li>\n<li>River Jump<br>\nEach player has three attempts to pole-jump the river. The character starts with their pole up in the air. When the 'FIRE' key is pressed the character automatically starts to run, the player has no control over the speed. However, the pole is heavy and will tend to droop, if it hits the ground while the character is still running then they will fall over. To be successful the character must approach the river with the pole in a (near) horizontal position, if this achieved the character will automatically dip their pole into the river and the player must hit 'FIRE' again to make them release their grip on the pole and, hopefully, land on the other side.</li>\n<li>Pole Climbing<br>\nThis takes place in a castle courtyard and it is a two player game. Players can play each other or they can play against the computer. It is a time limited game where the object is to climb to the top of the pole, collect a bottler of champagne, and safely slide back down inside 5 minutes.\nThe player makes their character climb by repeatedly pressing a specific sequence of up / fire / down. For every failed sequence the character slides down the pole, too many slides and the character will fall off., Descending too quickly with the champagne will cause the player to drop the bottle and fail.\n</li>\n<li>Run Up The Wall<br>\nThis game takes place in Venice. Players take it in turns to have three runs at the wall. As they reach the wall they must jump, this causes the character to run up the wall. A further action key is required to place the hat on the wall and, if all keys are pressed done correctly, the character's hat will stick to the wall and the highest hat wins.\nThe player does not, however, start with a hat. In their run up to the wall they must time their approach so that they are beneath a passing parrot who drops one hat per run. A jump without a hat does not score.\n</li>\n<li>Pillow Fight<br>\nThis game is set in Venice, Italy. It is a two player game which starts with the players pairing off against each other or against the computer. \nThe two characters are on board a gondola and must bash each other with pillows until time expires or one falls in the water.\nThere are specific key combinations for right / left / overhead strikes and blocks. Points are scored for successful strikes. The player who falls into the water loses. Each player fights only once, the player with the highest number of points wins\n</li>\n<li>Pogo Stick<br>\nThis game is set in Greece among the ruins of a ancient temple. It is a timed event. each player takes turns to pogo around the ruins popping balloons. Points are scored for each balloon burst and the course must be completed in nine minutes, fifty-nine seconds.\n</li></ul>",
  "publishedBy": "Gremlin Graphics Software Limited",
  "developedBy": "Novotrade Software Kft.",
  "released": "1987",
  "alsoFor": "Amstrad CPC, Commodore 64 | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other), Side view",
  "theme": "",
  "nonSport": "",
  "sport": "Olympiad / mixed sports",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/sports-a-roni",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Gremlin Graphics Software Limited",
          "developer": "Novotrade Software Kft.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "5 013658 019664",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/461998-sports-a-roni-zx-spectrum-screenshot-splash-screen.png",
      "caption": "Splash screen"
    },
    {
      "link": "/images/shots/l/462014-sports-a-roni-zx-spectrum-screenshot-setup-player-2-control.png",
      "caption": "Setup : Player 2 - control selection.\nI want to play on my own but I'm forced to do this because some games are two playerThe game then compares the scores for the sack race"
    },
    {
      "link": "/images/shots/l/462000-sports-a-roni-zx-spectrum-screenshot-setup-what-do-a-gramophone.png",
      "caption": "Setup : What do a gramophone, a parrot, and a box have in common? \nWell they all appear on what is possibly the most confusing menu screen ever"
    },
    {
      "link": "/images/shots/l/462002-sports-a-roni-zx-spectrum-screenshot-setup-all-players-must.png",
      "caption": "Setup : All players must have a country. When selected the parrot gets the record from the box and plays the appropriate anthem."
    },
    {
      "link": "https://www.mobygames.com/images/shots/l/462003-sports-a-roni-zx-spectrum-screenshot-setup-after-setting-up.png",
      "caption": "Setup : After setting up the players it's time to select the games. This is the menu. Use the up/down keys to adjust the channel selector, bottom right"
    },
    {
      "link": "/images/shots/l/462157-sports-a-roni-zx-spectrum-screenshot-setup-games-are-selected.png",
      "caption": "Setup : Games are selected by adjusting the channel selector in the lower right. 1 - 8 games can be selected. animations play on each selected TV screen"
    },
    {
      "link": "/images/shots/l/462204-sports-a-roni-zx-spectrum-screenshot-at-the-end-of-an-event.png",
      "caption": "At the end of an event, in this case Wall Climbing, scores for that event are displayed.\nhere are six human players' scores. All pretty poor."
    },
    {
      "link": "/images/shots/l/462145-sports-a-roni-zx-spectrum-screenshot-when-all-selected-events.png",
      "caption": "When all selected events are complete the game displays a medal table like this. Here only one event was played, it would mean more if a couple of events had been played in the same session"
    },
    {
      "link": "/images/shots/l/462006-sports-a-roni-zx-spectrum-screenshot-sack-race-first-task.png",
      "caption": "Sack race :  First task is to select who will play who. Here having been forced to enter a second player becomes a pain because they have to race as well."
    },
    {
      "link": "/images/shots/l/462008-sports-a-roni-zx-spectrum-screenshot-sack-race-i-got-fed-up.png",
      "caption": "Sack race :  I got fed up of waiting for the music to end,so I started - the game gave me a false start and I went back to racing / waiting again"
    },
    {
      "link": "/images/shots/l/462009-sports-a-roni-zx-spectrum-screenshot-sack-race-the-race-is.png",
      "caption": "Sack race :  The race is finally underway. Mashing the keyboard to build up speed. The little dog ios a 'humerous' touch, it pulls you forward / back / gets in the way etc"
    },
    {
      "link": "/images/shots/l/462010-sports-a-roni-zx-spectrum-screenshot-sack-race-fallen-over.png",
      "caption": "Sack race :  Fallen over a manhole. \nThe computer rarely - if ever - has this problem"
    },
    {
      "link": "/images/shots/l/462011-sports-a-roni-zx-spectrum-screenshot-sack-race-the-computer.png",
      "caption": "Sack race :  The computer wins ( but I think the race was fixed )"
    },
    {
      "link": "/images/shots/l/462131-sports-a-roni-zx-spectrum-screenshot-plate-carrying-the-player.png",
      "caption": "Plate Carrying : The player starts with one plate. Team G.B. have decided to start with 8 plates. The race has just begun. The character has started moving and I just let it run"
    },
    {
      "link": "/images/shots/l/462134-sports-a-roni-zx-spectrum-screenshot-plate-carrying-as-the.png",
      "caption": "Plate Carrying : As the character approaches the edge of the screen the background shifts. This is as far as the scenery goes. Now the character walks off screen to complete the race"
    },
    {
      "link": "/images/shots/l/462137-sports-a-roni-zx-spectrum-screenshot-plate-carrying-once-the.png",
      "caption": "Plate Carrying : Once the character is off the screen the points for that run are displayed"
    },
    {
      "link": "/images/shots/l/462140-sports-a-roni-zx-spectrum-screenshot-plate-carrying-the-usa.png",
      "caption": "Plate Carrying : The USA starts with 31 plates. They soon start to wobble. Then they start to fall"
    },
    {
      "link": "/images/shots/l/462141-sports-a-roni-zx-spectrum-screenshot-plate-carrying-and-they.png",
      "caption": "Plate Carrying : and they kept on falling. The character cannot move while this is happening, but the clock does stop so there's no double penalty of dropping plates and extra time."
    },
    {
      "link": "/images/shots/l/462147-sports-a-roni-zx-spectrum-screenshot-boot-throwing-full-boot.png",
      "caption": "Boot Throwing : Full Boot selected. The default  is 'Empty Boot'"
    },
    {
      "link": "/images/shots/l/462149-sports-a-roni-zx-spectrum-screenshot-boot-throwing-using-left.png",
      "caption": "Boot Throwing : Using left/right keys I build up speed. Timing is very important here. The power bar in the lower right shows how I'm doing"
    },
    {
      "link": "/images/shots/l/462150-sports-a-roni-zx-spectrum-screenshot-boot-throwing-try-for.png",
      "caption": "Boot Throwing : Try for too long to get to max power and you'll tire"
    },
    {
      "link": "/images/shots/l/462152-sports-a-roni-zx-spectrum-screenshot-boot-throwing-attempt.png",
      "caption": "Boot Throwing : Attempt 2,plenty of power but the boot's going the wrong way"
    },
    {
      "link": "/images/shots/l/462154-sports-a-roni-zx-spectrum-screenshot-boot-throwing-get-it.png",
      "caption": "Boot Throwing : Get it right and the boot will fly, success on the final attempt at 7.5m"
    },
    {
      "link": "/images/shots/l/462155-sports-a-roni-zx-spectrum-screenshot-boot-throwing-usa-throw.png",
      "caption": "Boot Throwing : USA throw - I liked the sock coming out of the boot on landing, occasionally it's a small animal that waves."
    },
    {
      "link": "/images/shots/l/462158-sports-a-roni-zx-spectrum-screenshot-river-jump-a-pole-vault.png",
      "caption": "River Jump : A pole vault must have been planned because that's what this game is called at the top of the screen"
    },
    {
      "link": "/images/shots/l/462160-sports-a-roni-zx-spectrum-screenshot-river-jump-do-not-lower.png",
      "caption": "River Jump : Do not lower your pole too soon because your character tires faster and falls down"
    },
    {
      "link": "/images/shots/l/462162-sports-a-roni-zx-spectrum-screenshot-river-jump-the-character.png",
      "caption": "River Jump : The character automatically plunges their pole into the water"
    },
    {
      "link": "/images/shots/l/462165-sports-a-roni-zx-spectrum-screenshot-river-jump-but-if-you.png",
      "caption": "River Jump : But if you don't let go fast enough you slide down the pole into the water"
    },
    {
      "link": "/images/shots/l/462185-sports-a-roni-zx-spectrum-screenshot-pole-climb-selection.png",
      "caption": "Pole climb : selection of opponents. During the game  the king in the background waves from time to time and the raven flies across the screen."
    },
    {
      "link": "/images/shots/l/462188-sports-a-roni-zx-spectrum-screenshot-pole-climb-rocky-has.png",
      "caption": "Pole Climb : Rocky has moved up a bit, but now he's slipped back down and he's fallen off."
    },
    {
      "link": "/images/shots/l/462190-sports-a-roni-zx-spectrum-screenshot-pole-climb-thirty-minutes.png",
      "caption": "Pole Climb : thirty minutes play and this is as high as I managed to get!. Time up, game over, I give up"
    },
    {
      "link": "/images/shots/l/462191-sports-a-roni-zx-spectrum-screenshot-run-up-the-wall-start.png",
      "caption": "Run up the wall : Start for player 1\nThe black blob in front of me is two parrots.\nSpeed is built by repeatedly pressing the UP key. The power bar, lower right, shows how well I'm doing"
    },
    {
      "link": "/images/shots/l/462192-sports-a-roni-zx-spectrum-screenshot-run-up-the-wall-chase.png",
      "caption": "Run up the wall : Chase them too far and you've blown it because they double back and drop the hat behind you. No you cannot move backwards"
    },
    {
      "link": "/images/shots/l/462197-sports-a-roni-zx-spectrum-screenshot-run-up-the-wall-timing.png",
      "caption": "Run up the wall : Timing the jump is critical or else the character runs into the wall, and ends up like this. "
    },
    {
      "link": "/images/shots/l/462201-sports-a-roni-zx-spectrum-screenshot-run-up-the-wall-timed.png",
      "caption": "Run up the wall : Timed it right, This is a successful jump! Just have to press the right combination of keys to make the hat stick..."
    },
    {
      "link": "/images/shots/l/462203-sports-a-roni-zx-spectrum-screenshot-run-up-the-wall-the-hat.png",
      "caption": "Run up the wall : The hat has stuck to the wall but it does not count. I need to make a clean landing but I'm not that good. It took 90 minutes to get this far!"
    },
    {
      "link": "/images/shots/l/462206-sports-a-roni-zx-spectrum-screenshot-pillow-fight-this-is.png",
      "caption": "Pillow Fight : This is the start where all the human players have paired off against each other"
    },
    {
      "link": "/images/shots/l/462207-sports-a-roni-zx-spectrum-screenshot-pillow-fight-this-is.png",
      "caption": "Pillow Fight : This is a blow to the near side, you can also strike to the far side and from overhead"
    },
    {
      "link": "/images/shots/l/462209-sports-a-roni-zx-spectrum-screenshot-pillow-fight-here-comes.png",
      "caption": "Pillow Fight : Here comes an overhead shot"
    },
    {
      "link": "/images/shots/l/462211-sports-a-roni-zx-spectrum-screenshot-pillow-fight-after-a.png",
      "caption": "Pillow Fight : After a good combination the opponent wobbles, a good blow now will knock them overboard"
    },
    {
      "link": "/images/shots/l/462214-sports-a-roni-zx-spectrum-screenshot-pillow-fight-yup-they.png",
      "caption": "Pillow Fight : Yup! they're gone"
    },
    {
      "link": "/images/shots/l/462215-sports-a-roni-zx-spectrum-screenshot-pogo-start-for-player.png",
      "caption": "Pogo : Start for player 1"
    },
    {
      "link": "/images/shots/l/462216-sports-a-roni-zx-spectrum-screenshot-pogo-the-objective-is.png",
      "caption": "Pogo : The objective is to burst the balloons. That's the first one gone."
    },
    {
      "link": "/images/shots/l/462221-sports-a-roni-zx-spectrum-screenshot-pogo-balloon-2-appears.png",
      "caption": "Pogo :  Balloon 2 appears to the left of balloon 1, I had to go back a bit to get to it, but try as I might I could not get up onto that wall"
    },
    {
      "link": "/images/shots/l/462217-sports-a-roni-zx-spectrum-screenshot-pogo-it-s-not-easy-to.png",
      "caption": "Pogo : It's not easy to navigate this 3D landscape and it's easy to get stuck. When your character hits a wall or when you stop mashing buttons, they just sit down and sulk.In the end I gave up too"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/197061-sports-a-roni-zx-spectrum-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/197062-sports-a-roni-zx-spectrum-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    },
    {
      "link": "/images/covers/l/197063-sports-a-roni-zx-spectrum-media.jpg",
      "scanOf": "Media",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "ZX Spectrum"
    }
  ]
}