{
  "name": "Starblitz",
  "shortName": "starblitz",
  "description": "<i>Starblitz</i> is a clone of the arcade shooter <a href=\"https://www.mobygames.com/game/arcade/defender\">Defender</a> where the player is in control of the last remaining craft of the battlefleet, the Starblitz. It flies over the surface of a planet protecting humans from the marauding aliens. Landers, Mutants, Swarmers, Baiters, Bombers and Pods, threaten you and the humans and the job at hand is to decimate the alien invasion force while protecting the humans.<br><br>Landers will swoop down and attempt to grab your humans and if they succeed in bringing them to the top of the screen, they will turn into a crazed alien that will hunt the player craft down.\nIf you manage to shoot the Lander, the human is released and you should catch it with your ship and bring it to the ground. If you don't catch it, the human will be killed once it reaches the ground.\nYour craft has a laser cannon and a limited amount of smart bombs that kill every alien on screen. It can fly in both horizontal directions, the landscape scrolling along with the movement until it wraps around and up/down. At the top there is a long range scanner that can be used to anticipate where on the screen the aliens appear.<br><br>If you hit any alien or an alien projectile, then you lose one of three lives, once all lives are spent, it's game over.",
  "publishedBy": "Softek International Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/starblitz",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Softek International Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/851748-starblitz-zx-spectrum-screenshot-loading-screen.png",
      "caption": "Loading Screen"
    },
    {
      "link": "/images/shots/l/851749-starblitz-zx-spectrum-screenshot-hall-of-fame.png",
      "caption": "Hall of fame"
    },
    {
      "link": "/images/shots/l/851750-starblitz-zx-spectrum-screenshot-game-start.png",
      "caption": "Game start"
    }
  ],
  "cover": []
}