{
  "name": "Trabajo Basura",
  "shortName": "trabajo-basura",
  "description": "<i>Trabajo Basura</i> is a 2D game about the programmer Amador who is fed up with his job and his incompetent boss. After receiving a scolding by his boss in front of the executive committee he plans his revenge. He stays late in the office working on a idea to get him fired.<br><br>The game is played in a single level composed of several single-screen rooms connected both horizontally and vertically using the flip-screen mechanic, offering an amount of freedom. There are two tasks Amador has to complete. First he needs to collect fifteen disks with documents related to his boss' project management. These disks need to be taken to a terminal to load them. Amador can only carry one disk at a time, but every floor has a terminal, next to the stairs. Next there are also 25 apprentices that need to be taken out to collect the physical evidence they carry. This is done by jumping on their heads.<br><br>Amador has to complete platforming sections and he has no means to attack. Enemies such as spiders and flying creatures need to be dodged. Amador starts with fifteen lives and every enemy collision removes one. Certain sections are locked and require a key to be picked up first. When both tasks are completed Amador can return to his office and enjoy his victory.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Oct 25, 2011",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/trabajo-basura",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Oct 25, 2011",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}