{
  "name": "Tuareg",
  "shortName": "tuareg",
  "description": "Life has never been too quiet in Marrakesh, but lately things have been getting harder.  Ait-Amar, the daughter of the sultan, has been kidnapped by a group of Berbers and they are forcing him to give half of his fortune within three days.<br><br>But as you know, with every kidnapping of a princess there's always an hero ready to rescue her, and Ben-Yussef, our protagonist, has been the chosen one this time to get into the labyrinthine and dangerous Kasbah in order to affront the kidnappers and rescue the handsome daughter of the Sultan.<br><br>As expected, it will be a hard task, because although there are some local residents willing to give clues in exchange for some coins, others will try to steal everything they can. Besides these two types of Moors, deep in the Kasbah there are women to which you can steal their money, policemen that will take your weapons, and thugs who are at the doors of the houses that you must enter in order to find the princess.<br><br>Like any human being, Ben-Yussef must replenish his strength in inns and restaurants and rest in hotels or hostels, implying a significant economic outlay. You can also buy new weapons in the armouries prepared to this effect, bearing in mind that depending on the neighborhood, these elements may also vary in price.",
  "publishedBy": "Topo Soft",
  "developedBy": "Topo Soft",
  "released": "1988",
  "alsoFor": "Amstrad CPC, MSX | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/tuareg",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Topo Soft",
          "developer": "Topo Soft",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/505763-tuareg-zx-spectrum-screenshot-the-first-screen-that-is-shown.png",
      "caption": "The first screen that is shown is the TopoSoft logo. This is followed by the game's title screen."
    },
    {
      "link": "/images/shots/l/505764-tuareg-zx-spectrum-screenshot-the-game-s-main-menu-there-is.png",
      "caption": "The game's main menu. There is no option to redefine keys here"
    },
    {
      "link": "/images/shots/l/505765-tuareg-zx-spectrum-screenshot-there-s-a-guard-on-almost-every.png",
      "caption": "There's a guard on almost every door. It is not possible to get past them, well I could not manage it, because they actively block your way"
    },
    {
      "link": "/images/shots/l/505766-tuareg-zx-spectrum-screenshot-with-the-guard-out-of-the-way.png",
      "caption": "With the guard out of the way the player can enter the building"
    },
    {
      "link": "/images/shots/l/505767-tuareg-zx-spectrum-screenshot-not-a-good-place-to-be-lots.png",
      "caption": "Not a good place to be. Lots of bad guys shooting things"
    },
    {
      "link": "/images/shots/l/505768-tuareg-zx-spectrum-screenshot-game-over.png",
      "caption": "Game over!"
    },
    {
      "link": "/images/shots/l/505769-tuareg-zx-spectrum-screenshot-the-player-can-travel-down-the.png",
      "caption": "The player can travel down the alleys as well as along the streets"
    },
    {
      "link": "/images/shots/l/505770-tuareg-zx-spectrum-screenshot-some-in-game-characters-have.png",
      "caption": "Some in-game characters have messages"
    },
    {
      "link": "/images/shots/l/505771-tuareg-zx-spectrum-screenshot-the-tuareg-always-fires-to-the.png",
      "caption": "The Tuareg always fires to the side, no matter which way he is facing"
    }
  ],
  "cover": []
}