{
  "name": "The Ultimate First Communion Simulator",
  "shortName": "ultimate-first-communion-simulator",
  "description": "<i>The Ultimate First Communion Simulator</i> is a game made for the 2008 CSS Crap Games Compo which it won. The game simulates elements from the First Communion ceremony of Christian tradition. The game consists of three scenes all played on a single screen. The player only interacts using the space bar. Only a limited number of lives is provided and a life is lost each time the required action is not performed successfully.<br><br>The first scene simulates the line of children on their way to the church. As the line advances the player need to press the space bar at right moment to make the character advance, making sure not to collide with the person in front or behind.<br><br>In the second scene the player's character receives the communion from a reverend suffering from Parkinson's disease. His arm shakes wildly so the player needs to time carefully to receive the communion when it is exactly in front of the character's mouth.<br><br>The third scene is about leading a life of virtue and resisting temptation. The player's character is waiting at the bus stop and needs to resist looking when the wind lifts up a girl's skirt revealing her panties.",
  "publishedBy": "Mojon Twins, The",
  "developedBy": "Mojon Twins, The",
  "released": "Jan 30, 2008",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/ultimate-first-communion-simulator",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Mojon Twins, The",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 30, 2008",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}