{
  "name": "Viaje al centro de la napia",
  "shortName": "viaje-al-centro-de-la-napia",
  "description": "<i>Viaje al centro de la napia</i>, a play on words on <i>Journey to the Centre of the Earth</i>, is a game that takes place inside the skull of the boy Miguelito. He is not very smart so his mother takes him to a special class for adolescents still in 2nd grade at the primary school. He feels lost between so many books and geniuses, so he gets bored, drifts off and gets a severe headache. Fortunately he has a brand new box of pencils, so to pass the time he starts to bury them inside his nose. He already held several records for this activity in kindergarten, so now he wants to attempt to get the whole box of twelve pencils inside. With one pencil left, his visions starts to blue and he falls down his desk into a coma. When he wakes up he is inside his own, huge nasal orifice and the goal is clear: remove all the pencils and escape the nightmare.<br><br>This 2D platform game contains a single level composed of several single-screen rooms connected both horizontally and vertically using the flip-screen mechanic offering an amount of freedom to explore. Miguelito has no means to attack and has to complete platforming sections while avoiding enemies. He starts with 99 health and the meter is drained as long as he stays in contact with something dangerous. Every now and then chorizo sandwiches can be picked up to restore some health. When the twelve pencils, scattered around the levels, have been collected, the game is won. Sometimes he first needs to find a scalpel to cut through specific walls in order to progress.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Feb 12, 2010",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/viaje-al-centro-de-la-napia",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Feb 12, 2010",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}