{
  "name": "Warlock",
  "shortName": "warlock__",
  "description": "<i>Warlock</i> is an isometric flick-screen game where you play the role of The Doomlord of a fallen world living a comfortable life for an aeon or two. After taking over the world and ruling with evil and darkness in your castle called DoomRock, an adversary called The White Wizard has stormed the castle and taken it over. The land you rule is now in danger of being ruled with good and light, and so you have decided to get your castle back by destroying the creatures of good and find the Orb of Power to destroy the wizard in a final battle.<br><br>Starting your quest inside the castle in the form of a Warlock, you must find keys to open locked doors as well as potions that allow you to change form as either a Goblin or Troll. These give you more strength but weaker magic but there are potions that allow you to change back into the form of a Warlock. Other items can be found which either help or hinder you in your quest. As you explore the castle you will encounter various creatures but you are able to fire firebolts at them, and more powerful magic can be found to increase your weaponry. If you are hit by any creature or it's weapon then a Might gauge decreases and when emptied, then you lose one of three lives. As well as doorways to go through there are various squares that enable you to go up or down in the castle.",
  "publishedBy": "Edge, The",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "Amstrad CPC | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/warlock__",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Edge, The",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}