{
  "name": "Yazzie",
  "shortName": "yazzie",
  "description": "<i>Yazzie</i> is a homebrew platform game with some puzzle elements. It was originally created as a ZX Spectrum title for the Yandex Retro Games Battle 2019 where it took third place. Later it was ported to other platforms. It consists of several levels, mostly a single screen with slight scrolling near the edges, where a gold digger needs to collect all the gold bars in the environment to complete the level. As soon as all gold is collected the level ends right away.<br><br>Each level represents a room in a mansion, with several platforms, ladders and hazards such as fire. There are enemies moving over the platforms and they are able to use ladders. There are free-roaming flying creatures as well. A single encounter with an enemy or a hazard is immediately deadly and makes the level restart. There are no ways to attack the enemies, they can only be avoided.<br><br>A lot of the gameplay revolves around luring the enemies away in a certain direction so you can pass and grab the gold on the other side. There are platforms where it is possible to drop down through them right away. Certain pieces of gold can only be reached through digging. Pickaxes can be picked up in certain levels and they allow the character to dig down once per axe. Other game elements are bridges that can be activated and timed explosions that can be triggered to clear a part of then environment. After a certain number of levels a password is provided.",
  "publishedBy": "RetroSouls",
  "developedBy": "RetroSouls",
  "released": "Dec 06, 2019",
  "alsoFor": "Genesis, MSX | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/yazzie",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "RetroSouls",
          "developer": "RetroSouls",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Dec 06, 2019",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}