{
  "name": "ZX81 Monopoly",
  "shortName": "zx81-monopoly",
  "description": "<i>ZX81 Do Not Pass Go</i> is based on the game <a href=\"https://www.mobygames.com/search/quick?game=Monopoly\">Monopoly</a> and is a text version of the game with no board seen. One to six players try to make money without going bankrupt. The game is the same as the board game with the various squares with London street names, train stations, amenities, Chance, Community Chest and Go to Jail square. Each player takes it in turns to throw a dice to move their counter and if a street, train station or amenities square is landed on then the player has a choice to buy it if the player has enough money. <br><br>If the player has brought a street to make up a set then houses can be brought and placed on the square with hotels being built for a certain amount of houses owned. As the players move buying streets and a player lands on a street, train station or amenities square owned by the other players then that player has to pay rent and the cost depends on how expensive the street is and if there are any houses or hotels on it. Landing on a Community Chest or Chance square reveals an incident and this can either lose or gain the player money. The Go to Jail square forces the player to go to the Jail and if a player passes the Go square then they receive £200. A player will lose the game if they go bankrupt.",
  "publishedBy": "Work Force",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "ZX81 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/zx-spectrum/zx81-monopoly",
  "visual": "",
  "gamePlay": "Board game",
  "setting": "",
  "release": [
    {
      "system": "ZX Spectrum",
      "releases": [
        {
          "publisher": "Work Force",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}