{"altername_name": [], "name": "3-D Maze Escape", "overview": "3-D Maze Escape is your typical 3-D Maze escape game that were very popular in the late 70s to early 1980s. This one was developed by David J. Bohlke and published in volume 2, issue 1 of Antic dated April 1983. This game will place you in a gigantic random maze from which there is only one route of escape. In this three-dimensional simulation you'll only be able to see the high walls and the corridors fading in the distance. You must try to escape from the maze in the shortest possible time. At the start of each game, you'll be asked to push the [SELECT] key to adjust the size of the maze. This level of difficulty can vary from a fairly simple 11 by 11 grid maze to an almost impossible 35 by 35 maze. When you press the START key, your random maze will be constructed on the screen; and you will then be placed inside of it. To move through the maze, you will need to have a joystick plugged into Slot #1. Push the stick left /right to make a 90 degree turn left / right. Pushing the stick forward (up) will cause your man to move one intersection in the direction you are facing. After you move several steps, turn around 180 degrees and you'll see little 'tracks' in the intersection you just passed. These little markers will let you know where you have been. The timer counting on the lower left of the screen will let you know how long you have been in the maze. The timer also increases by five each time you take a step. If you feel completely lost, you can press the fire button to see a top-down map of the maze. This will include a red path to signify where you have been; and a flashing marker to show your current location. Seeing this map does carry a penalty, though, as the timer will run about ten times its normal speed. Press the fire button a second time to return to the maze. Several players can compete in turn as individuals or as teams to see who can escape from the maze in the shortest time.", "platform": "Atari 800", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "David J. Bohlke", "publishers": "Antic", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.42", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149246-3-d-maze-escape\n"}