{"altername_name": ["Atomix"], "name": "Atomix Plus", "overview": "A logic\\puzzle game of 80 levels created by Boleslav Buzek and released by Blackfire! Software in 1993. Your task in this game is to assemble molecules from atoms. The shape and composition of the molecule will be displayed in the lower left frame, the name of the molecule in the upper part of the screen. It looks easy, but there's a catch. Atoms are unstable, as soon as you set them in motion, they will stop unless there is an obstacle or some other atom. You have to combine a lot here. In the beginning, before you come up with your different combinations, you will think that you will never make it to the end of the game. However, after a while you will find out that it is real. It depends only on you. You will be given a certain time limit to compose the molecule. If you do not manage to fold the molecule within this limit and if you do not have a sufficient number of points, from which penalty points will be deducted, the game will be over. If you have enough points, a dialog message will appear on the screen. Pressing Y will continue the game. Press the 'N key to exit the game. After beating each level, a password will appear on the next screen. Always write this password down. It allows you to always start the game from the level from which you choose a password and write it down at the beginning of the game (you don't press the 'START' key but the 'SELECT' key). After beating the 80th level, write down the 12-digit code that appears on the screen. If you want to place well in our contest where whoever sends us a ticket with a code and has the highest number of points (encoded) wins, practice all the levels and then project the whole game (1-80 levels) at once.", "platform": "Atari 800", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Boleslav Buzek", "publishers": "Blackfire! Software", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369128-atomix-plus\n"}