{"altername_name": [], "name": "Aztec Challenge", "overview": "Aztec Challenge refers to either of two early arcade-style computer games published by COSMI, as well as to subsequent remakes. In all game versions the player takes control of a running Aztec warrior. The first was a side-scrolling platform-jumping game created by Robert Tegel Bonifacio and released in 1982 for the Atari 8-bit family. The original version of the game on the Atari 8-bit computers presented itself as a side-scroller, with the player's character running continuously from left to right as the background and path continuously scrolled. Control was limited to jumping at three different heights; holding the joystick down and pressing the button resulted in a low jump, holding the joystick up and pressing the button resulted in a high jump, and pressing the button by itself resulted in a medium jump. The running speed of the character was constant; only the height of the jumps differed, although speed of the character gradually increased of its own accord with each passing level. In two-player mode, each player controlled a different colored character with one character running in front of the other. The object of the game was to cover as much distance as possible without succumbing to the assorted perils of the path. Obstacles included platforms and ceilings of differing heights, pits, spikes, platform steps of staggered heights, and other assorted pitfalls. Contact with any part of the landscape other than the path would result in the loss of a player's life and would return the player to the last checkpoint.", "platform": "Atari 800", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Robert T. Bonifacio", "publishers": "Cosmi", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "3.25", "wikipedia": "https://en.wikipedia.org/wiki/Aztec_Challenge", "video_link": "https://www.youtube.com/watch?v=XuycvBkFRAU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73866-aztec-challenge\n"}