{"altername_name": ["Battle in the B-Ring"], "name": "Battle in the B Ring", "overview": "Published in In the Analog Computing Magazine Issue 19, Jun 1984. In the B-Ring of Saturn, a huge extraterrestrial artifact has been discovered. It is a Bussard ramjet of alien manufacture; a huge, hydrogen-gulping behemoth that has traveled between stars and is now orbiting, dormant, around our sixth planet. The two most powerful nations on earth have launched missions to retrieve the alien vessel and study its advanced technology. Neither side wishes to share the prize, so a battle is inevitable. To play the game, plug joysticks into ports one and two. Once the program has been loaded, the menu will appear. Pressing the OPTION key will highlight the game selection (collisions, ring density, ring speed). Pressing the SELECT key will choose the particular variation (non-scoring or scoring collisions; low, medium or high density rings; and slow or fast ring speed). Pressing START returns you to the game screen, where gameplay is initiated by pressing the joystick trigger button. Pressing any of the three console buttons during gameplay returns you to the menu. There are many dangers in Saturn's rings. You must avoid collisions with the chunks of rocks and ice that constitute the rings themselves, and the electrical discharges that randomly arc across the gap. You should also be aware that the artifact is still active and will fire its missiles at anything in its path. Player movements are controlled by the joysticks. Your missiles are fired by pressing your trigger but- ton. Each player may have only one missile on screen at a time. Missile directions, either left or right, are controlled by the computer. Player destruction occurs when your saucer has suffered a total of ten collisions with missiles or ring debris. Collision counters appear at the bottom of the screen. If the non-scoring option is used, collisions with ring debris do not count. Contacts with the white-hot nozzle of the artifact or the electrical discharges are instantly atal. Colliding with the opposing player's saucer results in the destruction of both players. To win the game, you nnust hit the rocket nozzle of the artifact with one of your missiles. The artifact will stop, and the nozzle will begin to cool. Once it has cooled you must dock your saucer with it. If the other player has been destroyed you have won, and the game is over. If not, then you're a sitting duck. You can neither fire nor retreat while docked, but your opponent retains his mobility. It's either him or you! Only one person can rescue the alien ship!", "platform": "Atari 800", "release_date": "June 4, 1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Lew Thomits", "publishers": "ANALOG Computing", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148952-battle-in-the-b-ring\n"}