{"altername_name": [], "name": "Bismark", "overview": "You are in control of the British North Atlantic squadrons in the hunt for the Bismark. You have 13 turns to find and destroy the battleship before your forces have to return home to refuel. Each turn you give movement orders to each of your 12 naval units. Note that all forces can move up to 2 areas per turn except Vian's destroyers, which can move up to 3 per turn. When all the movement is done you will be informed if any of your groups have sighted the Bismark. In Poor weather it will be sighted only by a force in the same area. In Fair or Good weather it will be sisted by forces in neighboring areas also. In Fair and Good weather wou will be asked if you wish to fly airstrikes. You have two carriers Victorious with 9 aircraft and Ark Royal with 15. If the Bisnark is within 4 areas of the carrier and if the air strike finds the Battleship it will attack her. Next, any forces in the same areas the Bismark can attack her. The Bismark may attack weaker British Forces even if you do not wish to be engaged, and she will always fire first in any combat. Combat consists of unlimited number of rounds, but after each round you will be given the option to break off battle. Combat ends when one side is sunk or one side breaks away. When the combat, if any, is settled a new turn will begin. Of course the game ends if the Bismark has been sunk or 13 turns have been played. Tactics: Initially you must set up a search pattern to find the Bismark, and to do this you will need to scatter your forces to cover a larger area. However, remember that when the Bismark is located you must be able to concentrate your forces to attack, so don't spread then too thinly. It is sometimes worth throwing a small force in against the Bismark to try weakening her - but remember that this sacrifice is going to cost you victory points at the end of the same. Also, use those aircraft! Historically they were the deciding factor.", "platform": "Atari 800", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "George A. Greenway", "publishers": "Aackosoft", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162138-bismark\n"}