{"altername_name": [], "name": "Boulders and Bombs", "overview": "A group of spelunkers has been trapped under-ground on a strange planet. Your goal is to use a mechanical auger to burrow a tunnel from one side of the screen to the next to allow the group to get closer to safety. The escape needs to take place within a certain time, which is marked by the movement of the sun and moon. The fire button switches control between the auger and the fleeing human. Once all humans have been rescued, play continues in the next level or \"quadrant\". Thwarting your plans for escape is an alien bird, who flies over-head and has two special powers. It can launch magna-titanium rods which penetrate the planet's crust and may either kill a human or block their path. It can also hatch a number of smaller probe-birds. These probe-birds can launch their own attack. They can deploy a nuclear rod through the rock, and once encountering a tunnel can release a space-fungus. The fungus is made of a relatively hard material, and grows haphazardly within the tunnel, blocking it. There are two other important aspects of the game: boulders and bombs. Boulders appear randomly throughout each quadrant. They are made out of a super-hard rock which is extremely difficult to drill through, but also almost impenetrable by the nuclear rods of the probe birds. The part of a tunnel drilled under a boulder is therefore relatively safe. The cave explorers also start off with a number of bombs. If a bomb is deployed near the end of one of the nuclear rods, before it deploys the fungus, then the probe-bird above will be killed by the explosion. Extra bombs can be found floating around the tunnels in each quadrant. A bonus life is given at the end of five successful quadrants, and there are a total of 99. There is also a multi-player mode, where each additional player controls one of the three probe birds trying to destroy the first player.", "platform": "Atari 800", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "K-Byte Software", "publishers": "CBS Software", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/Boulders_and_Bombs", "video_link": "https://www.youtube.com/watch?v=jAfJFfEjYBI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/140292-boulders-and-bombs\n"}