{"altername_name": ["Lapin Vole"], "name": "Bunny Hop", "overview": "Airborne carrots and a cloud-hopping rabbit add a dash of whimsy to this joystick-controlled game. It's harvest time in that great big carrot patch in the sky and Copernicus, a rather hungry rabbit, is on the prowl for his favorite vegetable. Unfortunately, due to a fluke of nature as well as incredibly bad air pollution, the carrots are suspended in midair. This, however, can be turned into an advantage for Copernicus, since he is able to hop around on the dense clouds in pursuit of his meal. He may also jump around on platforms which have been dispersed across the sky for absolutely no reason at all. Watch That Brier Patch The only thing Copernicus cannot do is land in the brier patch below — he would be transported back to his initial position. This would not be so bad if he had an unlimited number of transport passes — unfortunately, he has not. After they are exhausted, he is condemned to the brier patch for the rest of his life. If he clears the sky of carrots, then benevolent forces disperse a new set of carrots for him, and his friends in the brier patch become so happy for him that they usually jump around in a rabbit euphoria. Meanwhile, Copernicus continues to collect carrots until he runs out of transport passes. One Tricky Carrot Once in a while our hero eats a jumping bean which has been disguised as a carrot by some unknown troublemaker. This causes him to hop continuously, hampering his ability to gather carrots. In addition, the more he eats, the heavier he becomes, until he finds that he can no longer jump as high as he used to. But then, it just adds more challenge to his hare-raising adventures. Published in Compute! magazine Vol. 6 / No. 7 Issue 050 in July of 1984.", "platform": "Atari 800", "release_date": "July 2, 1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Adam Cybanski", "publishers": "COMPUTE! Publications", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149093-bunny-hop\n"}