{"altername_name": ["Centipede [5200]", "Centipede [cr Glenn the 5200 Man]"], "name": "Centipede (5200)", "overview": "This is a conversion of the Atari 5200 Centipede, featuring much better graphics and sound than the original 1982 game. It was published on the Atari (UK) tapes: Compilation A (TXP7100) and Atari Compilation (TX9043). Compilation tapes were given away with some Atari 65XE and 130XE machines in the UK. FUNCTION KEYS Firing - Press joystick for single shot and hold it down for continuous firing. 2 Players - Press [SELECT] Start Game - Press [START] Pausing - Press [SPACE] bar. (To un-pause, press again) Difficulty - Press [OPTION] to toggle between Easy, Standard and Hard gameplay. Press CONTROL+G to reveal conversion credits. DESCRIPTION You live in an enchanted Mushroom Patch filled with bothersome bugs with magical powers that move through it towards you. As the Centipede marches back and forth across the screen it bumps into mushrooms, forcing the Centipede to turn and move down the screen at great speed. You are the bug blaster -- you must destroy each segment of the Centipede before it reaches the bottom of the screen and destroys you. Beware the segments can break up into many new Centipedes. When an entire Centipede is destroyed, a new one attacks from the top of the screen. Beware of the jumping spider as it is not blocked by mushrooms and can jump over them to destroy your blaster. The mushroom it jumps over may magically disappear. The poisonous Scurrying Scorpion dashes across the patch without warning, poisoning any mushroom it touches. When a Centipede touches a poisoned mushroom it goes insane and charges directly towards you and your blaster. The Frenzied Flea may create a mushroom wherever he lands but his deadly bite will destroy your blaster if he touches you.", "platform": "Atari 800", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari (USA)", "publishers": "Atari UK", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/Q8c-OHTo1U0?t=7", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/131811-centipede-5200\n"}