{"altername_name": [], "name": "Centipede", "overview": "The player is represented by a small, \"somewhat humanoid head\" at the bottom of the screen. The player moves the character about the bottom area of the screen with a trackball and fires laser shots at a centipede advancing from the top of the screen down through a field of mushrooms. Shooting any section of the centipede creates a mushroom; shooting one of the middle segments splits the centipede into two pieces at that point. Each piece then continues independently on its way down the board, with the first section of the rear piece becoming a new head. If the head is destroyed, the section behind it becomes the next head. The centipede starts at the top of the screen, traveling either left or right. When it hits a mushroom or the edge of the screen, it drops one level and switches direction. Thus, more mushrooms on the screen cause the centipede to descend more rapidly. The player can destroy mushrooms by shooting them, but each takes four hits to destroy.If the centipede reaches the bottom of the screen, it moves back and forth within the player area and one-segment \"head\" centipedes are periodically added. This continues until the player has eliminated both the original centipede and all heads. When all the centipede's segments are destroyed, a new centipede forms at the top of the screen. Every time a centipede is eliminated, however, the next one is one segment shorter and is accompanied by one additional, fast-moving \"head\" centipede. The player is also menaced by other creatures besides the centipedes. Fleas drop vertically, leaving additional mushrooms in their path; they appear when fewer than five mushrooms are in the player movement area, though the number required increases with level of difficulty. Spiders move across the player area in a zig-zag fashion and occasionally eat some of the mushrooms. Scorpions move horizontally across the screen and poison every mushroom they touch, but these never appear in the player movement region. A centipede touching a poisoned mushroom hurtles straight down toward the player area, then returns to normal behavior upon reaching it. A player loses a life when hit by a centipede or another enemy, such as a spider or a flea, after which any poisoned or partially damaged mushrooms revert to normal. Points are awarded for each regenerated mushroom. A game ends if all lives are gone.", "platform": "Atari 800", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Dave Getneu", "publishers": "Atarisoft", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.62", "wikipedia": "https://en.wikipedia.org/wiki/Centipede_(video_game)", "video_link": "https://www.youtube.com/watch?v=5OFM1qgIzW0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73188-centipede\n"}