{"altername_name": ["Clipper"], "name": "Clipper: Around the Horn in 1850", "overview": "Every so often a software manufacturer releases a new title that makes a wave in the endless stream of lookalike shoot-'em-ups and cute mazechases. Program Design, Inc., the company that produced the Arcade Award winner Moonbase lo, has done just that with Clipper: Around the Horn in 1850, its new offering for the Atari computers. What makes Clipper so noteworthy is its overall concept and design - a narrated game simulation with three screens that is not only entertaining, but also an education in sailing and its history. At the outset of the program, the gamer chooses one of 10 available 19th Century clipper ships to captain and sail from New York to San Francisco via Cape Horn. Because each vessel has its own characteristics, the gamer must outfit each voyage differently. Even in the same ship, a different manifest may be required because of fluctuations in the cost of provisions and the amount of money on hand in the treasury. The gamer outfits his clipper by entering the number of crew members he or she wishes to hire and the amount of cargo and provisions the ship intends to take on. All the information is entered using the joystick and the fire button. (That's \"userfriendly\".) Once the gamer has outfitted the vessel, the race around the tip of South America begins. Don't get the idea, though, that it's clear sailing. Two screens display the ship's logbook and a map of the western hemisphere. However, most of the time the player will use the main screen, which shows the bridge of the clipper and provides four important readings. Proper usage of these readings is absolutely essential if the gamer doesn't wish to run aground or get lost at sea. (If either happens, a news clipping relates the sighting of the shipwreck and the loss of all hands.) The readings, from left to right, are: the percentage of unfurled sail, the clipper's position in longitude and latitude, the vessel's heading and speed, and the wind's direction and speed. Fortunately for us landlubbers, the game designer, John Bayes, provides a build-it-yourself compass with the program. Perhaps not so fortunately, he has also filled the oceans with uncharted reefs and maverick icebergs - oh, the sound of splintering wood! In addition to those dangers, the crew may become ill or decide to mutiny. If they do mutiny, the captain has the option of putting some or all of them in chains. There are also other dangers calculated to convince garners that sailing the Seven Seas is a little tougher than floating a rubber ducky in the bathtub. As if the program itself weren't enough to satisfy most garners, PDI added an optional voice cassette to the simulation. If the gamer elects to use it, it entertains with traditional sea chanties, gives advice from an ex-captain, and threatens with a crusty pirate. All in all, Clipper is an entertaining simulation. But don't allow the lapping waves to dull your judgement because that sound and the sound of seagulls usually means there's a reef right ahead. Hard to port! Lower that sail!", "platform": "Atari 800", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "PDI", "genres": "", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/145089-clipper-around-the-horn-in-1850\n"}