{"altername_name": [], "name": "Closeout!", "overview": "An arcade collect' em up created by L. L. Beh and published in Compute! Magazine in March of 1983. \"Closeout\" has been tested by 30 people, aged 5 to 55, for over four months. Many claim that they enjoy this game even more than popular commercial games. There's a huge sale going on at a local department store. You arrive at the multi-story building hungry for bargains. Boldly, you enter the store and look around - and see bargains galore. A real sale! You start gathering up sale items, but then become aware of a strange group of shoppers. Wherever you go, they follow you around. Soon you leap their true intentions - they are out to stop you at all costs, sb they can have the store to themselves. What's worse, they're armed with ray guns from the Toy Department and modified to work! The object of \"Closeout\" is to snatch up as many sale items as possible while evading the hostile bargain hunters. Don't let them get too close, because they'll either capture you or shoot you. Some of them can shoot farther than others. You can shoot back with the slingshot you bought in the Sporting Goods Department (50 percent off), but since slingshots require two hands to shoot, you must drop 25 sale items each time you use it. You have only one chance and about three minutes of play. Extra time is awarded for higher scores. The remaining time is indicated on the left, and colors change as time runs out (there can be up to nine different colors on the screen at a time). When your score surpasses 25 points, you can shoot your slingshot, but remember, it costs you 25 points. You can only shoot horizontally, by aiming the joystick and pressing the fire button. The best strategy is to shoot only when cornered.", "platform": "Atari 800", "release_date": "March 1, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "L. L. Beh", "publishers": "COMPUTE! Publications", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ALk4Dsi3SDc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149078-closeout\n"}