{"altername_name": [], "name": "Defender", "overview": "Defender is a two-dimensional side-scrolling shooting game set on the surface of an unnamed planet. The player controls a space ship as it navigates the terrain, flying either to the left or right. A joystick controls the ship's elevation, and five buttons control its horizontal direction and weapons. The object is to destroy alien invaders, while protecting astronauts on the landscape from abduction. Humans that are abducted return as mutants that attack the ship. Defeating the aliens allows the player to progress to the next level. Failing to protect the astronauts, however, causes the planet to explode and the level to become populated with mutants. Surviving the waves of mutants results in the restoration of the planet. Players are allotted three ships to progress through the game and are able to earn more by reaching certain scoring benchmarks. A ship is lost if it is hit by an enemy or its projectiles, or if a hyperspace jump goes wrong (as they randomly do). After exhausting all ships, the game ends. The enemies: Lander, Mutant, Swarmer (150 each), Baiter (200), Bomber (250) & Pod (1,000). 100 points times level (up to 5) per humanoid saved at end of level. Extra life and smart bomb per 10,000 scored; however, at 990,000, player gets extra life & smart bomb per enemy destroyed, and repeats per 1,000,000 thereafter. The Atari 8-bit version was part of a set of arcade games that were ported to the system after its release that were well regarded for gameplay and graphics accuracy to the arcade.", "platform": "Atari 800", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Williams Electronics", "publishers": "Atarisoft", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.12", "wikipedia": "https://en.wikipedia.org/wiki/Defender_(1981_video_game)", "video_link": "https://www.youtube.com/watch?v=toAVC_97QTY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112788-defender\n"}