{"altername_name": ["Donkey Kong Jr."], "name": "Donkey Kong Junior", "overview": "The game's eponymous star, Donkey Kong Jr., also called simply Junior or abbreviated as DK Jr., is trying to rescue his father Donkey Kong, who has been imprisoned. Donkey Kong's cage is guarded by Mario, in his only appearance as an antagonist in a Nintendo video game. Donkey Kong Jr. must rescue his father by working his way through a series of four screens. Mario attempts to stop DK Jr. by releasing animals and putting obstacles in his way. When DK Jr. succeeds on the last screen, Donkey Kong is freed and kicks Mario into the distance, leaving him to run away and to an unknown fate; the game then begins again at a higher difficulty level. Like its Donkey Kong predecessor, Donkey Kong Jr. is a platform game. There are a total of four stages, each with a unique theme. DK Jr. can run left and right, jump, and grab vines/chains/ropes to climb higher on the screen. He can slide down faster by holding only one vine, or climb faster by holding two. Enemies include \"Snapjaws,\" which resemble bear traps with eyes; bird-like creatures called \"Nitpickers,\" some of which can attack by dropping eggs; and \"Sparks\" that roam across the wiring in one of Mario's hideouts. DK Jr. can jump over these enemies while on platforms, switch from one vine/chain/rope to another to dodge them, or knock down pieces of fruit that will destroy every enemy they touch before falling off the bottom of the screen. To pass the first three stages, DK Jr. must reach the key hanging next to his father's cage, whereupon Mario flees while pushing it off the screen. In the fourth stage, DK Jr. must push six keys into locks on the topmost platform to free Donkey Kong. After a brief cutscene, the player is taken back to the first stage at an increased difficulty. A bonus timer runs throughout each stage, and any points remaining on it are added to the player's score upon completion. DK Jr. loses a life when he touches any enemy or projectile, falls too great a distance, or falls off the bottom of the screen. Additionally, he loses a life if the bonus timer counts down to zero. The game ends when the player loses all of his or her lives. Like in its predecessor, Donkey Kong Jr. features a kill screen at level 22. Due to the level counter only having one digit, the counter shows numbers 1 to 9 in levels 1 to 9, seven blanks in levels 10 to 16, and the letters A to F in the levels 17-22. The kill screen occurs the same way as in Donkey Kong, where an integer overflow occurs after too big a result is given after a multiplication problem in the computing. The timer counts as if there are 700 points, then kills Donkey Kong Jr. until all lives are taken.", "platform": "Atari 800", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari", "publishers": "Atari", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.64", "wikipedia": "https://en.wikipedia.org/wiki/Donkey_Kong_Jr.", "video_link": "https://www.youtube.com/watch?v=PdJWIevjIWM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108027-donkey-kong-junior\n"}