{"altername_name": [], "name": "Dragon's Breath", "overview": "An educational game created by Larry W. Linson and published in A.N.A.L.O.G. Computing Magazine in issue 34 from 09/85. A thinking / learning activity for children in kindergarten through fifth grade. Hidden beneath the blue skies, green trees and thick underbrush of the deserted planet Leimart, there lives the last of a dying breed, a dragon named D.B. This somewhat friendly reptile loves children, puppies and other neat things . . . and he'd love to have you for lunch sometime! D.B. has a thinking activity called Dragon's Breath for young children to play. The activity has two categories: What COLOR is it? and What doesn't belong? Both quiz a child on his or her thinking skills, in different ways. What COLOR is ... ? asks children to identify the color associated with some common (and some not- so-common things) in the world around them. What doesn't belong? is a classifying activity. Three words are listed, such as: light, lamp and chair. The child needs to identify which of the three words does not belong in the group. D.B. keeps score and reports after each answer. Dragon's Breath may be a bit difficult for some very young children to do independently. With the help of a parent or older sibling, though, it will be an enjoyable learning experience for any child. The program is set down in a fairly logical order. At the bottom left side of the display are the right (yes-) and wrong (no-) running totals for each round. The question will appear on the left portion of the screen, with the three possible answers on the right. Using the joystick, move D. B. up or down to your choice, then press the trigger to see if you're right! If you're not, you may need to have a towel on hand. D. B. will keep counting until you have ten correct answers, then you can try the other activity. If you want to change levels in the middle of a game, press the START key, and D. B. will return to the main menu.", "platform": "Atari 800", "release_date": "September 2, 1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Larry W. Linson", "publishers": "ANALOG Computing", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148704-dragons-breath\n"}