{"altername_name": [], "name": "Dragonlord", "overview": "A game from Clayton Walnum and published in A.N.A.L.O.G. Computing Magazine issue 29 in April 1985. It was bound to happen sooner or later. The reports had been coming in from all over the countryside. . . livestock slaughtered, homes burned, princesses kid- napped. But the most horrifying tales of all, those that left one numb with shock, told of the near extinction of blueberry pie. From town after town came ghastly accounts of the mouth-watering treats being snatched from windows ills as fast as they were set out to cool. The county was in an uproar. And now the dragon had come to Dellwood. The mayor tapped a finger thoughtfully on his fore- head and tried to keep a smile frozen on his lips. All around him, angry citizens stomped and frowned. \"I lost two prize cattle!\" bellowed Babbit Costowitz. \"My barn burned to the ground!\" yelled Loodchuck Allison. \"My hens stopped layin',\" moaned Chip Monk. \"And I ain't makin no more blueberry pies!!\" screamed Widow Taccoon. The town hall plunged into silence so suddenly that the windows rattled in their frames. No more blueberry pie? \"Can't help it,\" mumbled the widow, acutely aware of all the horrified eyes focused on her. \"He keeps stealin 'em!\" All attention turned to the mayor. He stood, still smiling, his demeanor confident. The people visibly relaxed. Here was a great leader of men. Here was the town guardian, unwavering in strength, unsur- passed in courage, a veritable fount of knowledge. He gazed into his people's hopeful faces and spoke pro- found words of wisdom and encouragement. \"I. . .uh. . .well. . .hmmmmmm. . .Any suggestions?\" \"Call the Dragonlord!\" they yelled in unison. \"Uh. . .oh, yes. . .of course!. . .Hmmmmmm.\" It wasn't too long before the Dragonlord arrived in Dellwood with nothing but the armor on his back, a skin of spring water and a week's supply of blue- berry pie. Within the hour, he was standing with the mayor in Babbit Costowitz's meadow examining a rather large mound of dragonflop. \"Yep, you got yourself a big'un here,\" he said as he tucked away his tape measure. \"Judging by the size of this, I'd say. . .\" But the mayor wasn't listening. His attention was fixed on a huge object that was plummeting from the sky at an alarming rate. \"Good grief! It's the dr... dr...dr...dr...\" \"Dragon,\" finished the hero, while helping the poor man reclose his jaw. \"Don't you worry. I've got quite a reputation. Most dragons would rather just buzz off than tangle with me.\" He strode to where the colossal beast was settling to the ground amidst a whirlwind of dust and straw, and looked up into its emerald, catlike eyes. \"Say, why don't you just get lost before I have to get rough with you.' \"Hal\" snorted the dragon. Of course, you know what happens when a dragon snorts. It took the village blacksmith three days to peel off the Dragonlord's welded armor. \"The doc said it will take a month for your burns to heal,\" said the mayor. \"I can live with that,\" said the Dragonlord. \"Your armor is completely ruined.\" \"I can live with that.\" \"Every hair on your body has been burned off.\" \"I can live with that.\" \"He took your blueberry pie.\" Dragonlord is a fantasy adventure board game for one player. The object is to find the dragon in the dungeon maze, then capture him. You must manage to stay alive, of course. To do this, you mustn't allow your hit points or strength to drop to zero. You must make sure that you have plenty of pie to eat, and you must fight and slay the many ores that will try to keep you from your goal. Throughout the dungeon you will discover spells, serums, treasures and teleporter devices. There is also a thief who is more than happy to take advantage of unwary adventurers, to capture the dragon, you must tame him with the magical dragon brew you can purchase in the store. If you stumble upon the dragon without having the brew, he'll kill you instantly.", "platform": "Atari 800", "release_date": "April 1, 1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Clayton Walnum", "publishers": "ANALOG Computing", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148966-dragonlord\n"}