{"altername_name": ["Electra-ball"], "name": "Electra-ball: Sport of the Future", "overview": "An action game created by Frank Martone and published in the A.N.A.L.O.G. Computing Magazine 03/89. Electra-Ball is a two-player futuristic sports game that can be played on any Atari 8-bit with two joysticks. There are two teams, the Red team and the White team. Each team has a goal; Red's goal has a red background, and White's goal has a blue background (don't ask). There are Red and White deflector panels scattered throughout the play field. The object of the game is to deflect the electra-ball into the opponents goal. The first player to reach a player-selected score will win. To select the winning score, simply move joystick #1 up or down. When the desired score appears on the title screen, press the joystick button, and the game will begin. The preset winning score is five goals. You can select from one to 25 goals as the winning score. The deflector panels have three possible deflection positions: up, down and straight ahead. If you push the joystick up, all the panels on your team will face up, and if the ball hits the panel in this position the ball will be deflected up. Moving your joystick up or down makes your deflector panels face up or down, and moving your joystick left or right returns your deflector panels to the straight position. If the ball hits your panel in the straight position, the ball will simply be deflected straight ahead. After the ball collides with any panel on the playfield both teams panels are reset to the straight position. To move your goalie, hold in the joystick button and push the joystick up or down. When the ball collides with a goalie, it is deflected away in a random direction. The electra-ball then becomes unpredictable, moving in an erratic course forcing both teams to be on their guard. Good Luck", "platform": "Atari 800", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Frank Martone", "publishers": "ANALOG Computing", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149186-electra-ball-sport-of-the-future\n"}