{"altername_name": [], "name": "Fill'er Up!", "overview": "A Qix inspired type-in game created by Tom Hudson and published in A.N.A.L.O.G. magazine issue 10 in 03/1983. You start out on the white border surrounding the planned reservoir area. You may move around on these white walls by moving your joystick in the desired direction. You can build a reservoir wall by moving into the black \"uncharted\" area while pressing your joystick button. The walls you make can be any length, and must be terminated at a white wall. When you finish a wall by hitting a white wall, the area you have enclosed will fill with water. Do NOT run into the wall you are building or you will be destroyed. If the starfish hits you or any part of the wall you are building before you complete it, you will be destroyed. On levels 1,2,4,7,12 and 13 you wil be safe from attack when standing on a white wall, but on other levels the starfish can destroy you on contact at any time! At the bottom of the screen are several information displays. \"TGT\" indicates the TARGET area you must fill with water before you complete the level. \"CUR\" indicates the CURRENT area you have filled. Once CUR reaches TGT, you have completed the level and are awarded points. SCORE indicates the number of points you have gained. At the end of each level, the computer will give you 2 points for each unit over the target you have filled. If the TARGET amount is 8000 and you fill 9000 units, you receive 2000 points. \"Fill 'Er Up\" may be paused at any time by pressing the space bar. This game contains 16 levels of difficulty. The level number is shown in the lower left corner of the screen. You have 3 lives, shown in the lower right corner of the screen. Good luck!", "platform": "Atari 800", "release_date": "March 1, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Tom Hudson", "publishers": "ANALOG Computing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148967-filler-up\n"}