{"altername_name": [], "name": "Fire Bug", "overview": "A shooter created by Kyle Peacock and Tom Hudson and published in A.N.A.L.O.G. issue 23 10/1984. Fire Bug is a one-player game that requires a joy- stick in port one. To begin the game, press the START key while the opening credits are being displayed. (Tom and I had a hard time deciding whose name would go first.) You can select which level you wish to start on by pressing the corresponding number, 1 through 9. Pausing of the game is accomplished by pressing the spacebar. Hitting the spacebar a second time will resume the game. Many years ago, a species of insect inhabited the subterranean chambers of Earth. Here, the \"fire\" species flourished for some four million years. Every two thousand years, the entire population expired, with the exception of one female. This female Fire Bug served as guardian over the dispersed fire nests of the underground. For eighty years, she defended these nests and their immature eggs from natural predators. Capable of emitting small, lethal \"sparks,\" she combed Earth's interior with an ever-watchful eye. Such an instinct kept her species alive for aeons before man emerged on the surface of the world. Now the Fire Bug is threatened with extinction. Man's nuclear wastes have infested the soil and mutated the predators of the Fire Bug into hideous, unstoppable bug-eating machines. These new super predators have the capacity to reproduce at astound- ing rates. Should they happen upon a Fire Bug nest, escape for the fire eggs is doubtful, if not impossible. As fate would have it, you are the last remaining female Fire Bug. You must defend the nests and pave the way for your species' next generation.", "platform": "Atari 800", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Kyle Peacock", "publishers": "ANALOG Computing", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Xu_SKSVzu2I", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148608-fire-bug\n"}