{"altername_name": [], "name": "Flip-It II", "overview": "Published in SoftSide Magazine Selections Issue 54 (1983-01). Flip-It II Is a computerized version of ReversI for an Atari 400/800 with 16K (24K disk) and a Joystick. Flip-It II is a computerized board game in which you and the computer match wits to outflank and capture one another's pieces on an eight-by-eight board. The computer is a formidable opponent, and you won't find it a trivial matter to win. The game begins with a square arrangement of four chips in the center of the board, two of them yours, and two belonging to the computer. You first choose a color and determine who will play first. You may also set up your own board (great for practicing strategies). The game's object is to place one of your chips in an unoccupied square so that it outflanks one or more of the computer's chips, i.e. surround the computer chips with one of your existing chips and the new one you're playing, in a straight line. When you accomplish this, all the computer's outflanked pieces become yours. This can happen in more than one direction. In any given turn, you might capture pieces horizontally, vertically, and diagonally, resulting in a substantial shift in the relative number of chips in one turn. The outcome of the game is rarely certain until the last few moves. Use the joystick to move the cursor horizontally, vertically, or diagonally from its current location, and press button zero to enter the move. The computer always checks to see that your move is legal and doesn't allow cheating. If neither of you has a possible move (which occasionally happens even before the board is filled), the game is over and the player with the greater number of chips is the winner. (The Atari indicates \"I pass\" with a \"sighing\" sound.) You may also press \"Q\" to quit at any time. Winning a game involves more than capturing as many pieces as you can on any given turn. Much more important to the eventual result is the position of your chips on the board. Capturing edge and (especially) corner squares, and preventing the computer from doing the same, pays off in the long run, even if it means outflanking only one square when you could get more elsewhere on the board.", "platform": "Atari 800", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Alan J. Zett", "publishers": "SoftSide Publications", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149923-flip-it-ii\n"}