{"altername_name": ["Gauntlet (Donald R. Lebeau)", "Gauntletak"], "name": "Gauntletak!", "overview": "Programmed exclusively for the Atari 8-bit computers, Gauntlet (no relation to the popular Atari arcade game released one year later) was one of the earliest \"cave-flyers .\" It was also one of the earliest games that functioned in the shareware mode of distribution, though the word had not been coined yet, and was generally distributed on BBSes. The game was originally titled Gauntlet, but was renamed after the Gauntlet arcade game from Atari Games was released in 1985. The \"Gauntletak\" version has several modifications and was not shareware, but commercially sold. In both versions, you are a ship flying over terrain with many enemies on screen. You can move your ship with the joystick directions; the ship has inertia, so after you stop pushing the stick it will still move for a period in the same direction. You can also fire any of 8 directions; whichever way the ship is facing. The Gauntletak version adds different modes, HIT + RUN which is kill enemies as fast possible and you can leave a screen before cleared, versus RAMPAGE which is clear all enemies before you can progress. In this version you also have an endless supply of ammo. The Gauntletak version adds the ability to switch weapons by keys: M = Homing Missiles (these can home in on you!) F = Flares T = Tridex S = Shotgun N = Nuke B = BOT (launches 4 homing missiles after a delay) To switch between the special weapon and the fusion gun, use the spacebar. Additionally you can hit X to stop the ship from gliding, or H to go into Hyperspace.", "platform": "Atari 800", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Donald R. Lebeau", "publishers": "Donald R. Lebeau", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Gauntletak", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142687-gauntletak\n"}