{"altername_name": [], "name": "Gone Fishing", "overview": "A text based fishing simulation developed entirely in BASIC by C. W Engel and published as a type-in from the book \"Stimulating Simulations\" in 1977 and republished in the 1979 \"Stimulation Simulations Second Edition\" that focused on the new Atari home computers. You are going on a fishing trip. The sea is an 8X8 grid, forming 64 fishing locations. You will start at the dock, square (1,1), and try to catch as many pounds of fish as you can. You may move one square at a time horizontally or vertically by entering a north(N), south(S), east(E), or west(W). Entering an F allows you to fish in the same place again, and a B allows you to start another fishing trip immediately. If you select a direction that takes you off the grid, your ship will sink. You must return to the dock in sixty moves, which is equivalent to six hours. If you don't return in time, half of your catch will spoil. The chance of catching fish is different for each square and is determined at the beginning of the trip. The chance of catching fish in a given square will remain the same throughout the trip or will decrease if the fish are scared by a shark. The maximum number of fish that can be caught in each square (density) is also determined at the beginning of the simulation. This number varies from 1 to 5. The maximum number of fish you can catch in a square will decrease only if sea gulls eat some of the bait. The maximum weight of a fish in a particular square is the product of the row and column; therefore, the further out you go, the bigger the fish. The longer you fish, the greater the chance of an afternoon storm occurring. If you hit a storm, you will lose .5 hour. One of the more difficult maneuvers of the trip is to fish as long as necessary to accumulate a large catch without getting lost in a storm. Also, there is a4! chance that you will experience some unexpected event during each move of the trip. Be sure you return to the dock before six hours have elapsed. Your rating as a fisherman will be the number of pounds of fish you catch divided by five.", "platform": "Atari 800", "release_date": "1979", "game_type": "Released", "esrb": "Not Rated", "developers": "C. W. Engel", "publishers": "Hayden Book Company", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/147964-gone-fishing\n"}