{"altername_name": [], "name": "Gwobby Strikes Back!", "overview": "Gwobby has returned from rescuing Mrs G from the evil clutches of Emperor Nyorb, and everything seems fine. But one day the Nyorbcraft hovers over Dorple, and the renowned burgular Blue Cat drops down and steals Gwobby in his sleep, and takes him back to Nyorb’s base in Cave Cwaddilor. To escape from each chamber, Gwobby has to harbour the power of the Cwaddilor rings, but Blue Cat and Nyorb do whatever they can to stop him escaping, including Nyorb and his henchman the Drogs filling the cave with crazy hazards and contraptions which make the rings harder to reach! Controls [/Start] or Fire button to begin the game [Select] Kiddies mode [Option] Special things; but the only one I’ll tell you about is press Option again to clear the high score Joystick [Left] / [Right] Walk [Up] Climb, Jump Up [Down] Descend [Diagonal Up] Jump across To shoot hold fire and move in the direction you wish to shoot. Gwobby being a cowboy slept with his two pistols by his side. He also has his invaluable cowboy hat that can sometimes save him from falling off platform edges and help him in other innovative ways (hint – use to avoid the horizonal force fields) ! [Space] to Pause / resume [Start] to Abort game You start the game with three lives and an extra man is awarded at 10,000 points. On each level Nyorb’s Power Orb is protected by a lethal force field; fortunately for Gwobby the underground power supply periodically short-circuits allowing Gwobby to jump and capture it. The power orb can help Gwobby in many mysterious ways as well as providing extra lives on the early levels! Did I mention the limited oxygen? No! Oh well I’m sure you’ll not survive long enough to run out of oxygen!", "platform": "Atari 800", "release_date": "2010", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Jason P. Kendall", "publishers": "Kendallsoft", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150304-gwobby-strikes-back\n"}