{"altername_name": ["Imperial Walker Battle"], "name": "Imperial Walker", "overview": "Imperial Walker is a compilation of 5 Atari 400/800 games by Mike Potter. Imperial Walker Battle - The player controls a large Imperial Walker from the Star Wars series. The goal is to shoot down menacing spaceships which harass the walker. The player has 30 seconds, and is awarded 10 points for every space ship shot, but loses 1 point if their shot misses, and loses 10 points if they are shot in the neck. In a 2-player game, 1 player additionally controls the space ship. Auto Race - The player controls a small car which must navigate a series of twisty passages. The player can turn left or right, and has a total of 4 speeds. If their vehicle strikes a wall, it is game over. The player gains points dependent on how far and fast they travel. There are 4 difficulty levels of tracks. Laser Nim - Based upon the game Android Nim, the player controls 3 robots, who can selectively remove 1, 2, or 3 robots from a series of 2, 4, or 5 robots. Each player takes turns removing robots, with the winner being the player whom removes the last robot. Gunfight - A 1-player versus computer or 2-player game, where two cowboys attempt to shoot each other. Each cowboy has 5 shots per round, and the 1st player can only shoot right, and the second player can only shoot left. The fighters move on a cactus-infested field, and the player gains a point if they shoot their opponent. Best out of 11 is the victor. Snake & Shake - The player controls a snake that progressively elongates every time it collects a pellet on the field. The player is awarded 10 points for every pellet collected. The player is destroyed if they run into a wall or into their own snake.", "platform": "Atari 800", "release_date": "1980", "game_type": "Released", "esrb": "Not Rated", "developers": "Mike Potter", "publishers": "Crystalware", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/145128-imperial-walker\n"}