{"altername_name": [], "name": "Labyrinths (ANALOG)", "overview": "3D maze game created by Steven Lashower and published in A.N.A.L.O.G. magazine issue 59 in 88/04. \"You have been selected to represent yom- local star system in the Labyrinths of Argonia. If you accomplish this impossible task, you will be rewarded with treasures beyond your wildest dreams. But if you fail, you will be disposed of. . .We love incentive.\" abyrinths is a one-player maze game written in 100 percent machine language and will run on all 8-bit Atari computers. It features colorful first perspective graphics that really place you in the maze. Type in Listing 1 using M/L Editor (see page 80) to create yom- copy of the game. Load the game using option L from the Atari DOS menu. When the game boots up, you're presented with the title page. Here, you can select between several options. Pressing OPTION will change the number of \"Argonian Patrollers\" that are in the maze with you. You can choose from to 6 Patrollers. The more Patrollers in the maze, the more difficult the game is. Pressing SELECT will determine whether the game is played in a \"daytime\" or \"nightime\" atmosphere and pressing START will, of course, begin the game. At any point during the game, pressing ESC will return you to the title page. You — the flashing blue dot — appear in the upper-left corner of the maze. The object, simple enough, is to escape from the maze. The exit is in the lower-right corner of the maze. In the center of the screen is a graphic window of what appears in the maze. To the right of this is a black area that will fill up with the maze as you explore new areas of it. If you're playing with Argonian Patrollers, they will also appear in this area as white dots. At the bottom of the screen is a timer that displays how long you've been in the maze. There's also a compass to show which direction you're facing. You move through the maze by using a joystick plugged into port 1. Pushing the stick forward will move you in the direction the compass is facing. Pulling back on the stick will move you backward (away from the direction the compass is facing). Pushing the stick to the left or right will turn you in the appropriate direction. If you happen to come across a Patroller in the maze, it will appear as a pulsing square in the graphic window. The size of this square depends on how close the Patroller is to you. Coming in contact with a Patroller means immediate destruction for you.", "platform": "Atari 800", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Steven Lashower", "publishers": "ANALOG Computing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149028-labyrinths-analog\n"}