{"altername_name": [], "name": "Maze War", "overview": "From ANALOG Magazine issue 36. Maze War is a game for one to four players. If played on an XL computer with more than two players selected, stick 1 will control Wizards 1 and 3, while stick 2 controls Wizards 2 and 4, The number of players is chosen with the SELECT key, and the number of Zombies with the OPTION key. The speed of the Zombies is selected by pressing a key from 1 to 9. You start the game somewhere in Roklar’s maze, Havoc Wand in hand. You move about in the maze by pushing your joystick in the desired direction. If the stick is held diagonally, the Wizard will alternate moving between the two directions. The Wand fires off a magic chain when you hold down the fire button while moving the joystick. The magic chain fired by the Wand is capable of vaporizing man or wall at fifty paces. Once vaporized, a Wizard or Zombie will automatically coalesce back into a whole at a random point somewhere in the maze. Moving about in the maze will attune you more to its energies, thus making the point value for a hit worth more. In the same fashion, using the Havoc Wand uses up energy, and overuse will bring the point value down. Once a Wizard or Zombie has tapped into 100 points of energy, the spell to return to Earth is cast. Then, the pocket dimension will become unstable and dissolve. Maze War will go into an automatic demo mode with three Zombies going at it after thirty seconds. This can be seen earlier if you press the D key. Once the game has started, it can be paused by hitting any key. Unpause by pressing a key again. The game can be aborted at any time by hitting one of the console keys. All right, face the magic.", "platform": "Atari 800", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Mark Price", "publishers": "ANALOG Computing", "genres": "Shooter", "max_players": "4", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148958-maze-war\n"}