{"altername_name": [], "name": "Monte Carlo", "overview": "From volume 9, issue 9 of Compute! dated September 1987. Casino excitement at home can be yours when you type in this solitaire card game. Monte Carlo is the name of a town in Monaco that is famous as a gambling resort. It also gave birth to the name of a card game with simple rules and complex strategies. To play Monte Carlo, shuffle a deck of cards and deal 20 cards into a grid 5 cards across by 4 cards down. The goal of the game is to remove all the cards from the grid. Cards can be removed only in pairs. The cards must be of the same face value for you to remove them. In addition, they must be adjacent vertically, horizontally, or diagonally. The remaining cards are moved to fill in the gaps. Slide cards to the left to fill in the gaps. Gaps at the right edge are filled in by moving cards up from the row below. When all the cards have been moved, two cards from the deck are dealt into the empty slots at the bottom right corner of the board. Eventually, all cards in the deck are exhausted. You win the game if you are able to remove the remaining cards from the board. As you can imagine, all this moving about of cards can take quite a long time if you're playing with a real deck of cards. Letting the computer do the busywork makes the game more enjoyable. As you play, you'll develop strategies. Each pair you remove can destroy other pairs on the board and create new ones. But you might also have fun just removing the first pair of cards that you see. This game can be played by those who would rather leave their fate to the wind, those who analyze the consequences of each and every move, and all those players in between. Three difficulty levels are included. The level affects the number of rows on the the grid. Easy is six rows, Medium is five, and Hard is four. Choose the difficulty at the beginning of the game.", "platform": "Atari 800", "release_date": "September 1, 1987", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Thomas Carlson", "publishers": "COMPUTE! Publications", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149107-monte-carlo\n"}