{"altername_name": [], "name": "Motorcycle Maze Rider", "overview": "An arcade\\maze game created by Charles Bachand and released in the very first issue of A.N.A.L.O.G. Computing Magazine in January of 1981 and later re-released in The ANALOG Compendium. You might have seen programs that draw mazes. These are not uncommon. The program draws an overhead view of a maze, and you and a pencil try to find the way out. It is easy because you have the whole maze there in front of you. Let's make things hard. What if you couldn't see the whole maze? A little harder. You can look at the maze only three times. \"What next?\", you ask. Well, I'm going to tell ya. We're going to put you in the maze with walls all around you. How do you like that? Now try to get out! Or in the words of Darth Vader, \"I have you now\". And now for a few words on how to play the game. First, you need a joystick inserted into controller jack #1. Moving the stick forward moves you forward in the maze, and pulling back on the stick puts you in reverse. Turning either left or right is accomplished by pushing the stick left or right, and the red button on the joystick allows you to glimpse a map of the maze. You can only look at it three times, so pay attention. To escape, you must find the glass panel that covers the exit and smash through it. You may select certain options when you start the game. The map option allows you to look at a map of the maze up to three times. The tire trail option leaves a trail on the ground where you have been. The hole in the wall option puts random holes in the walls about you to make it easier to get where you are going. And finally, there is the motorcycle sound option, for people who can't stand all the noise.", "platform": "Atari 800", "release_date": "January 5, 1981", "game_type": "Released", "esrb": "Not Rated", "developers": "Charles Bachand", "publishers": "ANALOG Computing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148576-motorcycle-maze-rider\n"}