{"altername_name": [], "name": "Nautilus", "overview": "Nautilus is a 1 - 2 player split screen submarine arcade game for the 8-bit Atari. Game is displayed in a split screen, with the top portion devoted to the destroyer Colossus, with the bottom half of the screen for submarine play. In a 1-player game, the player controls the submarine Nautilus, and must avoid depth charges dropped by the destroyer Colossus above. In a 2-player game, the second player controls the destroyer, and attempts to hinder the first player's progress. The Nautilus' is equipped with Thunderbolt torpedoes, which are used to destroy underwater cities and collect the Proto-Energy Pods at their center, and power the sub's engines. These torpedoes are also used to defend against enemy attacks. The destroyer's purpose is to transfer city repair crews from the right to the left side of the screen, while avoiding attacks from the submarine and its support helicopter. It is further armed with depth charges and Barracuda torpedoes to defend itself, but if it is damaged it will automatically return to the right of the screen for repairs. When repair crews are successfully transferred, an underwater city is rebuilt, scoring the second player 100 points. A further danger for the submarine is Limpet Lurkets, autonomous droids which inhabit the depths and seek out the submarine. The destroyer is armed with sonar, which tells the player when they are above the submarine, to encourage to dropping of weapons. The are 9 difficulty levels, and gameplay is timed, with the winner being the one with the most points at the end of a session.", "platform": "Atari 800", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Mike Potter", "publishers": "Synapse Software", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bL4plln68BQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129917-nautilus\n"}