{"altername_name": [], "name": "O'Riley's Mine", "overview": "In O'Riley's Mine, you take the role of an Irish miner by the name of Timothy O'Riley in a horizontally scrolling collect'em-up. Each level starts with you at ground level, where you have to make a quick decision as to where should you go to start digging, because straight at the bottom of the long narrow hole, a pile of dynamite is about to blow up, which will result in water flooding up the tunnels you are about to make. Your mission is to collect every bit of treasure scattered all over the limited area, but the constantly rising water acts as your timer, but it will only rise as far up as your tunnels allow it. So, in essence, it's a race against physics. To make things a bit trickier, the game will not allow you to mine more than one block's worth in any direction, but then again, you won't be able to get trapped under falling bits of ground. As an additional inconvenience, there are some roaming underground enemies trying to catch you, but being a seasoned prospector that you are, of course you have armed yourself with a few sticks of dynamite. The speed of monsters and water changes with the level of play, up to a point, so the game does offer a good deal of challenge. Like countless other arcade-style games of the time, O'Riley's Mine can be played by two players, but you will be taking turns, so the idea of fun there is shortlived. You also have the option to start the game from any of the first nine levels, so the more advanced players will not get bored as quickly. Still, it is an old-school arcade game at heart, so it does not have any long-term replay value to it, even with all the progressive difficult levels and two-player options and whatnot. It's just harmless bit of fun, with a couple of nice twists to it that make it stand out, and I can only recommend it as good way to waste your coffee break.", "platform": "Atari 800", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Mark Riley", "publishers": "Datasoft", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/1ygy55S1rfY?t=7", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/138124-orileys-mine\n"}