{"altername_name": [], "name": "One for the Road", "overview": "A text adventure created by Clayton Walnum and published in issue 41 of ANALOG Computing dated April 1986. \"Things are tough,\" I said. \"Tough all over.\" The bartender shrugged and relieved me of another dollar. I'd been perched by the bar for a coupJe hours now, knocking back snakebites and taking in the circus sideshow that was Smitty's Roadside Tavern. You never knew what you'd find at Smitty's. Just then, I was watching a jerk snatch flies out of the air and toss them into his half-filled mug of brew. Every time he snagged one, he'd look around and suck his teeth. yeah, you're cool, buddy. All I could think about was those poor flies, spending their last moments gagging on that cheap beer. I turned back to the bar in disgust and inhaled my tenth shot. \"Things are tough,\" I mumbled. And things were tough. I hadn't worked in months. Okay, I'll grant you that my type of work is hard to find. Not too many people are interested in hiring a professional risk-taker, but I had always managed to stay busy. After all, I'd do virtually anything — climb mountains, fly planes, hack through jungles. I was tough. They didn't call me \"Nails\" O'Riley for nothing. I was just about to order another shot when it occurred to me that things had gotten awfully quiet. I looked back to the fly killer, assuming he was somehow responsible for the sudden silence. But he was just staring toward the front door. Everyone was staring that way, but me. I decided to make it unanimous and turned to discover what was so interesting. The strangest man was standing there, couldn't have been more than five-foot-three. His face was buried beneath a thick white beard, and his snowy hair was blown into such disarray that it looked teased. Large drops of water oozed from his outdated suit to the floor. I guessed that it had started to rain. As I watched him, I was struck by the melodrama of the scene. My imagination immediately began to create a story around this little man. I cast him as a professor from the local university who had stumbled upon some amazing discovery. He had come to Smitty's to find the famous \"Nails\" O'Riley, with an offer of danger, excitement and, of course, ample remuneration. He would walk up, tap my shoulder and say something like \"Mr. O'Riley, I presume?\" I chuckled at my foolishness and signaled for a other shot. I was about to convert the amber fluid to the past tense when someone tapped my shoulder. \"Mr. O'Riley, I presume?\" It's a good thing the liquor hadn't passed my lips; I'd be choking still. I listened, open-mouthed, while he introduced himself as Pip Sigourney a professor from the local university who had made an amazing discovery. He told me he had evidence that, long before our present age, there existed a civilization with a technology superior to ours. \"But they didn't gain their knowledge of the sciences through the empirical methods we incorporate,\" he squeaked excitedly. \"No, indeed. They worshipped powerful gods. These gods, in turn, provided them with amazing things!\" He went on about strange machinery and midnight sacrifices and all sorts of weird stuff. All I cared about was how much this fruitcake would pay for what had to be a wild goose chase. My assignment was to go to a small island off the coast of Africa and verify the existence of this civilization. He would use whatever evidence I could dig up to convince his colleagues to mount a full-scale expedition. I agreed, of course. I didn't care if he was nuts; his money was just as green as anyone else's. After the professor left, I snatched up the waiting shot. The wad of bills he'd left with me was lying on the bar, and I noticed that the fly killer was staring at it goggle-eyed. Taking advantage of his distraction, I raised my glass and said good-naturedly, \"One for the road!\" He grinned, grabbed his mug and downed its contents in three swallows. It took him a few seconds to realize what he'd done. I left, a happy man.", "platform": "Atari 800", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Clayton Walnum", "publishers": "ANALOG Computing", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148701-one-for-the-road\n"}