{"altername_name": [], "name": "Pinhead", "overview": "Pinhead is a simple, strangely compelling but fun one-player game for the Atari computers. The game puts you in control of Pinhead the clown, a pointy-headed unicyclist, who is riding on a tightrope along the bottom of the screen. Above him are rows of balloons, which fall toward the ground at different speeds depending on their color. You must maneuver Pinhead under the balloon, so that it lands on, and is popped by, his pointy hat. If you miss a balloon, and it hits the tightrope, the vibration will knock Pinhead off the rope to an unseen demise below. Your only chance, if you miss a balloon, is to kick it back up in the air. Pressing the button on the joystick control will cause Pinhead to kick. Successful kicking, however, requires a great deal of practice, and is far more difficult than popping a balloon. After several rounds, other objects also begin to drop. These include such items as keys, candy canes and umbrellas. They can be caught and kicked, just like balloons, and they are worth many more points. The most dangerous object that falls is a bucket. Unlike other objects, kicking the bucket results in the loss of one of your five lives, so it must be caught on your head and popped immediately. Pinhead is one of those rare games that doesn't become easy or boring as you get better. Instead, it actually becomes more challenging and much more fun. The higher the level you reach, the more interesting the objects you get to see, and the faster the demand on your reflexes. Pinhead is not a \"serious\" video game; it doesn't ask you to save mankind. It lets you just have fun being a clown and popping balloons. This attitude is evident throughout the game, from the light music in the background to the cute intermission displays between rounds. This is the perfect game for someone who wants to have a little fun. To be successful in this game, kicking is a must. I would advise spending a round in which you try to kick everything in order to master the art. The game is essentially a clone of the arcade game Kick/Kickman.", "platform": "Atari 800", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Robert Jaeger", "publishers": "Utopia Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144830-pinhead\n"}