{"altername_name": ["Round Up"], "name": "Roundup", "overview": "A single player cowboy themed game from Richard Loken published in the 09/83 issue of A.N.A.L.O.G. Computing issue 13. The game of Roundup requires you to herd and lasso cattle. Plug your joystick into port 1 and press START to begin or restart the game. When the game begins, you will be seen riding a horse on the left side of the screen, between two fences. You can move up and down by pushing the stick. You cannot go above or below the fences. You will see that you are pursuing cattle to the right of you. The cattle must not be allowed to get behind you off the screen. If three cattle get behind you, the game is over. To prevent this you must move your horse into them and, with renewed vigor, the cattle will then sprint ahead. The cattle get tired, however, and repeated herding will not move the cattle as far. Nevertheless, a skillful trail hand should be able to drive them all day. While you are doing all this herding you may notice that you aren't receiving points. Points can only be scored by lassoing the cattle. Push the joystick button to throw your lasso. You must devote all of your attention to lassoing, so you will not be able to move up or down at this time. If your lassoing is successful, the longhorn will disappear and points will be scored. There are four kinds of cattle. They vary in color, speed and point value. One steer is particularly stubborn and cannot be herded. He must be lassoed or you will lose other cattle. As an added penalty, when the game ends, any unscored points will be lost. Between games your score and the high score are displayed on the bottom of the screen.", "platform": "Atari 800", "release_date": "September 1, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Richard Loken", "publishers": "ANALOG Computing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148590-roundup\n"}