{"altername_name": ["Centrale Nucleaire"], "name": "SCRAM", "overview": "SCRAM: A Nuclear Power Plant Simulation is an Atari 8-bit educational simulator of a nuclear power plant released in 1981 on cassette. It models a pressurized water reactor (PWR) called 'Silicon Valley Nuclear Power Station Unit 2', resembling the name and operation of Three Mile Island Nuclear Power Plant Unit 2, which suffered a partial nuclear meltdown in March 1979. Written in Atari BASIC, SCRAM uses differential equations to simulate reactor behavior. The player controls the valves and switches of a nuclear reactor directly with the joystick. This game's title, SCRAM, is taken from the nuclear reactor safe-word conceived at the University of Chicago in 1942. It stands for \"Start Cutting Right Away, Man\", and it refers to cutting a reactor's control rods so they fall into the nuclear material and stop the reaction process. The game also recreates the Three Mile Island Unit 2 nuclear reactor, and allowed players to recreate the events that took place there in 1979. The game display consists of a schematic-like representation of a light water reactor. The reactor core is on the left of the screen, with the primary coolant loop to its immediate right. Further right is the secondary cooling loop, and finally the tertiary cooling loop and its associated cooling tower. The user interacts with the game by moving the joystick, which makes a cursor jump from one \"hot spot\" to another on the screen, each one controlling one part of the reactor systems. There are hot spots for the control rods, cooling pumps and valves. The user can experiment with the reactor systems by moving the joystick up and down, operating the equipment. It is possible to simulate a meltdown by shutting off the primary cooling pumps and withdrawing the control rods all the way. The game has several skill levels, which control the frequency of earthquakes and the obviousness of the damage. In the event of an earthquake the screen shakes, and a breaking sound is heard if there is damage. The user then has to watch the on-screen displays to try to isolate the problem.", "platform": "Atari 800", "release_date": "1981", "game_type": "Released", "esrb": "Not Rated", "developers": "Chris Crawford", "publishers": "Atari", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Scram_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106386-scram\n"}