{"altername_name": [], "name": "Slither", "overview": "A game by S. Pearson and P. Kohut and published in A.N.A.L.O.G. Computing Magazine issue 51 of February 1987, though it had been created in 1985. It is springtime. Things are really starting to buzz. Birds are singing, flowers are blooming, and the sun is shining. All the animals are returning, or emerging from their winter retreats, and they're ravenous. They haven't eaten a thing in nearly four months. Slick is no exception. He just got back from his winter snake hole in the South of France, and there's only one thing on his mind: food! Lucky for him, his swamp has an enormous supply of turtle eggs, so he can devour all he wants. However, he can't just take his time chewing his food. A growing reptile needs all the energy he can get, or he just can't keep going. So, if Slick wants to make it to adulthood, he'd better make like a snake and Slither! Slither is a one-player game, so plug a joystick into port and boot up Slither. Take a deep breath, find a comfortable seat and push the START key to begin. The idea here is to move the snake around, through the maze, using the stick to guide him as he gorges himself on turtle eggs. To complete a level. Slick must eat all the eggs in a time limit of 90 seconds (the clock counts down 5 seconds at a time). Finishing a level changes the screen (there are three in all) and increases Slick's speed. Now, each time Slick wolfs down an egg, he grows a new segment — by holding his tail in place, while his head moves forward one space. So, the more eggs he eats, the longer and longer he becomes. This would be great — if it weren't for the fact that, if he moves backward, he kills himself, or if he runs into his body, he gets stuck and dies. The scoring is 10 points per egg and 1,000 points for the completion of a level. An extra snake is awarded for each 10,000 points. You'll soon see how quickly this game becomes difficult. We think this makes it fun — and a great test of your hand-eye coordination.", "platform": "Atari 800", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Paul Kohut", "publishers": "ANALOG Computing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148702-slither\n"}