{"altername_name": [], "name": "Sneak Attack", "overview": "Created by David N. Plotkin and published in A.N.A.L.O.G. Computing Magazine issue 36 in November 1985. You knew if had been too quiet. Nothing had shown on the scanner for the whole watch. That in and of itself wasn't unusual, hut intelligence had reported increased enemy activity. It seemed that a major move to capture and destroy the gun-bases that protected the Interior was being planned. Further, the enemy had developed a new type of intelligent robot, which could stand the shock of being parachuted to Earth and, once there, could team up with other robots to destroy the gun-bases. Intelligence reports indicated that each robot could carry one-quarter of the explosives necessary to pierce the armor of the gun-base you manned. The anticipated plan is thai the enemy choppers will drop robots, which, if they land successfully, will wait until three more robots have also landed, then team up to destroy your base. Since radio silence must be maintained, the robots only \"know\" about other robots in their direct line of sight, so four robots must land successfully on one side of your base. These robots are not invulnerable, however. If one parachuting robot lands on another, the one underneath will be crushed and immobilized. Your gunbase is a pretty awesome weapon. The missiles unleashed by your fire button are steerable left and right. The missiles are powerful, capable of obliterating the enemy's helicopters, as well as the robots. One strategic trick, learned in advanced gunnery class, is to use a missile to destroy a parachute by careful aiming, thus causing the robot to plummet to Earth, destroying any robots that happen to be beneath it. This is really the only method of destroying robots that are already on the ground. The enemy has split the attack into levels, and each level is faster and fiercer than the previous one. Duty calls, so plug your joystick into port 1 and prepare to defend your home as the attack commences! Good luck.", "platform": "Atari 800", "release_date": "November 1, 1985", "game_type": "Released", "esrb": "Not Rated", "developers": "David N. Plotkin", "publishers": "ANALOG Computing", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148703-sneak-attack\n"}