{"altername_name": ["Robin Hood Adventure"], "name": "SoftSide Adventure of the Month 14: Robin Hood", "overview": "Robin Hood is the fourteenth in series of monthly text adventures for multiple systems. You play as Robin Hood of Sherwood forest, with the goal of performing great deeds with your band of merry men. At the start of the adventure, Robin starts alone in Sherwood Forest, and must recruit Will Scarlet, Little John, Friar Tuck, and Allan A. Dale. As Robin explores the forest, he will intermittently find rich merchants, who can be relieved of their bags of gold. These can be used to buy arrows, a new bow, or a new sword, and the player is also awarded for giving gold to the poor. After recruiting all four merry men, the player must find horses for his crew, and they will all ride to Nottingham. There, the player can enter the archery contest in disguise, and if they are successful, will be awarded with a golden arrow. As he is awarded, Robin's disguise falls off, and he is arrested by the Sheriff, only to be saved by his band of men. Upon returning to Nottingham, Robin finds Maid Marion has been kidnapped, and must kill the men guarding her. After that, the player is chased by the Sheriff of Nottingham, who can be dispatched with an arrow. Finally, the player must meet King Richard and be knighted to achieve victory. The player is awarded points for 5 deeds: Giving money to the poor, winning the archery contest, saving Maid Marion, killing the Sheriff, and meeting King Richard. All commands are via 2-word VERB NOUN entries, and game play contains several object puzzles. There is no save and restore feature.", "platform": "Atari 800", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "SoftSide Publications", "publishers": "SoftSide Publications", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368973-softside-adventure-of-the-month-14-robin-hood\n"}