{"altername_name": [], "name": "The Amulet", "overview": "The Amulet is a text adventure game with the usual noun/verb parser, although adjectives and conjunctions can also be used, e.g. \"PUT BENT NAIL IN SMALL FIRE\". It was released both commercially and as a magazine disk feature. The game included a setup story, reproduced below. THE LEGEND OF THE CIRCLE OF NINE (which you need to read to understand the adventure) Many years ago, in the area we now call 'The Desolate Lands' there dwelt a nation born of wizards and witches. There was strong magic in those days and those who could manipulate the magic became powerful leaders, each with a following at loyal supporters. Throughout 'The Bitter Years' many fierce battles were fought between the opposing followers of the warlocks and witches, often resulting in tragic loss of human life, but seldom realty affecting the leaders themselves. This all changed with the arrival of Gadora. Some say she was the devil herself, others have darker thoughts, but most agree that it was Gadora who brought about the formation of 'The Circle of Nine'. Her strategy of war was simple: Her spells were cast to weaken the wizards and witches, then her soldiers rode in and killed them. The people conceded. Some of the finest areas fell under her command and her army pillaged and raped the population. Nearly a third of the known world fell to her. before the remaining nine leaders realised that they must pin forces if she was to be defeated. A pact was entered, a demon summoned and 'The Circle of Nine' was founded. The combined powers of the circle members prevailed and Gadora was denied her desire to conquer. Such was her strength however, that even the might of the Circle could not destroy her entirely, she was stripped of her powers and exiled forever from the known world. Then began the era that was to be remembered as 'The Golden Years'. an age of unprecedented enlightenment. The wizards and witches still ruled the land but instead of using their magic against each other, they joined tomes and created new spells. Spells that brought water to the arid deserts, a new hardier grain to the fields and cattle that grazed contented in the new green pastures The people grew strong in the shade of the Circle's protection and they crafted in leather and wood, bronze and iron and brewed fine wines As news of the Circle of Nine' and their spells spread, so more and more travelers came to view these events for themselves. Many brought their families and many settled and the community flourished and prospered. The members of the Circle rejoiced in the knowledge that they were well loved by the people of the land and from time to time certain special spells would be cast for the peoples entertainment and enjoyment. In return. the people continued to provide food, wine and clothing for the Circle members, as their fathers and forefathers had done. The golden years lasted for several generations but, it is said all good things come to an end and, sadly, the golden years were to prove no exception. As one summer came to a close and the autumn leaves were browning on the trees there came news to the Circle of a new settler in a Western land and her name brought shivers to the minds of the Circle members. Ledora was her name. She was a new young witch with a small following of soldiers and peasants. She denied the Circle's right to rule and rejected their intervention in her affairs. P.K. Psantam (who that year was 1st speaker in the Circle) was convinced that she was a reincarnation of their arch enemy Gadora and the rest of the Circle were concerned over her apparent disregard of their well established rights in the area. Little Is known of what happened next. Some say that Ledora trapped the members of the Circle and others believed was the Circle themselves who cast a wrong spell but the end result is now history. Suddenly, one autumn evening. the Magic went away.... The story continues on the disk", "platform": "Atari 800", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Peter Lister", "publishers": "New Atari User", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161592-the-amulet\n"}