{"altername_name": [], "name": "Upward", "overview": "In this game by Greg Knauss and published in A.N.A.L.O.G. magazine issue 59, from April of 1988, you start the game at the bottom of a nauseatingly deep cavern, and you must reach the top while both your life and air hold out. For you masochists, there are several ways to die: (1) Lava has the predictable effect on your guy - anybody who's lost a marshmallow while toasting it knows what that’s like. (2) Skyler the bat takes huge joy in chomping large bites out of you, thus reducing your strength and killing you slowly. To indicate that Skyler’s hurting you, your character will turn a bright pink, partly from anger, partly from rage - but, mostly, from embarrassment. (3) Darts. Your good friend Illinois Smith told you there were lots of these sorts of things in big caves. They're here, en masse. As with Skyler, these don't kill you instantly, but reduce your strength. And, of course, there's one way to lose air: breathe. Since you're assumed to be human (be it a correct assumption or not), you do this automatically. When the game is in progress, there are two gray bars across the top of the screen. The top one, labeled Str:, is how much strength you have left. The second one, Air:, is the oxygen left in your tanks, Once either reaches zero, it’s bye-bye! Life, tenuous as it is, is apportioned to you at the rate of only one per game. Now, since one life in a cave where death can come at any instant is very aggravating (not to mention annoying and frustrating), I would advise you to look before you leap. Move the joystick to have your man, er, person (sorry) move about. As might be predicted, you must be by a rope to move up and down. Jumping is accomplished by pressing the button. And, yes, you can jump off of and onto ropes. The SPACE BAR toggles the pause feature.", "platform": "Atari 800", "release_date": "April 4, 1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Greg Knauss", "publishers": "ANALOG Computing", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=VUbUeel1qEQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149030-upward\n"}