{"altername_name": ["Zork: The Great Underground Empire", "Zork I: The Great Underground Empire", "Zork 1"], "name": "Zork I", "overview": "Zork: The Great Underground Empire - Part I, later known as Zork I, is an interactive fiction video game written by Marc Blank, Dave Lebling, Bruce Daniels and Tim Anderson and published by Infocom in 1980 (first Atari version was 1983). The game begins near a white house in a small, self-contained area. The player uses text entry to manipulate and move through the world. The parser was advanced for the time, and allows complex constructs such as \"drop all but lantern\". When the player enters the house, it yields a number of intriguing objects, including a brass, battery-powered lantern, an empty trophy case, and an Elvish sword of great antiquity. Beneath the rug a trap door leads down into a dark cellar, which is revealed to be one of several entrances to a vast subterranean land known as the Great Underground Empire. The player soon encounters a colorful host of dangerous enemies, including deadly grues who only prey on their victims in the dark, an axe-wielding troll, a giant cyclops who flees in terror at the mention of Odysseus, a vampire bat that can drop the player anywhere in the mine if encountered, evil spirits guarding the Entrance to Hades, and a nimble-fingered thief armed with a stiletto who makes mapping the maze difficult by removing or scattering any items that the player might drop to leave a trail. The ultimate goal of Zork I is to collect the Twenty Treasures of Zork and install them in the trophy case. Finding the treasures requires solving a variety of puzzles such as the navigation of two complex mazes and some intricate manipulations at Flood Control Dam #3. Placing all of the treasures into the trophy case scores the player 350 points and grants the rank of \"Master Adventurer.\" An ancient map with further instructions then magically appears in the trophy case. These instructions provide access to a stone barrow. The entrance to the barrow is the end of Zork I and the beginning of Zork II. There are 28 ways for the player to die. It is possible to score all 350 points in 223 moves (and win the game completely in 228 moves) by exploiting a bug.", "platform": "Atari 800", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Infocom", "publishers": "Infocom", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Zork_I", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110633-zork-i\n"}