{"name": "Battle Kart 64", "overview": "Battle Kart 64 is an exciting new hack by Triclon that greatly expands and adds all sorts of new goodies to Battle Mode in Mario Kart 64. It is console compatible (note: requires the Expansion Pak).<br><br>Version 2.0 is now out! What is new?<br><br>New game modes Capture The Flag and Keep Away<br>Improved CPU bot AI<br>More CPU bot options, including 1 player full screen<br>Item boxes now work correctly in flat courses<br>Changing courses when on a race course goes back to the correct menu<br>Other various optimizations and bug fixes<br>Game Modes:<br><br>An expanded traditional battle mode.<br>“Hot Potato” featuring a timer on whoever was hit last and counts down to zero. Whoever is the “hot potato” when the timer reaches zero loses 1 HP.<br>“Squish” where you need to hit, lightning shrink, and then run over the shrunken player to score.<br>“Capture The Flag” where you must capture a flag and bring it back to your base to score.<br>“Keep Away” where there is one flag to fight over and each player must try to hold onto it as long as possible.<br>Scoring Modes:<br><br>Stock scoring where you can now set set the number of hit points, instead of just having 3 balloons.<br>Point scoring for Capture the Flag and Keep Away<br>Timed matches where whoever has the least amount of hits or most points when the timer reaches zero wins. Ties go to sudden death.<br>Free for All (FFA) or Teams of 2 vs. 2 or 2 vs. 1 with both point and time scoring.<br>CPU bots in Battle Mode!<br><br>Now you can play battle mode by yourself.<br>A lot of work has gone into making bots that will actually track you down and aim their items at you.<br>Best played in Block Fort or Double Deck or on wide open race courses.<br>Now you can play 1 player in full screen if you are just playing against the bots<br>All the race courses now will load in Battle Mode!<br><br>All 16 race courses can now be played in Battle Mode.<br>Great for Koopa Troopa Beach or Kalamari Desert.<br>Item toggling!<br><br>You can turn items on and off like in Super Smash Bros.<br>Hate stars? Just turn them off.<br>And a whole slew of other options!<br><br>Flat courses!<br>Ludicrous speed!<br>And more!!<br>Battle Kart 64 will continue to be under active development so the future will bring even more game modes and features.<br><br>See the readme for details on how everything works.<br><br>You can check out the source code for Battle Kart 64 here (although seldom updated): https://github.com/kfkaplan/battlekart64", "platform": "Nintendo 64", "release_date": "September 7, 2021", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "triclon", "publishers": "Romhacking.net", "genres": "Racing", "max_players": "4", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158019"}