{"name": "Dexanoid", "overview": "This is a very professional looking Breakout/Arkanoid Clone which can compete easily with at least 90% of the commercial N64 Games in my opinion..<br>50 Levels, 20 backgrounds, 10 Music tracks, 40 different types of bricks, dozens of Sound effects and Goodies are packed in this 128mbit rom.<br><br>Long-Time Value due to High Score Tables, a bunch of Cheats and large amounts of levels.<br>Level-Editors and Information about Dexanoid are available on the Official Dexanoid Home-site.<br><br>The gameplay for Dexanoid is quite simple: Avoid missing ball for high score. You move the paddle from left to right to knock the ball back against a breakable wall until all the bricks are gone; and then you move on to the next level. There are 50 levels in total, and they contain a variety of blocks. Some require one hit, others multiple hits, some are indestructible and the special blocks drop upgrades for your paddle and ball. I only managed to make it to The Ridge, since I encountered a glitch that made the ball get stuck at the top of the level.<br><br>What sets this game apart from other Arkanoid style games is that it has a scrolling screen as well as several terrain features that make the level never be a perfect rectangle. This might not seem like a big difference at first, but it adds a whole level of challenge. Half of the time you’re playing, you can’t see the ball, so you have to familiarize yourself with the layout of the level and predict where it is going to bounce ahead of time.<br><br>As with most Arkanoid and Pong games, the center of the paddle bounces the ball straight up, and the edges shoot it off in either direction. One odd thing that I noticed is that the vertical speed is always constant. The horizontal speed varies depending on where the ball enters contact with the paddle. This makes a bit strange when there’s a sudden change in angle since it appears that the ball is rapidly accelerating or decelerating and lacking any sense of momentum.<br><br>This is definitely worth having a look at it, as it’s the largest and most complete unique N64 game out there.", "platform": "Nintendo 64", "release_date": "December 20, 1999", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Protest Design", "publishers": "Protest Design", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "2.9", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118100"}