{"name": "Freak Boy", "overview": "Freak Boy was scheduled to be in stores in early 1997 but was cancelled after its publisher, Virgin Interactive Entertainment, decided to made the development team to rework the project multiple times because of marketing decisions.<br><br>Players will be drawn into the intense 3-D action as they assume the role of Freak Boy, the lone survivor of a massive alien invasion. On New Year’s Day, when the planets are aligned with the sun, the ZoS, an alien race from a parallel dimension, take over the Hedron Universe, extinguishing the sun and transporting all of the Hedrons to the alien dimension. The only Hedron to evade capture is Freak Boy, who is destined to become the hero of his people, provided he can rid his universe of the alien threat and return the captive Hedrons to their rightful dimension. As Freak Boy, players can absorb remnants of the destruction into their body and utilize them as weapons to destroy the alien invaders. What’s more, the variations on these weapons are almost endless. Capable of holding three new artifacts at a time, each with a different capability when used as head, chest or feet, Freak Boy is never the same character twice. Freak Boy’s body is constantly morphing as new artifacts are assimilated and old ones are discarded. In managing the inventory of weapons as they enter and exit Freak Boy’s body, the player gains new abilities in his fight to destroy the more than 50 enemies who have set out to conquer the Hedron universe. On their quest for more powerful weapons and the alien enemy, players will explore more than 25 distinct worlds throughout five levels of difficulty. Each world is radically visual, arid and stark, yet with texture, mystery and entertainment that lure the player further into the world of Freak Boy.", "platform": "Nintendo 64", "release_date": "", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Burst", "publishers": "", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=mNhLdcAIW00", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134748"}