{"name": "GoldenEye 007 with Mario Characters", "overview": "This mod replaces all of the characters with ones from the Mario universe along with edited dialog to make more sense with the characters. For example there is no mention of Trevelyan/Luigi's parents being Lienz Cossacks and instead of calling James Bond/Mario the \"Golden Boy\" he says the \"Golden Bro.\" Other changes include the dialog where Mario meets Natayla/Peach as Mario doesn't straight up say he's a spy to her. <br>The Briefing is edited to not only replace the names, but also with slightly different text. Not much, but there are small differences. Moneypenny/GoldCoin however actually has some different dialog such as mentioning that there is a girl in the cell next to you for Bunker 2. However the story itself is mainly the same as the original, with all Levels playing out basically the same as the original. There's small differences but for the most part it's just bug fixes with nothing majorally different to the levels....besides Train because characters are different sizes compared to the original but it functions the same as the original. <br><br>Characters: <br>James Bond - Mario <br>Natayla Simonova - Peach <br>Alec Trevelyan - Luigi <br>Xenia Onnatop - Daisy <br>Arkady Ourumov - Bowser <br>Boris Grishenko - Yoshi <br>Dimitri Mishkin - Donkey Kong <br>Valentin Zukovsky - Wario <br>May Day - Pauline <br>Oddjob - Toad <br>Jaws - Waluigi <br>Baron Samedi - Rainbow Bowser, the Powered-Up version of Bowser from Super Mario 64. <br>Soldiers/Civilians/Scients - Koopa Troopas <br>Heads are now different expressions to make use of the Random Head system, hats/helmets are replaced with tiny models & Bounding Boxes of 0 because they would get hit first despite being inside the head. Thought about making them sunglasses, but it'd still get hit first before the back of the head did and overall was unfairly annoying. <br>Mishkin/Donkey Kong is no longer the Defense Minister, that role now goes to May Day/Pauline with Donkey Kong being the Head of Special Forces. This was done to give Pauline a role in the story, as well as explain why the \"Great Guards\" use DK's body. <br>Dr Doak is now Oddjob/Toad to give him some sort of role in the story, as a result the idea of Toad \"blending in\" with the other scientists is ridiculous.", "platform": "Nintendo 64", "release_date": "2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Shooter", "max_players": "4", "cooperative": "No", "rating": "3.2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=2InaPLqFd6g", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104564"}