{"name": "Chapolim X Drácula: Um Duelo Assustador", "overview": "Vampires' population in Transilvania has increased a lot lately, and there's not enough human blood to feed them all. To solve this demographic problem comes Chapolim!<br><br>Chapolim X Drácula: Um Duelo Assustador (which translates Chapolim vs. Dracula: A Frightening Duel) is an authorized \"hack\" of Ghost House, with Ghost House's hero, Mick, replaced by Chapolim (or El Chapulín Colorado in original Spanish), a famous Mexican character from a TV series. Chapolim is a parody to superheroes in general. He dresses a red grasshopper costume with a yellow heart in the chest with the leters \"CH\". He also usually carries his Marreta Biônica (Chipote Chillón in the original, Squeaky Mallet in English) a red (toy) hammer.<br><br>At each stage, Chapolim must defeat five vampires that are in torpor within their coffins. The coffins are locked, so he must first find the keys to unlock them. He'll find the keys killing the most diverse enemies that haunt the mansion he's in, such as ghosts, bats, fire blowers, mummies, etc. Once he's got a key, he must unlock a coffin and then defeat the vampire who sleeps there.<br><br>In order to kill his enemies, Chapolim can jump over them or punch them. Every once in a while, his Marreta Biônica will come flying from one side of the screen to another, and if he jumps over it, he'll catch it. Chapolim can also punch the lights of the mansion: they'll flash and paralyze his enemies.<br><br>Chapolim starts with 3 lives and no continues. He'll be healed by collecting treasures through the castle, and will gain additional lives at every 50,000 and 150,000 points.<br><br>All the text in the game is in Portuguese.", "platform": "Sega Master System", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Tec Toy", "publishers": "Tec Toy", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.78", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31997"}