{"altername_name": [], "name": "Clogger", "overview": "Clogger is a Repton style game developed by Gordon Key and published by Impact Software in 1988. The game consists of a main program plus four game files of five levels each. You will be given a loading picture and then a menu from which you can select one of the four game files: SLIPPER, BRUSHES, ARTIST or PAINT. Other game files can be loaded from the Instruction Page in the game itself. The game objective is to become a Master Clogger, you must complete the twenty levels without using passwords. You have five lives with which to do this. Each level requires you to gather 21 pieces of a picture and push them to the finish area. They must then be inserted in the right way to build up the complete piece of artwork. You must also eat all the cakes. When both the above have been achieved, the level will end, and you can move on to the next one. You will then be given the password for that level. The finish area is always seven objects wide by three objects high. This can be at any position on each particular level. It will be full of earth, which will need to be removed before the pieces of artwork can be inserted. Certain pieces of artwork may seem inaccessible. You will have to find out the route to them by using or moving the drills, lawnmowers, buffers and gyroscopes on the way. This must be done within a limited time period. A map of each level can be obtained by pressing M during the game. Time will continue to tick away, so plan your strategy quickly. To see the finished piece of artwork that needs to be assembled press P during the game. You can also see the clock ticking away. Time is limited for each level and if time runs out, you will run out of energy and lose a life. However, your energy can be increased, and therefore your time increased, by eating cakes which will each give an extra 30 seconds worth of energy. Don't eat too much at a time - the maximum time you can have at any stage is ten minutes. The only stage that time will stand still is on the status screen.", "platform": "BBC Microcomputer System", "release_date": "1988", "game_type": "Released", "esrb": "", "developers": "Gordon Key", "publishers": "Impact Software", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=T8kdJrTHtog", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40465-clogger\n"}