{"altername_name": [], "name": "Drogna", "overview": "Drogna was originally a floor-tile puzzle game which featured on the UK television game show The Adventure Game. The game became so popular that Acornsoft released a version for the BBC Micro home computer. The board displayed on the screen contains rows of 'Drogna' in five different shapes and colours. At the top and bottom of the board are the players' home bases and at each side are the vaults, each of which contains three diamonds. The game always starts with the red player having a half-turn. After that, each player has a full turn, and the current player is indicated by his man moving his head from side to side on the screen. The aim of the game is for each player to score points by collecting diamonds from the two vaults and depositing them in his own home base. Once a diamond has been removed from a vault it cannot be replaced and it retains its value until the end of the game. A diamond can be classed as being in one of three different states - either swag, loot or dump. While a diamond is still in a vault or on a drogna it is referred to as loot and can be picked up by either player. After it has been picked up and is being carried around, it is referred to as swag and the player holding it has the value of it displayed in the box at his home base labelled swag. If a player manages to deposit a diamond at his home base the diamond is referred to as dump and again its value is displayed at his home base, this time in the box labelled dump. The player who owns a dump does not gain the score for it until another swag is dropped on top of it. Until this happens the dump can be stolen by his opponent, although the player who placed the dump in his home base is not allowed to remove it again from there. The game ends when one of the players manages to score 900 points.", "platform": "BBC Microcomputer System", "release_date": "1983", "game_type": "Released", "esrb": "", "developers": "Patrick Dowling", "publishers": "Acornsoft", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/74420-drogna\n"}