{"altername_name": [], "name": "Felix in the Factory", "overview": "Felix in the Factory is a platform game for home computers developed by John Chaytor and published by Micro Power (a.k.a. Program Power). The game was first released in 1982 for the BBC Micro. It was ported to the Acorn Electron (1983), Commodore 64 (1984) and Memotech MTX (1984). It is the first in a trilogy of Micro Power games featuring the factory worker Felix and was followed by Felix and the Fruit Monsters (a Pac-Man style overhead maze game) and another factory-based platformer, Felix meets the Evil Weevils. The object of the game is to keep the Generator, in the bottom right of the factory, filled with oil. If the level of oil, shown at the bottom of the screen, gets too low the lights will start to fail and eventually the Generator will stop. To oil the Generator, you must guide Felix down the ladder, along the conveyor belt, jumping over the packages, up past the Gremlins to the oil can and then back to the Generator. To help you past the Gremlins, use the pitchfork which is hanging on the wall somewhere and run at the Gremlins. You should be able to knock them off the conveyors. Another hazard of the factory is the Rat. This will run across a level from time to time. A bag of rat poison is provided to help you reduce the rodent population and you can leave this on any level that you wish. You can only carry one object at a time and once you have the oil can, you cannot drop it again. If you trip over the packages on the conveyor belt you will be given a chance to get up again but if you reach the edge of the screen, you will lose a life.", "platform": "BBC Microcomputer System", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "John Chaytor", "publishers": "Micro Power", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.92", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=r5vgPxhicH4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40551-felix-in-the-factory\n"}