{"altername_name": [], "name": "League Challenge", "overview": "Manage your favourite football team your way. No more matches lost because the manager chose the wrong team or played a wrong combination. Now is your chance to go for Division One. Maybe even win the league and cup double. Who knows, you may even find the manager's job is more difficult than you thought. Select your team from one of the 64 teams listed. (You can if you wish change your team name.) Whichever team you select, you will begin the game at the bottom of Division 4. There are 15 league matches to be played in each division together with 'knock out' cup matches. Train your team to combat the strengths of your opponents. Select your defenders (D), mid-field (M) and attackers (A) on the basis of their skill (S) and fitness (F). In your team, a player is either playing (P), injured (I) or available to play (-). Remember that players need to be rested occasionally to improve their fitness. Skill can not be increased. If a player is not good enough for your team, he can be sold on the Transfer Market. You can have up to fifteen players in your squad at any time. At the end of each match, you will be shown the results of other matches played that day, together with a league table showing your position, goals for and against, points earned and matches played. Your Financial Position will show your total income and expenditure for the week together with a running total of your capital. You are allowed to go into debt to a maximum of £250,000. Over this, you are bankrupt and must start the game again at the bottom of division 4. At the end of each season, the top three teams are promoted to the next division and the bottom three are relegated. You keep the same team for the start of the following season, but the player's skill and fitness levels will be changed. Can you win the double? Can you take your team to the top of Division One? Will you be voted \"Manager of the Year\"? Or will the crowd jeer as your team is relegated yet again? Good luck! You will need it.", "platform": "BBC Microcomputer System", "release_date": "November 1, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Nigel Edwards", "publishers": "Atlantis Software", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bgh_vroqrFY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155973-league-challenge\n"}