{"altername_name": [], "name": "Sphinx Adventure", "overview": "PHINX ADVENTURE was the first adventure to be released by Acornsoft and is, to my knowledge, still the only one available on cassette for the Electron. It's modelled very generally on the original Crowther and Woods' Colossal Caves. You'll meet some familiar characters in it, though, to be fair, it is nothing like Colossal Caves and is a very worthy adventure in its own right. Your task is to search an underground complex to add yet more treasures to the pile you have built up from previous adventures. You start your quest on a well-trodden road and a quick search of the countryside should find you equipped for the start of your quest. Then it's off to the Valley of Doom and down the Hall of Spirits for the start of your perils. You'll soon come across a pirate and a dwarf who will leave you an axe. Your first major problem is likely to be in getting past the fiery passage - this is where you find out whether you have the bottle for this adventure! Later you'll need to escape from a sea-serpent - match that if you can! The troll shouldn't prove to be much of a problem. You should be able to discover where he puts his loot. Right! That's enough clues! One thing I couldn't discover was whether there was any meaning to the graffiti in the Inner Sanctum. I'm sure that there are more locations to be discovered here. Please let me know if you have figured it out. I've managed to map more than 100 locations so it is a big adventure. In fact I must confess that it is one of those games that keeps you up until the small hours. Five o' clock in my case. Overall, an extremely good adventure and one that I can wholeheartedly recommend. Let's hope Acornsoft do conversions for their other adventures. Excellent stuff.", "platform": "BBC Microcomputer System", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Acornsoft", "publishers": "Acornsoft", "genres": "Adventure", "max_players": "1", "cooperative": "Yes", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73080-sphinx-adventure\n"}