{"altername_name": [], "name": "Star Port", "overview": "Star Port is an arcade adventure developed by Tony Oakden and released by Superior Software. You have to find the five medical cases, and bring them to the top of the starport, where you can lift off in your space shuttle. The STAR PORT is triangular in shape. You commence the mission at LEVEL 0, the lowest level. Dotted around are objects which can be collected by simply walking or jumping on to them. Once collected, the objects will be used automatically. The objects include; oxygen cylinders (which add 500 units to the remaining oxygen, up to a maximum of 1,000 units), batteries (which boost the energy level), extra blaster ammunition, medical supplies, numbered security doors. The security doors are red with numbers on them. The red doors with E on them cannot be opened with pass keys. Blue doors can only be opened by solving a puzzle (see below). The base is populated by robots. These are destroyed by various numbers of hits by the blaster. Points are scored for destroying the robots, with higher scores being obtained for destroying the flying robots. You must score at least 500 points by destroying robots in order to complete the mission successfully. Your mission can be terminated in three ways; run out of oxygen, run out of energy, run out of puzzle time. Puzzle Instructions To open a blue door, you must solve a puzzle. Each puzzle consists of four inerlocked wheels, which must be rotated in order to get the letters into the pattern; A B C D E F G H I It is useful to practise puzzle-solving before commencing the mission (by pressing the P key), as once you are in the game, then the puzzle must be solved within a time limit. On LEVEL 1 only one wheel needs to be turned to complete the puzzle, on LEVEL 2, two wheels need to be turned ... and so on.", "platform": "BBC Microcomputer System", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Tony Oakden", "publishers": "Superior Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40381-star-port\n"}