{"altername_name": [], "name": "Zenon", "overview": "Zenon is a video game developed by Ian Collinson and published for the BBC Microcomputer by Impact Software. It's a side-scrolling shooter comprising of 250 levels. You have 4 lives to complete each of the levels which are approximately 10 times the length of the screen. To complete a level, you must generally keep moving to the right whilst avoiding and shooting such aliens, fireballs and meteorites. The game can be played by one player or two players together. At the start of each level, you will be beamed down to the surface of Zenon. If two players are selected then both players will be beamed down together. You cannot harm another player by shooting at him. For a short period after beaming down you will be immune to hostile attacks. This is signified by the energy indicator flashing on and off on your status panel. You can run along the surface or fly using your everlasting atomic jetpack. Various enemies will attack you and you must either shoot or avoid them. Contact with these or their laser shots will reduce your energy and when you lose all energy you will lose one of your 4 lives. After losing a life you will once again be immune to hostile attacks for a short period. If you can avoid being hit for a while your energy will gradually increase. However, it is also possible to obtain extra energy by collecting energy cells that appear from time to time. These are flashing diamonds with a letter 'E' inside them. Your current weapon is shown on your status panel but you can select different types by collecting the weapon canisters as they pass.", "platform": "BBC Microcomputer System", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Ian Collinson", "publishers": "Impact", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.88", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=gR_MzI0qI_w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/41323-zenon\n"}