{"altername_name": ["Alien Breed: Special Edition / Quak"], "name": "Alien Breed Special Edition & Qwak", "overview": "Alien Breed: The game was based heavily, and unofficially, on the Alien films, specifically Aliens, and also on the 8-bit-era games Laser Squad and Paradroid (although the game bears some gameplay similarities with Gauntlet, with which it has been compared, as well an obvious comparison with Sega's Alien Syndrome). Alien Breed consists of the player or players having to find the lift down to the next level, occasionally setting the self-destruct sequence to blow up the level above them. The players collect or purchase a variety of weapons from the space station's computer terminals. In some versions of the game, these so-called Intex terminals provide additional features such as a clone of the classic computer game Pong. Credits found on the ground have to be saved for these weapons and other enhancements, each giving the players an edge over the gradually more and more powerful Alien forces. In advanced levels, players are occasionally trapped in enclosed spaces with huge \"boss\" aliens, reminiscent of the Alien Queen. Qwak: The object of the game is to guide a green duck through eighty levels. Fruit and gems can be collected for points, and enemies are eliminated with projectile egg weapons. Progress through the game is earned by collecting gold and silver keys. There are a variety of power-ups also available, including 'chocolate egg' weapons and extra shots. In addition to the normal-style levels, the challenge levels require the player to complete levels and collect all fruit within twenty seconds. Upon completion of all eighty levels, the levels are looped.", "platform": "Commodore Amiga CD32", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Team17 Software", "publishers": "Team17 Software", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/42892-alien-breed-special-edition-qwak\n"}