{"altername_name": [], "name": "Frontier: Elite II", "overview": "There is no plot within Frontier, nor are there pre-scripted missions (as there are in its sequel, First Encounters). Instead, players explore space while trading legally or illegally, carrying out missions for the military, ferrying passengers from system to system, engaging in piracy or any combination of the above. As a consequence, Frontier cannot be completed or \"won\", and players instead decide what to aspire to and set out to achieve it. In Frontier, the player begins in the year 3200 and assumes the role of one of Commander Jameson's grandchildren, having inherited one hundred credits and an Eagle Long Range Fighter from him. By the game’s standards, these are very modest resources, and are intended as a spur to encourage players to earn money by whatever means they feel is appropriate. Though the plot is minimal, some background information about the universe of Frontier is provided. There are two major factions in the galaxy: The \"Federation\", based in the Sol system, and the \"Empire\", based in the Achenar system. These two factions are bitter enemies, but at the time of the game they have established a tense cease-fire, akin to the Cold War. Players are free to side themselves with the Federation, the Empire, both, or neither; the game does not restrict one's political career. Both sides have military forces that a player can run freelance missions for, with successes leading to a military promotion. The ranks of the Federation and Empire are independent of each other. Playing for both sides adds to the difficulty to acquire a rank promotion for either.", "platform": "Commodore Amiga CD32", "release_date": "1993", "game_type": "Released", "esrb": "", "developers": "Frontier Developments", "publishers": "GameTek", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "https://en.wikipedia.org/wiki/Frontier:_Elite_II", "video_link": "https://www.youtube.com/watch?v=IvrFRAkxz7w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43504-frontier-elite-ii\n"}