{"altername_name": [], "name": "Impossible Mission 2025: The Special Edition", "overview": "As an erstwhile Spectrum and C64 owner, the name Impossible Mission sends all sorts of chills up and down my spine. I can well remember countless days and nights spent searching rooms in a secret underground bunker, looking for the missing parts of a puzzle that would allow me to enter the hidden room and kill the mad professor who is trying to take over the world. \"Destroy him my robots,\" cried the voice of said sanity-challenged intellectual. The presentation has been updated, but the actual game remains much the same. You have to search every object in each location for the parts of a puzzle, which must be solved to open the exit for the location. As items are searched, various other objects can be found, such as single shot guns, jetpacks, mines and all manner of other toys and freebies. So what improvements have been made over the original? Well, you now have three different characters to choose from instead of the original one. The rooms have been broken down into levels and expanded to a hundred times their original size. After playing the game for a few nights, I have to admit I feel a little disappointed. By trying to combine a puzzle game with a platform title, MicroProse seems to have fallen between two stools. This game just doesn’t have the charm or excitement of the original, but perhaps fond memories have clouded my view. Don’t get me wrong, this isn’t a bad game, it just gets tedious after a few goes. It may have been up for the nineties, but it belongs in the eighties.", "platform": "Commodore Amiga CD32", "release_date": "1994", "game_type": "Released", "esrb": "", "developers": "MicroProse", "publishers": "MicroProse", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "2.38", "wikipedia": "https://en.wikipedia.org/wiki/Impossible_Mission_2025", "video_link": "https://www.youtube.com/watch?v=FJD6R6a_AbU&ab_channel=OldGamesDatabase", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/88005-impossible-mission-2025-the-special-edition\n"}