{"altername_name": [], "name": "Inherit the Earth: Quest for the Orb", "overview": "In this game you are Rif, a young fox, who is falsely accused of stealing the magical orb of storms. This orb is capable of predicting when storms will arrive. Obviously this is important to farmers, but it is just as important to the boar tribe, for their supply of mud. You'll have to find the Orb and the real thief, to clear your name, save your girlfriend and prevent war with the boar tribe. While your doing this you'll encounter a much larger mystery: What is the origin of the tribes? Legend has it that the humans gave the animals the power of thought and speech, and then vanished. Who were they and what happened to them? Something of a holy grail for us is the uncovered English language version of the adventure game \"Inherit the Earth\". This charming adventure game featuring furries anthropomorphic animals was already released for the Amiga in German but (to the best of our knowledge) the unreleased English version has never been on the Internet - until now. This unofficial version is largely the same to what appeared on an Amiga Future cover disc several years ago but with a few changes: Signed with a trademark file so it will boot on a stock CD32. The \"Bonus\" folder from the German release is included, which includes: mod files, animations, CDXL videos, AGA and ECS demo versions of the German release. Manual PDF is also included in the Bonus folder (sourced from: http://adventure.klasyka.do.pl/files/inherit.pdf). The startup-sequence is the same except for the addition of a doublespeed command", "platform": "Commodore Amiga CD32", "release_date": "June 5, 2017", "game_type": "Unlicensed", "esrb": "", "developers": "ReaLogic", "publishers": "", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/140351-inherit-the-earth-quest-for-the-orb\n"}