{"altername_name": ["James Pond 3: Operation Starfish"], "name": "James Pond 3: Operation Starfi5h", "overview": "The gameplay in Operation Starfish is similar to Super Mario World. The map of the Moon consists of many levels connected with pathways. The levels are grouped into themed sections including cheese, custard, ice cream and more, with each section culminating in a boss fight. Many stage names are a play on words, such as \"The Garden of Edam\" for the first level (named after the Garden of Eden). A unique twist to the standard \"Super Mario\"-style gameplay is that Pond's magno-boots allow him to run up walls. Once on a ceiling, Pond will only fall down if he jumps off, and some levels have sections which the player must navigate in this upside-down fashion. Although Pond can no longer stretch his body upwards as he could in the preceding game, many levels give the player gadgets that allow Pond to travel a great distance upwards. Pond can run, jump and punch as standard. He can also use a wide array of items that he encounters, such as spring shoes, fruit guns and dynamite. By finding a special icon, players can play as his partner, Finnius the frog, as long as he has been rescued in a certain level. A cheat code allows the player to play as Finnius in all levels. Finnius can bounce repeatedly on his belly to jump increasingly high in the air, but cannot use any gadgets except for chattering teeth. The goal of each level is to find one of its communication beacons and break it. Some levels have beacons that will not activate until four colored teacups are found and collected by the player. Many levels have a hidden pickup that will reveal a secret route once the level is completed, in a similar fashion to the secret exits in Super Mario World. Finding at least some of the secret levels is essential to finishing the game successfully. The player is informed that they need to destroy all of Dr Maybe's Cheese Mines, but this will not give the full ending once the final level is beaten. Certain levels contain \"Stiltonium\" extractors that Dr Maybe is using to produce a superweapon - these need to be destroyed in addition to the cheese mines to in order to finish the game completely.", "platform": "Commodore Amiga CD32", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Millennium Interactive", "publishers": "Millennium Interactive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.04", "wikipedia": "https://en.wikipedia.org/wiki/James_Pond_3", "video_link": "https://www.youtube.com/watch?v=xA4T_sk-9z0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/42918-james-pond-3-operation-starfi5h\n"}