{"altername_name": [], "name": "Liquid Kids & Snow Bros", "overview": "Snow Brothers for example is a brilliant game by Ocean France, as it has full scrolling nearly arcade perfection and goes to prove that the Amiga could handle arcade style games as long as it was being done by the right people. It is just a shame it never officially saw a commercial release, as the Amiga community would've lapped it up as a highly collectable item. Snow Bros. is a fixed-screen platform game where players must defeat all enemies on each level (screen), 50 altogether. The Snow Bros use snow as their weapon, throwing it at the enemies to stun them. When lots of snow is thrown at an enemy, it becomes covered in a flurry and unable to move. These can be rolled into giant snowballs and pushed or kicked into other enemies. If left alone, enemies will eventually defrost and become angry at the player. The enemy filled snowballs are a much stronger weapon then the regular handful of snow and are the only effective weapon Nick and Tom have against the bosses. In Liquid Kids, you play Hipopo the Hippopotamus who must venture through a large number of enemy-packed levels in search for his missing girlfriend, as well as rescuing other hippo-like creatures along the way. The game features moving platforms, collapsible floors, boats, water-wheels, and plants that can be watered, causing them to grow and allowing you to reach much higher platforms. Hipopo is supplied with magical water globes, which can be thrown at enemies to freeze them. Once frozen, the enemies can be kicked and destroyed completely. If idle for a few seconds, enemies will unfreeze themselves and continue their business. Every two levels is a boss that needs to be defeated in order to proceed to the next one.", "platform": "Commodore Amiga CD32", "release_date": "2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Earok", "publishers": "", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368214-liquid-kids-snow-bros\n"}