{"altername_name": [], "name": "Nigel Mansell's World Championship", "overview": "The player can race a single race, do a season of Formula One, or practice their skills on a particular race track. Either music, sound effects, or both can be shut off on the options menu. The changing of the tires is mandatory on pit road during the middle of each race, and weather can determine whether the player should use hard tires, soft tires, or rain tires. Before the beginning of the race, it is possible to change some aspects of the car, such as spoilers, tires and gearbox. Being licensed by Nigel Mansell, the game followed the 1992 Formula One season, which he won. The player takes on Mansell's role to try to win the title against eleven other real-life drivers that were still active in their careers by the time the game was launched. Like Sega's own Super Monaco GP, each of them belongs to their own team (instead of the common F1 format of two drivers per constructor). Although all the rival cars' colors resemble the actual constructors' colors by that time, only Mansell character wears a suit in the same color of his team's — blue. Mansell is also the only character to have his own sprite, distinguished by his signature mustache and cap. All the other drivers are shown with a similar sprite, all of them in yellow racing suits. The player also has the option to change Mansell character by setting a different name and nationality. The countries available on custom mode are South Africa, Mexico, Brazil, Spain, Finland, Monaco, Canada, France, Great Britain, Germany, Hungary, Belgium, Italy, Portugal, Japan, Australia, Austria and United States. However, the playable character's appearance will remain that of Mansell. The game also features the national anthem for each of these countries, played in the podium whenever the player character wins a race. If a rival wins the race but the player finishes as runner-up or third place, the podium will still be shown, but the anthem to be played will be the one of the winning driver's home country. The rivals can't be customized.", "platform": "Commodore Amiga CD32", "release_date": "1993", "game_type": "Released", "esrb": "", "developers": "Gremlin Graphics Software", "publishers": "Gremlin Graphics Software", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3.8", "wikipedia": "https://en.wikipedia.org/wiki/Nigel_Mansell%27s_World_Championship_Racing", "video_link": "https://www.youtube.com/watch?v=g_Ax6joFudc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45654-nigel-mansells-world-championship\n"}