{"altername_name": [], "name": "Pinball Fantasies", "overview": "Like Pinball Dreams, Pinball Fantasies contains four themed tables with various difficulty levels. \"Party Land\", the table included in the shareware release, is oriented around an amusement park, where the letters of either PARTY or CRAZY must be lit to start a high-scoring event. \"Speed Devils\" is focused on car racing, and the player must overtake cars to take the lead. \"Billion Dollar Gameshow\" is a game show-style table where the player attempts to win prizes by achieving certain combinations of ramps. \"Stones 'N Bones\" is based on a haunted house, where the player must light eight successively more rewarding modes by completing a bank of targets marked STONE-BONE and then cycle continuously through the modes. All four tables award one extra ball at the instant the highest score in the list is exceeded, and when the match at the end succeeds. Each table has one special ramp, usually one but with two on Speed Devils, which keeps track of the number of hits as a running total of Cyclones (Party Land), Miles (Speed Devils), Skills (Billion Dollar) or Screams (Stones). The first shot counts for two. Each of these shots is worth 100,000 in the bonus. Except for Party Land, the tables also award special awards at specific numbers. Each of the four tables has one or two high-scoring rounds that can be started by achieving certain objectives. Specific numbers of Miles and Skills trigger their respective tables' rounds. The scores for these modes, excluding Tower Hunt, are awarded as part of the bonus though not multiplied, and can be lost if the game is tilted.", "platform": "Commodore Amiga CD32", "release_date": "1992", "game_type": "Released", "esrb": "", "developers": "Digital Illusions", "publishers": "21st Century Entertainment", "genres": "Action", "max_players": "8", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Pinball_Fantasies", "video_link": "https://www.youtube.com/watch?v=yD6RD7ahxXQ&ab_channel=OldGamesDatabase", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43508-pinball-fantasies\n"}