{"altername_name": [], "name": "Simon the Sorcerer", "overview": "The story begins with an ordinary teenager, called Simon, who hears his dog, \"Chippy\", up in in the loft of his house Seeking to investigate, Simon finds that the dog had discovered a spellbook titled \"Ye Olde Spellbooke\" in an old chest; both the dog and the book had turned up sometime before the story from an unknown location. Simon throws the book onto the floor in contempt, not believing in magic, only for a portal to open above it as a result. Chippy quickly goes through the portal and Simon follows, ending up in another world. After escaping from some goblins who intended to eat Simon, he quickly discovers a house in a village belonging to a wizard called Calypso, along with a letter from him. Through it, Simon learns he was brought to this world to save Calypso from the evil sorcerer, Sordid. Instructed to become a wizard, Simon is told to seek out wizards in the local tavern, and complete tasks with them. Helping them to acquire a staff, and paying a subscription fee, he then performs tasks for various people, recovering the spell book he lost, as well as locating Sordid's tower. Gaining entry with a potion that shrinks him, he quickly winds up in the tower's garden and finds a mushroom that restores his size. Searching the tower, Simon helps to send some demons back, and uses a teleporter to take him to the Fiery Pits of Rondor, so as to destroy Sordid's wand. Although Simon transforms him into stone, Sordid is revived the moment his wand is destroyed. Surviving an attempt on his life, Simon quickly outwits him, defeats him, and is sent back to his world. Although he assumes he had a dream, a portal opens in his bedroom, and a large gloved hand appears, taking him back through it.", "platform": "Commodore Amiga CD32", "release_date": "January 2, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Adventuresoft", "publishers": "Adventuresoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Simon_the_Sorcerer", "video_link": "https://www.youtube.com/watch?v=2D-ey_dkXRI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45657-simon-the-sorcerer\n"}