{"name": "American Dream", "overview": "The player must earn money in order to become the wealthiest gambler in the world. The game, set in New York City, is considered a spin-off from the Pachio-kun franchise.<br><br>Roads, taxis and automobiles are not portrayed in the game. However, a black limousine that escorts the player from the air force base to the final casino is portrayed as driving on grass. This is in direct opposition to the real New York City where the majority of the surface is concrete (either as roads, parking lots, or as foundations for the buildings). Only parks and some older residential districts use grass in their design in the real world. Buildings are either shown as dilapidated tenements, shiny towers, or as flashy casinos.<br><br>The player starts out in the poorest district of Brooklyn and must work through the boroughs of New York City outside Manhattan, including Queens or The Bronx, in order to amass wealth. With luck and finesse, the player can ultimately break the bank in New Jersey. To enter a casino, the player must find a permit (which serves as photo identification for the casinos) somewhere in Brooklyn. Slot machines come in denominations from $1–$100000 depending on the neighborhood and the presence of a VIP card. Three types of slot machines can be played at each level and the player is photographed when winning the jackpot.<br><br>Players must be wary of dice games that have dangerous risks in addition to card games - they randomly appear like monster battles in traditional role-playing games. Many buildings including airports, police stations, and casinos either help or hinder the player's attempts to earn enough money on the slot machines for passage to the wealthier district. Guns (in the form of a pistol) can be found that can protect the player against muggers. However, the police will confiscate the weapon from this player once he arrives at a certain area in Manhattan. Pachiko-kun (the player) will also be arrested and will be held unless a $100,000 ($190,899.33 in today's money) bail can be paid in full.", "platform": "Nintendo Entertainment System", "release_date": "September 23, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Soft Machine", "publishers": "Coconuts", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "2.03", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=PCHAW0eAHEU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24158"}