{"name": "America Daitouryou Senkyo", "overview": "America Daitouryou Senkyo, helpfully translated as \"United State Presidential Race\" on the game's box, is a text-heavy simulator where the player chooses a candidate and runs for the US presidency. The player can choose from historically accurate 1988 presidential election candidates George HW Bush (for Republicans) and Michael Dukakis (for Democrats) as well as real-life political figures involved in the 1988 election - Jesse Jackson and Pat Robertson. They can also select between a fictional representation of former UK Prime Minister Margaret Thatcher called \"Sasha\", and \"Suzuki\", a Japanese-American senator from California with a pro-Japan platform presumably intended to appeal to the game's entirely Japanese audience.<br><br>At the start of the game, the player has four different issues to take either a liberal, conservative, or centrist position on. The player must make wise use of his funds as he is trying to become the President of the United States of America. Being liberal offends the religious folks, being conservative offends the university students and working class voters, and being centrist (as in pleasing everybody) actually pleases nobody. The player starts in February 1988 at a convention for his political party somewhere in the Midwestern United States. and must work his way up to the final election results on November 1988 without becoming bankrupt.<br><br>In the presently unknown primary election, candidates in five states (including players) make the final selection along with the decision-making. Opinion polls and election campaigns (speeches) do benefit the player in his presidential campaign. However, the primary elections in are not implemented in all states in the same way. Some states may be processed automatically by computer (a fixed number of delegate count) while others in a more manual way. The Super Tuesday primaries are to be held on the same day in many states, ballot counting is done after the player has made simultaneous attempts in each campaign state into three regions. After that, the primary election is made (not counting district units held, subject to the provisions of the delegate count.)<br><br>The priorities of the policies that the player can make were introduced to the game as the situation was in 1988 because of the Soviet Union and the CoCom. In 1991, the dissolution of the Soviet Union would eventually lead to CoCom being disbanded in 1994. South Africa had an apartheid at the time and abolished in it 1991. The Panama Canal Zone was returned in 1999 to the people of Panama. However, it differs from the political situation encountered in the game. The \"AIDS patient isolation\" issue was showing an event of discriminatory policy of an era that had not shown wide public awareness about how the AIDS virus manages to spread from person to person.<br><br>If the player manages to win the game and become President of the United States, the official Presidential Oath is displayed in English.", "platform": "Nintendo Entertainment System", "release_date": "October 28, 1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Hect", "publishers": "Hect", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "2.42", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=GHMU3qcGooE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/26658"}