{"name": "Bucky O'Hare", "overview": "BUCKY'S GONNA NEED A LOT OF LUCK FROM HIS RABBIT'S FOOT!<br><br>Today's newest renegade space hero, Captain Bucky O'Hare, faces his greatest challenge. His crew, Dead Eye Duck, Blinky, Jenny the Aldeberan Cat and the genius earth boy Willy DuWitt, have been captured by the Toad Empire. Now you must play the role of Bucky, blasting past the fiercest toads in the Aniverse. It's an intense arcade action battle with eight hare-raising levels. Luckily, when you rescue a crew member you can assume their identity and take advantage of their unique fighting skills, like Jenny's Super Mind Blast and Willy's Laser Cannon... WE INTERUPT THIS PACKAGE FOR A SPECIAL BULLETIN FROM TOAD HEADQUARTERS!<br><br>Greetings, warthead. This is the Toad Air Marshall, coming to you live from the Toad Magma Tanker. I'm here to smash an ugly rumor goin' around that says you're thinking about becoming Bucky O'Hare in a futile attempt to rescue the captured crew of the Righteous Ingignation.<br><br>Fool! Those lunkhead traitors are guided by the elite Storm Toad Troopers in four toad prisons hidden throughout the planetoid belt, from the Way-Cool Ice Planet to the Burnin' Hunk of Lava Star. So don't even mess with us toads, you wart for brains hare-ball. 'Cause it you do, I'll have to blast ya Toad Battle Cruisers and Double Bubble High Speed Toad Armada Tanks. That ain't the worst of it, pal! Once I've got your pointy ears in my sights, I'll drop the big bomb with Crater Centipedes, Robosnakes and triple threat Triborgs that your laser-guided Wart Remover doesn't have a shot against.<br><br>Face it rabbit. Try to croak us toads, and you'll be one unlucky Bucky!", "platform": "Nintendo Entertainment System", "release_date": "January 31, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.89", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/1014"}