{"name": "Crazy Climber", "overview": "In Crazy Climber the player assumes the role of a daredevil who is attempting to climb to the top of four skyscrapers. There are a number of obstacles and dangers to avoid including:<br><br>    Windows that open and close (the most common danger).<br>    Bald-headed residents (a.k.a. Mad Doctors), who throw objects such as flower pots, buckets of water and fruit in an effort to knock the climber off the building (with larger objects appearing by more aggressive Mad Doctors in later levels).<br>    A giant condor, who drops eggs and excrement aimed at the climber (two at a time in the early stages, four in later levels).<br>    A giant ape (styled like King Kong), whose punch can prove deadly (he becomes more aggressive in later levels).<br>    Falling steel girders and iron dumbbells (more numerous in the later levels).<br>    Live wires, which protrude off electric signs.<br>    Falling 'Crazy Climber' signs.<br><br>Some of these dangers appear at every level of the game; others make appearances only in later stages. Should the climber succumb to any one of these dangers, a new climber takes his place at the exact point where he fell; the last major danger is eliminated.<br><br>One ally the climber has is a pink \"Lucky Balloon\"; if he is able to grab it, the climber is transported up 8 stories to a window. The window onto which it drops the climber may be about to close. If the window that the climber is dropped onto is fully closed, the balloon pauses there until the window opens up again. The player does not actually earn bonus points for catching the balloon, but he is awarded the normal 'step value' for each of the eight floors that he passes while holding the balloon.<br><br>If the climber is able to ascend to the top of a skyscraper and grabs the runner of a waiting helicopter, he earns a bonus and is transported to another skyscraper, which presents more dangers than the past. The helicopter would only wait about 30 seconds, then fly off.<br><br>If the player completes all four skyscrapers, he is taken back to the first skyscraper and the game restarts from the beginning, but the player keeps his score.", "platform": "Nintendo Entertainment System", "release_date": "December 26, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Nichibutsu", "publishers": "Nichibutsu", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.31", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/26856"}