{"name": "F31 in 1 REAL GAME", "overview": "Let’s go back to the early 90s. Winter hollidays are approaching, and your loving mother, who knows how much you enjoy playing with your NES, decides to buy you a very special present, one she knows for sure you are gonna like a lot: a brand new videogame. So she enters the small bazaar in your neighbourhood who sells electronics and videogames and freezes in front of the shelves… There’s quite a lot of different games!<br><br>From behind the counter, the clerk notices her and runs to her aid. «May I help you, madam?» he asks. «Well, yes – I’m looking for a videogame for my son, but I can’t be decided. I don’t know which one he would like…»<br><br>«Well, those titles in the top shelf are the games most people buy … But for just 5 extra bucks I have something very special», replies the store worker. «What is it?», asks your  mom, interested… The store worker knows his job perfectly so, minutes later, your mother is walking out the shop with a brand new cartridge in her bag.<br><br>On Christmas day, while everybody is opening their presents, your mother tells you she has a special surprise for you, because she knows how much you enjoy playing with your console. You grab the wrapped box… It’s a game! Which one it might be? Super Mario Bros 3? Kirby? Batman? Castlevania? …<br><br>No, my friend, is a magnificent CHINESE 9999 IN 1 MULTICART!<br><br>Your mother displays a huge smile «9999 games! I think you won’t have the time to play them all!»<br><br>As a tribute to our loving mothers we want to share with you all our own Multicart. 31 real games! Lots of laughs! Facepalms! Controllers flying accross the room! Mysterious secrets! Fake names! Repeated games with different sprites! Everything in 3 megabits full of love and kisses.", "platform": "Nintendo Entertainment System", "release_date": "2016", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Mojon Twins", "publishers": "Mojon Twins", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.05", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=PboZ4lm8EbY&feature=youtu.be", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125027"}