{"name": "Final Fantasy VII: Advent Children", "overview": "Final Fantasy VII: Advent Children is an unlicensed \"Shanzhai\" demake of SquareSoft's iconic role-playing adventure, first released for PlayStation in 1997. This 8-bit \"port\" was developed and published by Chinese company Shenzhen Nanjing Technology for the Subor, a Nintendo Famicom clone.<br><br>In 2013, a hack was released by members of the Romhacking.net community, which overhauled the game and improved upon its gameplay and graphics to more closely resemble the PSone classic. It features a three-member party structure and several adaptations of the game's subsystems. Items, spells and equipment are based upon those found in the original game, and although a large number have been omitted, along with optional characters and some side quests, the full story remains faithfully intact.<br><br>The game has received praise from various sources, though initially criticized for its difficulty. Journalist Derrick Sobodash stated that while it would not be an entirely new experience for those that played the original Final Fantasy VII, \"this title can hold its own against the other NES Final Fantasy games\", describing the effort as \"surprisingly professional\". Kotaku editor Luke Plunkett cited the Famicom game as \"an achievement I have no hesitation in labeling Herculean\", further calling it \"...a triumph of the human spirit\". Boing Boing Gadgets and Wired News writer Joel Johnson described the game as \"more than just a knock-off — it's an act of true skill and commitment by an unknown team of Chinese coders\". GamePro named it one of the thirteen best fan-made remakes, placing first on their list and describing it as \"the video game equivalent of the Human Genome Project\", despite its flaws.", "platform": "Nintendo Entertainment System", "release_date": "November 19, 2013", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Lugia2009", "publishers": "Romhacking.net", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.35", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=foY1eCqXP5g", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83520"}