{"name": "Final Fantasy Negative One", "overview": "This is a very comprehensive redesign of Final Fantasy 1.<br><br>In addition to the weapon, armor, monster, spell, and job data being rebuilt from the ground up, you can now select from among 12 jobs at the beginning rather than only 6.<br><br>Weapons and armor now have types, and jobs equip items by type rather than by individual weapons or armors (e.g. if you can use one staff you can use them all).<br><br>Each spell now has two colors rather than just one. A spell can be Black or White, and in addition can be Red or Time. Black spells are offensive, White defensive; Red spells are direct, Time indirect. Thus a spell like CURE would be White Red, while LOCK would be Black Time.<br><br>Some of the maps are largely the same but there are a few differences. However, many maps are completely new altogether.<br><br>Many bug-fixes and improvements have been applied; too many to list, but among them are the martial arts bug, the house bug, faster text boxes, 5-letter character names, unbroken spell routines (e.g. “attack up”), and weapon elements.<br><br>Version 2 fixes most, if not all, of the graphical oddities present in version 1. It also adds a few more features, including a random(ish) default party, both directional buttons working on the character selection screen (so if you “missed” the job you wanted you don’t have to cycle back around through 11 jobs), the clinics are free now and heal everything (not just KO), as well as a variety of other miscellaneous minor fixes and improvements.<br><br>Also of note, even in version 1, there is/was no waterfall dungeon, and it is not required to complete the game.", "platform": "Nintendo Entertainment System", "release_date": "July 1, 2015", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/94726"}