{"name": "Hi no Tori Hououhen: Gaou no Bouken", "overview": "Based on the Osamu Tezuka's manga \"Phoenix\", this platformer is mostly based on the fifth volume, \"Hō-ō\" (later called \"Karma\" when it reached North America in May 2004). Here you play as the bandit Gaou, who lost an arm and eye as a baby and as such was scorned by his peers. Since then he has resorted to various tactics, not least murder, to survive. However, one day he fought a monk who encouraged him to change his ways and follow his unfound natural talent to sculpt, which is thus put to good use in a variety of sculptures unique in their raw emotion. And then, he meets a fellow sculptor, Akanemaru, who once was attacked by him, and the two engage in encounters with a phoenix, who, it is said, will grant to those who drink its blood eternal life - and the rest is history.<br><br>Gaou's goal is to grab the 16 pieces of the picture card which, when fully revealed, will uncover the picture of the Phoenix. The action takes place in 16 stages (one picture card per stage) spread out across three terrains inspired (for the most part) by other volumes in the \"Phoenix\" series. Half of the stages take place in Gaou's own backyard of Feudal Japan (c. 720-752), while five stages take place in a Future World (not unlike those shown in the \"Future\", \"Space\", and \"Resurrection\" volumes) and three stages occur in Prehistoric Times. Some stages, when completed, will lead you to the next, while others from other time periods can only be reached through secret warps. Gaou can use his chisel to attack enemies or the gargoyle head statues he used to chisel with it to make makeshift platforms. The game ends when all three lives are gone - or when Gaou has successfully assembled the Phoenix picture card.", "platform": "Nintendo Entertainment System", "release_date": "January 4, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27206"}