{"name": "King's Quest V", "overview": "Dark powers summon a cold wind from the north. The terrifying gust surrounds Sir Graham's castle, and mysteriously sweeps his fortress and family into the prison of oblivion. It's a bitter omen that chills the bones of every man, woman and child in the once peaceful Kingdom of Daventry.<br><br>Who or what is responsible for this royal theft, and the misery that ravages the heart of Daventry? Has the ruthless wizard Manannan cast another evil spell? Or are the Black Forest Witch and the unforgiving Ice Queen using sinister powers to promote their wicked cause? Only you can answer these questions, as you assume the role of Sir Graham, then set forth on an adventure that will test your intelligence, challenge your skill and rip your courage to shreds.<br><br>Fortunately, you're not alone. For a wise owl who witnessed the tragedy will accompany you, offering guidance and advice which he receives from a friendly old warlock. Along the way you'll encounter the dungeon monster, the Yeti monster, the magical genies and winged Harpies to name a few. You'll also journey over continents laced with crystal caves, forbidden forests, bandit hideouts and treacherous seas filled with mystery. Be sure to question kind strangers for clues, and give assistance to animal allies. Also locate magical items and weapons, or else your mortal strenght will be powerless to unlock the secrets leading to your imprisoned home and family.<br><br>As foretold by ancient warlords, King's Quest V has finally arrived to weed out the weak immortalize the brave. The only question now is...which are you?", "platform": "Nintendo Entertainment System", "release_date": "June 1, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Novotrade International", "publishers": "Konami", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.72", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/1433"}