{"name": "Layla", "overview": "Layla has to rescue her friend Iris from a genetically modified apparatus named Jill; who is apparently controlled by a Dr. Manitoka. As a member of the CAT Special Forces, Layla has all the skills needed to foil Dr. Manitoka's plans.<br><br>Eight different asteroids have to be explored before being able to rescue Layla's best friend. Each asteroid is divided into two sections; the first part involving the surface of the asteroid while the second part deals with the actual enemy base.<br><br>There is an equally large mechanical element to the level as there is a biological element. The screen always scrolls from left to right. No backtracking is permitted on any level. While navigating through the cavern-like interiors of the asteroids, enemies must be defeated and password disks must be retrieved. At the final room of each asteroid lies a boss that must be defeated before being able to move on. Several guns in addition to some hand grenades can be used to destroy the bad guys impeding Layla's progress. The handgun is the player's initial weapon; but more powerful weapons can be found just by exploring. Certain blocks can be broken by using the player's chosen weapon; the difference between destroyable blocks and non-destroyable blocks is sometimes indistinguishable.<br><br>Bonus levels distributed throughout the game allows players to destroy entire squadrons of enemy ships while being completely impervious to their attacks. Players must be wary that every weapon has a limited amount of bullets; players can possess more than one sub-weapon at a time. When Layla's life reaches zero, she dies and immediately loses a life. A password is shown after the player loses the game.", "platform": "Nintendo Entertainment System", "release_date": "December 20, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "dB-SOFT", "publishers": "dB-Soft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27416"}