{"name": "Rockman 7", "overview": "What arthritis-inducing madness is this? A rom hack perhaps? I say thee nay! This is a 100% home-brew remake of the SNES game using NES graphics. But that's not all! The music has been 8-bitted and the sound has been 8-bitted as well. Does this mean we've lost anything?<br> <br>Evidentially not! The graphics are superb and it's all there. Every stage, every item, every nut and bolt ...<br><br>Wait, what's that? There's no bolts in the game? And no Rush Search either? In an effort to make these games more NES-like the following things have been changed:<br><br>    No intro or midway stages. In addition, all eight stages are available from the start.<br>    No going back to the level select after beating a stage in Wily's Castle. In addition, if you die all your tanks are gone.<br>    No bolts. Which means no shopping.<br>    No Rush Search. I guess that was too NES-like?<br>    Where the Rush Search adaptor was (in Freezeman's level) the Exit adaptor can be obtained.<br>    Since there's no Rush Search, you get the PU fist by hitting the ledge where it's hidden in Junkman's level with the Thunder Bolt.<br>    The Energy Balancer is where Auto's Hyperbolt was in Springman's level.<br>    Robot Masters don't \"flinch\" when hit with their weaknesses (meaning they are not pushed back and their attack cycle does not start over).<br>    Fliptop appears in some levels as his NES incarnation did.<br>    Beat is NES-ized ... naturally he doesn't work on Wily nor any Robot Master.<br><br>These changes are somewhat controversial. After all, the Gameboy games had 4/4 stages and a shop feature, so why not an 8-bit remake of RM7. Even though it's in an attempt to bring RM7 closer to it's NES counterparts, it does mean not *everything* was included in this game.", "platform": "Nintendo Entertainment System", "release_date": "July 30, 2008", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=b2dBJlKZzts", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135832"}