{"name": "Sansuu 5•6-Nen: Keisan Game", "overview": "An educational game consisting of two different mini games. The game modes included are:<br><br>Decimal Multiplication - Players control a spaceship in a side-scrolling shooter. Blasting enemy ships earns the player points. At certain intervals, the ship will land in front of a building and the pilot enters a room. In the room, the player is presented with a multiplication problem that involves decimals. Players have to select the correct numbers that solve the problem while also dodging bullets being fired by gun turrets. Solving the problem correctly will let the player move on to the next stage.<br><br>Decimal Division - This mode features the same gameplay as the Decimal Multiplication mode, except instead of solving a multiplication problem, the player is solving a division problem that involves decimals.<br><br>Fraction Addition & Subtraction - Players control a girl on a field. Players are presented with a fraction addition or subtraction problem depending on the chosen mode. To solve this problem players have to first water the seeds that are on the ground. Watering seeds will eventual turn them into red or white flowers, which will eventually become ball shaped if continually watered. Once the flowers are ball shaped they can be pushed into a numbered basket, but only the white flowers should be and not the red ones, as the red ones are more of an obstacle and will affect the player negatively if they are placed into a basket. The number on the basket represents the number the player is selecting to solve the math problem. Players also have to be careful not to get hit by any of the animals roaming around in the field. The player is equipped with a spray that can temporarily stun the enemies if they get too close.<br><br>Fraction Multiplication & Division - This mode features the same gameplay as the Fraction Addition & Subtraction mode, except instead of solving addition & subtraction problems,the player is solving either an multiplication or division problem (depending on which mode they have chosen) that involves fractions.<br><br>Each minigame has different difficulty levels and also allows for two player alternating play.", "platform": "Nintendo Entertainment System", "release_date": "October 30, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Tokyo Shoseki", "publishers": "Tokyo Shoseki", "genres": "Education", "max_players": "2", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/44256"}