{"name": "Sansuu 4-Nen: Keisan Game", "overview": "An educational game consisting of four different mini games. The minigames included are:<br><br>Division - Players control a man in front of a building which has several doors. Entering a door will bring the player to a separate room where they have to try and locate the correct number that solves a long division problem that they are given. These separate rooms are protected by monsters that the player has to either avoid or kill with a sword. Players also have to be careful not to run into the invincible ghost that protects the outside of the building. Once the problem is solved, players have to climb to the top of the building to go on to the next division problem.<br><br>Decimal Addition & Subtraction - This mode features the same gameplay as the Division mode, except instead of solving a division problem, the player is solving either an addition or subtraction problem (depending on which mode they have chosen) that involves decimals.<br><br>Fraction Addition & Subtraction - Players control a car on a maze-like race track. Players have to locate the correct number tile that solves a fraction addition or subtraction problem (depending on which mode they have chosen). After completely solving the problem, the player has to find the exit tile to move on to the next math problem. Players also have to be careful not to crash into any enemy cars.<br><br>Decimal Multiplication & Division - This mode features the same gameplay as the Division mode, except instead of solving a division problem, the player is solving either a multiplication or division problem (depending on which mode they have chosen) that involves decimals.<br><br>Each minigame has two difficulty levels and also allows for two player alternating play.", "platform": "Nintendo Entertainment System", "release_date": "October 30, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Tokyo Shoseki", "publishers": "Tokyo Shoseki", "genres": "Education", "max_players": "2", "cooperative": "No", "rating": "1.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/44255"}