{"name": "Sansuu 3-Nen: Keisan Game", "overview": "An educational game consisting of four different mini games. The minigames included are:<br><br>Division 1 - Players control a submarine in a body of water. Players have to pilot the submarine into the correct answer of a division problem, while simultaneously dodging demolitions that are being dropped from a ship above it.<br><br>Multiplication 1 - Players control a man with a jet pack in outer space and have to fly to the correct number that solves a multiplication problem, while simultaneously dodging flying saucers that are constantly flying by.<br><br>Division 2 - Players control a man who is inside a multi-floored building. Players have to run to the correct number that fills in a part of a division problem. Getting the number correct will let the man get to the next floor where he has to get the next number and so on, until he exits the top of the building when the problem is fully solved. Players have to be careful of a monster that lurks on every floor and try not to run into it.<br><br>Multiplication 2 - Players control a car that is in a simple overhead maze. The maze has four empty boxes, Driving into a box will reveal a number. One of the four number in the maze will be the correct solution to a multiplication problem. Selecting the correct number will cause a new maze to form and will let the player choose another number, and this process continues until the multiplication problem is solved. Players also have to be careful not to crash into the other cars that are roaming the maze.<br>Each minigame has two difficulty levels and also allows for two player alternating play.", "platform": "Nintendo Entertainment System", "release_date": "April 25, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Tokyo Shoseki", "publishers": "Tokyo Shoseki", "genres": "Education", "max_players": "2", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/44253"}