{"name": "Sansuu 2-Nen: Keisan Game", "overview": "An educational game consisting of four different mini games. The minigames included are:<br><br>Addition & Subtraction 1 - Players control an arrow inside a dungeon maze. Players can only exit the dungeon when they locate a treasure chest. While searching for the treasure chest, players can run into random encounters with a monster that presents the player with a math problem. The problem will be either an addition or subtraction problem depending on the player's choice at the beginning of the game.<br><br>Addition & Subtraction 2 - Players control a penguin golfer on a golf course. Players use a meter to determine the strength of the swing of their golf club. After each swing, the player is given a math problem that they will have to solve in order to for their swing to count. Failure to answer the problem correctly will cause the golf ball to return to the spot it was originally hit from. The problem the player is given will be either an addition or subtraction problem depending on the player's choice at the beginning of the game.<br><br>Multiplication 1 - Players take the role of a robot factory worker. While parts of a robot go by on a conveyor belt, the player is presented with a math problem to solve. The player has to quickly solve this problem before the robot piece falls off the conveyor belt and winds up on the factory floor. Answering a problem wrong will cause a meter to drain. A fully drained meter will cause this game to restart from the beginning.<br><br>Multiplication 2 - This minigame presents the player with a view of a multiplication table. Players are given a multiplication problem and have to solve it in order to whack a mole that pops it head out.", "platform": "Nintendo Entertainment System", "release_date": "April 25, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Tokyo Shoseki", "publishers": "Tokyo Shoseki", "genres": "Education", "max_players": "2", "cooperative": "No", "rating": "1.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/44254"}