{"name": "Sweet Home", "overview": "Sweet Home follows the exploits of five members of an investigation group: Kazuo, Akiko, Taro, Asuka, and Emi. The famous painter Mamiya Ichirou lived many years in a secluded mansion, and rumor says there are some valuable frescos to find inside. Our investigators decide to take some pictures of the frescos. However, upon entering the mansion, a ghost-like figure of Mamiya appears and threatens them. After this, they find themselves trapped in the mansion. The heroes must now find a way out of the mansion, not forgetting the frescos they came there for, and the destiny of an earlier investigation group that has disappeared under mysterious circumstances.<br><br>Sweet Home is a Japan-only Famicom release that was produced by Capcom and developed as a tie-in for a Japanese horror film of the same name. It is one of the earliest entries in the survival horror genre, if not the very first. The game is also one of the sources of inspiration that would influence the design of the original Resident Evil. Many elements seen in Sweet Home are also present in the latter horror title, including the isolated mansion setting, use of puzzles, and the door animations that Resident Evil used for its loading screens.<br><br>Along with being an early survival horror, Sweet Home can also be considered an early immersive sim, as it had a number of core elements of the genre.<br><br>Unlike Resident Evil and other modern survivial horror titles, Sweet Home was structured as a horror-themed RPG. The characters in the player's party earn experience from winning turn-based battles and can level up. However, if a character runs out of hit points, they are killed permanently. The game features multiple endings that are dependent on how many party members survive through to the end.<br><br>Each of the party members also has a unique skill that they are able to perform. The effects of all of these character-specific skills are required to progress through the game, but in the event that any character is killed, there are items that will allow other characters to use the skill of the fallen party member.<br><br>Some of the immersive sim elements of Sweet Home include an open-ended environment, choices and consequences, non-linear game design, open-ended narrative told through notes and diaries, interactive environments, allowed multiple ways to achieve objectives, and no fail states unless all player characters die.", "platform": "Nintendo Entertainment System", "release_date": "December 15, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Horror", "max_players": "1", "cooperative": "No", "rating": "4.14", "wikipedia": "", "video_link": "https://youtu.be/-IAmphK8UPA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18451"}