{"name": "Teenage Mutant Ninja Turtles: Tournament Fighters", "overview": "THE TURTLES HIT THE STREETS AND POUND MORE THAN PAVEMENT! |<br>Only a hardened new breed of Ninja Turtle could bring fight-to-the-finish Street Fighter II™ combat to 8-bit. Shredder's brutal challenge will finally prove who's the most dangerous Ninja warrior of them all. A grudge as old as rice has exploded into a supreme tournament of torture between the most highly-trained masters of martial arts in the world. If you think you've dealt with intense moves before, this will kick you right in the cowabungas. It's time to get serious.<br><br>Will it be Leonardo? Michaelangelo? Raphael? Donatello? Casey Jones? Hothead? Or the king of low blows himself, Shredder. Only a colossal clash of lawless street justice will tell. Players may fight in four different modes. Story Mode lets you brawl as one of the good guys in green against any of the remaining six good, bad or ugly dudes. Both One-Player Mode and Two-Player Mode allow you to contend as any of the seven samurai in one-on-one mutant battles. Tournament mode mixes it up in a 1 to 4 player tournament. Two at a time fight, but only the strongest comes out looking better than hamburger meat. The attack moves have never been more lethal. All fighters have nasty tactics such as the punch, jump kick, attack guard, fire ball throw and slides. Then, each has unique attack moves to make your opponent beg for mercy like Leonardo's Tornado Rolling Sovat Kick, Raphael's Tiger Bite Toss and Casey Jones’ German Suplex.<br><br>The Half-shellers are in for the most devastating street fighting on 8-bit. Better wash down that banana sausage pizza with some<br>major punch.", "platform": "Nintendo Entertainment System", "release_date": "February 24, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.13", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2029"}