{"name": "The Real Ghostbusters Remastered", "overview": "After over 2 years in the making, it’s finally here! A complete revision of the Famicom/NES game developed by Workss/Bits Laboratory in Japan in mid 1986. Only 33 years ago.<br><br>This is a rom hack that changes and fixes too many things to count. The whole idea is to make better use of the NES capabilities and to make the game playable today, but with some key differences:<br><br>– Overhauled graphics: 99% original. Character sprites and slimer adapted from The New Ghostbusters 2 (Famicom).<br>– Doubled performance on many sections of the game.<br>– Much improved gameplay/controls everywhere.<br>– Heavily rebalanced game design.<br>– Countless bugs fixed.<br><br>The ROM has been expanded by 32000 bytes just to accomodate for the new “Ghostbusters!” yell. Otherwise it is exactly the same tech and size as the original cartridge.<br><br>* A lot of the original game is still present. The things that worked, some good ideas, and the music.<br>* The title screen was created by acclaimed romhacker Macbee. It takes into account CRT distortion so the GB logo appears perfectly round on CRTs.<br>* tepples from nesdev helped with the new PCM code.<br>* NewRisingSun from VGMRips created the PCM sample with amazing quality and volume.<br><br>If you’ve played the original game you’ll notice some differences in how the new version is played. The original game is really short, it can be finished in under 10 minutes, so some design decisions were made to give some feeling of progression. In general, these are the key things to keep in mind:<br><br>* If the PKE meter reaches 9999 it’s game over.<br>* Earn money first by catching roaming ghosts on the streets.<br>* Buy the Capture Beam and capture ghosts in buildings.<br>* Upgrade to Hyper Beam, which doubles the cash earned on buildings.<br>* Buy the anti-ghost suit and enter the Zuul building (you also need to have a beam).<br>* Climb the stairs and defeat Gozer!", "platform": "Nintendo Entertainment System", "release_date": "October 19, 2020", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Bit Ink Studios", "publishers": "", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://youtu.be/s7xULurHTl0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155594"}