{"name": "Warpman", "overview": "This game is an updated version of Warp Warp. Players once again take control of the monster fighter as he does battle with various types of enemy Beroberos.<br><br>The game features two types of gameplay. First, players start out in the Space World. Players control the monster fighter from a top down perspective. The player is equipped with a weapon that can be used to fire at the enemy monsters. The monster fighter can only walk in the four cardinal directions and thus only fire straight forward in whatever direction he is currently facing. The objective is to eliminate all the enemy monsters from the playfield to clear a level. Also, eliminating three monsters of the same type and color in a row, will cause a special monster to appear which can be shot for bonus points. Sometimes these special monsters will carry one letter of the word EXTRA. Collecting all five letters of that word will give the player an extra life.<br><br>In the center of the Space World is a warp tunnel that will occasionally flash when active. Entering an active warp tunnel will lead the player to the Maze World.<br><br>The Maze World portion of the game is similar in nature to Bomberman. Players walk along grid based corridors, planting time bombs attempting to eliminate any enemy monsters who happen to have had the misfortune of stumbling upon them.<br><br>Players will have the opportunity to warp out of either world at random intervals. However, they are not required to leave the current world they are in, and they can continue playing in that world type if they so choose to.", "platform": "Nintendo Entertainment System", "release_date": "July 12, 1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Namco", "publishers": "Namco", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.56", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=IT3VdD8rto8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23324"}