{"name": "Yun", "overview": "Every Autumn, in the boggy marsh near of the shores of Lake Potoña (Province of Badajoz), one could witness the hatch of the eggs of the rare Romani Heron. Some of the most famous ornithologists have described the scene as one of the most beautiful experieces they had experimented on a friday evening.<br><br>Very rarely, for some strange reason, one of the eggs produces a red demon with a big hairdo instead of the expected gray and wrinked baby bird. This is how Yun came to life. It was already late, almost dusk, so she couldn’t see very well. As demons are usually born incredibly hungry, she began eating what she found – and one of such things was a toothpaste tube somebody had left among the bushes. Such an accident, nevertheless, proved being really useful, as Yun gained the ability to produce bubbles from her mouth, and she soon learned how to capture all kinds of animals in them. Just a few months on, she founded her very own Japanese food reastaurant by the marsh.<br><br>With her incredible ability, she could trap even the rarest specimen of fish and made the finest sushi in Badajoz. Everything was going great, until one night where, while hunting in the dark waters, she was about to trap a big and shiny orange fugu fish as it appeared from behind a bunch of seaweeds. The fish looked her in the eye and it was love at the first sight. Sadly, the fugu knew about Yun’s activities and got the chills so it escaped.<br><br>Yun, make up for all the damage done, decided to change the nature of her business: instead of serving raw fish to the customers, he’d server raw customers to the fish.", "platform": "Nintendo Entertainment System", "release_date": "July 8, 2016", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "The Mojon Twins", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/152169"}