{"name": "Zelda II: Amida's Curse", "overview": "One day Link finds a portal to a strange land. Curious he starts exploring the magical world of Amida. Little does he know, that he’s on a brand new adventure that will take him to places he couldn’t have imagined. Amida has a deep emotional link to our hero. Can Link unravel the secrets of Amida and return to his own world?<br><br>Zelda II – Amida’s Curse is a brand new Zelda II adventure. The game has been build up from the ground. With a new world, new graphics and an original soundtrack by bentglasstube. The focus of Amida’s Curse lies on exploration above combat. Gameplay has been altered to make this, above all, a fun gaming experience. So, difficulty is lower than the original Zelda II, there are no cheap deaths and grinding isn’t necessary.<br><br>This has been a passion project spanning over 18 months of development time. A huge thanks to all people involved in making Zelda II – Amida’s Curse truly shine! You will find much more info in the ReadMe!<br><br>Now, go explore! A whole new world is waiting for you!<br><br>Features:<br><br>9 new temples to explore (vs 7 in vanilla Zelda II).<br>11 new towns to visit (vs 8 in vanilla Zelda II).<br>New soundtrack.<br>Brand new overworld.<br>New story.<br>New graphics.<br>Animated tiles on the overworld.<br>Balanced difficulty, no cheap deaths.<br>No random encounters on the overworld.<br>Loads of gameplay tweaks (building on Zelda II Redux).<br>Lives you find are permanent.<br>No grinding necessary.<br>Enemy rebalancing, no more huge HP pools.<br>Press A as a Fairy to instantly return to your normal form.<br>Temple stones give fixed EXP.<br>Fairy can’t fly through doors.<br>Save anywhere by pressing up and A on the start menu. Be aware though, that you’ll be warped back to the starting point of the game. So, only use this option when you want to stop playing.<br>And so much more…<br>Watch the release trailer here: https://www.youtube.com/watch?v=ZCqrJi8xbZg<br><br>Find the original soundtrack here: https://eatabrick.bandcamp.com/album/amidas-curse<br><br>Download the NES Boxart (by Fishwerks) here: https://www.okimpala.net/_downloads/8b8b61af5b4d731c4fe5522e3065b546", "platform": "Nintendo Entertainment System", "release_date": "November 9, 2021", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Ok Impala!", "publishers": "Romhacking.net", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ZCqrJi8xbZg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156419"}