{
  "name": "Duckshoot, Minefield &amp; Zapem",
  "shortName": "duckshoot-minefield-zapem",
  "description": "<i>Duckshoot, Minefield &amp; Zapem</i> is a collection of three games that contains the following:<br><br><b>Duckshoot: </b>All the fun of the fair in this single screen shooter where you move an arrow, left or right, at the bottom of the screen to hit targets at the top of the screen. The targets are two rows of ducks which move left to right  across the screen, and a row of targets in between that appear and disappear. You must shoot as many as you can before your time runs out. There is an option to play a fast game.<br><br><b>Minefield: </b>In this top view single screen game, you must move from the top left of the screen and get home in the bottom right of the screen. Problem is the screen is full of mines which cannot be seen and the amount is shown at the top. You are able to move one place at a time in eight directions and you are told how many mines are next to you. If you touch a mine then it is game over and there is an option to play a fast game.<br><br><b>Zapem: </b>A single screen shooter where you move around the screen blasting aliens before a timer runs out. Your ship can turn 360 degrees in both directions and you press the number 9 to move forwards. The aliens can be touched and it is game over when the timer reaches zero. There is an option to play a fast game.",
  "publishedBy": "Micro Marketing Ltd.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "",
  "genre": "Action, Compilation",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/jupiter-ace/duckshoot-minefield-zapem",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Puzzle elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Jupiter Ace",
      "releases": [
        {
          "publisher": "Micro Marketing Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/724986-duckshoot-minefield-zapem-jupiter-ace-screenshot-duckshoot.png",
      "caption": "Duckshoot"
    },
    {
      "link": "/images/shots/l/724987-duckshoot-minefield-zapem-jupiter-ace-screenshot-minefield.png",
      "caption": "Minefield"
    },
    {
      "link": "/images/shots/l/724988-duckshoot-minefield-zapem-jupiter-ace-screenshot-zapem.png",
      "caption": "Zapem"
    }
  ],
  "cover": []
}