{"name": "720°", "overview": "THE GAME The player controls a skateboarder. The object of the game is to perform stunts accumulating points for which skate park tickets are obtained. In the parks you compete to gain medals and cash. Cash may be used to purchase better equipment(e.g. boards, shoes, pads, protective helmets) which improves the performance of the player.<br>Select keyboard or joystick and then press key 1 for three credits. You can then skate around \"Skate City\" visiting the four shops and four parks. There are four parks in \"Skate City\" each of which may be visited only once on each level of the game. The parks are Downhill, Jump, Ramp and Slalom.<br>The locations of these are indicated on a map which appears on the screen if you pass over a \"map\" square. Activating the joystick continues the game, these are pointed to by \"D\" markers - Downhill, \"J\"-Jump, \"R\" - Ramp, \"S\" - Slalom.<br>Tickets are used as the parks are visited (under the T on the screen). Extra tickets are awarded at 5,000, 15,000, 25,000, 35,000 etc. points. Medals are awarded for good performance in the parks, with cash prizes and bonus points.<br>After visiting each park a status sheet is displayed indicating medals awarded. High score and remaining credits also. When in the vicinity of a shop an icon to the right of the screen flashes alternately with the price. These icons represent helmets, shoes, skateboard and pads. The level of equipment is indicated alongside the appropriate icon. Approaching the counter at the correct place either results in a \"SALE\" or \"NO SALE\" message.<br>Bonus points are awarded for remaining cash at the end of the game.<br>If the player does not enter a park within the time limit displayed on the bar timer, he is pursued by killer bees. These become more dangerous if the player does not enter a park quickly, transforming into various objects. Extra points may be gained by passing over certain hidden locations. <br>Dollar bills on the road may be collected. The player should avoid contact with other characters appearing on the screen.", "platform": "Amstrad CPC", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Tiertex Ltd.", "publishers": "U.S. Gold Ltd.", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=YSOI0XtT4QU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/74744"}