{"name": "Airballs", "overview": "Game description to \"AIRBALLS\": You as a player take over the role of cute little helicopter male that gets the difficult task of freeing the individual levels of wild rotating balls. This cheerfully wandering air balls (Engl. Airballs!?) Applies it to burst to bring, by adopting our hero from above, with its pointed feet. This is creating principle. Allderdings falls each opponent at burst  a small ball from the pocket (or elsewhere), which collected as a bouncing ball on the ground. To his opponents (or victims?) Now to be able to get rid definitively, just this balls must be collected if it is not already fallen by themselves into a hole. Is it, however, too long  on the ground, it disappears and a new (normal) opponents appear! Well that's not too hard. Since our hero but for buoyancy ensures in the best helicopter-style with its rotor (by pressuring FIRE), it is particularly allergic to coming from above opponents. the player collides now from below with a rotating ball, so our hero is quite beautiful to regroup, speak tailspin. while you lose any control over it until it gets itself a firm grip under the feet. but such a fall can also assume more dangerous. Can our dreamer get in just fall-called no ledge under his truck, he crashes through the floor, which is equivalent to the loss of a precious life! For further fluidized care at higher levels still various side and altitude winds, which the players make it difficult to control. With a little practice you can get it but in the 'handle' (literalness). Furthermore, it is not recommended to dwell too long on a level, since then the upper ball tapeworm feels called into action (which is possible to at higher levels but in any case not be avoided). This has a penchant for all types of rotors, and attacked our players, depending on the level, to different degrees. However, it is possible to list over also by eg hiding under a platform, or linger on the screen what the tapeworm duly confused ... With all the difficulties you can with some effort still over water, or keep in the air. Finally, there is every 10000 points another (bitternoetiges ...?) Life to it. And unless you're over a precipice going to the game, can not happen too much, right? The game is played Finally something to control ... either joystick or \"R\" three keys \"T\" and \"G\". Right and left is clear boost you get with the fire button, or the \"G\" key. or? The game is played Finally something to control ... either joystick or \"R\" three keys \"T\" and \"G\". Right and left is clear boost you get with the fire button, or the \"G\" key. or? The game is played Finally something to control ... either joystick or \"R\" three keys \"T\" and \"G\". Right and left is clear boost you get with the fire button, or the \"G\" key.", "platform": "Amstrad CPC", "release_date": "December 13, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Playfield", "publishers": "Playfield", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=i6UCaYGYNds", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79118"}