{"name": "Bride of Frankenstein", "overview": "In the middle of the night, outside an electrical storm is raging and you're all alone in Castle Frankenstein. Your task is to revive Frankie, the monster who wants you at the top of the tower while you hunt around for the vital organs that will make his life complete. You need to find a pair of lungs, a pair of kidneys, a liver, a heart and of course a brain if you want to make a man of him. But make sure you use only quality spare parts, as some of the older items may cause a breakdown. It won't be easy. The castle has many rooms, dungeons, dark corridors, crypts, graveyards and laboratories to explore (sixty screens in all). And who knows what may lurk behind those locked doors? Some places arc definitely more friendly than others, so keep an eye on your heart rate, as any sudden shock from ghosts or ghouls could bring on a fatal heart attack. If you find the old ticker working overtime you could always head for sanctuary through one of the three arches and try to relax for a while - but which arch? Keep your wits about you because mysterious things can happen - does the whole castle change while you are in sanctuary or is it just an illusion? All this exertion means that you must keep your elixir of life topped up with the invigorating green liquid. Measure your steps carefully as there are only a few sources. Remember this is the real thing and you have only one life. To find Frankie you'll need to collect the right tools for the job. You'll find you have a choice of seven different types of key, but which one will open which door? In the dungeons you'll find shackled prisoners longing for escape, but will they thank you for setting them free, or are they more use to you in other ways? A spade will be useful for gravedigging, but a pickaxe could also come in handy if you hit any bones or feel the need to lash out suddenly. You may find you have a smashing time in the crypts with the pickaxe too. A lamp will be invaluable to explore some of the less well lit areas of the castle and when you finally get to the top of Frankie's tower you may find it necessary to do a little electrical repair. Good luck, although if you're quick you may not need it!", "platform": "Amstrad CPC", "release_date": "1987", "game_type": "Released", "esrb": "", "developers": "", "publishers": "39 Steps", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127071"}