{"name": "Bridge Player", "overview": "This program allows you to play the game of bridge<br>without having to find three people to play with. It<br>does not use prepared hands: instead the hands which<br>you will see result from random shuffling, which is<br>why you will have to wait a few moments for each new<br>hand to appear. Although it is not a bridge tutor it<br>will provide enjoyable and useful practice, particularly<br>for beginners and intermediate players, in both<br>bidding and playing the cards.<br><br>On each hand, unless you elect for option 2 (see<br>below), you will be South and your hand will be<br>displayed as if you were holding the cards. Using the<br>Acol system you will then be able bid your own hand,<br>with the computer bidding the other three hands. Once<br>the bidding is complete North and South's hands will<br>be displayed and you will be able to play the hands as<br>declarer, with the computer playing the opponents'<br>hands. All legal bids are allowed including doubling<br>and redoubling. If, by mistake or design, you enter<br>an illegal bid it will not be accepted. Similarly<br>during the play of the cards you can play any card<br>which you are legally entitled to play but a revoke or<br>the purported play of a card not held is not accepted.<br><br>To assist the declarer, the computer will make a small<br>'beep' whenever a defender makes a ruff i.e. trumps<br>another suit led.<br><br>You do not have to bid the hand if you do not want to.<br>Option 2 allows you to see all four hands and then<br>decide what contract to play in and who is to be the<br>declarer. Thereafter you will be able either to play<br>the hand as before (i.e. playing only the declarer's<br>and dummy's cards) or to play all 4 hands yourself.<br>Whichever option is selected the computer will always<br>display (in addition to the 2 or 4 hands, as<br>appropriate) the sequential hand number, who was the<br>dealer, the vulnerability of North/South and East/<br>West, any part score and (once these are known) the<br>contract and who is the declarer. In addition, once<br>you have started to play the hand the number of tricks<br>won by North/South and East/West will be shown as well<br>as the cards played to the previous trick.", "platform": "Amstrad CPC", "release_date": "1985", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128530"}