{"name": "Despotik Design", "overview": "The center of the world (new address: 5/7, rue de l'Amiral-Courbet, 94160 Saint-Mandé) houses, as you know, an important robotic bio-genetic complex, responsible for the industrial production of this masterpiece chromosome that are \"BLERO\" cells. These constituent elements of most of our fellow citizens (being special nicknames of this fact and affectionately \"badgers\"), make of them the delicious people that we know: docile voters and tireless workers, loving football, Sabatier and sometimes even the Amstrad computers, that says it all ... Now, recently, this ultramodern center of capital importance, is at the mercy of a formidable terrorist keen on computers, with an armada of dedicated robots body and circuits to their evil master. This monster of malevolence reprogrammed the whole kit, nourishing the insane hope that the cells thus counterfeited, would generate individualistic and associal beings, endowed with clairvoyance and intellectual acuity unknown until then. It goes without saying that such creatures (whose existence we have unfortunately already detected), by their singularity, risk calling into question the essential foundations of our sweet society. Your mission, if you accept it, is to destroy the freelancers, er, the unwanted robots working at 5/7, rue de l'Amiral-Courbet and to reprogram the bugged elements of the vast laboratory, so that it can replay around the world, the seed of this afflicting bliss which is so reassuring, which is the joy of our dear politicians. Naturally, if you were captured, the State Department would deny having knowledge of your actions. This magazine will self-destruct within five seconds, good luck.", "platform": "Amstrad CPC", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Ere Informatique", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108848"}