{"name": "El linaje real", "overview": "The war between the kingdoms of Arngur and Megrib had already lasted two long years. Ernor, son of King Abner, was the commander-in-chief of the armies of the kingdom of Arngur and was enjoying one of the few breaks that this cruel war offered from time to time, when someone abruptly broke into his shop trying to recover the barely breath. It was a royal messenger who extended his trembling hand to the prince, offering him a worn parchment rolled up and sealed with Arngur's shield. Ernor stood up and without a word took the scroll, broke the seal, opened it, and read:<br><br>“Year of grace 1458 of the second era of Arngur. I, Helegan, as counselor and administrator of His Majesty the King, write to you, Prince Ernor, to communicate with the greatest of regrets that your father, King Abner, has passed away after suffering a merciless illness that finally we has snatched.<br><br>It is my duty to inform you that in compliance with the capitular laws of our kingdom, you must take possession of the throne, replacing your father, on the third day after the death of our monarch. By virtue of the laws imposed by King Abner himself, the coronation celebrations will be executed on that day and, if the heir by right is not present, this position will fall on the next successor in the family line, in this case your stepbrother and son of Her Majesty the Queen, Devilus.<br><br>By virtue of the proper functioning of the real states, the following ... \"<br><br>Ernor could barely continue reading the scroll. The grief that approached him and a strange feeling of dizziness began to take over him. He even wondered what he was reading, what was it he had in his hands. Oblivion took hold of him. He could barely remember who his father was or what he did there. Why was he forgetting? What was happening to him? Why was the parchment impregnated with a pinkish powder whose scent filled his memories? He quickly tossed the parchment into the fire, which exploded in reddish light. Ernor clung to his fondest memories, his father: the king, his kingdom: Arngur, his goal: to reach Arngur before his evil brother Devilus is crowned king in his place and, most importantly, not to forget.<br><br>Unfortunately we only have three days to help our knight on his dangerous mission. Are you willing?", "platform": "Amstrad CPC", "release_date": "2017", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "ESP Soft", "publishers": "ESP Soft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=R5sKY4BXjmk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108013"}