{"name": "Han d'Islande", "overview": "A french language text adventure based on the literature of Victor Hugo. It was during the horror of a deep night, I walked in the Norwegian countryside thinking back to the adventures I had already experienced since the start of the game. It all started in the good town of Drontheim, which my privileged position (I am the son of Viceroy Ordener Guldenlew) had until then allowed me to apprehend in what it had more mundane. So I lived in peace, pretending to marry in just marriage with the daughter of the Chevalier d'Ahlefeld. Only my visits to the port, from where you could see looming in the distance, the sinister fortress of Munc-kolm, gave me a glimpse that a life full of adventures awaited me outside our proud city, shudderingly coiled up in its ramparts.<br><br>The ancient geole<br><br>Everything changed the day I entered the geoles of Munckolm to visit a prisoner. The latter begged me to help him by finding a certain Dispolsen, who, he said, held in his possession capital documents since proving his innocence. I accepted sansdêiai and went in search of the savior ...<br><br>Oh Thanos scent (my beautiful tree)<br><br>After having visited different places, very well put on the screen and supported by a scrolling with each lateral movement, I finally ended up in the morgue where I found Dispolsen as stiff and pale as a herring in brine! The famous documents had disappeared, probably stolen by his attacker, a rogue flèfé responding to the nickname of Han from Iceland. It was for me the opportunity to meet the keeper of the morgue, Spiagudry, a poor fellow that some hard cash soon convinced to lead me to the cave where Han was hiding.<br><br>Epilogue<br><br>I could go on like this and describe to you the wonderful Scandinavian landscapes that you cross on your way to Vygla by the Skongen road (you turn after Drontheim and it is straight ahead crossing the Ordals by the Hau-broen bridge: You can not be wrong). I could also boast about the sweet chills you get from hearing such an evil, digital laugh, just before running out of the giant's tower. I could also tell you that the movements are done by means of the arrows on the keyboard and that some common words can be found using the function keys, the rest of the dialogue being done in everyday language.", "platform": "Amstrad CPC", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Loriciels", "publishers": "Loriciels", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=t52IUteuIUQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/132285"}