{"name": "Haunted Hedges", "overview": "You have entered the spirit world and are forced into the greatest test of a spirit's spirit there ever was. Ghostly hedges glow all around in a confusing maze from which there is no escape. Strewn everywhere are gold coins - these must be the reward you were always told you would get in heaven. But they never said you would have to fight for it! Your arrival stirs the guardians - beings whose only purpose is to protect their domain from intruders. They seek you out as you gather the ghostly coins. Your only means of defence lies with the demon ice-axes lying in corners of the maze. If you can get to one the guardians will run from you in terror, knowing that you have the means of their destruction if you catch them... but knowing also that ice-axes quickly melt! Of course, you cannot kill them, but they are forced to rematerialize in thir place of rest, and that is sure to score a few points with the Powers-That-Be! You are not immortal, but out of an ethereal sense of fair play you have been allocated four lives, with more if you really prove your worth. Ultimately, though, there is no escape, for if you succeed the Cosmic Seers will make you do it all over again only faster, out of spite. Well, they're only inhuman after all. Back in the real world, you can make things easier for yourself by choosing how your Spectral keyboard will control your movement (by pressing 'K'). You can also set the guardians' intelligence level (keys 1 to 5). Instructions are available by pressing 'I'. Pressing 'S' will beging the great trial, 'H' will hold everything while you answer the earthly telephone, front door, etc., and 'E' will signify to the Cosmic Seers that you've had enough and can you go home now please?", "platform": "Amstrad CPC", "release_date": "1985", "game_type": "Released", "esrb": "", "developers": "Micromega", "publishers": "Amsoft", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129964"}