{"name": "Incantation", "overview": "French text adventure. Shar Breiz Island was not far away. It was about time because the storm was then threatening. I should have been wary when the fishermen told me that it was possible to go to the island with this boat. The smirk they got when I told them about Shar Breiz should have made me be more careful. But I had to go see Maxime Minotier at all costs, to talk to him about my business. Maxime is a rich industrialist and, moreover, he is my friend. I was hopeful that I would make the deal with him. I could already make out the shapes of a large building, I docked on the island as packets of sea passed over the pier. The least we can say is that I arrived just before the storm. Once all the presentations have been made,seeing that I still did not manage to warm myself, Leon, the servant offered to sit down near the fireplace. As the noon hour approached, I was invited to the dining room for lunch.  <br> It was then that some incredible and mysterious events occurred which forced me to go back several years in order to find some explanations.<br>Amédée Minotier, father of my friend Maxime, went mad after being wounded in the war. That's what everyone thought. In fact, it was his research on parallel worlds that really messed his mind up.<br><br>The works he was able to read and occasionally translate are still in the house. His second son, Aristide, shared the same passion for the occult sciences when he passed away in the spring of 1908.<br><br>During the meal, when all the inhabitants of the island were gathered, that is to say only six people, a great crash was heard in the entrance, the door opened and a man of high stature but completely emaciated, made burst into the great hall. Everyone was terrified, except old Amédée who was expressing immense joy as he clapped his hands. Immediately, I questioned the old man: \"Do you know this\" man \"? Who is he?\" Unfortunately, his madness made worse by this new emotional shock.<br>made his answers inconsistent. It was Maxime who first gave me the explanation I was looking for. This man who seemed to return from hell was her brother, Aristide. Disappeared for twenty years, the latter seemed to have definitely lost all his reason. We dressed him in his nightgown and then took him to his room, which hadn't been changed for years. Aristide, pale, fell asleep, leaving everyone in the deepest anxiety. <br> <br>I  had completely forgotten the affairs that had brought me to the island and I was only interested in this mysterious story.<br>I asked the inhabitants a few questions, but my main question remained unanswered. Where could this seventh inhabitant of the island come from? The storm was raging, it was unlikely that it could have arrived from the mainland. To progress in my research, I decided to go inspect the library. I picked, at random, the books that could be interesting. Many were still in their original language. Hearing only good French, I was unable to study the most technically fascinating books. The occult sciences will therefore remain a mystery to me for a long time to come. As for the novels, the library seemed very well stocked, as all the bestsellers were present. Behind large volumes,I even discovered a little book telling some legends about Brittany. In this booklet, embellished with small sketches, I unearthed a chapter relating the history of Shar Breiz Island.<br><br>Already, in the most remote times of the history of Brittany, the inhabitants of the island stood out from their contemporaries. Where the other Celts lined up menhirs and dolmens, the first islanders had erected curious monuments. It would even seem that, much more recently, around 1830, during a battle between wreckers and sailors, the captain of the bandis, who had been captured, then mysteriously vanished, taking with him his booty and his secret.<br>What if there was some connection between these two disappearances? How could people disappear from this island and where?<br><br>As I was telling myself that a secret passage might just be the explanation for all of this, I clearly heard a scream coming from outside the house. I rushed out and discovered the horrible spectacle. Leon, the servants' son had been horribly mutilated. Only a monstrous beast could have done this job, the bite and scratch marks were very sharp and very wide. This heinous murder was unfortunately only the first in a long list. I took an oath to find out which animal was thus murdering the inhabitants of the island and to prevent it from harming, even if this task were to cost me my life, or if I should sink into madness. Very well done. Incantation has a very studied scenario. With the greatest respect for the Myth of Cthulu,everything has been designed to worry and terrorize ... Technically, the game is perfect, the actions are easy to use, the graphics are precise and we note with joy that each character has his own language and his own facial expressions. Fun, isn't it?", "platform": "Amstrad CPC", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Softhawk", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/EaBKF55P3oA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142733"}