{"name": "Inquisitor: Shade of Swords", "overview": "Contact was broken between the planet of Astul and the rest of the galaxy, and it reverted to barbarism. A Roman inspired group led by the Ephore Crassus has conquered the city of New-Cythere from a Spartan inspired group. Four adventurers have then turned up at the citadel, and started asking questions about a mysterious chamber beneath the city. You control these adventurers, and your aim is to find information about what is going on, and leave the city.<br><br>This French language game is a typical turn based first person 3D dungeon crawler. You have a single pool of character points to assign to the abilities of all four party members (Alton, Elisabeth, Jofil and Eddy). Abilities affect physical based attack (e.g. Constitution and Agility) and supposedly also mental characteristics (e.g. Intelligence, Aura, Observation, etc). Once the characters are prepared, you start in the ground floor of the citadel.<br><br>Interaction is through an icon based menu system, with options allowing movement, sorting of character inventory, seeing your character stats and seeing your orientation. Once movement mode is selected, the party moves by using the arrow keys. Most encounters occur at predetermined positions. Some will be non-hostile characters, where an interaction menu is opened which allows talk, trade and combat. There are also many hostile praetorian guards. When these are met, a combat menu will open up.<br><br>Combat occurs by selecting each party member in turn, and choosing an action. These include parry, lunge, strike, persuasion and running. If there are multiple opponents, you can select which one to strike. After this, pressing the forwards arrow executes the commands. Damage in each round is dependent on character stats and weapon/armor stats. The process continues until one side is defeated. If your opponents are defeated, they usually leave items (but they disappear once you enter movement mode again).<br><br>Each character may carry (and automatically be equipped with) one weapon, one shield, one helm and one suit of armour. Keys may also be found, which open locked doors. In addition to this is a bag of four items for the party rather than the individuals. There are at least five levels of the citadel. There does not appear to be any mechanism for character improvement (such as experience and levelling). There also seems to be no important dialogue during the game. The explanation for what is happening is supposedly revealed once the party has completed their investigation and returned to their starting point.", "platform": "Amstrad CPC", "release_date": "1987", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Chip", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133889"}