{"name": "Jungle Jane", "overview": "Anthropophagous papuans! Dangerous, especially if you are a frail and tender young girl, plump, lost in the jungle without the slightest Tarzan on the horizon ... An arcade game more classic than it seems. Right, Jungle Jane. Hanging on a vine. At the bottom of the vine, an open pot ready to welcome it. At the top of the vine, a papuan with an ax. Ready to detach a piece of rock which, falling on Jane, will throw her into the pot. But he waits. He is waiting for three of his Papuan brothers to join him.<br><br>On the left of the screen, they jump from the top of a promontory, a vulture slowing down their fall. Jungle Jane has to prevent them from arriving alive on the ground by touching them with the bananas she throws. The papuans fight back with coconuts. An affected papuan falls and crashes to the ground. Jane hit by a coconut loses a life (luckily, she has three).<br>If the heroine ever falls into the pot, she still has a chance to get out of it. A rebel vulture hovers over her; she can jump to try to hang on to it. Advantageous, but this exercise seemed to us absolutely impossible to carry out. A \"bug\" in the program?<br><br>Each game board has a number of Papuans to face before moving on to the next. The general principle does not vary from one table to another, but the shooting exercise always becomes faster.<br><br>A good little arcade game to have a good time. The graphic realization is perfectly successful, the animation fast and fun. Jungle Jane reminds a lot of a certain POO-YANN, who made a hit in the arcades two years ago. A reference, but we do not find all the subtleties of the original game.", "platform": "Amstrad CPC", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Bug-Byte Software", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108566"}