{"name": "Kingdom of Hamil", "overview": "The plot is simple: You play the part of the rightful heir to the throne who, in your infancy, was abducted and brought up many leagues from Hamil. Over the years you desperately hoped for someone to come and rescue you but no one came. Now, a fully grown adult, you have escaped from your captors and have returned to claim your kingdom.<br><br>The adventure starts with you in a chapel on the outskirts of Hamil. To leave by the way you entered is sudden death. Another exit is sought and found and you are now within striking distance of what you have dreamed of for all those years. All you have to do is prove that you are worthy of your inheritance. The puzzles are ingenious and I suppose must be accepted as fairly logical. A major problem is to get the parser to understand what you are trying to do. As with many games in the classical mould, the vocabulary is not very large and the way in which you can input commands is strictly limited.<br><br>Extensive hints are supplied for those faint hearted enough to require them, but I am pleased to say that they are, on the whole, only hints. You still have to interpret them for them to be useful. The hint sheet supplied with the game has a list of potential areas of difficulty listed as objects and locations. Each has a number that can be referred to elsewhere. This gives you a number to type into the computer and you will then receive a clue.<br><br>You may then ask for another on the same subject and the answers you get will be clearer the longer you persist. Some hints may appear to be quite explicit but you then have to decide how to input this new found knowledge, and that may not be so easy. Kingdom of Hamil does not have an enormous number of locations but there are plenty of puzzles to solve. Whether you manage it on your own or with the help of the clues provided, you will still feel satisfied when you reach the climax of the adventure. The problems you meet are not in themselves an entirely believable part of the plot but nevertheless provide a stimulating experience in adventuring. There is no RAM SAVE, but SAVEs to disc are rapid and should be made quite frequently as sudden death is around every corner. The instructions omit reference to any common commands, RESTORE must be used to re-load a SAVEd game position and the adventurer's favourite command EXAMINE is not recognised at all. This seems a strange omission but once you get used to its absence you just read the text more carefully.", "platform": "Amstrad CPC", "release_date": "1987", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Topologika", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127341"}