{"name": "Kitsune's Curse", "overview": "In Golden Tail, the Osaka Castle was released from the evil summoned by the dark heart of the Shogun. But not all ended well for everybody.<br><br>When the true nature of our hero Kitsune was revealed, something unexpected happened: he shape-shifted into a fox-man (キツネ).<br><br>To make things worse, when he woke up after the transformation, the talisman had been stolen by the Yiga. This clan is known for their dark arts and their deals with the Yōkai (supernatural monsters), and it is believed that they hide it now in Akasaka Castle, trying to subjugate the power of the stone.<br><br>You play the role of the ninja spy, who is on a mission to steal the Golden Tail from the Yiga clan, and hopefully use it to break Kitsune’s Curse.<br>Controls<br><br>The game can be controlled with the keyboard or a joystick. The keys can be redefined.<br>Action \tJoystick \tKeyboard (default keys)<br>Move left \t← \tCursor left<br>Move right \t→ \tCursor right<br>Jump \t↑ \tCursor up<br>Crouch \t↓ \tCursor down<br>Activate switch \t↓ \tCursor down<br>Use magic \tFire \tSpace<br><br>Press ‘p’ to pause/resume the game.<br>Press ESC to end the game and go back to the menu.<br>Keyboard Ghosting<br><br>If you’re playing the game using an emulator, your keyboard may have problems to register when three keys have been simultaneously pressed when using the default keys (cursors and space).<br><br>This issue is known as keyboard ghosting, and you may have problems to use the magic when jumping in diagonal.<br><br>Please redefine the keys to use, for example, ‘x’ for the magic instead of space.<br>Kōga Magic<br><br>Kitsune can perform Kōga Magic that will allow him to disappear from the action for a short period of time.<br><br>During the time he is invisible, he will move faster, jump higher and enemies or hazards like spikes won’t hurt him.<br><br>The magic can be used in different ways: without moving, running, jumping or even mid-jump when Kitsune is on the air. All these moves will have different results, so it is vital to understand the magic in order to finish the game.<br><br>If you have played Golden Tail before, beware this game allows more types of moves!<br>Enemies and Yōkai<br><br>    Forest spirit: these are creatures that take care of the forest, watching for the trees and the water. They will ignore you minding their own business, but be careful and never touch them!<br>    Forest flame: flying spirits of the forest, they are a flame with a human looking face. They don’t care too much about the humans, but don’t get in their way when they are wandering the forest.<br>    Vampires: the caves under the forest are infested with these big bats. They will attack if they smell you!<br>    Giant spiders: waiting in the darkness for prey, the giant spiders will jump over you if they think that can get you.<br>    Ninja Yiga: the soldiers of the Yiga clan. They have mastered Kōga Magic, like yourself.<br>    Oni head: one of the Yōkai associated with the Yiga clan, they are demonic heads that fly patrolling the Yiga domain.<br>    Fire Tengu: red demons capable of controlling fire at will. They are helping the Yokai to control the stone.<br>    Yiga Master: these are the masters of the Yiga clan. You can find them in the castle, riding a magic cloud.<br><br>Kitsune’s Curse Collector’s Edition<br><br>The game is available on cassette, 3” and 3.5” diskette. Please visit Kitsune’s Curse at Poly Play online shop for more information.<br>Downloads<br><br>This game is powered by cpcrslib by Artaburu and Arkos 2 Player by Targhan.<br><br>Version 1.0.0 (2020-04-17)<br><br>kitsunes-curse.zip (CDT, DSK and manual inside)<br><br>If you don’t have the hardware, you can still play it in an emulator.", "platform": "Amstrad CPC", "release_date": "2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "usebox.net", "publishers": "poly.play", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "0.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=eK221PpG7j4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128561"}