{"name": "La Dernière Mission", "overview": "I go down to my cabin, not yet having my instructions, and I go to the back room which reveals a whole arsenal of equipment to me. After checking it, I return to my cabin and decide to take a nap. Well I took it because the siren wakes me up at 3am: everyone on deck! It is then a question of embarking on a small boat which means nothing to me that is worthwhile and of going to dock in a deserted cove where there is nothing special apart from an agonizing silence. Iron bars fixed to the very cliff seem to invite me to go and see what is happening up there. After carefully sticking my head up the ladder, I discover a deserted landscape and notice an entrance that strongly resembles that of a blockhouse. It is neither locked,<br>I try to see if it is in working order but it is hardly conclusive. The next room has a spiral staircase in the middle that plunges into the basement. I'm right to go down it carefully because I find a sleeping guard there, poor him! I help him a little so that his sleep becomes eternal and find a key on him which will surely be very useful to me later.<br><br>At the end of the corridor, another corridor (very metallic as environment) but closed this one, fortunately my piercing eye makes me spot a grid which, once unscrewed, gives me a new key and the possibility of continuing. This time there is a room on the right; I enter this place without apprehension and... horror! one of my predecessors lies there in very poor condition (thanks for the little challenge!). I rush out and find another room on the right. Without any superstition, I venture to explore it and discover a whole computer system and filing cabinets that are closed of course but which surely have plenty of secrets to reveal. In front of this room, there is again a ladder that goes up where “thrones” a machine that looks very much like a transmuter (to remember!). But I'm coming down because I I also saw a kind of cave entrance which seems very attractive to me. I slip into the den, and believe me, you should never, ever do that!...", "platform": "Amstrad CPC", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Reynald Messie", "publishers": "MBC", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142743"}