{"name": "Les Pyramides d'Atlantys", "overview": "From our floating observation post, we are constantly on the lookout for all the movements of the sea, however imperceptible they may be ... Indeed, we are responsible for reporting any fact that seems abnormal to the HQ of the Observatory.<br><br>Our binoculars have been wearing out for days and days on this calm and flat immensity that has nothing to reject ... <br><br>When suddenly one of us shouts: \"Man, overboard! ... No, it's a bottle!\" After having picked it up on board, we have the impression of diving into a great fantastic story because, in the bottle, there is a message. And on the message ... the latest amazing report from the Alvin II, a submarine exploring the seabed of the Azores, with which we had lost contact for more than two months. This last message clarifies the mystery of the Lost City a little. Unfortunately for the crew of the Alvin II, the mission which had been entrusted to them could not be carried out without damage. For three long months, they wandered through the Atlantic shallows trying to solve the mysteries of the Atlantean ruins. Tirelessly, they went from one background to another, visited dozens of underwater caves hoping, each time, to find the fabulous Lost City of Atlantys. What dashed hopes! And it is precisely the day when they finally found one of these famous crystals that they must face the evidence of Alvin II's lack of energy.<br><br>It is impossible for them to rise to the surface and that is how they had to die crushed by the enormous pressures from the great depths! What a sad end ...<br><br>Despite everything, their sacrifice will still serve posterity; indeed, thanks to their message, it is possible to set up a new Alvin mission with, this time, all the chances of success because, in his last report, the commander of the Alvin II gave his last position: Lat . 32 ° 39 '- Long. 26 ° 12 '- Prof. 3720 m.<br><br>Quite naturally, it is you, new commander of the new Alvin, who have the heavy task of finding this city of Atlantys ...<br><br>With this software, you enter a strange world that we are not used to exploring. All the scenes take place in 3D, with interesting screens, although sometimes a bit empty and dark. Will you give in to the attraction of the mystery of the seabed?", "platform": "Amstrad CPC", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Luc Thibaud", "publishers": "Microids", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=A_iC4AKpArc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125817"}