{"name": "Macrocosmica", "overview": "There s only one way to describe this game -Elite without the vector graphics but witha lot more trading. It forsakes the.3D space laser action in favour of a more complicated trading game where success is in staying alive and making money is tougher than borrowing a fiver from the art deépartment.<br><br>The game begins by giving you a choice of three skill levels: difficult., impossible and suicidal get the idea? These aren't far from the truth but fear not. with a bit of experience and know-how it is possible to make profits . After creating the universe in which the game takes place (irs always different) you are put at the controls of the ship in which you'll cruise the galaxies.<br>Life begins at a space station but most of your business will be conducted at planets where cargos can he benight and sold. The initial screen is packed with information, the most important of which is the central command, menu which gives you the list of possible actions. At space stations there are two functions that cannot be performed at planets banking and telex. Banking is where you can change your money between cash and credit, (cash is liable to be stolen), while telexing will tell you the whereabouts of Mr Boo. He's a forerunner of yours who went off his trolley and should be avoided at all costs.<br><br>Making a short scan will take you off the flight deck and reveal the three sectors of the galaxy around you. These can contain space stations, planets that look like marbles, space or uncharted territory, the latter being out of bounds for the ship Once a destination is selected and the ship launched the display changes to show a box in which the stars whizz past. On an uninterrupted flight the destination planet will loom into view and the<br>ship will land - all automatically.<br><br>The flight can be interrupted by two things: pirates and meteor storms. Both can be avoided by evasive action but if fuel is tow the pirates writ have to be fought or the meteors flown through. Fighting takes you to a simple shoot-em -up screen where successive hits are needed to destroy pirates but they also attack your shields and hull and if laser power of full strength reach zero you're dead. Meteors also damage the shields and hull again causing death if they reach zero strength.<br><br>The facilities offered by planets vary and to find out more about them you have to use the short scan. This will give some written details and a series of letter codes that changes each game. These will be continuous throughout a single game and tell you which planets have repair facilities, casinos, hyperdrive units and so on.<br><br>There are many different cargos ranging in price and availability but the obvious aim is to buy low at one planet and sell high at the other Where the best prices are is discovered by experience and keeping an eye out for shortages, civil wars and supply availability<br><br>Money can be spent in many ways on refuelling the ship, repairing it. protection money to pirates, buying extra equipment or in a casino This means there has to be a regular source of income or you'll soon be bankrupt or dead Once the game has ended you're given a rating but don't expect this to improve too quickly - it's a tough game.", "platform": "Amstrad CPC", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Datacom", "publishers": "Amsoft", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108665"}