{"name": "Master of Space", "overview": "Masters of Space manages to carve out its own little individual niche, but not by coming up with any stunningly original concepts. Instead it combines a lot of familiar elements in a reasonably refreshing way.<br><br>You have to fly up and down the vertically scrolling playing area , swooping over the massive motherships which stretch for... oooh... screens. Basically you have to blow up all the mothership's defences, which include things like small attack ships and laser turrets, before you can progress onto the next level.<br><br>There's a time limit of one minute because you only have limited oxygen (well designed ship, this). But don't panic - when you blow up certain enemy ships they leave behind pick-ups which give you more oxygen plus extra firepower. You can boost your weapons to an impressive level with bolts flying out from your ship in all directions - you wonder how any enemy ships could survive, but somehow one always manages to get through the wall of fire and kill you.<br><br>There's one problem: these pick-ups are delicate things, and to stop you blowing them up by mistake, when they appear your weapons are disabled until you pick them up. Talk about a double edged sword.<br><br>You have a great deal of control over the speed of your craft speed, which can make for some really quite exciting dog fights. But watch out that you don't go<br>screaming into some deadly energy barrier. Graphically, the dominant theme is colour, and lots of it; the game's got an appealingly stylised and cartoony look.<br><br>It's a shame the over elaborate border restricts the size of the playing area, though.<br><br>The game is divided into learner and difficult sections plus , for some bizarre reason, 'three extra short levels.' The trouble is that they're all virtually the same. Sure, they get more difficult, and the graphics change (minimally), but that's yer lot. It all gets a bit dull, frankly. The game's crying out for variety - bonus levels, end-of-level guardians, double-width motherships, a quick level of Klax, anything to change the pace or style of gameplay.<br><br>As it is. Masters of Space delivers the goods in the short term, providing high speed action and a few intriguing twists on the usual vertically scrolling shoot-'em-up formula. But it could badly do with a few more levels and lot more surprises.", "platform": "Amstrad CPC", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "RADICAL SOFTWARE", "publishers": "", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/152896"}