{"name": "Mr. Gas", "overview": "MISTER GAS is a nice bubble coming from the upper spheres of the cava, which has been socially reduced to any factory of soda by a leak in the piping system.<br><br>Such humiliation cannot be afforded by the most traveling bubble on this side of the MISSISSIPPI.! Be reduced from being one of thewealthiest bubbles on the market to being a vulgar component of soda! To be swallowed by the jet-set and be able to climb on their privileged heads or be swallowed byanyone from the ordinary town, and then simply be expelled! Or worse still being mixed with wine! She! Thought and designed for satisfy the most exquisite palates of the country.<br><br>To prevent yourself from being the laughing stock of yours, you must reach the rusty faucet that empties into the appropriate conduit for your privileged condition.<br><br>But it is not so easy to operate the corroded crank, since it has been unused for some years and is quite rusty.<br><br>In order to open it, Mister Gas has to go looking for and collecting four essential objects for the tap opening. It is necessary to remove a rust cover to be able to access the screws, for this the KNIFE is one of these key objects.<br><br>THE AUTOMATIC SCREWDRIVER is another important object, since it will serve to loosen the screws on the cover, but previously with the PLIERS you will have to cut the factory alarm cables, because if it were to trip, all the pipes would be closed and the aristocratic Mister Gas could never reach its real destination.  Finally, the SHAVING BLADE is essential, perhaps because it is the most important object of the four necessary to leave the factory, because Mister Gas, after spending time outside his usual environment, has been unable to shave and the physical appearance is essential. for cava bubbles, as they are the most modest and refined of all. If he appeared among his, looking like any citizen of the plebs they would take for an intruder and send him by legal means to the soda factory .", "platform": "Amstrad CPC", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Proein Soft Line", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128498"}