{"name": "Operation Wolf", "overview": "The game utilized an optical controller housed inside a gun assembly scaled after and which bore a strong resemblance to the Uzi submachine gun. This, in turn, was mounted on top of a square base covering the pivot shaft which allowed players to swivel and elevate the \"gun\". A geared motor inside the casing simulated the recoil felt by the player when they \"fired\" the weapon at in-game targets.[2]<br><br>In order to complete each stage, the player must shoot as many soldiers, tanks, jeeps, choppers, and boats as the game requires. Soldiers can throw hand grenades and knives, and vehicles can shoot missiles and launch rockets. The player's ammunition and grenades are limited, but can be stocked up by shooting barrels and crates or by shooting animals such as chickens and pigs. Occasionally a high-powered machine gun power-up appears, allowing the player's gun to have unlimited ammo and an increased rate of fire for 10 seconds. Completing the Powder Magazine stage fills the player's ammunition and grenade supplies to maximum.<br><br>The hostages do not appear until the Concentration Camp stage. Here, the player must protect them from harm as they run to safety. During the Airport stage, the player must fend off enemy attacks as the hostages run toward the open hatch of an airplane taxiing along a runway. The player is awarded a bonus based on the number of hostages that successfully board the plane.<br><br>The player has a damage bar that increases each time he is hit. The damage bar also increases if a civilian or hostage is shot. Energy boost items randomly appear which, if shot, decrease damage by five points. In addition, the player recovers a large amount of damage after completing the Village stage, and a small amount after completing each of the others. If the damage bar fills completely or the player runs out of ammunition and grenades, the game ends.", "platform": "Amstrad CPC", "release_date": "1988", "game_type": "Released", "esrb": "", "developers": "Ocean Software", "publishers": "Ocean Software", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4.41", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=m5x1NA5NWHU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28546"}