{"name": "Pang", "overview": "There are 50 stages at 17 locations: Mount Fuji, Mount Keirin, the Temple of the Emerald Buddha, Angkor Wat, Ayers Rock, the Taj Mahal, Leningrad, Paris, London, Barcelona, Athens, Egypt, Mount Kilimanjaro, New York, Mayan ruins, Antarctica, and finally Easter Island.<br><br>Each location has a unique background that shows the area's most famous landmarks. The stages contain a different layout of blocks, some that disappear after being shot, others that do not, and still others that are hidden and can reveal bonuses.<br><br>The stages start with differing numbers and sizes of balloons. The largest balloon divides for the first three times it is popped; after the fourth and smallest balloon is popped it vanishes. Each player starts with a single harpoon. When a balloon is popped, special weapons may drop down.<br><br>The other weapons include:<br>Double Wire, a twin harpoon that allows two shots at once.<br>Power Wire, a grappling hook that stays attached to the ceiling or block for a short period of time. This time can be decreased by rapidly pressing the fire button.<br>Vulcan Missile, a high-caliber gun that works much like a machine gun allowing rapid shots.<br>There is no ammunition limit to any weapon. The names of the weapons differ between the monitor bezel (given above) and the game's attract mode. <br><br>Other bonuses include:<br>A force field that protects the player from one hit by a ball or enemy.<br>An hourglass that slows the balls down.<br>A clock which stops the balls for a short time.<br>Dynamite that pops all of the balloons down to their smallest size simultaneously.<br>At a certain point in the stage, a food item will drop down that is worth several hundred (or thousand in the later stages) bonus points. These are different and of increasing value, until a 48,000-point cake slice is reached; thereafter the bonuses are all cake slices, alternating between 48,000 and 50,000 points.<br><br>If a player touches a balloon of any size, the player dies and both players must start the stage again.<br><br>When both players touch a balloon at the same time, only Player 1 will lose a life but this is somewhat offset because when both players reach a bonus or weapon simultaneously only Player 1 will get it.<br><br>Players start with 3-5 lives depending on the dip switch setting. Extra lives are also given when certain point totals have been accumulated. The stage ends when all of the balloons are successfully cleared. The game ends after all stages have been completed and our heroic duo ride their jeep into the sunset on an Easter Island beach.", "platform": "Amstrad CPC", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Mitchell Corporation", "publishers": "Ocean Software", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=k5Gb1gDTJ5M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154616"}