{"name": "R-Type", "overview": "R-Type (アール・タイプ Āru Taipu?) is a side scrolling shoot-em-up arcade game produced by Irem in 1987. The player controls a space fighter named the R-9 to defend humanity against a mysterious powerful alien life-form known as the \"Bydo\".<br><br><br>The game is made up of several sequential levels, with a boss enemy at the end of each. The player controls a small spacecraft and must navigate terrain and fight enemies using the various ship weapons.<br><br>The player's spacecraft has, by default, a weak but rapid-firing main gun, which can take out waves of weak fighters; and a more powerful gun called a wave cannon, which requires the player to hold their fire to build up power for the cannon. When released, this fires a concentrated bolt of energy which can do more damage to larger enemies.<br><br>During the game, the player can obtain an auxiliary device called a Force. This resembles a glowing orange ball. The Force can be attached to the front or back of the player's spacecraft, or detached to fly freely. When attached, the Force provides one of three different powerful weapons, in addition to the main gun and the wave cannon. When detached, these weapons cannot be used, but the Force will instead resort to a secondary set of guns, which can be fired by the player even if the Force is at a distance from the spacecraft.<br><br>The Force has a secondary use as a shield; it is completely indestructible and can block most things fired at it, as well as damage or destroy enemies on contact. It can also be used as a ram, either by attaching it to the spacecraft and running into enemies, or by launching it into enemies.", "platform": "Amstrad CPC", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Software Studios", "publishers": "Electric Dreams", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "3.43", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=t2Vo8dbBJig", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28428"}