{"name": "Rolling Thunder", "overview": "Rolling Thunder (ローリングサンダー Rōringu Sandā) is a side-scrolling action game produced by Namco (now known as Bandai Namco Entertainment) originally released in as a coin-operated arcade game which ran on the Namco System 86 hardware. It was distributed internationally outside Japan by Atari Games. The player takes control of a secret agent who must rescue his female partner from a terrorist organization. Rolling Thunder was released for various computer platforms in 1987 and the Family Computer and Nintendo Entertainment System in 1989. The original arcade game has also been included in various classic game compilations as well. The player takes control of Albatross, a member of the WCPO's (World Crime Police Organization) \"Rolling Thunder\" espionage unit. Albatross's mission is to save a missing female agent named Leila Blitz from a secret society named Geldra located in New York. Albatross must travel through two different segments or \"stories\", each composed of five stages, for a total of ten stages. Depending on the DIP switch settings, the player has the option to start the game from any point in \"Story 1\" (allowing the player to skip any of the first four stages if desired). On each stage, the player can enter doors to hide and take cover from enemies, as well jump over to higher or lower floors with rails, including stairs. The stages in \"Story 2\" are essentially harder versions of their \"Story 1\" counterparts, featuring more traps and different enemy placement. At the end of each stage, scenes from Leila's capture and ensuing torture are shown on a large monitor screen. The player begins the game armed with a standard-issue pistol, which can be substituted with a fully automatic assault rifle that allows for continuous firing by holding down the shoot button. The player can find ammunition for either weapon by entering doors which are marked \"bullets\" or \"arms\". If the player runs out of machine gun ammo, they will switch back to the pistol. However, if the pistol runs out of ammo as well, then the player can only fire a single slow \"chaser\" bullets on-screen at a time until more ammo is acquired. Despite the presence of a life meter, the player can only take two physical hits from the enemy: a single hit drains half of the meter and the player is killed instantly when struck by a projectile attack such as enemy bullets or lasers, the time reaches 0, and when they fall at any part of an area/level without a floor. The main enemies in Rolling Thunder are hooded soldiers known as \"Maskers\". Maskers are dressed in various outfits and colors, which determines their strength and attack pattern respectively. Some Maskers do not shoot, but throw grenades instead, while others will shoot their gun while kneeling. Other enemies includes ninjas, mutated bats known as Gelzos, panthers, shrieking yellow creatures known as Blogas and lava men. At the end of the final stage, the player must battle the Geldra leader Maboo to rescue Leila and complete their mission.", "platform": "Amstrad CPC", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Tiertex", "publishers": "Erbe Software S.A.", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bsm3Qs4lBMM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93497"}