{"name": "Seas of Blood", "overview": "You can leave the ship to go pillaging on land – should you sight it! Mind you, on land you may not find the plundering too straightforward, fox as well as some typical adventure problems, you are likely to meet some stubborn resistance from natives, ghoulies, and ghosties. Some of these attack, rather to my disappointment, sapped me right out of the game without warning. I suppose 1 should have known better than to annoy them!<br><br>During a fight, the program enters a combat mode in which the lower half of the screen depicts two dice and displays and updates the relative skill and stamina of the opponents, giving a commentary on the details of the battle. When on land the adventurer can chicken out and run, by hitting X, but at sea the fight must go on to the bitter end. During the many times I played the game luck was nearly always on my side. I am told there is worse to come, eo perhaps it wasn't luck, but intended. However, I have never found computer 'lights'based on random numbers particularly credible, so I looked upon a fight as a somewhat risky way to obtain a trearure or find a bidden exit.<br>Sailing the seas can be interesting, for as well as finding land to explore, there are wrecks to be plundered and respectable ships to be burned and looted, not to mention skirmishes with other ships.<br><br>But all is not looting, pillaging and plundering – there are some real problems as well! What do the sea Sprites want? What i the best way to defeat a zombie? Aha, and there's \"the traditional red-herring in there somewhere, too' Mike Woodroffe told me!<br><br>All this combines with excellent graphics to make a very good adventure, easy enough to get into – but it's not so simple to tie things up on the mountain top!", "platform": "Amstrad CPC", "release_date": "1986", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Adventure International", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127117"}