{"name": "Sepulcri", "overview": "It is the year 2075 and the first satellite of Strategic Defense initiative is in its early stages of development.<br>It has been discovered that it is really impossible to test this weapon system, without causing the conflict whose prevention is its design objective. So the Space Department boys decided to build an incredibly small Robot. which would examine all circuit boards and the components of the host computer. Traveling inside him! (The fashion of calling Robots Androids died there by 1995).<br>This turned out to be a valuable exercise. because even in those early stages, it was found that there were many problems. To add to these problems. one of the stupid technicians who worked on the project, too<br>He minituarized some \"rams\" and put them inside the computer replacing the more conventional RAM (\"ram\" in English is RAM (translator's note). These Rams although they may seem inanimate, will destroy our mechanical comrade. The Robot, (yes. the Robot, see if you can find three good reasons why I should call him Android, then I will listen to you) has many sensors on his feet, so if he lands on something sharp he will destroy himself, stupid, but that's life.<br>As soon as our Android detects the defects, it points them to the outside world by sliding the DIP switches.<br>There are 50 of these and he has to check them all. Once you get it, then you have to find the path of the second part, the ROTTES (Safety Output Above All). To satisfy the cravings of the Security Council. The Robot (... and I will not repeat it more) to exit, has to send a highly secret code to the computer controller. There are 10 spaces that our hero has to code to spell \"LETMEOUTOK\" (Get me out of here. OK).", "platform": "Amstrad CPC", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Reaktor", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109439"}