{"name": "Space Smugglers", "overview": "Download the original manual (Spanish) in PDF/JGP/ZIP <br><br>Introduction<br><br>You've just been elected to clean up the galaxy from the Space Smugglers (Space Pirates), the most dangerous murderers of the universe.<br><br>Stay tuned, because any failure can be fatal, your enemies will not have pity on you.<br><br>You know, steady pulse, cold - blooded, aim and ... for it !<br><br><br>Characters: <br><br>BARBARA: It 's a space warrior accurate. Be careful, because when stooping and aims always hits the target.<br><br>Slogs: They are brave and skilled warriors, nope his gun!<br><br>SHIFTY: This is a good friend, you see not to say hello. But I am cautious, because sometimes mutate and become a fearsome Fowler.<br><br>FOWLER: Do not hesitate to shoot when you see him appear.<br><br>BRONITS: Flying Androids. They carry two laser guns that raise to sign up and shoot.<br><br>ZOOLS: They are big green monsters, but quite harmless. The problem is that sometimes are infected with leechs coming out of his stomach and attack.<br><br>Leechs: are introduced into the digestive tract of Zools and out when you least expect to annihilate.<br><br>HUNT: Great destroyer droid. To kill you to aim at his head.<br><br>USMIKS: Little green monsters armed to the teeth. If you point your gun photons ... Kill them!<br><br>Phocian: A rotund humanoid floating, totally harmless.<br><br><br>Game description:<br><br>The aim is to recruit an army that will fight by your side to destroy the Space Smugglers.<br><br>As they pass through phases recruit the number increases, as you can see in the three markers listed above, among the scores.<br><br>All characters, friends and enemies, are appearing in an integrator-blaster in front of you.<br><br>Do not shoot the innocent, you just have to kill those who aim to kill you, because those who do not will become yours soldiers when they disappear from the screen.<br><br>All you aim and criminals before they kill you, you will involve a significant number of points.<br><br>Each phase has a secret key that you discover when you get it. Once you know be able to access you want through the Start menu option 4.<br><br><br>Optional two players<br><br>When you compete against a friend you will have your markers separate points, but will fight together to recruit the army.", "platform": "Amstrad CPC", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "MHT Ingenieros", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=0GQApdrLZU4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109542"}