{"name": "SRAM 2", "overview": "In Sram II, you will also be able to find some differences compared to Sram I, in the principle of play. Now, time has its importance, in the upper left corner of the screen, you will notice the presence of two pendulums: the one gives you the time elapsed, the other the duration of your actions. Better to act quickly, sometimes not too quickly anyway. Moreover, in Sram II, you have two lives: like what you do not have only enemies, a good mage having had the precaution of giving you a trowel which has the power to reconstitute you once before definitively admiring the specter of Death (in full dress: skeleton, scythe and everything and everything ...). Do not tempt the devil (he is smarter than you!) And do not force chance:<br><br>Very classic, this game takes the \"look\" of Sram I. With even more beautiful graphics, even more finished and very colorful thanks to the use of various frames. Movements are always made by arrow keys and commands (actions) on the keyboard. The parser is in the same vein as Sram and has not lost his charming humor ...<br><br>In addition, classic and efficient, you have the possibility of saving a game in progress to resume it later. Very useful this option, if you feel a danger!<br><br>After loading the presentation screen which in its animation takes both the style and the music of Sram I, the computer offers you to go on an adventure from the beginning or to reload one of the two parts that you have previously saved. (A choice between TWO saved games? We can not stop progress!) Small criticism, presentation and situation of the story are a bit long when you have to each time resume the game at the beginning ...<br><br>A blush, Sram and it starts again!<br><br>Will you be able to play the vengeful vigilantes properly, make a salutary \"cleaning\" in the city of Sram, find and kill Egrès IV (by avoiding the genocides which have bad effect) and that without losing your lives? In any case, Sram II is a game in its own right, well constructed, well made and full of its primary interest. The amateurs will appreciate, the others can let themselves be tempted ...", "platform": "Amstrad CPC", "release_date": "", "game_type": "", "esrb": "", "developers": "", "publishers": "Ere Informatique", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126047"}