{"name": "Starion", "overview": "he whole back story of Starion was that the year was the (then futuristic!) 2010. You (as the slightly dorky sounding 'Starion') had graduated from the space academy. I can't imagine a 'Space Academy' opening up sometime this year... Anyway - even though Starion was a green around the gills rookie, he had been given the one and only existing 'timeship'. Using this timeship you had to repair the damage that had been inflicted upon the space-time continuum by a bunch of evil aliens (no not Doc Brown or Marty McFly). So off you blasted into space and time to kill any enemy aliens crossing your path and righting whatever wrongs they had already perpetrated. The first part of this classic game was to patrol the outer regions of space and intercept and destroy any alien ships you happened to find. As you attacked and destroyed each enemy ship it would reform as a letter of the English alphabet. This letter had to be collected and stowed aboard your ship. When you had collected the required number of letters (after destroying a certain amount of enemies), you were asked to unscramble what you had and rearrange them to make a well known word that fitted some important period in history. Once unscrambled it was time to locate the entrance to a time warp and fly right into it, whereupon a time grid was displayed. Each grid had nine time zones and you had to decide which of the time zones contained the historical event that your cargo letters fitted (were it C-R-E-D-I-T you may have thought of the hopeless government in the late 2000's ;-)) If the cargo you recovered solved the correct 'puzzle' then you were rewarded with fresh fuel and oxygen which allowed you to fly off and solve the next time zone. If your cargo of letters did not fit the puzzle then you had to destroy more enemy ships within that zone which would give you enough fuel to escape and move to another zone to try again. All in all, Starion had 243 time zones to visit and solve - plenty to do before completing it! The graphical style in Starion was the gaming classic 'cockpit view', with instrument panels displaying details on speed, hull temperature, enemy location, pitch, role, yaw, fuel and oxygen levels. Scanners showed the location of other objects, (both horizontally and vertically), such as ships, mines, missiles and even space debris. Above the scanners the year of the current time zone was shown which was vital when trying to solve the time zone problems. The hull temperature was also vital to the game because the outside temperature increased as you travelled more quickly and also increased from excessive lazer fire. The hull could also be destroyed by direct hits from enemy weapons or collision with objects floating around in space (as you would imagine). In a twist for these types of games the general debris could not be destroyed and you had to avoid it. The top two thirds of the screen showed the 3D realm of space, with any objects, ships etc that were in visual range - all animated with nice fast and smooth moving vector graphics. Points were awarded in accordance with the speed at which the player completed each stage of the game - the faster you were the more you scored. You could acheive promotions depending on the number of time zones that you had solved. If you fancied easing the loneliness of outer space, a friend could join in for a bit of 2 player Starion action.", "platform": "Amstrad CPC", "release_date": "1985", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Melbourne House", "genres": "", "max_players": "", "cooperative": "No", "rating": "0.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125227"}