{"name": "Starbyte", "overview": "We are in the 21st century of the solar era. At the moment the most appreciated element of universe is plutonium, source of energy and power, because ... Whoever dominates plutonium, will dominate the world! Thousands and thousands of space freighters from the most important planets in the galaxy fly through space carrying large amounts of this radioactive material. In order to monopolize production and the market, larger and larger freighters are being built capacity and safety measures are extreme, since the loss of nuclear material from only one of these freighters cause the extinction of all kinds of life in the most populated galaxy in the universe. But all the security measures they are few when working with this dangerous and unstable material. .. a catastrophe of inordinate proportions will soon follow<br>calculable: A latest-generation space freighter, carrying an immense amount of plutonium collides against an unexplored planet after falling into an electromagnetic storm that altered the ship's course. They are occurring significant losses of radioactive material, which are causing serious damage to the ecosystem of the nearest planet Ximos. <br><br>Now you, Starbyte, specially trained in the deactivation of nuclear events, are in charge of recovering the plutonium from the ship that threatens to pollute the galaxy and get out of there alive.   Current situation: Starbyte has been introduced into the ship through a motor, with no possibility of exit. Is found in the lower part of the freighter, and both the plutonium to be recovered and the teleporter that will return it alive, found at the top of the ship. You will soon discover that many cargo compartments are flooded by leaks caused by the humidity of the planet. The fall in any of these lagoons would cause the disintegration, since they are formed by liquids that come from the upper part of the ship, where the plutonium is found, and carry radioactive traits. The fauna of the planet that has managed to survive the sudden contamination has suffered great mutations.<br><br>Genetic conditions, which have caused changes in their organic structure. The simple contact of one of these beings will provoke Starbyte's death. Starbyte will constantly be interrupted by all kinds of obstacles, which must be surprising. Tear with the help of those objects that it finds on its way through the ship, if it wants to carry out its mission   Before launching into the adventure, he remembered the last words of his instructors: Do not rush, calculate your movements. Lie and measure your steps ... use everything you have within your reach to make your way through the ship, do not disregard If you find anything you find, and above all remember ... You must return alive. i i Good luck Starbyte !!!", "platform": "Amstrad CPC", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Celso Nores", "publishers": "Mister Chip", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125035"}