{"name": "The Trap Door", "overview": "The Trap Door is a computer game published for several 8-bit formats in 1986 by Piranha Games. It was written by Don Priestley and based on the British children's television show of the same name. In The Trap Door, the player takes control of Berk, who must perform tasks for \"The Thing Upstairs\" a never-seen entity who lives in the upper floors of the castle where Berk works. In order to help him complete his task, Berk must make use of the many objects lying around his part of the castle as well as the creatures that emerge from the trap door. Berk is assisted by Boni, a talking skull, who provides hints when picked up. He is also somewhat hindered by Drutt, a spider who loves eating worms. Gameplay is largely based around puzzle-solving and the use and manipulation of the many objects littered around Berk's chambers. Berk will also need help from some of the strange creatures that lurk in the caverns under the trap door and these creatures can often be as much a hindrance as a help (as well as downright dangerous). Once Berk has finished taking advantage of a creature's \"assistance\" he also has to find a way of making sure it goes back down the trap door. The game has two different skill levels: \"Learner Berk\" and \"Super Berk\". The difference is that \"Super Berk\" mode includes flying ghosts that appear a set time after each task is announced. The ghosts hinder the player's progress by attacking Berk, sending him spinning into another room if he doesn't manage to avoid them. The game can only be completed in \"Super Berk\" mode. The music was composed by David Dunn It was followed by a sequel in 1987 called Through The Trap Door, also written by Priestley and published by Piranha.", "platform": "Amstrad CPC", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Alternative Software", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110312"}