{"name": "The Paranoia Complex", "overview": "Le titre de ce logiciel est par lui-même déjà inquiétant et la question fondamentale qui se pose est la suivante : est-il possible de sortir sain de corps et d'esprit de ce jeu ? Un seul moyen pour le savoir : se risquer dans le complexe et voir ce qui se passe... Tout se déroule dans le secteur Alpha qui est contrôlé par l'ordinateur et dont le monde souterrain artificiel avait été créé il y a très longtemps pour se protéger contre l'invasion des troupes extra-terrestres. Ainsi donc, l'environnement autour de vous n'est qu'acier, béton et plastique ; pas très accueillant que tout cela et pourtant, pourtant, il ne faut pas oublier que l'ordinateur est votre ami mais il reste encore à prouver que la réciproque est vraie!...<br><br>Vous êtes donc amené à vous promener dans le complexe en vous attendant subir de petits tests de personnalité ; le questionnaire se déclenche à chaque fois que vous franchissez une bande rouge. Une ou plusieurs questions se succèdent suivant le type de réponse que vous faites et si l'ordinateur est satisfait de vos réponses, il vous donne des petits boulots à effectuer qui serviront à votre promotion en tant que citoyen. De plus, afin de refléter un peu la «paranoïa» du jeu, durant votre mission, vous avez certaines obligations à accomplir comme manger, aller aux toilettes, faire des rapports ou s'adonner à la gymnastique prescrite par l'ordinateur... Mais, en fait, quelle est vraiment votre mission ? C'est très simple, il s'agit de réussir à s'échapper de la ville (plus facile à dire qu'à faire !). Durant tout le déroulement du jeu, vous avez une vision du dessus du complexe et vous commencez par rassembler du matériel qui est visualisé dans 2 fenêtres situées en haut à droite de l'écran principal. Ensuite, vous effectuez tous les tests qui se présentent régulièrement à vous ; enfin, il faut savoir qu'il est possible de pénétrer dans tous les bâtiments. A ce moment là, le toit disparait laissant voir le système d'acheminement de l'air comprimé; ce sont dans ces lieux que peuvent se passer des scènes de poursuites sauvages... The Paranoia Complex est véritablement un logiciel particulier, inquiétant dans son approche et qui révèle des graphismes de bonne qualité.", "platform": "Amstrad CPC", "release_date": "1989", "game_type": "Released", "esrb": "", "developers": "Micro-Partner", "publishers": "Erbe Software", "genres": "Visual Novel", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161171"}