{"name": "Toad Runner", "overview": "I have almost forgotten my own image ... I was the Prince ... that night will stay with me forever. The moon, the madness in the air and that evil curse from which I became the Toadrunner! If I am ever to regain my royal visage I must find my Princess and if I do not succeeed ... I can say no more for I am yet the Toadrunner. *POCKETS* During the course of the game you will find certain objects that you may wish to pick up. This can be done by placing the object in your pocket. You only have four pockets and therefore you can only carry four objects (quite a lot seeing that you are but a small amphibian). To burden yourself with an object simply position your player next to it and press the number (1-4 above keyboard) that corresponds to the pocket you wish the item to be placed in. To cast aside an object simply press the number of the pocket you wish to relieve. Some of the items may be 'used' rather than carried around and repositioned. Only the item in pocket 4 may be used. This is done by pressing the fire button or whichever key h as been selected for 'USE', eg if you had an axe in pocket 4 then the fire button ('use' key) wo uld start the toad slashing the air or anything that came in its path. *OBJECT OF THE GAME* The aim of the game is to ... wait for it ... Find the Princess and ... who knows what may happen but I'm sure you have a fair idea. First you have to kill the STONE-MASTER. This is not as simple as it may seen. There are many problems to p erplex your green brain as well as a whole host of nasties to drain your reptilian energy. *THE THIEF* After six toad time units a thief will appear on the screen and infuriate you by stealing any items it finds lying around; you may very well need those particular objects. The thief can only hold one item but is very greedy (and stupid) and will d rop what it is carrying to steal another. It is possible to kill the thief but it takes a lot of en ergy and when he dies, takes whatever he is carrying with him to hell and damnation. Bad luck on the thief but it may be impossible to complete the mission without the missing object. *TRIPLE EXISTS* There are some occasions where there appear to be three exists in the same direction and they look the same from your side, but if you choose the wrong one then you will perish and lose all subsequent lives. To add to the fun the correct pat h may be different each time you try it but there is a way of predicting which path leads to the other side so keep your bug-eyes open for the position of rock cracks and flowers! *ON SCREEN INFORMATION* At the top of the screen there is some information which you really ought to look at. On the left are the contents of your four pockets (no pocket fluff in this game)! Next to these is a display of the percentage of the puzzle completed. Do not get too depressed reading this and remember finding the Princess gives you the 100%. The display next to this is your energy and this is explained in 'HOW TO DIE'. On the right hand side of the screen is the clock ticking away in toad time units. *HOW TO DIE* This is certainly the easiest part of the game! The re are a whole host of ways but they can be divided into two categories. The first way is by being squashed or taking wrong exit at a TRIPLE EXIT. These not only kill you but take all further lives. They say a cat has nine lives but a lesser known fact is that toads have five. To experience t he sensation of dying five times you have to drain your energy. This can be done by touching a flying bug (the only ones in this game!) or one of the guards at an exit. One or three of the guard s may take all your lives if they are feeling spiteful. You will see your energy draining in the display at the top of the screen. The best way to understand this is to try it. Stand next to the knight of the first screen. Once the meter turns completely black you will lose a life. A toad can o nly stay out of water for 75 TTUs and so after this you will go to the big green pond in the sky. *HINTS* Most, but not all, of the guards/objects blocking exists can be removed. Trying to squeeze trough cannot be recommended! Once an object has been used then it probably will have no further use. Don't give up! So pick up your warts and hit the road and remember...be careful out there.", "platform": "Amstrad CPC", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Ariolasoft", "genres": "", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110157"}