{"name": "Turlogh le Rodeur", "overview": "Cobra Soft's graphic adventure, on Amstrad CPC, is the software component of a larger company, since an interactive comic is sold in the package, but also separately in bookstores. The ED episode is titled \"The Necromancer's Sphere, while the floppy disk is titled Turlogh of Penroth.\"  <br> <br>The author of the comic strip pays particular attention to the fine arabesques drawn in space by the blood that spurts from a head or a limb cut off with a sword, and the multiple ends to which the many variations of the adventures lead. on paper prove that an author can express his sadism at the expense of a hero he created. The atmosphere of the software, which takes place on a white background, is less heavy than that of the album which involves many fights, goblins, ogres, dwarves, etc. But the resolution of the CPC remains insufficient to compete with the evocation power of a printed plate. In addition, the fights and animations take place outside the main windows. A horse gallops through the crest in the center of the screen,while the fierce battles are reduced to the sleepy posturing of tiny figures. The atmosphere is based almost exclusively on the graphics because, moreover, the sound effects are reduced practically to the initial music which evokes more the western than anything else. The white background of the screen, the shape of the various windows necessary for the unfolding of the action, move away from the graphics of the overloaded pages of the comic strip to evoke above all the organization of a page of parchment. The images play on the opposition of the plans. Once there are close-ups of the characters, which if necessary overflow the space allotted to them: they lean out the windows of the screen! Alternately, we see general scenes, most often without actors.atmosphere is based almost exclusively on the graphics because, moreover, the sound effects are reduced practically to the initial music which evokes more the western than anything else. The white background of the screen, the shape of the various windows necessary for the unfolding of the action, move away from the graphics of the overloaded pages of the comic strip to evoke above all the organization of a page of parchment. The images play on the opposition of the plans. Once there are close-ups of the characters, which if necessary overflow the space allotted to them: they lean out the windows of the screen! Alternately, we see general scenes, most often without actors.atmosphere is based almost exclusively on the graphics because, moreover, the sound effects are reduced practically to the initial music which evokes more the western than anything else. The white background of the screen, the shape of the various windows necessary for the unfolding of the action, move away from the graphics of the overloaded pages of the comic strip to evoke above all the organization of a page of parchment. The images play on the opposition of plans. Once there are close-ups of the characters, which if necessary overflow the space allotted to them: they lean out the windows of the screen! Alternately, we see general scenes, most often without actors.something else. The white background of the screen, the shape of the various windows necessary for the unfolding of the action, move away from the graphics of the overloaded pages of the comic strip to evoke above all the organization of a page of parchment. The images play on the opposition of the plans. Once there are close-ups of the characters, which if necessary overflow the space allotted to them: they lean out the windows of the screen! Alternately, we see general scenes, most often without actors.something else. The white background of the screen, the shape of the various windows necessary for the unfolding of the action, move away from the graphics of the overloaded pages of the comic strip to evoke above all the organization of a page of parchment. The images play on the opposition of the plans. Once there are close-ups of the characters, which if necessary overflow the space allotted to them: they lean out the windows of the screen! Alternately, we see general scenes, most often without actors.Once there are close-ups of the characters, which if necessary overflow the space allotted to them: they lean out the windows of the screen! Alternately, we see general scenes, most often without actors.Once there are close-ups of the characters, which if necessary overflow the space allotted to them: they lean out the windows of the screen! Alternately, we see general scenes, most often without actors.  <br> <br>he style is quite homogeneous, pleasant and clear. The progress of the adventure depends a lot on the initial characteristics with which you have endowed the hero: the luck and your magic, the skill he attacks it or in I dodge it tilt the fate of the likes between Turlogh and the three goblins exploiters of peasants, between you and the ogre, guardian or tramp who haunts the basements of your fortress of Much'Quaryat. Indeed, the fights take place according to the role-playing mode, with choice of weapons (sword, dagger, crossbow), more or less offensive tactics, and, most often, possibilities of flight or interruption. hostilities.<br><br>The game quickly becomes quite difficult, especially since if there are thirty-six ways to die as a hero but fewer ways to win.", "platform": "Amstrad CPC", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Cobra Soft", "publishers": "Cobra Soft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=4zzDXfjE0YQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142824"}