{"name": "Pipe Mania", "overview": "Pipemania is a game of great ingenuity, simple in concept and fiendishly challenging to play. You'll need to act instinctively, but think strategically! One wrong move, one brief hesitation or mis-placed pipe section, and you'll drown in a sea of slime!<br><br>Forget Shoot-'em-ups and Beat-'em-ups, once you play this you'll know why. Buy it now!<br><br>Pipemania starts on a playing grid that is empty except for the starting piece. The object is to score as many points as possible by constructing a continuous pipeline from the starting piece.<br><br>As you play, pipe sections appear in a dispenser to the left of the grid. You can place a pipe section anywhere you like, whether or not it connects with other pipe sections. In fact, you'll learn to place pieces in a pattern that anticipates connections five or ten moves in advance.<br><br>You can \"bomb\" any previously placed pipe section by placing a new section on top of it. The old pipe will spin and the new pipe appear in its place. There is a short delay for replacing pipes and a 50 point penalty.<br><br>Once a pipe piece fills with flooz, you can no longer replace it. At the start of higher levels, advanced pipe sections and obstacles will appear randomly on the grid. These pieces cannot be replaced by other pieces.<br><br>With each level you have a set amount of time in which to connect as many pipe sections as possible before the flooz starts to flow. This time decreases as you progress up through the levels. When the flooz reaches the end of your pipeline the round is over.<br><br>Once you've placed all the pipe pieces you can (or want to) press CTRL and COPY and the flooz will speed up and end the round quickly. You will score double points for each additional pipe section the flooz passes through.", "platform": "Acorn Electron", "release_date": "July 19, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "The Assembly Line", "publishers": "Empire", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/143057"}