{"name": "The Rising of Salandra", "overview": "A two pack of adventure:<br> <br>THE PROPHESY: For years, the inhabitants of the Lands of the Outer Marshes, at the Northern edge of the Great Ocean, have lived happily in peace. In recent weeks, however, rumours have been growing in the Southlands of the gathering of forces of the Dark Lord Salandra. Then, one dark morning, the Elders call the Villagers to the Moot.<br><br>Soon, very soon my friends, the Dark Forces of the evil Salandra will be abroad in our fair land. Even now, the black sails of his warships are gathering at the far side of the Great Ocean in readiness to transport the evil hordes of his armies to our continent. Once the Outer Marshes have fallen under his misrule, he can spread Northwards past the desert and on to the Valley of the Seven Kings. We are in dire peril and need the guidance...<br><br>...of a mighty warrior.<br><br>RETURN OF THE WARRIOR:Having awoken the warrior Thrull from his deep sleep of seven generations, you are now set to face the evil Salandra himself.<br><br>As the dark Warships land at the beach below you, Thrull speaks.<br>\"I shall remain for a short while to try to repel the hordes of Salandra's invading forces. Perhaps you, who have proved yourself in being here, could reach the heart of Salandra's domain. If I were to make the journey, his spies would know of me and warn the evil tyrant. But a small traveller such as yourself could escape their attention and reach Salandra's fortress.\"<br><br>\"If you should meet the evil Salandra you will need a talisman of good to protect you. Even then, you will not have sufficient strength to defeat him by yourself. Good journey!\"<br><br>Thrull waves his Sword and a mist descends around you, the mist clears and you find yourself on a beach at the South side of the Great Ocean", "platform": "Acorn Electron", "release_date": "March 1, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Geoffrey Hans Larsen", "publishers": "Larsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142998"}