{"altername_name": [], "name": "Army Men 2", "overview": "Army Men 2 is the sequel to Army Men. Like that game, it is a simplified adaptation of a PC game (Army Men II) to the Game Boy Color. The game is very similar to its predecessor. Players control green army soldier Sarge through a number of missions, with the goal usually being to destroy a number of tan army enemies. The missions are organized into two campaigns (Field and Assault), each consisting of three to four maps with three to five missions each, for a total of 31 missions in the game, with a boot camp training mission also available. Some of the maps are directly based on those in Army Men II, others have been newly designed. Unlike in Army Men II, all missions take place in the \"real\" world, where the plastic toy soldiers find themselves in environments like (relative to their size) huge gardens, kitchens or garages. Gameplay is unchanged from the predecessor. Seen from a top-down perspective, players control only Sarge, without a support squad as seen in the PC game. Sarge can pick up various weapons like flamethrowers, mortars and grenades in addition to his standard gun with unlimited ammo, but can carry only three items total. It is again also possible to enter and use vehicles. An overview map of the level shows both Sarge's and the enemies' positions. The game introduces a two-player mode via link cable, with two game modes: deathmatch and capture-the-flag. As before, the game features voice samples and saving via passwords.", "platform": "Nintendo Game Boy Color", "release_date": "November 22, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "3DO", "publishers": "3DO", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Army_Men_II", "video_link": "https://www.youtube.com/watch?v=zwG_ygH5IKs&ab_channel=EnriqueG.G%C3%A1lvez", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/21223-army-men-2\n"}