{"altername_name": [], "name": "Dancing Furby", "overview": "Main gameplay is similar to that of rythm games such as Dance Dance Revolution. Buttons pass a red line and the goal is to hit the corresponding button when it is in the middle of the red line. If the note is hit perfectly, the word \"Noo-Loo\" is displayed. If the note is hit just before or after it reaches the black line, the word \"E-Day\" is displayed. If the note is hit too early or late, the word \"Boo\" is displayed. When a note get's a \"Boo\" rating, the colored meter on the side of the screen goes lower. However, if this game is played on the original Game Boy, the meter is solid black. If the song is finished with the meter at red or yellow, the game is over. If the song is finished with the meter at green, you advance to the next song. In between levels, You can play mini games. They include: Hide and Seek, Furby Slots, Memory, and Furbish to Japanese Translation/Definitions. When a song is completed, the cartridge preforms a check to see if the game is being played on a Game Boy Color. If it is, the game displays a screen showing a Game Boy Color sending an infrared signal to a Furby. If you point the Game Boy Color's infrared port at any Adult Furby and press A while on this screen, it will fart if the game was beaten on easy, play hide and seek or yawn if the song was beaten on medium, and dance if it was beaten on hard. If you point It at a Furby baby and press A, it reacts the same way. However, instead of dancing if the song was beaten on hard, Furby baby will say \"You Rock! Rock Again!\". If you point it at a Shelby and press A, it also reacts the same way, but instead of dancing, Shelby would say \"Furby, you boogied!\".", "platform": "Nintendo Game Boy Color", "release_date": "1999", "game_type": "Released", "esrb": "Not Rated", "developers": "TOSE", "publishers": "Tomy", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=fcIiwAfTbTU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117335-dancing-furby\n"}