{"altername_name": ["The Secret of Happy Hippo Island", "Geheimnis der Happy Hippo-Insel, Das", "Secrets of Happy Hippo Isle, The"], "name": "Das Geheimnis der Happy Hippo-Insel", "overview": "Das Geheimnis der Happy Hippo-Insel (lit. \"The Secret of the Happy Hippo-Island\") is a platform game developed by Kritzelkratz 3000, published by JoWooD Productions and distributed by Infogrames for the Game Boy Color in 2001. Das Geheimnis der Happy Hippo-Insel was the first video game to feature the Happy Hippo characters by Ferrero, who have appeared as figurines in the company's Kinder Surprise chocolate eggs since 1988, as well as in various other forms of media and merchandise. It was released exclusively in German-speaking regions, where the characters are very popular, and is thus only available with German on-screen text; as the game is not very text-heavy, however, it can be played without understanding the language. The game is a relatively simple side-scrolling platformer. It stars the anthropomorphic hippopotamus Max Mutig (\"Max Courageous\"), who sets out on a journey to lift the secret around his home island's volcano, which has recently become active again and is causing destruction. In order to do so, he must venture through six areas, consisting of three levels each and filled with various enemies and hazards, which must be avoided or eliminated by various means, as well as fire, which can be doused by spitting water at it. Along the way, Max must also rescue numerous of his hippo friends and bring the island's five \"Happy Flowers\" back to life after the volcano has made them wither.", "platform": "Nintendo Game Boy Color", "release_date": "May 17, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Kritzelkratz 3000", "publishers": "JoWooD Productions Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115182-das-geheimnis-der-happy-hippo-insel\n"}