{"altername_name": ["Game Boy Wars Pocket Tactics"], "name": "Game Boy Wars 3", "overview": "Game Boy Wars 3, the third and final Game Boy Wars sequel produced by Hudson, was released on August 30, 2001 exclusively for the Game Boy Color. The working title during the game's development was Game Boy Wars Pocket Tactics during development. The gameplay of Game Boy Wars 3 is a departure from the previous Game Boy Wars titles, being modeled after the Nectaris series of war simulators that were also produced by Hudson. For example, indirect attack units can now move and attack at the same time in one turn. In contrast to the previous Game Boy Wars titles, having the required fund is not enough to produce certain units. The player must provide construction materials to the factories and cities as well. To do that, the player must deploy construction units to these sites and built the materials. These construction units can be used to cut down trees and create roads. Game Boy Wars 3 features a Beginner Mode, which gives the player a 16-part tutorial on how to play the game, as well as a Standard Mode in which the player can fight against the CPU or another player in one of 60 maps. There's also a Campaign Mode in which the player must fight through over 45 different maps that are dictated by a storyline, which has several branching points determined by the player's performance. A feature exclusive in the Campaign Mode is the ability to redeploy surviving units from a previous battle into the next one. Units gain experience points through combat, allowing them to be promoted from one of five ranks (D, C, B, A, and S), increasing their strength. Units who reach an S rank can be transformed into a new type of unit.", "platform": "Nintendo Game Boy Color", "release_date": "August 30, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Hudson Soft", "publishers": "Hudson Soft", "genres": "Strategy", "max_players": "4", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Game_Boy_Wars#Game_Boy_Wars_3", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18492-game-boy-wars-3\n"}