{"altername_name": [], "name": "Grimace's Birthday", "overview": "Grimace's Birthday is a platformer game, developed in 2023 by Krool Toys and published by McDonald's for web browsers, but developed for the Game Boy Color system. It was released on June 12, 2023 as part of McDonald's currently ongoing promotion featuring the return of McDonaldland characters Grimace, Birdie the Early Bird, Hamburgular and the McNugget Buddies for the Grimace's Birthday ice cream shake product served at U.S. McDonald's restaurants since June 12, 2023. The game is playable on https://grimacesbirthday.com/ as of now. The game sees Grimace, the McDonaldland tastebud (according to the McDonalds Twitter apparently) going across town to round up his McDonaldland pals: the Hamburgurlar, Birdie the Early Bird, and the McNugget Buddies; in order to properly celebrate his birthday party at his favorite local McDonalds restaurant. GAME: Grimace must reach the end of the stage by reaching the goal point of each stage before time runs out. The first two levels see Grimace skating, while he goes barefoot on the last two stages. Grimace gets points for performing skating tricks and popping balloons. If Grimace gets hurt, he will trip and fall on the ground, losing points along the way. Hurry and press UP to get back up! Across the four levels in the game, there are 40 Grimace milkshakes to collect. They can be found spread across the entirety of all four levels. The Darkside Grind and 50-50 Grinds are automatically performed when grinding on rails if playing on the Normal difficulty. If playing on the Hard difficulty, Grimace must manually grind using the UP and DOWN buttons or else he will fall off the rails. Game points are doubled if played on Hard. ------CONTROLS------ These are the game's controls as shown through the official website's instructions. --MENU CONTROLS-- A BUTTON: Start game/Select menu option B BUTTON: Previous screen or menu/cancel option CONTROL PAD: Move selection SELECT: Change the color of Grimace's skateboard. You can choose between --GAME CONTROLS-- CONTROL PAD: - UP: Darkside Grind (if playing on Hard mode), makes Grimace get up after falling on the ground. - DOWN: 50-50 Grind (if playing on Hard mode), drop down a thin platform. - LEFT and RIGHT: Move Grimace. - A BUTTON: Jump. Hold A for a Super Jump. Press A and then press the B Button while in the air for a Kickflip. float higher in the air while inside the bubble. - B BUTTON: Kickflip (while in midair after pressing the A Button), pop the bubble while inside it. - START: Pause game. You can retry and skip levels here. (You can only skip levels in the main game mode) -- SKATING MODE -- Aside from the main game mode, there are two additional modes dedicated to Grimace's skating hobby seen in the first two levels. - In SCORE ATTACK, the player must score as many points as possible before time runs out in a wide area exclusive to the game mode. There are 20 presents spread throughout the area and are tallied at the end of the game. - In FREESKATE, the player can explore the SCORE ATTACK area without the time limit. ----- ORIGINAL GAME DESCRIPTION ----- \"Help Grimace find his friends in time to blow the candles out, and collect enough birthday shakes for his guests along the way!\" This is a officially published homebrew game by McDonald's. It is not licensed or endorsed by Nintendo. This game was developed using GB Studio. Grimace's Birthday is property of: Game: Krool Toys and McDonald's Corporation. McDonaldland characters (Ronald McDonald, Grimace, Birdie the Early Bird, Hamburgular and other characters): McDonald's Corporation.", "platform": "Nintendo Game Boy Color", "release_date": "June 12, 2023", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Krool Toys", "publishers": "McDonald's", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.44", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Jk61dHLut7A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369769-grimaces-birthday\n"}