{"altername_name": [], "name": "Jisedai Begoma Battle Beyblade", "overview": "The very first video game released, it also acted a prototype for many of the concepts of the Beyblade franchise and was released in conjunction with the first set of 3 Beyblades ever produced. Compared to the rest of the Beyblade franchise, this game represents some unique ideas and concepts that were never carried on into the main Beyblade series itself. It bears more of a resemblance to Pokémon in style and is the only game within the Beyblade franchise which is a true \"J-RPG\" style. The player goes around the storyline collecting bits and beyblade parts while fighting enemies and progressing throught the game. Each bit-beast has its own unique attack (though some do nothing until their bits upgrade themselves to their final form) and like Pokémon certain ones also evolve when the bits reach a certain experience (there are 3 stages like Pokemon). At the start of the game, there are limited things Tyson can do. After getting the rank of \"C\", the player is given TP, the currency of the game allowing them to purchase items, after winning battles TP is now also awarded not just experience for the Bits. The WBA buildings also become available, here you can exchange stores Beyblades, connect to other players or look at each building's list of trades. Each bit also has a typing which contributes a little bit of the battle against other types, much like in Pokémon. The types include fire, devil, fighting, rock, electricity, Tyson has also a \"Power meter\" powered by \"POW\" that goes down over time, requiring him to purchase items to restore it. This represents strain on his arms. If the meter runs dry, he faints and returns to his home of origins. IF you are pretty far into a location this means you have to travel back to the location.", "platform": "Nintendo Game Boy Color", "release_date": "July 23, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Rokumendo", "publishers": "Hudson Soft", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=880HENc8xPs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117431-jisedai-begoma-battle-beyblade\n"}