{"altername_name": ["Keitai Denjū Telefang: Power Version", "Mobile Monsters Telefang: Power Version", "携带电兽 力量版"], "name": "Keitai Denjuu Telefang: Power Version", "overview": "Telefang is a monster-collecting RPG with monsters known as Denjuu that live in a world called the Denjuu World. These Denjuu have cellphones called D-Shots and they battle each other. They can befriend T-Fangers, people who specialize in handling and befriending Denjuu and having them battle other Denjuu. Shigeki, the protagonist, a T-Fanger. When arriving to the Denjuu World, Shigeki is determined to befriend Denjuu to solve the various problems in the Denjuu World that crop up from time to time. Shigeki starts with the Denjuu Crypto, and from there, befriends and battles other Denjuu. In a battle, a T-Fanger can have from one to three Denjuu to battle. They bring Denjuu by calling them. A T-Fanger will always have one Denjuu with them, but the other two have to be called in order to have them battle. The better the coverage on the T-Fanger's D-Shot, the more Denjuu they can use in battle. Also, depending on the T-Fanger's location, some Denjuu will be close by, but others will be so far away that they may take multiple turns to arrive. This can serve an important role in deciding which Denjuu to pick, and can be a tough decision to make when stronger Denjuu live farther away than weaker Denjuu. Also, Shigeki can see the opponent's Denjuu ahead of time, which can affect his decision on which Denjuu to use. Each Denjuu has a certain habitat type (out of 6), which affects the damage done to other Denjuu. All of a Denjuu's moves are the same as their type. Depending on the matchup against another Denjuu, a Denjuu's attacks can do either greater damage than usual, or less damage than usual. The type matchups are a 6-way rock-paper-scissors chain: Forest Aquatic Desert Grassland Mountain Sky Forest. Due to the nature of 3-on-3 battles, a Denjuu can have a type that covers the weaknesses of a teammate's Denjuu, making some battles interesting. Each Denjuu has a moveset from 2-4 moves, which expands as the Denjuu levels up. While the moves are fixed, they often change (and typically get more powerful) when they evolve. Each move can do various things, such as deal damage, raise a stat, inflict status conditions, heal, and so on. Also, the fourth move is always a Denma Attack -- this is a powerful move, and runs off the attacker's Denma Attack stat and the opponent's Denma Defense stat. However, the tradeoff is that takes many turns to charge up, which can mean that the Denjuu may be defeated before it gets fully charged. Also, it can miss, so when it does, there are many turns wasted. Finally, there are moves that some Denjuu have that evade attacks, including Denma Attacks, which can also mean many turns wasted. This adds strategy in whether Denma Attacks are good to use or not. Each Denjuu can evolve in different ways, with complex evolution chains. The most common method is natural evolution, which takes place when a Denjuu reaches a certain level. This takes longer than the other two methods, but is usually the best stat-wise. Another method is fusion evolution, a method that fuses Denjuu with manmade items. While many Denjuu can evolve with this method (and in fact, some Denjuu can only evolve this way), and it is the quickest method, it is generally the worst stat-wise. The last method is lab evolution. These Denjuu evolve from DNA samples from a specific set of Denjuu, and often Denjuu that evolve with this method don't evolve naturally. It tends to be better stat-wise than fusion evolution. Outside of battles and Denjuu, each area has some problem that has to be solved, such as by beating certain bosses along the way. Some areas involve talking to other people and Denjuu, while others have complex and long mazes that must be navigated.", "platform": "Nintendo Game Boy Color", "release_date": "November 3, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Natsume", "publishers": "Smilesoft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.11", "wikipedia": "https://en.wikipedia.org/wiki/Keitai_Denjū_Telefang", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28785-keitai-denjuu-telefang-power-version\n"}