{"altername_name": ["Mobairu Torena"], "name": "Mobile Trainer", "overview": "The Mobile Trainer is the operation software for Nintendo and Mobile21's now defunct (as of December 14, 2002) Mobile System GB service, designed for both Game Boy Color and Game Boy Advance. It was first released on January 27, 2001 (originally planned for December 2000) with a recommended retail price of ¥5800, before a price cut to ¥3800 from July 19, 2001. By late March 2001, Nikkei reported that Nintendo had only sold 80,000 units; the reason provided was that the only game to extensively use the Mobile Game Boy Adapter at the time was Pokémon Crystal, which was targeted at a younger audience whom may not have access to a mobile phone. The Mobile Trainer was originally planned to be released as the Mobile Starter Cartridge, but the name was later changed, perhaps to allude to Pokémon Trainers, as the Japanese Pokémon Crystal Version was one of the intended games to use it. The Mobile Trainer was intended to be used for the combination of a peripheral known as the Mobile GB Adapter and Japanese mobile phones to connect to the World Wide Web, similar to services such as Satellaview, Randnet and its successors such as the Nintendo Network. This included games relevant to the Mario series, such as Mobile Golf and the Japanese version of Mario Kart: Super Circuit. The Mobile Trainer's main purpose was as operation software for configuring the Game Boy Color with the user's mobile phone. However, the Mobile Trainer could also be used to connect to a limited web browser for news, and to send email between friends.", "platform": "Nintendo Game Boy Color", "release_date": "January 27, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "MissingLink", "publishers": "Nintendo", "genres": "", "max_players": "", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/140921-mobile-trainer\n"}