{"altername_name": [], "name": "Pokemon Crystal Ultimate", "overview": "You’ve probably heard about my upcoming ROM hack, Pokemon Crystal Ultimate! The most recent playable version is v0.8, which includes everything up to and including the E4. The goal of this hack is to provide fans with the ultimate Pokemon Crystal experience, a sort of remastering in which the story, Pokemon, and would remain the same, but the game is more playable, balanced, and challenging. There’s also some new content, as well as many QoL improvements ranging from music to sprite work to brand-new features and battle system enhancements! Because of a thorough revision of moves, typing, learnsets, base stats, and Pokemon availability, almost everything is now viable. The game’s difficulty has been increased by redesigning the level curve and adding custom moves, DVs, and stat experience to trainer parties, as well as providing a greater variety and number of Pokemon to their teams. The game, on the other hand, is designed to be Nuzlocke-able, so the challenge, while high at times, is fair. Locations in the original game that was mostly empty, such as Ilex Forest, Ice Path, and Victory Road (not to mention Kanto), now have extra trainers and items. I’ve also taken some liberties to spice up and rebalance gameplay, such as changing the type of a dozen Pokemon, swapping out a few regular-shiny palettes to reflect this, and changing type matchups to balance out Poison and Steel. Understandably, some players may find that some of these changes deviate too far from what they expect from this type of hack, so I created a Classic version of the game that removes most base stat changes, Pokemon typing and type matchup changes, most palette swaps, and will lower the shiny rate slightly in the final release. The ‘Classic’ tag is used in the documentation to identify the specific differences for that version (see Discord link at the bottom of this post). In addition, all 251 Pokemon can be obtained through normal play, and all Johto Pokemon can be obtained before reaching the Pokemon League, with the exception of legendaries and starter/odd egg Pokemon that you did not obtain. On top of that, there are numerous quality-of-life improvements as well as brand-new features that improve playability without detracting from the original game’s feel! Below are some screenshots, followed by a list of features.", "platform": "Nintendo Game Boy Color", "release_date": "2023", "game_type": "ROM Hack", "esrb": "", "developers": "Major Agnostic", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373249-pokemon-crystal-ultimate\n"}