{"altername_name": [], "name": "Pokemon Kalos Crystal", "overview": "Pokemon Kalos Crystal is a sequel to Unova Red. This is a re-imagining of Generation 2, where the first generation of Pokemon was the Unova Pokedex, and the new second-generation Pokemon is the Kalos Pokedex. This game features all Pokemon from generations 5 and 6, and like in Unova Red, all Pokemon in the Pokedex is obtainable within a single playthrough. Aside from the new Pokemon, the game functions primarily the same as the original. The biggest difference is the inclusion of Fairy types. This game also adjusts the type matchup chart to the modern chart first used in Gen 6. All new attacks added into Unova Red are still here, as well as several new attacks to fill out the new Fairy type, as well as add some signature moves to Gen 6 Pokemon, and simply flesh out some underrepresented types. An equivalent number of moves were removed from the game as well, mostly signature moves of Gen 1 & 2 Pokemon, or simply moves that did not fit well with the Gen 5 & 6 Pokemon. Like in Unova Red, all standard trade evolutions have been changed to standard level-up evolutions, and some of the stone evolutions were modified as well. All Gen 5 Pokemon evolve identically to how they did in Unova Red. A full list of evolution methods can be found in the spoiler logs. Some TMs have been altered, and a full list can be found in the spoiler logs. Notably, like in Gen 2, TMs are still only for one-time use. Also, like in Gen 2, moves are still classified as Physical or Special based on type. The only exception (as in Unova Red) is that Ghost is classified as SPECIAL, while Dark is classified as PHYSICAL. Also, the new Fairy type is classified as SPECIAL.", "platform": "Nintendo Game Boy Color", "release_date": "2019", "game_type": "ROM Hack", "esrb": "", "developers": "Azure_Keys", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373252-pokemon-kalos-crystal\n"}