{"altername_name": ["Pokemon Card GB2 GR-dan Sanjou!", "Pokemon Trading Card Game 2: The Invasion of Team GR!", "Pokemon Trading Card Game 2: La Invasion del Team GR!"], "name": "Pokémon Card GB2: GR-dan Sanjou!", "overview": "Pokémon Card GB2: Great Rocket-Dan Sanjo!, released March 28, 2001, is the Japanese-exclusive sequel to the original Pokémon Trading Card Game, also for the Game Boy Color. Like its predecessor, the game was developed by Hudson Soft and published by Nintendo, and was first announced in January 2001 by Japanese website WatchImpress. It includes new enhancements, such as the ability to choose the gender of the player character, a training mode to help new players, a Deck Diagnosis to rate the effectiveness of a player's deck, and a new group of antagonists known as Team Great Rocket. The game features all cards from the original game, along with new cards from the fourth set, Team Rocket, as well as cards originally exclusive to Japanese vending machines and the Pokémon Trading Card Game Instructional Video Intro Pack, bringing the total number of cards to 445. Like the previous title, players must travel across the game world challenging non-player characters to simulated battles using rules adopted from the original tabletop version. All locations from the original are present, along with a new setting known as GR Island which contains its own Battle Masters for players to encounter. By defeating a total of 16 Battle Masters on the old and new islands, players may challenge the game's final boss, King Biruritchi. Though an English release in North America was deemed \"likely\" by website IGN in 2001, the game has not been made available outside Japan. Pokémon Card GB2 earned a 29 out of 40 score from Japanese Weekly Famitsu magazine.", "platform": "Nintendo Game Boy Color", "release_date": "March 28, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Hudson Soft", "publishers": "The Pokémon Company", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "4.26", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/57332-pokemon-card-gb2-gr-dan-sanjou\n"}