{"altername_name": ["ポケモンピクロス", "Pokemon Picross"], "name": "Pokémon Picross", "overview": "Pokémon Picross (Japanese: ポケモンピクロス Pokémon Picross), not to be confused with the 3DS game with the same name, was a Game Boy Color game slated for release in 1999, with snapshots of the game published in several video game magazines, but was ultimately scrapped. A near-final prototype dump of the game was surfaced online on September 10, 2020, as part of a major leak of Game Boy / Game Boy Color prototypes, which was dubbed \"Nintendo Gigaleak 3\" by the fans. The game's UI is seemingly based on Picross 2, as the games have similarities such as map-based level select screen and multi-piece puzzles. As a Gen I spinoff game, the game features sprites of all 150 Pokémon available in Pokémon Red/Green/Blue. The game was planned to be compatible with Game Boy Printer, with the sprites being printable by being viewed on the in-game Pokédex. The game is divided into 11 levels, each one featuring 15 puzzles (with the final one being locked). Once 8 puzzles are completed (halfway the level), the 15th puzzle would be unlocked. A perfect completion of each puzzle occurs by solving the puzzle within the time limit determined to it, with a Master Ball as the reward; otherwise, a normal Poké Ball would be awarded. There is a variety of themes (music / border) assigned to certain Pokémon, which appears as Ash's partner in the level select map. The only one available from the start is Pikachu, and more could be unlocked by completing odd-numbered levels, accompanied by a \"catching\" animation sequence.", "platform": "Nintendo Game Boy Color", "release_date": "", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Jupiter", "publishers": "Unreleased Prototype", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.07", "wikipedia": "https://picross.gamepedia.com/Pokémon_Picross_(Game_Boy_Color)", "video_link": "https://www.youtube.com/watch?v=DzejFeVK_eI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148155-pokemon-picross\n"}