{"altername_name": [], "name": "Pokémon Red DX", "overview": "Based on: Pokemon Red So in this game, it's a ton of features and if you like Gameboy Game so you will like it. So so why I try to say about it? Because in this game, you can have a battle with your friend through TGB Dual or Pokemon Showdown server. Yup, and Great... :))) hmm I don't like the online feature but I know a lot of people need it so, I think you will like. About Pokemon, in this game, you can have 254 Pokemon from Gen 1 to Gen 5 with Gen 2 Graphics. Hmm I mean The Graphic is from Pokemon Gold and Silver. Dark, Steel and Fairy types are included in this game. About Moves, hmm you can have over 50 new moves with 4 difficulty settings for you play. And If you like Battle Factory and Battle Tent, let's see, you can have it in this game. And you can use HM similar to GBA Rom.. hmm and Inverse Mode in this game. :)) Great but I don't like that mode.. haha. Features: Trading and battling has been preserved in its entirety. Link up with a friend online through TGB Dual or play on a modded Pokémon Showdown server. See the TGB Dual/Showdown Tutorial document within the .rar file for more information. Now, you can play the entire game in color! Red and Blue DX have been upgraded to a full-fledged GameBoy Color game. Don't like the old, drastically different Generation 1 sprites? Now you can choose between the Generation 1 and Generation 2 sprite set! Pokémon now look more vivid than ever! The monsters have updated colors to match their official art. There's 103 new Pokémon - 254 for you to catch in all, up from 151 in the original games. Can you find them all? Pokémon look sharper than ever with updated back visuals! Newer Pokémon players can enjoy an updated type chart from the recent generation of Pokémon games. Introducing the Dark, Steel and Fairy types! [Fairy is classified as a Special type.] Choose which version you play carefully - Red and Blue now have many differences! 4 difficulty settings for you to play! (see note *4 at the bottom) 50+ new moves! Unique new cries for all new Pokémon! Evolve your Pokémon with new items and evolutionary Stones! Some may even evolve depending on your location. The all-new Inverse Mode from X and Y! You can even switch it on and off before a Link Battle. All 254 Pokémon obtainable in one version - some will be way harder than others to find depending on which you play. Battle Factory and Battle Tent from Pokémon Emerald make their appearance! Now, there's even more things for you to accomplish after you've beaten the Elite Four - some trainers may even rematch you! Complete the Pokédex in addition to this and you'll face the most experienced trainer in the Kanto region... Several beloved quality of life features make their return, such as the Running Shoes and many more. (see note *1 at the bottom) Trainers will keep you on your toes with increased intelligence. You may now encounter rare and mysterious Shiny Pokémon! Some are even more colorful and polished than before. Tired of being unable to erase HMs? Now you can! HMs can now be overwritten at any time. Love to explore? The world of Kanto now gives you more opportunities to roam as you please. Some of the battle mechanics from the original games have been upgraded, such as Substitute. The worlds of Kanto come to life with a remixed soundtrack! (see note *2 at the bottom) The feel of the original pair of games can still be felt - many battle mechanics have been kept intact, as well as the original art work. For a more modern Red hack, I'd highly advise playing Red++. (see note *3 at the bottom) Many more changes await you!", "platform": "Nintendo Game Boy Color", "release_date": "", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "TheScarletSword", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129943-pokemon-red-dx\n"}