{"altername_name": [], "name": "Pokémon Crystal Kaizo", "overview": "This is a significantly more challenging hack of Pokemon Crystal, where you can obtain all 251 Pokemon in Second Generation. Numerous areas have been redesigned, many dungeons and routes are more treacherous than before. Every non-boss trainer in the game has an AI boost, and the default movesets are made to be far more threatening. Team Rocket members and especially Team Rocket leaders are a considerable threat. Wild Pokemon distribution is vastly improved, with levels fairly close to trainers. You can catch quite a variety of pokemon early on. In addition, the odd egg from the daycare man can yield one shiny pokemon, which could be either one of the starters, Dratini, Larvitar, one of two Tyrogues with different attack DVs, Magby, Smoochum, Elekid, or an Eevee. Apart from Slowking, who evolves by water stone, you can evolve trade evolutions by level up. Eevee evolves into Espeon and Umbreon using Sun Stones and Moon Stones respectively. You can purchase stones as early as goldenrod, where the game will start to pick up on the difficulty. Every major Boss in the game has shiny pokemon, and apart from the early rival fights, every boss in the game has a full team of six, with dangerous movepools, healing items, and as time goes on, held items. Initially the Gym Leaders will stick to their specialty types, but as soon as you get to the Rival in Ecruteak, they will start to use diverse pokemon with a few of these specialty types, using moves corresponding to that type as coverage or status, and sometimes, counters. These major bosses include Team Rocket Executives, the Elite Four, and Champions. After seven badges, you will face against very powerful enemies with fully evolved and dangerous pokemon, and you will eventually reach level 100 after the eight badge. The Rival at the end of Victory Road may catch you off guard, and the Elite Four and Champion will probably be the most difficult part of the game. Post-game will be slightly less intense than victory road, apart from Kanto Gym leaders, who will be on part with the Champion in terms of difficulty. However, there are 4 superbosses, including Leader Blue, who will be far more difficult than the others. The other three include the Trainer House, Red on Mt. Silver, and one obscure Rival fight at the indigo plateau, that only appears on Mondays and Wednesdays only after you beat him in Mt. Moon. A major update involves Revives, Max Revives, and Revival Herbs; they cannot be used during battle. They can only be used outside of it, so there are consequences to losing your pokemon in battle, in which you cannot revive them while you are battling, only when it is over. Added the Team Rocket Battle Music to Executives and Scientists. As well as ethers in shops, some graphic changes, and bicycling in Goldenrod Underground and Team Rocket Hideout.", "platform": "Nintendo Game Boy Color", "release_date": "October 8, 2014", "game_type": "ROM Hack", "esrb": "", "developers": "SinisterHoodedFigure", "publishers": "", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156608-pokemon-crystal-kaizo\n"}