{"altername_name": ["Pokemon Polished Crystal"], "name": "Pokémon Polished Crystal", "overview": "Hack of Pokémon Crystal Version by Rangi. Features: This isn't a complete list, just a summary of the notable ones. Pokémon: • The entire Pokédex of 253 Pokémon can be caught in one game. Some Pokémon, like Houndour, Murkrow, and Misdreavus, are available at sensible locations in Johto without having to wait for Kanto. • Added: Leafeon, Glaceon, Sylveon, Togekiss, Weavile, Honchkrow, Mismagius, Electivire, Magmortar, Magnezone, Tangrowth, Rhyperior, Porygon-Z, Yanmega, Gliscor, Mamoswine, and Munchlax. • Removed: Spearow, Fearow, Lickitung, Goldeen, Seaking, Hoppip, Skiploom, Jumpluff, Shuckle, Aipom, Stantler, Cleffa, Igglybuff, Smoochum, and Delibird. (I miss them too. :( ) • New evolution methods work, like Eevee evolving into Glaceon near Ice Rock, or Yanma evolving into Yanmega when knowing AncientPower. • Item trade evolutions (like Seadra holding a Dragon Scale) now evolve by leveling up while holding the item. • Machoke, Graveler, Haunter, and Kadabra evolve by having sufficient stat exp in Attack, Defense, Speed, and Special respectively (five Protein, Iron, Carbos, or Calcium is enough). • Magneton evolves into Magnezone near the Lodestone in Rock Tunnel. Moves: • Added: Aerial Ace, Air Slash, Aqua Tail, Astonish, Avalanche, Bug Buzz, Bulk Up, Bullet Punch, Calm Mind, Dark Pulse, DazzlinGleam, Disarm Voice, Dragon Claw, Dragon Dance, Dragon Pulse, Drain Kiss, Earth Power, Energy Ball, Extrasensory, Fairy Wind, Flare Blitz, Flash Cannon, Focus Blast, Gunk Shot, Hail, Hex, Hone Claws, Hurricane, Hyper Voice, Ice Shard, Icicle Crash, Iron Head, Metal Sound, Moonblast, Nasty Plot, Night Slash, Play Rough, Poison Jab, Power Gem, Psystrike, Seed Bomb, Shadow Claw, Stone Edge, Water Pulse, Wild Charge, Will-O-Wisp, X-Scissor, and Zen Headbutt. • Removed: Acid Armor, Amnesia, Barrage, Beat Up, Bide, Bind, Bone Club, Bone Rush, Bubble, Clamp, Comet Punch, Constrict, Conversion2, Cotton Spore, Detect, Fissure, Frustration, Guillotine, Horn Drill, Jump Kick, Kinesis, Lovely Kiss, Meditate, Mega Kick, Mega Punch, Mimic, Mind Reader, Mirror Move, Poison Gas, Powder Snow, Present, Psych Up, Psywave, Razor Wind, Rolling Kick, Sharpen, Skull Bash, Smog, Snore, Spider Web, Spite, Sweet Scent, Synthesis, Tail Whip, Vice Grip, and Withdraw. • Learnsets have been updated close to Gen VI, with missing moves replaced by similar, egg, TM, or event-exclusive moves. Battle mechanics: • The Fairy type, with the Pink Bow as its type-enhancing item. • Type chart, base stats, and move attributes all updated to Gen VI. • Physical/Special/Status split. • Natures (determined from DVs since personality values don't exist in Gen II) thanks to FredrIQ. • Gain experience from catching Pokémon. • Play low-pitched cries when a player or foe Pokémon faints. • Money loss formula from Gen V. • Shiny Pokémon now have an odd Attack DV, 2, 3, 7, or 11 Defense, 5 or 13 Speed, and a perfect 15 Special; so 1 in 1,024 Pokémon is shiny. • Type-enhancing items raise by 20%, not 10%. • Many battle mechanics have been updated to Gen VI, but not all. (For example, Waterfall has a 20% flinch chance, but sound-based moves don't bypass Substitute. Yet.) • Wild Pokémon have more common held items (50% chance for a common one and 5% for a rare one). Giving an Amulet Coin to your lead Pokémon increases this to 60% and 10%. Overworld mechanics: • Hold B to use Running Shoes, or turn on the Option to always use them. • Unlimited-use TMs. • Continuous Repel system. • Cure poison when it reaches 1 HP outside a battle. • Eggs hatch at level 1. • Trees randomly give 1, 2, or 3 Berries. • Surf at Bicycle/Running Shoes speed. • Maximum $9,999,999 money and 50,000 coins. • Maximum 30 items and 16 Balls in your bag pocket. • Bill calls to switch boxes when one is full. Nuzlocke mode: • Available in the Option menu at any time. • A fainted Pokémon can't be revived, by items, Pokémon Centers, or events. The only exception is your first rival battle, when you just have your starter. • You can only catch the first Pokémon you encounter in a new location. \"Location\" is defined with the Town Map mechanics, so Sprout Tower is separate from Violet City, but multiple floors of Union Cave or multiple sections of the Safari Zone count as one location. And nothing is counted until you receive your first five Poké Balls. • Every Pokémon gets a nickname, no asking whether you want to or not. Of course, you can cancel out to give the default name. • The dupes clause is in effect. If you've caught a Pidgey and encounter one on a new route, it won't count unless you catch it. • The shiny clause is also in effect. Shinies can always be caught. • Gift Pokémon do not count as encounters. Static encounters like Sudowoodo, Snorlax, and Suicune do. Maps: • Restored locations from R/B/Y and HG/SS: Viridian Forest, Pewter Museum, Celadon Hotel, Silph Co., Pokémon Mansion, Seafoam Islands, Cerulean Cave, Goldenrod PokéCom Center, and Bellchime Trail. • Original locations, including Cinnabar Volcano, a new floor of Rock Tunnel, Cherrygrove Bay, Goldenrod Harbor, Route 35 Coast, the Ecruteak Shrine from Pokémon Christmas, custom-designed PokéWalker routes, and others. • Decorative features added to cities and routes, often from HG/SS. • HG/SS-style Town Map. Events: • Team Rocket has another plan to thwart. • Random Wonder Trades in the Goldenrod PokéCom Center, including random held items and original trainers. • Catching all 26 Unown is worthwhile… • Move Reminder in the same house as the Move Deleter. (Code borrowed from TPP Anniversary Crystal, thanks to its developers graciously making their source code public.) • 21 move tutors throughout Johto and Kanto. • Falkner is in Dark Cave, encouraging you to beat Sprout Tower first. • Photographing your Pokémon at the Cianwood Photo Studio once a day now makes it happier, like haircuts or massages. (No more GameBoy Printer support.) • The Mystery Gift girl in Goldenrod Dept. Store gives you a random Berry once a day. (No more Mystery Gift support.) • The Poké Seer is replaced by the Stats Judge. • Lt. Surge's electric fences are back. • Celadon Dept. Store now has a TV Game floor and a Home Decor wing. • Revised in-game trades. • Revised Game Corner prizes. • Revised Buena's Password prizes. • The Odd Egg is always shiny, with an equal chance to be either gender. • Three of Prof. Oak's aides give you items as you complete the Pokédex. • Bill's grandpa gives you one of each evolutionary stone in Goldenrod City. Later they can be bought in Celadon Dept. Store. • Eusine shows you the legendary beasts in Celadon City in case you haven't found them roaming. • Respawn any fainted legendaries (except for Celebi) after beating the Elite Four. (Suicune roams instead of appearing in Bell Tower.) (Also respawns Sudowoodo.) Trainers: • Lyra from HG/SS is your friendly rival. She battles you and gives you some items throughout the game. • The four Rocket Executives from HG/SS are introduced. • New trainer classes: Elder, Rich Boy, Schoolgirl, Cowgirl, Battle Girl, Hex Maniac, Guitarist♀, Officer♀, Sr. & Jr., Couple, Breeder, PI, Dragon Tamer, Ace Duo, and Roughneck. • Battle Lorelei, Agatha, Bill, Valerie, and some other special characters. • Battle Cal in Viridian City's Trainer House if you're a girl, Kay if you're a boy. • Rematch the Elite Four at higher levels after earning all 16 badges. • Rematch Gym Leaders and other special trainers in the Fighting Dojo after earning all 16 badges. • Battle Tower has new trainers. • A few NPC trainers have shiny Pokémon. • Breeders can be rebattled like in B2/W2. Items: • Revised set of 65 TMs and 8 HMs. • Four new Poké Balls from Devon Corp. • Dome Fossil, Helix Fossil, and Old Amber. Revive them in the now-open Pewter Museum of Science. • All of the decorations for your room are available in different places. • Earn a Silver Trophy when you beat the Elite 4 and a Gold Trophy when you rematch them at higher levels. • Other items including Eviolite, Muscle Band, Wise Glasses, and X Spcl. Def. Bug fixes: • Dragon Fang boosts Dragon-type moves, not Dragon Scale. • Burn/Poison/Paralyze improve catch rate. • Moon Ball catches Moon Stone evolvers. • Love Ball catches opposite sex. • Fast Ball catches flee-prone Pokémon. • Medium-Slow growth rate experience underflow at level 1. • HP bar lowers at the same speed even for high HP. • Belly Drum needs to cut HP to raise Attack. • Lake of Rage Magikarp are larger, not smaller. • Rocket Executives use Team Rocket battle music, not just Grunts. • The Ruins of Alph tile with their surrounding maps. (Did this annoy anyone else when making huge maps of Johto?) Difficulty: • Default Set battle style. • Enemy AI doesn't fail an extra 25% of the time with sleep or poison-inducing moves, or 40% of the time with stat drops. • No badge boosts to stats or types. • Improved some trainers' rosters, movesets, held items, and DVs (particularly Gym Leaders, the Elite Four, and other bosses). • AI improvements, such as not trying to paralyze Electric types or burn Fire types. • A smoothly increasing level curve, with the final trainer of the game at level 100. Changes and buffs: • Many base stat changes, mostly based on Drayano's Sacred Gold/Storm Silver. • Cut is Steel-type, and has 60 power and 100% accuracy. • Hidden Power is ???-type and has 70 power. • Metronome is ???-type. • Sing has 75% accuracy (matching Lovely Kiss). • Supersonic has 65% accuracy. • Submission and Take Down have 90 power and 100% accuracy, like Wild Charge. • Hail boosts Defense of Ice-types by 50%. • Fly has 100% accuracy. • Strength has 90 power. • Rock Smash has 75 power. • Whirlpool and Fire Spin have 90% accuracy. • Pain Split is Ghost-type. • Some Pokémon have new types (for example, Ledian is Bug/Fighting, Persian is Normal/Dark, and Dunsparce is Normal/Ground). I know that not everyone likes this kind of change, so I've provided two ROM patches. The \"faithful\" patch keeps the canon Pokémon stats and move attributes. Graphics and music: • Restored original Japanese sprites for Beauty, Fisher, Medium, Sage, and Swimmer♀. • Replaced Twins sprite with a devamped one from B/W. • New music ported from RBY and devamped from future generations. • Unique mini sprites for each Pokémon (thanks to this patch). • Revised some shiny palettes (Dragonite is blue like Dragonair, Nidoqueen is pink like Nidoking, Scizor is silver, Espeon is sky blue, Electabuzz is red, etc). • Unown isn't the only Pokémon with variant forms… • Color-coded starter Poké Balls. • Item balls for TMs are blue (inspired by Gen VI's yellow). • Surfing on Pikachu uses the minigame music from Yellow version. More tweaks: • Lowercase Pokémon, moves, items, types, names, etc. • Fast text by default. • Stereo sound by default. • Third Trainer Card page for Kanto badges. • Fourth stats page for capture data formerly told by the Poké Seer. • Move stats include type, category, power, and accuracy. • Updated language (Pack → Bag, Enemy → Foe, Cooltrainer → Ace Trainer, Fisher → Fisherman, Elixer → Elixir, Pink Bow → Silk Scarf, new Berry names, etc). • Brass Tower → Gong Tower (かね kane can mean 金 \"metal\" or 鉦, a gong-like bell). • Nidorina and Nidoqueen can breed, and will produce eggs of either Nidoran gender. • Fly to the Rock Tunnel/Power Plant Pokémon Center. • The Mineral Badge, not Storm Badge, makes Pokémon up to L70 obey, like in HG/SS. • The Zephyr Badge lets you use traded Pokémon up to level 20, like in HG/SS. • Flash does not require the Zephyr Badge. • Fishing works 75% of the time, not 50%. • Always show numbers in Pokédex, even in Johto order. All this and I haven't even mentioned some of my favorite additions. Don't want to spoil everything", "platform": "Nintendo Game Boy Color", "release_date": "July 17, 2016", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Rangi", "publishers": "", "genres": "Adventure", "max_players": "2", "cooperative": "No", "rating": "4.88", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bTX-pRvfvOo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95866-pokemon-polished-crystal\n"}