{"altername_name": [], "name": "Power Pro Kun Pocket 2", "overview": "Power Pro-kun Pocket 2 is a 2000 arcade Baseball simulator developed by Diamond Head and published by Konami for the Game Boy Color. The simple simulator works the same as it did in the first game, but now 12 teams of the Japanese league are available for free play. The game's main feature is its Success story scenario, \"Drill Moglars Edition\", which follows a new protagonist: a professional ballplayer who's been drafted into the Moglars, a small-time team owned by the Drill corporation. With the team already facing the threat of dissolution from severe mismanagement and outstanding debts, the protagonist must strive to lead them to the top of the Japanese league. Unlike how most Jikkyou Pawafuru Puroyakyū games feature a negative continuity with the same cast of characters always at the same age, Pawapoke 2 starts to expand the setting from Pawapuro 5 across a storyline that spans over 30 years. The player must manage the protagonist's weekly routine to train, meet new teammates and date one out of a few love interests. Failing to keep the protagonist healthy, losing too much reputation or losing any late-game matches once again results in a game over which erases the player's save file. It is possible to reset the game to prevent that, but there are restrictions and penalties for doing so. Clearing the Drill Moglars scenario enough times reveals \"War\", the \"Inner Success\" scenario. This new story sees the protagonist exploring warzones during World War II. Its highlight is the Minesweeper gameplay with unusual rules: the player must guide the protagonist to the top of each board while looking out for mines and collecting items with unknown effects. Upon clearing either Success mode, the player can use the resulting character to build a custom team for playing Baseball on the Exhibition mode. Matches between two people who own the game and a link cable are supported. Characters can also be swapped between players, and they'll keep certain attributes that are needed to unlock the harem ending for Drill Moglars and the truth behind the War scenario. In 2004, a compilation remake of this game and its prequel was released for the Game Boy Advance.", "platform": "Nintendo Game Boy Color", "release_date": "March 30, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Diamond Head", "publishers": "Konami", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "0.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=JbnL4JD3wq0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117516-power-pro-kun-pocket-2\n"}