{"altername_name": [], "name": "Space-Net: Cosmo Blue", "overview": "Each agent has their own seven character ID. The ISNA developed a spaceship called \"Space-Net\" with two builds, Cosmo Red and Cosmo Blue and the one that the player receives depends on the game version. From the cockpit, Space-Net allows users to do things like warp to different planets, view mail, view agent, space people, item data, change settings, access the ISNA homepage (which details key ISNA/game information, holds news, holds a bulletin board) and communicate with others players. The Space-Net's AI, a silver oval character with eyes, three 'feet', and a single hair on its head welcomes the new agent and tells them how to use the Space-Net. It also lets the player know when he/she has new mail. The player travels throughout various planets of the Rainbow System resolving conflicts. The planets are explored in a birds-eye view overworld. The player can often choose to ride the \"turbo\" (Japanese: ターボ) vehicle to travel more quickly, but not in certain places like in houses and the player does not have the choice to ride it at will at the beginning of the game. The turbo vehicle must be used in certain areas, even before the player gets the choice to ride it at will. Like many role-playing games, the player battles enemies through random encounters and encounters part of the story. The player can choose to recruit enemies in battle by showing them his/her Correspondence Badge (Japanese: つうしんバッジ). After showing the badge, they have a chance of wanting to join (after which the player must name them if they decide to recruit them), a chance of attacking, or running away. The badge is only used up if the monster decides to join the party. The player can battle in a 3 vs 3 battle system, formed of the player and recruits. The \"Attack\" option allows a party member to attack using up to four known attacks with a point system. If there are no points left for an attack, the player can still select it but they will attack by \"jumping\" on the enemy instead. A team member or enemy also has a chance of dodging the attack. Items can be used in battle such as items that attack the foe as well. Party members and enemies can change forms, for example, the main protagonist can temporarily switch to \"Buster Mode\" to wear a glove that allows the main protagonist to deal more damage. This mechanic is known as a \"Mode Change\". The player can switch to another party member with Select and view the status of a character with Start. The player can also choose to escape from battle.", "platform": "Nintendo Game Boy Color", "release_date": "March 16, 2001", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Imagineer", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129215-space-net-cosmo-blue\n"}