{"altername_name": [], "name": "Super Mario Special 3", "overview": "Super Mario Special 3 is a Game Boy Color port of Super Mario Bros. 3, made in 2000 by Makon Soft. Super Mario Special 3 features the standard Mario gameplay such as coin boxes, Mushrooms, and the Super Leaf that turns you into Raccoon Mario. However, Raccoon Mario lacks most of its abilities from the original game as you can't fly or use the tail attack move. The only extra move that Raccoon Mario can perform is gliding in the mid-air by tapping B button rather than A button. Like the international version of the NES original, the Raccoon Mario power-up gives the player an extra hit. Like other Makon games such as Sonic 3D Blast 5 and Pokémon Adventure this game has five stages. Each level is completed by hitting a block at the end and collecting the Mushroom coming out of it (except for the fourth world, whose \"end block\" doesn't work). Beating the fifth \"Fortress\" level will activate the ending sequence, which shows a picture of two large sized flying Raccoon Marios with the words \"THE END\" accompanying it. The overworld map is available, but there are no bonus games, nor can Mario interact with the Hammer Bro on the map. The player can also move freely on it in a similar way to Super Mario Bros. Deluxe, as Mario doesn't move around the map directly (unlike in the original Super Mario Bros. 3), but rather transports immediately to the selected spot. This was probably done intentionally, as sometimes, a raccoon leaf will appear in the box rather than a mushroom, leaving the player trapped, making the level impossible to beat. The levels follow the pattern of the original Super Mario Bros. 3, but only the first five levels are included. The levels themselves are remade from the original game, with the stages made about twice as long with an extra section added at the end.", "platform": "Nintendo Game Boy Color", "release_date": "2000", "game_type": "Unlicensed", "esrb": "", "developers": "Makon Soft", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133086-super-mario-special-3\n"}