{"altername_name": ["The Tower of Evil"], "name": "Tower of Evil", "overview": "Tower of Evil is a homebrew conversion of an old Commodore 16/Plus4 shooter game of the same name (the game was also released for the C64, however this is based on the Plus4 version which has some differences from the C64 version). The C16/Plus4 version was released in 1985 by Creative Sparks and coded by Martin C. Sexton. This port was developed by Rajcsányi László (also known as WLS) and published on his itch.io page sometime in 2022. Game description: Many years ago, our hero Andros was banished from the court of King Salimos, destined never to return until he could recapture the king's lost treasure and the beautiful princess Diana stolen by a wicked Necromancer and his minions. Andros has one powerful aid given to him by an old friend -the court wizard, the power to hurt fireballs from his fingertips. Our hero has journeyed to the Tower of Evil, home of the Necromancer. He will have to move from room to room, killing the evil minions as he goes. Andros will need to collect the treasure and find the key to the gate enabling him to travel to the next level; a drink from the goblet will grant him invincibility or double his strength for a short while. Andros must deposit his treasures in the chest which will be found on level 7, and rescue the imprisoned princess. You will need to defeat such nashes as Ashtoroths, Warriors of Ayperos and Baphornets and many others while trying to find your way around the maze-liked Tower of Evil. With over 60 rooms to be explored, this game is not for the faint-hearted.", "platform": "Nintendo Game Boy Color", "release_date": "2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Rajcsányi László", "publishers": "", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163668-tower-of-evil\n"}