{"altername_name": [], "name": "Zoids: Jashin Fukkatsu! Genobreaker Hen", "overview": "Jashin Fukkatsu is a Game Boy and Game Boy Color game. The game's first two production runs were released with a limited edition Command Wolf model kit: red Imperial colors for the first run, and midnight blue and black for the second. The story is said to be set between the Zoids: Chaotic Century and Zoids: Guardian Force anime series, and involves characters from that era. Beyond that, it seems to ignore the anime continuity. Van and Fiona are attacked by a wild Hellrunner in the grass outside his village, and discover that it was being driven mad by Rare Hertz. Not only was it affecting the Hellrunner, places all over the Western Continent are suddenly awash in it, and Zoids are going berserk. Teaming up with Irvine, Moonbay, and others along the way, Van and Fiona have to find their way through a number of caves and towers to stop the Zoids broadcasting the signals. They finally catch up with the man responsible, Professor Io, a scientist who was experimenting with \"Zoid genetics\". After breaking into his lair with a Madthunder (the only way to get past his Death Saurer), they confront him and his Geno Breaker. They soon discover that it wasn't the real threat, however, when Io reveals a Zoid contained in a giant pod while telling them about his son who was killed in the war. He integrated his son's genes in this Zoid: the Gilvader. When the Gilvader is defeated, Io remains behind in his collapsing base, presumably to die. The player can then go back and finish clearing all the levels of the caves of Rare Hertz, catch Zoids, and train them in a vaguely Pokémon style. The end Gilvader is also there to fight again despite it having been destroyed, but the Geno Breaker does not return. The game is notable for containing every original Japanese release Zoid (other than Transfighters and 1/24 scale), as well as many customs from old boxes, early Zoids from the new line, and a few customs from a contest.", "platform": "Nintendo Game Boy Color", "release_date": "August 4, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Will", "publishers": "Tomy", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=J9QRoCV9OgM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117193-zoids-jashin-fukkatsu-genobreaker-hen\n"}