{"altername_name": [], "name": "Bank Heist", "overview": "You are a bank robber, driving around a maze of streets (representing the city) in a 1930's style car. Your purpose is clear: perform \"bank heists\" by driving across white-pillared symbols that represent banks. As you \"rob\" each of the banks, they disappear, and a police car appears in its place, beginning hot pursuit after a few moments. You must avoid the cops to stay alive. Fortunately you are not completely defenseless, as you have a stock of dynamite, which you can strategically drop to destroy the cop cars. Besides the escape tunnel that will take you from one side of the screen to another (as in Pac-Man), there is an additional tunnel that represents the road out of town. By taking it, you will find yourself in the next city. Each city is increasingly difficult, and the cop cars are faster and smarter. There are 9 banks in each town, and you receive an increase in gasoline each time you rob one. Therefore, the goal of the game is to drive from town to town, navigating the mazes of streets, and robbing as many of the banks in each town as you are able to. This keeps your gas supply high, and the money rolling in! If you run out of gas, the game is over. Other versions with the same title: 20th Century Fox / Fox Video Games Atrevision CCE (Illustrated) CCE Digimax Dynacom (Brazil) Electronic Games Funvision / Fund. International Co. (V-Case) Funvision / Fund. International Co. (Halley`s Comet) JVP Play Video Robby Shock Vision Show Game / Camping Tur Ltda. Taiwan - V-Case Disney Tiger Vision / Eram VGS (Gray) Wingames / DataVision Software Other versions with a different title: Assalto ao Banco Bank Maze Bankheist Benk Heasst Fancy Car Robo al Banco", "platform": "Atari 2600", "release_date": "January 1, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Bill Aspromonte", "publishers": "CCE", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.73", "wikipedia": "https://en.wikipedia.org/wiki/Bank_Heist_(Atari_2600)", "video_link": "https://www.youtube.com/watch?v=u1PEtshdOsA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/16963\n"}