{"altername_name": [], "name": "Cabbage Patch Kids: Adventures in the Park", "overview": "Ahh Cabbage Patch Kids. Who could forget those chubby little dolls that started fist fights between middle aged housewives in toy stores? For some reason every kid had to have one of these creepy little kewpie dolls back in the 80's, although the fad eventually faded. Since Cabbage Patch Kids just happened to be manufactured by Coleco, it was only natural that they would create a video game tie in. While the Colecovision version of Cabbage Patch Kids was released to much success, the Atari 2600 version never materialized. If you're scratching your head as to how someone could create a game based on a line of dolls, you're not alone. Dolls don't exactly inspire video games. However Coleco got around this by taking an existing game for the MSX line of computers called Athletic Land and adding the Cabbage Patch Kids into the game. Since the MSX computer was never released in the US, people were none the wiser. This is also why a game that was supposedly aimed at children seems so damn hard. Cabbage Patch Kids: Adventures in the Park (which will be henceforth referred to as CPK) is a side scrolling action game. According to the Colecovision version's manual, Anna Lee has decided to go out for some exercise in the local park and is soon caught up in a wild adventure (hence the subtitle Adventures in the Park). The game is separated into several different screens (referred to in the game as scenes), each with a different obstacle for your kid to overcome. Obstacles include bouncing balls, water filled pits, floating platforms, bees, and even fires. Each level consists of ten scenes which must all be overcome before the time limit runs out. Along the way Anna may also collect various objects hidden in the trees (using well placed trampolines) for points, but these objects are not necessary to win. CPK was known to exist for some time thanks to an interview conducted with another former Coleco programmer Ed English several years ago. Ed was thought to be in possession of the only known prototype, but he would not release it for unknown reasons. However in 2008 several Coleco EPROMs were found in a flea market, several of which contained various versions of CPK. These EPROMs were released to the public shortly afterwards. While it may not be able to compare graphically to the Colecovision version, the Atari 2600 version of CPK is an amazing feat of programming. Not only was all the gameplay retained in this conversion, but it even included a cute little background tune which was a rarity in 2600 games. It appears that CPK was simply a victim of the collapsing game market, and by the time the final version was ready in September of 1984, Coleco had stopped its 2600 operations.", "platform": "Atari 2600", "release_date": "1984", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Ed Temple", "publishers": "Unreleased Prototype", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.58", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=1v1GhGQnQOo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/59840\n"}