{"altername_name": [], "name": "Cave In", "overview": "The objective of Cave In is to find the three pieces of a crown somewhere within the maze of caverns. Your Indiana Jones-like avatar searches through many brick-lined rooms looking for three keys that will open up the locked rooms. There is an enemy (scorpion, hawk, wolf, etc,) to be dealt with in almost every room, and they can drain your strength if you come into contact with them. There are three difficulty settings: normal, intermediate and fast. Only the first version starts you off with a revolver to defend yourself and has static key locations. I was able to find the three keys in the normal version, but still was only able to open two doors. Once you open a door and kill the enemy in these rooms, it triggers a booby trap of falling bricks that must be avoided. The crown pieces are guarded by a boss figure. It doesn’t appear that the rooms have to be done in any specific order, so I am stumped as to what it takes. I have not gotten very far in the harder versions. I got caught up in trying to solve the normal version. Among the many graphic features: a transport room, medicine packs for slight replenishment, a sinkhole for fully restoring health, a shield for some protection, lava rooms with walls that are harmful, a dark maze that is visible only by torchlight, a rail car that you can ride across a room (if you avoid the falling rocks), and a rolling boulder. I was able to get in and out of the dark room from the top, but I never found another exit. Somehow (at least I think so), I found an additional room and also a way into the dark room from the bottom. There is also another hidden room that can be found by falling through a hole that must have some significance. The graphics are quite nice and extensive for the system and all walls shake when you touch them for a little drama. The sound is OK. The challenge involved in trying to solve the game is addictive and makes for good replay value. Cave In is a 32K cartridge. It is AtariAge’s first Atari 2600 homebrew that they have published with additional on­board RAM, doubling the amount of RAM available to the game! This memory in Cave In uses the same SARA \"SuperChip\" technology Atari developed for some of their more advanced games, including Crystal Castles, Jr. Pac-Man, and Stargate. The programmer, Steve Engelhardt, utilized the programming language Batari BASIC (and some assembly language routines) to create the game.", "platform": "Atari 2600", "release_date": "2010", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Steve Engelhardt", "publishers": "AtariAge", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=6nl4YESHFSA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/59841\n"}