{"altername_name": [], "name": "Chunkout 2600", "overview": "In Chunkout, you take on the dangerous role of Commander Brock Starblaze as he attacks the defenses of the legendary Xotec homeworld. Using your precision Atari Joystick, you will help him guide the CX-40 Voidstar's Photon Laser Device to take apart the Xotec Pulsar fields particle by particle. It won't be easy. The Pulsar fields get harder the farther in you go. Your Z2PA Advanced Calculation Computer will show you a view of the Pulsar field at the atomic level. Each block is a single particle in the overall field. Particles come in several colors, and these tend to be grouped into larger groups of the same color, due to the subatomic structure of the Xotec fields. The Scientific types are calling them 'Microconglomerate Quantum Phase Packets', but our R&D boys just call them 'chunks'. Each chunk of the Pulsar Field can be burned away with a nanosecond pulse of the Voidstar's Photon Laser. One pulse destroys all connecting particles of the same color. As you burn away chunks of the field, the other particles will rearrange themselves. Particles of similar color will form larger chunks, and that is the key to success. Skillful use of the Photon Laser will allow you to combine, and then eliminate all of the particles in the current Pulsar Field, and then it's further down into the Xotec defenses as you systematically burrow through the Pulsar Fields. Reach the homeworld, and the war is over. The further in you go, the tougher things get. The inner defenses of the Xotec homeworld are very tricky. Scans show that the particle distribution becomes very difficult, and the chunks get continually smaller, forcing you to use all of your abilities to combine them in to big enough chunks. No one ever said this would be a cake walk.", "platform": "Atari 2600", "release_date": "2009", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "James Todd", "publishers": "AtariAge", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124405\n"}