{"altername_name": ["Tank-Plus", "Combat ~ Tank-Plus", "Tank-Plus", "Combat: Tank-Plus", "Frontline"], "name": "Combat", "overview": "Combat is an early video game by Atari for the Atari 2600. It was released as one of the nine launch titles for the system in October 1977, and was included in the box with the system from its introduction until 1982. Combat is a two-player game where the players attempt to shoot each other's tanks or planes. Hitting the enemy vehicle pushes it back and gives the player one point. The game contains 27 levels, each of which has different rules and playing field layout. On the tank levels, the players have a selection of two different mazes or no walls at all, while on the plane levels, the players can choose to play with clouds that obscure part of the screen. The Atari 2600 difficulty settings can be used to change the range of a player's missiles, as well as the speed of one's airplanes in levels 15-27. All games have a time limit of 136 seconds. The levels include: 1-5: Tank levels. Levels 3 and 5 are \"straight missile\" levels where the players' projectiles simply fly forward. On the \"guided missile\" levels (1, 2, 4) the projectiles can be controlled with a joystick after firing. 6-9: \"Tank-pong\" levels, where the players' missiles bounce off walls. In the \"billiard hit\" levels (8 and 9), there's an additional rule that a missile must bounce at least once before it can hit the enemy tank. 10 and 11: Invisible tank levels, where the tanks only become briefly visible when they shoot, bump into a wall, or are hit by a missile. Both of these give the players guided missiles. 12-14: Invisible \"tank-pong\" levels. Levels 13 and 14 use the \"billiard hit\" rule. 15-20: Biplane levels, where the players fly planes that are constantly moving forward and wrap around to the other side when they fly off the screen. Levels 15 and 19 use guided missiles; 16 and 20 use straight missiles; on 17 and 18 the players use rapid-fire machine guns. Additionally level 19 is a \"2 vs. 2\" level - both players have two planes each that move and shoot together - and level 20 is \"1 vs. 3\", where one player has three planes while the other has a single large plane. 21-27: Jet fighter levels. The jet planes move faster than biplanes, but other than that gameplay remains similar. 22, 24 and 27 are straight missile levels, the rest are guided missile levels. Additionally 25 and 27 are \"2 vs. 2\" levels, while 26 is a \"1 vs. 3\" level. One of the very few Atari 2600 games actually programmed to be in stereo (which can only be experienced with a modified system).", "platform": "Atari 2600", "release_date": "September 11, 1977", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari", "publishers": "Atari", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.81", "wikipedia": "https://en.wikipedia.org/wiki/Combat_(1977_video_game)", "video_link": "http://www.youtube.com/watch?v=9E8xnaWm2Cg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4635\n"}