{"altername_name": [], "name": "Epic Adventure", "overview": "After many years of peace, the nightmares recapture your mind. Vivid visions of death and chaos across the realm soon haunt your waking thoughts. You start to wonder if the crafting of evil is at work. Rumors of beast sightings have begun to weave their way in from the villages. Villagers say that Orcs, Trolls, and a frightful winged creature have overrun the outlying regions, and that an \"allseeing eye\" controls these fiends. Many have been sent to investigate these rumors, but none have returned. It's been many months since the Chalice disappeared-though only taken by common thieves, there is but one \"thief\" who could harness the power of the Chalice and cause this much death and destruction-the Evil Magician! In a moment of clarity, you know what you must do. You go to gather up what few items you need to aid you in your perilous journey, but you quickly realize that they have all gone missing! Stepping outside the castle gate, a familiar feeling comes over you-you are very much alone... As in your previous adventures, your mission is to recapture the Golden Chalice and return it to your castle gate. Your quest will once again be an arduous one, as the Chalice is now protected by Orcs, a Cave Troll, and a Winged Dragon. If you manage to best these creatures, you'll have to seize the Chalice from the Evil Magician himself. But before you can actually see the Chalice, you must first snuff out the shadowing magic of the Dragon, as the Chalice will only appear once the Dragon has been slayed. The Chalice is rumored to be hidden in one of three places - the Evil Magician's Castle, the Dragon's Castle, or the Troll's Cave. You have many items to help you on your quest - unfortunately these too have been stolen and hidden throughout the kingdom.", "platform": "Atari 2600", "release_date": "2012", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Todd Holcomb", "publishers": "AtariAge", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Vt8XU_N77Xw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154435\n"}