{"altername_name": [], "name": "Evil Magician Returns II", "overview": "The Adventure Continues! On your first Adventure, you slayed the Evil Magician's three dragons and rescued the Enchanted Chalice, bringing peace to your Kingdom. Enraged, the Evil Magician has reclaimed the chalice and vowed to avenge the loss of his beloved dragons. Joining the pursuit is his vile apprentice, and it’s also rumored that he has created an even more hideous creature to guard the chalice this time around. As in your last Adventure, the object of the game is to recapture the Enchanted Chalice and return it to the Gold Castle walls. Once again, this will not be an easy quest. The Evil Magician (red wizard) and his apprentice (grey wizard) can cast spells that weaken and slow you. Their touch is deadly, but all hope is not lost. They are vulnerable to attack by the Fire Staff— swords will not help you in this Adventure. The Evil Magician will succumb to two hits from the staff and his apprentice needs only one well-placed fireball. They may not stay deceased for long however— the wizards can use their resurrection spells to revive each other. There are four castles in your Kingdom: the Gold Castle, the White Castle, the Red Castle, and the Grey Castle. Your home castle, the Gold Castle, is already open, but the other castles need to be opened with the proper Key. Inside the castles are multiple rooms, some of which are dark and can only be explored by torchlight. The castles are separated by the familiar labyrinths, but the Evil Magician has made sure that your old pathways will just lead to dead-ends. Scattered throughout the kingdom are certain items to help you in your search for the Enchanted Chalice. To pick up an item, simply touch it, but remember that you can only carry one item at a time. To open any castle, touch the castle gate while in possession of the proper key. The white castle key will open up the White Castle, the red dragon key will open up the Red Castle, and the grey skull key will open up the Grey Castle. Along your journeys you will find various items to assist in your quest (such as various keys, the Fire Staff and Enchanted Chalice), as well as enemies who will attempt to thwart your quest (the Bat, Apprentice, Evil Magician and Chalice Guardian). Good luck!", "platform": "Atari 2600", "release_date": "", "game_type": "Homebrew", "esrb": "", "developers": "Todd Holcomb", "publishers": "AtariAge", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124418\n"}