{"altername_name": [], "name": "Halo 2600", "overview": "The year is 2552. Planet Earth still exists, but overpopulation has forced many of her former residents to colonize other worlds. After contact with an outer colony was lost, a battlegroup was sent to investigate and was almost completely destroyed; only one badly damaged ship returned to tell of a seemingly unstoppable alien warship that had effortlessly annihilated their forces. This was humankind's first encounter with a group of aliens they eventually came to know as the Covenant, a collective of alien races bent on wiping out humanity. A desperate plan is set in motion: board a Covenant vessel and learn the location of the Covenant home world. But before the mission begins, Covenant forces strike and annihilate the attack force. The Covenant are now on Earth's doorstep. One ship escapes and makes a blind jump into deep space, hoping to lead the Covenant away from Earth. The ship crashes on Halo--an artificial ring world that is actually a weapon capable of destroying all life in the galaxy should it fall into the hands of the Covenant. You are the Master Chief--all that remains of a classified military project to build a series of genetically enhanced super- soldiers. You are humanity's last and best hope against the Covenant--but you're woefully out-matched, and survival is not guaranteed. Can you battle your way through the massive world that is Halo, defeat the Covenant, and save humanity? Halo 2600 is an original homebrew game created by Ed Fries for the Atari 2600. Ed Fries once worked as the VP of Game Publishing for Microsoft's Xbox division and was instrumental in bringing Bungie Studios into the Microsoft studio family). AtariAge worked with Ed Fries to produce Halo 2600 in physical cartridge form, and a limited run was produced for the 2010 Classic Gaming Expo. After the Classic Gaming Expo, additional cartridges were produced using a different label to differentiate the two releases. In the game, Halo players control Master Chief in a non-scrolling exploration game with rooms to explore and a variety of enemies to shoot. The Chief faces a variety of enemies across 64 playfields, and must find hidden keys to unlock the game's force-fields in order to reach the final boss encounter. But first, he needs a weapon...", "platform": "Atari 2600", "release_date": "July 31, 2010", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Ed Fries", "publishers": "AtariAge", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.36", "wikipedia": "https://en.wikipedia.org/wiki/Halo_2600", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24276\n"}