{"altername_name": [], "name": "I Want My Mommy", "overview": "Poor Teddy the bear. He's just had a bad dream and wants a hug from his mommy. Help Teddy climb the mountain to reach his mommy. In I Want My Mommy, the player must guide little Teddy up two mountains. The first has an apple on top and the second has his mommy waiting to give him a hug. To progress up the mountain the player must stand on a raised block and press the button to raise a magical stardust ladder which can be climbed to reach a higher level. If needed, the player can also climb down. To reach the top level, the player must have all ladders raised or they will be blocked. On levels two through five, there is a dream demon waiting to knock Teddy down the mountain. Teddy cannot jump, however; all the player can do is avoid the dream demons or catch mommy's special kiss as it floats along. This will allow the player to knock out one demon. The kiss eventually wears off, however. If the player is knocked off the mountain, they start back at the bottom of the first screen, with the apple at the top. The score counter starts at zero and counts up. The faster the player gets Teddy to mommy, the lower your score. The goal is to have as low a score as possible. Other versions with a different title: Sesam öffne dich! [Bit Corporation] Open Sesame [CCE] Open, Sesame! - Abre-te, Sesamo! [CCE] Apriti, Sesamo [Fujistyle (Bit Corporation)] Open Sesame [Goliath] Teddy Apple [Home Vision] Open Sesame [Puzzy (Bit Corporation)] Open Sesame [Taiwan - Cooper Black] Sesam öffne Dich [Hertie] Open Sesame [Unknown - 4er blue Frame] Open Sesame [Unknown - big Frame] Sesam öffne dich! [Quelle (Bit Corporation)] Apples and Dolls [Polyvox] Teddy Perdido [Star Game] Apples and Dolls [Tron]", "platform": "Atari 2600", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "KidStuff", "publishers": "Zimag", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/I_Want_My_Mommy", "video_link": "https://www.youtube.com/watch?v=G_m1Yr411P0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/21524\n"}