{"altername_name": [], "name": "Kabobber", "overview": "The basic gameplay of Kabobber is very simple; you must hop on the enemy before he hops on you. To help you gang up on the enemy you are given command of an army of Buvskies. Your Buvskies troops appear in each of the squares immediately surrounding your character. When first summoned your Buvskies are only babies who must first conquer an enemy Kabobber to be promoted to full strength. Baby Buvskies can only conquer the green Guvskies and are crushed by all other enemies, so you must protect them until they reach full strength. You are given a limited number of baby Buvskies (displayed at the bottom of the screen), although you can gain extra Buvskies by conquering enemy troops (you are limited to nine reserve Buvskies). Your army moves with you in a square formation, so the more troops you have on the screen the bigger the target you are. However the more troops you have the more enemies you can crush, and you'll have a less chance of being totally annihilated by a rampaging enemy mob. Kabobber was never advertised or mentioned in any Activision catalog. No instruction manual was ever made for it and the game was never released. Only one prototype is known to exist, assumably from programmer Rex Bradford himself. According to Bradford: 'What happened was that I \"finished\" the game in the standard 4K cartridge size, then Activision said they liked the game and would like me to expand it to an 8K cartridge and keep working on it. I had basically run out of ideas for the game at that point, and resisted. Anyway, I didn't feel like working on it more, and Activision didn't want to publish it as is (and was probably a little miffed at my attitude, though they never said so), and that was that.'", "platform": "Atari 2600", "release_date": "1983", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Rex Bradford", "publishers": "Activision", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "1.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=8qK2HzOO7uU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/56314\n"}