{"altername_name": [], "name": "Morse Code Tutor", "overview": "It’s well known that Atari wasn’t afraid to take risks when it came to developing new games. Some ideas were just too far out there to be marketable (such as Mindlink and Mind Maze), while others were just to niche to sell well enough (such as Mark of the Mole). Morse Code Tutor falls squarely into the latter category. Although I’m sure that there were indeed Morse Code enthusiasts who owned Atari 2600’s, they probably didn’t make up a large enough group to bother with. Little is known about the origins of this prototype or if Morse Code Tutor is even its real name. Found in a box of miscellaneous items from a former programmer, Morse Code Tutor is just what it sounds like: a program for helping the user learn to send and receive messages in Morse Code. It’s hard to believe that there would have been any market for something like this, but a similar program was released for the Videopac (Odyssey^2) system in Europe so there is some precedence. From the main screen you can select the Word Speed (5-72), Character Speed (5-72), and Pitch. Word Speed affects how fast the words you need to send appear, while Character Speed affects how fast the individual characters in the words appear. Pitch allows you to change the tone of the ‘beep’ that occurs each time you tap out a character. Pressing the button on the screen will produce a tone so you can test out your pitch level. After you’ve selected your options the only way to move on with the game is to move the left difficulty switch to the B position. This will produce a screen with some letters on it for you to try and signal. Moving the switch back to A will bring you back to the options screen. Pressing the reset button when on the Letters Screen will produce different combinations of letters, numbers, and eventually punctuation. The order is: 5 screens of letters (always in the same order), the entire alphabet, 3 screens of numbers (1-5, 6-0, then all the numbers), the entire alphabet with all the numbers, 3 screens of punctuation characters, then a screen with all the letters, numbers, and punctuation. This final screen is a bit different as it has a flashing cursor thst you can move and make letters disappear and reappear by pressing the button, but the use of this is unknown. After this screen pressing reset once more will bring up the word SEND, after that it will repeat back to the screens of letters. The prototype itself doesn’t seem to be complete, so there may be more functionality hidden in the code. Due to the small rom size (only 2K) and bare bones nature of the program, this would have been a very early release (1980 or earlier). It’s unknown if Atari was really planning on releasing Morse Code Tutor or if this was simply a toy created by a programmer playing around in his spare time. Either way Morse Code Tutor is one of the more unique programs in the 2600 library.", "platform": "Atari 2600", "release_date": "1979", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Atari", "publishers": "", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116895\n"}