{"altername_name": [], "name": "Off Your Rocker", "overview": "Off Your Rocker is a simple game for one to four players. And it's a lot of fun. The objective is to repeat the color and sound patterns - using Joyboard or Joystick - that Rockin' Rollie creates on the screen. Off Your Rocker can also be played using a Joystick instead of the Joyboard. Use the Game Select level to choose the number of players (number will appear in upper left-hand score box.) Pressing the Joystick's \"fire\" button will tell Rockin' Rollie that you're ready to play. When he presents a pattern, you can take as long as you like to study it and make your first move. But once you have started, you only have five seconds between each following move. There are two ways to play: 1. When the Left Difficulty Switch is in the A/Novice position, each player remains on The Joyboard or uses the Joystick until they fail to complete the pattern (at which point Rockin' Rollie will get a little on-screen surprise). The score is noted and the next player can take a turn on The Joyboard or the Joystick and a completely new pattern will begin. 2. When the Left Difficulty Switch is in the B/Expert position, Off Your Rocker is played as a round-robin game. The first player gets on The Joyboard or uses the Joystick and repeats the pattern. The next player then takes their turn. Any player who is unsuccessful will be removed from the rotation. The score will flash to indicate whose turn it is. The Right Difficulty Switch does not affect game play. In either mode, after the 7th round, the patterns will get faster. Rockin' Rollie's pattern sequenced can be up to 99 color changes in length. If you somehow manage to complete the entire sequence of 99 (or get even close to it), you will probably have worked up quite a sweat. You might want to consider a shower before you start bragging about how well you've done. Before leaving the VCS arena, Amiga had sent its second game Off Your Rocker off to a company to have labels applied. Unfortunately, since Amiga had pulled the plug on its 2600 division, they didn't have the money to pay for labels, so the carts were kept by the label company. Years later the company sold the cartridges off as scrap to a company in Ohio called Pleasant Valley Video who slapped on a homemade, handwritten label and sold them to the 2600 community.", "platform": "Atari 2600", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Amiga Corporation", "publishers": "Amiga Corporation", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5tn-SKqeP5k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78401\n"}