{"altername_name": [], "name": "ORB", "overview": "ORB The planet Orb can be a dangerous place full of mystery. The Alliance has lost many ships while trying to explore the planet. Too many to count. It will be your mission to rescue downed pilots and return them to the Mothership. Get to know your ship: At the start of the game your ship will appear in a safe area of the planet. Your ship is only large enough to hold three pilots. You only have one ship complete your mission. Your ship has a strong shield that can sustain 8 hits before it will be destroyed. The shield is indicated by the bar on the bottom right of the screen. Most enemies will take one shield unit away as you are hit. The exception is the Orb with will take two shield points away. Your ship is equiped with \"lazor cannons\" They can shoot left and right. Terrain hits WILL (in latest release) damage your ships shield units. The Mothership: After you have saved three pilots the mothership will descend on the safe landing area. Because of expensive fuel used by the mothership it will not descend unless you have three pilots aboard your ship ready for rescue. Your ship must dock with the mothership to transfer the rescued pilots. At that time all of your ships shield power will be restored full. You will also get 100 points for any remaining shield units. You will get 1000 points for each pilot returned to the mothership. Enemies: The Orb - The orb will be aggresive and try to ram your ship. If hit you will lose two shield points and one rescued pilot will be removed from your ship. Destroy the Orb as soon as possible. Meteors - Meteors can not be shot and must be avoided. If they hit your ship you will lose 1 shield unit. Falling Craft - The purpose of these has not been discovered. They can not be destroyed by your cannons and must be avoided. Planet Patrol - Look to defend the planet. These enemies can be shot. One of these, if hit will drop a shield unit. Collect it to gain one shield unit. Other items of interest: There are places where you can descend deeper into the planet. As the game progresses you must go down in order to rescue pilots as they will no longer appear on the top levels. Pilots appear on the surface based upon the level of the game, which is based upon how many pilots you have rescued.. They appear as follows: 0-9 pilots rescued - appear on surface 1 12-18 pilots rescued - appear on surface 2 (none will appear on surface 1 at this point) Up to 27 pilots rescued - appear on surface 3 (none will appear on surface 1 or 2 at this point) Control: At the title screen press the fire button to start. The fire button also starts a new game at the game over screen. Joystick controls the ship in eight directions. Joystick left or right plus the fire button fires your lazor cannons. Only rescued pilots and shield units remaining will provide points. One special ship will, at times drop a shield unit when destroyed.", "platform": "Atari 2600", "release_date": "September 9, 2015", "game_type": "", "esrb": "E - Everyone", "developers": "Winkdot", "publishers": "Winkdot", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31188\n"}