{"altername_name": [], "name": "Oystron", "overview": "Oystron is an action game developed for the Atari 2600 by Piero Cavina and released in 1997. It is one of the earliest hobbyist-written games for the console. The game, Cavina's first, was initially made available as a freeware 4 KB binary file designed for use on the Starpath Supercharger and with Atari 2600 emulators. It was later released in cartridge form by XYPE, a group of Atari 2600 homebrew developers. Oystron is an action game in which the player controls a ship using the joystick controller, firing at enemies and collecting pearls dropped by \"space oysters\". The player's ship initially appears on the left side of the screen, and enemies attack from the right. Shooting the space oysters reveals a pearl; the player then collides with the pearl and brings it to the \"pearl zone\" on the left side of the screen. Other enemies appear that attempt to steal the pearls. Collecting eight pearls earns the player a bomb. At the end of each level, a boss named \"Oystron\" appears; the player can defeat the Oystron by placing a bomb in its path, or waiting until it changes into a space oyster. Following the appearance of the Oystron is a warp phase, in which the player travels at high speed and must avoid colliding with enemies. The player is given four ships at the beginning of a game, and earns an additional ship every 4000 points. In 2003, Oystron was one of several Atari 2600 homebrew titles selected by Activision for inclusion in the Game Boy Advance version of their Activision Anthology. In 2005, it was named one of the five \"Best 2600 Homebrew Games\" in the book Gaming Hacks: 100 Industrial-Strength Tips & Tools by Simon Carless, who praised the game's fast pace, sprites and color scheme.", "platform": "Atari 2600", "release_date": "1997", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Piero Cavina", "publishers": "XYPE", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Oystron", "video_link": "https://www.youtube.com/watch?v=1o9xSZK29Eo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114711\n"}