{"altername_name": [], "name": "Racer", "overview": "If you're scratching your head right now and saying to yourself \"Racer? Never heard of it.\", then you're not alone. Racer was an original game developed by Roklan for Atari (their first actually), and not based on any existing arcade game. Now if you're saying to yourself \"Roklan? Never heard of them.\", then you just need to play some more Atari 8-bit games. Roklan was a major 3rd party developer of games back in the 80's, making games for the Atari 2600, 5200/8-bit, C-64, Vic-20, CoCo, and even the TI-99/4a. However Roklan generally did not publish games under their own name, so most never knew they existed. However for some strange reason, they did publish their 8-bit titles under the Roklan name, which is where most people will recognize the name from (that and from their famous fading labels). Getting back to the 2600, Roklan developed at least four games for the Atari 2600 but two were never published. You've probably played Crazy Climber and Gorf, and maybe you've played the unreleased RealSports Basketball, but there was a fourth title that people didn't know existed until now. Racer was Roklan's first title for the Atari 2600, and as such, is a rather simple game. The player controls an strangely phallic shaped car which they must maneuver around the screen and avoid crashing into the walls. The screen scrolls downward, so you are constantly moving forward. As such there is no gas button, nor is there a brake button. All you can do as hang on and dodge those walls! At the start of the game, the walls move rather slowly. In fact it is almost impossible to crash into a wall unless you're trying to do it on purpose. However about every 30 seconds the game will speed up, and the walls will come faster and faster until they become unavoidable to anyone who isn't a Jedi. This usually happens around the fifth speed up. Each player starts with three lives, with extra lives being awarded every 30 points. There are ten different game variations, each one changing the number of players and the speed at which the game starts. The last two variations are a sort of 'Children's Mode' where the game starts at the slowest speed and never speeds up. Although the one player version of Racer is rather ho-hum, the game really shines in the two player modes. Unlike most Atari 2600 games, Racer offers two player simultaneous play. In the two player variations you and a friend square off against one another in an attempt to get the highest score. Each player can stay on their side of the screen and try to beat the other player purely based on skill, but why would you want to do that? The best part of Racer is that you can bang and crash into the other player, forcing them into the oncoming walls. Of course the other player can do the exact same thing back to you, so be careful. Careful strategy is needed when deciding what the right time is to ram you car into the other player. While Racer is an alright game, it lacks long term playability. The one player game is too simple and ends too quickly, and the two player game isn't much more interesting. It was probably for this reason that Atari declined to pick up Racer, and Roklan didn't try and put it out themselves. Racer has potential, but it needs more variation to make it interesting (different wall layouts, an enemy car , power ups, etc.). Still, Racer is a rare and interesting glimpse into the secret lives of third party developers.", "platform": "Atari 2600", "release_date": "1982", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Joe Gaucher", "publishers": "", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117037\n"}