{"altername_name": [], "name": "Raiders of the Lost Ark", "overview": "Raiders of the Lost Ark is an adventure game which is loosely based on the movie of the same name. In the game you control Indiana Jones on his quest to find the Lost Ark of the Covenant. The ark is hidden somewhere in the valley of poison. Your mission begins in the Egyptian city of Cairo; next you must find your way to the Temple of the Ancients where there is a secret map room. In the map room you will find a hieroglyphic indicating an object you must have to unlock the secrets of the map room; when unlocked, you will be able to find where in the Mesa Field the entrance to the Well of Souls is located. If you can find your way safely across the Mesa tops into the Well of Souls, you will locate the ark and win the game! The game uses two joysticks for control; one joystick moves Indy around the screen and uses a selected object, the second joystick allows you to select and/or drop objects from your inventory. On the many different locations of your journey you will come across different objects (some hidden) which can be collected to help you out. You may find weapons (like a whip or gun) for defense, or objects (such as a key or money) which can be used to unlock new areas or receive help. You begin the game with three lives, and the game ends when all lives are lost. There are plenty of enemies to hinder your progress, and of course numerous snakes! The manual mentions the appearance of a 'special signature' on the final screen if your score is high enough (although this isn’t entirely true). On the final screen showing the Ark, the initials HSW2 (for Howard Scott Warshaw – the 2 denotes this is his second game) appear in your inventory. A screenshot of Jerome M. Domurat's initials in the 'Valley of Poison' appeared in several publications. For reasons unknown, this graphic was removed in the released version. Also, a second key exists in the program which cannot be found in the game. It seems the key was originally going to appear on the 'Entrance Room' (see the screenshots in the b&w ad below), but due to the way the kernel displays objects, it couldn’t be used. The manual also states the possibility of an extra-terrestrial Yar near the 'Flying Saucer Mesa'. This is true and here’s how to find it: go to the 'Flying Saucer Mesa' with the Chai and a parachute. Walk off the bottom of the mesa and drop the Chai when you start falling. The Yar will appear above you at the top of the screen. Uncovering the Yar is required to reveal the initials. Other versions with a different title: Caçadores Caçadores da Arca Perdida Lost Arck Riders of L. Ark Riders of Lost Ark Riders of the Lost Ark", "platform": "Atari 2600", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari", "publishers": "Atari", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "https://en.wikipedia.org/wiki/Raiders_of_the_Lost_Ark_(video_game)", "video_link": "https://www.youtube.com/watch?v=fgHTJhwZA9E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5063\n"}