{"altername_name": [], "name": "Raster Fahndung", "overview": "The One Player Game In the intro you can choose to play a one or two players game by either pressing fire of joystick one or joystick two. The one player game starts with a random board and your cursor located in the middle. Above the board is a countdown timer and the player's score is shown below the board. Pressing the fire button of your joystick shows the pattern which you have to find inside the board. Releasing the fire button brings you back to the board where you have to search for the pattern. Pressing the fire button at the right position awards you with the remaining time as points and the next level. Pressing the button at a wrong position shows the small pattern again. The game ends when the time counter runs to 00. To make things a bit more difficult, the time counter runs faster when the small pattern is displayed. The Two Players Game If you chose the two players game in the intro, the game starts with two different cursors inside the board and individual scores for each player. The objective is the same as in the one player game: look at the pattern and search for it inside the game board. Both players can watch the small pattern individually, but remember that the time runs faster when the small pattern is shown. Releasing the fire button brings you back to the board where you have to search for the pattern. Pressing the fire button at the right position awards the winning player with one point and the game continues with the next level. Pressing the button on a wrong position shows the small pattern again. The game ends when either the time counter runs to 00 or one of the players manages to reach 9 points. To make things a bit more difficult, the time counter runs faster when the small pattern is displayed. It runs even faster if both players press the fire button at the same time. The Game Time Modes You can choose one of the two game modes with the left difficulty switch. The \"Easy\" setting gives you a fixed time limit per level, starting at 90 and decreasing by 5 per level until a minimum of 20 seconds is reached. All following levels give you 20 seconds time limit. The \"Hard\" setting gives you 90 seconds at the beginning of the first level. You start the next level with the remaining time of the previous one. This means that the time is running from 90 to 0 and you can solve as many levels as possible within this time. Solving each level gives you a bonus time of 5 seconds.", "platform": "Atari 2600", "release_date": "December 14, 2007", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Simon Quernhorst", "publishers": "Atari Age", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122885\n"}