{"altername_name": ["Firebug", "Fire Spinner", "Firebug"], "name": "Spinning Fireball", "overview": "Talk about a game with convoluted history! It was once thought that Spinning Fireball, along with Pizza Chef, Immies and Aggies, and A Mysterious Thief, were all original games developed by a PAL company called Suntek. However after much research it has been determined that these are in fact original NTSC games released by two different companies called Zimag and Vidco, which may have been related somehow. So why were these games developed for the NTSC market but never released? Read on to find out. Spinning Fireball is a half hearted attempt at a 3D target shooting game. This is probably something that shouldn't have ever been attempted on the 2600, but Vidco decided to try it anyway. The result is a game that looks decent, but plays horribly. The goal of the game is to have your wizard create and shoot a fireball at the catapult that movies across the top of the screen. The controls for Spinning Fireball are bit difficult to master, which is just as well as you probably won't want to play this game very long. To create your fireball, simply push and hold the joystick forward. Once the fireball starts to spin (hence the name Spinning Fireball), press the fire button to shoot it. The direction the fireball flies is based on the direction it was spinning when the button was pressed (sort of like the hammer throw in Track and Field). If you are facing right the fireball will rotate clockwise, otherwise if you left the fireball will rotate counterclockwise. If your shot actually manages to hit the catapult (and good luck with that), then you will be taken to the second level. While Spinning Fireball may be short on thrills, there are some dangers you will face during your fire slinging exploits. If your fireball hits the sides of the screen it will bounce back at you. Likewise if you shoot your fireball straight up, it will come back down (run!). If you manage to get hit by your wayward fireball, you will lose a life. Also, the catapult at the top of the screen will occasionally shoot a fireball at you, as you may have guessed, being hit by this fireball will also result in losing a life. You also have a limited amount of time to finish each level, if the timer hits zero you will (say it with me now) lose a life. The timer starts a five minutes for the first level, and decreases one minute for each successive level (down to two minutes starting on level four). While it won't win any awards for good graphics or gameplay, Spinning Fireball is an interesting attempt to breathe some innovation into the tired old shooter formula. Unfortunately the result was a game that needs more variety and polish before it could be considered fun to play. The frustrating control scheme makes hitting the catapult more a matter of luck than skill. There's a reason these games never made it to the US.", "platform": "Atari 2600", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Suntek", "publishers": "Suntek", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "https://youtu.be/tqnsOeQwTQI?t=5", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78460\n"}