{"altername_name": [], "name": "Squish 'Em", "overview": "It seems ridiculous - and too good to be true. Are there really suitcases full of money at the top of those unfinished buildings downtown? The ones still under construction? And those suitcases, they're just there for the taking? You would never have believed it except that the guy who told you about it, a regular union guy like you, just bought a brand new Corvette. You know that two weeks ago he didn't have that kind of money, so you guess he's telling the truth. When you asked him how come he didn't get the rest of the suitcases, he got an odd look on his face and wouldn't say another word. Strange... Your objective in Squish 'Em is to climb those 48-floor buildings to grab the cash-filled suitcase at the top of each one. As if scaling the heights of the buildings was not dangerous enough, you have to be alert for falling bricks from above and watch for creepy critters who've made these buildings their home! Once you reach the top of each building, you can grab the suitcase and continue to the next building. Along the way you'll encounter a wide range of critters that you must avoid or jump over. You can even squish the creatures with your feet, but you can only squish each creature once before they turn white with rage and pop back up, looking for revenge! Once a creature has turned white you cannot squish it again! In addition to the creatures, each building has a bonus item that you can collect to receive an extra man. Squish 'Em was written by veteran Atari 2600 homebrew author Bob Montgomery, who has several previous 2600 homebrew games under his belt, including Go Fish!, Reindeer Rescue, and Elevators Amiss. Squish 'Em is a near flawless port of the old Atari 8-bit computer name of the same name--fans of the original game will be pleased to see this impressive and addictive incarnation of the game on the Atari 2600!", "platform": "Atari 2600", "release_date": "December 14, 2007", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Bob Montgomery", "publishers": "AtariAge", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113643\n"}