{"altername_name": [], "name": "The Dukes of Hazzard", "overview": "Dukes of Hazzard is a driving game with an overhead perspective, based on the popular television series of the same name. Players take on the role of the Duke boys driving the infamous \"General Lee,\" while trying to avoid the police and rescue their sister Daisy from Boss Hogg. While development of this game was reportedly complete, it was not commercially released (and thus it never recieved a packaging design, official instruction manual, etc). Dukes of Hazzard is not really a prototype. The game was actually burned onto regular ROM chips that were just about to be put into carts and shipped when Atari abruptly decided to cancel the game. According to the programmer Mark Hahn the game was still being worked on, so it is a mystery as to why Atari would go through the expense of manufacturing ROM chips. It appears that Dukes of Hazzard may have been the victim of internal Atari territoriality. According to Hahn he and his group were stationed in New York, while the bulk of Atari's programming staff was located in California. Apparently the California group didn't give the New York group much help or guidance and they were sort of forced to wing it. Interestingly, this wasn't Atari's first attempt at a Dukes of Hazzard game. Atari had previously attempted to rework the graphics in the unreleased game Stunt Cycle into a Dukes of Hazzard type game. It's unknown why Atari abandoned the Stunt Cycle version, but it may be because it was too outdated by the time it was ready for release. This may explain why Atari was so eager to get this Dukes of Hazzard game out the door as quickly as possible (or perhaps Atari's use of the license was about to expire). Either way, the game was never released.", "platform": "Atari 2600", "release_date": "1983", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Mark R. Hahn", "publishers": "Never Published (Prototype)", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=OAMrBHh0YR8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32963\n"}