{"altername_name": ["Venetian Blinds Demo"], "name": "Venetian Blinds", "overview": "As the name implies the Venetian Blinds demo isn't a game, but a demo that simulates a pair of Venetian blinds! The joystick can be used to raise and lower the blinds by pushing up or down. When the blinds are raised a nicely done sunset is visible out the window. The story behind the Venetian Blind demo is rather interesting. As most people know, Activision was founded by several ex-Atari employees who had left due to Atari's policies on programmer recognition (or the lack thereof). One of these employees was Bob Whitehead, creator of the \"Venetian Blinds\" technique, which was first used in Atari's Video Chess to display eight objects in a row instead of the normal six. Even though Activision had never used the Venetian Blinds technique in any of their games, that didn't stop Atari from threatening to sue Activision for \"stealing\" the technique along with other various proprietary information. Since Activision knew that they hadn't stolen anything from Atari, they decided to play a little joke on Atari. According to David Crane, when the Atari's lawyers questioned them about the \"stolen\" Venetian Blinds technique David showed them this demo and said \"Is this what you guys are referring to?\". Apparently Atari wasn’t in a laughing mood, and they went through with the lawsuit. In the end Atari ended up losing the case and Activision went on to become the most successful of the 2600 third party companies. Although Activision never made a game out of this demo it didn't go completely to waste. The sunset was later used in the background of Barnstorming.", "platform": "Atari 2600", "release_date": "1981", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "David Crane", "publishers": "Never Published (Prototype)", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "1.2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/77969\n"}