{"altername_name": [], "name": "Video Jogger", "overview": "When you are ready to start exercising, step on the FOOT CRAZ ACTIVITY PAD GREEN dot. It starts the pace symbols moving around each track. There are two tracks displayed on the screen. To start moving the jogger figure, jog alternately on the ORANGE and SLUE dots on the FOOT CRAZ ACTIVITY PAD. The faster you jog, the faster the jogger figure moves around the track. Lap count, time and score are displayed at the bottom of the screen. Once around, the track is equal to approximately thirty-five yards. To add variety and greater challenge to JOGGER, you may, at any time, switch the jogger figure to the lower, faster track by stepping on the RED dot of the FOOT CRAZ ACTIVITY PAD, and back again to the upper, slower track by stepping on the YELLOW dot. JOGGER is more effective at the slower pace. The length of time jogging is more beneficial to your fitness than moving at sprint speed. Track laps are counted, giving JOGGER a competitive feature for increased family pleasure. After 2,000 points are accumulated, the pace symbol speed increases and challenges you to jog faster. Five minutes into your run, a second pace symbol appears on each track, making JOGGER even more spirited among participants. Bonus points may be earned by passing the pace symbol when it is GREEN. If you pass when it is RED, you lose a \"life.\" JOGGER gives you three \"lives\" before the sequence needs to be repeated. There are four levels of difficulty. When you exercise on JOGGER, it is beneficial to remember that you are running in place. Maintain an erect posture, and you will get more out of your workout. Make certain that you jog on the BLUE and ORANGE dots. JOGGER is an excellent trainer for those who want to begin a jogging program, or trim off pounds.", "platform": "Atari 2600", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Exus Corporation", "publishers": "Exus Corporation", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=XUbsywHLlI8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33171\n"}