{"altername_name": [], "name": "Wizard of Wor Arcade", "overview": "I fear it is too late for myself and my crew... ...My hope is whomever finds this message can learn from our misfortune and perhaps be better prepared for the challenges that await. There is an ancient legend passed down by deep space travelers. The legend of the Wizard of Wor. It tells of an evil wizard who studied in the sciences of dimensional travel and teleportation. It is said that the Wizard possesses the ability to entrap travelers at any point in space and teleport them to his labyrinthian planet. A planet populated by an array of malevolent creatures, all teleported there against their will. The wizard entertains himself by watching these creatures battle each other in a struggle for survival in the land of Wor. The first time I heard this story I was a young recruit in the star academy. An old, veteran star pilot shared the tale with me over a few pints in the local spaceport. A rite of passage designed to spook young recruits. Or so I thought. At the beginning of each dungeon, the Worriors are located in the start area. To enter the maze, press up on the joystick. A Worrior cannot be harmed while in the start area, but only has 10 seconds before being forced into the maze. Once in the maze, use the joystick to guide the Worrior through maze and attack the monsters. Guide your Worrior to the red tunnel to warp from one side to the other. The red tunnel can only be used when it is open (it will show a red arrow) and closes for a few seconds once it is used. The enemies can also use the tunnel so be on the lookout! The Wizard has created 99 devious dungeons that he dares you to enter! There are many types of dungeons that your Worriors will need to master to move on to the next and continue your battle with the Wizard!", "platform": "Atari 2600", "release_date": "2007", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Champ Games", "publishers": "AtariAge", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=xIkkq2udZwI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158874\n"}