{
  "name": "Super Famicom",
  "manufacturer": "Nintendo",
  "type": "",
  "origin": "Japan",
  "year": "November 1990",
  "production": "2003",
  "language": "None",
  "keyboard": "8-way d-pad, 6 buttons + Select + Start",
  "cpu": "Nintendo 5A22, based on 65c816",
  "speed": "3.579545 MHz (Switchable by software to 2.68 MHz or 1.79 MHz)",
  "coprocessor": "1.024 MHz Sony SPC700, Picture Processor Unit",
  "ram": "128 KB",
  "vram": "64 KB",
  "rom": "",
  "text": "",
  "graphics": "256x224 - 512x448 max",
  "colors": "32,768 palette, 256 on screen",
  "sound": "8 channel Sony S-SMP, 3 channel Sony/Nintendo S-DSP",
  "size": "Unknown",
  "ports": "Cartridge, power adapter, RF out, AV out, 2 controller ports, expansion port",
  "power": "External power supply unit, 10v DC",
  "price": "?25,000",
  "description": "\nNintendo\u0027s follow up the NES arrived 1990. Bundled with the classic Super Mario World the console proved an instant hit in Japan, selling out within hours and going on to outsell Sega\u0027s Mega Drive. Between them the Super Famicom and SNES acheived combined sales of almost 50 million units world-wide.\n\nWith well over 750 games released, owners certainly had plenty of choice. One of the biggest sales boosts came from a near arcade perfect version of Street Fighter II, released at the peak of the games popularity.\n\nAround the time of the Mega CD, Nintendo planned a CD-ROM add-on with the aid of Phillips and Sony. Artists impressions were published in magazines but the device was never manufactured. Phillips went on to create the CD-i while Sony\u0027s efforts would result in the PlayStation.\n\nA number of peripherals were released, most notably 1994\u0027s Super Game Boy. This allowed the use of the wide selection of Game Boy games, which could be displayed with colour borders. The games themselves could also be displayed in colour, and a number of four colour palettes were available to select from.\n\n1995 saw the launch of the Satellaview, a modem which connected to the expansion port. Users were able to download games which were released in instalments.\n\nProduction of the Super Famicom eventually came to an end in 2003, after an incredible 13 years of official support.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/nintendo_super-famicom_box_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;DEMO TAPE INLAY #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.primo.homeserver.hu/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;PRIMO home-page\u0026lt;/a\u0026gt; for this picture.\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/microkey_primo_promo-pic_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (FEBRUARY 1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;Efficient companies choose professional partners\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/logabax_lx500_advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;POWER... IS EXPENSIVE!\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The Megabyte Micro was a special version of the Imsai made with  16 x 64 KB RAM boards (Imsai just introduced this card) and a control board called Intelligent Memory Manager. A mapping configurator allowed each user to use its own protected RAM area. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Prices :\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; 64 KB RAM board Kit: \u0026lt;b\u0026gt;$2599\u0026lt;/b\u0026gt;, assembled: \u0026lt;b\u0026gt;$3899\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; Intelligent Memory Manager board: \u0026lt;b\u0026gt;$299\u0026lt;/b\u0026gt;, assembled: \u0026lt;b\u0026gt;$399\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;  To note: in 1977, 1 MB RAM costed... $62384!\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Imsai_8080_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #19\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What kind of diskettes do you recommend for use with the FD-8?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have our diskettes manufactured by the Dysan Corporation. They are packaged for us under the MSI label and have proven to be the most reliable diskettes available for use with the FD-8. We have tried other manufactur\u0026shy;ers but have found none to be as reliable as Dysan. We pay more money for Dysan diskettes and, as a result, cannot offer them at a price quite as competitive as some other manufac\u0026shy;turers. However, we feel that the reliability is most important. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does the FD-8 use IBM compatible format?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 is not IBM compatible since we use hard-sectoring on the diskette. Our format uses 16 sectors of 256 data bytes each per track. In addition, track and sector identification, checksum (CRC), and other error checking information is written on each sector in addition to the data. This gives a total capacity of 315,392 bytes of data which can be stored per diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are diskette hardholes, and what do they do?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Hardholes are small mylar doughnuts which may be affixed to the center hole of a diskette for additional protection. It is possible to damage the center hole of a diskette if it is not properly centered at the time the disk drive door is closed. The mylar doughnut serves to reinforce the center hole of the diskette and give it additional protection against damage. The hard hole also provides for additional fric\u0026shy;tion between the diskette and the clamping hub in order to provent slippage of the diskette dur\u0026shy;ing rotation. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does MSI offer application software packages?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI is in the process of developing ap\u0026shy;plication software for use with the FD-8 System. We will be offering a library of standard busi\u0026shy;ness programs for accounting, inventory and mail list applications in the near future. These programs will be written in BASIC using the disk data file capability of the FD-8. The availability of application software will be announced in periodic MSI newsletters and will be made available to FD-8 users for a small copying charge plus the cost of the diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does a user program library exist for the MSI FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We are in the process of organizing a user group for the FD-8. Users of the FD-8 System are encouraged to submit programs which may be included in the user library. Member\u0026shy;ship in the user group may be achieved by either submitting a program for publication or by payment of a nominal membership fee. Membership then entitles the user to receive periodic listings of user library contents and newsletters. Programs contained within the user library will be made available for a small copying charge. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between MSI TAPE BASIC and MSI BASIC used with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have added several features to the MSI version of BASIC. We offer multiple statements per line, user defined verbs, a string\u0026shy;length command which allows strings up to 128 characters to be used, and have increased the speed of execution. In addition, we have completely removed the dependence upon the MIKBUG ROM and MIKBUG RAM areas. The stack pointers have been moved to the user program area, and the input/output routines for each of the ports are fully documented so that these can be easily changed. Interrupts are now allowed and can be used to vector the program to a user subroutine and then return to BASIC. We are also developing multi-user BASIC which will be released in the near future. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can MSI BASIC and the disk operating system be relocated?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Essentially, no difference exists between the two versions of BASIC insofar as the BASIC interpreter is concerned. The tape version has disk and DOS commands removed from its library. The interpreter resides from memory location $0100 to $1 FFF in both versions. In addition, memory locations below $0100 are used as pointers. In the Disk version, memory locations from $2000 - $2FFF are used to con\u0026shy;tain disk driver subroutines, DOS, and other file handling routines. User memory begins at $2000 for the tape version and $3800 in the Disk version of BASIC. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between SWTP 8K BASIC and MSI BASIC?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; It is not considered feasible to attempt relocation of these programs since so many of the individual routines which are used in the disk operating system are integrated. It would require a major revision of the disk operating system, BASIC, coresident assembler/editor and other associated utility programs before such a relocation could be performed. However, a version of MSI BASIC will soon be available on PROM which will reside at a high memory location. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; How difficult is it to run MSI BASIC and the disk operating system on the Motorola Ex\u0026shy;orciser, or other 6800 based microcomputer systems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The primary changes which must be made are in the input and output character routines. These routines must be changed in all MSI software so as to be compatible with the sys\u0026shy;tem on which software is running. In addition, the PIA Interface which communicates with the disk, the FD-8, is presently located at mem\u0026shy;ory address $801 C. A PIA residing at this ad\u0026shy;dress will also be necessary, or alternatively, this address must also be changed in the disk driver subroutines. Several different versions of the MSI software package are currently being developed for use with other 6800 systems. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle tape commands as well as disk?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the commands TSAVE AND TLOAD are used with the tape, whereas the commands SAVE and LOAD are reserved for use with the disk. It is also possible to place a label at the front of a block which is saved on tape. When this label is specified during a LOAD opera\u0026shy;tion, the program will search for the appropriate block on tape before loading in the information which has been stored on the tape. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle data files?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, both random and sequential data files are available for the disk system under MSI BASIC. Named files for object code, source code, BASIC program, and BASIC data files are all available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have heard that 1702A PROMs are too slow for use with 6800 systems running at full clock speed. Is this true?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; This is not true, if the memory addressing scheme employed by MSI is used to address the 1702A PROMs. The MSI PROM/RAM Board does not employ Phase 2 of the clock in the memory addressing scheme. This permits a tolerable memory access time of approxi\u0026shy;mately 9OQns. MSI uses 650ns access time 1702A PROMs in all applications. This provides completely satisfactory reliability of operation. We have experienced no problems whatsoever when using fast 1702As. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I buy a Bootstrap routine on PROM in order to bring the disk system into operation quickly?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, MSI is presently delivering a 512 byte Bootstrap Program known as Short Boot. This routine is available on a two-PROM set using 1702A PROMs for use with the MSI PROM/RAM Board. Short Boot and the PROM Board are delivered with most Disk Systems. This allows the disk to be placed into operation by simply executing the Bootstrap routine which is orged at $COOO. The system then responds immediately with DOS READY and programs may then be called immediately by file name. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I am interested in purchasing MSI software but am having a hard time evaluating its use\u0026shy;fulness. May I purchase the documentation for your disk system and BASIC separately for evaluation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the complete operating manual for the FD-8 Disk System may be purchased sep\u0026shy;arately for $35.00. This manual includes as\u0026shy;se\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s19.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;DAK ADVERT (US, 1986) - PAGE 1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.dak.com\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;DAK\u0026lt;/a\u0026gt; for this advert\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/visual_commuter_ad_dak_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;NASCOM 1 BROCHURE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Lucas_Nascom1_Brochure_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Dave Dunfield and his \u0026lt;a href\u003d\u0026quot;http://parse.com/~ddunfield/museum/index.htm\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;website\u0026lt;/a\u0026gt; for this advert\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/morrow_decision_ad_2_s.gif"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (1985)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This detailed advert presents a complete EXL-100 with all the pripherals available then (printer, disk, tape, modem, carts, etc.).  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026quot;Exelvision, the french micro-computing challenge\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/exelvision_exl100_ad_may85.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT JUNE 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert said: \u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; With NEC\u0027s PC-8800 personal computer, you don\u0027t have to ask yourself which comes first, the hardware or the software.\u0026lt;br\u0026gt; It\u0027s designed to be uncompromising in both areas. So you come first. In the office or at home.\u0026lt;br\u0026gt; The hardware gives you your choice of 8-bit or 16-bit processors, 5 1/4\u0026quot; or 8\u0026quot; disk drives and standard green or high resolution color monitor.\u0026lt;br\u0026gt; The software includes advanced, user friendly programs for all types of banking, accounting and business management. Plus free WordStar word processing, and MailMerge, Multiplan spread sheet, BASIC (two versions), and CP/M... \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Nec_PC8800_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ALTAIR \u0027MOBILE\u0027 COURSE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;b\u0026gt;Mark Thompson\u0026lt;/b\u0026gt; \u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Altair_8800_Course_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH LEAFLET\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Opening to the computers universe.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Sanyo_55X_FrenchLeaflet_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. AD (1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This advert tried to convince computers newcomers that a pocket computer could do the same as a desktop computer...\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; Now Texas Instruments brings you a cordless compact computer that solves the same sort of problems as the Apple or IBM Personal Computer...\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; ...For most personal computer tasks, its 6K RAM and 34K ROM are ample...\u0026lt;/font\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/TexasIns_CC40_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;STUPID PICTURE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;An 80\u0027s beautiful (!) woman tries to convince us that it\u0027s very exciting to work with an Alpha Plus...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/alcatel_alphaplus_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT, APRIL 1982\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;From Personal Computing, April 1982\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;\u0026lt;a href\u003d\u0026quot;http://www.aci.com.pl/mwichary/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;Attached\u0026lt;/a\u0026gt;\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Apple_II+_USadWaves_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/pizon_visiomatic_101_pub1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PROMOTIONAL PICTURE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Fran\u0026ccedil;ois Houste and \u0026lt;a href\u003d\u0026quot;http://www.phijvmi.com\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;www.phijvmi.com\u0026lt;/a\u0026gt; for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/amstrad_gx4000_promo-pix.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (JAN. 1980)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/datasoft_vdp80_ad_1980.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MAIL ORDER\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Computer assisted mail-order \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; As soon as the home computers could communicate easily through modem with large computer sites, the major mail-order companies had the idea to sell products to the computers users. This  concept was facilitated in France by the free distribution of the \u0027Minitel\u0027 Videotex terminal that was gradually integrated into home computers. The success gained by this system in France did not have any equal in the rest of the world.  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Thomson_TO7_MailOrder_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UK ADVERT, OCT 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The first sentence of this advert is:\u0026lt;br\u0026gt; \u0026lt;i\u0026gt;The new Commodore 64  is the most powerful personal computer available to the businessman.\u0026lt;/i\u0026gt;\u0026lt;br\u0026gt; Which wasn\u0027t totally true, even totally false.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The picture is also totally unrealistic. Each detail sounds false.\u0026lt;br\u0026gt; The C64 never was a business system, but a perfect home computer.  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_64_Advert_s5.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.sapere.demon.co.uk/computers/honeywell.html\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;Adrian Wise\u0027s website\u0026lt;/a\u0026gt; for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/honneywell_ddp516_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;John V. Blankenbaker designed the Kenbak-1 and marketed in the pages of Scientific American in 1971. The machine\u0027s name was taken from the middle of John\u0027s last name.\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.vintage-computer.com\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;www.vintage-computer.com\u0026lt;/a\u0026gt; for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/kenback1_1_advert.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1980 ADVERT \u0026amp; PRICE LIST\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;b\u0026gt;Price list\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;  \u0026lt;b\u0026gt;VP-111  \u0026lt;/b\u0026gt;Low cost microcomputer  \u0026lt;b\u0026gt;$99\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-114  \u0026lt;/b\u0026gt;Expansion kit for VP-111 (3 KB RAM, I/O port and connectors)  \u0026lt;b\u0026gt;$76\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-711  \u0026lt;/b\u0026gt;Original VIP microcomputer \u0026lt;b\u0026gt;$199\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-44    \u0026lt;/b\u0026gt;On board RAM expansion (4 x 2114 RAM chips)  \u0026lt;b\u0026gt;$36\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-590  \u0026lt;/b\u0026gt;Color board  \u0026lt;b\u0026gt;$69\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-595  \u0026lt;/b\u0026gt;Simple sound board (256 programmable frequencies) with speaker  \u0026lt;b\u0026gt;$30\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-550  \u0026lt;/b\u0026gt;Super sound board (Synthetiser with two sound channels  \u0026lt;b\u0026gt;$49\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-551  \u0026lt;/b\u0026gt;Super sound 4 channels expansion \u0026lt;b\u0026gt;$74\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-570  \u0026lt;/b\u0026gt;4 KB RAM memory expansion board  \u0026lt;b\u0026gt;$95\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-580  \u0026lt;/b\u0026gt;Two players keypad  \u0026lt;b\u0026gt;$20\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-585  \u0026lt;/b\u0026gt;Keypad interface board  \u0026lt;b\u0026gt;$15\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-560  \u0026lt;/b\u0026gt;Eprom board for two 2716 EPROMS  \u0026lt;b\u0026gt;$34\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-565  \u0026lt;/b\u0026gt;2716 EPROM programmer with software  \u0026lt;b\u0026gt;$99\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-575  \u0026lt;/b\u0026gt;Expansion board with 5 expansions sockets  \u0026lt;b\u0026gt;$59\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-700  \u0026lt;/b\u0026gt;4 KB Tiny Basic  \u0026lt;b\u0026gt;$39\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-701  \u0026lt;/b\u0026gt;Floating point Basic (cassette)  \u0026lt;b\u0026gt;$49\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-710  \u0026lt;/b\u0026gt;Game listings  \u0026lt;b\u0026gt;$10\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-720  \u0026lt;/b\u0026gt;Game listings II  \u0026lt;b\u0026gt;$15\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;VP-601  \u0026lt;/b\u0026gt;Keyboard 128-character ASCII  \u0026lt;b\u0026gt;$69\u0026lt;/b\u0026gt; \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/RCA_Cosmac_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ISAAC ASIMOV AD #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This surprising advert is dated 1982.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/tandy_trs80-model3_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. AD #1 (1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The HHC advertising campain was not really attractive: black \u0026amp; white, lots of small characters texts, small pictures...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Panasonic_HHC_Advert2.jpg"
    }
  ],
  "hardware": [],
  "emulator": [
    {
      "platform": "Multiplatform emulator",
      "name": "Snes9x",
      "link": "http://www.snes9x.com/",
      "description": "One of the best SNES emulator available, if not the best. Available for many platforms"
    },
    {
      "platform": "Multiplatform emulator",
      "name": "ZSnes",
      "link": "http://www.zsnes.com/",
      "description": "The other leading SNES emulator (Win, DOS \u0026amp; Linux)"
    }
  ],
  "link": [
    "computer.asp?st\u003d1\u0026amp;c\u003d1226",
    "computer.asp?st\u003d1\u0026amp;c\u003d1249"
  ],
  "image": "http://www.old-computers.com/museum/photos/nintendo_super-famicom_1s.jpg",
  "builtInGames": "None",
  "controllers": "",
  "media": "Cartridge, 2 to 48 Megabits",
  "numGames": "",
  "peripherals": "Super GameBoy, Super Scope (Light gun), Satellaview, SNES Mouse, Super Multitap (8 player adapter)",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}