{
  "name": "MPU-1000/2000",
  "manufacturer": "Acetronic",
  "type": "",
  "origin": "United Kingdom",
  "year": "1979",
  "production": "",
  "language": "None",
  "keyboard": "Two controllers with 12 buttons, 2 fire buttons and an analog joystick",
  "cpu": "Signetics 2650A",
  "speed": "",
  "coprocessor": "Signetics 2636 (Video controller)",
  "ram": "43 bytes",
  "vram": "",
  "rom": "",
  "text": "",
  "graphics": "Unknown",
  "colors": "8?",
  "sound": "Single channel beeper",
  "size": "",
  "ports": "Cartridge slot, RF TV video output, Power input",
  "power": "External power supply unit",
  "price": "Unknown",
  "description": "\nThe Acetronic MPU-1000 is another Interton VC-4000 \u0026quot;software compatible\u0026quot; system (saying \u0026quot;clone\u0026quot; would be misleading). That is to say that the internal specs are exactly the same and that games would run on both systems. The cartridge slots are however different in shape and cartridges won\u0027t fit in each others. This group of consoles is often refered as \u0026quot;Interton VC-4000 compatible system\u0026quot; as the VC-4000 maybe the most popular of all the other systems (see its entry for more info).\n\nBut according to the excellent research work from Dale Hansen, the 1292 Advanced Programmable Video System from Radofin would be the first member of the line as it was released in 1976! Radofin then licenced its system wordlwide to different companies.\n\nThere are two controllers composed of a 12 keys keypad, two red fire buttons and an analog joystick. Interton VC-4000 compatible systems usualy have these 12 keys and one or two fire buttons. The control panel has the same buttons found on all systems of this system family: Start, Load Programme, Game Select and on/off switch.\n\nThere is also an Acetronic MPU-2000, which is almost the same system, only with slightly different case design and built-in power supply. The MPU-1000 Home Video Entertainment Center could also be found under different brands such as Radofin 1292, AudioSonic PP-1292, Radofin Programmierbares Video System or Hanimex HMG-1392. Or rather, the same hardware \u0026amp; case were licenced (by Radofin?) to these different brands.\n\nOne particularity about this videogame \u0026quot;family\u0026quot; (VC-4000 \u0026amp; clones), is that they seem to be the only systems which required the game to be loaded into internal RAM from the cartridge, before being able to play (generally through a LOAD PROGRAM or equivalent button found on the control panel).\n\nThe Acetronic MPU-1000 sold well in United-Kingdom and can be considered as the \u0026quot;english Interton VC-4000\u0026quot;...\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU-1000 LOGO\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_logo.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU-1000\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU-1000 BASE UNIT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ELECTRONIC BOARD\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As you can see from the PCB markings it was licensed from Radofin.\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Incog for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu-1000_pcb_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU-1000 BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_box_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOX - FRONT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Incog for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_box-front.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOX - SIDE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Incog for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_box-side.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU-2000\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is almost the same system as the MPU-1000. The case design is slightly different and the power supply is built-in the system.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu2000_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU-2000\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu2000_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU-2000 BASE UNIT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu2000_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;CONTROLLER\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Each controller is composed of a 12-button keypad, two red fire buttons and an analog joystick. Both are hardwired to the unit.\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;www.virtualgaz.co.uk \u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;www.virtualgaz.co.uk\u0026lt;/a\u0026gt; for this picture!\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_controller_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;REAR\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;From left to right:\u0026lt;br\u0026gt; - TV RF video output cable\u0026lt;br\u0026gt; - 2 x controller telephone-type cables (hardwired)\u0026lt;br\u0026gt; - AC Adaptor (DIN connector)\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;www.virtualgaz.co.uk \u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;www.virtualgaz.co.uk\u0026lt;/a\u0026gt; for this picture!\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_back_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MPU 2000 BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/acetronic_mpu2000_box_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;JACQUARD BROCHURE #3\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Strange logo isn\u0027t it?\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Jacquard_J500_Brochure_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1977 ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/ProcessorTech_Sol_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #18\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; In order to provide as much information as possible, we have selected the most frequently asked questions about MSI products for inclu\u0026shy;sion in our catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the MSI 6800 Computer\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are the main differences between the MSI 6800 Computer and the MP 6800 Com\u0026shy;puter manufactured by Southwest Technical Products Corporation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI 6800 Computer is bus compati\u0026shy;ble with the SWTP 6800 system. Both use the SS-50. bus architecture. However, the MSI 6800 overcomes the engineering disadvan\u0026shy;tages associated with the MIKBUG monitor, incomplete address decoding, interface ad\u0026shy;dresses in the middle of user memory, inade\u0026shy;quate power supply, and mother board capacity. The MSI 6800 system has a 20 amp power supply and a heavy duty mother board with 16 slots and gold-plated connectors. Our CPU Board has separate baud rate and system clocks, 4K of EPROM memory and a much improved MIKBUG compatible monitor. MSI interface cards bring all strappable options to a DB-25 connector on the rear panel via a rib\u0026shy;bon cable connector. This permits any terminal to be plugged into the computer without alteration of the interface card. Other advantages of the MSI 6800 are described in this catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use my SWTP memory boards and interface boards in the new MSI 6800 Com\u0026shy;puter?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, since the bus architecture is identical, they will worlk fine. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI 6800 mother board and power supply only to beef up my SWTP 6800 system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the MSI mother board (MB-1) has the same hole centers as the SWTP mother board and will mount easily in the SWTP chassis. However, the MSI interface adapter board (IA-1) must also be used to furnish an interface bus. The MSI power supply (PS-1) may also be used to replace the SWTP supply. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is the MSI6800 available wired and tested?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, see catalog listings. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI CPU card in my SWTP 6800 system in order to gain a faster system clock and on board EPROM memory?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, however the MSI power supply should also be used in order to adequately supply the EPROM memory. A MIKBUG replacement monitor must also be used if interface ad\u0026shy;dresses used by MIKBUG are to be retained. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the FD-8 Disk Memory System\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have an SWTP 6800 System. What is needed to hook up your FD..a Floppy Disk Memory to my system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD..a Disk Memory System interfaces to any microprocessor system via a single PIA chip. For the SWTP 6800 System, we furnish our PIA-1 interface card which plugs in directly to port 7 of the interface bus. A ribbon cable then plugs into the interface card and to the disk. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is provided with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides a complete disk operating system software package for use with 6800 based microprocessor systems. The operating system gives the user the capability of having named files at three levels: object code files, source code files for the assembler, and BASIC files. The system contains a coresident as\u0026shy;sembler/editor which can pull source files from disk, assemble, and pass object code to either tape cassette or disk memory. Password pro\u0026shy;tection is available for both program as well as random and sequential data.\u0026lt;br\u0026gt; The new TSC editor is now available in a MSI FD-8 disk version. This excellent editor allows very long source files to be stored on disk, edited, and assembled with the object code being placed on disk as well.\u0026lt;br\u0026gt; In BASIC, both program as well as random and sequential disk data files are available. All files are named with optional password pro\u0026shy;tection. Other basic programs on disk can be chained to or called as subroutines from a parent program. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What charges are made for software, and what documentation do I receive?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The complete disk operating system, in\u0026shy;cluding the coresident assembler/editor are provided free of charge with the purchase of an FD..a Disk System. A $65.00 charge is made for MSI BASIC. An operating manual for disk oper\u0026shy;ating system, assembler/editor, and BASIC is provided. Partial source documentation is also provided for the input and output routines and other appropriate addresses. In addition, com\u0026shy;plete source documentation is provided for the disk driver subroutines and MINIDOS which allows the user to read or write any desired sector or number of sectors from any beginning disk location to any destination in computer memory. This enables the user to have access to the disk in his own assembly language pro\u0026shy;grams or by direct communication with the control terminal completely independently from the MSI disk operating system. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is it possible to interface the FD-8 Floppy Disk to microcomputer systems using the 8080, Z80, or 6502 processors? If so, do you provide the technical details on interfacing?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 can be connected to any micro\u0026shy;processor via a single PIA chip interface. Elec\u0026shy;tronically, there is no difficulty in interfacing to any system since transfers between the disk and the host computer are carried out via a sector buffer RAM on the disk controller card. Information transfer is under the control of a crystal clock on the controller board, thus mak\u0026shy;ing the FD-8 completely independent from processor speed or clock frequency. It is possi\u0026shy;ble to interface the FD-8 using parallel data ports without a PIA chip, however, the software for interfacing has already been written for both 8080 and 6800 systems using a PIA interface. Since some of the ports are used bi-direction\u0026shy;ally, the PIA interface provides an overall sim\u0026shy;plifi9ation of the interfacing problem. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is available for 8080 sys\u0026shy;tems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides complete source listings and documentation for MINIDOS and the disk driver subroutines which have been written for the 8080. This allows the user to have complete access to the disk to write any desired sector or number of sectors from any desired starting location to any desired destination memory address. A complete 8080 based disk operating system is not yet available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is your FD-8 Floppy Disk double density?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI Floppy Disk uses the GSI Model 110 drive which has the capability of operating in the double density mode. However, double density operation requires data to be written using a modified FM technique. This requires special data separator and data writing circuitry which is not contained within the present ver\u0026shy;sion of the FD-8. Double density version of the FD-8 will be introduced at a later time.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s18.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;JAPANESE ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Quite impressive, non ?!\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.page.sannet.ne.jp/sasajima/pc/cata/\u0026quot;\u0026gt;\u0026lt;img src\u003d\u0026quot;http://www.page.sannet.ne.jp/sasajima/pc/cata/ban_pc1s.gif\u0026quot; border\u003d\u0026quot;0\u0026quot;\u0026gt;\u0026lt;/a\u0026gt; for the picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/toshiba_pasopia7_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MICROSOFT MULTIPLAN, APR. 1986\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_128_Advert_s4.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;IBM T-SHIRT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/IBM_AT_T-shirt_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (JAN. 1980)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/ai-electronics_abc20_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT #2 (1979)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt;Compare the built-in features of leading microcomputers with the Atari personal computers. And go ahead, compare apples and oranges. Their most expensive against our least expensive: the Atari 400...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Atari_400-800_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FIRST AD\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;February 1983 - The real-size system picture occupied almost the full right page. \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/HP_75C_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/magnavox_odyssey2_ad_ouridea.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (1978)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sinclair_mk14_advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;GERMAN ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is a German advertisement for the BIT-60 and BIT-90 models. Atari VCS-2600 cartridges are scattered in front of the BIT-60, to show that the BIT-60 is really compatible with the VCS-2600 ! But strangely enough, there is no picture displayed on the TV. Were these models really  working ? ;-)\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/bit-corp_bit60-90_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT(1982) #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Osborne_1_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;SOFTWARE CATALOGUE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;AcornSoft software catalogue for the Electron\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Acorn_Electron_SoftCatalogue_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1979)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Polymorphic_8813_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;M5 JAPANESE ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://web.kyoto-inet.or.jp/people/s-oga/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;The collection of historic PC leaflets\u0026lt;/a\u0026gt; for this picture!\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sord_m5_japanese-ad.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.K. AD (AUG. 1986)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/SVI_Xpress738_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (DEC.1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;Micro price, Mega features\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/casio_fp200_ad_microprix.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;NASCOM 1 BROCHURE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Lucas_Nascom1_Brochure_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BRAZILIAN ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.museo8bits.com\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;www.museo8bits.com\u0026lt;/a\u0026gt; for this advert\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/prologica_cp400_advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US BROCHURE (RECTO)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Chris Collman for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sanyo_mbc1000_brochure_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (JAN. 1985)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;After the compliments made to the Amstrad CPC-464, what could be added ?\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/amstrad_cpc464_pub_tous-les-compliments.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (1984)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/olivetti_m24_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0027\u0027PB 700, the extensible personal computer\u0027\u0027\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/casio_pb700_advert_extensible.jpg"
    }
  ],
  "hardware": [],
  "emulator": [
    {
      "platform": "Windows emulator",
      "name": "WinArcadia",
      "link": "http://amigan.1emu.net/releases/",
      "description": "Arcadia 2001, Interton VC 4000, Elektor TVGC emulator!"
    },
    {
      "platform": "Amiga OS emulator",
      "name": "AmiArcadia",
      "link": "http://amigan.1emu.net/releases/",
      "description": "Arcadia 2001, Interton VC 4000, Elektor TVGC emulator! "
    }
  ],
  "link": [
    "computer.asp?st\u003d1\u0026amp;c\u003d1189",
    "computer.asp?st\u003d1\u0026amp;c\u003d723",
    "computer.asp?st\u003d1\u0026amp;c\u003d1051",
    "computer.asp?st\u003d1\u0026amp;c\u003d1148",
    "computer.asp?st\u003d1\u0026amp;c\u003d727",
    "computer.asp?st\u003d1\u0026amp;c\u003d1166",
    "computer.asp?st\u003d1\u0026amp;c\u003d726",
    "http://www.consoledatabase.com/faq/1292/1292faq.txt",
    "http://www.dieterkoenig.at/ccc/",
    "http://amigan.classicgaming.gamespy.com/",
    "http://www.old-computers.com/magazine/view.asp?r\u003d2\u0026amp;a\u003d7",
    "http://homepages.ihug.co.nz/~pinwhiz/fountain.htm",
    "http://www.digitpress.com/faq/1292faq.txt",
    "http://www.vc4000.de"
  ],
  "image": "http://www.old-computers.com/museum/photos/acetronic_mpu1000_1.jpg",
  "builtInGames": "None",
  "controllers": "",
  "media": "Cartridges",
  "numGames": "",
  "peripherals": "",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}