{
  "name": "Chiky? Kaih? Gun ZAS",
  "shortName": "chiky-kaih-gun-zas",
  "description": "It's the 21st Century, and mounting pollution has forced Earth's population to flee for Mars. Since that time, Earth has been uninhabited... until one day, super-intelligent robots from another galaxy descended on the planet and took over. While the robots did manage to solve Earth's pollution problem, they have done something else that may not be just as magnanimous: they have reshaped the Earth in their own image! Now, an ad hoc liberation army sets forth to rid the planet of these mechanical maniacs and make the Earth safe for humans again.<br><br><i>Chiky? Kaih? Gun ZAS</i> is a shoot-em-up game in which a single player must shoot his/her way through 5 integrated stages of mayhem to save the Earth from the robot invasion. (The player can choose to start playing on any one of the first four stages, but can only access the final stage by starting from level 1 and fighting through level by level.) While the player only has a single weapon (which can upgraded) and a shield, he/she is assisted by a pair of guns that can be moved in a straight line from the ship, giving him/her more firepower when combating the enemies. Plus, the player can detect approaching enemies from the background. And the player will need every one of these advantages, because timing is key if the Earth is to be saved!",
  "publishedBy": "T&amp;E Soft, Inc.",
  "developedBy": "T&amp;E Soft, Inc.",
  "released": "Dec 18, 1992",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy/chiky-kaih-gun-zas",
  "visual": "2D scrolling",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Game Boy",
      "releases": [
        {
          "publisher": "T&amp;E Soft, Inc.",
          "developer": "T&amp;E Soft, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 18, 1992",
          "ean13": "4 988604 230015",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/933582-chikyu-kaiho-gun-zas-game-boy-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/933583-chikyu-kaiho-gun-zas-game-boy-screenshot-set-up.png",
      "caption": "Set up"
    },
    {
      "link": "/images/shots/l/933584-chikyu-kaiho-gun-zas-game-boy-screenshot-stage-1-get-ready.png",
      "caption": "Stage 1 - Get Ready"
    },
    {
      "link": "/images/shots/l/933585-chikyu-kaiho-gun-zas-game-boy-screenshot-stage-1.png",
      "caption": "Stage 1"
    }
  ],
  "cover": []
}