{
  "name": "Momotar? Densetsu Gaiden",
  "shortName": "momotar-densetsu-gaiden",
  "description": "This game is based on famous Japanese folk tales. Momotar? is a boy who was found in a huge peach (hence his name, &quot;peach guy&quot;). When he grows up, he goes to the island of demons, fights them, takes their treasure, and restores peace in its village. In this game, you don't play directly the story of Momotar?, but control three other popular characters from Japanese folklore, playing three separate stories: as Yashahime, the daughter of the Hell King Emma; Binb?gami, or &quot;poverty god&quot;, who is hated by people because he takes money from them; and Urashima, the legendary fisherman who once saved a turtle and became friends with the dragon clan. Although the original stories have nothing or little to do with each other or the story of Momotar?, the game ties the stories together by featuring Momotar? as a character in every one of them.<br><br>Despite being primarily a game for kids (the story is told in a fairy-tale fashion), this is a full-fledged Japanese-style RPG with levels, party management, world map traveling, dungeons, towns, weapons and armors, and turn-based combat against randomly appearing enemies, viewed from first person perspective.",
  "publishedBy": "Hudson Soft Company, Ltd.",
  "developedBy": "Hudson Soft Company, Ltd.",
  "released": "Dec 26, 1991",
  "alsoFor": "NES, TurboGrafx-16 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy/momotar-densetsu-gaiden",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy",
      "releases": [
        {
          "publisher": "Hudson Soft Company, Ltd.",
          "developer": "Hudson Soft Company, Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 26, 1991",
          "ean13": "4 988607 005078",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}