{
  "name": "NIV Bible &amp; the 20 Lost Levels of Joshua",
  "shortName": "niv-bible-the-20-lost-levels-of-joshua",
  "description": "This cartridge contains the entire New International Version Bible, complete with simple or complex word search option, as well as two word games and a side-scrolling game.<br><br>The side scrolling game, called &quot;Joshua: The Lost Levels&quot; on its title screen, is, as the cartridge's name implies, twenty levels for the Game Boy version of <a href=\"https://www.mobygames.com/game/gameboy/joshua-the-battle-of-jericho\">Joshua & the Battle of Jericho</a>  for one or two players that were not in the original Game Boy release.<br><br>Both word games are one player.<br><br>The first of the word games is Bible Word Match, sort of a Bible-word-themed version of the <a href=\"https://www.mobygames.com/search/quick?company=Milton+Bradley\">Milton Bradley</a> board game <a href=\"https://www.mobygames.com/game/super-memory\">Memory</a>. Words are randomly selected from the Bible and hidden in pairs on the screen. Move the flashing box to a hidden word and press A. The word will be revealed. Now move to another hidden word and press A. If the two words match, you gain ten points and the words will disappear from the screen. If they do not match, you lose five points and the words will be covered again. After three correct matches in a row, a cherry will appear. Capture it to get a thirty point bonus. After five correct matches in a row, a Boom will appear. Capture it to reveal all words briefly.<br><br>The other word game is Bible Shepherd, a Bible-themed version of <a href=\"https://www.mobygames.com/search/quick?game=Hangman\">Hangman</a>.  You have three sheep in a pen, the alphabet to select from and a word who's letters are hidden, showing only blank spaces. Move your cursor to a letter and press A. If the letter is not in the word, the sheep will stop moving. Select an incorrect letter again and one of the sheep will jump out of the pen. If you select a correct letter, its location(s) will be revealed in the word and, if you have sheep outside the pen, one will jump back in. You get one hundred points for each correct guessed word plus ten points for any sheep in the pen when the word is guessed correctly. If all three sheep jump from the pen before you can reveal the word, you lose.",
  "publishedBy": "Wisdom Tree, Inc.",
  "developedBy": "Wisdom Tree, Inc.",
  "released": "1996",
  "alsoFor": "",
  "genre": "Compilation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy/niv-bible-the-20-lost-levels-of-joshua",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Game Boy",
      "releases": [
        {
          "publisher": "Wisdom Tree, Inc.",
          "developer": "Wisdom Tree, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1996",
          "ean13": "9 789901 630240",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}