{
  "name": "Populous",
  "shortName": "populous",
  "description": "You play a god, gaming against other gods in a celestial game of conquest.  To win, you must help your chosen people take over the world and wipe out the vermin who worship that other god.<br><br>Each god starts out with a single human, dumped into the middle of the wilderness.  Sometimes there is inhabitable land in sight, sometimes not.  To get a chance to win, you must change the landscape, creating flat land for your followers to build on.  The more followers you have, the more powerful you will be, so take care of them. Build as fast as you can, because the other god is doing the same.<br><br>When you have enough followers, you can make the leader of your people into a hero.  He will then go around the land you have built, literally taking strength from the people into himself, and working his way toward the enemy.  When he gets there, he will engage in holy warfare upon your enemy's people.  He will burn; he will kill.  And he won't stop until they're all dead... or he is.<br><br>But you don't have to let your people have all the fun; the gods have other tools as well.  You can drown your enemies one at a time with your land lowering powers, submerge their towns in swamps, or raise a volcano in the middle of their best farmland.  Even better, you can flood the land and drain all the people who didn't build on high ground. <br><br>And when you win, you'll have 500 more worlds to conquer.  A god's play is just never done.",
  "publishedBy": "Imagineer Co., Ltd.",
  "developedBy": "Bullfrog Productions, Ltd.",
  "released": "May 28, 1993",
  "alsoFor": "Acorn 32-bit, Amiga, Atari ST, DOS, Genesis, Macintosh, PC-98, SEGA Master System, Sharp X68000, SNES, TurboGrafx-16, Windows | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy/populous",
  "visual": "Isometric",
  "gamePlay": "Managerial / business simulation, Real-time strategy",
  "setting": "",
  "release": [
    {
      "system": "Game Boy",
      "releases": [
        {
          "publisher": "Imagineer Co., Ltd.",
          "developer": "Bullfrog Productions, Ltd.",
          "ported": "Enigma Variations Ltd.",
          "country": " Japan",
          "releaseDate": "May 28, 1993",
          "ean13": "4 965857 009063",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/997909-populous-game-boy-screenshot-title-screen.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}