{
  "name": "Uch? Senkan Yamato",
  "shortName": "uch-senkan-yamato_",
  "description": "<i>Uch? Senkan Yamato</i> on the Game Boy is an adaptation of the anime series of the same name, also known as <i>Space Battleship Yamato</i> and <i>Star Blazers</i>. It adapts the story of the original 1974 television series: in 2199, the Earth lies under siege by aliens from Gamila. The surface of the planet has become uninhabitable through bombardment by radioactive meteorites, so the surviving humans live underground. Hope arrives with a message from the planet Iscandar. If humans can somehow travel to Iscandar, they might acquire a device that can cleanse the planet of the radioactive damage. So from the husk of the Japanese WWII battleship <i>Yamato</i>, a powerful new spaceship is built that can fight through the Gamilan blockade and reach Iscandar. Time is of the essence, though: within a year, the built-up radiation will have killed everyone on Earth.<br><br>The game presents the adventures of the Yamato and her crew as a series of turn-based battles, each based on encounters from the series. On a top-down view of the two-dimensional battlefield, icons represent the Yamato, her escort of Black Tiger fighter squadrons, and Gamilan fighters and capital ships. Moving one's own units next to an enemy squadron begins a battle. Battles not involving the Yamato are fought automatically. It is important to keep the losses to the Black Tiger squadrons to a minimum because there is no chance to resupply and only the survivors are taken to the next level.<br><br>When the Yamato herself takes part in an engagement, the battles are fought via an action sequence. In these the player either controls the Cosmo Zero fighter flown by Susumu Kodai (when under attack by a fighter squadron) or the Yamato's main guns (when engaged with capital ships). From a first-person perspective, enemy ships can be shot at or evaded. It is important to pay attention to the Yamato's damage indicator, but also to the load level of her wave motion gun. This powerful gun can destroy even big fleets with one shot, but only if they are aligned with the gun's firing zone at the moment of discharge, as indicated by the radar screen.<br><br>The goal in each level is usually to get the Yamato to a certain point on the map, representing an obstacle like a Gamilan base or a natural hazard. Once reached, the level is won by completing a button-mashing exercise within a time limit. A password to the next level is awarded afterwards. Another action sequence follows when the Yamato must warp to another system: a bouncing ball moves over a display of the warp systems and must be stopped by a button press at the right point. There are a few tries to get it right, but too many failures mean game over.<br><br>Besides the Yamato being destroyed, there is also another way to lose. Each game turn represents a day being removed from the one-year time limit. If Iscandar isn't reached in time, the mission is a failure.",
  "publishedBy": "Interbec",
  "developedBy": "BEC Co., Ltd.",
  "released": "Jul 17, 1992",
  "alsoFor": "",
  "genre": "Action, Strategy / tactics",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy/uch-senkan-yamato_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy",
      "releases": [
        {
          "publisher": "Interbec",
          "developer": "BEC Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 17, 1992",
          "ean13": "4 932873 820026",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/688559-uchu-senkan-yamato-game-boy-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/688558-uchu-senkan-yamato-game-boy-screenshot-intro.png",
      "caption": "Intro."
    },
    {
      "link": "/images/shots/l/688560-uchu-senkan-yamato-game-boy-screenshot-the-battlefield.png",
      "caption": "The battlefield."
    },
    {
      "link": "/images/shots/l/688561-uchu-senkan-yamato-game-boy-screenshot-moving-your-ships.png",
      "caption": "Moving your ships."
    },
    {
      "link": "/images/shots/l/688562-uchu-senkan-yamato-game-boy-screenshot-details-about-the-enemy.png",
      "caption": "Details about the enemy."
    },
    {
      "link": "/images/shots/l/688563-uchu-senkan-yamato-game-boy-screenshot-a-battle-about-to-commence.png",
      "caption": "A battle about to commence."
    },
    {
      "link": "/images/shots/l/688564-uchu-senkan-yamato-game-boy-screenshot-blasting-away.png",
      "caption": "Blasting away."
    },
    {
      "link": "/images/shots/l/688565-uchu-senkan-yamato-game-boy-screenshot-result-is-even.png",
      "caption": "Result is even."
    },
    {
      "link": "/images/shots/l/688567-uchu-senkan-yamato-game-boy-screenshot-chance-to-blast-some.png",
      "caption": "Chance to blast some ships."
    }
  ],
  "cover": []
}