{
  "name": "4th &amp; Inches Team Construction Disk",
  "shortName": "4th-inches-team-construction-disk",
  "description": "4th &amp; Inches Team Construction Disk requires <a href=\"https://www.mobygames.com/game/4th-inches\">the 4th & Inches Game Disk</a>. With the companion disk, create any team and any type of player for your  game. With 4th &amp; Inches Team Construction Disk, you can create the ultimate player and the ultimate team. Assign all the stats, sizes and playing characteristics of each of your 4th &amp; Inches players. Pit real-life pros against a team made up of your friends. Name your team, choose the jersey color and then save it to disk. The possibilities are endless.<br><br>Available options are, Option I - Select Visitors and Option II - Select Home, allow you to choose/modify any of the six teams that are provided on the disk or you may create your own team by selecting Blanks.\nOption III - Save Visitors and Option IV - Save Home, allow you to save your create or modified teams to any formatted disk. \nOption V - Modify Visitors and Option VI - Modify Home, are selected after you have chosen a team to modify. You can change the teams name or the jersey color. You can also alter the first string and second string players. You can even change the player's name, height, and weight. It also allows you to specify a player's experience, for example, Rookie, Leader, 2nd year. Select a player's attribute. Choose that player's available skill from a chart provided in the manual. Option VII - Team Disk Directory displays a list of all the original and newly-created teams. \nOption VIII - Delete Team displays the teams as well. From this list you can select a team to delete, except for the original teams that cannot be erased. \nOption IX Play 4th &amp; Inches is selected when you are ready to play with your newly created or modified teams. Once selected, it will prompt you to insert 4th &amp; Inches diskette. 4th &amp; Inches loads the game and will feature the Visitors and Home teams that you created.\nOption X - Quit will exit and save whatever modifications you have made. The manual provided supports the IBM, Tandy and Commodore Amiga.",
  "publishedBy": "Accolade, Inc.",
  "developedBy": "",
  "released": "Nov, 1988",
  "alsoFor": "Amiga, DOS, Macintosh | Combined View",
  "genre": "DLC / add-on",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/4th-inches-team-construction-disk",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Accolade, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov, 1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}