{
  "name": "Ah Diddums",
  "shortName": "ah-diddums",
  "description": "<i>Ah Diddums</i> is a single player game with 99 levels in which the player builds ladders to progress to the next level<br><br>Teddy isn't in a normal toy-box, he's in the central toy-box of a nested set of 99 boxes, and to get out he must build a set of steps by piling building bricks in a specific order. In his box Teddy hears baby crying and its his job to take toys to the baby to stop her crying. However, if baby stops crying then the mother will turn out the light. The other toys in the toy-box with Ted can only play when the light is on so they try to stop Teddy comforting the baby. Contact with any of these toys will shred Ted and cost a life.<br><br>There are weapons available and these will kill the other toys, however killing all the other toys on a level / in a box brings in the invincible lump of plasticine to hamper Ted\nTed's only friend in all this is a jack-in-a-box, Jack jumps out of his box when when Ted touches it and this frightens all the other toys into being still for a short period.\nThe game screen is a top down view of the toy-box. Scattered around are bricks and other items some of which, like the pea-shooter, are weapons. Other toys patrol the game area and contact with any of these is lethal.<br><br>The game is keyboard controlled with an odd arrangement of keys.<ul>\n<li>To move Ted left or right the keys on the CAPS SHIFT to SPACE row are used in alternating order, i.e. CAPS SHIFT, X, V, N move Ted left, Z, C, B, M moves right.</li>\n<li>To move TED up the screen, or to pick up objects, alternating keys on the Q to P row are used, so keys Q, E, T, U, O will move Ted, while keys W,R, Y, I, &amp; P will make Ted pick up an object.</li>\n<li>To move Ted down the screen or to fire a weapon the keys on the A to ENTER row are used, A, D, G, J &amp; L moving Ted while the remainder fire the weapon. </li>\n<li>the keys 1 to 0 can be used to pause the game at any time</li></ul>\n",
  "publishedBy": "Imagine Software Ltd.",
  "developedBy": "Imagine Software Ltd.",
  "released": "1984",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/ah-diddums",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Imagine Software Ltd.",
          "developer": "Imagine Software Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/735184-ah-diddums-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/735185-ah-diddums-commodore-64-screenshot-lets-get-to-the-baby.png",
      "caption": "Lets get to the baby"
    },
    {
      "link": "/images/shots/l/735186-ah-diddums-commodore-64-screenshot-making-a-ladder.png",
      "caption": "Making a ladder"
    },
    {
      "link": "/images/shots/l/735187-ah-diddums-commodore-64-screenshot-next-box.png",
      "caption": "Next box"
    }
  ],
  "cover": []
}