{
  "name": "Archon: The Light and the Dark",
  "shortName": "archon-the-light-and-the-dark",
  "description": "<i>Archon: The Light and the Dark</i> is a strategic board game with some similarities to chess. Two sides, a light one and a dark one, consisting of 18 pieces each compete on a board divided into (9 by 9) squares. You win the game by having one of your units on each of the five powerpoint squares, by removing all opposing pieces from the board or by imprisoning the last remaining creature of the opposing side.<br><br>However, you can't just remove a piece from the board by landing on it. When two pieces clash, the outcome is decided in the battle arena during one-on-one real-time combat. If the real-time combat takes place on a dark square, the dark monster gets a health bonus (longer life bar). On a light square the light side gains an advantage. There are also some squares whose color changes over time (from afternoon, to dusk, to night, to dawn etc.), which adds an extra layer of strategy to the game.<br><br>Unlike chess the two sides are not identical. Both sides consist of mythological creatures. For example the light side has among others unicorns, valkyries and a djinni while the dark side features basilisks, banshees and manticores. The differences are not just cosmetic. Two special pieces are the light wizard &amp; the dark sorceress, they can both cast magical spells like: imprison a unit on the board, shift the flow of time (change day/night cycle to your advantage), bring one unit back from the dead etc.<br><br>The different pieces have their own movement restrictions regarding the number of squares they're allowed to travel on the board and whether or not they can jump over other units (like the knight in chess). Units also behave different in combat; some units are faster than others, some use melee attacks while others fire projectiles.<br><br><i>Archon</i> can be played with either one or two players.\nThe NES version, which was released a few years after the other versions, has improved graphics for the real-time combat part. Each type of square has it's own colored background and the unit sprites are larger.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Free Fall Associates",
  "released": "1984",
  "alsoFor": "Amiga, Amstrad CPC, Apple II, Atari 8-bit, FM-7, iPad, iPhone, Macintosh, NES, Palm OS, PC-88, PC Booter, Sharp X1, ZX Spectrum | Combined View",
  "genre": "Action, Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/archon-the-light-and-the-dark",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Free Fall Associates",
          "ported": "",
          "country": " United States",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Ariolasoft UK",
          "developer": "Free Fall Associates",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Dec, 1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/79776-archon-the-light-and-the-dark-commodore-64-screenshot-title.png",
      "caption": "Title flickers in different colors."
    },
    {
      "link": "/images/shots/l/79777-archon-the-light-and-the-dark-commodore-64-screenshot-this.png",
      "caption": "This screen is accompanied by C64 music."
    },
    {
      "link": "/images/shots/l/79778-archon-the-light-and-the-dark-commodore-64-screenshot-the-armies.png",
      "caption": "The armies march onto the screen."
    },
    {
      "link": "/images/shots/l/79779-archon-the-light-and-the-dark-commodore-64-screenshot-the-board.png",
      "caption": "The board, completely set up and ready for play."
    },
    {
      "link": "/images/shots/l/79780-archon-the-light-and-the-dark-commodore-64-screenshot-a-phoenix.png",
      "caption": "A phoenix attacked a goblin.  Instead of just getting the square, as in chess, the two fight for it.  The attacker is not guaranteed a victory."
    },
    {
      "link": "/images/shots/l/79781-archon-the-light-and-the-dark-commodore-64-screenshot-the-phoenix.png",
      "caption": "The phoenix's attack it to blow up in a giant flame ball, which damages the opponent who is too close."
    },
    {
      "link": "/images/shots/l/79782-archon-the-light-and-the-dark-commodore-64-screenshot-another.png",
      "caption": "Another difference from chess is the ability of the wizard and sorceress to cast spells.  Spells can heal, change time to take back a loss, resurrect a piece..."
    },
    {
      "link": "/images/shots/l/79783-archon-the-light-and-the-dark-commodore-64-screenshot-after.png",
      "caption": "After the phoenix killed the goblin, the sorceress cast a spell to freeze the phoenix, so that it could not move."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/180468-archon-the-light-and-the-dark-commodore-64-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Other",
      "country": "United States",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/180469-archon-the-light-and-the-dark-commodore-64-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Other",
      "country": "United States",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/180465-archon-the-light-and-the-dark-commodore-64-media.jpg",
      "scanOf": "Media",
      "packaging": "Other",
      "country": "United States",
      "platforms": "Commodore 64"
    }
  ]
}