{
  "name": "Asgard",
  "shortName": "asgard",
  "description": "The regions of the north are overpopulated. So king Arne sent scouts to discover new lands for settlement. The scouts discovered three new islands Yrum, Asanor and Basengard. Badly, other nations also discovered those and a race for the settlement started.<br><br><i>Asgard</i> is a strategy game in which the player has to establish a settlement on one of the islands, while also building armies to potentially fight enemy settlers. The player can rode forests, build houses, create cornfields, build mills, on mountain fields mines can be build, while at the sea fishing huts increase the income. Also defensive building like a tower can be build and bridges can cross water.<br><br>Production buildings generate a certain income each round, which can be altered by natural conditions, e.g. strong winds may prevent the fishing boats to catch any fish and therefore produce income. Natural disasters may randomly destroy enhancements. Armies must be paid and the morale is depending on the amount of cash spent on them.<br><br>Asgard is a multiplayer game for up to seven players. The player can also play solo but no computer controlled opponents are available.",
  "publishedBy": "ariolasoft GmbH",
  "developedBy": "AGC Hamburg",
  "released": "1989",
  "alsoFor": "Atari ST | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/asgard",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "ariolasoft GmbH",
          "developer": "AGC Hamburg",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1989",
          "ean13": "",
          "comments": "Floppy disk release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}