{
  "name": "Centipede",
  "shortName": "centipede_",
  "description": "In <i>Centipede</i>, the player is trapped in the Enchanted Forest. Armed with only a magic wand to ward off the forest's insect denizens, all of which apparently are attacking in the player in continuous waves. <br><br>The player must use the magic wand to shoot sparks at approaching insects to score points by pressing the controller button. Holding down the controller button will set the wand to rapid fire shots. If the player is bitten by an insect, the player will be temporarily paralyzed and lose one of the three starting magic wands. <br><br><b>Insect Opponents and Mushrooms</b><br>\nAll enemy insects have a distinctive sound before attacking, which may help the player identify which insect is attacking. Enemies and objects in the game are as the following:\n<ul>\n<li><b>The Centipede</b><br>\nThe Centipede will attack in 12 waves. In the first wave, the Centipede will have a head attached to 11 body segments. In the second wave, the Centipede will have a head attached to 10 body segments, in addition to a detached head. The third wave will have the Centipede with an attached head, 9 body segments, plus two detached heads. These body segments will transform into heads and continue to do so until Wave 12. In the last wave, the Centipede will have 12 detached heads, independently attacking the player. Centipede heads are worth more points than body segments.<br><br>Attacks from the Centipede will come from the top of the screen, moving downward. If a spark hits any part of the Centipede, that particular body segment will transform into a mushroom, while the body segment behind it will become the new Centipede head. When the Centipede is destroyed, it will briefly disappear and re-appear from the top of the screen again.<br><br><li><b>The Spider</b><br>\nThe Spider will attempt to distract the player from attacking the Centipede. It will destroy any mushroom it touches. Spiders will score more points if it is hit in closer distances.<br><br><li><b>The Flea</b><br>\nThe Flea will appear if the player has destroyed most of the existing mushrooms. It will drop down creating a new batch of mushrooms where it falls. The Flea will disappear after two hits. After the first hit, the Flea will drop down much faster.<br><br><li><b>The Scorpion</b><br>\nThe Scorpion will appear in the third wave. It moves slowly but will pick up speed, moving faster. While doing so, it will poison any mushroom it touches.<br><br><li><b>Mushrooms</b><br>\nMushrooms fill the Enchanted Forest and may act as obstacles or cover for the player, with added effects to enemy insects. It takes four shots to completly destroy a mushroom. There are two types of mushrooms: Magic Mushrooms and Poisonous mushrooms. Magic mushrooms are the default mushrooms in the game and are also the result of the player destroying an insect or Centipede body segment. Poisonous Mushrooms are the result of the Scorpion touching a mushroom. Poisonous Mushrooms will prompt the Centipede near it to move straight towards the player through any mushroom. Losing a wand will restore any partially damaged mushroom.\n</li></ul><br>\n<b>Game Difficulty and Variations</b><br>\nThe game offers four difficulty levels: Novice, Standard, Advanced, and Expert. Game Variations are as the following:\n<ul>\n<li>One Player\n<li>Two Player Alternating<br>\nTwo players will take turns when the active player is bitten.\n<li>Dual Player Competition<br>\nTwo players will appear on the screen at the same time. Scoring is separate. Shots fired from one player will paralyze the other player.\n<li>Team Play\nTwo players will appear on the screen at the same time. Scoring is combined. Shots fired from one player will not paralyze the other player.\n</li></ul><br>\n<b>Scoring</b><br>\nThe player will win a bonus magic wand for every 12,000 points to a maximum of six wands. The game will end when all wands are lost. Scoring are as the following:\n<ul><li>Centipede Head - 100 points\n<li>Centipede Body Segment - 10 points\n<li>Spider at close range - 900 points\n<li>Spider at medium range - 600 points\n<li>Flea - 200 points\n<li>Scorpion - 1,000 points\n<li>Restored mushroom - 5 points\n<li>Destroyed mushroom - 1 points</li></ul>",
  "publishedBy": "Atarisoft",
  "developedBy": "Atari, Inc.",
  "released": "Nov, 1983",
  "alsoFor": "Apple II, Arcade, Atari 2600, Atari 5200, Atari 7800, Atari 8-bit, BBC Micro, Browser, ColecoVision, Game Boy, Game Boy Color, Intellivision, PC Booter, Plex Arcade, TI-99/4A, VIC-20, Windows, Windows Phone, Xbox 360 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/centipede_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Atarisoft",
          "developer": "Atari, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov, 1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/39711-centipede-commodore-64-screenshot-title-screen.gif",
      "caption": ""
    },
    {
      "link": "/images/shots/l/39712-centipede-commodore-64-screenshot-gameplay.gif",
      "caption": ""
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/20331-centipede-commodore-64-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/20332-centipede-commodore-64-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/219447-centipede-commodore-64-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Commodore 64"
    }
  ]
}