{
  "name": "Challenge Math",
  "shortName": "challenge-math",
  "description": "<i>Challenge Math</i> is a series of 3 different math games for multiple systems:<br><br>In <i>Alien Intruder</i>, the player choose whether to do addition, subtraction, multiplication, or division questions.  Answers are arranged in a circle with 4 - 12 spokes depending on player choice.  The player is given an equation in the center, and must select the correct answer spoke before the alien invader chooses it.  If the player chooses incorrectly or is to slow, the spike is destroyed.  If the player is correct, the spike is recovered.  At the end of the game, the player and alien invader receive a score.  <br><br>In <i>Digitosaurus</i>, the player must choose which of three equations has the highest sum, and direct the dinosaur to eat this equation by typing the correct answer. Every correct answer causes the dinosaur to age 55 years, with the dinosaur reaching 600 years of age if all 10 questions are answered correctly.  There are 3 difficulty levels.  <br><br>In <i>Math Mansion</i>, the player moves about different rooms of a house collecting items to escape.  Every move or picking up an item requires the player to successfully fill in the numbers to complete a mathematical equation.  The player must gather a sword, candle, rope, and sledge hammer.  These items can then be used to escape from the mansion to freedom. ",
  "publishedBy": "Sunburst Communications Inc.",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "Apple II | Combined View",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/challenge-math",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Sunburst Communications Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}