{
  "name": "The Chess Game",
  "shortName": "chess-game_",
  "description": "You are a huge fan of the game of chess and as usual you have fallen asleep with your board and pieces, dreaming of the game, but sadly one of your dreams has turned into a nightmare. You are at the edge of a giant chess board viewed on a single screen at an elevated angle with a baying crowd on either side and you have found out that you must carry six Pawns, one at a time across the board while avoiding one of the major pieces and it's traps. Your first piece you must face is the Knight moving three squares at a time, and as you attempt to carry the Pawns across you leave behind a trail of blue squares. If the knight lands on a blue square then he turns it red and that square must be avoided. <br><br>Once you reach the other side of the board then you must return back to get another Pawn piece. If you touch the Knight or a red square then you lose the Pawn you are carrying and have to get another one. The crowd occasionally throws an object on to the board turning a square red. Once you have got all the Pawns you have remaining across then it is now time to face a Bishop. the Bishop moves diagonally across the board while all the black squares turn to blue, green then red. You cannot touch a square while it is red but the white squares don't turn colour and are safe to stand on. Once all the Pawns you have are taken across the board then you face the other major pieces like the Rook, Queen and finally the King, each with their own unique challenges. Once you have lost all the Pawns then it is game over.",
  "publishedBy": "MicroClassic",
  "developedBy": "",
  "released": "1985",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/chess-game_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Board game, Chess",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "MicroClassic",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/740587-the-chess-game-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/740588-the-chess-game-commodore-64-screenshot-get-the-pawns-across.png",
      "caption": "Get the Pawns across"
    },
    {
      "link": "/images/shots/l/740589-the-chess-game-commodore-64-screenshot-avoid-the-knight-and.png",
      "caption": "Avoid the Knight and red squares"
    },
    {
      "link": "/images/shots/l/740590-the-chess-game-commodore-64-screenshot-bishop-to-battle-next.png",
      "caption": "Bishop to battle next"
    }
  ],
  "cover": []
}