{
  "name": "The Chip Factory",
  "shortName": "chip-factory",
  "description": "<i>The Chip Factory</i> is a single screen platform game based on the arcade game <a href=\"https://www.mobygames.com/game/arcade/burgertime\">BurgerTime</a>. You play the role of Charlie who is a trainee accountant in a Silicon Chip factory who dreams of working in the manufacturing section making the chips themselves. One night, when everyone has gone home, Charlie fires up the machines to try his hand at making the chips. <br><br>To make the chips, Charlie has to move around the screen climbing up and down the ladders and walk over the chips to push them down a level and any chips below. The chips need to sit on a conveyor belt at the bottom of the screen in the right coloured order with a switch at the top of the screen moving the conveyor belt to the left.<br><br>Problems have arisen though as various creatures move about the screen looking to disrupt the process buy either moving the conveyor belt using the switch or touching Charlie to lose him one of three lives. To prevent being touched, Charlie can either avoid the creatures or use anti-static spray which is limited to up to 19 squirts. Letters also appear which make up the word CHIP and when each letter is collected, it gives Charlie extra spray and when the word is made then it refills his spray. Two players can play and each one takes it in turns to play when the other player is killed.",
  "publishedBy": "Supersoft",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "Commodore 16, Plus/4 | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/chip-factory",
  "visual": "",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Supersoft",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/740656-the-chip-factory-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/740657-the-chip-factory-commodore-64-screenshot-lets-build-chips.png",
      "caption": "Lets build chips"
    },
    {
      "link": "/images/shots/l/740658-the-chip-factory-commodore-64-screenshot-walking-over-part.png",
      "caption": "Walking over part of a chip"
    },
    {
      "link": "/images/shots/l/740659-the-chip-factory-commodore-64-screenshot-next-level.png",
      "caption": "Next level"
    }
  ],
  "cover": []
}