{
  "name": "Crazy Painter",
  "shortName": "crazy-painter",
  "description": "<i>Crazy Painter</i> is a non-violent action game where levels are won by painting the entire black game screen green. The paint brush is controlled through the joystick or keyboard keys. Once the entire screen is painted, the player needs to hit the space bar or the joystick fire button to register completion. There are also various hazards. Dogs cross the screen undoing your work with their paws and need to be painted over. A turpentine bucket needs to be painted over as well, but only when it is not flashing or you lose a brush. Snakes chase the brush and need to be lured into turpentine buckets, and crazy paint eater licks up all your paint. By removing hazards, points are earned. After each completed level a challenge screen appears with a different type of level, usually with a large amount of enemies, where additional points are earned until time runs out. The game supports two players and has ten different skill levels.<br><br>The later TRS-80 CoCo version, on which the QL and Dragon versions are based, is similar in design with some small differences. Next to the addition of more colour, there are small changes to the interface. There are hazards that wipe your can of paint, forcing you to go back to the bottom left side of the screen to grab a new one. The game also speeds up with each level. There is no challenge screen after each level, but instead after every four. In those you need to prevent paint from dripping down by using a scraper. In the Dragon version you can select three screen colours: black, buff or green, and there are eight skill levels. You start the game with four pots of paint and five brushes.",
  "publishedBy": "Pocket Money Software",
  "developedBy": "",
  "released": "1985",
  "alsoFor": "Dragon 32/64, Sinclair QL, TRS-80, TRS-80 CoCo | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/crazy-painter",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Pocket Money Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/715010-crazy-painter-commodore-64-screenshot-title-screen.gif",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/715011-crazy-painter-commodore-64-screenshot-first-level-painted.gif",
      "caption": "First level. Painted most of the screen already, the dog tries to reverse my efforts."
    },
    {
      "link": "/images/shots/l/715012-crazy-painter-commodore-64-screenshot-level-2-more-things.gif",
      "caption": "Level 2, more things appear that interfere with the goal"
    }
  ],
  "cover": []
}