{
  "name": "Creators Revenge",
  "shortName": "creators-revenge",
  "description": "The Creator has created an army consisting of robots and insects to destroy the earth, while also dropping bombs on the worlds major cities. You have been given the task of driving a tank to destroy The Creator while destroying as much of his army as you can as well as destroying a bomb before it can be dropped on a city. <i>Creators Revenge</i> is a sequel to <a href=\"https://www.mobygames.com/search/quick?game=Metamorphosisis\">Metamorphosis</a> and is a mixture of a top view vertical shooter where the screen scrolls upwards constantly, and a top view single screen shooter as well. The first level has you driving up the screen blasting as many of the insects as you can while avoiding or shooting them before reaching a neutron bomb deactivator to stop the bomb on the second level. The second level is the same as the first but now you have to avoid and shoot missiles and tanks and when you reach the end of this level you will see the bomb move down the screen and it has to be destroyed.<br><br>If you shoot the bomb then you move to the fourth level but if you fail to shoot the bomb then you watch an animated scene of a city being destroyed by the bomb and you now have to fight the mutants that have emerged from the ruined city. You have to run around the screen blasting all the mutants while avoiding getting touched by them. Once you destroy all the mutants you then move to the fourth and final level that sees you trying to destroy The Creator. The screen is full of robots and you have to destroy and avoid them while trying to get a treasure in the top left of the screen. Once the treasure is collected then a wall is removed from The Creator on the top right and all you have to do is enter it and destroy it. You have now completed the levels and you start again from level one to try to destroy The Creator once again. If you touch any insect, missile, tank, mutant or robots then you lose one of three lives.",
  "publishedBy": "Mogul Communications",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/creators-revenge",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Mogul Communications",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/742226-creators-revenge-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/742227-creators-revenge-commodore-64-screenshot-lets-save-the-earth.png",
      "caption": "Lets save the Earth"
    },
    {
      "link": "/images/shots/l/742228-creators-revenge-commodore-64-screenshot-finding-the-bomb.png",
      "caption": "Finding the bomb"
    },
    {
      "link": "/images/shots/l/742229-creators-revenge-commodore-64-screenshot-you-missed-the-bomb.png",
      "caption": "You missed the bomb so a city is destroyed"
    },
    {
      "link": "/images/shots/l/742230-creators-revenge-commodore-64-screenshot-fighting-the-mutants.png",
      "caption": "Fighting the mutants from the city"
    },
    {
      "link": "/images/shots/l/742231-creators-revenge-commodore-64-screenshot-destory-robots-to.png",
      "caption": "Destory robots to destroy the Creator"
    }
  ],
  "cover": []
}