{
  "name": "Deadly Evil",
  "shortName": "deadly-evil",
  "description": "You survived the onslaught and pillaging as a young boy from the attack by the monsters belonging to The Evil Ones who took the Princess child and the ancient scrolls that protected the land from them. Now you are a man, a warrior, who is the only man left in a land full of old people, women and children and you have vowed to return the scrolls and the Princess back to the people. You must first journey through a forest killing The Evil Ones monsters and collecting six pieces of the scrolls before entering a castle. Inside the castle you must kill more monsters as well as collect keys to open doors to rescue the Princess and escape from the castle to safety.<br><br><i>Deadly Evil</i> is a side view scrolling game with platform elements where the screen scrolls either to the left or right when you move your hero. Starting on the far left of the forest you must go walk to the right avoiding or killing monsters with your sword that attack you collecting pieces of the scroll you find. Obelisks scatter the land and must be avoided because if you touch one then a wizard appears firing at you for a brief moment. Once the six pieces of the scroll have been found you then enter the castle and once again keep walking to the right until you find the Princess. Once found, you must then take her out of the castle making sure she isn't killed. During the game, if you touch any monster, get hit by any weapon then you lose part of an energy gauge (a heart on the C64) and when this empties then it is game over. Once you have the Princess she also has an energy gauge.",
  "publishedBy": "Players Premier",
  "developedBy": "",
  "released": "1990",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/deadly-evil",
  "visual": "",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Players Premier",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "5 013728 004385",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/743402-deadly-evil-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/743403-deadly-evil-commodore-64-screenshot-enter-the-forest.png",
      "caption": "Enter the forest"
    },
    {
      "link": "/images/shots/l/743404-deadly-evil-commodore-64-screenshot-enemy-to-kill.png",
      "caption": "Enemy to kill"
    },
    {
      "link": "/images/shots/l/743405-deadly-evil-commodore-64-screenshot-piece-of-the-scroll.png",
      "caption": "Piece of the scroll"
    },
    {
      "link": "/images/shots/l/743406-deadly-evil-commodore-64-screenshot-inside-the-castle.png",
      "caption": "Inside the castle"
    },
    {
      "link": "/images/shots/l/743407-deadly-evil-commodore-64-screenshot-a-key-to-collect.png",
      "caption": "A key to collect"
    }
  ],
  "cover": []
}