{
  "name": "Di's Baby",
  "shortName": "dis-baby",
  "description": "After giving birth to Prince William, Prince Charles and Princess Diana of the British Royal Family have decided that they want another baby. <i>Di's Baby</i> is a collection of five games, from being tested at being a good parent to giving birth to the baby, each game has to be completed to move to the next one. There are no lives but a AF counter and every time you are hit by an object or touch one then this increases and when it reaches 1000 then it is game over. The five games are:<br><br>The Joys of Parenthood: Based on the arcade game <a href=\"https://www.mobygames.com/search/quick?game=Space+Invaders\">Space Invaders</a>, this game is a single screen side view shooter where you control the head and arm of Prince Charles at the bottom of the screen, moving left or right carrying a potty. Above Charles are four rows of potties moving across the screen and moving down one place when they reach the side of the screen. All the potties have to be removed by firing toilet rolls upwards at them while catching falling poo from Prince William in the potty he is carrying for extra points. A large toilet roll occasionally makes an appearance and has to be shot.<br><br>The Conception: A single screen platformer where Charles has to get from the top left of the screen down to the bottom left of the screen to Diana's bed so he can conceive the baby. As you make your way down the screen there are obstacles like a pram, guard and a camera that have to be avoided.<br><br>The Long Wait: Diana is now pregnant but she has to avoid all the paparazzi chasing her for nine months in this single screen shooter where you have to reach a number representing each month. As you go to the number you have to avoid or shoot many cameras and when you reach the number it changes to a new number in a new position.<br><br>The Dash to the Hospital: A top view scrolling driving game where the screen scrolls when you move the car and you have to get Diana to the hospital. As you drive through the streets you have to avoid a steering wheel as well as police barriers, striking miners and CND rallies.<br><br>The Delivery: Now in the hospital, Diana has to give birth in this single platformer where you have to get Diana from the bottom of the screen to the top climbing ladders. As you try to get up the screen, a large epidural needle moves around and must be avoided. Once you reach the top, a stork will drop your baby and you have to catch it.",
  "publishedBy": "Bad Taste Software",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "",
  "genre": "Action, Racing / driving",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/dis-baby",
  "visual": "",
  "gamePlay": "Arcade, Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Bad Taste Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/743833-di-s-baby-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/743834-di-s-baby-commodore-64-screenshot-remove-the-chamber-pots.png",
      "caption": "Remove the chamber pots and catch the poo"
    },
    {
      "link": "/images/shots/l/743835-di-s-baby-commodore-64-screenshot-get-to-diana-s-bed.png",
      "caption": "Get to Diana's bed"
    },
    {
      "link": "/images/shots/l/743836-di-s-baby-commodore-64-screenshot-avoid-the-paparazzi.png",
      "caption": "Avoid the paparazzi"
    },
    {
      "link": "/images/shots/l/743837-di-s-baby-commodore-64-screenshot-get-di-to-the-hospital.png",
      "caption": "Get Di to the hospital"
    },
    {
      "link": "/images/shots/l/743838-di-s-baby-commodore-64-screenshot-trying-to-give-birth.png",
      "caption": "Trying to give birth"
    }
  ],
  "cover": []
}