{
  "name": "Dragonriders of Pern",
  "shortName": "dragonriders-of-pern",
  "description": "Dragonriders of Pern is a strategy game with action sequences, based on the novels by Anne McCaffrey, with a strong emphasis on diplomacy. The game may be played by 1 to 4 players. You take on the role as a Weyrleader fighting the deadly Thread.<br><br>The game consists of two major phases: Negotiation/Intrigue, where you negotiate with Lord Holders or Craftsmasters, and Thread Fighting. where you fight the Thread from infesting your lands.<br><br>The strategic part is the main part of the game. Here you try to negotiate with Lord Holders of Craftsmasters to make allies in your fight against the Thread. You can facilitate negotiations by organizing special events: To win the confidence of a Lord Holder who fancies dragons, invite him to a Hatching. Weddings also provide opportunities to score diplomatic points. \nWhen diplomatic maneuvers fail you, you may be forced to resort to a duel -- a wounded leader is unable to take any actions for a long time --, but this may jeopardize your status with peaceful leaders. Finally, conclaves may be called up after certain events like the death of a Weyrleader. A Dragonrider conclave will cancel all ongoing events for all Weyrs. A Lord Holder conclave will only cancel events involving Lord Holders and the Master Harper. Time passes in realtime during the strategic phase, but you can pause the game.<br><br>Thread fighting occurs at the end of each year. During this phase of the game, you mount your dragons and you must pursue the falling Thread and char it in midair with the dragon's fiery breath before it lands. Miss a Thread and it may destroy you... or hit the ground and turn the land to dust. At the beginning of the game, you can select the difficulty of the Thread fighting or disable it entirely.<br><br>Dragon Riders of Pern ends after a certain number of turns (also to be selected at game beginning), when a player reaches a certain number of &quot;Victory Points&quot; awarded for forging alliances, or when a certain number of Holds are infested by threads.\n",
  "publishedBy": "Epyx, Inc.",
  "developedBy": "Connelley Group, The",
  "released": "Dec, 1983",
  "alsoFor": "Atari 8-bit | Combined View",
  "genre": "Action, Strategy / tactics",
  "perspective": "Side view, Text-based / spreadsheet, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/dragonriders-of-pern",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Epyx, Inc.",
          "developer": "Connelley Group, The",
          "ported": "",
          "country": " United States",
          "releaseDate": "Dec, 1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/245285-dragonriders-of-pern-commodore-64-screenshot-beginning-a-new.png",
      "caption": "Beginning a new game"
    },
    {
      "link": "/images/shots/l/245286-dragonriders-of-pern-commodore-64-screenshot-interrupting.png",
      "caption": "Interrupting the game to choose an action"
    },
    {
      "link": "/images/shots/l/245287-dragonriders-of-pern-commodore-64-screenshot-the-map.png",
      "caption": "The map"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/90922-dragonriders-of-pern-commodore-64-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/90923-dragonriders-of-pern-commodore-64-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/90924-dragonriders-of-pern-commodore-64-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Commodore 64"
    }
  ]
}