{
  "name": "Droids",
  "shortName": "droids_",
  "description": "An Environmental Defence Warden computer or EDWARD for short is on red alert mode after a electrical storm damaged the unmanned warship Arachnid it was controlling. EDWARD will now destroy anything that comes within range, problem is the planet Venus is less than 24 hours away and will be completely destroyed unless EDWARD is shut down. You have been given the mission of moving around the ship, deck by deck to shut each one down but this can only be achieved by destroying a certain amount of droids that move around the ship. The game is viewed from the side with the screen split into two of the various levels for each deck which need exploring for droids by using conveyor belts to move up or down a level. There are doors that take you to new a new level of a deck and transporters take you to a new deck. Each droid is on high alert for any intruders so you must shoot them a number of times while avoiding getting shot or touching the droids. Each time you are hit by a droid or shot then you lose part of an energy gauge and if this runs out then it is game over. <br><br>Scattered over the ship are computer terminals which you can access and give you various choices in your quest to shutdown each deck. You can see a map of the whole ship and it's decks which leads to a map of the levels of the deck you are on. You can play a little arcade game to give you full energy which has you trying to get a cursor from the top to the bottom of a box though gaps in bars moving left or right. If you touch a bar then you lose a life out of five and if all lives are gone then all terminals on the deck cannot be used to gain energy. Your final option is the shutdown of the actual deck which can only be accessed when you have destroyed enough droids. It is a mastermind type game where you have a five rows of five columns and you have to turn on the circles in the correct pattern. Once you try the first row the computer tells you how many are correct but you lose energy for every wrong guess. Guess the pattern correctly and you can move to the next deck but you can access the game again when you have had five guesses.",
  "publishedBy": "Anglosoft",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/droids_",
  "visual": "",
  "gamePlay": "Arcade, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Anglosoft",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/744119-droids-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/744120-droids-commodore-64-screenshot-lets-save-the-planet-venus.png",
      "caption": "Lets save the planet Venus"
    },
    {
      "link": "/images/shots/l/744121-droids-commodore-64-screenshot-on-a-computer-terminal.png",
      "caption": "On a computer terminal"
    },
    {
      "link": "/images/shots/l/744122-droids-commodore-64-screenshot-the-decks-of-the-ship.png",
      "caption": "The decks of the ship"
    },
    {
      "link": "/images/shots/l/744124-droids-commodore-64-screenshot-attempting-to-get-more-energy.png",
      "caption": "Attempting to get more energy"
    },
    {
      "link": "/images/shots/l/744123-droids-commodore-64-screenshot-two-droids-to-destroy.png",
      "caption": "Two droids to destroy"
    }
  ],
  "cover": []
}