{
  "name": "Eagles",
  "shortName": "eagles",
  "description": "<i>Eagles</i> is a game that simulates the dogfights and melees that occurred in the skies over France and Germany in the latter half of WWI. There are three scenarios to choose from at the start of game: <i>Over There</i>, <i>Voss's Last Fight</i> and <i>Red And Black</i>. In addition, there are four different mini-games to choose from: <i>Bloody April</i>, <i>Sausage Run</i>, <i>Contact Patrol</i> and <i>The Eleventh Hour</i>. <br><br>During game play, you will face many of the situations that the period's pilots had to face. A dogfight in Eagles can involve as many as twenty planes. Each aircraft will have an ID number on them running from 1-20. 1-10 are always the Allied aircraft and 11-20 are the Germans. Play proceeds in rounds from the lowest number aircraft going first and continuing all the way up to the highest number aircraft doing the last move. Play continues in this fashion until all planes have been shot down or returned to base. The play field is defined in squares running north, south, east and west. Each square represents an area roughly 50 yards on a side. There is also a third dimension of squares, which is altitude. Each level of altitude is 25 feet high. Pilots can see targets four squares out and can fire their weapons one square out. Weather conditions, like clouds and wind, will also play a factor in game play.<br><br>At the end of each game, scores show how many kills were made, the time frame for completing each mission and ranks. Ranks are determined on successful missions you have completed. There is also an optional section for creating your own planes at the beginning of the game.",
  "publishedBy": "Strategic Simulations, Inc.",
  "developedBy": "",
  "released": "Oct, 1983",
  "alsoFor": "Apple II, Atari 8-bit | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/eagles",
  "visual": "",
  "gamePlay": "Wargame",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Strategic Simulations, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct, 1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/563032-eagles-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading screen."
    },
    {
      "link": "/images/shots/l/563033-eagles-commodore-64-screenshot-credits.png",
      "caption": "Credits."
    },
    {
      "link": "/images/shots/l/563034-eagles-commodore-64-screenshot-one-of-many-options.png",
      "caption": "One of many options."
    },
    {
      "link": "/images/shots/l/563035-eagles-commodore-64-screenshot-guns-firing.png",
      "caption": "Guns firing."
    },
    {
      "link": "/images/shots/l/563036-eagles-commodore-64-screenshot-looking-for-the-enemy.png",
      "caption": "Looking for the enemy."
    }
  ],
  "cover": []
}