{
  "name": "El Hobbit (Vah-ka's Cut)",
  "shortName": "el-hobbit-vah-kas-cut",
  "description": "<i>El Hobbit (Vah-ka's Cut)</i> is a game made for the 2012 Bytemaníacos competition where the goal was to create a 48K game based on the <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,47273/\">J. R. R. Tolkien's</a> book <i>The Hobbit</i>. The game won third place. The overall story interprets the source material with some liberties and twists. Bilbo the Hobbit receives a visit from the Gandalf the wizard. He tells the hobbit about a big treasure in a cave guarded by the pink dragon Smaug. Gandalf does not know how to open the cave, but he tells there is a bald, grumpy man called Gollum in the forest who has a ring that turns you invisible when you wear it. That could be the only way to get to the treasure.<br><br>Once outside the house players guide Bilbo through different environments. They consist of single-screen rooms connected both horizontally and vertically using the flip-screen mechanic to offer an amount of freedom. Bilbo has no means to attack, so enemies such as snakes need to be avoided. He starts with five lives (represented as apples) and every enemy collision removes one. Tasks Bilbo needs to include finding Gandalf, gathering thirteen dwarves, locating the ring, avoiding and sneaking past Gollum and finally stealing the treasure. Bilbo can wear the ring, turning him both invisible and invincible, but he gets dizzy when he wears it too long.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Jan 04, 2013",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/el-hobbit-vah-kas-cut",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 04, 2013",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}