{
  "name": "ELIMIN8!",
  "shortName": "elimin8",
  "description": "<i>ELIMIN8!</i> was developed for the <a href=\"http://www.minigamecomp.org.uk/\">annual Mini Game Competition</a> and was an entry for the 1k size category.<br><br>You control a bomber which has to destroy 9 cities polluted by radiation. On each of the 9 levels, you fly to the right, over one of the cities; buildings which disappear to the left of the screen reappear on the right side. Due to the radiation your engines have limited power and you're slowly drifting towards the ground. You have to destroy the buildings quickly so that you won't bump into one. Crashing into a building or the ground is game over. Each level ends when all the buildings have been destroyed. <br><br>You can control your plane with a joystick by moving it left and right. Pressing FIRE drops a laser shot from the plane; the laser shot destroys any section of buildings it touches. <br><br>You receive score for destroying the buildings. When you destroy a building, you get 1 point. If you manage to destroy another, you receive 2 points; the third destroyed building gives you 3 points etc. This is however reset back to 1 point if your laser shot misses or when you start a new level. ",
  "publishedBy": "",
  "developedBy": "",
  "released": "Jul 27, 2008",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/elimin8",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/357056-elimin8-commodore-64-screenshot-start-of-game.png",
      "caption": "Start of game"
    },
    {
      "link": "/images/shots/l/357057-elimin8-commodore-64-screenshot-almost-all-buildings-destroyed.png",
      "caption": "Almost all buildings destroyed"
    },
    {
      "link": "/images/shots/l/357058-elimin8-commodore-64-screenshot-crashed-into-the-last-remaining.png",
      "caption": "Crashed into the last remaining building! So close, and yet so far..."
    },
    {
      "link": "/images/shots/l/357059-elimin8-commodore-64-screenshot-the-second-level.png",
      "caption": "The second level"
    }
  ],
  "cover": []
}