{
  "name": "Fairy Well",
  "shortName": "fairy-well",
  "description": "<i>Fairy Well</i> is a side view flick-screen maze game where you play the role of one of three fairies who have been tasked to rescue four Princesses living in the Forest by the Dark Wizard of the Underground over various levels. Before you start your rescue attempt, you can select a fairy from Knight, Queen or King with each having various levels of abilities form sword range, speed of movement, strength of armour and limited or unlimited flying. Each level has you attempting to rescue one of the Princesses by collecting three crystals before making your way to a well to fight for the Princess. <br><br>As you fly you will encounter various creatures and these can be avoided or shot with your sword, and if touched then you lose one of your hearts and when all hearts are gone then it is game over. A gauge at the bottom of the screen shows you how much power you have to fly and when you fly this decreases and you fall to Earth when empty. Not flying allows the gauge to fill but if you have unlimited flying then it never empties. Scattered around the levels are shops which can be entered to buy various items to help you and these are keys, life restore, area map, power shield, crystal eye and master key but all cost currency which can be collected in chests or killing a creature. <br><br>Chests can be found for gold or silver and other items but keys are needed to open them. A map can be shown at any time but this only shows you where you have been but if you buy an area map then you can see the maze and with a bought crystal eye then you can also see the locations of the crystals. Once the three crystals have been collected then the location of the well is shown. Once you reach the well then you are moved to a single screen and you have to fight a boss to rescue the trapped Princess and when she is freed then it's on to the next area to find another Princess.",
  "publishedBy": "RGCD.DEV Ltd",
  "developedBy": "Wide Pixel Games",
  "released": "May 06, 2012",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/fairy-well",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "RGCD.DEV Ltd",
          "developer": "Wide Pixel Games",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "May 06, 2012",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "https://www.mobygames.com/images/shots/l/744993-fairy-well-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/744994-fairy-well-commodore-64-screenshot-select-fairy.png",
      "caption": "Select Fairy"
    },
    {
      "link": "/images/shots/l/744995-fairy-well-commodore-64-screenshot-the-first-princess-to-be.png",
      "caption": "The first Princess to be rescued"
    },
    {
      "link": "/images/shots/l/744996-fairy-well-commodore-64-screenshot-shoot-or-avoid-the-creature.png",
      "caption": "Shoot or avoid the creature"
    },
    {
      "link": "/images/shots/l/744997-fairy-well-commodore-64-screenshot-in-a-shop.png",
      "caption": "In a shop"
    },
    {
      "link": "/images/shots/l/744998-fairy-well-commodore-64-screenshot-you-have-a-key.png",
      "caption": "You have a key"
    },
    {
      "link": "/images/shots/l/744999-fairy-well-commodore-64-screenshot-map-of-the-cave.png",
      "caption": "Map of The Cave"
    },
    {
      "link": "/images/shots/l/745000-fairy-well-commodore-64-screenshot-fighting-for-the-first.png",
      "caption": "Fighting for the first Princess"
    }
  ],
  "cover": []
}