{
  "name": "The Farmer's Daughter",
  "shortName": "farmers-daughter",
  "description": "The farmer's daughter is the eternal complement to the traveling salesman in American folklore and humour, practically Jungian archetypes licking their lips and circling each other warily while trying to figure out how to avoid the shotgun wedding neither party wants their hot-blooded fling to result in.<br><br>Your car broken down near a farm in the middle of nowhere, now you are thrust into the joke and things are a lot less funny when it's <i>your</i> ass on the line.  Not only do you have to navigate around the ornery farmer and his itchy boomstick finger, but your travails are complicated by elements hitherto untapped in the shaggiest dog telling of the joke -- two inbred hick brothers straight out of <i>Deliverance</i> and a mean farm dog with an appetite for sausage.  All that plus you're working against the clock, the minutes ticking away until the garage comes to tow your vehicle and remove you from this den of the dangerous temptation you can't quite permit yourself to forego.<br><br>Fortunately, the farm is full of nooks and crannies, well-stocked with all the objects you will need to use to distract or disable your obstructing antagonists... unfortunately, coordinating their movements will prove such a labyrinthine process that the game player is guaranteed to die a dozen deaths before eventually determining the convoluted route to this joke's eternal punchline.",
  "publishedBy": "Nocturnal Software",
  "developedBy": "Nocturnal Software",
  "released": "1988",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/farmers-daughter",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Nocturnal Software",
          "developer": "Nocturnal Software",
          "ported": "",
          "country": " United States",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/476133-the-farmer-s-daughter-commodore-64-screenshot-beginning-of.png",
      "caption": "Beginning of the game, your car just broke down."
    },
    {
      "link": "/images/shots/l/476134-the-farmer-s-daughter-commodore-64-screenshot-meeting-the.png",
      "caption": "Meeting the farmer's daughter"
    }
  ],
  "cover": []
}