{
  "name": "Firefly",
  "shortName": "firefly",
  "description": "In the game, you, as commander of the Firefly, must destroy the 'mechanoid system framework' that your enemy has created by destroying its energy source.<br><br>The framework is represented as a grid of squares or sectors.  Ultimately you must reach and destroy the power source, at the far right of the grid, whilst at the start of the game you only have access to the 'dead zone', at the far left of the grid, and those squares immediately adjacent.  This can be extended as described below.<br><br>Planetary sectors are systems with planets in them, and cannot be entered as they are the enemy's main colonies, so are too well defended.  Thus they block the path.<br><br>Unconstructed regions can be taken over, turning them into part of the dead zone, by bypassing the 'instrusion detection' alarm system.  The system involves the cursor flicking between 'thumbs up' and 'thumbs down' symbols, and you must press fire when 'thumbs up' is displayed to take over the system.  A thumbs down will scramble the squares on the grid.<br><br>The main part of the game takes place when you try to take over an occupied zone.  Here the game is a shoot-em-up, where you can move freely in two dimensions, and shoot at your enemies.  Your ammunition orbits you, and when fired takes a moment to come back to you, so you can temporarily run out of ammo if you fire too quickly.  .<br><br>In an occupied zone there are 4 energy points that you must destroy.  To destroy an energy source you must collect 4 zokas, or excess energy units from it, then enter, and select a thumbs up as  the cursor alternates between it and a thumbs down.  The cursor alternates more quickly in successive energy points.  <br><br>Teleports can be used, to move between areas, but when you attempt to use one, your ship rotates whilst pointing at a set of alternating green and red dots in a circle.  You must hit the fire button 3 times in succession, when the ship is pointing at a green dot, with the ship spinning faster each time. <br><br>If you take too much damage your ship explodes, and you lose a life, and re-enter the grid, with the occupied zone still occupied.  However, if you successfully destroy all 4 energy points, the occupied zone becomes part of the dead zone as you re-enter the grid.",
  "publishedBy": "Ocean Software Ltd.",
  "developedBy": "Special FX Software Ltd.",
  "released": "1988",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/firefly",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Ocean Software Ltd.",
          "developer": "Special FX Software Ltd.",
          "ported": "",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "1988",
          "ean13": "5 013156 012365",
          "comments": "Cassette tape release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/96698-firefly-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/96704-firefly-commodore-64-screenshot-a-map-of-the-grid.png",
      "caption": "A map of the grid"
    },
    {
      "link": "/images/shots/l/96705-firefly-commodore-64-screenshot-you-are-dead.png",
      "caption": "You are dead"
    },
    {
      "link": "/images/shots/l/96706-firefly-commodore-64-screenshot-select-a-green-dot-three-times.png",
      "caption": "Select a green dot three times to teleport"
    },
    {
      "link": "/images/shots/l/96707-firefly-commodore-64-screenshot-picking-up-a-zoka-4-are-needed.png",
      "caption": "Picking up a zoka - 4 are needed to access an energy point"
    }
  ],
  "cover": []
}