{
  "name": "Flying Ace",
  "shortName": "flying-ace",
  "description": "Supply chain disruption is the goal of this side-scroller. Loop around in your sturdy biplane and strafe enemy trucks rolling along on the road below. There are patrol planes and anti-aircraft guns, to be certain, but success or failure is decided by the number of trucks you destroy. Fail to get enough, and your supply -- of spare biplanes -- goes down. Of course, rack up enough points, and your supply of planes increases. You'll need them, since not long into your flight, bullets are flying everywhere and chewing up your plane. A counter ticks off the hits at the bottom of the screen right next to the score. At nine, your plane drops like a rock.<br><br>Fuel and ammo are not a problem; a friendly airstrip will come along at the right time. Friendly from the sky, that is. When you get right down to it, at the wrong angle or a bit too late, that airstrip can be as unfriendly as any other patch of hard ground. The ground may be the most dangerous thing on the screen, since you must dive sharply to strafe the supply trucks, and there's scant room for the loops required to out-maneuver enemy pilots. When that becomes easy, their skill can be upped with two more levels of difficulty.",
  "publishedBy": "Avalon Hill Game Company, The",
  "developedBy": "Microcomputer Games, Inc.",
  "released": "1983",
  "alsoFor": "Atari 8-bit, PC-88 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/flying-ace",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Avalon Hill Game Company, The",
          "developer": "Microcomputer Games, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1036232-flying-ace-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/1036233-flying-ace-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/1036234-flying-ace-commodore-64-screenshot-plane-on-my-six.png",
      "caption": "Plane on my six!"
    }
  ],
  "cover": []
}