{
  "name": "Halls of Death",
  "shortName": "halls-of-death",
  "description": "<i>Halls of Death</i> is an adventure game where you play the role of one of many explorers who have entered the caverns and rooms over many floors, searching for the treasure within, the only difference hopefully is that you make it out alive. The screen is split into five different parts with two parts text, one a map of the floor you are on, your stats and finally what you can see in front off you or the creature you are fighting. Starting at the bottom of some steps, you move around the map searching each room and text tells you what you see and how many turns you have taken. <br><br>As you explore, some rooms will have traps, some will have treasure and others will have a creature or monster that wants to fight you seen from the side. You have a certain level of strength and psionics (magic) and you can either swing at the creature, retreat or use one of four spells which are sleep, teleportation, lighting and fireball. Spells sometimes don't work and can sometimes rebound and hit yourself. You both take it in turns to fight and it is game over if you lose all your strength. You can move your different levels of strength and psionics between each other as you avoid either reaching zero. Another level you have is constitution and this decreases as you explore further into the Halls of Death and so you need to return to the surface to rest.",
  "publishedBy": "Supersoft",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/halls-of-death",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Supersoft",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/747823-halls-of-death-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/747824-halls-of-death-commodore-64-screenshot-explore-the-halls-of.png",
      "caption": "Explore the Halls of Death"
    },
    {
      "link": "/images/shots/l/747825-halls-of-death-commodore-64-screenshot-found-a-trap.png",
      "caption": "Found a trap"
    },
    {
      "link": "/images/shots/l/747826-halls-of-death-commodore-64-screenshot-in-combat.png",
      "caption": "In combat"
    }
  ],
  "cover": []
}