{
  "name": "Harbour Attack",
  "shortName": "harbour-attack",
  "description": "Your mission in <i>Harbour Attack</i> is to take control of a submarine and attempt to get to the enemies Harbour before attempting to destroy a cargo ship over three single screen stages. The stages consist off:<br><br><b>Stage One:</b> Viewed from the side you must get the submarine from the left of the screen to the right while avoiding touching mines or nets before your air supply runs out. You are only able to move so far down and if your depth gauge turns red then any further down destroys your sub. Touching a mine, net, running out of air or going too far down loses you a life (five lives on the C64, four on the C16).<br><br><b>Stage Two:</b> Viewed from the side and a depth gauge to watch out for again, you must now destroy a certain amount of planes and ships (an octopus needs to be killed or avoided on the C64). You can only fire on the surface and this will also increase your air supply that decreases under the water. The ships will fire torpedoes and depth charges while the planes drop bombs. Hitting a ship, being hit by a weapon, running out of air or going down too far loses a life.<br><br><b>Stage Three:</b> The final stage has you in a harbour and the view now switches to a 1st person perspective. Your bow of the ship is at the bottom of the screen and the cargo ship that needs destroying is at the back of the screen. You must fire a torpedo into the screen and steer it to hit a cross on the cargo ship while avoiding hitting barges that move across the screen. You must destroy the cargo ship before your air supply runs out and if you don't then you lose a life.",
  "publishedBy": "Commodore Business Machines (UK) Ltd.",
  "developedBy": "Mr. Micro Ltd.",
  "released": "1984",
  "alsoFor": "Commodore 16, Plus/4 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/harbour-attack",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Commodore Business Machines (UK) Ltd.",
          "developer": "Mr. Micro Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/718032-harbour-attack-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/718033-harbour-attack-commodore-64-screenshot-avoid-the-nets-and.png",
      "caption": "Avoid the nets and mines"
    },
    {
      "link": "/images/shots/l/718034-harbour-attack-commodore-64-screenshot-shoot-the-planes-ships.png",
      "caption": "Shoot the planes, ships and octopus"
    },
    {
      "link": "/images/shots/l/718035-harbour-attack-commodore-64-screenshot-destroy-the-cargo-ship.png",
      "caption": "Destroy the cargo ship"
    }
  ],
  "cover": []
}