{
  "name": "Hawaiian Odyssey: Scenery Adventure",
  "shortName": "hawaiian-odyssey-scenery-adventure",
  "description": "Hawaiian Odyssey Scenery Adventure is a scenery add-on for <a href=\"https://www.mobygames.com/game/flight-simulator-ii\">subLOGIC Flight Simulator II</a> for Atari ST, Amiga, Commodore 64 and IBM PC series computers. This Scenery Disk covers the nine major islands of Hawaii, focussing on Honolulu, Pearl Harbor and the Mauna Loa volcano. It differs from the regular Scenery Disks in that it includes a scenery adventure to explore the beautiful Hawaiian islands. Experimental Scenery Locations support this adventure, and can be chosen as take off locations. One of these locations will throw the pilot in a time/space warp... Seventeenth-century ship, Seven Portals, 8,000 foot keyboard, and goddess Pele, are few keywords that describe this adventure.<br><br>Scenery Disks such as this one allow the pilot to experience an enhancement of the flying environment through added landmarks, visual details and navaids. They are derived using National Oceanic and Atmospheric Administration Sectional Aeronautical Charts and Airport/Facility Directories. Scenery Disks can also be used with subLOGIC UFO, Jet simulator and Stealth Mission. <br><br>There are twelve other Scenery Disks that cover the continental US, and two additional Scenery Disks cover Western Europe and Japan. Additionally there are Star Scenery Disks that cover a specific area in great detail such as San Francisco.",
  "publishedBy": "subLOGIC",
  "developedBy": "",
  "released": "1989",
  "alsoFor": "Amiga, Atari ST | Combined View",
  "genre": "DLC / add-on",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/hawaiian-odyssey-scenery-adventure",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "subLOGIC",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/902433-hawaiian-odyssey-scenery-adventure-commodore-64-screenshot.png",
      "caption": "Hawaiian Odyssey v1.0"
    },
    {
      "link": "/images/shots/l/902434-hawaiian-odyssey-scenery-adventure-commodore-64-screenshot.png",
      "caption": "A mountain in the distance"
    }
  ],
  "cover": []
}