{
  "name": "Hi Bouncer!",
  "shortName": "hi-bouncer",
  "description": "In this action game with the Mr. Men characters from Roger Hargreaves' children's books you control the cartwheeling Mr. Bounce who has to help out various Mr. Men characters in distress. There are four main screens, each of which has eight versions which increase in difficulty;<br><br>Screen 1: Mr. Tall can't reach down to pick up his scarf and then his gloves, so Mr. Bounce needs to retrieve them and return them to Mr. Tall. In the later levels, Mr. Bounce has to dodge falling fruit.<br><br>Screen 2: Mr. Lazy is too lazy to finish his house so Mr. Bounce needs to help him, while avoiding the puddle, by jumping on the seesaw and catapulting the windows into place.<br><br>Screen 3: Mr. Bump is too bruised to pick more fruit from the trees, so Mr. Bounce has to catch the falling fruit, while avoiding the puddle again, and putting the fruit in the basket.<br><br>Screen 4: Mr. Snow is melting because of the lack of shade, so Mr. Bounce has to collect clouds and prevent being hit by the birds.<br><br>Mr. Bounce needs to avoid bumping into any of his friends by jumping over them. Otherwise he will be bouncing around the screen and lose one of his four lives. Luckily, there is also a practice program with seven levels of difficulty. ",
  "publishedBy": "Mirrorsoft Ltd.",
  "developedBy": "H&amp;H Software",
  "released": "1984",
  "alsoFor": "BBC Micro | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/hi-bouncer",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Mirrorsoft Ltd.",
          "developer": "H&amp;H Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1003203-hi-bouncer-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1003229-hi-bouncer-commodore-64-screenshot-choices-practising-the.png",
      "caption": "Choices: Practising the game with the seven levels of difficulty or Play the game (Arcade)"
    }
  ],
  "cover": []
}