{
  "name": "I-Xera",
  "shortName": "i-xera",
  "description": "A highly explosive and pretty logo has fell off the Empire's flagship and landed in a soap-bubble factory splitting into four pieces. You have been sent with the latest military robot suit and weapon into the factory to retrieve the pieces. Before the pieces can be collected you must find the Mini Interdimensional Storage Unit to carry pieces of the logo found, as well as any other objects to help you in your mission. <br><br>As you explore the side view flick-screen factory there are various creatures and bubbles moving about and if you touch any then you lose power in your battery which is shown by a gauge. These can be avoided or shot but your weapon can overheat which you will be unable to shoot for a short time so you must keep an eye on your temp gauge. If your battery runs out then it is game over but scattered around the factory are battery charges and when used bring up a mini-game. This shows a battery and a various amount of switches. Each switch will light up very quickly and randomly and you must press the fire button at the right time to charge your battery. You have five goes before the battery charger disappears.<br><br>In certain places there are ION gates blocking your route which can only be opened by a switch situated in a different part of the factory and once pulled keeps the gate open. Also to be found is a spanner and this can be used to open up pipes. As well as your main playing area you can see your two gauges and your score. A joystick is used to control your hero.",
  "publishedBy": "Power House, The",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/i-xera",
  "visual": "",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Power House, The",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/690976-i-xera-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/690977-i-xera-commodore-64-screenshot-lets-get-the-logo.png",
      "caption": "Lets get the logo."
    },
    {
      "link": "/images/shots/l/690978-i-xera-commodore-64-screenshot-exploring-the-factory.png",
      "caption": "Exploring the factory."
    },
    {
      "link": "/images/shots/l/690979-i-xera-commodore-64-screenshot-recharge-your-battery.png",
      "caption": "Recharge your battery."
    },
    {
      "link": "/images/shots/l/690980-i-xera-commodore-64-screenshot-a-switch-to-open-a-gate.png",
      "caption": "A switch to open a gate."
    },
    {
      "link": "/images/shots/l/690981-i-xera-commodore-64-screenshot-found-a-battery-charger.png",
      "caption": "Found a battery charger."
    }
  ],
  "cover": []
}