{
  "name": "Ice Hunter",
  "shortName": "ice-hunter",
  "description": "<i>Ice Hunter</i> is a single screen platformer where you play the role of Thorak the Eskimo, Prince of Ice, who is searching for blocks to make a special igloo. Finally in his search, Thorak has found a multi-level cave containing the blocks he needs for the igloo, so enters to retrieve them. The only way to get the blocks to his site for the igloo is to get two blocks, one at a time to a stream at the bottom of the cave, then stand on them to float down the stream. The main problem though is the creatures that move around the screen and these have to be avoided or if touched he loses one of four lives. The creatures though can be killed by dropping a block on top of them or allowing them to fall through the gaps. A bird that occasionally appears can be killed if its flight path is blocked. <br><br>To get the blocks to the bottom of the screen there are platforms over gaps and to get a gap Thorak can walk on the platform to remove it then drop blocks through the gap to the level below. Thorak can't fall through the gaps or he is killed but there are pillars that can be climbed up or down. At a certain level in the cave, Thorak can't get back up so he has to make sure he has two blocks to move to the stream. A power-pill can be collected and these stuns the creatures which can be touched to remove them. Once the blocks are floated away then it's off to the next cave with more creatures and the levels start to scroll slowly to the left and appear again on the right of the screen.",
  "publishedBy": "Anirog Software Ltd.",
  "developedBy": "Tequila Sunrise Software",
  "released": "1984",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/ice-hunter",
  "visual": "",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Anirog Software Ltd.",
          "developer": "Tequila Sunrise Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/749238-ice-hunter-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/749239-ice-hunter-commodore-64-screenshot-collect-the-ice-blocks.png",
      "caption": "Collect the ice blocks"
    },
    {
      "link": "/images/shots/l/749240-ice-hunter-commodore-64-screenshot-getting-a-block-to-the.png",
      "caption": "Getting a block to the stream"
    },
    {
      "link": "/images/shots/l/749241-ice-hunter-commodore-64-screenshot-made-it-to-your-igloo.png",
      "caption": "Made it to your igloo"
    }
  ],
  "cover": []
}