{
  "name": "James Herbert's The Rats",
  "shortName": "james-herberts-the-rats",
  "description": "Based on the novel by James Herbert, The Rats is a game combining strategy elements and a text adventure as you control various characters in the battle to control and kill a huge swarm of rats overrunning London. If the rats spread further than London into the rest of Britain then it is game over. You start the game as Foskins looking at a map of London with white squares flashing showing reported sightings of rats. Here you can see the report, deploy forces or enable research with Howard. <br><br>You have various forces to deploy to infected areas like rat-killers, police, firemen or the Army (a last resort) and these must be managed carefully as you only have a limited amount. You have limited equipment that can be used as well and these include offence equipment like gas, rifles and dogs as well as defences like shields and suits. Certain equipment can only be used by certain types of forces. As you deploy you can initiate research with Howard and this includes origins, defence, offence and nature.<br><br>As you battle to save London with Foskins, occasionally the adventure part of the game interrupts and you can take the role of major characters like Harris, Howard and Foskins as well as minor characters from the book like Pauline Blakely trying to save herself and her baby. The situation each character find themselves in, is an encounter with the rats and their battle for survival. The screen has text describing the situation and there are various options to select like goto, take and attack and as this part is real-time you don't have long to make these decisions or face death with graphics of rats attacking the screen.<br><br>Letting the rats spread from London, the major characters dying or your forces depleted means it's game over and you receive your score. The keyboard is used to control the game.<br><br>",
  "publishedBy": "Hodder and Stoughton Software",
  "developedBy": "",
  "released": "1985",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Adventure, Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/james-herberts-the-rats",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Hodder and Stoughton Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1985",
          "ean13": "9 780340 384855",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/674783-james-herbert-s-the-rats-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/674784-james-herbert-s-the-rats-commodore-64-screenshot-map-of-london.png",
      "caption": "Map of London."
    },
    {
      "link": "/images/shots/l/674785-james-herbert-s-the-rats-commodore-64-screenshot-a-minor-character.png",
      "caption": "A minor character attacked by rats."
    },
    {
      "link": "/images/shots/l/674786-james-herbert-s-the-rats-commodore-64-screenshot-reported.png",
      "caption": "Reported sighting."
    },
    {
      "link": "/images/shots/l/674787-james-herbert-s-the-rats-commodore-64-screenshot-deploying.png",
      "caption": "Deploying forces."
    },
    {
      "link": "/images/shots/l/674788-james-herbert-s-the-rats-commodore-64-screenshot-trying-to.png",
      "caption": "Trying to save Pauline and her baby."
    },
    {
      "link": "/images/shots/l/674789-james-herbert-s-the-rats-commodore-64-screenshot-research.png",
      "caption": "Research."
    }
  ],
  "cover": []
}