{
  "name": "Kami-Kaze",
  "shortName": "kami-kaze",
  "description": "<i>Kami-Kaze</i> is a side view single screen shooter where you control a battle-cruiser of the Xenon Fleet at the top of the screen as you stun humans and dogs below with your weapon below to stop them destroying battle plans. This was because one of the cruisers, Argon was forced to land on Earth and on the pier in Cleethorpes, England. The cruiser was equipped with psycho-visual shields which prevents other races from seeing the ships and see something more familiar instead. The cruiser has made itself look like toilets and so the humans are walking to the cruiser from either side of the screen to use it. To make matters worse, the battle plans for the fleet have also changed and now look like toilet paper which the humans are using.<br><br>Dogs in the local area are starting to copy famous toilet paper adverts by grabbing the plans and taking them back to the edge of the screen. You have to keep the humans from entering the cruiser by moving around the screen but if you shoot a dog with paper then the RSPCA send a helicopter to shoot you. Your cruiser is a delicate machine and if you are hit by the helicopter or touch other items like the pier, the cruiser you are protecting, or a cloud then you lose one of five lives. Jet-planes also make an appearance and must be shot or avoided. A life is also lost if the plans are completely destroyed shown by a counter.",
  "publishedBy": "Supersoft",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/kami-kaze",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Supersoft",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/749927-kami-kaze-commodore-64-screenshot-stun-the-humans.png",
      "caption": "Stun the humans"
    },
    {
      "link": "/images/shots/l/749926-kami-kaze-commodore-64-screenshot-the-plans-are-being-taken.png",
      "caption": "The plans are being taken"
    },
    {
      "link": "/images/shots/l/749985-kami-kaze-commodore-64-screenshot-start-screen.png",
      "caption": "Start Screen"
    }
  ],
  "cover": []
}