{
  "name": "Kettle",
  "shortName": "kettle_",
  "description": "You play the role of a flying <i>Kettle</i> as you attempt to escape from 30 levels in an underground system viewed from the side which scrolls when you move. Each level has an exit but this can only be opened when you find a tin opener which is hidden in a Bowel. There are various Bowels scattered over a level but only one will leave behind a tin opener when destroyed, with the other Bowels leaving behind an alien, bonus or a jug to replenish energy. Each bowel though emits bubbles and when touched decreases your energy, which is also lost if a discovered alien touches you. If you run out of energy then it is game over.<br><br>To help you in your quest to escape, you are armed with a Crizza, which circles around your <i>Kettle</i> and will destroy any bubbles that hit it or a discovered alien which takes multiple hits. You can also send your Crizza forward by holding down the fire button to destroy bubbles and aliens. With your Crizza you must hit a bowel ten times to destroy it which then leaves behind a diamond and when this is destroyed it hopefully leaves behind the tin opener needed.<br><br>Two players are able to play at the same time with a split screen and each player can either co-operate or leave the other player to do the work and nip in to get the bonuses and items. Before the game starts you can select either level one or four to start from and if you complete level four then you have the option to start on higher levels on your next game.",
  "publishedBy": "Alligata Software Ltd.",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "Amstrad CPC | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/kettle_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Alligata Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/690837-kettle-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading Screen."
    },
    {
      "link": "/images/shots/l/690838-kettle-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/690839-kettle-commodore-64-screenshot-start-of-the-game.png",
      "caption": "Start of the game."
    },
    {
      "link": "/images/shots/l/690840-kettle-commodore-64-screenshot-both-players-hitting-the-bowel.png",
      "caption": "Both players hitting the Bowel."
    },
    {
      "link": "/images/shots/l/690841-kettle-commodore-64-screenshot-the-exit-is-open.png",
      "caption": "The exit is open."
    },
    {
      "link": "/images/shots/l/690842-kettle-commodore-64-screenshot-both-players-have-found-a-different.png",
      "caption": "Both players have found a different Bowel."
    }
  ],
  "cover": []
}