{
  "name": "Lala: Prologue",
  "shortName": "lala-prologue",
  "description": "<i>Lala: Prologue</i> is a 2D platform game about the girl Lala who wants to become a witch. She joins the Great Witch Academy, led by Mistress Morgana la Marrana. Lala was taught the basics of magic, but turns out not to be a very good student. While Morgana is off on an errand one day, Lala starts to toy with the machines and magic filters in the academy. To hide her experiments, she opens the window to let some fresh air in, but suddenly all pots with magical filters and chemicals fly off. The player needs to help Lala by collecting the 25 scattered potions.<br><br>The game consists of several single-screen rooms linked together both horizontally and vertically offering some space for exploration. Lala can freely move around and needs to navigate platforms, avoiding enemies such as bats and spiders because she cannot defeat them, and spikes. She has 99 health at the start of the game and every collision with an enemy or hazard causes it to drain. This can go very quickly if Lala stays in contact and is not moved away quickly enough.<br><br>Later versions of the game have some changes to the level lay-out. The health system is then also replaced with lives. Lala only has a small number, but with a short recovery period after being hit instead of risking to lose a lot of health at once. Some health or lives can be replenished by picking up heart-shaped lollipops that appear in rooms already visited after collecting some potions. There are 25 potions in total to collect and the game's HUD shows how many are left to be found. Some gates to progress can only be opened after picking up a key first. When all potions are collected the game ends right away.",
  "publishedBy": "Hokuto Force",
  "developedBy": "Mojon Twins, The",
  "released": "Apr 03, 2019",
  "alsoFor": "Amstrad CPC, Commodore 16, Plus/4, DOS, VIC-20, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/lala-prologue",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Hokuto Force",
          "developer": "Mojon Twins, The",
          "ported": "Digital Monastery",
          "country": " Worldwide",
          "releaseDate": "Apr 03, 2019",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/980364-lala-prologue-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/980365-lala-prologue-commodore-64-screenshot-the-first-room-of-the.png",
      "caption": "The first room of the game"
    },
    {
      "link": "/images/shots/l/980366-lala-prologue-commodore-64-screenshot-a-key-is-needed-here.png",
      "caption": "A key is needed here to open the purple gate."
    },
    {
      "link": "/images/shots/l/980367-lala-prologue-commodore-64-screenshot-timing-for-a-platform.png",
      "caption": "Timing for a platform jump."
    }
  ],
  "cover": []
}