{
  "name": "Loco",
  "shortName": "loco_",
  "description": "<i>Loco</i> is a side view horizontal scrolling game where the screen scrolls from left to right constantly as you control a steam locomotive trying to collect flags over five levels. The main playing area has you looking at your locomotive as it pulls away from a station and you must blast and destroy the various vehicles that are planes, airships and trains, when their cross your path. Below the main playing area is a map of the various tracks that can be driven on and you use up or down to change tracks when they meet. <br><br>The map also shows the various vehicles as they approach your locomotive and you can use smoke to hit the aerial vehicles by holding the fire button down for various heights, and letting go has the smoke move to the left of the screen. To destroy the trains on the track you press right to shoot a cannon when the trains are in range. The aerial vehicles will drop bombs while the trains will just hit you but if you are hit by a bomb or train then you lose one of three lives. As you move along the tracks, a fuel gauge decreases and when it is empty then you stop and will be hit by a bomb or train. Fuel pods can be collected to increase your fuel and these are also shown on the tracks. Once you reach a station then you are given a flag and when five are collected then you move to the next level where there are more vehicles to contend with. Before the game you can select the speed of the game (Slow or Fast).",
  "publishedBy": "Alligata Software Ltd.",
  "developedBy": "Alligata Software Ltd.",
  "released": "Aug, 1984",
  "alsoFor": "Atari 8-bit, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/loco_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Alligata Software Ltd.",
          "developer": "Alligata Software Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Aug, 1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/754012-loco-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/754013-loco-commodore-64-screenshot-lets-collect-the-flags.png",
      "caption": "Lets collect the flags"
    },
    {
      "link": "/images/shots/l/754014-loco-commodore-64-screenshot-attack-from-above.png",
      "caption": "Attack from above"
    },
    {
      "link": "/images/shots/l/754015-loco-commodore-64-screenshot-blast-the-vehicle-on-the-track.png",
      "caption": "Blast the vehicle on the track"
    }
  ],
  "cover": []
}