{
  "name": "Los Pájaros de Bangkok",
  "shortName": "los-pjaros-de-bangkok",
  "description": "The story begins when the detective Pepe Carvalho (or in this case, you), receives a mysterious phone call from Bangkok by an old friend, Teresa Marsé, who is requesting you to come there to her help as she claims some people want to kill her.<br><br>With this information, you meet all her family in the travel agency which took her to Bangkok, where his guide informs everyone about what happened: &quot;In Bangkok, Teresa met a young native -Archit- for which she falls in love, but he turns out to be a a diamond smuggler. Teresa has the &quot;great&quot; idea to convince him to steal diamonds of his boss, Jungle Kid, but the latter's son discovers it, Archit and had no other choice but to kill him. Now the whole Thai Mafia pursues them, and it will be difficult for them to escape.&quot;<br><br>With all this, nobody seems to want to go to in the search for Teresa or hire someone to travel. You get to convince his father that something must be done, and you get chosen as a volunteer after discussing the trip price with the owner of the agency. But he refuses to give you more than 200,000 búths for the travel...<br><br>After a long journey by plane you finally arrive in Bangkok, and you do not know where to start looking. You just know that you have to go to the Spanish embassy in Bangkok, where the ambassador will explain in greater depth your mission.<br><br>Los Pájaros de Bangkok is a conversational adventure based on the novel of the same title, written by Manuel Vázquez Montalbán.",
  "publishedBy": "Dinamic Software",
  "developedBy": "Dinamic Software",
  "released": "1988",
  "alsoFor": "Amstrad CPC, DOS, ZX Spectrum | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/los-pjaros-de-bangkok",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Dinamic Software",
          "developer": "Dinamic Software",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/315267-los-pajaros-de-bangkok-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen and credits"
    },
    {
      "link": "/images/shots/l/315268-los-pajaros-de-bangkok-commodore-64-screenshot-starting-location.png",
      "caption": "Starting location"
    }
  ],
  "cover": []
}