{
  "name": "Max Headroom",
  "shortName": "max-headroom",
  "description": "This game is based on a 1984 British television movie which led to a 14-episode television series that ran in 1987 in the U.S.  It's an early cyberpunk vision set &quot;twenty minutes in the future&quot; where powerful corporations rule and compete for television ratings and consumer dollars.  Edison Carter is an investigative reporter for Network 23 seeking to free his alter ego Max Headroom, a cybernetic construct of his mind that was stored after Edison was involved in a motorcycle accident and the last thing he saw before losing consciousness was a &quot;Max Headroom&quot; sign going into a tunnel.  Max lives in computers and can appear on any screen, television or any electronic device.  The character is actually Matt Frewer in a latex mask, edited so as to appear jittery and stuttering like an early computer model.  <br><br>In the game, Max has been abducted by Network 23 and you must retrieve him from somewhere in the 11 top floors of their high-rise building starting at the 200th floor.  Security systems protect each floor and you have to find and enter the correct codes to gain access from the elevators.  Each floor seen in isometric view, has lines representing walls of various rooms with doors and office furniture.  Robots will chase and fire at you and decrease your health level as shown on the biomonitor at bottom of screen.  Also indicated are the floor number and time left.  On the right side of screen are 4 icons for Reporter E. Carter which open a door, call elevator, view through camera, or allow movement to run around the floor.  On the left side are icons for Controller T. Jones (Theora helps you hack into systems) to show you the floor and computer circuits.  <br><br>When entering a security code, it takes the form of an LED digit over which you must move a pointer over a row of circuit lines in order to activate various segments to form a desired digit.  Each segment will remain lit only temporarily so when time runs out you must ensure that the letter is fully lit or your code will fail.  In that event, you must make your way across the floor to the second elevator and try again.  ",
  "publishedBy": "Quicksilva Ltd.",
  "developedBy": "Binary Design, Ltd.",
  "released": "May, 1986",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/max-headroom",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Quicksilva Ltd.",
          "developer": "Binary Design, Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "May, 1986",
          "ean13": "5 012409 001231",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/509374-max-headroom-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/509375-max-headroom-commodore-64-screenshot-select-a-floor-by-lighting.png",
      "caption": "Select a floor by lighting up the correct segments that make up a number"
    },
    {
      "link": "/images/shots/l/509376-max-headroom-commodore-64-screenshot-just-arrived-on-floor.png",
      "caption": "Just arrived on floor 142"
    },
    {
      "link": "/images/shots/l/509377-max-headroom-commodore-64-screenshot-to-obtain-control-of.png",
      "caption": "To obtain control of the floor, you need to re-enter the light sequence in reverse order."
    },
    {
      "link": "/images/shots/l/509378-max-headroom-commodore-64-screenshot-get-some-important-information.png",
      "caption": "Get some important information from the computer system"
    },
    {
      "link": "/images/shots/l/509379-max-headroom-commodore-64-screenshot-use-the-camera-system.png",
      "caption": "Use the camera system to have a look at various remote places."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/181955-max-headroom-commodore-64-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/181956-max-headroom-commodore-64-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Commodore 64"
    },
    {
      "link": "/images/covers/l/181957-max-headroom-commodore-64-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Commodore 64"
    }
  ]
}