{
  "name": "Merlin",
  "shortName": "merlin",
  "description": "A few evil spirits hate the Wizard Merlin and want him dead so have combined forces to attack and kill him. You play as Merlin himself as you shoot and avoid as many creatures as you can over various levels trying to make a potion to complete each level. The game is viewed from the side on a single screen as you move Merlin on his cloud trying to collect ingredients that appear on the screen. You can fire at the creatures but this will use part of your energy bar and touching creatures will make it decrease further. When the bar is empty then you can no longer fire but you can still move around the screen. <br><br>One creature called a Hellwasp is particularly dangerous as one touch loses you one of three lives. As an ingredient appears you can pick it up and drop into your cauldron and you need a certain amount on each level to complete it. The creatures will also drop ingredients by parachuting them in and these need shooting before they fall into the cauldron as you lose one of your ingredients in the potion. You use the joystick to control Merlin.",
  "publishedBy": "Sparklers",
  "developedBy": "",
  "released": "1985",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/merlin",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Sparklers",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/682361-merlin-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/682362-merlin-commodore-64-screenshot-shoot-and-collect.png",
      "caption": "Shoot and collect."
    },
    {
      "link": "/images/shots/l/682363-merlin-commodore-64-screenshot-shoot-the-bad-ingredient.png",
      "caption": "Shoot the bad ingredient."
    }
  ],
  "cover": []
}