{
  "name": "Mission A.D.",
  "shortName": "mission-ad",
  "description": "Earth is in trouble once again after minor attacks against our planet and scientists have predicted that there will be one final big attack that will totally destroy us. The scientists have devised a plan called Mission A.D. which will see all countries join their defence systems and give financial aid to the plan. All countries agreed apart from one, Silesia, which sees it's Head of State General Offisrokka condemn the plan as he feels it's a capitalist plan to take over his country. Assassins hired by the General have now been dispatched to the bunker where the plans are being devised and drawn up to kill the scientists. <br><br>You play the role of super assassin Rik O'Shey who has been sent to the bunker to take out all the assassins in this side view flick-screen shooter over various missions within a time limit. The bunker itself is made up of eight areas connected by transporters and each screen in the areas is made up of two levels which are connected by elevators to move from the top and bottom floor. You are armed with a gun and you must search each area for a set number of assassins which you are told before you start each mission. <br><br>The main problem you have apart from the assassins themselves, is  the panic this has created with guard droids and guards themselves running around shooting anything that moves including yourself. You must shoot or avoid them in your search because if you are shot or touched then you lose part of your energy bar and when it reaches zero then you lose one of three lives. If the time runs out during a mission then you also lose a life. When you have searched an area then you can transport to another area with the transporter, and when entered you select the next area as well as look at a small map showing the assassin's locations.<br><br>Once a mission has been completed then you move to the next mission which is the same gameplay as the last mission but with more assassins to kill. As well as the main playing area you can see your lives, energy bar, time bar, score, what the assassins look like and a small map.",
  "publishedBy": "Odin Computer Graphics Ltd.",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/mission-ad",
  "visual": "",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Odin Computer Graphics Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/682193-mission-a-d-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading Screen."
    },
    {
      "link": "/images/shots/l/682194-mission-a-d-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/682195-mission-a-d-commodore-64-screenshot-five-assassins-to-kill.png",
      "caption": "Five assassins to kill."
    },
    {
      "link": "/images/shots/l/682196-mission-a-d-commodore-64-screenshot-some-droids-shot.png",
      "caption": "Some droids shot."
    },
    {
      "link": "/images/shots/l/682197-mission-a-d-commodore-64-screenshot-being-attacked.png",
      "caption": "Being attacked."
    },
    {
      "link": "/images/shots/l/682198-mission-a-d-commodore-64-screenshot-transporting-to-another.png",
      "caption": "Transporting to another area."
    },
    {
      "link": "/images/shots/l/682199-mission-a-d-commodore-64-screenshot-the-greenhouse-area.png",
      "caption": "The Greenhouse area."
    },
    {
      "link": "/images/shots/l/682200-mission-a-d-commodore-64-screenshot-searching-for-the-assassins.png",
      "caption": "Searching for the assassins."
    }
  ],
  "cover": []
}