{
  "name": "Moondust",
  "shortName": "moondust",
  "description": "<i>Moondust</i> is an experimental game by virtual reality pioneer <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,284828/\">Jaron Lanier</a>. It fuses together a complex control mechanic with a musical score generated by the player's movement. It consists of different scenes that show a space walker and six space ships floating around and bouncing off the sides of the screen. Even though they all go in a different direction, the player controls them all at the same time using a joystick. However, they only curve gradually into a new direction and are hard to control. When everybody moves in a new direction, the space walker's head becomes loose and follows the desired direction, while the body only slowly attaches itself again. Ships do not always obey the joystick. When they come close to the edge of the screen, they become dizzy and won't follow commands for a short time. Pressing the fire button changes everyone's movement to clockwise or counter-clockwise.<br><br>With a press of a button the space walker drops a seed, but only when he isn't near the middle of the screen. To progress, the space ships need to be steered towards the seed. Once they hit it, they will draw it out and spread the seed for a short time, and to progress, this needs to be done towards a circular sign usually in the middle of the screen as a form of rudimentary astral procreation. A single seed can be smeared out by multiple ships for a short time. Each smeared out seed drop inside the circle is awarded with a score and when a ship gets to spread it very close to the centre of the circle, a &quot;bullseye&quot; is awarded with maximum points and an extra seed. To progress to a new screen a sufficient amount of seed needs to be carried inside the circle. Scores are higher when the initial seed of the space walker is dropped further from the middle. In later levels the circle becomes smaller and initially the space man only has three seeds before the game is over. There is no time limit for dropping the seed. The space walker cannot smear the seed, except in the Spinsanity game mode, and to a limited degree. Sometimes the space walker is knocked out by the space ships in a collision. This may only happen a certain number of times and with each knock-out his colour changes.<br><br>Music consists of blips and electronic sounds that blend together in harmonies influenced by the player's movement and the spread of seed squares. There are also four different playing styles to choose from.",
  "publishedBy": "Creative Software, Inc.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/moondust",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Creative Software, Inc.",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/457660-moondust-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/457661-moondust-commodore-64-screenshot-choose-a-playing-style.png",
      "caption": "Choose a playing style"
    },
    {
      "link": "/images/shots/l/457662-moondust-commodore-64-screenshot-start-of-the-game-everyone.png",
      "caption": "Start of the game: everyone is going in a different direction"
    },
    {
      "link": "https://www.mobygames.com/images/shots/l/457663-moondust-commodore-64-screenshot-a-seed-has-been-dropped-and.png",
      "caption": "A seed has been dropped and the ships are smearing it."
    },
    {
      "link": "/images/shots/l/457664-moondust-commodore-64-screenshot-some-seed-squares-remain.png",
      "caption": "Some seed squares remain in the inner circle: points are scored."
    },
    {
      "link": "/images/shots/l/457665-moondust-commodore-64-screenshot-total-score-for-a-single.png",
      "caption": "Total score for a single seed drop"
    },
    {
      "link": "/images/shots/l/457666-moondust-commodore-64-screenshot-down-to-the-last-seed.png",
      "caption": "Down to the last seed"
    },
    {
      "link": "/images/shots/l/457667-moondust-commodore-64-screenshot-the-space-walker-has-been.png",
      "caption": "The space walker has been knocked out. His colour will now change."
    },
    {
      "link": "/images/shots/l/457668-moondust-commodore-64-screenshot-game-over.png",
      "caption": "Game Over"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/531738-moondust-commodore-64-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Commodore 64"
    }
  ]
}