{
  "name": "Nanako in Classic Japanese Monster Castle",
  "shortName": "nanako-in-classic-japanese-monster-castle",
  "description": "<i>Nanako in Classic Japanese Monster Castle</i> is an adult 2D puzzle platform game. It is the third game in the <i>Classic Japanese Monster Castle</i> series, but the first to introduce Nanako as the protagonist as well as an adult theme. Initially released for the ZX Spectrum, it was rewritten from scratch for CPC by the same developers as a new team (called v2) and then also C64. The differences between the two versions are mainly in the visual presentation. The adult elements are only present in the loading and ending screens, not during the game itself.<br><br>Nanako's sister Mya is a witch apprentice and broke the rules of her mentor. She leaves and heads to Heún Tower where she wants to improve her knowledge in dark magic. She breaks into the tower, angering an army of Karakasas and Tzukogamis (inanimate objects which become conscious after they are more than 100 years old), so she has to flee and hole up in the top of the tower. Nanako becomes worried after her sister's disappearance and follows her path through her mental connection with her sister. To bring her back to a safe place and reach her Nanako has to complete 25 rooms.<br><br>Each room consists of a single-screen environment. They are linked vertically using the flip-screen mechanic to form a tower. The goal is simply to reach the top of the room each time, but this requires some environment based puzzle-solving. Next to dodging enemies Nanako also has to build her own path by picking up and dropping boxes to reach the top. Only one box can be carried at all times. Not all enemies are awake. Still Karakasa can also be used as temporary platforms, but there is a chance they wake up and then she drops down. Another technique allows Nanako to jump and drop a box in mid-air, creating a floating platform.<br><br>Nanako starts with five lives. A password for each level is provided after completing it, using a custom Kun alphabet.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Nov 22, 2010",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/nanako-in-classic-japanese-monster-castle",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "Inside",
          "country": " Worldwide",
          "releaseDate": "Nov 22, 2010",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}