{
  "name": "Operation Whirlwind",
  "shortName": "operation-whirlwind",
  "description": "<i>Operation Whirlwind</i> is a tactical scale wargame set during the World War 2. As a battalion commander of an armored task force the player is ordered to capture (within 35 game turns, divided into phases) a city 15 kilometers away, defended by opposing forces. At your disposal are infantry, engineer, recon, tank and artillery units. Dig in your troops, deploy bridges, watch for enemy mines and barrage fire.<br><br>The player's task is to maneuver over open ground on a battle grid three screens five separate parts:\n<ol><li>Unit placement and disposition phase:  Dug in and defending, or In motion on recon.\n<li>Forces Movement phase: vertically or horizontally on the grid map, using the joystick. When in motion, firing is not possible. Enemy units are invisible until they fire on you, and mine fields are not visible until you hit them.\n<li>Combat phase:  Here you are engaged by artillery and small arms fire.\n<li>Assault Order phase: . In this phase you are able to advance and maneuver your units that have not exhausted their ammunition in the prior operations against enemy \nformations, utilizing head on assaults, or fast flanking armored attacks. Enemy units will be dislodged and will move, using their own firepower to attempt to break up your attacks.\nThe player will need to engage his engineer units to bridge river crossings while in action.\n<li>Final assault phase: The orders given in the prior phase become a mixed bag in the fog of war, and the gamer must react to circumstances that naturally occur as previously undetected enemy units deploy against the assaults as they unfold.</li></ol>\nWith the conclusion of each turn of five phases, the player will be assessed of his success or failure, and will be offered the opportunity to save or delete the prior game action before continuing to the next turn.\nThere are four increasingly difficult levels of engagement, each of which will result in five levels of outcome, from total victory, through stalemate, to abject defeat.",
  "publishedBy": "Br&oslash;derbund Software, Inc.",
  "developedBy": "",
  "released": "Dec, 1983",
  "alsoFor": "Atari 8-bit | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/operation-whirlwind",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Br&oslash;derbund Software, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Dec, 1983",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Ariolasoft UK",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "May, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/581411-operation-whirlwind-commodore-64-screenshot-title-screen-1.png",
      "caption": "Title screen 1"
    },
    {
      "link": "/images/shots/l/581412-operation-whirlwind-commodore-64-screenshot-title-screen-2.png",
      "caption": "Title screen 2"
    },
    {
      "link": "/images/shots/l/581413-operation-whirlwind-commodore-64-screenshot-the-main-menu.png",
      "caption": "The main menu"
    },
    {
      "link": "/images/shots/l/581414-operation-whirlwind-commodore-64-screenshot-starting-a-new.png",
      "caption": "Starting a new game"
    },
    {
      "link": "/images/shots/l/581415-operation-whirlwind-commodore-64-screenshot-moving-some-tanks.png",
      "caption": "Moving some tanks around"
    }
  ],
  "cover": []
}