{
  "name": "Perils of ... Bear George",
  "shortName": "perils-of-bear-george",
  "description": "<i>Perils Of... Bear George</i> or simply <i>Bear George</i> is a game with a side view perspective with fixed screens. It is composed by three different stages and scenarios. It has a family environment in the sense that it can be played mostly by children but also by people with many different ages and a friendly tone presented by a colourful cartoon style. It has some educational aspects because it illustrates symbolically the process of hibernation in bears.<br><br>The main goal of this game is to make Bear George fill his belly of apples and conduct him safely to his lair so he can peacefully hibernate for the harsh winter.<br><br>At the first stage George will have to swallow the more apples he can. There are three waves of different falling apples (greens, yellows, reds) at this stage. They fall from the trees and he has to be at the right position just with his mouth open to be able to catch and swallow them. Pay attention to the dangerous squirrels at the top of the trees which will throw heavy nuts at George's head, delaying his task of storing food, they are unpredictable. Beware too not to make George a glutton, because unexpected things can happen if he becomes too fat. The more apples he'll swallow, the more heavy, fat and slow he gets. <br><br>After this initial stage, independently of the amount of apples George was able to store, it's time for him to get home and hibernate. Leaving the forest George will have to go through the snow passageway which leads him to the cave where he lives. A frantic skier is constantly crossing George's path so he has to be aware not to be knocked out.<br><br>Inside the cave where he lives, there are humongous spiders blocking his path. A contact with these spiders will put George directly at the initial stage with less a life. When succeeding crossing this dangerous cave, he is finally able to hibernate until March where Spring comes.<br><br>",
  "publishedBy": "Cheetahsoft Ltd.",
  "developedBy": "Timedata Ltd.",
  "released": "1983",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/perils-of-bear-george",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Cheetahsoft Ltd.",
          "developer": "Timedata Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/900808-perils-of-bear-george-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/900809-perils-of-bear-george-commodore-64-screenshot-game-start.png",
      "caption": "Game start"
    },
    {
      "link": "/images/shots/l/900810-perils-of-bear-george-commodore-64-screenshot-level-2.png",
      "caption": "Level 2"
    },
    {
      "link": "/images/shots/l/900811-perils-of-bear-george-commodore-64-screenshot-the-zoo-catched.png",
      "caption": "The Zoo catched me"
    }
  ],
  "cover": []
}