{
  "name": "Quink",
  "shortName": "quink",
  "description": "<em>Quink</em> is a puzzle game for one or two players. In each round of the game, eight names, places, or objects will appear on the screen that will be associated in some way. Out of the eight items, two to six will not be related to the others. The player needs to identify which item(s) are loners and remove them from the list in the given time limit. For each wrong guess the player will lose a life; if three lives are lost, the game ends. Points are awarded for correctly identifying loners; each round contains a goal score, so even if the player completes a round without losing all three lives the goal still needs to be met to proceed onto the next round. <br><br>In addition to the regular gameplay rounds, there are also two types of challenge rounds: the single loner challenge, and the matchmaker challenge. In the single loner challenge there will be only one loner in the set; the goal is to identify it as quickly as possible. A correct choice earns bonus points, or the round ends when an incorrect selection is made or time runs out. In the matchmaker challenge, there are nine items displayed; the player needs to find out which item matches the one displayed in the center of the board. Correct choices earn bonus points.<br><br>Quink includes several subject areas, each of which have numerous categories that items may be associated by. The categories are:\n<ul>\n<li>Fame - includes categories such as Real Names of Movie Stars, Famous Generals, Leaders of Nations, TV Sportscasters, Sci-Fi Writers, and more.</li>\n<li>Pop Culture - includes Dances, Monopoly Avenues, Toys, Mixed Drinks, TV Westerns, Airlines, and more.</li>\n<li>Imagination - includes Music Terms, Onomatopoeia, Operas, Theft Talk, Poetic License, Bookish Things, Cartoon Curses, and more.</li>\n<li>Science and Nature - includes Computer Lingo, Diseases, Vegetables, Knots, Birds, Metals, Parts of a Cell, and more.</li>\n<li>General Knowledge - Seas, Cheeses, Martial Arts Forms, National Parks, Longest Rivers, Ancient Greeks, and more.</li>\n<li>Mixed Bag - All of the above subject areas are included at the same time.</li>\n</ul>\nThe game includes several gameplay options which adjust the difficulty and time limits. There is also an advanced play mode; in this mode the player must indicate when all loners have been removed instead of the game indicating such automatically. ",
  "publishedBy": "CBS Software",
  "developedBy": "Ron Dubren and Associates",
  "released": "May, 1985",
  "alsoFor": "Apple II, Atari ST, DOS | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/quink",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "CBS Software",
          "developer": "Ron Dubren and Associates",
          "ported": "",
          "country": " United States",
          "releaseDate": "May, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/513815-quink-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/513816-quink-commodore-64-screenshot-setting-up-the-game-how-many.png",
      "caption": "Setting up the game; how many players?"
    },
    {
      "link": "/images/shots/l/513817-quink-commodore-64-screenshot-these-are-the-categories-available.png",
      "caption": "These are the categories available"
    },
    {
      "link": "/images/shots/l/513818-quink-commodore-64-screenshot-do-you-want-a-normal-or-advanced.png",
      "caption": "Do you want a normal or advanced game?"
    },
    {
      "link": "/images/shots/l/513819-quink-commodore-64-screenshot-the-gameboard-which-items-don.png",
      "caption": "The gameboard; which items don't fit?"
    },
    {
      "link": "/images/shots/l/513820-quink-commodore-64-screenshot-here-s-the-category-all-the.png",
      "caption": "Here's the category all the items belong to"
    },
    {
      "link": "/images/shots/l/513821-quink-commodore-64-screenshot-so-far-all-right-answers-but.png",
      "caption": "So far all right answers, but there's still more to find!"
    },
    {
      "link": "/images/shots/l/513822-quink-commodore-64-screenshot-whoops-wrong-answer.png",
      "caption": "Whoops, wrong answer!"
    },
    {
      "link": "/images/shots/l/513823-quink-commodore-64-screenshot-the-game-starts-to-get-tougher.png",
      "caption": "The game starts to get tougher..."
    },
    {
      "link": "/images/shots/l/513824-quink-commodore-64-screenshot-another-wrong-answer-the-hour.png",
      "caption": "Another wrong answer! The hour glasses show what I should have selected."
    },
    {
      "link": "/images/shots/l/513825-quink-commodore-64-screenshot-game-over.png",
      "caption": "Game over"
    }
  ],
  "cover": []
}