{
  "name": "Raid 2000",
  "shortName": "raid-2000",
  "description": "The Xanthidian have invaded the Earth and slowly they are spreading over countries and cities and taking control. You have been tasked to destroy the invaders in four Raider Crafts from a base in the South Pacific. You must look at a map of the world with purple areas under alien control and green areas still under human control. You move a Raider Craft over an invaded part and it will tell you if an Alien Reactor Plant is active. <br><br>When you have selected an area the game turns into a top down shooter which scrolls in various directions when you move your ship and the speed is controlled by the joystick. You must find the reactor and destroy it before destroying all ships with your laser. If you touch a ship or hit an obstacle then you lose part of a damage bar and when it reaches zero you lose that ship. If you want to leave the screen before all is destroyed you fly over a flashing square and press the fire button. This takes you back to the map.<br><br>As you play each area, the purple areas expand as the aliens take over more of the world. If they are spreading too fast, each Raider Craft carries one  thermonuclear device and can be placed on an invaded area. The area turns yellow and wipes out all aliens and their reactors but the infected area can't be inhabited by humans. Once all the aliens have been sent back home they regroup and attack again but you receive your full compliment of Raider Craft. It is game over if you lose all four Raider Craft, the World is taken over or your base has been lost.",
  "publishedBy": "Mirrorsoft Ltd.",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/raid-2000",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Mirrorsoft Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/675279-raid-2000-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading Screen."
    },
    {
      "link": "/images/shots/l/675280-raid-2000-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/675281-raid-2000-commodore-64-screenshot-map-of-the-earth-rid-the.png",
      "caption": "Map of the Earth. Rid the Aliens from the purple zones."
    },
    {
      "link": "/images/shots/l/675282-raid-2000-commodore-64-screenshot-let-s-save-the-earth.png",
      "caption": "Let's save the Earth."
    },
    {
      "link": "/images/shots/l/675283-raid-2000-commodore-64-screenshot-blast-them-ships.png",
      "caption": "Blast them ships."
    },
    {
      "link": "/images/shots/l/675284-raid-2000-commodore-64-screenshot-another-invaded-part-of.png",
      "caption": "Another invaded part of Earth."
    }
  ],
  "cover": []
}