{
  "name": "Rasputin",
  "shortName": "rasputin",
  "description": "The spirit of Rasputin lives on in the netherworld. There, using the power of the Jewel of the Seven Planets, he intends to wreak havoc on the universe. The player takes on the role of a crusader and, armed only with a sword and a shield, must destroy the Jewel to put an end to Rasputin's schemes. To reach the Jewel the player must first enter the netherworld and neutralise the eight magic spells that Rasputin has cast to protect it. <br><br><i>Rasputin: The Crusader's Quest</i> is a single-player &quot;search the dungeons to find the jewel&quot; type of game. The netherworld takes the form of a court-yard from which doors take the player to different dimensions. Within each dimension there are magic stones that the player must step on to absorb their magic power and turn them from the dark side to the light. When, finally, the player has absorbed all the runes in a dimension, Rasputin will release a bigger and more dangerous monster from the dark side which, when slain, will give up a rune that will counteract one of the eight magic spells.There are also four rune stones to collect and these give protection when they attempt to neutralise the magic spells, except that the runes are colour coded and the player must have the right rune for the spell that's being broken. In addition there are all sorts of traps, pitfalls and nasty netherworld creatures that will either try to kill or sap the players energy. <br><br>The game can be played with either a keyboard or a joystick. There is no difficulty setting and no keyboard re-definition. There are only six action keys. Left / right rotates the character who can either walk or jump forward. There are two keys for fighting, one to use the shield and one to use the sword. Using either of these uses up their energy, indicated by a dual power bar in the lower right of the screen. <br><br>The game world consists of a series of rooms which may or may not have anything useful in them. The player has to work out how to cross the room in order to progress in the game. Items to collect are usually guarded by denizens of the netherworld who the player must either fight or creep past. Failing or dying in this game does not mean that the whole game has to be replayed. The game re-animates the player at the start of that section, doorway of the room to replay that section again. However, each reanimation consumes some of the player's life force and when that's gone the game has to be reloaded.",
  "publishedBy": "Firebird Software",
  "developedBy": "",
  "released": "Feb, 1986",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Adventure",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/rasputin",
  "visual": "Fixed / flip-screen, Isometric",
  "gamePlay": "Graphic adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Feb, 1986",
          "ean13": "5 012439 002246",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/528018-rasputin-commodore-64-screenshot-title-screen.gif",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/674821-rasputin-commodore-64-screenshot-start-of-your-quest.png",
      "caption": "Start of your quest."
    },
    {
      "link": "/images/shots/l/674823-rasputin-commodore-64-screenshot-left-or-right.png",
      "caption": "Left or right?"
    },
    {
      "link": "/images/shots/l/674824-rasputin-commodore-64-screenshot-be-careful-of-the-blocks.png",
      "caption": "Be careful of the blocks above the door."
    },
    {
      "link": "/images/shots/l/674825-rasputin-commodore-64-screenshot-nasties-have-appeared.png",
      "caption": "Nasties have appeared."
    },
    {
      "link": "/images/shots/l/674826-rasputin-commodore-64-screenshot-will-those-statues-attack.png",
      "caption": "Will those statues attack?"
    }
  ],
  "cover": []
}