{
  "name": "Rat Splat!",
  "shortName": "rat-splat",
  "description": "The situation in the sewers is critical. The rats breed in such numbers that something must be done. The player is picked for the task and he has to go down there and reduce the population. But in the darkness of the sewers also lurk something more dangerous, an angry monster with sentimental feelings toward the rats. <br><br><i>Rat Splat!</i> is a platform game consisting of fixed screen levels. Each level has a number of platforms connected with ladders that the player move between. On the platforms lies cheese that is meant to elicit the rats from their hideouts. As the rats run forth and back across the platforms the player has to move up to them and hit them in the head with his hammer. At the same time the player has to watch out for the monster that tries to hunt down the player. The hammer is not lethal enough for the monster so therefore the player has to switch to an aerosol can to be able to kill it. The cheese has to be protected. When the rats have eaten it all they will stop appearing. To complete a level the player has to kill 15 rats but he can't take to long or he might be overpowered by the cheese smell and die.",
  "publishedBy": "Prism Leisure Corporation Plc",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "Oric | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/rat-splat",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Prism Leisure Corporation Plc",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "5 014293 014502",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/776869-rat-splat-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/776870-rat-splat-commodore-64-screenshot-kill-the-rats.png",
      "caption": "Kill the rats"
    },
    {
      "link": "/images/shots/l/776871-rat-splat-commodore-64-screenshot-a-monster-has-appeared.png",
      "caption": "A monster has appeared"
    }
  ],
  "cover": []
}