{
  "name": "Sam's Jam",
  "shortName": "sams-jam",
  "description": "<i>Sam's Jam</i> is a side-view single-screen game where for reasons unknown, you play the role of Sam who is in a Jam factory eating drops of jam, taking bites out of strawberries, and avoiding a giant rat over various levels. Above Sam's head is a vat of jam below a conveyor belt that drips jam out at regular intervals, and each drop can be eaten by lifting his head upwards. Occasionally a strawberry moves along the conveyor belt before falling off the edge and down the screen where Sam can take a bite. As Sam eats then he puts on weight which starts off as 10 stone and cannot get heavier than 16 stone or Sam explodes. To the right of the screen is a sauna and standing in there has Sam losing weight.<br><br>Below the floor Sam stands on is a giant rat that moves left and right across the screen, and any jam or strawberry that is missed allows the rat to eat his share. Once the rat has eaten enough then he appears on Sam's floor and the only way to avoid the rat is to stand on a lift on the left of the screen to squash the rat. Once the vat of jam is empty then Sam goes into the sauna to complete the level. On later levels, more obstacles are introduced that need avoiding like Bouncing Bill, acid rain and barrels that need jumping over. If Sam touches the rat, obstacles, or explodes then he loses one of three lives and has to start the level again. ",
  "publishedBy": "Abrasco Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/sams-jam",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Abrasco Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/783540-sam-s-jam-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/783541-sam-s-jam-commodore-64-screenshot-waiting-to-bite-the-strawberry.png",
      "caption": "Waiting to bite the strawberry"
    },
    {
      "link": "/images/shots/l/783542-sam-s-jam-commodore-64-screenshot-about-to-squash-the-rat.png",
      "caption": "About to squash the rat"
    },
    {
      "link": "/images/shots/l/783543-sam-s-jam-commodore-64-screenshot-next-level-and-bouncing.png",
      "caption": "Next level and Bouncing Bill has joined the party"
    }
  ],
  "cover": []
}