{
  "name": "Scenario: Theatre of War",
  "shortName": "scenario-theatre-of-war",
  "description": "<i>Scenario</i> is a turn-based strategy game set during World War I. The player's goal is to conquer the entirety of Europe. The game takes place on a map of Europe divided into a number of provinces. There are 4 players, each of which can be human or computer-controlled, and each player starts with 1 province and a small army in it. The rest of the provinces are independent countries, just waiting to be conquered...<br><br>Armies consist of tanks, airplanes and ships. Each turn, the player can freely move their forces between their provinces or attack neighbouring provinces (though each tank, plane and ship can be moved only once per turn.) A ship automatically takes a number of tanks and airplanes when it is moved. When the player attacks a province, whether a neutral one or controlled by another player, the progress of the battle is shown. Of course, if the attacker emerges victorious by destroying the opposing army, they take over the country. If there's no army in that country, it can be taken over without combat at all. <br><br>Producing new armies costs money, acquired from taxes paid by the empire's citizens. It is also possible to get cash by mining for raw materials (coal, iron or copper); their prices change each turn, but they usually yield a lot of profits - but raw materials eventually run out, and trying to mine a depleted resource is a waste of money (though the player can pay a 250.000 fee to make an analysis and see how much resources there is left in a province). Another way to earn money is to send ships to overseas colonies to get money from them. <br><br>Producing armies requires first building factories; each factory produces a specific type of military units, and has a limit as to how many units it can make per turn. Fortifications can also be built in a province to make a defending army a bit stronger during enemy attacks. It is also possible to acquire an enemy province by providing the local revolutionaries with a hefty sum of money, allowing them to take over the province and make it a part of the player's empire. <br><br>Each turn, a random event can happen, such as worker strikes (cannot dig for raw materials) or discovery of a gold mine (cash bonus). The player is sometimes given an opportunity to destroy a factory in an enemy province; to do this, a short arcade sequence must be completed, which involves quickly aiming and shooting five guards in the head before the time, or ammunition, runs out. ",
  "publishedBy": "Starbyte Software",
  "developedBy": "Starbyte Software",
  "released": "1992",
  "alsoFor": "Atari ST, DOS | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/scenario-theatre-of-war",
  "visual": "",
  "gamePlay": "Wargame",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Starbyte Software",
          "developer": "Starbyte Software",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/377479-scenario-theatre-of-war-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/377482-scenario-theatre-of-war-commodore-64-screenshot-choose-your.png",
      "caption": "Choose your initial land"
    },
    {
      "link": "/images/shots/l/377483-scenario-theatre-of-war-commodore-64-screenshot-looking-up.png",
      "caption": "Looking up information about a country"
    },
    {
      "link": "/images/shots/l/377484-scenario-theatre-of-war-commodore-64-screenshot-investing.png",
      "caption": "Investing into raw materials"
    },
    {
      "link": "/images/shots/l/377485-scenario-theatre-of-war-commodore-64-screenshot-the-investment.png",
      "caption": "The investment brings quite nice results"
    },
    {
      "link": "/images/shots/l/377486-scenario-theatre-of-war-commodore-64-screenshot-attacking.png",
      "caption": "Attacking a neighbouring land"
    },
    {
      "link": "/images/shots/l/377487-scenario-theatre-of-war-commodore-64-screenshot-arcade-sequence.png",
      "caption": "Arcade sequence: kill all the guards to destroy the factory"
    },
    {
      "link": "/images/shots/l/377488-scenario-theatre-of-war-commodore-64-screenshot-i-failed-at.png",
      "caption": "I failed at this task :("
    },
    {
      "link": "/images/shots/l/377480-scenario-theatre-of-war-commodore-64-screenshot-i-m-down-to.png",
      "caption": "I'm down to one small land without an army..."
    },
    {
      "link": "/images/shots/l/377481-scenario-theatre-of-war-commodore-64-screenshot-a-succesful.png",
      "caption": "A succesful revolution in an enemy country."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/288015-scenario-theatre-of-war-commodore-64-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "Commodore 64"
    }
  ]
}