{
  "name": "Seaside Special",
  "shortName": "seaside-special",
  "description": "The Polytikians have invaded the Earth and taken over the Tory Cabinet in 10 Downing Street. Only one man can stop them: Radium Rodney. To save the Earth, Rodney must collect radioactive seaweed from Rotaway Beach, then travel to 10 Downing Street to throw the weed at the fake politicians.<br><br>The game is played over two screens.<br><br>On the seaside screen, Rodney must collect 10 pieces of weed to continue. Trying to stop him is a guard with a gun and a jellyfish. Spending too much time in the irradiated sea or handling the seaweed is dangerous and can kill Rodney.<br><br>Once the 10 pieces are collected it's off to 10 Downing Street to stop the aliens. Rodney stands underneath the windows and when a politician appears he must throw seaweed at them while dodging various objects thrown back. After each politician is hit five times, Maggie Thatcher appears who also needs to be hit five times. <br><br>Once Maggie is defeated the game returns to the beginning. If Maggie is defeated a second time the game ends and the score and number of polytikians killed are displayed.",
  "publishedBy": "Taskset Ltd.",
  "developedBy": "Taskset Ltd.",
  "released": "1985",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/seaside-special",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Taskset Ltd.",
          "developer": "Taskset Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1985",
          "ean13": "5 012347 100812",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/561006-seaside-special-commodore-64-screenshot-the-sea-washes-away.png",
      "caption": "The sea washes away the title."
    },
    {
      "link": "/images/shots/l/561007-seaside-special-commodore-64-screenshot-dodging-the-enemy.png",
      "caption": "Dodging the enemy collecting the seaweed."
    }
  ],
  "cover": []
}