{
  "name": "Shoot-Out",
  "shortName": "shoot-out",
  "description": "Shoot-out is a traditional arcade western shooter and it takes place in the desert landscape of Gulch Creek. Each level is composed by two distinct scenarios. The player will play as Quick Hand Luke.<br><br>In the first scenario Quick Hand Luke will practice his targeting skills and has to hit a specific number of cans. The scenario is static and the player stands on a fixed point of it. If he misses a single can, the game is over.<br><br>In the next scenario and according to each level, Quick Hand Luke will enter in a part of Gulch Creek. Although the player's location is fixed, he can move to the right and left of the scenario. The endings of it are the boundaries of the town, peaceful and filled with Indian tents. <br><br>As soon as the player enters the town, several outlaws may be hiding behind the windows of the buildings as much as the townsfolk. A single shot is enough to kill one of them and the player's ammunition is unlimited. The player as to kill a specific number of targets which will proportionally increase according to the more advanced levels.<br><br>The process of aiming is constantly in movement adding more difficulty and giving more realism to the game. \n",
  "publishedBy": "Martech Games Ltd.",
  "developedBy": "Last Chance Conversions",
  "released": "1988",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/shoot-out",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Martech Games Ltd.",
          "developer": "Last Chance Conversions",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/902691-shoot-out-commodore-64-screenshot-top-scores.png",
      "caption": "Top scores"
    },
    {
      "link": "/images/shots/l/902692-shoot-out-commodore-64-screenshot-game-start.png",
      "caption": "Game start"
    },
    {
      "link": "/images/shots/l/902693-shoot-out-commodore-64-screenshot-stage-2.png",
      "caption": "Stage 2"
    }
  ],
  "cover": []
}