{
  "name": "Shredz64",
  "shortName": "shredz64",
  "description": "<i>Shredz64</i> is a game modelled against the mechanics of <a href=\"https://www.mobygames.com/search/quick?gamegroup=Guitar+Hero\">Guitar Hero</a> to play music on a guitar controller. Players need to match notes in five columns, each with its own colour, against the rhythm and melody of the music. Doing well increases the applause meter and when it runs out the game is over. Similar to <i>Guitar Hero's</i> star power, perfect parts increase a shredocity meter, allowing the player to lift the guitar, turning the screen border red and scoring additional points. The screen only shows the notes in a pseudo 3D fashion, with nothing else in the background.<br><br>The game makes use of the PSX64 interface that connects PlayStation controllers to computers that use a DB9 port, and the Commodore 64 pin configuration. For the PlayStation 2 guitar controller, this does not only include button presses, but the whammy bar, strumming and lifting as well.<br><br>The initial game was released with ten instrumental songs divided over different difficulty levels. It includes a mix of game soundtracks (<a href=\"https://www.mobygames.com/search/quick?game=Zelda\">Zelda</a>, <a href=\"https://www.mobygames.com/search/quick?game=Zak+McKracken\">Zak McKracken</a>), movie soundtracks (<i>Beverly Hills Cop</i>, <i>Ghostbusters</i>) and renditions of popular songs (<i>Hotel California</i>, <i>Lick My Guitar</i>). Players can add their own SID files to the game and record custom notes. There are separate PAL and NTSC versions, and high score tracking is included.",
  "publishedBy": "",
  "developedBy": "Synthetic Dreams",
  "released": "Mar, 2008",
  "alsoFor": "",
  "genre": "Action, Simulation",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/shredz64",
  "visual": "",
  "gamePlay": "Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/510181-shredz64-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading screen"
    }
  ],
  "cover": []
}