{
  "name": "Space Moguls",
  "shortName": "space-moguls",
  "description": "Space Moguls is a worldwide competition to select four finalists to travel to a new world for the ultimate reality TV show. The goal is to become the wealthiest partcipant and return to earth in glory.<br><br>The game starts when the finalists land on a new planet. Each finalist is given a certain amount of cash and items to survive the seasons until the game concludes.<br><br>Each season is a round in the game, which begins with the Land Grant phase where players can pick one free Land Cell each round. After the first round there is a chance for a Land Auction to bid for an extra Land Cell and get an advantage over the other players.<br><br>After the Land assignments are complete each player takes a turn in the Development Phase. During the Development each player can enter the town to purchase and equip a Droid for extracting various items. With the equipped Droid in tow the player can leave the town and install the Droid on any owned Land Cell. While on the map players may encounter Grumplings, alien life forms that can provide additional items.<br><br>When each player has completed their Development phase Item Production begins. Depending on how well the equipped Droids match the Land Type a certain number of Items will be produced in each Land Cell. During production Global Events may occur that modify the production in some way or cause trouble for one of the players or disables the Market.<br><br>When all Production is complete the Trading Phase begins. Each player can trade items with other players or buy and sell with the Market. The Market price for each Item depends on the stock of Items in the Market, except for Rare Materials which has a slight random element to its price.<br><br>At the end of each round the current results are presented and the next round begins.<br><br>The game continues until a set number of rounds have concluded and the finalists are flown back for the award ceremony.<br><br>The game is a homage to the classic strategy game M.U.L.E. and was completed 35 years after M.U.L.E.\n",
  "publishedBy": "Protovision",
  "developedBy": "",
  "released": "Dec 07, 2018",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Bird's-eye view, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/space-moguls",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Protovision",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Dec 07, 2018",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/952710-space-moguls-commodore-64-screenshot-mars-map-screen.png",
      "caption": "Mars Map Screen"
    },
    {
      "link": "/images/shots/l/952711-space-moguls-commodore-64-screenshot-trading-food-items.png",
      "caption": "Trading Food Items"
    },
    {
      "link": "/images/shots/l/952712-space-moguls-commodore-64-screenshot-winternus-town.png",
      "caption": "Winternus Town"
    },
    {
      "link": "/images/shots/l/952713-space-moguls-commodore-64-screenshot-winternus-map.png",
      "caption": "Winternus Map"
    },
    {
      "link": "/images/shots/l/952714-space-moguls-commodore-64-screenshot-planet-46c-loading-screne.png",
      "caption": "Planet 46C Loading Screne"
    },
    {
      "link": "/images/shots/l/952715-space-moguls-commodore-64-screenshot-planet-46c-landing.png",
      "caption": "Planet 46C Landing"
    },
    {
      "link": "/images/shots/l/952716-space-moguls-commodore-64-screenshot-round-update.png",
      "caption": "Round Update"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/526758-space-moguls-commodore-64-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Worldwide",
      "platforms": "Commodore 64"
    }
  ]
}