{
  "name": "Thrust II",
  "shortName": "thrust-ii",
  "description": "The physics-based gameplay of the original <a href=\"https://www.mobygames.com/game/thrust\">Thrust</a> is back and the controls of your craft are basically the same - swivel left and right, and thrust. While the essence of the game remains very similar there are some differences second time round. <br><br>The Federal Resistance has captured an artificial planet of great strategic importance in the war against the Galactic Empire. However, the purification of the planet's atmosphere is not yet complete.<br><br>You must search the planet for 16 orbs, the majority of which lie below the surface, these are required for the construction of an atmospheric processor. This will involve descending into the maze-like tunnels of the planet, avoiding (or destroying) a variety of androids in your path and returning to the surface with the orbs in tow. <br><br>Only one orb can be picked up at a time and they must be put in place at a designated site on the surface. Once an orb is picked up a timer begins counting down; if it's not in place in time the entire planet is destroyed! If your craft (or an orb that has been picked up) collides with the walls or the androids that patrol the passageways then it is instantly destroyed, a shield (life) is lost and play is resumed from a nearby location. Weapon pickups destroy all enemies on the screen of a specific type but can only be used for a limited time. <br><br>Instead of the individual levels in the original game, there is only one game world in Thrust II and the orbs are scattered about in different places; they are also of varying masses and affect the handling of your craft differently.\n",
  "publishedBy": "Firebird Software",
  "developedBy": "",
  "released": "1988",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/thrust-ii",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/530032-thrust-ii-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/530034-thrust-ii-commodore-64-screenshot-title-screen-and-credits.png",
      "caption": "Title screen and credits"
    },
    {
      "link": "/images/shots/l/530035-thrust-ii-commodore-64-screenshot-and-we-re-off.png",
      "caption": "And we're off."
    },
    {
      "link": "/images/shots/l/530036-thrust-ii-commodore-64-screenshot-an-enemy-in-the-tunnels.png",
      "caption": "An enemy in the tunnels."
    },
    {
      "link": "/images/shots/l/530037-thrust-ii-commodore-64-screenshot-i-lost-all-my-shields-and.png",
      "caption": "I lost all my shields and died."
    },
    {
      "link": "/images/shots/l/530038-thrust-ii-commodore-64-screenshot-game-over.png",
      "caption": "Game over"
    }
  ],
  "cover": []
}