{
  "name": "The Tomb of Drewan",
  "shortName": "tomb-of-drewan",
  "description": "A magical amulet, and the four runestones of Air, Earth, Fire and Water, were the basis for the power of the evil Kartos empire. With time, the empire crumbled. The last survivor, named Drewan, lived for many years after and started to repent for the evils committed by the empire. He knew that eventually, he too would die, and so he prepared. A 400 room tomb was built, and populated with a variety of guardians to protect the amulet and stones. He also provided some spells as a way to defeat the guardians, just in case some future hero needed the power of the artifacts to be used for good...<br><br>The Tomb of Drewan is basically a treasure hunt in a maze. In addition to movement around the maze, the character can perform actions (labeled on-screen from A to W) by pressing the associated keys on the keyboard. Some of these actions are always available to the player, such as Taking an item, or attacking with your Sword. These actions have a yellow star next to them. Other actions such as Arrow or Removing a section of wall require the player to have a particular object or spell, and have a red star next to them when available.<br><br>The ultimate goal is to find the artifacts, and then return to the top left corner of the tomb. Each room contains 5 treasures and one guardian. The treasures can be taken by standing to the immediate left or right, and then facing in the direction of the treasure. Inspecting the object identifies it before being Taken, which is important, because only one of each type of spell can be carried at a time. Runestones provide special useful powers. For instance, the Earth stone allows Remove earth to be cast at any time. Gold may also be found, which adds to your encumbrance (reducing strength and speed) but may also be used to pay off the tomb lord.<br><br>The guardians that patrol each room may be of two types: warrior or magic users. Warriors will wound you only when standing next to you, while magic users fire spells once they are within five squares. Each type of guardian has three different colours, denoting how difficult they are to kill. Combat occurs by facing the opponent, and using the Sword, an Arrow, or one of the various combat spells (e.g. Chaos, Water, Fire or Petrify). Once your wounds exceed 100, you receive a visit from the tomb lord, who can be paid to resurrect you. If you have not amassed enough gold to make the payment, then your life is forfeit and you lose the game.",
  "publishedBy": "Audiogenic Ltd.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "VIC-20 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/tomb-of-drewan",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Audiogenic Ltd.",
          "developer": "",
          "ported": "",
          "country": " France",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/978699-the-tomb-of-drewan-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/978700-the-tomb-of-drewan-commodore-64-screenshot-loading-a-game.png",
      "caption": "Loading a game."
    },
    {
      "link": "/images/shots/l/978701-the-tomb-of-drewan-commodore-64-screenshot-starting-in-the.png",
      "caption": "Starting in the top left corner of the tomb."
    },
    {
      "link": "/images/shots/l/978702-the-tomb-of-drewan-commodore-64-screenshot-help-screen.png",
      "caption": "Help screen."
    },
    {
      "link": "/images/shots/l/978703-the-tomb-of-drewan-commodore-64-screenshot-found-one-of-the.png",
      "caption": "Found one of the runestones."
    },
    {
      "link": "/images/shots/l/978704-the-tomb-of-drewan-commodore-64-screenshot-attacking-with.png",
      "caption": "Attacking with the sword."
    },
    {
      "link": "/images/shots/l/978705-the-tomb-of-drewan-commodore-64-screenshot-blocked-by-a-cloud.png",
      "caption": "Blocked by a cloud of chaos from my spell."
    }
  ],
  "cover": []
}