{
  "name": "Trap",
  "shortName": "trap_",
  "description": "A once peaceful ally is now your enemy and you are tasked to defend your planet against them. In your spacecraft you must fly your craft blasting and avoiding various enemies intent of killing you over 10 levels. Each level is split into three tests and must be completed to move to the next level. The 1st test sees you in space where mines hurtle towards you at various angles and you can either dodge them or shoot them. Get past this test and the next one see's you flying over a valley where various enemies, some even shoot at you, try to destroy you. Once again you must blast or dodge these. <br><br>Scattered on this part stand your comrades who need cargo to keep them going so you can drop cargo for bonus points. Watch out as well for your fuel gauge but this can be replenished by bombing fuel dumps. To get to the 3rd test you must destroy a certain amount of enemies, once you destroy your quota you then leave your craft and move on foot once again avoiding and killing aliens. You have to collect orbs which are needed to complete the game but also you can purchase a better ship. Beware of holes in the ground as this will kill you. At any stage if you touch an alien or get shot you lose one of three lives and back to the start of test 1.<br><br><i>Trap</i> is a vertical shoot-em-up as well as a vertical run 'n gun game viewed from above which sees the screen scroll constantly upwards. You use a joystick and keyboard to play the game.",
  "publishedBy": "Alligata Software Ltd.",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/trap_",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Alligata Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/662881-trap-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/662882-trap-commodore-64-screenshot-ready-to-help-your-planet.png",
      "caption": "Ready to help your planet."
    },
    {
      "link": "/images/shots/l/662883-trap-commodore-64-screenshot-avoid-and-blast.png",
      "caption": "Avoid and blast."
    },
    {
      "link": "/images/shots/l/662884-trap-commodore-64-screenshot-flying-over-the-valley.png",
      "caption": "Flying over the valley."
    }
  ],
  "cover": []
}