{
  "name": "The Vaults of Zurich",
  "shortName": "vaults-of-zurich",
  "description": "In <i>The Vaults of Zurich</i> the player takes control of a master thief who attempts a very daring heist. As the title implies it all takes place in the subterranean vault system of a Swiss bank and the goal of the game is to reach the chairman's chamber on the ninth level and steal the bank's most valuable possession: the OPEC oil deeds. The player has two hours of real time to accomplish this and return to the bank lobby. The game consists of nine levels that are connected with stairs. Each level is five sectors wide and five sectors long and each sector can be either a corridor or a vault room. As the player descends the value of the vaults increase but so does the strength of the guards that patrol the corridors.<br><br>The game is mostly played by entering keyboard commands (on some versions it's possible to move around with the joystick). Each vault room contains a certain amount of blue ship stock and a number of people. They can also contain tools and a television camera. To gain control of the wealth of a vault the player has to either fight, bribe or explode the people of the vault. Fighting is automatic once initiated and goes on until the player or the opposition has won. If the player wins he gets all the content of the vault. When bribing is successfully used the most valuable occupant of the vault joins the player and the player gets the vault contents in exchange for the bribe. If not successful combat will start with the player's change of winning being lower than normal.<br><br>In addition to fighting and bribing there are other actions requiring various tools that can be found around the vaults. These include plans that show the map of the level in full, keys that can open vault doors, drills that do the same but with a time penalty, wires that disable TV cameras and explosives that can kill people and destroy cameras. If a camera is not wired or destroyed an alarm might go off. When this happens the player has thirty seconds to leave the level or the game will be lost. Running into a guard when the alarm is on will also lead to game over. Alarms also lead to the player losing some wealth and the longer it takes to leave the more will be lost. <br><br>In the corridors the player will come across guards. These can be fought but not bribed. Instead there are two other options, sneaking by or dumping. Dumping means the player drops one quarter of his wealth on the floor as a way to distract the guard and will then be able to pass. When sneaking there is a chance of triggering the alarm if spotted. ",
  "publishedBy": "Artworx Software Company, Inc.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "Apple II, Atari 8-bit, Commodore PET/CBM, VIC-20 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/vaults-of-zurich",
  "visual": "",
  "gamePlay": "Stealth",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Artworx Software Company, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/903386-the-vaults-of-zurich-commodore-64-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/903387-the-vaults-of-zurich-commodore-64-screenshot-creating-the.png",
      "caption": "Creating the maps takes a very long time"
    },
    {
      "link": "/images/shots/l/903388-the-vaults-of-zurich-commodore-64-screenshot-game-start.png",
      "caption": "Game start"
    },
    {
      "link": "/images/shots/l/903389-the-vaults-of-zurich-commodore-64-screenshot-found-some-janitors.png",
      "caption": "Found some janitors, swiss cheese and plans"
    },
    {
      "link": "/images/shots/l/903390-the-vaults-of-zurich-commodore-64-screenshot-got-the-plans.png",
      "caption": "Got the plans"
    },
    {
      "link": "/images/shots/l/903391-the-vaults-of-zurich-commodore-64-screenshot-died-on-level.png",
      "caption": "Died on level 2"
    }
  ],
  "cover": []
}