{
  "name": "War Play",
  "shortName": "war-play",
  "description": "Your enemy has taken control of a strategically important island and has made it well defended thanks to a network of bunkers with the information about the islands defences. All the bunkers need destroying to obtain this vital information as well as show the exact location of the Commander who keeps moving his HQ's position. You have been tasked to take control of a number of three vehicles types, two planes and a tank, each with their own strengths and weaknesses to be considered as you attack the enemy. You are also equipped with a radar to show your position on the area, and once the bunkers are destroyed then the Commanders location will be shown.<br><br><i>War Play</i> is a shooter that is viewed from a elevated angle with the screen scrolling in multiple directions when your vehicle moves. You must move about the area shooting enemy vehicles and buildings while avoiding being hit by the enemy or you lose that vehicle when it is destroyed. While the tank only moves along the ground and shoot forward, the two planes can be used to bomb buildings and vehicles. The altitude can also be increased or decreased but fly too low and that plane is lost if it hits an obstacle. Once all your vehicles have been destroyed then it is game over. Two players are able to play and they both play on the same side, with each player taking it in turns to attack the enemy when the other player loses a vehicle. There are three skill levels to choose from (easy, medium, hard) and these adjust the control of each of your vehicles.",
  "publishedBy": "Anco Software Ltd.",
  "developedBy": "",
  "released": "Apr, 1986",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/war-play",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Anco Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "Apr, 1986",
          "ean13": "5 012717 000346",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/702413-war-play-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/702414-war-play-commodore-64-screenshot-the-battlefield.png",
      "caption": "The battlefield."
    },
    {
      "link": "/images/shots/l/702415-war-play-commodore-64-screenshot-controlling-a-tank.png",
      "caption": "Controlling a tank."
    },
    {
      "link": "/images/shots/l/702416-war-play-commodore-64-screenshot-flying-past-a-tank.png",
      "caption": "Flying past a tank."
    }
  ],
  "cover": []
}