{
  "name": "Warrior II",
  "shortName": "warrior-ii",
  "description": "In this sequel to <a href=\"https://www.mobygames.com/game/psi-warrior\">Psi Warrior</a>, <i>Warrior II</i> has you playing the same warrior who has now been sent by RadCom Corps to explore an ancient storehouse in the nuclear wastelands and find a Biocomputer which was thought to be dead but is radiating huge psychic activity. You have to descend down various levels by ramps to reach the computer and understand it's motives.<br><br>Moving down into the depths of the storehouse requires having to wear the correct coloured suit to match the floor of the level below to get past the defences on the ramp. On top of the screen is a bar divided into five colours. Above that is a bar indicating which colour your suit is which can be moved to change to the next colours either side. To move the bar you have to shoot and disable a black or a white guardian and then touch them. Touching a black guardian moves the bar left and and the white guardian moves it right. This increases/decreases it a small bit so you have to keep shooting the same coloured guardian to change colour. <br><br>Once past the ramp you need to change colour of your suit to one that is different to the floor. You start flashing and one touch from a guardian kills you losing one of six lives unless it is disabled. To help you move from level to level you ride on a Hover-Board which you can control the speed off, damage it and your maximum speed keeps decreasing until you are only able to move about at a crawling speed. There are gaps in the floor which need jumping or avoiding as well.<br><br><i>Warrior II</i> is viewed from the side, slightly above and scrolls in all directions when you move. A joystick is used to control your warrior.",
  "publishedBy": "Nexus Productions Ltd.",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/warrior-ii",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Nexus Productions Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "5 014377 000087",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/661455-warrior-ii-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/661456-warrior-ii-commodore-64-screenshot-let-s-go.png",
      "caption": "Let's Go."
    },
    {
      "link": "/images/shots/l/661457-warrior-ii-commodore-64-screenshot-a-black-guardian.png",
      "caption": "A black guardian."
    },
    {
      "link": "/images/shots/l/661458-warrior-ii-commodore-64-screenshot-need-speed-to-jump-that.png",
      "caption": "Need speed to jump that gap."
    },
    {
      "link": "/images/shots/l/661459-warrior-ii-commodore-64-screenshot-turned-green.png",
      "caption": "Turned green."
    },
    {
      "link": "/images/shots/l/661460-warrior-ii-commodore-64-screenshot-getting-lower.png",
      "caption": "Getting lower."
    }
  ],
  "cover": []
}