{
  "name": "The Wild Bunch",
  "shortName": "wild-bunch_",
  "description": "Originally released in the 80s on the <a href=\"https://www.mobygames.com/game/zx-spectrum/wild-bunch\">ZX Spectrum</a> and the <a href=\"https://www.mobygames.com/game/cpc/wild-bunch\">Amstrad CPC</a>, the Commodore 64 version was re-made and released in 2009 with the original cassette inlays from the original versions with the company Firebird on them.<br><br>Set in the Wild West, The Wild Bunch is an adventure game with some graphic and arcade elements where you have to prove your innocence for the murder of a man. You discovered the body of the dying man who describes his killer who is a member of the notorious gang, The Wild Bunch, before he draws his last breath. Standing over the body with a gun in your hand, you are discovered by the Sheriff so you flee the scene and begin a life on the run. With a Pinkerton Agent on your trail, you must search the surrounding area and it's five towns to look for the mans killer and bring him to justice with $50 in your pocket and a gun.<br><br>After choosing a town to visit from a map you are presented with a number of menus with options for you to choose and your combat strength increases when you enter the town. You can visit the Saloon, Sheriff's Office, Store and a Telegraph Office. You can also look at your status which shows your combat strength, inventory and how much money you have.<br><br>The Saloon allows you to have a drink (at a cost) to increase your strength, play poker to increase your funds and look around for any potential member of The Wild Bunch from descriptions you have managed to get. If you come a cross a person then you must name him and you can either can take him to the Sherriff's Office or have a gunfight. The gunfight is viewed from a 1st person perspective with your opponent in front of you and when he draws you must fire to kill him. Fire too soon or you kill an innocent member of the town then you are arrested and it is game over.<br><br>The Sherriff's Office allows you to look at any wanted posters for the The Wild Bunch which will give you descriptions of one of the members. You can also find out the identity of any man you have brought in from the Saloon. The Telegraph Office lets you pay to see the location of the Pinkerton Agent and the store allows you to buy a variety of goods to help you in your quest for justice. The most important item is food and water to keep your strength up. Once you have managed to survive a town, you can move on to the next one.",
  "publishedBy": "Psytronik Software",
  "developedBy": "",
  "released": "2009",
  "alsoFor": "",
  "genre": "Action, Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/wild-bunch_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Psytronik Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/704288-the-wild-bunch-commodore-64-screenshot-intro.png",
      "caption": "Intro."
    },
    {
      "link": "/images/shots/l/704290-the-wild-bunch-commodore-64-screenshot-loading-screen.png",
      "caption": "Loading Screen."
    },
    {
      "link": "/images/shots/l/704291-the-wild-bunch-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/704292-the-wild-bunch-commodore-64-screenshot-map-of-the-area.png",
      "caption": "Map of the area."
    },
    {
      "link": "/images/shots/l/704293-the-wild-bunch-commodore-64-screenshot-you-have-entered-a.png",
      "caption": "You have entered a town."
    },
    {
      "link": "/images/shots/l/704294-the-wild-bunch-commodore-64-screenshot-inside-the-saloon.png",
      "caption": "Inside the Saloon."
    },
    {
      "link": "/images/shots/l/704295-the-wild-bunch-commodore-64-screenshot-playing-poker.png",
      "caption": "Playing poker."
    },
    {
      "link": "/images/shots/l/704296-the-wild-bunch-commodore-64-screenshot-gun-fight.png",
      "caption": "Gun-fight."
    },
    {
      "link": "/images/shots/l/704297-the-wild-bunch-commodore-64-screenshot-in-the-store.png",
      "caption": "In the store."
    },
    {
      "link": "/images/shots/l/704298-the-wild-bunch-commodore-64-screenshot-a-wanted-poster.png",
      "caption": "A wanted poster."
    }
  ],
  "cover": []
}