{
  "name": "Zoids",
  "shortName": "zoids_",
  "description": "The first video game was invented in 1726 by Thomas Reginald Edmond Ellery Bach, a cousin of the famous composer J.S.Bach. The inspiration came to Thomas while he was sleeping listening to one of Bach's Fugues. This led to a technicolor dream of what could be seen through a electron microscope, 250 years before its invention. There were spacemen in free-fall and a spaceship in the shape of a plectra. It is believed that playing the game led to Beethoven going deaf, Schubert getting so addicted that he left many things unfinished and Nelson had  a version under his coat. You now have the chance to experience this piece of history for yourself.<br><br>The game is a shooter with each of the various levels seen on the whole screen and the idea is to destroy all the Zoids that appear with your plectra shaped ship and its laser. The Zoids take the shapes of dots which change into other shapes, and depending on the time it has been on screen it requires a certain amount of hits. You can move your ship in multiple directions but you can only point and fire to the right. You have an energy level which decreases when you fire you laser but energy packets in the shape of spacemen appear and can be collected to increase your energy. If you touch a Zoid then you are killed and you lose one of three lives and a joystick is used to control your ship.",
  "publishedBy": "Softek Software",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/c64/zoids_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Commodore 64",
      "releases": [
        {
          "publisher": "Softek Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/701048-zoids-commodore-64-screenshot-title-screen.png",
      "caption": "Title Screen."
    },
    {
      "link": "/images/shots/l/701049-zoids-commodore-64-screenshot-collect-the-spacemen-and-blast.png",
      "caption": "Collect the spacemen and blast the Zoids."
    },
    {
      "link": "/images/shots/l/701050-zoids-commodore-64-screenshot-killed.png",
      "caption": "Killed."
    },
    {
      "link": "/images/shots/l/701051-zoids-commodore-64-screenshot-zoids-have-got-bigger.png",
      "caption": "Zoids have got bigger."
    }
  ],
  "cover": []
}