{"name": "Countdown to Doom ", "overview": "While orbiting the treasure-laden, but inhospitable, planet Doomawangara (Doom for short) your ship suffers a devastating attack from the local air defence system. Grounded on Doom, your ship is both damaged, and threatened with total disintegration due to the corrosive effects of the Doom atmosphere. Repairs to the ship must be made before you can escape, and there's also a tempting array of treasure to be collected; but the clock is ticking away all the while, and it's only a matter of time before the ship will disappear in a cloud of dust, whereupon you must resign yourself to a life in the wilderness of Doom.<br><br>This ROM Cartridge is designed for use with the Electron Plus 1.<br><br>As you play the game, you'll find that you will want to SAVE a game at a particular point (for example, before doing something risky, or simply to return to the game at a later time). You will be prompted to find a suitable area on one of your tapes, followed by the usual \"RECORD then RETURN\" message. This will put the 'dynamic' part of the database onto tape - this is the part which attends to the general house-keeping - where you are, where the objects are etc. The file is automatically called INIT so if you make several SAVEs, you'll need to keep track of which INIT is where.<br><br>If you wish to restart at one of these positions, load the program as usual, but select S to start from a saved position. You'll be asked to Position the database file. Locate the saved position on tape, set it playing, and press RETURN. Once INIT is loaded (about 45 seconds) the game will start from where you left off.<br><br>Should you QUIT or die, you'll be asked if you want another game. \"Y\" or \"y\" will return you to the start of the game; \"N\" or \"n\" will simply end it.", "platform": "Acorn Electron", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Acornsoft", "publishers": "Acornsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81577"}