{"name": "Hex", "overview": "Whilst on a hiking holiday in Cornwall, you find yourself in Padstow during the Hobby Horse celebrations. These take place on May Day when the hobby horse dances through the crowd grabbing at and bumping into watching spectators.<br><br>After the celebrations you become engaged in conversation with a couple of old Cornishmen in one of the taverns. When you inform them of your interest in legends and folklore, they start to mention the local legend of a witch named Vianna who lived by the coast between Padstow and Bude, farther north.<br><br>A couple of hundred years ago, the woman Vianna was accused of being a witch and was put to death. The people say, however, that at certain times she returns to stalk the night along with various demons and familiars which she conjures up to help her in whatever diabolical deeds she performs.<br><br>Now that King Edward has succeeded to the throne, people are less likely to be alarmed by ghost stories and witchcraft in these modern Edwardian days. However, in recent years there have still been a number of respectable people reporting eerie occurrences. Why, only last year a local doctor reported hearing the sound of voices and the whinnying of horses on the moors whilst there was no sign to be seen of anybody.<br><br>These days, however, Vianna is more euphemistically referred to as Vi and many scoff at the mention of witchcraft.<br><br>One of the men to whom you are talking mentions that he is driving in the morning to Bude and that he will happily offer you a seat on his carriage so that you can visit the village where Vianna lived.<br><br>So it is that the following day, the man drops you off after a journey of about an hour or so and continues on his way Northwards.<br><br>\"If you should meet the old witch, give her my regards,\" he laughs as the carriage is driven away.<br><br>Now is it my imagination, or is it just a little bit more chilly than it was a moment ago?", "platform": "Acorn Electron", "release_date": "June 1, 1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Geoffrey Hans Larsen", "publishers": "Larsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142997"}