{"name": "Maze", "overview": "You have entered the top-secret installation of a rival company with the aim of stealing secret information. Inside the building is a multi-level security system, each level consisting of a maze of corridors patrolled by robot guards who will shoot you on sight.<br><br>The robots are armed with guns which they can recharge by running over special power points which are marked by pentangles on the floor of the maze.<br><br>Your company's scientists have been able to duplicate the design of these guns so that you too are able to replenish your ammunition by running over the power points. You have a maximum of three bullets at any one time.<br><br>The only exit from each level is a computer-controlled lift, programmed to open its doors only when triggered by an electronic security key; a separate key is needed at each level. This key can be found in an indestructible iridium box somewhere in the maze. The box can only be opened when three coloured idenity tags have been dropped into it. These three tags; red, blue and green, are randomly positioned in the maze. When you have collected all three, take them to the box and drop them. The box will open automatically and you can take the key.<br><br>To help you find your way about, you have an advanced electronic compass. This will remember the layout of all the corridors as you explore them and can automatically detect the positions of the guards. The compass will also remember the positions of power points and the box containing the key once you have found them.<br><br>The compass can display a plan view of the maze at any time showing all the features you have so far encountered.<br><br>When you have the key, take it to the lift which will open as you approach and carry you to the next level. Higher levels are protected by more guards and have fewer power points.", "platform": "Acorn Electron", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Acornsoft", "publishers": "Acornsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=NOcOnX65gko", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81620"}