{"name": "Webwar", "overview": "A fast-moving 3-D vector graphics space game over 256 increasingly faster and more difficult levels. Have you got what it takes to complete the mission and achieve the status of Defender of the web?<br>For the past thousand years the people of the Black Widow have been undeer attack. The once beautiful city of Xylres at the centre of the Web now lies in ruins. Seeing the imminent defeat of the Web, you have been called upon to assume the rank of Defender by the High Council of the Web.<br>The craft you are to fly is known by the people of the Black Widow as a Flipper (the nearest translation of their word Chzytwerj). It is armed with twin energon lasers, and has a magnitude seven xyral pulse power source making it extremely fast. However, to gain such speed it carries no shields so has to be flown with great care, as any collision will destroy it. Whilst power remains to re-energise you and your craft, there is only sufficient to undertake this ten times.<br><br>The rebels attacking the Web fly eight different craft, including Flippers, captured when past Defenders have been defeated, or when they have simply deserted their post and joined forces with the rebels. All rebel craft have been stripped of all armament and packed with Chztwer, the most powerful high explosive devised, so they all represent huge missiles. In addition they are all un-manned, so to destroy you to get through to the heart of the Web they will simply fly into you. The craft you destroy earn you points from 8,000 for a rogue Flipper, down to 1,000 for a Starid, your least powerful appointment.<br><br>The High Council will monitor your progress by the score you accumulate, and the system employed is as follows:", "platform": "Acorn Electron", "release_date": "February 1, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Mike Kennedy", "publishers": "Artic", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81940"}