{"name": "Demogorgon Monk", "overview": "\"Mo Shen Fa Shi\", as the transliteration of the title supposedly goes, is a very simple turn based RPG based on the Journey to the West. It was made by Waixing Computer Science & Technology. The game itself at first seems to be a regular turn based RPG. However, there are some notable differences. For one, there are no \"inns\" or anything similar in this game. Instead the characters regain health and magic after each fight automatically, to a certain extent. This is not a problem later on but becomes one towards the one of the game. Another difference is that there is little to do in the game other then talking to people and fighting enemies. Despite not knowing Chinese one can force one's way through the game by simply fighting the boss characters visible on the screen and talking to people. There is little chance of not knowing where to go as you can only go into areas that you have to go to next. Otherwise the game simply notes the area as being somewhere you can go by displaying a name, but will not allow you to go inside, even if there is seemingly nothing preventing your entry. In addition, NPCs and defeated boss characters will not repeat dialogue that they've already said, so one can check quite easily if he missed a necessary conversation by simply attempting to talk to them again. There is little need to really know what they say in depth as the conversation usually amounts to an event flag which opens up a previously inaccessible area. One notable thing about the game is that it is set on one map, which is however divided into three areas. Once the player gets teleported to the other side of the river, there is no way to go back to the starting area. It is at this point where the game becomes more imbalanced. There are two boss characters here, both of whom use an attack that hurts the entire party for 200 or 300 dammage respectively. Progress having been much smoother before, one has to start going around and grind the enemies in this area, far tougher then those in the first area. It's here that the auto healing function stops being much of an asset, as there is only a certain amount of health and magic that regenerates after a fight and if you keep running into the skeletons, you will probably keep on losing energy rather then getting any back.", "platform": "Nintendo Famicom Disk System", "release_date": "1998", "game_type": "Unlicensed", "esrb": "Not Rated", "developers": "Waixing", "publishers": "Waixing", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Vmnqhyarx-8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126669\n"}