{"name": "Green Beret", "overview": "Based on the arcade game of the same name, the player's objective in the FDS version was changed from rescuing prisoners to destroying a secret weapon being developed in the enemy's headquarters. Additionally, a 2-players co-operative mode was introduced as well, allowing two players to play simultaneously (with Player 1 in blue and Player 2 in red). The play mechanics are essentially identical to the arcade version, however the Flamethrower is removed (only the Rocket Launcher and Grenades remained) and two new power-up items are introduced: a Star mark which grants invincibility and a pistol with unlimited ammo, both which are only usable for a limited period. The FDS version also features two additional stages that were not in the arcade game: an airport set between the Missile Base and the Harbor, where the player faces a group of rocket soldiers at the end; and a new final stage set inside the enemy's base in which the player must disarm a nuclear missile at the end that is about to be launched; by using rocket launchers dropped by enemy soldiers. The flamethrower corps at the end of the Warehouse stage was replaced by a paratrooper unit. The FDS version features a few differences from its NES counterpart by allowing the player to continue up to three times after a game over and if the player loses a life in the Famicom version, his character will respawn at the very spot where he died instead of being sent to the last checkpoint (in the NES version, instant respawns are only allowed in the 2-Players game). Moreover, the player can carry up to nine rounds of any secondary weapon he finds instead of just three. To rebalance the difficulty, the NES version gives the player more extra lives when they begin (four instead of two) and all weapons dropped by enemies will always have three rounds in them instead of having the player accumulate them one by one. The Famicom version also features hidden underground areas which the player could access by destroying certain land mines in Stage 2, 4, and 5.", "platform": "Nintendo Famicom Disk System", "release_date": "April 10, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/Rush%27n_Attack", "video_link": "https://www.youtube.com/watch?v=3S0vB0Wxd4c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/50692\n"}