{"name": "Kaettekita Mario Bros.", "overview": "Kaettekita Mario Bros. (lit. Return of Mario Bros.) is an updated remake of the original NES conversion of Mario Bros, developed and published by Nintendo for the Famicom Disk System in 1988. While the original NES conversion, developed in 1983, was quite accurate to the arcade version upon which it was based, many compromises were made in order to fit the game in a limited amount of memory. These compromises included the size of the enemies, the instruction cut-scenes which introduced each enemy, and the icicles which form from the top platform later on in the game. Kaettekita Mario Bros. seeks to restore all of those aspects to as close to the arcade version as possible. Kaettekita Mario Bros. was one of the few Famicom Disk System games available exclusively from the Famicom Disk Writer and not sold separately. In addition to the graphics improvements, Mario and Luigi gained the ability to change direction slightly in mid-air, and the game took advantage of its disk format by letting you register your name and save the top five high scores. In 1993, this version of the game was stripped of all of it's sponsorship content, and any contest information, and released in Europe simply as Mario Bros. (but with the label of \"Classic Series\"). This conversion of the game never made it to North America. In an unusual move for Nintendo, this game was published in a partnership with a sponsor; Nagatanien, a Japanese producer of seasonings for rice and noodle dishes. As such, the game features in-game advertisements for Nagatanien products, as well as Super Mario Bros. 3, which was released one month prior. The game also featured a contest where players can win Super Mario Bros. 3 merchandise. Mario had also previously appeared on Nagatanien Japanese TV commercials.", "platform": "Nintendo Famicom Disk System", "release_date": "November 30, 1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo EAD", "publishers": "Nintendo", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "3.43", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Wb55zig4EVg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/50065\n"}