{"name": "Kieta Princess", "overview": "Princess Kilala, from the Kingdom of Rabia, has been summoned to Japan to have a discussion about a medicine that has been imported from her country that has been causing dementia to the Japanese public. However, during her visit to Japan, she has suddenly vanished and nobody knows where she has went. Now it's up to the player to play detective and solve this baffling case of the missing princess. The game features five different towns to explore. The purpose of exploring the town is to find out information from the locals. While most locals are friendly, some are hostile like the gang members that will fire at anyone getting in their way. Players are armed with a gun that can kill these enemies, but they must be careful not to accidentally fire on too many innocent civilians (or else the player may be arrested and fined). While inside a town, players can also do extracurricular activities such as eating at restaurants, do some training at a dojo, and collect vegetables in order to sell them off for money. The game also features a day-night cycle which can have an effect on who the player runs into while exploring. Some parts of the investigation will lead the player to play a side-scrolling action platformer. During this part of the game, players have to deal with enemies by shooting them, collect items and money lying around, and sometimes jump on springs to make jumps onto high up platforms. Being a part of Imagineer's Wave Jack series, the game also came with extra paraphernalia such as an audio cassette tape and a map. The audio cassette tape contains hints as well as songs from Yasuko Tomita, a Japanese actress and singer. She is also featured on a poster that came with the game.", "platform": "Nintendo Famicom Disk System", "release_date": "December 20, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Imagineer", "publishers": "Imagineer", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=rvPYUwmRYW0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43289\n"}