{"name": "Nazoler Land: Dai 2 Gou", "overview": "Nazoler Land Dai 2 Gou was the second of three \"Magazine Disks\" published by Sunsoft for the Famicom Disk System in the middle of 1987. The full title of the disk is Nazo no Magazine Disk Nazoler Land Dai 2 Gou which translates as \"Puzzle Magazine Disk Nazoler Land 2nd Issue.\" Rather than featuring one game, it contains a collection of 6 games which would be considered \"mini-games.\" The player selects which game to play from the menu screen. The mini-games are: Patalick - Players have to flip over entire rows and columns of tiles until all the tiles facing up are white. Sekai Isshū Nazoler Quiz - A quiz game for up to four players. Players have to answer questions correctly in order to earn money. The earned money is then used to purchase fares for trips to different locations around the world. Warashibe - A game about bartering. Players trade items and money with other characters in order to come out ahead with the most money. Bakufū Tomo-chan - Players take control of Tomo, a woman with the ability to lay down explosives. Tomo starts at the top floor inside of a building and has to make her way down to the bottom. She does this by bombing the floors she is currently on. She only has a limited number of bombs and has to carefully plan her route so that she can pick up more bombs that are laying around. She also has to be careful not to fall on any of the animals that are dwelling in the building too. Nazoler Shōnen Tantei-dan Ōgen Yashiki no Nazo-hen - An adventure game where players have to guide a group of children through a house in order to find a document. Nazoler Box - Tomo is back and reads information about this Famicom disk series. There is also a drawing program for the player to use. This was originally meant for players who wanted to create and then submit an image for a contest that was being held during this game release.", "platform": "Nintendo Famicom Disk System", "release_date": "June 12, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunsoft", "publishers": "Sunsoft", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "1.3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/52453\n"}