{"name": "Nazoler Land: Soukangou", "overview": "Nazoler Land Soukan Gou is the first in a series of minigame collections from SunSoft developed especially for Nintendo's Famicom Disk System peripheral. It was followed by two direct sequels and a quiz-based spin-off. Nazoler Land Soukan Gou (or Nazoler Land Vol. 1) has eight minigames that the player can select from a menu after loading the game up and switching the disk around. These are: Kaiten Meiro Doorman - Players have to traverse several floors of a maze. However, freely moving around the maze is made difficult because of gates that can only swing open certain ways. Nazoler Uranai - A Mastermind variant featuring signs of the zodiac. Figuring out the correct answer will reward the player with a fortune telling message. Super Jigsaw - As the name suggests, a jigsaw puzzle game. Players can only switch one tile with another one at a time. Momoko-hime o Sukue! - A first-person adventure game. Players explore a dungeon labyrinth on a mission to rescue Princess Momoko. Nihon Isshū Ultra Quiz Ryokō - A quiz game. If the player answers a question right they will be awarded money which they can then use to travel to different sites in Japan. Famicom Tekiseikensa - Players take the role of a cowboy in a duel against another cowboy. Whoever can press the fire button the most times in ten seconds wins the duel. This game is for one or two players. Oshidashi Puzzle - Players have to shoot various rows and columns of tiles into their correct position. When a tile is in the correct position it changes from it's original color to another color. This game features three different levels. 3-D Maze - A first-person maze game.", "platform": "Nintendo Famicom Disk System", "release_date": "February 6, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunsoft", "publishers": "Sunsoft", "genres": "Adventure", "max_players": "2", "cooperative": "Yes", "rating": "4.38", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=FvTLOVGno5o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43304\n"}