{"name": "Nazoler Land: Dai 3 Gou", "overview": "Nazoler Land Dai 3 Gou was the third and final \"Magazine Disk\" published by Sunsoft for the Famicom Disk System. This last disk was released in 1988. The full title of the disk is Nazo no Magazine Disk Nazoler Land Dai 3 Gou which translates as \"Puzzle Magazine Disk Nazoler Land 3rd Issue.\" Rather than featuring one game, it contains a collection of 6 games which would be considered \"mini-games.\" The player selects which game to play from the menu screen. The mini-games are: Sugoro Quiz - A quiz/board game for two to four players. The player that answers a question right can roll a die and advance their game piece forward. The player who gets their game piece to the end of the board layout wins. Tomo-chan Bakuso - Players have to guide the heroine, Tomo, throughout four stages of puzzle platforming action. Stages consist of several blocks that Tomo has to either jump over or duck under in order to get by them. Also some platforms contain an up arrow which will damage Tomo's health if she crosses over them. Tomo can only take three hits before she dies. Her goal is to reach an exit door at the end of each stage. Tanteidan boy Nazoler - In the vein of an escape the room adventure game, players take control of a doctor trying to get out of a locked room. The player has several objects they can choose to manipulate with the effects of any successful manipulation being displayed graphically. Bingo Game - As the name suggest, a simple bingo simulator. Nazoler Box: Corner Hearing - Tomo is back and reads information about this Famicom disk series. She is also joined by Kirk, the main protagonist of Dead Zone. Nazoler Box: Miss Nazoler Contest - The winner's pictures from the contest held on Nazo no Magazine Disk - Nazoler Land Dai-2 Gō are presented here. There are also guest appearances of Carry the robot from Dead Zone, and Kyle from Ripple Island.", "platform": "Nintendo Famicom Disk System", "release_date": "March 11, 1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunsoft", "publishers": "Sunsoft", "genres": "Board Game", "max_players": "4", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43293\n"}