{"name": "SD Gundam World: Gachapon Senshi: Scramble Wars", "overview": "SD Gundam World Gachapon Senshi - Scramble Wars is a hybrid strategy/action game based on the popular Gundam toy series from Japan. It was developed and published by Bandai for the Famicom Disk System. Two different versions were released within two months of one another. The initial version was sold in stores for ¥3,300 at the end of 1987 on its own disk with a case. The second version was sold for a much cheaper ¥500 in the beginning of 1988 as part of the \"Disk Writer\" system, where players could bring their own blank disks to a kiosk and have a game of their choice written to the disk. While both versions contain 10 maps to play on, the Disk Writer edition replaces five of the maps from the original edition with new designs. \"Gachapon Senshi\" means toy capsule warrior, as the gachapon toy capsule was a popular format for fans of the series to buy super-deformed versions of their favorite Gundam characters. While the game is considered memorable, especially for being the first in a long line of SD Gundam World games to come, the single-player experience is known for having considerable flaws and a high level of difficulty. While one could forgive the long load times common among the Famicom Disk System games, it was much harder to overlook the exaggeratedly long periods of time that the computer AI took to plan out its moves. This could range from thirty seconds to a several minutes just for one of the three possible commands. Additionally, entering into combat against the computer was a difficult challenge, as the computer opponent played with lightning fast reactions that human players could not compete with without an exceptional amount of practice. It was, however, possible to trick the computer into trapping itself against obstacles on the right maps.", "platform": "Nintendo Famicom Disk System", "release_date": "November 20, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.57", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=s9dVtg8WIl8&amp;index=2&amp;list=PL7RPDkB6wR2h5h9DVxLTd-Ui9o4drVvXd", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43523\n"}