{"name": "Ultraman: Kaijuu Teikoku no Gyakushuu", "overview": "Ultraman: Kaiju Teikoku no Gyakushu, loosely translated as \"Ultraman: Counterattack of the Monster Empire\" is a side scrolling platformer developed for the Family Computer Disk System and published by Bandai at the start of 1987. This game is the first Famicom game dealing with Ultraman. The majority of the game is spent as Hayate, a raygun-sporting agent of the Science Special Search Party, an organization founded to defend the Earth from alien threats. He is limited to a short jump and his raygun, though both tend to be sufficient for taking care of smaller enemies and other minor obstacles. Should Hayate collect enough power from fallen enemies (and from the environment), he is able to transform into Ultraman: A building-sized robotic fighter with a range of special powers. However, Hayate can only stay as Ultraman for three minutes, and all of Ultraman's powers save his basic fighting moves can only be used once per transformation. At the end of each stage (and occasionally partway through) there is a different kaiju from the TV show that Hayate needs to defeat. It is highly recommended that the player find a way to transform into Ultraman if they wish to defeat these larger foes. If all 11 stages are cleared and the player continues, the game will change the character to Dan Moroboshi who can transform into Ultra Seven. Although Ultra Seven's capabilities are the same as Ultraman's, the defensive power of the enemies will be higher. There are two versions of this game, one which was distributed on disk, and one which was distributed through disk writing stations (made available on March 26, 1987) and they feature slightly different background music tunes.", "platform": "Nintendo Famicom Disk System", "release_date": "January 29, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=OhNpeq_Ulro", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/43673\n"}