{"altername_name": ["Game & Watch: Balloon Fight (Crystal Screen)"], "name": "Balloon Fight (Crystal Screen)", "overview": "Balloon Fight is a Game & Watch game released as a part of the Crystal Screen series on November 19, 1986. It was later released as a part of the New Wide Screen series on March 8, 1988. It is a single-screen single-player Game & Watch. Balloon Man is controlled with the d-pad and the eject button. The eject button will send him up in the air. When the button is not pressed, he'll go downwards. The left and right buttons control the direction he goes. The game scrolls from left to right and the goal is to collect the balloons that are scattered in the stages. After collecting 25 balloons in a stage, you'll progress to the next stage. Between each stage is a blinking platform that will warp you to a bonus phase if you press up or down on the d-pad. During the bonus phase, you are asked to collect as many balloons as you can within the given time limit. There are 16 unique phases, though in each phase they repeat their basic design until you beat the level. Some levels have areas where balloon or spark placement is randomly generated. After every 8 stages, you'll enter a boss phase. During these stages, your goal is to dodge all of the Sparks that the boss throws at you. If you do so successfully, you can nab him and put him into prison. The goal of the game is to both beat it and acquire as many points as you can. It should be noted that if the player wants to start automatically at phase 17, then they should hold down the eject button when pressing the game button.", "platform": "Nintendo Game & Watch", "release_date": "November 19, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo R&D1", "publishers": "Nintendo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.38", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Game_%26_Watch_games#Balloon_Fight", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119684-balloon-fight-crystal-screen\n"}