{"altername_name": ["Game & Watch: Bomb Sweeper"], "name": "Bomb Sweeper", "overview": "Bomb Sweeper is a Game & Watch game released as part of the Multi-Screen series on June 15, 1987. It is a vertical multi-screen single-player Game & Watch. It opens like a compact, with an upper and lower screen. The game was never released in Japan. Using the D-pad to move John Solver, you must reach at least one of the bombs hidden in the walls to clear the screen and receive a bonus for the time remaining. The only obstacles in your path are the walls, which you must either manoeuvre around or push them along provided there is no obstruction in the way. Some levels are a test of speed; others are a test of logic and intelligence. Game A consists of a set sequence of maze layouts. These range from a maze requiring no wall-pushing to mazes where you must carefully choose which walls to move to reach the bombs. There is a constant 40-second time limit to each level. Every 10 levels you will enter a scrolling maze where you must avoid getting squashed by the advancing walls until you reach the bomb at the end. Whilst the generous time limit means you can rack up a very high score on this mode, the levels do get more and more devious and testing as you progress. This mode is for the logically minded player. Game B consists of a number of maze layouts, each level is chosen at random from the set. The levels are generally very straightforward and good players can complete each one in 2–4 seconds. The time limit begins at 40 seconds but steadily reduces as you progress, until you are left with just 4 seconds for each level. However, this mode is potentially never-ending, thus the highest scores are possible. However, as there is no pause button, there is no rest and your reactions will be tested. This mode is definitely for the quick-thinking player.", "platform": "Nintendo Game & Watch", "release_date": "June 15, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo R&D1", "publishers": "Nintendo", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.77", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Game_%26_Watch_games#Bomb_Sweeper", "video_link": "https://www.youtube.com/watch?v=5_s-Q0wsi34", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92008-bomb-sweeper\n"}