{"altername_name": ["Game & Watch: Mario's Cement Factory (Table Top)"], "name": "Mario's Cement Factory (Tabletop)", "overview": "Mario's Cement Factory is a Game & Watch video game released in both the Tabletop and New Wide Screen formats in 1983. The model number for the New Wide Screen version was ML-102, while the Tabletop's was CM-72. The model number for the Tabletop version of Mario's Cement Factory has caused some confusion, though it was revealed later than in a German magazine, an image of the game was shown and the logo read \"Concrete Mixer\", suggesting that the game was initially going to be called that, and explaining the model number. In the game, you'll control Mario who'll pull levers to make sure that the cement goes into the mixers. In the game, you control a character in a cement factory. You start at the upper left hand corner of the screen. In the middle, platforms are dropping down on the left side and going up on the right side. Meanwhile, buckets of cement are about to go in the mixers, though there are machines blocking the cement so that they can't go all of the way down. As the player, you have to make sure that the machines don't overflow with cement, and use the lever to make the cement drop the machine below. After you pull the other lever, then the cement will go into the mixer. There are four machines, two on each side. If you fall into the middle without a platform there to support you, then you will lose a life. If the machine fills up with too much cement, then you will also lose a life. For the New Wide Screen version, Nintendo produced an estimated 750,000 copies of the game. The amount that they made for the Tabletop version is unknown. A Mini classics version of the game was released in 1998 which had a keychain connected to it. The game was included as a game in Game Boy Gallery for the Game Boy, and Game & Watch Gallery 4 for the Game Boy Advance. The game was also reissued as a Nintendo Mini Classics title. Gameplay", "platform": "Nintendo Game & Watch", "release_date": "April 28, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.92", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119593-marios-cement-factory-tabletop\n"}