{"altername_name": ["Game & Watch: Zelda"], "name": "Zelda", "overview": "The Zelda Game & Watch (model number ZL-65) is a multi-screen Game & Watch system developed by Nintendo and released in North America in 1989. Its gameplay was heavily inspired by Nintendo Entertainment System game Zelda II: Adventure of Link, and it featured an original story described on the manual. Unlike the other LCD games, this was made by Nintendo and appeared on a Nintendo platform. The handheld console would be Nintendo's penultimate release before the release of the Game Boy (the last being Mario The Juggler). Players control Link and fight through labyrinth chambers on the Game & Watch's lower screen. In the labyrinth chambers, Link faces Poe-like Ghosts, up to four Stalfoses, and a Moblin-like Goblin mini-boss. Stalfoses and Ghosts cannot be defeated and must be dodged and blocked with the shield respectively. The Goblin must be killed in order to complete the lower-screen labyrinth. Once the Labyrinth is complete, stairs appear and the action shifts to the Dragon's Lair in the upper screen. Here Link battles a dragon on the right hand side of the screen while avoiding its fire and tail attacks. The left hand side of the screen displays the dungeon map and items such as the Tomahawk item—unique to this game—that Link gains while fighting the dragon. Upon defeating the dragon, the game starts again with quicker enemies and retaining the player's high score. This Game & Watch game also features a continue button that allows players to continue the game in the event of the player's death.", "platform": "Nintendo Game & Watch", "release_date": "August 26, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo R&D1", "publishers": "Nintendo", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/LCD_games_from_The_Legend_of_Zelda_series#Zelda_(Game_&_Watch)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114290-zelda\n"}