{"altername_name": [], "name": "Phantasie IV: The Birth of Heroes", "overview": "After the evil Nikademus was defeated, the land of Scandor enjoyed a time period of peace, which lasted twenty years. However, when a ship sent to the Skull Island disappeared without trace, Scandor's inhabitants realized a new threat was rising... Phantasie IV: The Birth of Heroes is the fourth entry in the RPG series Phantasie, and the only one that was released exclusively for Japanese computers. Gameplay-wise and visually, the game is very similar to the previous installments. The player creates a party of adventurers (up to six active combatants, including the series' trademark \"random creatures\", such as ogres, minotaurs, lizardmen, etc.), which then roams the top-down world-map, descending into dungeons, and fighting randomly appearing enemies in turn-based combat. Battles allow specific commands such as \"Thrust\", \"Parry\", \"Throw\", etc., and - similarly to the third game - placement of the characters in rows on the battle screen. A new feature is the possibility to choose parents for the characters the player creates. They can both belong to the same race, or produce an offspring in a mixed marriage - which, naturally, influences the newborn's parameters, affinities, etc. Theoretically, it is possible to create a party that consists entirely of children born to troll fathers and gnoll mothers; however, these \"random creatures\" (unlike the privileged races such as humans, dwarves, and elves) can only be either thieves or fighters.", "platform": "NEC PC-8801", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Starcraft", "publishers": "StarCraft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Phantasie_(series)#Phantasie_IV:_Birth_of_Heroes", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/138635-phantasie-iv-the-birth-of-heroes\n"}