{"altername_name": ["Ys III"], "name": "Ys III: Wanderers from Ys", "overview": "The opening scene informs the player that it has been three years since the events of Ys I and Ys II. Adol Christin and his friend Dogi are on a journey. Passing through a town, they find a gypsy caravan and Dogi has his fortune told. The fortune teller's crystal ball explodes and both Adol and Dogi decide to go to Dogi's hometown of Redmont. On the way to Redmont, the pair chance upon a wildcat that attacks them, saving Dogi's childhood friend, Elena Stoddart, in the process. Upon arriving, they learn that the townspeople are being threatened by men from nearby Valestein Castle. Always ready for adventure, Adol decides to assume the task of helping them out. Travelling to Tigray Quarry, Adol discovers that there has been a cave in, and monsters have taken over the quarry. Adol travels deep inside the quarry to rescue Edgar, the mayor of Redmont. After defeating the boss of the Quarry, Ellefale, and claiming the first statue, Adol finds Chester (brother of Elena) threatening Edgar. Adol pulls Edgar back out to the entrance of the quarry and goes back to Redmont. Meeting Elena (formally this time), Adol learns that some statues are being sought by Lord MacGuire, the King of Felghana province (where the game takes place). Another statue is being sought in the Illsburn Ruins, so Adol travels there to retrieve it. Another townsperson, Father Pierre, has gone there as well. Adol gets to an altar of sorts, where he overhears Chester talking with Pierre. After a brief duel with Chester, Adol is caught, and tells Chester that Elena is worried about him. With Lord MacGuire watching, Chester rebuffs Adol and kicks him down into a pit of lava. Battling through monsters, Adol finds a fire dragon, Gilan, and defeats him. The reward gets Adol over a large river of lava by solidifying it. After escaping from the pit, Ellena meets Adol at the top of a staircase. She informs him that the statue is indeed hidden further on. He opens a hidden door and fights a Wyvern, claiming the second statue. Upon coming back to the town, Adol meets up with Dogi, who informs him that he is heading off to the mountains and that Edgar wishes to see Adol. Adol meets with Edgar, who informs him that men from Valestein (Ballacetine in the SNES version) Castle are actively seeking the statues. He informs Adol of a statue in Tigray Quarry. Adol proceeds to the quarry and defeats the monster guarding the third statue. Adol then heads back to Redmont to inform Edgar. Upon arriving at Edgar's house, he interrupts a conversation between Edgar, Lord MacGuire and Bishop Garland about Galbalan. Galbalan, according to Edgar, is a demon of tremendous power who used to rule over the populace of Felgana a long time ago. He was sealed away by a hero using the four statues. Adol is sent to the Eldarm Mountains to chat with the hermit living there. Adol finds Dogi chatting with the Master up on the mountain. The Master tells Adol that a statue is indeed in the mountains, but inaccessible due to a statue that guards the entrance. Adol travels up the mountain to the peak and defeats a Harpy, gaining the staff that opens the way to the statue. He defeats the guardian Dragon, and claims the fourth and final statue. Chester show up, and tries to force Adol to hand over the four statues. A cave in interrupts the conversation, and Dogi digs the two men out. Chester is reunited with Dogi, and they converse briefly. Adol and Dogi leave for town, and find it almost deserted, with Mr. Gardner, the town guard, nowhere to be found. Inside the walls, they find Mr. Gardner and some of the townsfolk. Apparently, while Adol and Dogi were in the mountains, soldiers from Valestein Castle came to the town and kidnapped townsfolk in exchange for the statues. Adol converses with Edgar before setting out for the castle. At Valestein Castle, Adol fights his way down to the dungeons where he finds the townspeople and Father Pierre. He tells Pierre to get the people out of the castle, and goes to find Lord MacGuire. On the way to Lord MacGuire's chambers, he comes across Bishop Garland, who taunts Adol. Garland then reveals himself, and Adol defeats him after a lengthy battle. Upon reaching Lord MacGuire, Adol finds that Lord MacGuire is repentant, and is sorry for his actions. He will make reparations for his actions. As Adol goes back across a bridge, he is met by Elena, who congratulates him on beating the soldiers and being a hero. Galbalan, who has reawoken due to the seal of the statues being broken, kidnaps Elena in midair and taunts Adol, telling him to bring the statues to his island fortress. Adol goes back to town, doubting himself. Edgar and Dogi bring Adol back to his senses, and Adol sets off to rescue Elena. Surviving many challenges, Adol comes to a platform where Ellena and Chester are talking to each other. Galbalan taunts Chester just as Adol arrives. Adol promises the statues to Galbalan, if he will not harm Chester or Elena. Galbalan agrees, and pulls Adol up to his realm. Adol fights and defeats Galbalan, and rescues Elena. Adol finds out that Chester has gone to the very center of Galbalan's Island, to seal it away. Ellena tells Adol that her village and its people are descendants of the man who sealed away Galbalan the first time. Only Chester knows how to sink Galbalan's island, and Adol must not interfere. Adol understands and he and Elena leave the sinking island. The scene shifts to Chester, who is manipulating crystals to sink the island for good. He tells Adol to take care of Elena for him, before sacrificing himself to destroy the island. The island then disappears for good. Back in Redmont, Adol and Dogi are at the Inn getting ready to leave. Dogi tells Adol to go on ahead, as he has something to take care of. They are leaving in the early morning as to not cause a stir within the community. Dogi is chatting with Ellena, who is in love with Adol. Dogi leaves, and Ellena almost stays. She then walks out of the Inn. Mr. Gardner is asking Adol what he and Dogi are planning. Mr. Gardner would like Adol and Dogi to stay, but Adol wants to have more adventures. He and Dogi leave, and as they are walking along the shore, Ellena runs up and shouts to them. Both Dogi and Adol wave goodbye. Elena cries as text scrolls telling about further adventures waiting for Adol and Dogi.", "platform": "NEC PC-8801", "release_date": "July 28, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Nihon Falcom", "publishers": "Nihon Falcom", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "https://en.wikipedia.org/wiki/Ys_III:_Wanderers_from_Ys", "video_link": "https://www.youtube.com/watch?v=PGVkHMWC-1o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109844-ys-iii-wanderers-from-ys\n"}