{
  "name": "Can Can Bunny: Spirits",
  "shortName": "can-can-bunny-spirits",
  "description": "The third in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Can+Can+Bunny\"> Can Can Bunny</a> series, <i>Can Can Bunny Spirits</i> deals with a nameless hero (the player has to give him a name) who is - in accordance with Can Can Bunny tradition - a lonely guy who can't get a girlfriend. One night he sits at home and stares at the moon. Suddenly, the magic fairy Ariko appears in front of him and gives him... no, this time not the Magic Book, but a Magic Crescent! With the help of this crescent, the hero can turn into totally different young men - which will naturally increase his chances in impressing girls and ultimately having sex with them.<br><br><i>Can Can Bunny Spirits</i> is much less of an adventure and more of a strategy game than its predecessors. Success depends even more on the preparations before the actual decisive stage. There is also extensive customization in this game. In the beginning, the hero chooses what he wants to be like, which includes age, height, blood type, and other parameters. Then Ariko introduces several girls to him, of which he has to choose one. Afterwards, it's a matter of asking the right questions and giving the right answers, combining knowledge of the girl's preferences and of the character's statistics. Each girl has a &quot;love meter that can be raised or lowered depending on the player's strategies, and once it is full, the hero can have his way with the girl.",
  "publishedBy": "Cocktail Soft",
  "developedBy": "Cocktail Soft",
  "released": "1991",
  "alsoFor": "PC-98 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/can-can-bunny-spirits",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Cocktail Soft",
          "developer": "Cocktail Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}