{
  "name": "Chiky? Senshi Rayieza",
  "shortName": "chiky-senshi-rayieza",
  "description": "In the year 2300, mankind has finally united, creating a federation government on the Earth and dedicating efforts and resources to space travel. Humans have spread to distant planets, only to face the gravest danger of all: a mysterious alien race that utilizes the newest robotic technology to destroy humanity. The special team Rayieza was stationed on Mars; after an alien assault, only one member, Blue, has survived. The protagonist's orders are to team up with Blue and safely return to Earth, which sounds much easier than it is in reality...<br><br>One of <a href=\"https://www.mobygames.com/search/quick?company=Enix\"> Enix's</a> early RPGs, <i>Chiky? Senshi Rayieza</i> has several distinguishing features. Unlike most RPGs, where the heroes explore the world on foot, in this game the player is mostly confined to the space ship; movement between planets is performed by selecting the appropriate menu command. Each flight between planets takes time (depending on the distance); enemies would pop out randomly and attack the crew. The player usually controls only the protagonist and Blue; both can use beam attacks or the much more powerful, but limited missiles. As in other RPGs, characters gain items and become stronger after defeating enemies.",
  "publishedBy": "Enix Corporation",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "FM-7, PC-88, Sharp X1 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/chiky-senshi-rayieza",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Enix Corporation",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}