{
  "name": "D.P.S: Dream Program System",
  "shortName": "dps-dream-program-system",
  "description": "<i>D.P.S</i> is a collection of three short scenarios, which are unrelated to each other story-wise and can be played separately. Those scenarios are presented as cartridges played on a fictional console named <i>Dream Program System</i>. Each scenario allows the player to choose between two different protagonists, or two different personalities for the protagonist. All of the scenarios feature nudity and/or sexual situations.<br><br>The scenarios in this game include:<ul><li> A medieval fantasy tale entitled <i>Princess Fantasy</i>, in which the player controls a knight who accompanies a princess on a journey. Depending on the personality choice, the knight can either be brave and compassionate, or cynically take advantage of the helpless girl.</li><br>\n<li> A typical &quot;naughty doctor&quot; story, in which the player - as either male or female school doctor - has to &quot;examine&quot; young and pretty female patients, trying not to scare them away by employing too direct methods.</li><br>\n<li> An encounter between a famous female pop idol and her fan (also female), which leads to a bizarre sexual experience. The player can choose to control the events from the point of view of either the star or the fan.</li></ul>The gameplay is essentially that of a visual novel. At almost every screen, the player is given a number of choices, which correspond to answers or actions, according to the situation. Some choices are required to trigger the next event and advance in the game, others are &quot;neutral&quot;, having no effect on the progress, while a few are considered &quot;bad&quot; by the game, leading to Game Over. Scenes, dialogue choices, and story events may vary slightly or significantly, depending on the choice of character in the beginning of a scenario.",
  "publishedBy": "Alice Soft",
  "developedBy": "Alice Soft",
  "released": "Apr 15, 1990",
  "alsoFor": "FM Towns, PC-88, PC-98, Sharp X68000 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/dps-dream-program-system",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Alice Soft",
          "developer": "Alice Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 15, 1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}