{
  "name": "Dream Program System SG set 3",
  "shortName": "dream-program-system-sg-set-3",
  "description": "<i>D.P.S. SG Set 3</i> is the fourth entry in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=D%2eP%2eS%2e\"> D.P.S./Dream Program System series</a>. Like the other <i>D.P.S.</i> games, it is a collection of three short scenarios, which are unrelated to each other story-wise and can be played separately. Those scenarios are presented as cartridges played on a fictional console named <i>Dream Program System</i>. Each scenario allows the player to choose between two different protagonists, or two different personalities for the protagonist. All of the scenarios feature nudity and/or sexual situations.<br><br>The scenarios in this game include:<br><br><li>A rather mundane depiction of a young couple's day directly after their wedding. The two return home and prepare for the &quot;big event&quot; in the night. The player can choose to control either the husband or the wife.<br><br><li>A story entitled <i>Graduation</i>, which begins with a rather standard premise of a shy high school boy trying to express his love to a pretty school mate. However, the events take an unexpected turn when a dragon appears and the girl is hurt. The player can determine the personality of the hero before the start of the episode.<br><br><li>A bizarre fantasy tale with the title <i>Rabbit P4P</i>. The protagonist follows a mysterious &quot;bunny girl&quot; into a fairy tale-like realm, where he has to figure out what to do in order to win the graces of magical creatures, which look like young and pretty women. The personality choice influences the hero's attitude in this episode as well.<br><br>The gameplay is the same as in other <i>D.P.S.</i> games. At almost every screen, the player is given a number of choices, which correspond to answers or actions, according to the situation. Some choices are required to trigger the next event and advance in the game, others are &quot;neutral&quot;, having no effect on the progress, while a few are considered &quot;bad&quot; by the game, leading to Game Over. Scenes, dialogue choices, and story events may vary slightly or significantly, depending on the choice of character in the beginning of a scenario.",
  "publishedBy": "Alice Soft",
  "developedBy": "Alice Soft",
  "released": "1991",
  "alsoFor": "FM Towns, PC-88, PC-98, Sharp X68000 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/dream-program-system-sg-set-3",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Alice Soft",
          "developer": "Alice Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/260776-dream-program-system-sg-set-3-msx-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Plastic Case",
      "country": "Japan",
      "platforms": "MSX"
    }
  ]
}