{
  "name": "Dream Program System SG Set 2",
  "shortName": "dream-program-system-sg-set-2",
  "description": "<i>D.P.S. SG Set 2</i> is the third entry in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=D%2eP%2eS%2e\"> D.P.S./Dream Program System series</a>. Like the other <i>D.P.S.</i> games, it is a collection of three short scenarios, which are unrelated to each other story-wise and can be played separately. Those scenarios are presented as cartridges played on a fictional console named <i>Dream Program System</i>. Each scenario allows the player to choose between two different protagonists, or two different personalities for the protagonist. All of the scenarios feature nudity and/or sexual situations.<br><br>The scenarios in this game include:<br><br><li>A horror story entitled <i>Antique House</i>, in which a young couple is trapped at night in a secluded haunted mansion, possessed by monsters. The player can choose the personality of the female character before beginning, influencing the story with this choice.<br><br><li>A modern-day story without any supernatural elements, entitled <i>Red Night</i>. The protagonist is a man who finds himself in a hotel when a fire starts. Trying to escape, he enters a room occupied by a prostitute. The following events evolve slightly differently, depending on the personality choice made by the player before the start of the game.<br><br><li>A sequel to the second episode of the <a href=\"https://www.mobygames.com/search/quick?game=dream+program+scenario\"> first D.P.S. game</a>. Once again, the player chooses either the male doctor Katsuki or the female doctor Katsumi whose goal is to seduce the patient, the cute school girl Yumiko.<br><br>The gameplay is the same as in other <i>D.P.S.</i> games. At almost every screen, the player is given a number of choices, which correspond to answers or actions, according to the situation. Some choices are required to trigger the next event and advance in the game, others are &quot;neutral&quot;, having no effect on the progress, while a few are considered &quot;bad&quot; by the game, leading to Game Over. Scenes, dialogue choices, and story events may vary slightly or significantly, depending on the choice of character in the beginning of a scenario.",
  "publishedBy": "Alice Soft",
  "developedBy": "Alice Soft",
  "released": "May 15, 1991",
  "alsoFor": "FM Towns, PC-88, PC-98, Sharp X68000 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/dream-program-system-sg-set-2",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Alice Soft",
          "developer": "Alice Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 15, 1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}