{
  "name": "Dual Targets: The 4th Unit Act.3",
  "shortName": "dual-targets-the-4th-unit-act3",
  "description": "Three months have passed since the destruction of the oceanic base of the criminal organization WWWF. One day, Blon-Win and Asshu spot an android assassin attempting to infiltrate the Unified Force base. It appears that the androids, controlled by the WWWF, intend to kidnap the scientist responsible for the revolutionary device known as PPB (Psycho Power Booster). In addition, they have developed a bionic soldier who is a clone of Blon-Win. As if this weren't enough, Blon-Win's old nemesis Dalzy appears on the stage as well...<br><br><i>Dual Targets</i> is the third entry in the 4th Unit series and a direct sequel to <a href=\"https://www.mobygames.com/game/4th-unit-2\">The 4th Unit 2</a>. The game retains the simple sporadic turn-based battles of the predecessors. However, the core adventure gameplay has been radically simplified and modified to resemble a visual novel. There is no direct interaction with the environment; instead, the player is prompted to select emotional responses (&quot;happy&quot;, &quot;angry&quot;, etc.) during dialogue, as well as alternate between &quot;Rescue&quot;, &quot;Think&quot;, and &quot;Fight&quot; commands during the storyline. These choices may influence the plot and lead the game to different endings, most of which are considered &quot;false&quot;.",
  "publishedBy": "Data West",
  "developedBy": "Data West",
  "released": "1989",
  "alsoFor": "FM-7, FM Towns, PC-88, PC-98, Sharp X1, Sharp X68000, Windows | Combined View",
  "genre": "Adventure",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/dual-targets-the-4th-unit-act3",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Data West",
          "developer": "Data West",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}