{
  "name": "El Cid",
  "shortName": "el-cid",
  "description": "<i>El Cid</i> is an isometric action game starring El Cid Campeador, a Castilian warrior who was a major contributor to the Spanish Reconquista, the reconquest of the Hispanic territories which were invaded and controlled by the Moors from 722 to 1492. The events of the game take place in a fictional version of the 11th century, a dark time full of incessant fights between the the good and the evil. A legend whose antiquity was lost in the abyss of the times assured the existence a parchment that, when read by the evil forces, would trigger such big wave of disasters that Satan would be able to seize the Earth and assure his dominion as the prince of the darkness.<br><br>The audacious protagonist, having learned about the legend, decided to recover it for the forces of the good, since the legend also affirmed that if this document would be read by two persons of good intentions, its effects would be annulled for ever. With this objective in mind, he begins to search the magical key that released the spell that had hidden the parchment. But the task is not going to be simple. Many other knights decided to find the parchment, hoping to attain glory or for less worthy reasons. Luckily for Rodrigo (el Cid), the many years of battle against the Moors had fortified his arm and he is willing to use his sword to get rid of the opposition.",
  "publishedBy": "Dro Soft",
  "developedBy": "Dro Soft",
  "released": "1987",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/el-cid",
  "visual": "Fixed / flip-screen, Isometric",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Dro Soft",
          "developer": "Dro Soft",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/134620-el-cid-msx-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/134621-el-cid-msx-screenshot-introduction.png",
      "caption": "Introduction"
    },
    {
      "link": "/images/shots/l/134622-el-cid-msx-screenshot-just-start-the-game.png",
      "caption": "Just start the game"
    },
    {
      "link": "/images/shots/l/134623-el-cid-msx-screenshot-use-your-sword.png",
      "caption": "Use your sword"
    },
    {
      "link": "/images/shots/l/134624-el-cid-msx-screenshot-be-careful-don-t-get-hit-by-arrows.png",
      "caption": "Be careful... don't get hit by arrows"
    },
    {
      "link": "/images/shots/l/134625-el-cid-msx-screenshot-next-mission.png",
      "caption": "Next mission"
    }
  ],
  "cover": []
}