{
  "name": "Ginga Eiy? Densetsu II",
  "shortName": "ginga-eiy-densetsu-ii",
  "description": "The second game in the series based on the anime adaptation of Yoshiki Tanaka's <i>Legend of the Galactic Heroes</i> novels. The novels (and the games) are set in a futuristic world, where humanity has conquered the entire Milky Way and split into two powerful warring states, each encompassing different systems and planets: the Galactic Empire (modeled after Bismark's 19th century Prussia), and the democratic Free Planets Alliance. <br><br>The game plays very similarly to its <a href=\"https://www.mobygames.com/game/pc98/ginga-eiy-densetsu\"> predecessor</a>: the player selects a scenario and tries to fulfill the victory requirements it imposes. There are five possible scenarios in the game. Unlike the first game, there is an option to choose which space fleet to control (Imperial or Alliance) for each scenario. The player takes control of planets allied with the chosen state. It is possible to deploy an entire fleet of a planet into the battle, or have it supply separate units. The players navigates the units (space ships of different kinds) on the top-down map in turn-based fashion, attacking or defending against enemy ships. The ship encounters are automatic and displayed as small animated cut-scenes. There are more ship types than the previous game, more different animations during battles, and detailed characteristics and portraits for various generals fighting for the two states.",
  "publishedBy": "Bothtec, Inc.",
  "developedBy": "Bothtec, Inc.",
  "released": "Dec 23, 1990",
  "alsoFor": "PC-88, PC-98, Sharp X68000 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/ginga-eiy-densetsu-ii",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Bothtec, Inc.",
          "developer": "Bothtec, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 23, 1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}