{
  "name": "Ginga Eiy? Densetsu",
  "shortName": "ginga-eiy-densetsu",
  "description": "This is the first in <a href=\"https://www.mobygames.com/search/quick?company=Bothtec\"> Bothtec's</a> <a href=\"https://www.mobygames.com/search/quick?gamegroup=ginga+eiyuu\"> series</a> of games based on the anime adaptation of <a href=\"https://www.mobygames.com/search/quick?developer=Yoshiki+Tanaka\">Yoshiki Tanaka</a>'s science fiction novel cycle <i>Legend of the Galactic Heroes</i>. The games are set in the fictional future as depicted in the novels: humanity has spread all over the Milky Way, and split into two powerful states which are having a permanent war with each other: the Galactic Empire, and the Free Planets Alliance. Two genius strategists are leading the forces of their respective states: Reinhard von Müsel for the Empire, and Yang Wenli for the Alliance.<br><br>The game is dedicated entirely to large-scale strategic battles and is not particularly story-driven. There are five different scenarios to choose from, which put the player in control of either Imperial or Alliance forces and revolve around &quot;historical&quot; battles based on the novels' lore, with exact dates and victory conditions.<br><br>The combat takes place between space ships, and is set entirely in outer space. The player usually takes control of a &quot;home planet&quot;, which is able to deploy a limited number of units. The player then navigates the units in turn-based fashion on the top-down map. Enemies typically appear after a few turns; depending on the goal, the player must prevent them from invading planets, destroy them, have his own ships invade a planet, etc. <br><br>The space ships come in different flavors: high-speed battle ships, cruisers, supply ships, etc. Each ship has different mobility, attack range, weapons, defense parameters, etc. Actual combat is displayed on a separate screen and is automatic. The player usually has a choice to use different weapons (cannons, missiles, etc.) against the enemy ships.",
  "publishedBy": "Bothtec, Inc.",
  "developedBy": "Bothtec, Inc.",
  "released": "Nov 09, 1989",
  "alsoFor": "PC-88, PC-98, Sharp X68000 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/ginga-eiy-densetsu",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Bothtec, Inc.",
          "developer": "Bothtec, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 09, 1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}