{
  "name": "Hanafuda Koi-Koi",
  "shortName": "hanafuda-koi-koi",
  "description": "Koi-Koi is a traditional Japanese two-player card game. It is played with the hanafuda, which is a flower themed deck consisting of four cards in each of twelve suits corresponding to months of the year. The aim is to capture certain combinations, known as yaku, using cards played from the hand you are dealt, and picked up from the table. <br><br>Each round starts with eight cards placed face up on the table, and eight dealt to each player. The first player must play a card to the table. If it matches the same suit as an existing table card, then both it and the played card are captured by that player. A new card is then drawn from the deck and immediately played to the table. Again, if this matches, the player captures that card, and it is then the opponent's move. The first player to make a yaku can choose to win the hand, or say &quot;Koi koi&quot; to continue the game. If a second yaku is completed before your opponent, you win double points. Otherwise, your opponent wins double points, and a new hand is dealt.<br><br>If no player completes a yaku when their cards run out, a point score is calculated from each player's captured cards and the player with the higher score wins the round and gains a point. The winner of the previous round then plays first in the next round. Play continues for 12 rounds (one for each month of the year), after which the player with the highest score wins.<br><br>This implementation of the game automatically detects when different yaku have been played, and does the scoring for you. It also has only one fairly low level of difficulty for the computer opponent, allowing a novice to win the game even if they imperfectly recognize the cards and can't remember all of the yaku.\n",
  "publishedBy": "ASCII Corporation",
  "developedBy": "RAM Software",
  "released": "1984",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/hanafuda-koi-koi",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "ASCII Corporation",
          "developer": "RAM Software",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/979188-hanafuda-koi-koi-msx-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/979189-hanafuda-koi-koi-msx-screenshot-showing-the-four-february.png",
      "caption": "Showing the four &quot;February&quot; cards."
    },
    {
      "link": "/images/shots/l/979190-hanafuda-koi-koi-msx-screenshot-starting-a-new-game.png",
      "caption": "Starting a new game."
    },
    {
      "link": "/images/shots/l/979191-hanafuda-koi-koi-msx-screenshot-selecting-one-of-two-matches.png",
      "caption": "Selecting one of two matches to my play of the left-most card."
    },
    {
      "link": "/images/shots/l/979192-hanafuda-koi-koi-msx-screenshot-captured-cards-at-the-end.png",
      "caption": "Captured cards at the end of the round."
    },
    {
      "link": "/images/shots/l/979193-hanafuda-koi-koi-msx-screenshot-should-i-risk-koi-koi.png",
      "caption": "Should I risk Koi-Koi?"
    },
    {
      "link": "/images/shots/l/979194-hanafuda-koi-koi-msx-screenshot-let-s-not-koi-koi-i-m-happy.png",
      "caption": "Let's not Koi-Koi. I'm happy with 16 points."
    },
    {
      "link": "/images/shots/l/979195-hanafuda-koi-koi-msx-screenshot-after-12-months-of-play-computer.png",
      "caption": "After 12 &quot;months&quot; of play. Computer 15 points, challenger 30 points."
    }
  ],
  "cover": []
}