{
  "name": "Hokkaid? Rensa Satsujin: Okhotsk ni Kiyu",
  "shortName": "hokkaid-rensa-satsujin-okhotsk-ni-kiyu",
  "description": "In <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,50434/\">Yuji Horii's</a> follow-up to <a href=\"https://www.mobygames.com/game/portopia-renzoku-satsujin-jiken\">The Portopia Serial Murder Case</a>, you once again play as a Tokyo police detective (whose name you assign) charged with solving a mysterious murder.  This time, your initial investigation of a dead body found floating in Tokyo Bay quickly leads you to follow the trail of clues to Hokkaido.  There, assisted by local police officer Shunsuke &quot;Shun&quot; Saruwatari, you will visit numerous popular real-life tourist attractions as you attempt to puzzle out the truth behind an ever-expanding series of murders.<br><br>While maintaining the same first-person adventure format, this game drops the parser-driven interface used in earlier versions of the preceding title, instead introducing the menu system which was to become typical of Japanese adventure games.  The player selects from a number of simple commands (Go, Ask, Take, Show, Photograph, etc.) to find new evidence and advance the plot; also, the &quot;Examine&quot; command can (and sometimes must) be used to point at and examine specific spots in the scene pictured, so that the interface is not solely text-based.",
  "publishedBy": "Login Soft",
  "developedBy": "Armor Project",
  "released": "Oct 18, 1985",
  "alsoFor": "FM-7, NES, PC-88, PC-98 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/hokkaid-rensa-satsujin-okhotsk-ni-kiyu",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Login Soft",
          "developer": "Armor Project",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Oct 18, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}