{
  "name": "Humphrey",
  "shortName": "humphrey",
  "description": "Everything happened after the opening of Humphrey's last film. As an alien movie mega-star, he always had fans, but this time they were uncontrollable. They jumped on his back, embraced him, kissed him, tore his clothes... it was terrible. Humphrey finished in hospital with all kinds of contusions and a nervous crisis that him left postrated in bed for several months. When he recovered, he bought a new mansion to get more privacy. Unfortunately the building was only half finished. And the decorator had painted all the rooms exactly the wrong colour. Well if you want a job done right...<br><br>Humphrey is a top-down maze game, where you control the titular character and must visit every square in the 40 levels of his incomplete house to paint them the correct colour. Complicating matters are fans who infest the premises, and whose touch will turn the now socially anxious Humphrey completely insane. Fortunately, Humphrey can make frenzied leaps of terror over his fans. But when he lands he must also contend with special squares which are electrified, teleporters, bombs and various others.\n",
  "publishedBy": "Zigurat Software S.L.",
  "developedBy": "Made in Spain",
  "released": "1988",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/humphrey",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Zigurat Software S.L.",
          "developer": "Made in Spain",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/351994-humphrey-msx-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/351995-humphrey-msx-screenshot-credits.png",
      "caption": "Credits"
    }
  ],
  "cover": []
}