{
  "name": "Ingrid's Back!",
  "shortName": "ingrids-back",
  "description": "Ingrid is Ingrid Bottomlow, the intellectual-but-clumsy gnome we met in <a href=\"https://www.mobygames.com/game/gnome-ranger\">Gnome Ranger</a>. Her beloved home village Little Moaning is earmarked for a yuppie-friendly transformation by Jasper Quickbuck of Ridley's Manor. <br><br>Ingrid has three cunning plans to stop him - producing a petition with everybody's signature, finding a more orthodox prevention method, and finally infiltrating Ridley's Manor itself by pretending to be a maid, and then finding proof that he's a dodgy geezer who should be locked up. These three quests can be played in any order, although they logically follow on from each other. She is accompanied by Flopsy the dog in the first 2 parts, and her cousin Daisy in the third.<br><br><i>Ingrid's Back!</i> uses the same game system as the original, and other contemporary Level 9 titles such as <a href=\"https://www.mobygames.com/game/knight-orc\">Knight Orc</a> . Giving instructions to other characters (including Flopsy) and jumping around the map using GO TO and FOLLOW commands. A living and breathing world of people travelling, trading and relaxing underpins it all, and plays a part in most puzzles.<br><br>The disk versions of the game contain graphics, the exception being the ports for Apple II and Atari 8-bit, which are text-only.",
  "publishedBy": "Level 9 Computing, Ltd.",
  "developedBy": "Level 9 Computing, Ltd.",
  "released": "1988",
  "alsoFor": "Amiga, Amstrad CPC, Amstrad PCW, Apple II, Atari 8-bit, Atari ST, BBC Micro, Commodore 64, DOS, Macintosh, ZX Spectrum | Combined View",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/ingrids-back",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Level 9 Computing, Ltd.",
          "developer": "Level 9 Computing, Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": "text-only version"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}