{
  "name": "Joker II",
  "shortName": "joker-ii",
  "description": "<i>Joker II</i> continues the story that started in <a href=\"https://www.mobygames.com/game/joker\"> Joker</a>. In the end of the first game, the young hero Wild had to confront the sorceress Claudia, who intended to resurrect the evil Joker, which caused what the Native Americans of the region called &quot;The Great Disaster&quot;. Six months have passed since the tragic outcome of those events. Wild is taken care by his friends and companions. The same nightmare pursues him: he sees his sweetheart Laura calling for him, begging him to save her... Wild has to rebuild his life from scratch, but this nightmare ties him to his past... so he ventures out to look for answers once again.<br><br>Gameplay-wise, <i>Joker II</i> is pretty much identical to its predecessor. It is a Japanese-style adventure without puzzles, but with more interaction and exploration possibilities than it is usually the case with games of its genre. Graphically the game also looks very similarly; since most of it takes place in the same locations, many images were simply transferred from the first game.<br><br>Like its predecessor, <i>Joker II</i> has several scenes with nudity and mild sexual situations.",
  "publishedBy": "Birdy Soft",
  "developedBy": "Birdy Soft",
  "released": "Sep 04, 1992",
  "alsoFor": "PC-98, Sharp X68000 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/joker-ii",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Birdy Soft",
          "developer": "Birdy Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 04, 1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}