{
  "name": "Joker",
  "shortName": "joker",
  "description": "<i>Joker</i> is set in the time period commonly known as the &quot;Old West&quot; or &quot;Wild West&quot; in the United States of America. The protagonist of the game is a young man nicknamed Wild, who lives in a quiet Native American village. Years ago, the village was hit by something its inhabitants have since called &quot;The Great Disaster&quot;. In order to seal the forces that caused the catastrophe, Wild's father sacrificed his own life. Now, the ceremonial day of the White Magic approaches. The youngest in the line of witches, a girl named Laura, must predict the future for the village and the world. For an unknown reason, Laura is unable to see into the future. Concerned, the village elder sends Wild on a mission to the nearby town, to find out what could cause this and if there is a way to prevent the Great Disaster from returning...<br><br><i>Joker</i> is essentially a Japanese-style adventure, with strictly menu-based interface, still screens viewed from first-person perspective, and no real puzzles. However, the game offers more interaction possibilities and less linear progression than it is usually the case in comparable games. The player must explore the town and talk to its inhabitants in order to advance the story and get to the bottom of the mystery.<br><br>The game has scenes with nudity and rather mild depictions of sexual situations.",
  "publishedBy": "Birdy Soft",
  "developedBy": "Birdy Soft",
  "released": "Jan 14, 1992",
  "alsoFor": "PC-98, Sharp X68000 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/joker",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Birdy Soft",
          "developer": "Birdy Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jan 14, 1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}