{
  "name": "Kids on Keys",
  "shortName": "kids-on-keys",
  "description": "This is a collection of three mini-games designed to drill in some basic reading and typing skills to the young microcomputer user of the early '80s.  The first of the three games (each with four skill levels, demanding faster reflexes) presents the player with falling letters which must be typed correctly before hitting the bottom of the screen... and eventually the game's mascot floats down defying the player to type in an entire <i>word</i>.  The second game takes word-typing as a given skill, as the player is now in charge of typing in the full names of icons of common household objects gradually floating down the screen.  In the third game, an object is named on the bottom of the screen and the player must punch in the correct number corresponding to the object's icon, displayed on screen.<br><br>The second and third games have bonus rounds whose gameplay is as the regular rounds, except that the icons are now partially obscured, demanding a certain exercise of player memory faculties.",
  "publishedBy": "Sony Computer Entertainment Espa&ntilde;a",
  "developedBy": "Spinnaker Software Corporation",
  "released": "1985",
  "alsoFor": "Apple II, Atari 8-bit, Commodore 64, DOS, TRS-80 CoCo, VIC-20, ZX Spectrum | Combined View",
  "genre": "Action, Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/kids-on-keys",
  "visual": "",
  "gamePlay": "Arcade, Mental training",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Sony Computer Entertainment Espa&ntilde;a",
          "developer": "Spinnaker Software Corporation",
          "ported": "Idealogic S.A.",
          "country": " Spain",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}