{
  "name": "K?nai Shasei 1: Yo ni mo H na Monogatari",
  "shortName": "knai-shasei-1-yo-ni-mo-h-na-monogatari",
  "description": "<i>K?nai Shasei</i> opens with a text introduction that describes a miraculous Girls' High School that can be accessed by sailing through the Indian Ocean or walking along the Silk Road - a school that even the famous Marco Polo allegedly describes in his memoirs. This establishes the humorous tone of subsequent narrative, which has little to do with history and a lot to do with pretty high school girls. The game has no real story, being instead composed of five unrelated vignettes, short episodes that feature a sexy high school girl, a male protagonist (named &quot;God&quot; by default), and various comical and erotic situations under different circumstances: meeting in a school, haunted house, crowded train station, etc.<br><br>The gameplay walks the middle ground between a &quot;normal&quot; Japanese-style adventure and a visual novel. There are verb commands and sometimes also vast sub-menus with objects that allow text-based interaction; however, many segments are very straightforward and only involve occasional choice-making. There are also a few mini-games, such as a quiz, which must be solved by the player in order to avoid a premature Game Over.",
  "publishedBy": "FairyTale",
  "developedBy": "FairyTale",
  "released": "Sep 13, 1991",
  "alsoFor": "PC-98 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/knai-shasei-1-yo-ni-mo-h-na-monogatari",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "FairyTale",
          "developer": "FairyTale",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 13, 1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}