{
  "name": "Kung Fu Master",
  "shortName": "kung-fu-master__",
  "description": "In <i>Kung Fu Master</i> the player takes control of Master. As Master the player can kick and punch enemies and objects in order to reach the objectives given by the game. The game is divided in levels but there's a difference between even and odd levels. In the odd levels Master moves through a tunnel and destroy all wooden dummies that come his way. In odd levels the objective is to find various parts of a broken key. When all parts are found the key can be used. The key parts are hidden behind large pillars that the player must destroy to find out if it contains a key. In this mode the player must also destroy a number of wooden dummies. There are red and blue wooden dummies that can appear and must be destroyed using a specific attack from a specific distance. Different colored pillars also require different attacks.<br><br>The player earns a score for each finished mission and the goal is to reach the highest score. An indicator on the screen shows the number of dummies that remains to be destroyed. The player can also get hurt by the dummies and other hazards that are thrown his way such as knives. Master has only a limited number of lives before the game is over. Each mission also has a time limit within it must be completed. Every time the player finishes the two levels the difficulty is increased. The player can choose at which difficulty to begin.",
  "publishedBy": "ASCII Corporation",
  "developedBy": "Mass Tael Co., Ltd.",
  "released": "1984",
  "alsoFor": "Spectravideo | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/kung-fu-master__",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "ASCII Corporation",
          "developer": "Mass Tael Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}