{
  "name": "Laser Squad",
  "shortName": "laser-squad",
  "description": "In <i>Laser Squad</i> you control a group of space marine-like soldiers (and the occasional cyborg). Before taking them into battle (viewed from above and progressing in turns), you must buy them weapons and armour with a predetermined amount of credits, taking into account the individual abilities of your squad. Unlike X-COM, the soldiers do not gain experience over time.<br>\nThe game also features a two player hotseat multiplayer option.<br><br>Initial ZX Spectrum release (and C64 &amp; Amstrad CPC cassette tape releases) had three missions:\n<ul><li>1: <i>The Assassins</i> - where you must face down Sterner Regnix and his guards</li>\n<li>2: <i>Moonbase Assault</i> - which challenges you to destroy the OmniCorp database</li>\n<li>3: <i>Rescue from the Mines</i> - eschew violence in favour of a rescue mission</li></ul>\nTwo more scenarios were available via mail order, later releases by Blade Software and subsequent ports already included them:\n<ul><li>4: <i>The Cyber Hordes</i> - defend a rebel station and its seven stabilizer cores from an advancing imperial droid invasion</li>\n<li>5: <i>Paradise Valley</i> - following the destruction of the stabilizer cores, escape from the colony with the device containing blueprints for advanced rebel starfighter</li></ul>Two additional missions were released with mail order <a href=\"https://www.mobygames.com/search/quick?game=Laser+Squad+Kit\">expansion kit</a>.\n",
  "publishedBy": "Blade Software Ltd.",
  "developedBy": "Target Games Limited",
  "released": "1988",
  "alsoFor": "Amiga, Amstrad CPC, Atari ST, Commodore 64, DOS, PC-98, ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/laser-squad",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Blade Software Ltd.",
          "developer": "Target Games Limited",
          "ported": "",
          "country": " Italy",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}