{
  "name": "Mash? Denki: La Valeur",
  "shortName": "mash-denki-la-valeur",
  "description": "In this game, the player controls a swordsman named Alan. One day he arrives at the village of Flodi, and finds out that his help is needed: the daughter of the village elder, Sophia, has been kidnapped by monsters and taken into the nearby cave. Naturally, rescuing Sophia is just the first quest among the many perils that await the hero on his journey...<br><br><i>La Valeur</i> is a RPG that mostly follows the Japanese format: the hero wanders through the top-down locations, fighting randomly appearing enemies in turn-based combat, gaining money and experience, leveling up automatically, and advancing the story in a linear fashion. <br><br>However, there are also some less traditional features in the game. There are three classes of weapons, distinguished by the type of damage they inflict: slashing, piercing, and bludgeoning. Different types of enemies are strong/weak against different classes of weapons. Magic is learned by obtaining keys from wizards in various towns, searching the surrounding areas for treasure chests, retrieving magic rings of different kinds from them, and then bringing them back to the wizard to learn new spells.<br><br>The entire quest is played solo, without party members. There is no &quot;world map&quot;, which is characteristic for other games of this kind. The gameplay is heavy on &quot;level-grinding&quot;; typically, a certain level must be reach in a given area before the hero is able to defeat the boss enemy. After having reached this level, regular enemies of that area stop giving experience points.",
  "publishedBy": "Kogado Studio, Inc.",
  "developedBy": "Kogado Studio, Inc.",
  "released": "1990",
  "alsoFor": "PC-88, PC-98, TurboGrafx CD, Windows | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/mash-denki-la-valeur",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Kogado Studio, Inc.",
          "developer": "Kogado Studio, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}