{
  "name": "Might and Magic: Book One - Secret of the Inner Sanctum",
  "shortName": "might-and-magic-book-one-secret-of-the-inner-sanctum",
  "description": "A party of adventurers in what appears to be a medieval fantasy world called Varn is looking for an entrance to the highly coveted Inner Sanctum. Before long the heroes realize that one of the four kings that rule the countries of Varn is in fact an impostor, a creature from outer space. Their task is to find the real king and ultimately stop the mysterious space traveler, revealing the truth about the world's origin in the process.<br><br><i>The Secret of the Inner Sanctum</i> is a role-playing game and the first installment in the <i>Might and Magic</i> series. Core gameplay concept is similar to that of <a href=\"https://www.mobygames.com/search/quick?gamegroup=Wizardry\">Wizardry</a> games, though the game does not focus solely on dungeon crawling and features overworld areas and towns that can be physically navigated. In this way the game resembles <a href=\"https://www.mobygames.com/game/tales-of-the-unknown-volume-i-the-bards-tale\">The Bard's Tale</a>, though it has a significantly larger playing environment with several towns. The entire game is viewed from first-person perspective, and the game environment consists of maze-like passages made with pseudo-3D graphics.<br><br>In the beginning of the game, the player creates a party of six adventurers. There are six classes to choose from: knight, robber, sorcerer, cleric, paladin, and archer. Each character has six main attributes: might, endurance, accuracy, personality, intelligence, and luck, with each class requires proficiency in a specific attribute for effective functioning. There are also five races to choose from: humans, elves, dwarves, gnomes, and half-orcs.<br><br>As in most RPGs, the gameplay revolves around exploring the game world and leveling up to be able to proceed to the story-advancing challenges. The party starts in a particularly weak state, equipped with only clubs and having no money. The player is free to explore most of the game's locations in any order, and there are few hints as to what needs to be done to advance the plot. Turn-based battles against randomly appearing enemies typically take place against a group of monsters more or less equal in size to the player-controlled party, but enemy reinforcements can appear once their comrades have been slain. It is also possible to try and bribe enemies or surrender to them before entering combat.<br><br>The game has no auto-mapping feature of any kind and it is only possible to save the player's progress at inns located in towns.<br><br>The <a href=\"https://www.mobygames.com/game/turbografx-cd/might-and-magic_\">TurboGrafx CD version</a> of this game has significant differences.",
  "publishedBy": "StarCraft, Inc.",
  "developedBy": "New World Computing, Inc.",
  "released": "1988",
  "alsoFor": "Apple II, Commodore 64, DOS, FM-7, Macintosh, NES, PC-88, PC-98, Sharp X1, Sharp X68000 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/might-and-magic-book-one-secret-of-the-inner-sanctum",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "StarCraft, Inc.",
          "developer": "New World Computing, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/539546-might-and-magic-book-one-secret-of-the-inner-sanctum-msx-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/539547-might-and-magic-book-one-secret-of-the-inner-sanctum-msx-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/539548-might-and-magic-book-one-secret-of-the-inner-sanctum-msx-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/539551-might-and-magic-book-one-secret-of-the-inner-sanctum-msx-other.jpg",
      "scanOf": "Other",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/539552-might-and-magic-book-one-secret-of-the-inner-sanctum-msx-other.jpg",
      "scanOf": "Other",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/539549-might-and-magic-book-one-secret-of-the-inner-sanctum-msx-manual.jpg",
      "scanOf": "Manual",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/539550-might-and-magic-book-one-secret-of-the-inner-sanctum-msx-manual.jpg",
      "scanOf": "Manual",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "MSX"
    }
  ]
}