{
  "name": "Minder",
  "shortName": "minder_",
  "description": "Based on the British TV series of the same name, you play dodgy businessman Arthur Daley and your aim is to amass as much money as possible in two weeks by buying and selling merchandise of dubious provenance. Assisting you is your bodyguard/minder Terry McCann, while the policeman Sgt. Chisholm is ready to fine you if he catches you with stolen goods.<br><br>You start the game with two thousand pounds and some inventory in your storage locker. Some of the goods may have already been promised to someone, and just need to be delivered. Other goods are expected, but have yet to be collected from the supplier. Goods can be bought and sold by visiting individual sellers, or the Winchester pub where a variety of wheeler-dealer types hang out. Each character present at the time is represented graphically in the top half of the screen and is associated with a number. By pressing that number (quickly, as there is a time limit) you can initiate conversation with that character. If you fail to select a character before \nthe time limit, a random character may start speaking with you. All dialogue involves buying items from them (using text commands like &quot;I WANT&quot;, &quot;HOW MUCH&quot;, &quot;OFFER&quot;) or selling items to them.<br><br>Once a deal has been agreed, the goods need to be moved. Your minder, Terry McCann can assist with this, and can be found at the Winchester, or in his flat (although he will tend to be uncooperative after working hours). He can be asked to collect or deliver items. If you are meeting with a dealer who might be upset with you because you have sold them poor quality merchandise, you can ask Terry to &quot;MINDER&quot; and he will accompany you to prevent violence (to you). Terry can also &quot;DUMP&quot; goods if they are stolen and you have the law breathing down your neck, so need to just get rid of them. You can tell goods are stolen because you will be questioned about them at odd times by Sgt. Chisholm. If he catches you with the goods at the storage locker, you will need to pay a hefty fine.<br><br>",
  "publishedBy": "dk'tronics",
  "developedBy": "dk'tronics",
  "released": "1985",
  "alsoFor": "Amstrad CPC, ZX Spectrum | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/minder_",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "dk'tronics",
          "developer": "dk'tronics",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/838791-minder-msx-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/838792-minder-msx-screenshot-start-of-game-at-home.png",
      "caption": "Start of game, at home"
    },
    {
      "link": "/images/shots/l/838793-minder-msx-screenshot-what-to-do.png",
      "caption": "what to do..."
    },
    {
      "link": "/images/shots/l/838794-minder-msx-screenshot-look-up-inventory.png",
      "caption": "Look-up Inventory"
    },
    {
      "link": "/images/shots/l/838795-minder-msx-screenshot-driving-to-another-location.png",
      "caption": "Driving to another location"
    },
    {
      "link": "/images/shots/l/838797-minder-msx-screenshot-at-waring.png",
      "caption": "At Waring"
    }
  ],
  "cover": []
}