{
  "name": "Mr. Do!'s Castle",
  "shortName": "mr-dos-castle",
  "description": "<i>Mr. Do!'s Castle</i> is an action platform game which has you in a castle consisting of several floors, each of which contain a variety of blocks. You control Mr. Do! the clown who has a hammer which can be used to knock out the blocks in the floor. Wandering throughout the castle are deadly unicorns which are constantly trying to catch you. Your goal is to earn as many points as possible and to progress through the increasingly difficult castles. <br><br>There are two ways to complete a castle; you can either destroy all of the deadly unicorns by crushing them with blocks, or you can knock out all of the blocks which have a cherry symbol on them. In addition to the cherry blocks, there are three blocks with a key. If all three key blocks are knocked out, the door on the roof of the castle unlocks. If you make it to the door, all of the unicorns will temporarily become harmless and will contain a letter. If you hit a letter unicorn, you will earn a letter in the word EXTRA. Spell the complete word, and you will earn an extra life. <br><br>The last type of block you'll encounter has a skull on it. If you knock out two skull blocks, all of the blocks between them will also be knocked out and replaced with a bridge. As the castles progress, the castle layout will become trickier and the unicorns become faster and more numerous.",
  "publishedBy": "Sony Corporation",
  "developedBy": "Universal Co., Ltd.",
  "released": "1984",
  "alsoFor": "Arcade, Atari 2600, Atari 5200, Atari 8-bit, ColecoVision, Commodore 64 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/mr-dos-castle",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Sony Corporation",
          "developer": "Universal Co., Ltd.",
          "ported": "System Staff Co., Ltd.",
          "country": " Austria, Belgium, Finland, France, Germany, Italy, Luxembourg, The Netherlands, Norway, Portugal, Spain, Sweden, Switzerland, United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/130980-mr-do-s-castle-msx-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/130981-mr-do-s-castle-msx-screenshot-you-can-move-diagonal-stairs.png",
      "caption": "You can move diagonal stairs"
    },
    {
      "link": "/images/shots/l/130982-mr-do-s-castle-msx-screenshot-smash-their-heads.png",
      "caption": "Smash their heads!"
    },
    {
      "link": "/images/shots/l/130983-mr-do-s-castle-msx-screenshot-don-t-let-the-unicorns-get-you.png",
      "caption": "Don't let the unicorns get you"
    }
  ],
  "cover": []
}