{
  "name": "Mystery House",
  "shortName": "mystery-house",
  "description": "<i>Mystery House</i> is likely the very first Japanese full-scale text adventure game with pictures. The game is inspired by <a href=\"https://www.mobygames.com/game/hi-res-adventure-1-mystery-house\">Hi-Res Adventure #1: Mystery House</a> and although it uses the same name and gameplay, there is no <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,199907/\">Agatha Christie</a>-esque subplot, no competitors and the player is alone. The objective of the game is to find a treasure that is hidden somewhere in the house and then escape with it. Several items can be found around the house that can be picked up and used in order to proceed. There are also various hazards that will kill the player's character if not careful enough.<br><br>There are no room descriptions and the text commands are in very simple English. This has to be done in a two-stage input; you have to type a verb first, then press RETURN and then enter the noun. Example: Open - RETURN - Door. Directions must be abbreviated (e.g: N/S/E/W/U/D). <br><br>Controls differ between some versions: The PC-6001 and the MSX versions use cursor keys for the movements instead of text commando's. The FM-7 version does not use a two-stage input, but you need to input full sentences instead. (e.g. open door).",
  "publishedBy": "Micro Cabin Corp.",
  "developedBy": "Micro Cabin Corp.",
  "released": "Oct, 1983",
  "alsoFor": "FM-7, PC-6001, PC-8000, PC-88, PC-98, Sharp MZ-80B/2000/2500 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person, Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/mystery-house",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Micro Cabin Corp.",
          "developer": "Micro Cabin Corp.",
          "ported": "Arrow Soft",
          "country": " Japan",
          "releaseDate": "Oct, 1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}