{
  "name": "Outroyd",
  "shortName": "outroyd",
  "description": "In the year 2108, the world of Quorn was almost destroyed by a battle between the central computers of the East and West factions. While the West faction won, its computer no longer recognised the interests of its human creators. Instead, it started the creation of a robot society, &quot;Outroyd&quot; and started to wage war against the human survivors of the first battle. But one of the humans, Ramon Okudaira, has decided to take a stand against the robots. Armed only with his XX-85 Armoured suit, he will try to win back Quorn in the name of humanity.<br><br>The game is played on an 8x8 overworld map showing a birds-eye view of the armoured player. The overworld is tiled with various sort of terrain such as grass and concrete, impenetrable walls, as well as traps of various sort which may zap the player with electricity, blast them with lasers or send them falling into an endless abyss. There are also squares with water, magnetic plates and aerial rails, which may only be traversed once you have found the appropriate upgrades for your armoured suit.<br><br>The right part of the screen shows three parameters: energy, offensive and defensive power. Energy slowly runs down as you move about. The maximum of each of the other two statistics are dependent on your suit upgrades. All three of these can be reduced if you are damaged by enemy droids that appear on some of the screens. Too much accumulated damage will result in the player's death. Damage can be repaired and energy replenished by visiting your home-base, or by various energy and maintenance bases that appear around the map.<br><br>You will spend the main part of the game raiding enemy bases. These are small squares that are guarded by a single droid each. The droid patrols a fixed circuit firing continuously, but there is usually a point on the screen from which you can fire with guaranteed safety. Killing the droid gives you access to the base, which may contain suit upgrades (for head, body, arms and foot), energy packs or other goodies. A particular combination of suit upgrades, along with a &quot;Flight Program&quot; will allow you to convert your suit into a flying form on particular tiles. This is needed to access otherwise inaccessible regions of the map.<br><br>The final goal of the game is to reach the central computer at the heart of Outroyd and destroy it using four anti-matter bombs. Once the computer is destroyed, humanity is saved and you win the game.",
  "publishedBy": "MagicalZoo",
  "developedBy": "MagicalZoo",
  "released": "1985",
  "alsoFor": "Sharp X1 | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/outroyd",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "RPG elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "MagicalZoo",
          "developer": "MagicalZoo",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1028797-outroyd-msx-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1028799-outroyd-msx-screenshot-my-home-base.png",
      "caption": "My home base"
    },
    {
      "link": "/images/shots/l/1028800-outroyd-msx-screenshot-showing-my-suit-upgrades.png",
      "caption": "Showing my suit upgrades."
    },
    {
      "link": "/images/shots/l/1028801-outroyd-msx-screenshot-an-enemy-base-near-to-an-energy-source.png",
      "caption": "An enemy base near to an energy source."
    },
    {
      "link": "/images/shots/l/1028802-outroyd-msx-screenshot-a-droid-guarding-a-base-and-an-item.png",
      "caption": "A droid guarding a base and an item depository."
    },
    {
      "link": "/images/shots/l/1028803-outroyd-msx-screenshot-found-a-bomb.png",
      "caption": "Found a bomb!"
    },
    {
      "link": "/images/shots/l/1028804-outroyd-msx-screenshot-closing-in-on-the-center-of-outroyd.png",
      "caption": "Closing in on the center of Outroyd."
    },
    {
      "link": "/images/shots/l/1028805-outroyd-msx-screenshot-converting-into-a-plane-at-this-transformation.png",
      "caption": "Converting into a plane at this transformation tower."
    },
    {
      "link": "/images/shots/l/1028806-outroyd-msx-screenshot-upgraded-suit-heads-give-you-long.png",
      "caption": "Upgraded suit heads give you long range scanning."
    },
    {
      "link": "/images/shots/l/1028798-outroyd-msx-screenshot-activated-the-third-bomb-on-the-central.png",
      "caption": "Activated the third bomb on the central computer."
    }
  ],
  "cover": []
}