{
  "name": "Pig Mock",
  "shortName": "pig-mock",
  "description": "<i>Pig Mock</i> is an action game where you, Pig Mock, must catch dropped eggs and transfer them to funnels at the side of the screen. The eggs are dropped by Thunder Pants who are some creatures living in the clouds. Pig Mock has a frying pan with which to collect the eggs,  Pressing up allows the eggs to be thrown upwards, and any Thunder Pants hit by a red egg will fall from the cloud, before eventually being replaced. Dropped eggs will stay on the floor, until cleaned up by Uncle Dust-pan who periodically crosses the screen, eating the smashed eggs. After eating enough eggs, Uncle Dust-pan will grow in size and cannot be jumped.<br><br>Each round of <i>Pig Mock</i> is concluded when 15 eggs have been collected. To make matters more difficult, there are mounds on the floor which can cause Pig Mock to trip and become momentarily dazed. Later levels also have a mole which attacks from below the ground. Pig Mock may dispatch the mole by hitting them with the frying pan once they are above ground. Contact with Uncle Dust-pan or the mole, or being hit by an egg will cause Pig Mock to lose a life. The rounds increase in difficulty by changing the number of mounds, the number of clouds containing Thunder Pants, and the tenaciousness of the mole.",
  "publishedBy": "HAL Laboratory, Inc.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/pig-mock",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "HAL Laboratory, Inc.",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/972220-pig-mock-msx-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/972221-pig-mock-msx-screenshot-a-thunder-pant-falling-after-being.png",
      "caption": "A Thunder Pant falling after being hit by a red egg."
    },
    {
      "link": "/images/shots/l/972222-pig-mock-msx-screenshot-the-mole-appears-in-round-3.png",
      "caption": "The mole appears in Round 3."
    },
    {
      "link": "/images/shots/l/972223-pig-mock-msx-screenshot-uncle-dust-pan-has-grown-to-big-to.png",
      "caption": "Uncle Dust-pan has grown to big to be jumped."
    }
  ],
  "cover": []
}