{
  "name": "Psy-O-Blade",
  "shortName": "psy-o-blade",
  "description": "In 21th century, there are three main powers on the Earth. The free world and the communist block carried over from the 20th century; the third power is the New Communist Federation. Since a program of denuclearizing was supported by all those powers, the New Communist Federation developed a devastating non-nuclear weapon: the satellite &quot;Raiden&quot;. The two other powers competed with the New Communist Federation, developing their own killer satellites, and the danger of total annihilation became once again an issue. Seeing no future for the Earth, humans started to colonize other planets. In 22th century, they sent an experimental ship &quot;Septemius 1&quot; to a star six light years far away from the Solar System. The ship's main computer, &quot;Racoon&quot;, sent a strange message before stopping any communication. Keith McDonnell, a seventeen-year-old crew member of the ship &quot;Septemius 2&quot;, was sent to investigate the strange disappearance. <br><br><i>Psy-O-Blade</i> is a Japanese adventure in anime style. The player interacts with the game world by moving a cursor and clicking on objects to examine or use them, and people to talk to them, or by choosing options (&quot;Move&quot; and &quot;Scroll&quot;) from a menu. There are no puzzles to solve; the player advances in the game by talking to characters, visiting different locations, as well as examining and using objects.",
  "publishedBy": "T&amp;E Soft, Inc.",
  "developedBy": "T&amp;E Soft, Inc.",
  "released": "1988",
  "alsoFor": "FM-7, Genesis, PC-88, PC-98, Sharp X1, Windows | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/psy-o-blade",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "T&amp;E Soft, Inc.",
          "developer": "T&amp;E Soft, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}