{
  "name": "Record of Lodoss War: Haiiro no Majo",
  "shortName": "record-of-lodoss-war-haiiro-no-majo",
  "description": "<i>Haiiro no Majo</i> is one of the several different games set in the fictional Lodoss War universe created by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,458156/\">Ryo Mizuno</a>. The game's introductory plot loosely follows the events of the first novel, <i>The Grey Witch</i>, centering on the enigmatic character Karla and her influence on the world's politics. Several popular characters from the cycle (such as the dwarf Ghim whom the player can recruit early in the game) make an appearance as well.<br><br>Despite its Japanese origins and anime-style visual aesthetics, this incarnation of the series is a Western-style role-playing game in the tradition of <a href=\"https://www.mobygames.com/search/quick?gamegroup=Wizardry\">Wizardry</a> and <a href=\"https://www.mobygames.com/search/quick?gamegroup=Ultima\">Ultima</a> games. Rather than following a linear story focused on a lead character, the player creates a party of characters and takes them on a journey through the world of Lodoss. A few NPCs can join the party as well. Character races include Humans, Elves, Dwarves, and Halflings, while the classes comprise Warriors, Shamans, Priests, Scouts, and Knights. The player can manually distribute five bonus points among the character's six attributes: Strength, Intelligence, Agility, Endurance, Luck, and Personal Beauty.<br><br>After the party has been created the heroes find themselves in the starting town. All the towns have identical or similar location visuals (inns, temples, markets, etc.), and can only be navigated by selecting locations from a menu. Overworld navigation and battles are viewed from a top-down perspective; dungeons are done in pseudo-3D first-person view and require illuminated torches for exploration. <br><br>Battles occur either randomly or are triggered whenever the party enters a specific location. The player can opt to set combat on auto, the result calculated according to the participants' parameters. Manual fighting involves navigating characters on the battle field in round-based fashion, selecting physical attacks or magical spells when enemies are in their range. ",
  "publishedBy": "Humming Bird Soft",
  "developedBy": "Humming Bird Soft",
  "released": "Mar 16, 1990",
  "alsoFor": "FM Towns, PC-98, Sharp X68000 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/record-of-lodoss-war-haiiro-no-majo",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Humming Bird Soft",
          "developer": "Humming Bird Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 16, 1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/328122-record-of-lodoss-war-haiiro-no-majo-msx-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Plastic Case",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/328123-record-of-lodoss-war-haiiro-no-majo-msx-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Plastic Case",
      "country": "Japan",
      "platforms": "MSX"
    }
  ]
}