{
  "name": "RoboCop",
  "shortName": "robocop__",
  "description": "Based on the 1987 movie of the same name, Patrolman Alex Murphy was killed on the streets of Detroit. The major corporation there, Omni Consumer Products (OCP) saw an opportunity to sell a new kind of law enforcement officer to the troubled city. They took what was left of Murphy, encased it in titanium armor, wiped his memory and created RoboCop. Now it's up to RoboCop to clean the streets of Detroit and eliminate the one responsible for his murder, Clarence Boddicker. But it looks like Clarence might not be the kingpin of this town...<br><br>Ocean's version of <i>RoboCop</i> for 8-bit machines loosely adapts the <a href=\"https://www.mobygames.com/game/arcade/robocop\">Data East arcade game</a>, with stages inspired by those from the coin-op, but also entirely new gameplay elements.<br><br>In most levels, RoboCop walks from left to right, shooting his gun at hordes of enemies that intend to kill him with bullets, chainsaws or their fists. Stages include the streets of Detroit (in two parts, based on the first level of the arcade), a drug factory (based on the fourth arcade level), and a junkyard (based on the third coin-op stage). Gun power-ups to collect include a rapid fire model, a three-way shot and a powerful flame cannon. Two levels end with boss fights against RoboCop's chief adversary ED-209. For some reason, ED is impervious to bullets and must be defeated using Robo's fists alone.<br><br>New challenges from the arcade include hostage scenarios: in these, seen from a first-person perspective, a criminal holds an innocent person. Moving crosshairs and firing precisely, RoboCop must take care to shoot only the criminal, not the civilian.<br><br>Another new game element requires some quick thinking: in a puzzle mode, a composite sketch of a suspect is presented and must be matched by choosing the correct parts (hair, chin, eyes, etc.) of the face within a tight time limit.",
  "publishedBy": "Erbe Software, S.A.",
  "developedBy": "Ocean Software Ltd.",
  "released": "1989",
  "alsoFor": "Amstrad CPC, Commodore 64, DOS, Game Boy, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/robocop__",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Erbe Software, S.A.",
          "developer": "Ocean Software Ltd.",
          "ported": "",
          "country": " Spain",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/130862-robocop-msx-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/130863-robocop-msx-screenshot-high-scores.png",
      "caption": "High scores"
    },
    {
      "link": "/images/shots/l/130864-robocop-msx-screenshot-selection-screen.png",
      "caption": "Selection screen"
    },
    {
      "link": "/images/shots/l/130865-robocop-msx-screenshot-shoot-the-outlaws.png",
      "caption": "Shoot the outlaws"
    },
    {
      "link": "/images/shots/l/130866-robocop-msx-screenshot-the-hide-also-behind-the-upper-windows.png",
      "caption": "The hide also behind the upper windows!"
    }
  ],
  "cover": []
}