{
  "name": "Schwarzschild II: Teikoku no Haishin",
  "shortName": "schwarzschild-ii-teikoku-no-haishin",
  "description": "<i>Teikoku no Haishin</i> is a sequel to <a href=\"https://www.mobygames.com/game/kyran-no-ginga-schwarzschild\">Ky?ran no Ginga: Schwarzschild</a>. The events of the game take place in 3964, four years after those of the previous game. Natural disasters and the military strategies of the Honsha Empire have turned the Jiro star cluster region into a realm of chaos and unrest. A new kingdom was established in the Somari star system, and was denied a peaceful existence following the combined military actions of the countries Lossaria and Tristia. The player must defend the kingdom and win the upcoming war.<br><br>Like its predecessor, <i>Teikoku no Haishin</i> is a turn-based strategy game with a heavy emphasis on actual strategy rather than tactics. Gameplay, interface, and visual style are nearly identical to those of the previous game. The player must manage finances and use resources to build a sufficiently powerful starship fleet. Diplomatic options are available as well. Once a battle phase begins, ship movement and attacks unfold automatically. The player can change general commands during his turn, but is unable to physically navigate ships, which distinguishes the game from tactics-oriented strategy games.",
  "publishedBy": "Kogado Studio, Inc.",
  "developedBy": "Kogado Studio, Inc.",
  "released": "Jun 28, 1990",
  "alsoFor": "PC-88, PC-98, Sharp X68000 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/schwarzschild-ii-teikoku-no-haishin",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Kogado Studio, Inc.",
          "developer": "Kogado Studio, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 28, 1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}