{
  "name": "Skooter",
  "shortName": "skooter",
  "description": "<i>Skooter</i> is a top-down puzzle game with gameplay similarities to <a href=\"https://www.mobygames.com/search/quick?game=Sokoban\">Sokoban</a> and <a href=\"https://www.mobygames.com/search/quick?game=Pac-Man\">Pac-Man</a>. Players control a small unicycled-styled robot who must collect various objects while avoiding four invulnerable tank-treaded robots and making use of special blocks and tiles. The game uses a standard arcade-style high score and life system.<br><br>The blocks seen in the vary in use, ability, and design. While most act merely as walls, some are able to be moved around by the player in simple directions which can used to access parts of the level and trap enemies. Some blocks merely disappear when touched by the player, allowing both them and enemies to access more of the level. Occasionally, a heart may appear out of these either of these blocks which, upon collection, will grant the player a short period of invincibility and allow them to knock enemies out of the playing area. Another feature in almost every level are special tiles that force the player to move in a fixed direction, though can be defeated if a block is placed in front of its directional output. <br><br>The goal is to collect four objects located around parts of each level. While the number objects never change, the theme of each the objects change after every two levels and include food, electronics, letters, weapons, and other forms of iconography. After each level, the player is rewarded with random quotes and anecdotes, all of which have no meaning to the game itself. There are sixteen levels/puzzles in total.",
  "publishedBy": "Pony Canyon, Inc.",
  "developedBy": "The Bytebusters",
  "released": "Mar, 1988",
  "alsoFor": "",
  "genre": "Action, Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/skooter",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Pony Canyon, Inc.",
          "developer": "The Bytebusters",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar, 1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}