{
  "name": "Sotsugy? Shashin / Miki",
  "shortName": "sotsugy-shashin-miki_",
  "description": "<i>Sotsugy? Shashin / Miki</i> consists of two Japanese-style adventure games that were not released separately before. Both focus on the theme of high-school romance.<br><br>In <i>Sotsugy? Shashin</i>, the player takes control of a male high-school student. Unable to form a solid plan for his future studies, he is more interested in romantic relationship, and attempts to make things right with his schoolmate Hiromi Kamura before the graduation ceremony takes place.<br><br>In <i>Miki</i>, the protagonist is Shinji Fujisawa, who attends the high school of the peaceful mountain village Tsubana. During a kagura dance performance, a time slip occurs, and he and his schoolmate Ayumi are miraculously transported to the feudal Edo era. Shinji's soul enters the body of the young blacksmith apprentice Shingo Benibana, and he attempts to change the tragic events of the past involving Shingo's love to the beautiful Miki.<br><br>Both games play like traditional Japanese-style adventures, with menu commands for interaction with the environment and navigation. Whereas <i>Sotsugy? Shashin</i> allows combinations of verbs with objects (e.g. &quot;examine the room&quot;), <i>Miki</i> is more streamlined and consists of simple context-specific commands only.",
  "publishedBy": "Cocktail Soft",
  "developedBy": "Cocktail Soft",
  "released": "Mar 12, 1992",
  "alsoFor": "PC-98, Sharp X68000 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/sotsugy-shashin-miki_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Cocktail Soft",
          "developer": "Cocktail Soft",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 12, 1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}