{
  "name": "The Stone of Wisdom",
  "shortName": "stone-of-wisdom",
  "description": "In <i>The Stone of Wisdom</i> you play as Leon, who is transported to a mysterious castle and told to retrieve four ancient tablets so he can go back home. After each tablet, you move on to a different part of the castle where the walls and floor are a different colour and the enemies are tougher.<br><br>Your only weapon is a sword, which you use to stab enemies. These don't really attack you but wander back and forth, hurting you when they collide with you. They are mostly what gives the game an Egyptian flair, as you can recognise mummies, sphinxes and the classic hieroglyphic representation of a man in profile, along with some more abstract creatures.<br><br>Special blocks can be destroyed to reveal gems that increase your three coloured gauges: black Intelligence (secret doors open when this stat reaches certain thresholds), red Power (making your attacks stronger) and blue Life (you will lose if it drops to zero). You also need to avoid contact with three types of coloured squares, which deplete the corresponding gauge if you walk over them. You can also pick up orbs, which serve as currency to purchase upgrades that nullify the harmful squares, raise your attack or defence, etc.<br><br>To progress through the castle, you will often need to reveal news paths by destroying walls, and these are not indicated in any way. However, once you know where to look, the game can be completed in very little time.\nOnce you have reached the end, you will be given the option to restart from the beginning, retaining all your items and stats, making the second run through trivial. Once that is done, you have actually beaten the game.<br><br>With its hack and slash and light RPG elements, secrets to be found and sometimes maze-like structure, The Stone of Wisdom is in the vein of 1984 <a href=\"https://www.mobygames.com/search/quick?game=The+Tower+of+Druaga\">The Tower of Druaga</a> and emulates to a degree the dungeons of <a href=\"https://www.mobygames.com/search/quick?game=The+Legend+of+Zelda\">The Legend of Zelda</a>, released earlier the same year, although in a much more stripped-down version, since there are no bosses, no items to use and a limited variety of enemies.",
  "publishedBy": "Casio Computer Co., Ltd.",
  "developedBy": "Casio Computer Co., Ltd.",
  "released": "1986",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/stone-of-wisdom",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Action RPG, Hack and slash",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Casio Computer Co., Ltd.",
          "developer": "Casio Computer Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1016324-the-stone-of-wisdom-msx-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1016325-the-stone-of-wisdom-msx-screenshot-the-first-area.png",
      "caption": "The first area"
    },
    {
      "link": "/images/shots/l/1016326-the-stone-of-wisdom-msx-screenshot-finding-a-red-gem.png",
      "caption": "Finding a red gem"
    },
    {
      "link": "/images/shots/l/1016327-the-stone-of-wisdom-msx-screenshot-the-first-tablet.png",
      "caption": "The first tablet"
    },
    {
      "link": "/images/shots/l/1016335-the-stone-of-wisdom-msx-screenshot-the-blue-area-and-its.png",
      "caption": "The blue area and its red blobs"
    },
    {
      "link": "/images/shots/l/1016336-the-stone-of-wisdom-msx-screenshot-this-might-not-look-like.png",
      "caption": "This might not look like it, but it's a shop"
    },
    {
      "link": "/images/shots/l/1016338-the-stone-of-wisdom-msx-screenshot-avoid-the-flying-swords.png",
      "caption": "Avoid the flying swords to collect the treasure"
    },
    {
      "link": "/images/shots/l/1016339-the-stone-of-wisdom-msx-screenshot-a-room-of-enemies-and.png",
      "caption": "A room of enemies and lava"
    }
  ],
  "cover": []
}