{
  "name": "Subacuatic",
  "shortName": "subacuatic",
  "description": "<i>Subacuatic</i> details the quest of Ferdinand W. Templeton, a famous archaeologist at the University of Michigan. He has made many famous discoveries, but lacks the money to set out on new expeditions. Fortunately he aims to resolve this by marrying the rich governor of Alabama, Mary Lou Kapowsky. His stag party at Costa Daurada has got entirely out of hand however and now some of his precious artifacts are scattered around the bottom of the sea. He has hydrophobia but needs to recover the artifacts as he will present them Alabama Lester H. Kapowsky III, Mary Lou's father, as a commitment to the marriage proposal.<br><br>The player guides Ferdinand through different underwater environments presented as single-screen rooms linked together horizontally and vertically to provide some exploration. He needs to recover four artifacts to complete the game: The Mask of Chichonitzá, the Jewel of Ebro, the Sacred Scroll of Ahamaramu IV and the Pitimini Flower XIX. Once collected they need to be brought back to the boat.<br><br>Ferdinand needs to avoid sea creatures such as octopuses, jellyfishes and piranhas, as well as seaweed. He has a limited number of lives, but oxygen also plays an important role. Starting at 100% oxygen is drained gradually while exploring. It also diminishes further when colliding with creatures or hazards. Oxygen can be replenished by returning to the surface or by breathing in bubbles. Each bubble provides an additional life (e.g. 100 extra oxygen units), so enemy collisions do not affect the number of lives directly, only oxygen.<br><br>Generally creatures need to be avoided but there is a limited number of harpoon shots to stun them temporarily. Additional shots are earned by recovering an artifact. There are also some small environment based puzzle elements involving devices in the ship that open gates. The bottom right corner contains a LED display with additional information.",
  "publishedBy": "Relevo Videogames, SL",
  "developedBy": "Mojon Twins, The",
  "released": "Dec 16, 2012",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/subacuatic",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Relevo Videogames, SL",
          "developer": "Mojon Twins, The",
          "ported": "Relevo Videogames, SL",
          "country": " Worldwide",
          "releaseDate": "Dec 16, 2012",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/580959-subacuatic-msx-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "MSX"
    }
  ]
}