{
  "name": "Taiy? no Shinden",
  "shortName": "taiy-no-shinden",
  "description": "Despite its name (a misspelling of <i>Azteca</i>), the story of <i>Taiy? no Shinden: Asteka II</i> is dedicated to the Maya people, indigenous inhabitants of Southern Mexico and Central America, rather than the Aztecs. The player controls a nameless adventurer who searches for the Sun Key, a mysterious ancient artifact which can unlock the secrets of the Mayan civilization.<br><br><i>Taiy? no Shinden: Asteka II</i> is an adventure game which takes place in the ruins of the ancient city Chichen Itza on the Yucatan peninsula in Mexico. There is a top-down overworld on which the player can physically navigate the protagonist, entering temples and other locations. In such locations, the view switches to first-person perspective. The player interacts with the environment by selecting various verb commands (&quot;Look&quot;, &quot;Take&quot;, &quot;Use&quot;, etc.), represented by icons, from a menu, and combining them with objects on the screen. In spite of its Japanese origins, the game features inventory item usage and puzzle-solving, which are more typical of Western-style adventures.",
  "publishedBy": "Tokyo Shoseki Co., Ltd.",
  "developedBy": "Nihon Falcom Corp.",
  "released": "Dec 10, 1987",
  "alsoFor": "FM-7, PC-88, PC-98, Sharp X1, Windows | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/taiy-no-shinden",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Tokyo Shoseki Co., Ltd.",
          "developer": "Nihon Falcom Corp.",
          "ported": "ZAP Corporation",
          "country": " Japan",
          "releaseDate": "Dec 10, 1987",
          "ean13": "4 961355 677025",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}