{
  "name": "T.D.F. Kaij? daisens? kesshi no genshiro b?ei sakusen",
  "shortName": "tdf-kaij-daisens-kesshi-no-genshiro-bei-sakusen",
  "description": "<i>T.D.F.</i> is a turn-based tactical game that involves fighting giant monsters. The player must defend a populated area against a monster onslaught. The overhead area is divided into hexagonal fields. The player has at his disposal atomic power plants, which produce fuel, and bases of the T.D.F. organization scattered throughout the area. The player then selects and positions various types of units on the map. These types include planes, helicopters, mobile rocket launchers, ships, trucks, etc. All these can only be positioned on hexagons adjacent to a T.D.F. base. <br><br>The monsters are mostly dragon-like in appearance and consist of a few varieties. Whenever a player-controlled unit and a monster are within each other's range an automatic battle sequence follows, displayed as a small animated sequence in the lower part of the screen. Depending on the version of the game, nine to fifteen different maps are available, distinguished by the shape of the displayed area, terrain types (grassland, desert, water, etc.), and so on.",
  "publishedBy": "Data West",
  "developedBy": "Data West",
  "released": "1988",
  "alsoFor": "FM-7, FM Towns, PC-88, PC-98, Sharp X68000 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/tdf-kaij-daisens-kesshi-no-genshiro-bei-sakusen",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Data West",
          "developer": "Data West",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}