{
  "name": "Ultraman",
  "shortName": "ultraman_",
  "description": "<i>Ultraman</i> is an action game based on the 1960s Japanese TV series of the same name. In each level, you control forces defending a convoy of military equipment from marauding monsters. The first part of the level involves protecting a ship containing airplanes from flying saucers and sea-monsters. You control an aircraft which fires guns straight ahead when it is in the top half of the screen, and drops bombs when at the lower half of the screen. If you are hit, or if a plane from the ship is beamed-up by a saucer, or smashed by a monster, you lose a life. Once the ship has arrived at its destination, the second half of the level begins. <br><br>The second half of each level consists of a convoy of trucks moving towards the left of the screen, pursued by a giant monster from the TV series (such as Red King, a giant lizard that throws rocks, or Alien Baltan, a purple humanoid lobster-like creature). The progress of the convoy is shown at the bottom of the screen. Again, you start in a plane and can defend the convoy by attacking the monster's legs causing it to trip. Alternatively, you can land the plane ahead of the monster, and activate the beta capsule to summon Ultraman. The game then becomes a beat-em-up, where Ultraman can walk, jump, punch and kick the opponent while your monstrous opponent tries to do the same to you. If the monster destroys a truck, then you lose a life. But once you have given the trucks enough time to reach their destination, you are able to activate your spacium ray which permanently disables your opponents. The levels then repeat until you have run out of lives.",
  "publishedBy": "Bandai Co., Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/ultraman_",
  "visual": "2D scrolling",
  "gamePlay": "Fighting, Shooter",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Bandai Co., Ltd.",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/969456-ultraman-msx-screenshot-the-title-screen.png",
      "caption": "The title screen."
    },
    {
      "link": "/images/shots/l/969457-ultraman-msx-screenshot-the-ship-just-leaving-dock-with-its.png",
      "caption": "The ship just leaving dock with its cargo of three planes."
    },
    {
      "link": "/images/shots/l/969458-ultraman-msx-screenshot-nearly-arrived-but-a-plane-is-being.png",
      "caption": "Nearly arrived, but a plane is being captured by a saucer."
    },
    {
      "link": "/images/shots/l/969459-ultraman-msx-screenshot-red-king-can-be-attacked-by-plane.png",
      "caption": "Red King can be attacked by plane from behind."
    },
    {
      "link": "/images/shots/l/969460-ultraman-msx-screenshot-ultraman-confronting-red-king.png",
      "caption": "Ultraman confronting Red King."
    },
    {
      "link": "/images/shots/l/969461-ultraman-msx-screenshot-ultraman-confronting-alien-baltan.png",
      "caption": "Ultraman confronting Alien Baltan."
    },
    {
      "link": "/images/shots/l/969462-ultraman-msx-screenshot-lost-the-game.png",
      "caption": "Lost the game."
    }
  ],
  "cover": []
}