{
  "name": "Worry",
  "shortName": "worry",
  "description": "<i>Worry</i> is an adventure game in Japanese where the objective is to find treasure in a mansion. Several items can be found around the mansion that can be collected and need to be used in order to proceed. <br><br>There are no room descriptions and the text commands are in very simple English. This has to be done in a two-stage input. You have to type a verb first, then press RETURN and then enter the noun. Example: Open - RETURN - Door. Movements can be done with typing forward, back, left, right, up and down or using the cursor keys.<br><br>There are several differences between the versions. In the Sharp X1 version there is also the option to use a joystick instead of the cursor keys or text commands. The text commands can be either typed in a two-stage input or in full sentences and in English, Japanese or a combination of both. The text commands in the MSX version needs to be in full sentences and is ONLY in Japanese. There are some room descriptions as well. Also the solution differs from versions.<br><br>The game was initially published under the name of <i>Mystery House</i>, that included <a href=\"https://www.mobygames.com/game/sharp-mz-80b20002500/mystery-house-ii\">Mystery House II</a> and its <a href=\"https://www.mobygames.com/game/sharp-mz-80b20002500/mystery-house\">predecessor</a>, but this was quickly discontinued in the later versions.",
  "publishedBy": "Micro Cabin Corp.",
  "developedBy": "Micro Cabin Corp.",
  "released": "Dec, 1985",
  "alsoFor": "Sharp MZ-80K/700/800/1500, Sharp X1 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person, Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/worry",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Micro Cabin Corp.",
          "developer": "Micro Cabin Corp.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}