{
  "name": "Xak Precious Package: The Tower of Gazzel",
  "shortName": "xak-precious-package-the-tower-of-gazzel",
  "description": "The events of this game take place shortly after the hero Latok defeated the demon Gospel in <a href=\"https://www.mobygames.com/search/quick?game=Xak+II%3a+The+Rising+of+the+Redmoon\"> Xak II: The Rising of the Redmoon</a>. Latok hears rumors about a man who looks exactly like him and was last seen near an old tower infested by monsters, which nobody dares enter. Latok and his girlfriend Fray arrive at the tower entrance and meet their friends there. Latok decides to venture into the tower with just one companion, unaware of the fact that the &quot;false Latok&quot; was just a trap set by powerful demons, intended to lure him into the den of evil.<br><br><i>Xak Precious Package: The Tower of Gazzel</i> is a side-story in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Xak\"> Xak universe</a>. It differs from the main <a href=\"https://www.mobygames.com/search/quick?gamegroup=Xak+series\"> Xak series</a> in several gameplay-related aspects, even though graphically it is very similar to the previous Xak games. Most importantly, <i>Tower of Gazzel</i> is not an RPG: Latok begins the game with maximized parameters and can not become stronger. The combat is similar to other Xak games: Latok attacks enemies with a sword in real time, and receives damage when they touch him. <i>Tower of Gazzel</i> is much more oriented towards puzzle-solving than the previous games. The entire game takes place in the tower, which is a huge maze containing various obstacles that the player must find solutions for (locked doors, seemingly impassable areas, etc.). Latok can jump over some dangerous spots (such as poisonous puddles). An important gameplay element is Latok's companion. Each of the four available companions has a different ability: for example, Fray can cast spells, Pixie can handle certain mechanisms in the tower, etc. In order to solve many of the puzzles, it is necessary to bring the right companion to the spot and let her take care of the problem.",
  "publishedBy": "Micro Cabin Corp.",
  "developedBy": "Micro Cabin Corp.",
  "released": "1991",
  "alsoFor": "PC-88, PC-98, Windows | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/msx/xak-precious-package-the-tower-of-gazzel",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "MSX",
      "releases": [
        {
          "publisher": "Micro Cabin Corp.",
          "developer": "Micro Cabin Corp.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/327883-xak-precious-package-the-tower-of-gazzel-msx-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Plastic Case",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/327882-xak-precious-package-the-tower-of-gazzel-msx-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Plastic Case",
      "country": "Japan",
      "platforms": "MSX"
    },
    {
      "link": "/images/covers/l/327881-xak-precious-package-the-tower-of-gazzel-msx-media.jpg",
      "scanOf": "Media",
      "packaging": "Plastic Case",
      "country": "Japan",
      "platforms": "MSX"
    }
  ]
}