{"altername_name": ["Feng Shen Ying Jie Chuan", "Feng Shen Ying Jie Zhuan", "Feng Shén Ying Jié Chuán", "The Heroic Legend of God-Sealing"], "name": "Canon: The Legend of the New Gods", "overview": "Canon: The Legend of the New Gods (original release Fengshen Yingjiezhuan (translated as \"The Heroic Legend of God-Sealing\"), is a strategy role-playing game based on a famous legend from the time of Shang dynasty (1766-1050 BC). Zhou was the name of the last emperor of the dynasty. One day he visited the palace of the goddess Nü Wa and, enchanted by her beauty, commanded his generals to capture her. The generals told him there was a mortal woman in the empire whose beauty matched that of Nü Wa. After prolonged searching the Emperor's men found the girl and brought her to the palace. What they did not know was that the girl's body was possessed by a fox spirit. Since she became Emperor Zhou's wife, evil has entered the empire. It is time for the great heroes of China to free the country from the corrupted Zhou and his possessed wife! The player initially takes control of one of the heroes, Lin Yun, who gradually re-unites with the other eight. The game is a strategy RPG which consists of battles and cutscenes to advance the story. Navigation is possible only during battles, or as instant travel between locations on a world map. During the battles, the player moves the heroes over the top-down battlefield, attacking enemies physically, defending, or using magic whenever enemies are in range. Characters gain experience points every time they attack an enemy, so it is possible to level up in the middle of a battle.", "platform": "Sega Genesis", "release_date": "1996", "game_type": "Unlicensed", "esrb": "Not Rated", "developers": "Chuanpu Technologies", "publishers": "Chuanpu Technologies", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82476\n"}