{"altername_name": ["Chakan: The Forever Man"], "name": "Chakan", "overview": "Chakan is a somewhat unorthodox platform game with its mix of relentless difficulty, spell crafting and dark themes. In the game you're controlling Chakan whose been cursed to not die. In order for him to rest in peace, he'll have to go through many levels of hack and slash platforming. The ultimate goal is defeat all the primary realms and achieve inner-peace. Through your travels you have to defeat bosses in each of the four realms of air, water, fire and earth to proceed and acquire weapons that'll help you on progress in other realms. Chakan can acquire the mallet, scythe, grappling hook and axe along with his standard swords and depending on what weapons is equipped, different abilities are unlocked. Some weapons allows for double jumping for instance, while others can tear down walls. Furthermore, the player is able to collect potions that can be used in alchemy. By pressing \"Start\" at any time, one can create various spells that enhance the character like higher jumping, putting fire on your blades or even invisibility. Some levels actually requires you to use specific spells to progress, forcing you to think outside the borders of a normal platform game. On top of all this, there's an imposed time limit on each level. From box: THE FOREVER MAN \"Darkness falls upon the land as I await the return of the visions that have haunted my nights. Many years have passed since my arrogance doomed me to this life I now live, for I am condemned to walk the countryside until I can overcome the visions that keep me from my rest... I can rely on only my swords and my knowledge of alchemy to release me from these bonds of time.\" Slash out with Chakan's double flaming swords and Incredible spinning attacks. Your weapons are alchemy and Immense power. Your enemies are the inhuman Royalty of Supernatural Horror. Dive through punishing mazes, battling the fire breathing zombles. 12 mystic alchemies conjure up phsychic passage ways to travel through time and space and create potions of invisibility. Float under a fiend filled sea and hack away at the Dragonfly King and his hideous Castle of Monsters", "platform": "Sega Genesis", "release_date": "November 1, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Extended Play", "publishers": "Sega", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.81", "wikipedia": "https://en.wikipedia.org/wiki/Chakan:_The_Forever_Man", "video_link": "https://www.youtube.com/watch?v=0a3UQXMAdD0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/3677\n"}