{"altername_name": [], "name": "Fight for Vengeance", "overview": "This Bitmap Soft release of Fight for Vengeance comes with a new reversible insert sleeve for the clamshell case. One side of the cover sleeve features a PAL design while the other side is an NTSC design – allowing you to choose the design that will seamlessly fit the game to your existing collection. Story: The year is 2033; scientific advances in quantum physics research results in an accidental opening of an interdimensional portal. Beings from parallel worlds have exploited the wormhole – with catastrophic results for Earth. Only a noble warrior from the future can fight for humankind and avenge the destruction wreaked upon it so far. It is now or never, it is time to Fight for Vengeance. About the Game: Fight for Vengeance is a new fighting game for the Sega Mega Drive/Genesis inspired by the classic fighting games of the nineties. The game utilises the Genesis Fight Engine – a high quality engine system developed and rigorously tested for over three years. Fight for Vengeance has three game modes and features six characters and a final boss, each fighter has their own set of attacks and an accompanying soundtrack. Game modes: The game menu provides for three different game modes: Arcade: Single player story mode where you can select one of the six characters to play. Save humankind from extinction by going up against the toughest interdimensional entities out to do harm to the world. Only when have you beaten them all can you face Metal – the final and most dangerous threat who will stop at nothing to see that the Earth is no more. Versus: Two-player mode. Grab a friend and go one on one against each other with your favourite characters for bragging rights. Training: Practice with any character without the fear of having your opponent fight back. This option is great for fine tuning special moves. Game options: The game has a variety of options that allow it to be adapted to your gameplay preferences. You can tailor the method of initiating defensive moves by choosing either to do this with the D-pad or by pressing a button. Fight for Vengeance also provides for different difficulty settings, a bonus turbo mode for those who enjoy high speed fighting action and many more options. Music Player: Fight for Vengeance has a built-in music player that allows to listen through the entire game sound track. Use the D-pad to cycle through each of the six individual music tracks on offer. Compatibility: * Model 3 (Not compatible) * Model 1 non-tmss (music doesn’t play) ** May work without issues with the Mega Everdrive Credits: Mauro R Flores – Game Concept & Programming Paulo H Ferreira – Co-Creator and Music Composer Henrique Lázaro – Art Concept, SFX and Design Luiz Matias – Sprites & Fighters Animator Danilo Costenaro – Cover Illustration & Translator Mr Edit – FFV Logo, Title & Select Screen Design Alex Santos – Game Tester Darren Doyle – Cover Redesign Jamie Battison – Manual Design Louie Dimovski – Manual Editor Special Thanks to: Alessandro Vinícius, Tacha, Alca Tech Studio, Drasgondigger, Luiz Nai, Adam Welch, Cetics Voice Recordings: Rotika & Lumina’s: Dorothy Jean Thompson. Narrator in Game: Mauro Flores & Henrique Lázaro Blazor, Titano, Heizer & Shadow: Mauro Flores Bitmap Soft wishes to thank Second Dimension for producing the Cartridge for this release.", "platform": "Sega Genesis", "release_date": "July 7, 2021", "game_type": "Unlicensed", "esrb": "", "developers": "Mauro R Flores", "publishers": "Bitmap Soft", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Lf0fsZ6KEoM&feature=emb_title", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153040\n"}