{"altername_name": [], "name": "Mega Mindtris", "overview": "Mega Mindtris is a falling block puzzle game for one or two players based on the concept of the earlier Mindtris mobile games. It is played on a field that consists of five columns. Single blocks drop down and they each contain a number based on the powers of two (1, 2, 4, 8, 16, 32, 64, 128, 256). The goal is to create lines lining up five blocks that each contain the number that matches the block in the goal field. For instance: if the goal field contains the number 8, a line disappears when five blocks containing 8 are lined up next to each other horizontally. With each new line formed the goal changes. When a block is dropped on top of another and together they form a power of two vertically, the sum of blocks is added and only the bottom block remains with the total sum. For instance: if there is a column with the blocks 1, 2 and 4 on top of each other, dropping a 1 on them adds them all up to a single block containing 8. There are also multiplication blocks, for instance changing an 8 into a 16 by dropping a 2x on top of it. The game can be played with four difficulty levels forming two game modes. Alone is an endless game mode playing an infinite game without an opponent or power-uss. The other game mode comprises the difficulty levels easy, normal and stupid. There the game is played against a computer opponent. The game can also be played against a friend. When not playing alone a random power-up is provided with each line. They provide a bonus or hinder the other players. They can for instance provide 50 extra points, add lines, freeze or speed up the gameplay, invert horizontal movement, steal a power-up, blast blocks or change the field.", "platform": "Sega Genesis", "release_date": "May 1, 2017", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "1985 Alternativo", "publishers": "", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128317\n"}