{"altername_name": ["MK5: Mortal Kombat Mythologies: Sub-Zero", "Mortal Kombat 5: Sub-Zero", "Mortal Combat: Sub-Zero", "MK 5: Mortal Combat: SubZero", "Mortal Kombat 5"], "name": "MK5: Mortal Kombat Mythologies: Sub-Zero", "overview": "MK5: Mortal Combat Mythologies - Sub Zero is a pirated port of Mortal Kombat Mythologies: Sub-Zero for PlayStation and Nintendo 64, made for the Mega Drive and SNES by DVS Electronic. This game uses the system of Mortal Kombat Mythologies in that it's a cross between fighting and side-scrolling. The controls are somewhat awkward; during fights, Sub-Zero won't automatically turn around when behind an opponent, forcing the player to use the A button to turn around. The fighting engine isn't taken from the official Mortal Kombat games and instead uses an engine similar to one used in some other pirated Mega Drive fighting games. All of the opponents in this game are clones of major Mortal Kombat characters. There are four levels, each with a different set of clones to fight. The graphics are taken from various Mortal Kombat games. Sub-Zero's sprites are taken from Mortal Kombat 2 while everyone else appears to be taken from Mortal Kombat 3. The music of the Mega Drive version uses different arrangements of the music from Shui Hu Feng Yun Zhuan, also present in the bootlegs Pocket Monster (Mega Drive version), The King of Fighters '99, and Mulan. The music of the SNES version uses soundtrack based on the PSX video game Soul Blade with arrangement also used in the SNES bootleg of the same name, and as happens with the Soul Blade bootleg, there are some sound effects taken from Super Buster Bros. The sound effects are taken from Mortal Kombat games, and Sonya and Sindel uses the male characters' sound effects.", "platform": "Sega Genesis", "release_date": "1998", "game_type": "Unlicensed", "esrb": "Not Rated", "developers": "", "publishers": "DVS Electronic", "genres": "Fighting", "max_players": "1", "cooperative": "No", "rating": "3.2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=8_oagR78Cc0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106867\n"}