{"altername_name": ["NHL22: NHL'94 2022 Edition", "NHL '94: 2021-22 Edition"], "name": "NHL '94: 2022 Edition", "overview": "This ROM hack updates NHL ‘94 with a refined and realistic modern version for the 2022 NHL playoffs. Key features include… Rosters, Ratings & Lines: Up-to-date custom rosters, ratings, and lines, built on smozoma’s 16-point player rating system (the original game was limited to a 7-point system), all based on extensive 2021-2022 regular season player data. Gameplay Revisioned: The gameplay has been adjusted for a more realistic modern hockey feel, with harder to score goals, easier to hit crossbars and posts, more realistic speed burst, fewer penalty calls, custom energy depletion and recovery rates balanced for more realistic line rolling and shift length, and player ratings that have been carefully calibrated for more realistic gameplay on the ice. Furthermore, two bonus patches have been included, so you can easily modify the more realistic ROM with a Rookie mode for easier to score goals, or an Arcade mode for those who want faster gameplay and less realism. Graphical Refinements: The most obvious change is the move to composite sticks, but there are hundreds of graphical refinements beyond this, including title screens, logos, banners, player photos, scoreboard, audience, face-offs, player sprites, scorekeepers, Zamboni driver, and more. The goal was to bring the most graphically refined version of NHL 94 ever made, while remaining faithful to the spirit of the original art direction. And so much more Of course there is the weight bug fix, but also a custom weight scale, less variance in Hot/Cold rating randomization, immediate goalie control by pressing the (Y) button with a six-button controller (clockwise), a custom 3-Stars of the Game rating formula, a Vegas / Washington / Winnipeg Menu & Player Cards crash fix, and more.", "platform": "Sega Genesis", "release_date": "December 27, 2021", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Adam Catalyst", "publishers": "", "genres": "Sports", "max_players": "4", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=HLm8SIz9xVc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164272\n"}