{"altername_name": ["SF2: Battle Royale"], "name": "Shining Force II: Battle Royale", "overview": "SF2:Battle Royale is a complete rework of all the battles in Shining Force II. All battles have been changed and have new enemies, and many take place on maps used to walk around in vanilla, such as towns. Enemies and allies alike have received a nearly complete makeover, including names, battle and portrait sprites, stat balance, and spell allotment. Battle backgrounds have been redrawn as well. Visuals There is a wide variety of visual changes, from the nostalgic to the just plain awesome, from minor tweaks to complete redesigns. You'll see classic SF1 versions of many SF2 enemies, as well as shiny, glowing redesigns that will make you go \"wow\" (especially amongst casters, both friend and enemy). The battle backgrounds are extremely well done and, as far as I can tell, original. The visuals only get better as the game goes on, with many surprises waiting after promotion and in later enemies. Honestly, there's very little to complain about in the updated graphics - nearly every battle will give you something special to appreciate. In short, your entire journey will feel more epic with this patch. Characters Nearly all characters have been changed. All of the characters of the same class start out very similar but gradually start to diverge, both on stats and spell selection. This remake takes some liberties with stats that are not used as often in the original. Differences in attack and defense between tank and damage classes are more pronounced, and low HP tanks are very well defined. Gameplay About 70% of the maps you fight on are non-battle maps in the original. This alone would keep the action fresh and provides for a new gameplay experience; however, the new enemies and their alignment push it over the top. The enemies are generally more aggressive than before as well, and cast status spells on your team more often. Miscellany All of the background music has been changed, and most of it is quite good and catchy. The highlights in my opinion are the \"between battle\" music and the \"greater devil\" fight music. As with the original, there are a few parts of the game where the same BGM is used for several battles in a row and it can get a little old, but the music itself is very well done. The progression of experience has been changed to make it easier for low level characters to catch up. There are a lot of new items that allow for a very high level of customization.", "platform": "Sega Genesis", "release_date": "June 6, 2012", "game_type": "ROM Hack", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163304\n"}