{"altername_name": [], "name": "Sonic the Hedgehog: The Final Showdown", "overview": "Story After the battle of Sonic the Hedgehog and Dr Ivo Robotnik at the end of Sonic the Hedgehog, Dr Robotnik promised to remove all his badniks from Mobius. Robotnik was doing as he had promised, or so Sonic thought... Dr Robotnik was secretly double-crossing Sonic. He was secretly torturing all of Sonic's friends and was sending meteorites to the planet. Dr Robotnik then went to attempt to steal the Master Emerald from Knuckles. On Robotnik's confrontation with Knuckles, they started to battle. Knuckles tried to fight Dr Robotnik but was sorely defeated and was left for dead as Dr Robotnik stole the Master Emerald. When Sonic found out about Dr Robotnik's double crossing, he severed his newfound friendship with Dr Robotnik and went to the Master Emerald. He saw Knuckles dying and Knuckles' last words were: \"Sonic...Please get the Master Emerald back and save all of mankind.\". Knuckles passed away. Sonic was furious and upset. After crying for a bit, Sonic stood up and lifted his fist in the air and shouted \"I will kill Dr Robotnik: In the Final Showdown.\" History Sonic Gets Poisoned! He started this hack which was first called Sonic Gets Poisoned! It had all original levels and palette changes. However, it was met with much criticism from members of Sonic Retro due to the number of glitches and the clashing color scheme used in the hack. Sonic the Hedgehog 2008 Beta 2.0 The second release of Sonic Gets Poisoned! was called Sonic the Hedgehog 2008. It was far less buggy and had some more alternate routes and half-decent colors. Sonic's blue color was restored (which is why the name was changed). The response from the Sonic Retro members was far better this time, due to the better palettes and the reduction of glitches. Sonic the Hedgehog - The Final Showdown v2.1 This is the pre-release of the v3.0 of Sonic the Hedgehog - The Final Showdown. It was released to allow a wiki page to be created for it, because all the earlier versions didn't meet the Hack Policy. It is the first time Anthall has done ASM and graphics editing. He has created some new monitor types. He has also made Techra City Zone 3 much longer. Levels Cold Forest Zone: Walk through the new Green Hill Zone covered in snow, but don't get frostbite. Roman Temple: Walk through a world made by the Romans. The world is covered in lava from a volcano that just erupted, be careful! Sonic Crackers Zone: Walk through the world full of springs and blocks and try and make it through this Parody level. Ancient Ruin Zone: The new Labyrinth, with unfair jumps and a desperate rush to keep Sonic's oxygen up. Skylight Zone: Robotnik's newly designed Star Light Zone. Careful though! Robotnik has pulled all the stops to make the level as difficult as possible. Techra City Zone: Dr Robotnik's final area, which is rumored to hold Dr Robotnik's worldwide headquarters but be careful! Dr Robotnik has protected his HQ by a huge refinery and a huge labyrinth.", "platform": "Sega Genesis", "release_date": "November 14, 2008", "game_type": "ROM Hack", "esrb": "E - Everyone", "developers": "Anthall", "publishers": "Anthall", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=g5VCQ5xVmI8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164613\n"}