{"altername_name": ["Sonic Delta 40Mb"], "name": "Sonic Delta Next", "overview": "This hack is a junction of all classic MD Sonic (Sonic 1. 2, 3 and Knuckles ) in to a single game. The games run over Sonic & Knuckles engine and use two custom sound drivers derived from S2B and SK sound drivers to manage all musics and effects. This hack as title said has 40 Megabits of capacity, and was coded following SEGA Standards for games larger than 32Mb which require banking switch scheme to access extra data ( Flat coding is more easy, but the game will not work on all hardwares, especially with systems equiped with SEGA CD ). Since this hack uses banking switch scheme, with proper cartrige hardware you can run in all consoles without any conflict. The Game can run in an ATGames Firecore console equiped with SDCard, but save feature will only work if you run the game through \"Neto MD-DOS 1.10 or higher\" in that console. ( https://www.neto-games.com.br/neto_md_dos/neto_md_dos.php ) The game has approximately 37 Levels, The number can be less, depending of the character chosen.. The Level Order is: Green Hill (Sonic 1) Marble (Sonic 1) Spring Yard (Sonic 1) Labyrinth (Sonic 1) Star Light (Sonic 1) Scrap Brain (Sonic 1) Final (Sonic 1) Emerald Hill (Sonic 2 Alpha) Winter Hill (Sonic Triple Trouble Robotnik Winter Port) Wood ( Sonic 2 Beta ) Sand Shower ( Custom Level ) Chemical Plant ( Sonic 2 Beta ) Neo Green Hill ( Sonic 2 Beta ) Casino Night ( Sonic 2 Beta ) Hill Top ( Sonic 2 Alpha ) Dust Hill ( Sonic 2 Beta ) Hidden Palace ( Sonic 2 Beta ) Oil Ocean ( Sonic 2 Beta ) Metropolis ( Sonic 2 Beta ) Genocide City ( Sonic 2 Alpha ) Sky Chase ( Sonic 2 ) Sky Fortress ( Sonic 2 ) Death Egg ( Sonic 2 ) Angel Island ( Sonic 3 ) Hidrocity ( Sonic 3 ) Marble Garden ( Sonic 3 ) Carnival Night ( Sonic 3 ) Icecap ( Sonic 3 ) Launch Base ( Sonic 3 ) Mushroom Valley ( Sonic & Knuckles ) Flying Battery ( Sonic & Knuckles ) Sandopolis ( Sonic & Knuckles ) Lava Reef ( Sonic & Knuckles ) Hidden Palace ( Sonic & Knuckles ) Sky Sanctuary ( Sonic & Knuckles ) Death Egg ( Sonic & Knuckles ) The Doomsday ( Sonic & Knuckles ) Nine Bonus Stages (six Sonic 1 Special Stages as Bonus Stage) which can be accessed by touching a lamppost with 20 or more rings. The formula for selecting which Bonus Stage will be played is \"RING\" count divided by 4 and the remmainder of operation will give the stage to be played: 0 - Slot Machine; 1 - Glowing Spheres; 2 - Gumball Machine; 3 - Sonic 1 Special Stage.: You can play as: Sonic and Miles; Sonic Alone; Miles Alone; Knuckles and Miles; Knuckles Alone. All Characteres have Super and Hyper Forms. For Miles the Super Form has no flickies. In Sonic 1 and Sonic 2 part you will play Sonic 2 Special Stages through big ring (50 rings or more is required ) at end of levels. After Knuckles steal your emeralds in Angel Island you need to get all Emeralds again, now through S3 Special Stages. Extra: Debug object list works for all levels; Demo mode edited to show some Sonic 1 and Sonic 2 Levels. Hints: If you are running debug mode to test, when Sonic is an object, hold \"A\" then press \"C\" to backwards the objects list. You can select the Egg Prison to skip that level. The Perfect Bonus in the Sonic 2 Special Stage is given if you do not hit any bombs and complete the stage (You must protect Miles too in the cooperative mode). If you use Save State in emulators for Sonic 1 and Sonic 2 levels probably the game will crash after the Save State is loaded. This occur because emulators does not save the SEGA Mapper state. To get the Save State working just start a New \"No SAVE GAME\" and after the Green Hill is loaded you can load the Save Sate.", "platform": "Sega Genesis", "release_date": "2020", "game_type": "ROM Hack", "esrb": "", "developers": "Neto", "publishers": "Sonic Hacking Contest", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157199\n"}