{"altername_name": ["S2_Pink_Edition_Rev_1.2"], "name": "Sonic The Hedgehog 2: Pink Edition", "overview": "Sonic the Hedgehog 2: Pink Edition is a character swap hack of Sonic the Hedgehog 2 for the Sega Mega Drive/Genesis, with Amy Rose and Cream the Rabbit replacing Sonic the Hedgehog and Tails respectively. Amy Rose's sprites are designed after her modern look. Amy Rose with classic-style sprites is available to play in the Amy Rose in Sonic the Hedgehog 2 hack. The game was modified by Sonic Retro Member E-122-Psi, with additional programming and coding by other members including MarkeyJester, MainMemory, FraGag, Selbi, and Hayate. Most programming unique from Amy In Sonic 2 such as Cream the Rabbit's gameplay was implemented by Flamewing. Amy Rose Amy's abilities mirror those she utilized in the Sonic Advance series. She is slower than Sonic and can't use spin attacks; however, she has a number of abilities (mostly using her Piko Piko Hammer) to gain maneuverability and access areas Sonic had difficulty reaching: Hammer Attack: Press A and Amy swings her hammer, damaging enemies. In addition, Amy can use her hammer to smash obstacles such as walls and hit springs. Hammer Jump: Press Down + A on the ground and Amy smashes the hammer into the ground, launching her into the air. Hammer Whirl: Press Down + A in the air and Amy swirls down toward the ground. If an enemy is hit Amy will bounce up again. Upward Dash: Hold Down + B/C while on the ground and Amy will rev her feet on the spot as opposed to a spin dash. Let go of Down to charge full throttle in the facing direction. Be careful though, Amy is vulnerable to blockading obstacles and enemies. Amy gains a few stipulations akin to Knuckles in Sonic 2; for example, the ring quota in Special Stages are depleted and she retains her ring count after losing lives or entering starposts. Cream the Rabbit Spin Dash: Hold Down + B/C while on the ground and Cream will rev up in ball form to perform a spin dash. Let go of Down to go full throttle in the facing direction. Fly: Press B/C after jumping and Cream will begin fly. She will gain height by tapping A again repeatedly, using the D-pad to control what direction Cream is going. She will not stop flying until she lands on something. Cheese Attack: Press A} for Cheese to home in and attack a nearby enemy.", "platform": "Sega Genesis", "release_date": "December 30, 2013", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "E-122-Psi", "publishers": "", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "3.61", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=p2QhDpLzCF0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95924\n"}