{"altername_name": [], "name": "Teenage Mutant Ninja Turtles: Shredder's Re-Revenge", "overview": "Welcome to the universe of Teenage Mutant Ninja Turtles: The Re-revenge of the Shredder! The city was attacked by a foot ninja army led by Shredder and Krang. Our brave heroes have come together to challenge them and clear the city of evil mutants and foot ninja. But will it be that easy? II. Features: • Replaced all characters, all enemies and all bosses. • Added shadow for all characters, all enemies and all bosses. • Some enemies have new attacks, that will surprise experienced players. • Characters replaced by Raph, Leo, Donnie, Mikey, April O’Neil, Splinter and Casey Jones. • All seven playable characters can jump further while running • All of the characters attacks are similar to those from TMNT: Shredder’s Revenge. • The game has juggling for both players and enemies. • Players can recover from a hit by pressing the jump button upon landing (as in SOR4) • The command to run (f, f) becomes more sensitive. • All playable characters can jump further while running. • You can use the Offensive Special while running • Added 6-Button gamepad Support. Uppercut now is Y-button. • Friendly fire is disabled. • Added new sounds for players and enemies. • A new plot has been written for the game. • Changed the title screen • Changed all Story Screen in the game • For the first time in Streets of Rage 2 hacking, switching between Normal and Turbo mode has been added to the option", "platform": "Sega Genesis", "release_date": "December 21, 2022", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "PPI_Akiko", "publishers": "Romhacking.net", "genres": "Beat 'em Up", "max_players": "2", "cooperative": "Yes", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=_Gdavq2CLwE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168030\n"}