{"altername_name": ["Teenage Mutant Ninja Turtles - Gaiden"], "name": "Teenage Mutant Ninja Turtles Gaiden", "overview": "The artistic vision of NoMoneyRanger (NMR) and the code monkeying of Double Z bring together TMNT Gaiden, a grittier take on previous SoR2 / TMNT mash-ups, with a cast of fan favorites popping straight out of the the SNES hit TMNT: Tournament Fighters. Bust through the Syndicate with classic Streets of Rage 2 gameplay featuring the following foursome: Leonardo: Leader of the Teenage Mutant Ninja Turtles and the only one to escape the joint ambush attack by the Syndicate and an unknown faction. Shell shock indeed! With anger and vengeance flowing through his shell, Leo will do whatever it takes to avenge and rescue his brothers. To fight this new enemy, it’ll take not only leadership skills and dual katana swords, but courage, friendship, and Bare Knuckles too! Aska: A young female ninja master from the West Foot Clan. Aska arrived in time to stop Leo from being kidnapped but was too late to save the others. Her father and leader of the clan, Shiro, is rumored to be the younger step-brother of Shredder. Their purpose is to keep peace and order with the East Foot Clan in times of conflict. Upon hearing rumors of the East Foot Clan being revived, Aska sets out to join her new friend Leo to hunt down the person allegedly responsible for bringing the East Foot back: Shredder’s daughter Karai! Rat King: After waking from a heavy nap, the Rat King notices all of his sewer rat friends are dead. It turns out their last shipment of California Cheese was tainted with poison by the Syndicate. Not cool! Learning of the Syndicate’s origins and whereabouts, he scurries to California to rendezvous with Leo. Despite their previous conflicts, the Rat King is willing to cast aside his differences in order to avenge his fallen rat friends and take down this common enemy. Wingnut: Every town needs a hero, and Wingnut considers himself as one to people of Hollywood. Sadly, no one ever acknowledges his deeds and heroics. Despite being a bat-mutant with flying abilities, he developed a fear of heights from a recent flight incident. While learning that Leo and his new teammates were in need of a fourth member, Wingnut volunteers himself without concern for danger. He’ll do his best to prove his worth as a hero, definitely bust some heads in the process, and perhaps overcome his fear of heights. With NMR’s vision, new animations, heroes, and sounds, get ready for a whole new TMNT experience!", "platform": "Sega Genesis", "release_date": "July 18, 2021", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "eskayelle", "publishers": "Romhacking.net", "genres": "Beat 'em Up", "max_players": "2", "cooperative": "Yes", "rating": "2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=XG3-h7lh5D8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160692\n"}