{"altername_name": [], "name": "Guy Spy and the Crystals of Armageddon", "overview": "Guy Spy is quite easily one of the most eagerly awaited games of the year. From its initiation early on in January, and our special In Development article six months ago, interest has snowballed – the question on everyone’s lips was: can real gameplay be added to Readysoft’s stunning cartoon-quality graphics? Now, more than eighteen months on, the finished product is poised to hit the shelves and revolutionize the world of interactive gaming. Guy Spy is presented as a cartoon adventure in much the same way as the Dragon’s Lair series before it. In fact, the whole thing has been produced in more or less the same vein as Space Ace but features longer, more playable sections, with the player actually controlling Guy rather than guiding him when necessary. The term ‘Interactive’ when used to describe Guy Spy is still slightly misleading, though, as it’s more interactive than most games. Although you do exercise control over the character, it’s still never more than walk left, step right, punch or whatever. Of the thirteen levels it’s fair to say that most are enjoyable, but there’s only a handful you’ll want to play again. The best levels have been sensibly placed sporadically to keep the interest up, though, and there are enough of them to keep you coming back for more. Couple these with the fine and other humorous link animations and three difficulty settings, and the game goes a long way to restore credibility to Readysoft gaming. This is the closest anyone has come to a fully animated and playable adventure and the Canadian-base company deserve enormous credit. It’s still not the perfect cartoon-quality game, but I seriously doubt whether a floppy-based Amiga would ever be able to house such a project anyway. That said, though, what Readysoft have achieved here is admirable and it’s a hefty step in the right direction and one that deserves praise. It’s by no means perfect, but give it a whirl regardless.", "platform": "Commodore CDTV", "release_date": "1993", "game_type": "", "esrb": "", "developers": "ReadySoft", "publishers": "ReadySoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.2", "wikipedia": "https://en.wikipedia.org/wiki/Guy_Spy_and_the_Crystals_of_Armageddon", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/87955-guy-spy-and-the-crystals-of-armageddon\n"}