{
  "name": "Cosmic Crisis",
  "shortName": "cosmic-crisis",
  "description": "Mankind is under siege by demonic ghosts. Now its up to a heroic man named Bill armed only with his wits and a hammer to repel this invasion.<br><br>In <i>Cosmic Crisis</i>, brick platforms are connected by ladders. Bill must maneuver around these platforms, punching holes in the brick platforms with his hammer in an attempt to trap a ghost. Once a ghost is trapped, Bill must get to the ghost and continue hammering at the hole until the ghost finally drops through the platform and gets hurt upon impact with the platform below it. While falling through one floor will destroy a white ghost, a red ghost will need to fall through two floors, and a blue ghost through three. Landing a ghost on top of another ghost below them is another way to destroy them too. Bill only has a limited amount of time to get rid of all of the ghost in order to clear a stage. The game has six different stages in all and the player starts with only four lives to get through them.<br><br>The game has four difficulty levels, with each higher difficulty increasing the speed of the ghosts except the last difficulty which simply adds an additional red ghost.<br><br>",
  "publishedBy": "Bit Corp",
  "developedBy": "Bit Corp",
  "released": "1983",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/colecovision/cosmic-crisis",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "ColecoVision",
      "releases": [
        {
          "publisher": "Bit Corp",
          "developer": "Bit Corp",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}