{
  "name": "Spectron",
  "shortName": "spectron",
  "description": "The planetary clust Shalix is plagued by an intergalactic dust cloud that blocked out their sun. Now the Shalix have built a fleet to colonize new worlds. Unfortunately they set their eyes on Spectron, the player's home world. It's up to the player to repel the invading forces from Shalix.<br><br><i>Spectron</i> is a single-screen shoot 'em up in the vain of <a href=\"https://www.mobygames.com/search/quick?game=Space+Invaders\">Space Invaders</a>. The player controls a Spectron fighter, a land-based vehicle that can fire high speed rockets. The player is protected by a shield that consists of various segments above the player. Each segment can be destroyed by enemy fire when hit often enough, but the player cannot shoot through it. Invaders will appear at the top of the screen and must be destroyed. Some invaders can plant bombs in the city backdrop. When more than nine bombs have been planted the game ends immediately, irregardless of the remaining lives of the player. Alien forces are brought in by a transport ship, if the player manages to destroy it it'll destroy up to eighteen ships at once. The various invaders have two different types of behavior, representing the untrained cannon fodder and the elite Shalix.<br><br>There are various difficulty levels and modes included and a two player mode is included. The player earns points for every enemy killed and the goal is to reach a high-score.",
  "publishedBy": "Spectravideo International Ltd.",
  "developedBy": "",
  "released": "Nov, 1983",
  "alsoFor": "Spectravideo | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/colecovision/spectron",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "ColecoVision",
      "releases": [
        {
          "publisher": "Spectravideo International Ltd.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov, 1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}