{"altername_name": ["Sega Classic Arcade Collection: Limited Edition", "Sega Classics Arcade Collection 4-in-1", "Sega Classics 4-in-1"], "name": "Sega Classics Arcade Collection (4-in-1)", "overview": "Sega Classics Arcade Collection is a compilation of four (or five) Sega Mega Drive games for the Sega Mega-CD. It was a pack-in game bundled with launch Mega CDs in the United Kingdom and North America, and was released separately in other regions. Two variants of Sega Classics Arcade Collection exist; an earlier version seen in North America and Japan, which contains Golden Axe, Streets of Rage, Columns and The Revenge of Shinobi, and a later version seen in Europe and later North American bundles, which throws in Super Monaco GP. In North America the older \"4-in-1\" variant came in the same box as Sherlock Holmes: Consulting Detective Vol. I, while the later \"5-in-1\" one came with Ecco the Dolphin. Each game is mostly identical to their Mega Drive counterparts, though have minor changes thanks to the Mega CD's enhancements. All digitised speech samples have been replaced with higher quality audio, the first level in Golden Axe uses different instruments and Super Monaco GP has extra drums. The Revenge of Shinobi is based on a later version than its cartridge counterparts, altering some of the bosses which infringe copyrights. For unknown reasons, Golden Axe is only a one-player game in this compilation. Despite being the Mega CD's selling point, only two games have an updated CD soundtrack (Golden Axe in the form of music recorded from its arcade board, and Columns which has a new title theme). This means only a small fraction of the disc is used.", "platform": "Sega CD", "release_date": "November 1, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega Enterprises", "publishers": "Sega Enterprises", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Sega_Classics_Arcade_Collection", "video_link": "http://www.youtube.com/watch?v=jQp_CrHslIc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29477-sega-classics-arcade-collection-4-in-1\n"}