{"altername_name": [], "name": "Syndicate", "overview": "Syndicate is an isometric strategy game developed by Bullfrog Productions. It was released among other systems for the Sega Mega Drive and Sega Mega-CD. Its sequel, Syndicate Wars, was due to be released on the Sega Saturn but was Syndicate for Nintendo and Sega systems adapts the computer original for the capabilities of the consoles. While it follows the same gameplay template, it is redesigned in a much more cartoony style, has multiple differences in gameplay and controls and features completely new levels. Taking the role of an executive of a criminal syndicate in a dark cyberpunk future, the player controls teams of cyborg agents on missions: assassinating politicians, opinion leaders or executives from rival syndicates, retrieving important objects, kidnapping scientists or taking out enemy agents. The world map consists of 50 regions, each containing one level (two training levels are also available). The stages are presented in isometric view, and one to four agents are controlled. Unlike the indirect cursor control in the computer versions, on the consoles the agents are controlled directly, with potential targets being selected automatically. Unlike the multi-layered versions of the computer game, all levels consist of one layer only. Between missions, taxes from conquered territories can be spent on researching new weapons and cybernetic upgrades for the agents. These are all the same as on the computer versions, with the exception of the flame thrower, which has been replaced with the less gruesome 'chiller'. Indirect control of the agents with drugs influencing adrenaline, perception and intelligence also remains the same. The policemen and guards from the original are gone, their place being taken by robotic drones.", "platform": "Sega CD", "release_date": "January 1, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Bullfrog Productions", "publishers": "Domark Software", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3.52", "wikipedia": "https://en.wikipedia.org/wiki/Syndicate_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33961-syndicate\n"}