{
  "name": "Jeopardy!",
  "shortName": "jeopardy_gg",
  "description": "<i>Jeopardy!</i> is a conversion of the long-running TV quiz show where the answers are given and contestants must provide the questions. Compared to the <a href=\"https://www.mobygames.com/game/genesis/jeopardy__\">Genesis version</a> released a year earlier, the Game Gear version features only about half the number of questions, and replaces the console version's photo-realistic style with a more cartoon-like approach.<br><br>Unlike in the actual TV show, there always only two contestants. Players can choose their avatar from six different characters. The game supports one or two players: in a two-player game, both share the same Game Gear and must buzz in by using either the d-pad or the face buttons. Once buzzed in, the question must be spelled out within 60 seconds, with the game allowing for some spelling variations and minor misspellings.<br><br>Game rules are accurate to the original show and include Daily Doubles and the Double Jeopardy and Final Jeopardy rounds. The game features a cartoon representation and digitized speech samples of TV host Alex Trebek (plus a digitized picture on boot-up) and a rendition of the original theme music.",
  "publishedBy": "GameTek, Inc.",
  "developedBy": "",
  "released": "1993",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/game-gear/jeopardy_gg",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "Game Gear",
      "releases": [
        {
          "publisher": "GameTek, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/844333-jeopardy-game-gear-screenshot-title-screen.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}