{
  "name": "'99 K?shien",
  "shortName": "99-kshien",
  "description": "<h3>PlayStation Store Description (from <a href=\"https://www.mobygames.com/game/99-kshien/adblurbs\">Ad Blurbs</a>)</h3><b>?This game is supported with the PSP® and PS Vita screenshot function?<br>PSP®: Screenshots can be taken by using the menu after holding the PS button (HOME button) in the game. <br>The image will be saved in the photo collection from the XMB™ (XrossMediaBar).<br>PS Vita: Screenshots can be taken by using &quot;Screenshot&quot; from the &quot;Settings&quot; after holding the PS button in the game. <br>The image will be saved as an application photo. <br><br>This software can be played with PlayStation®3 and PSP® (PlayStation®Portable).<br>If you are downloading with PC or via PS3™, after downloading with the device please connect to PSP® with a USB cable and copy the content by inserting a storage media like Memory Stick™.</b><br><br>Feel the weight of the ball and the weight of the bat!<br>This is the definitive version for the high school baseball simulation game for players to aim for the Koshien by training the team members within a 3 years period!<br>Get to know the strength and weakness of individual members in order to train the team more effectively.<br>The game will include rich features such as the player mode, director mode and the full play mode, so choose the playing style that is suitable for you.<br>Show off all of your capabilities and win the Koshien contest!<br><br><b>Copyright:</b><br>©1999 MAGICAL COMPANY LTD.<br><br>Purchase or use of this item is subject to SEN Terms of Service and User Agreement.",
  "publishedBy": "Magical Company Ltd.",
  "developedBy": "Magical Company Ltd.",
  "released": "Jun 17, 1999",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Baseball",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/99-kshien",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Magical Company Ltd.",
          "developer": "Magical Company Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 17, 1999",
          "ean13": "4 990951 997039",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}