{
  "name": "Actua Ice Hockey 2",
  "shortName": "actua-ice-hockey-2",
  "description": "<i>Actua Ice Hockey 2</i> is the follow-up of the official game of the Nagano 1998 Winter Olympics ice hockey tournament, <a href=\"https://www.mobygames.com/game/actua-ice-hockey\">Actua Ice Hockey</a>. Focused on a fictional North American league, with GHL (Gremlin Hockey League) club teams, the game enhances the graphics and gameplay of the previous version. While the game is unlicensed, all teams were inspired by their real NHL counterparts, from team logos to player names (using the classic trick of changing one letter from the name to other phonetically close). <br><br>Features include three speeds of play, a three-on-three arcade mode with smaller ring, network play and advanced body collision physics. Like NHL Championship (released around the same time), the game adds a coloured track to the puck named &quot;GremTrax&quot;. Slower shots and passes are coloured green, and faster red (opposite to the blue/red combination used by Fox). Tactics were not forgotten, and the player is able to select the lines, select how and how fast teams build up the attack and are expected to shoot on goal and how to defend. If the player does not feel like controlling everything, tactical decisions can be left to the computer. It's also possible to trade players to balance or keep rosters up to date.",
  "publishedBy": "Gremlin Interactive Limited",
  "developedBy": "Gremlin Interactive Limited",
  "released": "Apr 23, 1999",
  "alsoFor": "Windows | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Hockey",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/actua-ice-hockey-2",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Gremlin Interactive Limited",
          "developer": "Gremlin Interactive Limited",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Apr 23, 1999",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}