{
  "name": "Advanced V.G.",
  "shortName": "advanced-vg",
  "description": "The story of <i>Advanced V.G.</i> follows a similar template as those of the previous <a href=\"https://www.mobygames.com/search/quick?gamegroup=variable+geo\"> Variable Geo</a> games: the strongest young women in the country hold a tournament, which is sponsored by various restaurant chains, which in turn ask the competing girls to pose as waitresses working in said restaurants, for promotional purposes. The girls of the Jahana group who starred in the previous games return, with the new main protagonist being the young martial artist Yuka Takeuchi, who has been training in a secluded forest area before joining the competition. <br><br>Like its predecessors, <i>Advanced V.G.</i> is a fighting game, with the basic &quot;kick&quot; and &quot;punch&quot; moves, while the various special attacks are executed by pressing combinations of buttons. There are three modes in the game, &quot;Normal&quot;, &quot;Vs.&quot;, and &quot;Story&quot;. The normal mode is basically training matches between the player character and an AI-controlled girl. Vs. mode allows two-player mode, as well as demo &quot;computer vs. computer&quot; gameplay, with the possibility to choose any of the stages. Any of the nine heroines is available as a playable character in these modes (Yuka Takeuchi, Chiho Masuda, Jun Kubota, Manami Kusunoki. Kaori Yanase, Reimi Jahana, Satomi Yajima, Ayako Y?ki, and Erina Goldsmith). The story mode, on the other hand, allows the player to control Yuka Takeuchi only, and follow her story. Cut scenes advance the story between matches. <br><br>The SNES received a stripped-down version, <i>Super V.G.</i>, without the Story Mode and all explicit hentai elements. Hybrids (pair of bosses in <i>Advanced V.G.</i>) were also removed.",
  "publishedBy": "Technical Group Laboratory, Inc.",
  "developedBy": "GIGA",
  "released": "Apr 19, 1996",
  "alsoFor": "PlayStation 3, PSP, PS Vita, SEGA Saturn, SNES, TurboGrafx CD | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/advanced-vg",
  "visual": "",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Technical Group Laboratory, Inc.",
          "developer": "GIGA",
          "ported": "Technical Group Laboratory, Inc.",
          "country": " Japan",
          "releaseDate": "Apr 19, 1996",
          "ean13": "4 935066 600016",
          "comments": ""
        },
        {
          "publisher": "Success Corp.",
          "developer": "GIGA",
          "ported": "Technical Group Laboratory, Inc.",
          "country": " Japan",
          "releaseDate": "Feb 27, 2003",
          "ean13": "",
          "comments": "SuperLite 1500 Series release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}