{
  "name": "Air Management '96",
  "shortName": "air-management-96",
  "description": "<i>Air Management '96</i> is a sequel/remake to the other games in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Aerobiz\">Air Management series</a>. Like previous titles, the game is an airline management simulation however graphics and interface have been updated to 3D. Players take control of an airline as it's CEO, and must first select the name, tail logo and home airport of their airline. The game is turn-based between each airline. Each airline has four &quot;board members&quot; who can be assigned to perform various tasks, which take varying length to accomplish. These tasks include buying aircraft, bidding for slots at an airport, buying facilities at an airport and marketing a PR campaign in a region. Once the player has purchased aircraft, they must further make planning of the route between two airports with available slots. Once a route is setup, the player is able to manage how many planes fly the route daily and the number of passengers they carry, as well as ticket price.<br><br>The game is played over one of two scenarios, each representing a different era. The game is over when any airline reaches the target money amount.",
  "publishedBy": "KOEI Co., Ltd.",
  "developedBy": "KOEI Co., Ltd.",
  "released": "Mar 22, 1996",
  "alsoFor": "SEGA Saturn | Combined View",
  "genre": "Simulation",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/air-management-96",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "KOEI Co., Ltd.",
          "developer": "KOEI Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 22, 1996",
          "ean13": "4 988615 007804",
          "comments": "KOEI Classic Series release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}