{
  "name": "Angel Devoid: Face of the Enemy",
  "shortName": "angel-devoid-face-of-the-enemy",
  "description": "In <i>Angel Devoid: Face of the Enemy</i>, which is set in the futuristic NeoCity of the year 3032, the player takes the role of Jack Hard, a cop whose life goal is to hunt the criminal Angel Devoid. After an accident during a car chase he awakens in an hospital - only to find out that his face was operated to look like his eternal enemy. Now he is a wanted man...<br><br>The controls of the game are similar to <a href=\"https://www.mobygames.com/game/7th-guest\">The 7th Guest</a>: in a first-perspective view the player clicks on interactive items and a video clip shows the result. The game is designed to give an expression of the time pressure the protagonist is under - he has to react fast or he dies. This is also true when meeting other characters; in many situations Jack needs to use his gun to avoid being killed. Often he runs into conversations with people and robots instead of shooting them directly; then the player doesn't choose the exact answer but only the mood (aggressive, passive or normal) Jack answers in. The wrong approach may result in death. <br><br>The protagonist can't walk freely through the city; the game consists of several single screens which have to be left by clicking on an exit, followed by a walking animation. There are quite a few places to visit, e.g. bars or a museum, but choosing the wrong path or hot spot generally leads to an instant death. There are also a few basic inventory-based puzzles to solve. ",
  "publishedBy": "Vantan International Co., Ltd.",
  "developedBy": "Electric Dreams Inc.",
  "released": "Feb 09, 1996",
  "alsoFor": "DOS, Macintosh, SEGA Saturn | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/angel-devoid-face-of-the-enemy",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Vantan International Co., Ltd.",
          "developer": "Electric Dreams Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 09, 1996",
          "ean13": "4 996925 080097",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}