{
  "name": "Animorphs: Shattered Reality",
  "shortName": "animorphs-shattered-reality",
  "description": "<i>Animorphs: Shattered Reality</i> is a quasi-3D platformer based on the popular Scholastic book series.  A quick back story: Earth is being secretly conquered by an alien race known as the Yeerks, small slug like creatures that enter a host’s ear, latch onto their brain, and completely control them.  The only thing standing between the Yeerks and total domination is the Animorphs, a group of kids who have the power to morph into any animal form they can touch.  <br><br>In this game, the leader of the Yeerk invasion, Visser 3, has a plan to finally take over the world.  Using a device called “the Continuum Crystal”, Visser 3 plans to manipulate the space-time continuum in such as to change reality, making his invasion force the rulers of Earth, with no more Animorphs to fight against him.  However, as he activates the continuum crystal, is misfires, shatters itself and the shards of the crystal become scattered.  The Animorphs must collect all the shards of the shattered crystal to prevent Visser 3 from achieving his evil designs.<br><br>You then control the various members of the Animorphs crew, leading them through several differently themed levels (forests, swamps, urban, factories, underwater, subway tunnels, spacecraft, etc.) to collect the pieces of the crystal.  Most of the gameplay is jumping around on platforms collecting coins, battling aliens (when you encounter an alien, you automatically morph from your human self into your “battle morph”, which is a unique animal for each character), defeating the occasional boss alien, and trying not to fall.  A few levels are more of a 3rd person race, rather than platform based, as you navigate a dolphin, dragonfly, bat, or hawk (one of the Animorphs in another one of their animal forms) down a dangerous path.  All the levels are quite linear in nature.  ",
  "publishedBy": "Infogrames, Inc.",
  "developedBy": "SingleTrac Entertainment Technologies, Inc.",
  "released": "Nov 20, 2000",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other), Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/animorphs-shattered-reality",
  "visual": "",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Infogrames, Inc.",
          "developer": "SingleTrac Entertainment Technologies, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 20, 2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/35543-animorphs-shattered-reality-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/35544-animorphs-shattered-reality-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    }
  ]
}