{
  "name": "Aquanaut no Ky?jitsu 2",
  "shortName": "aquanaut-no-kyjitsu-2",
  "description": "<i>Aquanaut no Ky?jitsu 2</i> (Aquanaut's Holiday 2) is the sequel to <a href=\"https://www.mobygames.com/game/aquanauts-holiday\">Aquanaut's Holiday</a>.<br><br>Like in its predecessor, the player takes control of a submersible in order to explore the sea depths and discover a variety of animal species. Contrary to the first game's only area, the sequel has many different areas following different themes to explore. As the player gets closer to landforms or creatures, the silhouette becomes clearer and less blue or green, until it can be seen clearly. Instead of a reef where the encountered creatures are being shown, the game simply has a list of all the creatures. When a new animal is scanned with the submersible's sensor, a blue dot appears next to the scanned creature's name. Some of the animals can be interacted with. These initially have a pink dot appear next to their names instead of a blue one. When the possible interaction has been made, the dot turns blue.<br><br>The animals found in the game represent a great variety of undersea wildlife from all around the world. There is also many special locations, like ruins, to be found on the seafloor. These also figure on a list, named with poetic names rather than described. Some of these locations are found by surfacing the submersible.",
  "publishedBy": "Artdink Corporation",
  "developedBy": "Artdink Corporation",
  "released": "Jul 01, 1999",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/aquanaut-no-kyjitsu-2",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Artdink Corporation",
          "developer": "Artdink Corporation",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 01, 1999",
          "ean13": "4 988640 100372",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}