{
  "name": "Azumanga Donjara Daioh",
  "shortName": "azumanga-donjara-daioh",
  "description": "Azumanga Donjara Daioh is a mahjong variation game, based on the characters and the setting of the popular Japanese manga and anime series &quot;Azumanga Daioh&quot;.<br><br>One day, the teacher at the school introduces the students to a new event: a tournament in Donjara, financed by the company Bandai. The rules are simple: whoever wins five opponents is the winner. The location of the tournament can be anywhere, even outside school. Following this, the party from the show decides to participate in the tournament, in hope of winning prize money.<br><br>The game is a Donjara, which is different from the standard Chinese or Japanese rules of mahjong. Donjara is basically a simplified version of Japanese &quot;Riichi&quot; mahjong. Firstly, the game is played by only two players, as opposed to four in standard play. Instead of a winning hand of three sets and a pair, Donjara only allows for three sets of same tiles. Unlike Riichi mahjong, where players do not have to call Riichi if they lack only one tile to finish the hand, in Donjara players must declare Riichi before they can actually win.<br><br>Instead of traditional set of bamboo, coins and characters, Donjara uses a limited set of tiles. Numbers on tiles do not have to be equal or ascending; the tile marking and color is enough to create a set. In this game's case, all tiles are based on characters from the manga/anime. All of the main characters of the show appear in this game and they are voiced by their respective voice actors/actresses. The player can go through the game as a story, or create a match of their choice. When playing in story mode, the player selects their main character, as well as an assist character. Players can change to their selected assists before or after each round. Each match consists of five rounds. Whoever has the highest points is the winner.",
  "publishedBy": "Bandai Co., Ltd.",
  "developedBy": "Ganbarion Co., Ltd.",
  "released": "Apr 18, 2002",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/azumanga-donjara-daioh",
  "visual": "",
  "gamePlay": "Board game, Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Bandai Co., Ltd.",
          "developer": "Ganbarion Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 18, 2002",
          "ean13": "4 543112 077431",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}