{
  "name": "Blue Breaker: Ken yori mo Hohoemi o",
  "shortName": "blue-breaker-ken-yori-mo-hohoemi-o",
  "description": "The world of <i>Blue Breaker</i> is called &quot;the path in the middle of empty sky&quot;: floating islands connected with each other by bridges. It is the tradition of the people in this world that a fighter's full initiation can be completed only when he finds his true love and marries her. Such day has come now in the life of a young warrior named Kain, the hero of the game. His father explains to him that besides the usual warrior's goal of defeating the evil Dark Lord, Kain also has to find the girl of his dreams. He introduces to him a young sorceress named Asha, who becomes his first companion. But on his journey Kain meets many other young women, and it won't be so easy to choose one to whom he can give his heart!<br><br>Labeled as <i>Love Role-Playing</i>, &quot;Blue Breaker&quot; is a genre-crossing game that combines traditional Japanese RPG with town and dungeon exploration, party-based combat, etc., with &quot;love adventure&quot;, in which your behavior towards girls influences the story. &quot;Blue Breaker&quot; features branching story progressing: events appear depending on the progress you have made with your female companions. Your typical RPG activities will influence your relationship with the girls. For example, if you fight too much, the girls will be tired; if you give a girl too many orders in battle (you can set battle in auto mode and only interfere occasionally) she will be displeased, and so on. It is also important to form a party in which the girls will have as few internal conflicts with each other as possible.",
  "publishedBy": "Human Entertainment, Inc.",
  "developedBy": "HuneX Co., Ltd.",
  "released": "Dec 25, 1997",
  "alsoFor": "PC-FX, PlayStation 3, PSP, PS Vita, SEGA Saturn | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/blue-breaker-ken-yori-mo-hohoemi-o",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Human Entertainment, Inc.",
          "developer": "HuneX Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 25, 1997",
          "ean13": "4 959143 900219",
          "comments": ""
        },
        {
          "publisher": "HAMSTER Corporation",
          "developer": "HuneX Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Oct 26, 2000",
          "ean13": "4 529651 000420",
          "comments": "Major Wave Series release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}