{
  "name": "Bottom of the 9th '99",
  "shortName": "bottom-of-the-9th-99",
  "description": "This baseball game features the following game modes: exhibition, season, training, and scenario.<br><br>Exhibition mode lets the player play against the computer, another player, or just watch a game between 2 computer players. Training mode lets players practice their fielding, pitching, and batting skills. Scenario mode puts the player in a tight situation in 20 different  in-progress games to see if they can succeed in those situations. Season mode lets players play a season with anywhere from 15 to 162 games. The game can keep track of the season statistics, team standings, and any trades made during the season.<br><br>With only an MLBPA license, the game features the names of the real MLB players, but it doesn't include the real team's names or their logos, just the cities they play in. The game also offers 30 different stadiums to play in.<br><br>During the game, pitching involves selecting a type of pitch and aiming it into the batter's box by sliding around a cursor to where they want the pitch to go. To hit the ball, batters must move their own cursor to match where the ball will end up. If the batter decides to powerhit, the cursor becomes smaller, making it harder to make contact with the ball.<br><br>The game also features an announcer that calls the plays in real time.",
  "publishedBy": "Konami of America, Inc.",
  "developedBy": "Konami Computer Entertainment Chicago, Inc.",
  "released": "1998",
  "alsoFor": "",
  "genre": "Simulation, Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Baseball",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/bottom-of-the-9th-99",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami of America, Inc.",
          "developer": "Konami Computer Entertainment Chicago, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1998",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}