{
  "name": "Charumera",
  "shortName": "charumera",
  "description": "<i>Charumera</i> is a single-player Japanese video game released for the PlayStation in 1999.<br><br>The game can be thought of as a management simulator of sorts, despite the fact that it actually stands on a genre of its own – at least considering the western market, where nothing of the sort comes to mind.<br><br>You essentially take on the role of Uncle Charumera, the noodle mascot of Myojo Foods, as he goes through a city selling his goods (ramen), getting new ingredients and trying to please his customers as much as possible.<br><br>Before getting into the game’s mechanics in a more detailed fashion, here’s a bit of interesting trivia: the word “charumera” is actually derived from the Portuguese “charamela”, a type of flute that was brought to Japan around 400 years ago. This flute has traditionally been used by yatai (ramen mobile food stalls, just like the one used in the game). So, there is an interesting double pun in the game’s title: it is both referring to the flute used by yatai/Uncle Charumera, and also to the mascot’s name itself.<br><br>Right after starting the game, there is an option to name your stall, even though you can leave it at default value. Afterwards, you’re presented with what could be considered the “cooking” screen, where you can mash up all kinds of different ingredients to create distinct flavours of ramen. You start with only a select few ingredients, even though new ones can be acquired throughout the game.<br><br>After you have your first couple of dishes lined up, it’s time to start selling. You control Uncle Charumera as he walks through town (from 3pm to 12am) accompanied by his stall, and the namesake flute is used to call upon potential clients. When you blow the flute, people – either a large crowd or a just a couple - gathers. The icons above their heads represent their thoughts concerning your dishes (whether they like or dislike it). It should be noted that their opinions can change over time, so it’s generally not a good idea to stick to one recipe just because it was successful in the past – some customers eventually get sick of the same recipe over and over again.<br><br>Some customers have more refined tastes, and can be harder to please. However, if you do manage to persuade these clients, some of them can eventually become sponsors for your ramen brand.<br><br>People can rate your dishes, and rating varies according to the area you’re in (e.g., a hit ramen recipe in one area can be disliked in another). 10 stars is the maximum evaluation you can get.\nProbably the most complex aspect of the game is figuring out which ingredient combinations work best together – in fact, the key to this game is experimenting – in order for you to get the best rating possible.\nThere are lots of noodles, sauces, soups and seasonings that can be mixed up in dozens of different ways. Plus, the game does not have a time limit, so trial and error really has no punishment.<br><br>There are a couple of other main characters besides Uncle Charumera:\n<ul>\n<li> Kamikaze Jin, a taxi driver, which serves as your main “taster”, providing feedback and allowing you to check if you’re on the right track with a certain dish;\n<li> Kumona, a temple priest which requires vegetarian ramen;\n<li> Madame Iyan, the owner of a rival Chinese restaurant;\n<li> Koishiya, owner of a Japanese soba shop.\n</ul>\nYou obviously earn money whenever you sell something – and even though the goal of the game should be making profit, it really does not seem necessary in order to proceed. There is no concept of finances/investment/accounting in the game, most likely to keep it simple and enjoyable, focusing solely on the creativity of recipe-making.<br><br>On a more technical side, the game controls easily, with basic side-scrolling while walking around with Uncle Charumera, and simple d-pad transitions when selecting ingredients.\nThere is some background music throughout, and a few sound effects (flute, people’s bellies getting full, or people getting sick).\nVisually, the game uses simple 2D graphics, with a couple of scenario variants (different parts of the city, daylight and night time).\nThere is also some degree of replayability, if only when considering the hundreds of ingredient combinations you can use to make your recipes.",
  "publishedBy": "Victor Interactive Software, Inc.",
  "developedBy": "Bits Laboratory",
  "released": "Nov 25, 1999",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/charumera",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Victor Interactive Software, Inc.",
          "developer": "Bits Laboratory",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 25, 1999",
          "ean13": "4 988110 400254",
          "comments": "Victor Interactive Software re-release"
        },
        {
          "publisher": "Marvelous Interactive, Inc.",
          "developer": "Bits Laboratory",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 11, 2003",
          "ean13": "4 988110 021428",
          "comments": "PSone Books release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/760551-charumera-playstation-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/760548-charumera-playstation-screenshot-intro-movie-before-the-title.png",
      "caption": "Intro movie (before the title screen)."
    },
    {
      "link": "/images/shots/l/760550-charumera-playstation-screenshot-uncle-charumera-blowing-the.png",
      "caption": "Uncle Charumera blowing the flute."
    },
    {
      "link": "/images/shots/l/760560-charumera-playstation-screenshot-inserted-a-random-name.png",
      "caption": "Inserted a random name."
    },
    {
      "link": "/images/shots/l/760561-charumera-playstation-screenshot-now-loading.png",
      "caption": "Now loading."
    },
    {
      "link": "/images/shots/l/760562-charumera-playstation-screenshot-the-game-just-started-conversation.png",
      "caption": "The game just started. Conversation with the taxi driver."
    },
    {
      "link": "/images/shots/l/760563-charumera-playstation-screenshot-your-opinions-are-always.png",
      "caption": "Your opinions are always welcome, buddy."
    },
    {
      "link": "/images/shots/l/760564-charumera-playstation-screenshot-menu.png",
      "caption": "Menu."
    },
    {
      "link": "/images/shots/l/760565-charumera-playstation-screenshot-too-many-combos-the-default.png",
      "caption": "Too many combos. The &quot;default&quot; ramen. From the game's back cover: &quot;Miso, soy source, salt, from Hokkaido ramen to Kyushu ramen... it's a fun that you can create your original ramen!&quot;"
    },
    {
      "link": "/images/shots/l/760566-charumera-playstation-screenshot-messing-around-with-the-ingredients.png",
      "caption": "Messing around with the ingredients. Let's create something new."
    },
    {
      "link": "/images/shots/l/760567-charumera-playstation-screenshot-sweet-savory-dish-moby-gay.png",
      "caption": "Sweet savory dish: Moby Gay Ramen, wishing you great success."
    },
    {
      "link": "/images/shots/l/760568-charumera-playstation-screenshot-the-map.png",
      "caption": "The map."
    },
    {
      "link": "/images/shots/l/760569-charumera-playstation-screenshot-go-to-work.png",
      "caption": "Go to work!"
    },
    {
      "link": "/images/shots/l/760570-charumera-playstation-screenshot-gotta-make-a-living-time.png",
      "caption": "Gotta make a living... Time to blow the horn. A sweet elderly couple... my first customers?"
    },
    {
      "link": "/images/shots/l/760571-charumera-playstation-screenshot-hard-earned-pay-erm-only.png",
      "caption": "Hard earned pay. Erm... only two kiddos. Better than nothing."
    },
    {
      "link": "/images/shots/l/760572-charumera-playstation-screenshot-hey-you-little-bastard-let.png",
      "caption": "Hey you little bastard, let's run together."
    },
    {
      "link": "/images/shots/l/760573-charumera-playstation-screenshot-huh-working-is-tiresome.png",
      "caption": "Huh, working is tiresome."
    },
    {
      "link": "/images/shots/l/760574-charumera-playstation-screenshot-i-just-want-to-buy-new-ingredients.png",
      "caption": "I just want to buy new ingredients, not a TV?"
    },
    {
      "link": "/images/shots/l/760575-charumera-playstation-screenshot-nice-landscape.png",
      "caption": "Nice landscape..."
    },
    {
      "link": "/images/shots/l/760576-charumera-playstation-screenshot-it-s-getting-dark-can-t-stop.png",
      "caption": "... it's getting dark. Can't stop looking at &quot;you&quot;."
    },
    {
      "link": "/images/shots/l/760577-charumera-playstation-screenshot-so-far-the-business-is-going.png",
      "caption": "So far the &quot;business&quot; is going ok. Let's reach the top of the mountain. There's a long way to go... to be the #1 vendor in Japan!"
    },
    {
      "link": "/images/shots/l/760578-charumera-playstation-screenshot-working-off-hours-who-wants.png",
      "caption": "Working off-hours. Who wants... Moby Gay Ramen?"
    },
    {
      "link": "/images/shots/l/760579-charumera-playstation-screenshot-selling-the-original-ramen.png",
      "caption": "Selling the &quot;original&quot; ramen in town! Hey customers, hungry much?"
    },
    {
      "link": "/images/shots/l/760580-charumera-playstation-screenshot-uncle-charumera-doesn-t-care.png",
      "caption": "Uncle Charumera doesn't care about religion. He believes in the Ancient Alien theory."
    },
    {
      "link": "/images/shots/l/760582-charumera-playstation-screenshot-interacting-you-ll-meet-lots.png",
      "caption": "Interacting. You'll meet lots of new people throughout the game. And of course, you can learn about interesting facts on ramen."
    },
    {
      "link": "/images/shots/l/760581-charumera-playstation-screenshot-deserted-place-appreciating.png",
      "caption": "Deserted place? Appreciating the night sky. Be right back (with more gameplay screenshots)."
    }
  ],
  "cover": []
}