{
  "name": "Cindy's Fashion World",
  "shortName": "cindys-fashion-world",
  "description": "<i>Cindy's Fashion World</i> is a single player game aimed at young girls and which consists of a series of simple activities. After a short animated introduction the game displays it's main menu from which the game's three groups of activities can be accessed. They consist of:<ul>\n<li>Adventures:<br><br>\nThere are five adventures available, each is preceded and followed by a short animation sequence. They are:<ul>\n<li>Hot Styles: Here the player gets to change the shoes, jacket, hat, and trousers/skirt on each of the girls, there are five or six of each to choose from. There is no option to save or print the player's selection nor does the player get to see the girls in the chosen outfits.</li><br>\n<li>Berry's Cafe: Here the girls all go to a cafe for a meal but the lights go out and when they come back on the food is randomly placed on the table. The player must sort this out. The game displays the picture of one of the girls on the lower left corner and the player must select the an item of food that the girl likes from those on the table. The process is repeated until all the food has been cleared from the table. There is no time limit and there is no score. </li><br>\n<li>Shopping Spree: There's a sale of the new season's fashion items and the girls must rush to get the bargains. This mini-game consists of a maze made of shop counters. At random points in the aisles items of clothing appear which the player must direct one of the girls to collect. This mini-game is timed and the items collected are worth points. It is controlled via the keyboard's arrow keys.</li><br>\n<li>Beauty Parlour: Here the player gets to change the hairstyle, and the colour of the lipstick, fingernail and toenail polish on each of the girls. There is no option to save or print the player's selection nor does the player get to see the girls fully made up.</li><br>\n<li>Cutie Pets: Very similar to the Beauty Parlour game but here the player is adding accessories to the girl's pets. There are five or six hats, collars and bracelets that can be added. As in previous games there is no option to save or print the final result.</li></ul></li>\n<li>Cool Tests: There are four tests in this section<ul>\n<li>In the Personality Indicator the player enters their name and the game responds with an assessment of their personality.</li><br>\n<li>The Love Indicator invites the player to enter their name and the name of a boy to see if they would make a good couple.</li><br>\n<li>The Suitability Indicator is very similar to the Love Indicator. In this test the player enters the names of two friends and the computer responds saying who is the best potential match.</li><br>\n<li>The Cool Test is very similar to the Personality Indicator. The player enters their name and the computer responds with an assessment of how cool they are</li></ul></li>\n<li>Fashion Design: Here the player is presented with eight pictures that they can colour in on-screen. There is no option to print the completed picture.</li></ul>",
  "publishedBy": "Phoenix Games B.V.",
  "developedBy": "Ivolgamus UAB",
  "released": "2004",
  "alsoFor": "Windows | Combined View",
  "genre": "Simulation",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/cindys-fashion-world",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Phoenix Games B.V.",
          "developer": "Ivolgamus UAB",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2004",
          "ean13": "8 717249 593614",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}