{
  "name": "Cindy's Caribbean Holiday",
  "shortName": "cindys-caribbean-holiday",
  "description": "<i>Cindy's Caribbean Holiday</i> is a single player game aimed at young girls and which consists of a series of simple activities. The game starts with an animated sequence in which Cindy calls up her friends and invites them on a holiday in the Caribbean. This leads the player to the main menu. From this menu all the game's activities can be accessed. They consist of<ul>\n<li>Adventures<br><br>\nThere are five adventures to choose from.<ul>\n<li>Packing for the holidays<br>In this mini-game the player starts in Cindy's Room. A number of items of clothing are scattered around and the object of the game is to click on each to remove it from the screen within a fixed time limit. After clearing Cindy's room the player moves to Kate's room and then Diana's.</li><br>\n<li>Interior Designer<br>\nThe player is presented with a picture of Cindy's Room and four icons. These icons change the style and colour of the sofa, the light, the picture and the chair.</li><br>\n<li>Lost Rabbits<br>\nThis mini-game is similar to <a href=\"https://www.mobygames.com/search/quick?gamegroup=Whac-A-Mole+variants\">Whac-A-Mole</a>. There are three levels to this game, all using the same tree-filled background. Behind some of the trees are rabbits which randomly slide into view before going back into hiding. The object of the game is to catch the rabbits by clicking on them. There is no time limit.</li><br>\n<li>Delicious Fruits<br>\nThere are three levels to this mini-game, each featuring a different character against the same background. Each level lasts for a fixed period of time. Pictures of fruit and bugs fall slowly from the top of the screen and the object is to catch as much fruit as possible while avoiding the bugs.  At the end of each level, and at the end of the game a score is given.</li><br>\n<li>Bikini Fun<br>\nIn this game the player gets to change the clothes the girls wear. There is no option to save or print the picture</li></ul>\n<li>Cool tests<br><br>\nThere are four tests in this section<ul>\n<li>In the Boyfriend Finder the player answers questions about their favourite colour, shape and number then the computer calculates the name of the boys who would be a perfect match.</li><br>\n<li>The Coolest Girl test is very similar, after answering five simple multiple choice questions the game responds with an assessment of the players character.</li><br>\n<li>The Pet Guide asks questions about the players favourite food, flower and fruit before calculating the player's ideal pet.</li><br>\n<li>Finally the Friendship Indicator asks five multiple choice questions before responding with an assessment of whether the player would make a good friend or not.</li></ul>\n<li>Beach Images<br><br>This mini-game invites the player to select one of ten pictures. It then shows that picture full-screen in join-the-dots format. As the player must click on the dots in the correct order the game completes the picture line by line.</li></ul>This game is entirely mouse controlled.",
  "publishedBy": "Phoenix Games B.V.",
  "developedBy": "Ivolgamus UAB",
  "released": "2004",
  "alsoFor": "Windows | Combined View",
  "genre": "Action, Simulation",
  "perspective": "1st-person, 3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/cindys-caribbean-holiday",
  "visual": "",
  "gamePlay": "Arcade, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Phoenix Games B.V.",
          "developer": "Ivolgamus UAB",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2004",
          "ean13": "8 717249 593676",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/254873-cindy-s-caribbean-holiday-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/254872-cindy-s-caribbean-holiday-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/254874-cindy-s-caribbean-holiday-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "PlayStation"
    }
  ]
}