{
  "name": "Crime Crackers",
  "shortName": "crime-crackers",
  "description": "In the distant future, in the reaches of space, war raged on for many years. Many lives were lost, but eventually, peace returned to the galaxy. But those who fought yet remain, and with wartime advances in technology, many turned to piracy.<br><br>It is now 20 years after the end of the war, and many have begun to forget how hard-won the current peace is. Piracy is at an all-time high, and the Galactic Police are unable to keep up. Enter the Crackers: bounty hunters who take jobs that perhaps the regular police cannot tackle, efficiently stopping evildoers...so long as the pay is good. Team Pink Dolphin is a highly skilled Cracker team. On their way back to civilization after a mission, they receive a distress signal from a nearby ship, and decide to investigate...<br><br><i>Crime Crackers</i> is a a first-person action shooting game. The player controls the Pink Dolphin team as they explore each area, defeating enemies and collecting useful items. Combat is real-time, but the player must switch into attack mode in order to attack enemies. This gives the player an aiming cursor, but reduces movement to only left and right strafing. To make up for reduced mobility the player can also block incoming attacks. Each stage culminates in a boss fight at the end, and between stages there are short dialogue scenes that drive the story, as well as an opportunity to buy and sell items.<br><br>The team has three combat members: Amelia, Pink Dolphin team leader, cute redhead, and a crack shot; Drann, a large dragon-man who served under Amelia's grandfather during the wars, and who carries a large automatic rifle; and Liza, a girl from the Fox planet who wields a sword and talks like a samurai. Each has their own weapons and abilities, and the player can freely switch between them at any time. Each character also has their own life and weapon energy meter, so the player must take care to keep all three in good condition. During missions, they will also receive communications from their support team.",
  "publishedBy": "Sony Computer Entertainment Inc.",
  "developedBy": "Media.Vision Entertainment Inc.",
  "released": "Dec 03, 1994",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/crime-crackers",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Sony Computer Entertainment Inc.",
          "developer": "Media.Vision Entertainment Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 03, 1994",
          "ean13": "4 948872 100038",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/203903-crime-crackers-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/203904-crime-crackers-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/203905-crime-crackers-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/203906-crime-crackers-playstation-other.jpg",
      "scanOf": "Other",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    }
  ]
}