{
  "name": "Dai-4-ji Super Robot Taisen",
  "shortName": "dai-4-ji-super-robot-taisen",
  "description": "The proper sequel to the <a href=\"https://www.mobygames.com/game/snes/dai-3-ji-super-robot-taisen_\"> third game</a> and <a href=\"https://www.mobygames.com/game/super-robot-taisen-ex\">EX</a>.<br><br>Three months have passed since the third game, where a race of extraterrestrials, known as the &quot;Inspectors&quot;, attacked Earth Federation forces (Mobile Suit Gundam). The Earth Federation, economically exhausted from conflicts, decides to impose the hegemony of Earth and to neglect the Space Colonies. In the midst of these reforms, rear admiral Jamitov (Zeta Gundam) forms the Titans, a pro-Earth group with a goal to enforce the will of the Federation on the Colonies. Due to the neglect, a rebellion begins in the Colonies, with the formation of the AEUG (Anti-Earth Union Group, also from Zeta Gundam). Meanwhile, Hamarn Karn (Zeta and ZZ Gundam) forms the Neue DC, a new group of Divine Crusaders (the villains from the first game) on a large mining asteroid. On Mars, two mysterious, yet very powerful figures, rebuild the same group with enormous amount of resources and technology. The Londo Bell battalion (Char's Counterattack), declared missing in the wake of the &quot;La-Gias incident&quot; (EX), is stripped of its former titles and becomes a rogue military group. Despite these circumstances, the threat of extraterrestrials still exists, with the arrival of the Guests...<br><br><i>Dai-4-ji Super Robot Taisen</i> is the finale of the Classic timeline of the series (until <a href=\"https://www.mobygames.com/game/super-robot-wars-f\">F</a> and <a href=\"https://www.mobygames.com/game/super-robot-wars-f-final\">F Final</a> came), before the story elements were revamped into Alpha series. This game introduced a number of significant features that became the mainstay of the entire franchise, such as a customizable player characters (appearance, sex, birth date, personality, robot type), upgradable weapons and pilot skills. The birth date determines the &quot;spirit powers&quot; (?? <i>seishin</i>), which gives the players advantage over the enemy. The story branches depend on the actions of the player throughout the campaign. Also, a number of new robot franchises were added, such as Mazinkaiser (designed by the creator of the Mazinger franchise himself, Go Nagai), L-Gaim and Go Shogun.",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Winky Soft Co., Ltd.",
  "released": "Jan 26, 1996",
  "alsoFor": "SNES | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/dai-4-ji-super-robot-taisen",
  "visual": "",
  "gamePlay": "Tactical RPG, Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Winky Soft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jan 26, 1996",
          "ean13": "4 983164 734027",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}