{
  "name": "Deserted Island",
  "shortName": "deserted-island",
  "description": "<h3>PlayStation Store Description (from <a href=\"https://www.mobygames.com/game/deserted-island/adblurbs\">Ad Blurbs</a>)</h3><b>?This game is supported with the PSP® and PS Vita screenshot function?<br>PSP®: Screenshots can be taken by using the menu after holding the PS button (HOME button) in the game. <br>The image will be saved in the photo collection from the XMB™ (XrossMediaBar).<br>PS Vita: Screenshots can be taken by using &quot;Screenshot&quot; from the &quot;Settings&quot; after holding the PS button in the game. <br>The image will be saved as an application photo. <br><br>This software can be played with PlayStation®3 and PSP® (PlayStation®Portable).<br>If you are downloading with PC or via PS3™, after downloading with the device please connect to PSP® with a USB cable and copy the content by inserting a storage media like Memory Stick™.</b><br><br>This is a survival simulation game masterpiece!<br>Become the captain of an exploration team dispatched to an unknown island and find out the hidden &quot;truth&quot; on the island!<br>The player will need to investigate the island while working to grasp the characteristics of the members and managing their physical conditions.<br>Record various events occurred on the island in the &quot;Natural History&quot; and use the given points to develop the crew members.<br>Find out the truth by continue on with the dangerous investigations and associate various things that have occurred!<br><br><b>Copyright:</b><br>©Softgarage<br><br>Purchase or use of this item is subject to SEN Terms of Service and User Agreement.",
  "publishedBy": "KSS",
  "developedBy": "Mediamuse",
  "released": "Nov 29, 1996",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/deserted-island",
  "visual": "",
  "gamePlay": "RPG elements",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "KSS",
          "developer": "Mediamuse",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 29, 1996",
          "ean13": "4 988262 300808",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}