{
  "name": "Disney's Winnie the Pooh: Kindergarten",
  "shortName": "disneys-winnie-the-pooh-kindergarten",
  "description": "<i>Disney's Winnie the Pooh: Kindergarten</i> is a children's educational title from Disney, it's part of a series which includes <a href=\"https://www.mobygames.com/game/disneys-winnie-the-pooh-toddler\">Disney's Winnie the Pooh: Toddler </a> and <a href=\"https://www.mobygames.com/search/quick?game=Disney%27s+Winnie+the+Pooh+Preschool\">Disney's Winnie the Pooh Preschool</a>. Some parts of all these titles, such as the introduction look the same.<br><br>The signing in post is also the place where players and other interested parties can see progress and print off certificates. The first time the player signs in they will see a scene showing Christopher Robin leaving for school, &quot;I Wish I could go to school&quot; says Pooh sadly, &quot;Well why don't we have a school in the hundred acre wood&quot; replies Piglet. Owl says he thinks it's a splendid idea and claims it as his own. After this the player is presented with a map of the hundred acre wood which will be their starting point on future sessions. The activities shown on the map are;<ul><br>\n<li>Printing: Here the player can print name tags, book marks and worksheets etc</li><br>\n<li>Musical Mix &amp; Match: The player is presented with two groups of instruments. They select one from the four on the left and one from the four on the right. These combine in the centre to make a new instrument which the player can play by clicking on the keys/strings. There are icons along the bottom of the screen to play a backing track - just one available, record, playback, save and play a saved tune</li><br>\n<li>Number Balloons: Roo's game resembles a fairground side show, it has a striped roof and at the top of the screen running left to right are the numbers one to twenty - one number per stripe. Roo releases a random number of balloons and the player must click on each balloon once until all are counted, the balloons can be clicked in any order but all of them must be clicked. Then the player selects the number from the awning that corresponds to the number of balloons displayed. When the get the answer correct they can/must pop all the balloons and the process repeats</li><br>\n<li>Thoughtful Place: Pooh is in the woods, he's at a place that's not quite a Thoughtful Place yet so making it one is the player's task. To achieve this they use the icons along the bottom of the screen one changes the sky, another changes the scenery, one changes the season, another adds music - just the one track, then items such as logs, trees, ponds, flowers can be added while another button makes any selected object larger or smaller. There are also icons to delete an object, wipe the whole scene, plus save/load icons</li><br>\n<li>Treasure Hunt: This gets the player familiar with maps and directions. On the right is a map with an overlaid grid, Tigger appears here usually somewhere near the middle. On the left is a smaller grid and beneath it is a compass, instructions appear in the small grid such as 'South to tree' and the player must click South on the compass to move Tigger around the map. This continues until he finds the treasure.</li><br>\n<li>Word Shop: Owls library was disturbed by a strong wind and he needs help to put pages back into his book. On the easy setting the player is shown a book with, say, a 'K' on the left and across the top of the screen will be three pictures one of which will have the word 'King' and the picture of a King on it. These match so the player clicks on the picture, drags it to the right hand page of the book and continues. On the harder settings the book will have a picture of a king and across the top of the screen will be three pages one of which will just bear the word 'King'</li><br>\n<li>Shape Sorting: This is Rabbit's game and it is basically two shelves with an assortment of three shapes, on the easy setting each shape is a different colour, on the top and three bottles below. The object is to put the right shape into the right bottle. If the player clicks on the bottle they will hear 'This is a rectangle' or whatever is appropriate</li></ul><br>\nAll games have three difficulty settings and odd animations that pop up, apparently at random, to pique the player's interest. When the player completes a game they earn a star, there are fourteen stars in all and there's a certificate that can be printed out.<br><br>\n",
  "publishedBy": "BAM! Entertainment, Inc.",
  "developedBy": "Creative Capers Entertainment, Inc., Disney Interactive Victoria",
  "released": "Nov 05, 2002",
  "alsoFor": "Macintosh, Windows | Combined View",
  "genre": "Educational",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/disneys-winnie-the-pooh-kindergarten",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "BAM! Entertainment, Inc.",
          "developer": "Creative Capers Entertainment, Inc.",
          "ported": "HI Corporation",
          "country": " United States",
          "releaseDate": "Nov 05, 2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1005866-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/1005867-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Cutscene"
    },
    {
      "link": "/images/shots/l/1005868-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Map"
    },
    {
      "link": "/images/shots/l/1005869-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Options"
    },
    {
      "link": "/images/shots/l/1005870-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Loading"
    },
    {
      "link": "/images/shots/l/1005871-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Tigger's Treasure Hunt"
    },
    {
      "link": "/images/shots/l/1005872-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Owl's Wordshop"
    },
    {
      "link": "/images/shots/l/1005873-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Horny Whale"
    },
    {
      "link": "/images/shots/l/1005874-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Eeyore's Musical Mix and Match"
    },
    {
      "link": "/images/shots/l/1005875-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Roo's Number Balloons"
    },
    {
      "link": "/images/shots/l/1005876-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Memory Card"
    },
    {
      "link": "/images/shots/l/1005877-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "Rabbit's..."
    },
    {
      "link": "/images/shots/l/1005878-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "...Shape Sorting"
    },
    {
      "link": "/images/shots/l/1005879-disney-s-winnie-the-pooh-kindergarten-playstation-screenshot.png",
      "caption": "I'll just quit"
    }
  ],
  "cover": []
}