{
  "name": "Dragon Knight 4",
  "shortName": "dragon-knight-4",
  "description": "<i>Dragon Knight 4</i> is a sequel to <a href=\"https://www.mobygames.com/game/knights-of-xentar\">Knights of Xentar</a>. Years have passed after Takeru (a.k.a. Desmond, the hero of the previous Dragon Knight games) defeated the ultimate evil. He married his sweetheart Luna, and they had a son named Kakeru. This fifteen-year-old boy has one weakness: he likes naked female elves. But soon he learns that the evil wizard Lushifon wants to turn all people into stones and control the whole world while nobody is able to stop him. Together with the mysterious swordsman Eto and many other heroes, Kakeru must perform his ultimate quest and defeat Lushifon and his minions.<br><br>In this tactical role-playing game the player controls nine units in battles, assigned according to the class of the character who leads the unit. The opponents also form similar groups, and are also divided into classes. Each class has its own range, strengths, and weaknesses. There are many characters the players can recruit to the party, and they belong to different classes (barbarians, archers, magicians, etc.).<br><br>The adult content (scenes which include nudity) has been removed from the console releases. The PlayStation version has updated graphics and CG animations.",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Elf Co., Ltd.",
  "released": "Feb 07, 1997",
  "alsoFor": "DOS, FM Towns, PC-98, PC-FX, Sharp X68000, SNES | Combined View",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/dragon-knight-4",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Elf Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 07, 1997",
          "ean13": "4 983164 738193",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}