{
  "name": "Eithéa",
  "shortName": "eitha",
  "description": "My?jin High School, Tokyo, present day.<br><br>Sh?, a high school student orphaned since very young age, commutes with his childhood friend Yuka and a shy, but very talented classmate, Hikaru. One day, the school is struck by an enormous earthquake. Upon waking up, Sh? finds himself lost in the ruins. He manages to find Yuka and Hikaru, along with their professor Akiho, and hurriedly try to run away from the crumbling ruins. Upon exiting, it turns out that, beyond the school walls, there is no Tokyo or any other city. Rather, they realize that they have been teleported to a new world of Eithéa. Thus begins their adventure to find a way back to Earth, while being entangled in a brewing conflict in the new world.<br><br><i>Eithéa</i> (pronounced as &quot;aye-thee-ah&quot;) is a Japanese RPG that follows a strictly linear, but very long storyline, focused on the protagonist and his company from both Earth and the world of Eithéa. The player controls the characters in the overworld from the bird-eye view, while combat is isometric. The game consists of progressing the story through completing the main storyline, upgrading characters' equipment, triggering certain points in the game and talking to important characters.<br><br>The combat is done in a traditional turn-based way, like many JRPG contemporaries, and is triggered through random encounters. However, the system has two important gimmicks. The first is that players are given the option of applying multiple stances and formations of the party that best suit a situation. Enemies can come and attack from four directions, meaning that players have to carefully strategize to win. Attacks from behind deal greater damage, so players need to be careful where to place characters during combat. The other gimmick introduced is the &quot;Barrier&quot;. Characters that stay inside a barrier (summoned by characters that possess &quot;forms&quot;) take half the damage, while exiting the barrier results in much higher damage. Characters can be melee-based or projectile-based and each of these two classes have their own advantages and disadvantages.<br><br>The game also features a character progression system. Players can make choices that deepen their relationship with others in the party, which can result in romance with them as the story goes.",
  "publishedBy": "Atlus Co., Ltd.",
  "developedBy": "TamTam Co., Ltd.",
  "released": "Feb 22, 2001",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/eitha",
  "visual": "2D scrolling, Isometric",
  "gamePlay": "Japanese-style RPG (JRPG)",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Atlus Co., Ltd.",
          "developer": "TamTam Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 22, 2001",
          "ean13": "4 984995 110431",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}