{
  "name": "FIFA Soccer 2003",
  "shortName": "fifa-soccer-2003__",
  "description": "<i>FIFA Soccer 2003</i> on the PlayStation is another update in the long-running soccer series. It features a limited number of teams and modes of the <a href=\"https://www.mobygames.com/game/ps2/fifa-soccer-2003\">concurrent next generation version</a>, with some exclusive modes and platform-appropriate graphics.<br><br>The game includes teams from 12 national leagues (missing Brazil, Korea and Switzerland from the next-gen version), 23 rest-of-the-world teams (down from 40 in the other version) and 39 international teams.<br><br>Game modes include the Club Championship (featuring 18 top European clubs, playable as a season or a friendly) as well as regular friendlies, season play for all 12 leagues, and various tournaments. Shared with the next-gen version (but with a limited selection of playable teams) are the EFA Trophy (i.e. UEFA Cup), European Champion's Cup (i.e. UEFA Champions League) and International Cup (i.e World Cup). Exclusive to this version are the World Club Challenge of 32 international clubs and the European Challenge of 16 European clubs. Custom tournaments are also available.<br><br>On the pitch, similar graphics and the same camera options as in earlier versions are used. Controls are similar as well, with the power bars for shooting and passing making a return, but with the option of turning them off. None of the new Freestyle Control options from the next-gen version have made it to the PlayStation version, however.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Electronic Arts UK Ltd.",
  "released": "Nov 05, 2002",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "3rd-person (Other), Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/fifa-soccer-2003__",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts UK Ltd.",
          "ported": "",
          "country": " Italy",
          "releaseDate": "2002",
          "ean13": "5 030947 032173",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/692834-fifa-soccer-2003-playstation-screenshot-the-game-s-title-and.png",
      "caption": "The game's title and load screen. After this there's a video montage showing Ryan Giggs, Edgar Davids and whatshisname showcasing their football skills"
    },
    {
      "link": "/images/shots/l/692836-fifa-soccer-2003-playstation-screenshot-after-the-load-screen.png",
      "caption": "After the load screen and the usual display of logos there's a video montage showing Ryan Giggs, Edgar Davids and Roberto Carlos showcasing their skills against a white background"
    },
    {
      "link": "/images/shots/l/692837-fifa-soccer-2003-playstation-screenshot-the-game-s-main-menu.png",
      "caption": "The game's main menu. The EA Sports Extra's option just displays the credits and shows an animated advertisement for other EA Sports products"
    },
    {
      "link": "/images/shots/l/692839-fifa-soccer-2003-playstation-screenshot-starting-a-friendly.png",
      "caption": "Starting a friendly game. These are the modes of play, next the player chooses from three difficulty settings. Throughout game and menus little windows pop up saying what music is playing"
    },
    {
      "link": "/images/shots/l/692841-fifa-soccer-2003-playstation-screenshot-starting-a-friendly.png",
      "caption": "Starting a friendly match.\nThis is the team selection screen, it started at Arsenal and scrolls left/right through the teams in alphabetical order.\nThe same screen is used for the opponents"
    },
    {
      "link": "/images/shots/l/692843-fifa-soccer-2003-playstation-screenshot-starting-a-friendly.png",
      "caption": "Starting a friendly match. From the team selection screen circle brings up the game configuration screen."
    },
    {
      "link": "/images/shots/l/692850-fifa-soccer-2003-playstation-screenshot-after-selecting-the.png",
      "caption": "After selecting the teams, choosing which strip they wear, and which team is controlled by the gamer, the teams finally take to the field"
    },
    {
      "link": "/images/shots/l/692851-fifa-soccer-2003-playstation-screenshot-the-kick-off-this.png",
      "caption": "The kick off. This is the standard view of the match."
    },
    {
      "link": "/images/shots/l/692853-fifa-soccer-2003-playstation-screenshot-a-red-card-has-been.png",
      "caption": "A red card has been issued for a bad tackle. Timing, as ever, is everything. \nThe players will sportingly shake hands before the offender leaves the field, just like real life."
    },
    {
      "link": "/images/shots/l/692875-fifa-soccer-2003-playstation-screenshot-the-match-can-be-paused.png",
      "caption": "The match can be paused by pressing START. This allows the player to change team tactics and much more.\nThere's another music pop-up information screen in this shot too"
    },
    {
      "link": "/images/shots/l/692892-fifa-soccer-2003-playstation-screenshot-from-the-pause-menu.png",
      "caption": "From the pause menu the gamer can access this instant replay function"
    },
    {
      "link": "/images/shots/l/692895-fifa-soccer-2003-playstation-screenshot-when-a-goal-is-scored.png",
      "caption": "When a goal is scored it is replayed from many different angles automatically"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/147986-fifa-soccer-2003-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Germany",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/147987-fifa-soccer-2003-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Germany",
      "platforms": "PlayStation"
    }
  ]
}