{
  "name": "Fire Woman: Matoi-gumi",
  "shortName": "fire-woman-matoi-gumi",
  "description": "The protagonist of this game is an exchange student who just got transferred to the Shirosagi high school. Upon his arrival he witnesses a boy bullying a school girl. Naturally, he comes to her rescue, but gets badly beaten by the boy and his friends. To his astonishment, three high school girls arrive and defeat the ruffians. The hero learns that those girls belong to an organization called &quot;Matoi-gumi&quot;. Well-trained in martial arts, these girls protect the campus from hooligans and alike. The hero decides to join Matoi-gumi. Maybe he will save enough girls to make one of them grateful and become his girlfriend!<br><br><i>Fire Woman: Matoi-gumi</i> is an RPG, though not in the traditional sense. There are no supernatural occurrences in the game. Character growth is determined by training, not by fighting enough battles to level up. Learning martial arts, playing basketball, participating in chemistry class - everything has an effect on the hero's parameters. There are no random battles in the game; the fights are story-related and usually occur when the hero attempts to rescue a girl. The battles are turn-based, but have a timer for each turn; before the time runs out, the player has to input a combination of four moves for the hero (including punches, kicks, etc.). <br><br>There is also a &quot;dating sim&quot; element in the game. &quot;Important&quot; girls can be seen on a special screen called &quot;GPS&quot; (&quot;Gal Positioning System&quot;). If they are in trouble, they will have sweat on their faces. It is up to the player to decide whether to rescue the girl or not. Sometimes it is possible to become friendly with the girl through other means, such as participating in a club she likes. Walking the girl home increases her affection. By the end of the game, the hero will end up with the girl who likes him most and whom he has spent the most time with. The game has a schedule, keeping track of events such as holidays, girls' birthdays, etc., though the actual game is not real-time - a day ends when the player decides to have the hero go home, or as a conclusion of a story-related event.",
  "publishedBy": "Tokuma Shoten Publishing Co., Ltd.",
  "developedBy": "HuneX Co., Ltd.",
  "released": "Mar 26, 1998",
  "alsoFor": "PC-FX | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/fire-woman-matoi-gumi",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Tokuma Shoten Publishing Co., Ltd.",
          "developer": "HuneX Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 26, 1998",
          "ean13": "4 515646 840249",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}