{
  "name": "Formula 1 98",
  "shortName": "formula-1-98",
  "description": "All 22 drivers and 16 tracks from the 1998 Formula One season are included in this racing game. It has an Arcade mode &amp; a realistic Grand Prix mode, with car setups and trickier handling. Split-screen and four-player link options are offered. There is a new in-car view and more overall camera views than before. A rear-view mirror is available as a separate view, triggered by holding a d-pad button. This version adds the ability to tour the track, with TV analyst and former driver Martin Brundle directing you. Brundle and TV legend Murray Walker commentate on the races.<br><br>The race modes offered by the game are:<ul>\n<li>Arcade Race: This is the 'pick-up-and-play' version of the game. Here the player can compete against other cars and against the clock, winning time extensions for good lap times and passing checkpoints. Racing in this mode allows the player to set a race length, difficulty, and toggle braking assist, steering assist, and car damage.\n</li><li>\nArcade Time Trial: Essentially the same as the Arcade Race but with no choice of car or circuit and no race configuration options.\n</li><li>\nArcade Challenge: This is a single player game. The player's team and driver are automatically selected and the challenge is to finish in a specified position or higher. As the player progresses through the challenges the finishing position becomes harder, the opponents become more skillful, and the car becomes more like an F1 car.\n</li><li>\nQuick Race: A simple no frills version for one or two players. Here there is no choice of car and no car setup options. The Quick Race is a separate option on the main menu to all other race types.\n</li><li>\nThe Grand Prix: This race mode allows the player to make many adjustments to their car, tuning the suspension, brakes and more. There are both Practice and Qualifying sessions with which to refine the car's setup. The player can choose from three levels of difficulty, a choice of weather conditions, player aids can be toggled on and off as well as other features such as mechanical failure, tyre wear, fuel depletion, and whether race flags are to be obeyed.<br>Pit stops are needed to repair tyres and to refuel, in Practice and Qualifying the car setup can be adjusted - this option is not available in the main race.\n</li><li>\nChampionship: this is a full season of Grand Prix races</li></ul>\nThe sixteen circuits that were used in the 1998 season are Albert Park in Melbourne, Australia; Jose Carlos Race Circuit in Sao Paulo, Brazil; Autodromo Alfredo Galves circuit in Beunos Aires, Argentina; the Enzo E Dino Ferrari circuit of Imola, San Marino; The Spanish Catalunya circuit of Barcelona; the Monaco Street Circuit, Montreal's Gilles Villeneuve circuit in Canada; France's Circuit de Nevers Magy-Cours; Britain's Silverstone; the A-1 Ring of Austria; Germany's Hockenheimring; the Mogyorod-Hungaroring of Hungrary; Belgium's Francorchamps circuit; Italy's Autodromo Nazionale Monza; the famous Nurgergring of Luxembourg; and finally the only non-European circuit the Suzuka International Racing Course of Japan.<br><br>The teams represented were Benneton, Williams, McLaren, Jordan, Prost, RedBull International, Arrows, Stewart, Tyrell, Ferrari and Minardi. Each team had two drivers.",
  "publishedBy": "Psygnosis Limited",
  "developedBy": "Visual Sciences Ltd.",
  "released": "Dec 09, 1998",
  "alsoFor": "",
  "genre": "Racing / driving",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/formula-1-98",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Psygnosis Limited",
          "developer": "Visual Sciences Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1998",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/792160-formula-1-98-playstation-screenshot-the-game-s-title-screen.jpg",
      "caption": "The game's title screenAfter this there's an animated introduction which runs for a while then this screen reappears with a progress bar as the game itself loads"
    },
    {
      "link": "/images/shots/l/792161-formula-1-98-playstation-screenshot-a-split-screen-action.jpg",
      "caption": "A split screen action shot from the game's introduction sequence.This does not happen in-game"
    },
    {
      "link": "/images/shots/l/792162-formula-1-98-playstation-screenshot-the-main-menu-br-all-menus.jpg",
      "caption": "The main menuAll menus are like this, they only show three or four options though more is usually available, the player must use the up/down, left/right controls to scroll through them"
    },
    {
      "link": "/images/shots/l/792163-formula-1-98-playstation-screenshot-this-is-one-of-the-game.jpg",
      "caption": "This is one of the game's load screensThe player has selected an Arcade Time Trial on the Australian circuit"
    },
    {
      "link": "/images/shots/l/792164-formula-1-98-playstation-screenshot-on-the-starting-grid-at.jpg",
      "caption": "On the starting grid at Adams Park, Melbourne in a McClaren"
    },
    {
      "link": "/images/shots/l/792165-formula-1-98-playstation-screenshot-the-game-supports-multiple.jpg",
      "caption": "The game supports multiple controller configurations but does not allow the player to customise them"
    },
    {
      "link": "/images/shots/l/792166-formula-1-98-playstation-screenshot-an-arcade-race-at-melbourne.jpg",
      "caption": "An Arcade Race at MelbourneGood performance earns the player time bonuses"
    },
    {
      "link": "/images/shots/l/792167-formula-1-98-playstation-screenshot-the-player-has-access.jpg",
      "caption": "The player has access to many configuration options prior to a race but, as with all menus in this game, most are hidden from view"
    },
    {
      "link": "/images/shots/l/792168-formula-1-98-playstation-screenshot-this-is-the-screen-where.jpg",
      "caption": "This is the screen where the player selects the driver and car. The left.right keys scroll through the list and the displayed car rotates slowly"
    },
    {
      "link": "/images/shots/l/792169-formula-1-98-playstation-screenshot-just-starting-a-race-on.jpg",
      "caption": "Just starting a race on the Monza circuit driving a Benneton"
    },
    {
      "link": "/images/shots/l/792170-formula-1-98-playstation-screenshot-performing-a-time-trial.jpg",
      "caption": "Performing a time trial at SilverstoneThe green figures in the top/ centre of the screen show that the player has shaved 5 seconds of their previous best time"
    },
    {
      "link": "/images/shots/l/792171-formula-1-98-playstation-screenshot-starting-a-grand-prix.jpg",
      "caption": "Starting a Grand Prix practice session in Monte Carlo in the rain"
    },
    {
      "link": "/images/shots/l/792172-formula-1-98-playstation-screenshot-down-by-the-harbour-in.jpg",
      "caption": "Down by the harbour in Monte CarloThe car has only three wheels showing that F1 cars are not as robust as Arcade cars"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/31237-formula-1-98-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/31238-formula-1-98-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/94111-formula-1-98-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/521006-formula-1-98-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Australia",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/521003-formula-1-98-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Australia",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/521002-formula-1-98-playstation-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "Jewel Case",
      "country": "Australia",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/521004-formula-1-98-playstation-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "Jewel Case",
      "country": "Australia",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/521001-formula-1-98-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Australia",
      "platforms": "PlayStation"
    }
  ]
}