{
  "name": "Front Mission 1st",
  "shortName": "front-mission-1st",
  "description": "Front Mission is a strategy RPG set in a futuristic world. This is a remake of <a href=\"https://www.mobygames.com/game/snes/front-mission\">Front Mission</a>. Various organizations are trying to gain power through military assaults, piloting huge robots which are the main means of combat in those days. A war between the USN (United States of the New Continent and the OCU (Oceana Community Union) begins because of the so-called Larcus Incident. Huffman Island, a location with important weapon factories, is infiltrated by USN people under the leadership of commander Driscoll. Driscoll causes an explosion that blows the factory off, and puts the blame on the OCU soldier, Roid. A year later, Roid makes a living with his robot in the arena when he is approached by a mysterious man from the OCU. Embarking across Huffman Island, now controlled by the OCU, Roid receives a mission to investigate the USN forces recently sighted.<br><br>In Front Mission, you progress in the story through large strategic battles and cutscenes between them, although at certain places you can also visit locations and talk to people. In combat, you fight inside the robots, and have a large variety of weapons and attack styles at your disposal. You get experience for defeating enemies and also for using various techniques - the more you use an attack, the more powerful it becomes. You can also learn and upgrade various skills. <br><br>The game features better sound and music, updated backgrounds and graphics, and an entire new scenario that allows you to play as on the side of the U.S.N.",
  "publishedBy": "Square Enix Co., Ltd.",
  "developedBy": "Square Enix Co., Ltd.",
  "released": "Oct 23, 2003",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/front-mission-1st",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Square Enix Co., Ltd.",
          "developer": "Square Enix Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Oct 23, 2003",
          "ean13": "4 988601 003841",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/124336-front-mission-1st-playstation-screenshot-squareenix-logo.jpg",
      "caption": "SquareEnix Logo"
    },
    {
      "link": "/images/shots/l/124337-front-mission-1st-playstation-screenshot-front-mission-1st.jpg",
      "caption": "Front Mission 1st Title Screen"
    },
    {
      "link": "/images/shots/l/124338-front-mission-1st-playstation-screenshot-choose-your-scenario.jpg",
      "caption": "Choose your scenario.  The OCU story is the one that was included in the SNES release"
    },
    {
      "link": "/images/shots/l/124339-front-mission-1st-playstation-screenshot-now-you-get-to-see.jpg",
      "caption": "Now you get to see another side to the story as you get to play the USN."
    },
    {
      "link": "/images/shots/l/124340-front-mission-1st-playstation-screenshot-only-slightly-better.jpg",
      "caption": "Only slightly better graphical enhancements are made.  If you compare to the SNES version you can see that the background is different."
    },
    {
      "link": "/images/shots/l/124341-front-mission-1st-playstation-screenshot-on-the-receiving.jpg",
      "caption": "On the receiving end of a machine gun"
    },
    {
      "link": "/images/shots/l/124342-front-mission-1st-playstation-screenshot-in-between-missions.jpg",
      "caption": "In between missions you can talk to various people for more information on what is going on."
    },
    {
      "link": "/images/shots/l/124343-front-mission-1st-playstation-screenshot-here-you-can-upgrade.jpg",
      "caption": "Here you can upgrade your mech with different weapons.  You can also alter other mech systems such as computers and legs."
    },
    {
      "link": "/images/shots/l/124344-front-mission-1st-playstation-screenshot-before-missions-you.jpg",
      "caption": "Before missions you normally get dialogue that progresses the story such as this."
    },
    {
      "link": "/images/shots/l/124345-front-mission-1st-playstation-screenshot-here-is-shot-of-some.jpg",
      "caption": "Here is shot of some different terrain.  Unfortunately the water is static and does not move."
    }
  ],
  "cover": []
}