{
  "name": "GaiaSeed",
  "shortName": "gaiaseed",
  "description": "<h3>PlayStation Store Description (from <a href=\"https://www.mobygames.com/game/gaiaseed/adblurbs\">Ad Blurbs</a>)</h3><b>Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!</b><br><br> \nDownload this PS one® Classic today! <br><br>\nGaiaSeed is a horizontally scrolling shooter from Techno Soleil. The game has solid control, precise bullet collision, and a simple powerup system. With six stages, it’s not the longest game on the block, but the massively scaling 2D backgrounds and variable difficulty make up for that. <br><br>\nBut the real beauty of GaiaSeed lies in its subtlety. The technique and effects used will give shooter aficionados a work of art to go back to for multiple exposure. The soundtrack stands out for its techno/ambiance mood and is adds to the subliminal nature of the work. The effects and twists in the game will have you on your edge. Thoughtfully presented and wonderfully executed, GaiaSeed is a PS one® game console gem. The game is very rare and can be found on online auction sites in the $150 range.<br><br>\nPlease Note: This game is a direct import from Japan. Although text is limited, it is in the its original Japanese language. Help with playing can be found at www.monkeypawgames.com.<br><br>\nTransferring to a PSP® system from your PS3™ system:<br><br>\n<b>You must be signed into the PlayStation®Network account that originally purchased the game.</b> You must have at least 64 MB free on your Memory Stick Duo™. Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the ? button and select Copy. <br> <br> \nPC Store Customers:<br>\nLog into your PlayStation®Network account that you originally used to purchased the game. Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.<br><br>\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly. This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\n<br><br>\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions. If you do not wish to accept all these terms, do not purchase this item. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.<br><br>\nGaiaSeed © TECHNO SOLEIL 1996 © Hamster Co. 2009<br><br>\n&quot;PlayStation&quot;, &quot;PS&quot; Family logo, and &quot;PSP&quot; are registered trademarks of Sony Computer Entertainment Inc.",
  "publishedBy": "Techno Soleil Corporation",
  "developedBy": "Techno Soleil Corporation",
  "released": "Dec 13, 1996",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/gaiaseed",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Techno Soleil Corporation",
          "developer": "Techno Soleil Corporation",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 13, 1996",
          "ean13": "4 518770 000008",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}