{
  "name": "Ganbare Goemon: Uch? Kaizoku Akogingu",
  "shortName": "ganbare-goemon-uch-kaizoku-akogingu",
  "description": "First 32-bit title in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Ganbare+Goemon\">Ganbare Goemon</a> series of platform/adventure games in which you take control of the heroic Goemon and his gang of buddies as he attempts to save feudal Japan and the world from evil. After the events of the previous game, Goemon and the gang return to Japan to defend it from an invasion from outer space with the help of a stranded alien that holds the key to save the world.<br><br>As in the other side-scrolling/adventure titles in the series, the game alternates between a top-down world map view in which your characters explore the game world and side-scrolling stages in which you have to use each character's individual skills to complete an objective to advance the game's plot. You can buy items in the world map and an experience-system has been added which increases each character's abilities as a reward. Between stages and in special locations you can also play several mini-games as customary for the series, which include controlling Goemon Impact, Goemon's giant mecha, and other unique challenges.<br><br>Two new characters join the gang with unique abilities and powers and for the first time you get to control the entire party when playing in the world map sections. The game also features fully animated cutscenes and CD music.",
  "publishedBy": "Konami Co., Ltd.",
  "developedBy": "Konami Co., Ltd.",
  "released": "Mar 22, 1996",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Action",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/ganbare-goemon-uch-kaizoku-akogingu",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami Co., Ltd.",
          "developer": "Konami Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 22, 1996",
          "ean13": "4 988602 008135",
          "comments": "PlayStation the Best for Family release"
        },
        {
          "publisher": "Konami Corporation",
          "developer": "Konami Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 20, 2003",
          "ean13": "4 988602 087109",
          "comments": "PS one Books release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}