{
  "name": "Ganbare Goemon: Kuru Nara Koi! Ayashi Geikka no Kuroi Kage",
  "shortName": "ganbare-goemon-kuru-nara-koi-ayashi-geikka-no-kuroi-kage",
  "description": "Goemon returns to the Playstation in this 3D platformer that tries to shake things up in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Ganbare+Goemon\">Ganbare Goemon</a> series of platform/adventure games. Once again you take the role of the heroic Goemon and his gang of buddies as he sets out to save feudal Japan from the machinations of the Ayashi clan who attempt to take out Goemon as their first step in order to control all of Edo. <br><br>The game is played from a semi-isometric, fixed 3rd person perspective, within a fully polygonal engine. Levels are divided between platforming stages and neutral zones in which you can talk to NPCs, buy items. etc. etc. As in other Ganbare Goemon games you have to use each character's individual skills to complete specific objectives in order to advance the game's plot, and each character now also get their &quot;impact&quot; giant mecha, which they must use in specific sequences. Combat has been revamped to include a fighting game-like combo system and as par for the series,  numerous mini-games are sprinkled in the game between stages and in special locations.",
  "publishedBy": "Konami Co., Ltd.",
  "developedBy": "Konami Computer Entertainment Nagoya Co., Ltd.",
  "released": "Dec 23, 1998",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/ganbare-goemon-kuru-nara-koi-ayashi-geikka-no-kuroi-kage",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami Co., Ltd.",
          "developer": "Konami Computer Entertainment Nagoya Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 23, 1998",
          "ean13": "4 988602 413748",
          "comments": "Konami the Best release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}