{
  "name": "Ganbare Goemon: ?edo Daikaiten",
  "shortName": "ganbare-goemon-edo-daikaiten",
  "description": "The Ganbare Goemon series returns to its 2D classic adventure / platformer roots with this entry, which brings back the classic gameplay of the series. Once again you take control of wily Goemon and his friends as he attempts to save feudal Japan from the evil King of Recycling, who is taking extreme measures to save the planet.<br><br>As in the classic games of the series, the game alternates between a top-down over-world that serves as a stage select and the side-scrolling stages proper in which you have to use each character's individual skills to complete specific objectives while defeating baddies and jumping through the obstacles thrown your way. Polygonal elements have been added to the backgrounds for a more next-gen feeling and the ability to switch characters while playing a stage means sometimes you must combine abilities in order to clear a level instead of just relying on your favorite character. Whenever facing a boss fight the game challenges you to a specific mini-game as traditional for the series, with the result determining the outcome of the fight and also providing bonus items and additional unlockable mini games.",
  "publishedBy": "Konami Computer Entertainment Tokyo, Inc.",
  "developedBy": "Now Production Co., Ltd.",
  "released": "Mar 29, 2001",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/ganbare-goemon-edo-daikaiten",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami Computer Entertainment Tokyo, Inc.",
          "developer": "Now Production Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 29, 2001",
          "ean13": "4 542084 000188",
          "comments": "Konami the Best release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}