{
  "name": "Germs: Nerawareta Machi",
  "shortName": "germs-nerawareta-machi",
  "description": "<i>Germs: Nerawareta Machi</i> is a first person open-world exploration action-adventure game.<br><br>The game takes place in a town built around a coal mine. The player is an unnamed news reporter who comes back to the town after 20 years of leaving for work at a branch newspaper office after the city's decline. After some mysterious lights are seen falling on the nearby mountain and townsmen start acting mysteriously, the player starts to investigate the situation.<br><br>The game progresses six times faster than real time and the city changes around the player regardless. The player must find out what is changing the townsmen. Although the game is exploration based, the player must defend themselves against the invading forces, and can freely enter gun stores and places like hotels or restaurants to restore lost health and stamina.<br><br>The town the game takes place in is entirely handcrafted, featuring restaurants, warehouses, hotels, hospitals and other public services. The player can use their car or public trains to cover distances. Although the game is set in an open world, it features multiple pre-written NPCs that are integral to the storyline.",
  "publishedBy": "KAJ Corporation",
  "developedBy": "KAJ Corporation",
  "released": "Jul 22, 1999",
  "alsoFor": "",
  "genre": "Action, Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/germs-nerawareta-machi",
  "visual": "",
  "gamePlay": "Sandbox / open world",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "KAJ Corporation",
          "developer": "KAJ Corporation",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 22, 1999",
          "ean13": "4 525496 990018",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}