{
  "name": "Goemon: Shin Sedai Sh?mei!",
  "shortName": "goemon-shin-sedai-shmei",
  "description": "Yet another entry in the <a href=\"https://www.mobygames.com/game/legend-of-the-mystical-ninja\">Ganbare Goemon</a> action/platformer series, you once again step in the shoes of the wily adventurer Goemon and his gang of buddies as they fight evil wherever it rears its ugly head. However for this entry, the developers decided to shake things up a bit and gave Goemon and co. a complete makeover. The game takes place in a futuristic Japan, with the main character being a younger and less wacky Goemon who along with his elite squad of crime-fighters (based on the classic members of Goemon's posse) goes off in several missions in order to save the city from various evil-doers.<br><br>The gameplay is similar to other 2D side-scrollers in the series, with you controlling each character as they jump around the obstacles in each level and defeat the baddies within using unique weapons and abilities to each character. The non-linear &quot;world map&quot; sections have been removed and all of the power-up buying and upgrading now takes place in the platformer stages themselves. <br><br>While the gameplay is completely 2D, the game engine mixes polygonal elements and sprites to render specific bosses and background elements as well as bring to life the Goemon Impact sequences (in which you have to take control of Goemon's giant mecha in shooter sequences). The game also includes pre-rendered cutscenes and a cel-animated intro sequence.",
  "publishedBy": "Konami Corporation",
  "developedBy": "Now Production Co., Ltd.",
  "released": "Dec 20, 2001",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/goemon-shin-sedai-shmei",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami Corporation",
          "developer": "Now Production Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 20, 2001",
          "ean13": "4 542084 000348",
          "comments": ""
        },
        {
          "publisher": "Konami Computer Entertainment Tokyo, Inc.",
          "developer": "Now Production Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 12, 2002",
          "ean13": "4 542084 000690",
          "comments": "PS one Books release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}