{
  "name": "Gok? Densetsu: Magic Beast Warriors",
  "shortName": "gok-densetsu-magic-beast-warriors",
  "description": "Magic Beast Warriors (????) is a 1v1 fighting game based on the traditional Chinese legend Journey to the West. The game offers a two player VS mode allowing to select between nine fighters representing the main characters of the legend, along with a story mode where the player starts as the monkey king Sun Wuhong (better known as Son Goku) armed with his iconic extensible sfaff and gradually unlocks the other fighters as they are defeated in turn throughout a heavily stylized version of the traditional story. Once a battle is lost against the computer, the character the player was using becomes unavailable, and upon continuing he or she has to choose between one of the ones available up to that point.<br><br>Gameplay features are reminiscent of Street Fighter, with similar movesets and impact feedback, while the presentation sees prerendered 3D sprites on static 2D backgrounds. The game includes about 30 minutes of full-motion video cutscenes featuring real actors in costumes varying from Chinese armor to rubber monster suits. These play in between battles as introduction for each new fighter. The whole production reminds of Japanese &quot;sentai&quot; TV serials, with exaggerated poses, extravagant martial arts flourishes and grotesque creature designs.",
  "publishedBy": "Allumer, Ltd.",
  "developedBy": "Allumer, Ltd.",
  "released": "May 26, 1995",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/gok-densetsu-magic-beast-warriors",
  "visual": "",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Allumer, Ltd.",
          "developer": "Allumer, Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 26, 1995",
          "ean13": "4 996781 174077",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}