{
  "name": "Gunbird",
  "shortName": "gunbird",
  "description": "Gunbird is a vertically scrolling shoot 'em up developed by Psikyo. It hit the Japanese arcade in 1994 and was followed by a Japanese release to the Saturn and the Playstation in the following year.<br><br>The game is set in a fantasy setting with steampunk elements. Lush forests and medieval castles meet steam trains and mech robots. Instead of piloting the genre-traditional space ships, Gunbird lets the player chose between five different characters (Ash, Marion, Valnus, Yuan Nang and Tetsu) who traverse the game world on broomstick, jet packs and pedal-powered helicopters on a quest to find the pieces of a magic mirror across seven stages. <br><br>Unorthodox vehicles aside, the gameplay follows traditional genre standards. The main goal is to dodge all bullets that fill the screen while collecting power-ups to make the character stronger. Gunbird features one power-up that incrementally increases the firepower of the standard weapon (P-items) as well as additional ammo for the screen-clearing special ability (B-items). Standard weapon and special ability differ from character to character. Where some characters excel in high firepower in a straight line others allow for a wider spread of bullets or additional homing missiles.",
  "publishedBy": "XS Games, LLC",
  "developedBy": "Psikyo",
  "released": "2003",
  "alsoFor": "Arcade, Nintendo Switch, PlayStation 3, PSP, PS Vita, SEGA Saturn, Windows | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/gunbird",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Atlus Co., Ltd.",
          "developer": "Psikyo",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 15, 1995",
          "ean13": "4 984995 110028",
          "comments": ""
        },
        {
          "publisher": "XS Games, LLC",
          "developer": "Psikyo",
          "ported": "",
          "country": " United States",
          "releaseDate": "2003",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}