{
  "name": "Hanafuda Graffiti Koikoi Monogatari",
  "shortName": "hanafuda-graffiti-koikoi-monogatari",
  "description": "<h3>PlayStation Store Description (from <a href=\"https://www.mobygames.com/game/hanafuda-graffiti-koikoi-monogatari/adblurbs\">Ad Blurbs</a>)</h3>Hanafuda Graffiti Koikoi Monogatari is a hanafuda game (a type of Japanese playing cards) that features a story mode and a free versus mode. In story mode, the game starts with the main character taking on different challenges in order to become the successor of a prestigious school of hanafuda. Player can enjoy lots of typical gameplay features for adventure game, such as moving around in the town, searching the room for special items and triggering off love story events. In free versus mode, two hanafuda games, Koi-Koi and Hana Awase, are playable. Game instruction can be displayed anytime during gameplay so even beginners can easily enjoy the fun of hanafuda. To fuel up the game further, characters with plenty of personalities and unique reactions will be appearing in the game. Seasoned players can also maximize their hanafuda experience by customizing their game with detailed settings.<br><br><b>This content is compatible with PlayStation®3 and PSP® (PlayStation®Portable).</b><br>??<br><br><b>Content file size?</b><br>21MB<br><br><b>Copyright?</b><br>©1996 I'MAX ©2002 HAMSTER Co.<br><br>Please note that there may be some functions that cannot be used due to the difference of hardware, <br> and that the software may not operate in the same manner when it is played with PS3™ or PSP®.<br>One time fee for use or downloads on up to 2 console systems and 2 portable systems that are compatible with the content and associated with the purchasing account. <br><br>Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement.",
  "publishedBy": "I'Max Corp.",
  "developedBy": "I'Max Corp.",
  "released": "May 10, 1996",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/hanafuda-graffiti-koikoi-monogatari",
  "visual": "",
  "gamePlay": "Board game, Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "I'Max Corp.",
          "developer": "I'Max Corp.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 10, 1996",
          "ean13": "4 988762 080200",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}