{
  "name": "Hard Boiled",
  "shortName": "hard-boiled",
  "description": "<i>Hard Boiled</i> is a mix of futuristic hovercar action with a traditional, albeit 3D, shoot em up genre. It looks somewhat similar in concept to <a href=\"https://www.mobygames.com/search/quick?game=new+york+race\">New York Race</a> based on The Fifth Element movie. The car is always on the move, and while you can speed up or slow down - you can't stop it and also you can't go back, only maneuver across the screen - just like in a typical shmup title. Your vehicle is armed with some basic projectile type guns and you could pick up other types of weapons floating around the levels.<br><br>The game story is based on the same name comic book by Frank Miller and Geof Darrow that was published in the early 90s. Here you play as Nixon who thinks he's a regular tax collector in dystopian retro-futuristic Los Angeles, but actually a cyborg-assassin for one of the big corporations that gets his memory reformatted once in a while. The gameplay is centered around riding your hovercar and shooting your way through the various city locales destroying all sorts of vehicles, turrets, barriers and occasional boss in the process. There are five missions in total with their own sets of enemy units and level design.\n",
  "publishedBy": "Cryo Interactive Entertainment",
  "developedBy": "Cryo Interactive Entertainment",
  "released": "Oct 15, 1997",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/hard-boiled",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Cryo Interactive Entertainment",
          "developer": "Cryo Interactive Entertainment",
          "ported": "",
          "country": " France",
          "releaseDate": "Oct 15, 1997",
          "ean13": "3 554540 350035",
          "comments": ""
        },
        {
          "publisher": "Sieg",
          "developer": "Cryo Interactive Entertainment",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 30, 1998",
          "ean13": "4 533798 000014",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}