{
  "name": "Interplay Sports Baseball 2000",
  "shortName": "interplay-sports-baseball-2000",
  "description": "A baseball game featuring an Exhibition, Season, Playoff, Tournament, and a Home Run Derby mode. There is also a General Manager mode that lets the player create and trade players, and change team lineups. The game features the real MLB players and teams of that time.<br><br>In the Playstation version, batting and pitching are both done from a behind the batter's viewpoint, while in the Windows version, the camera is more dynamic and is able to switch to both viewpoints. The Windows version is able to do this because of the Messiah technology being used, which allows for high-res Direct3D accelerated polygonal graphics.<br><br>When batting the player can choose to either swing for contact or for power. The player can also choose a difficulty level for their batting. Rookie has the player timing their swing with the pitch, Pro adds the challenge of controlling the level of the swing, while selecting All-Star is basically the same as Pro, except the pitches come in at a faster rate of speed.<br><br>When pitching, players can select different pitch types to throw depending on the ability of their pitcher. Players also can view a pitch chart that tracks every pitch thrown to each batter in the game. <br><br>The game also features a play-by-play announcer and is able to keep track of the single season stats. <br><br>This game is an update of <a href=\"https://www.mobygames.com/game/vr-baseball-2000\">VR Baseball 2000</a>.\n",
  "publishedBy": "Interplay Productions, Inc.",
  "developedBy": "Interplay Productions, Inc.",
  "released": "1999",
  "alsoFor": "Windows | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Baseball",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/interplay-sports-baseball-2000",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Interplay Productions, Inc.",
          "developer": "Interplay Productions, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1999",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}