{
  "name": "International Cricket Captain 2002",
  "shortName": "international-cricket-captain-2002",
  "description": "<i>International Cricket Captain 2002</i> is one of a series of cricketing games from Empire Interactive. In the single-player mode the player can:<ul>\n<li>play the full game by leading any of the English county teams;</li>\n<li>take control of an English county team, manage them and earn the right to captain the national team;</li>\n<li>play as a national team manager, the countries available are Australia, England, India, New Zealand, Pakistan, South Africa, Sri Lanka, West Indies and Zimbabwe.</li></ul>In the two-player mode each player selects a different international team, matches are either fifty overs of five day tests and the players compete in either a one, three or five match series. The batting side uses the keyboard to control their team<br><br>There are also some classic matches, or Scenarios as they are called in-game, where the player can relive or try to change an historic match. These matches are 1948 England v Australia, 1971 England v India, 1986 Australia v England, 1991 England v West Indies, 2002 Australia v England, and the 2003 World Cup. In these matches the player can control either side, set the difficulty level, and change the team, coaching skills etc before playing the match.<br><br>When bowling the player can adjust the way the ball is delivered, the degree of aggression and length of the delivery, which side of the wicket the bowler bowls from, and which stump the bowler aims for. When batting the player can adjust the degree of aggression the batsman uses. During an innings the player can optionally view animations of the action and here there are settings that allow the player to view every delivery or just specific events.",
  "publishedBy": "Empire Interactive Europe Ltd.",
  "developedBy": "Empire Interactive, Inc.",
  "released": "2002",
  "alsoFor": "Windows | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Cricket",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/international-cricket-captain-2002",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Empire Interactive Europe Ltd.",
          "developer": "Empire Interactive, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}