{
  "name": "International Cricket Captain 2000",
  "shortName": "international-cricket-captain-2000",
  "description": "<h3>Back of Box - Windows (UK) (from <a href=\"https://www.mobygames.com/game/international-cricket-captain-2000/adblurbs\">Ad Blurbs</a>)</h3><b>&quot;ONLY GUYS WHO REALLY LOVE CRICKET COULD HAVE PRODUCED A GAME LIKE THIS.</b><br>\nAs a Captain myself, I can say that the decision-making in the game is almost as tough as when you're out there on the pitch. If I'd been asked to write down all the things I would like to see in a cricket game, I'd have to say I couldn't have managed any better&quot;<br>\n<i>Nasser Hussain</i><br><br><b>THE GAME</b><br>\nCaptain England or any country from the Test playing nations.<br>\nCaptain any side in the new, two division county championship. Play in all domestic tournaments including the National League and the Super Cup.<br>\nHistorical scenarios featuring great players from the past.<br>\nReplay the '99 World Cup.<br>\nPick your team, choose your bowlers, make declarations.<br>\nPrepare the pitch, sign new players and decide the match tactics.<br>\nBowl around or over the wicket. Decide length and line. Set-the-field. The decisions are yours.<br><br><b>THE FEATURES</b>\n<ul><li>Huge statistical database of almost every player in First Class cricket,  courtesy of the 2000 Wisden Cricket Almanack.</li>\n<li>On-Line league where you can match your skills against other players</li>\n<li>Multiple ways to watch all the action including ball-by-ball or over-by-over.</li>\n<li>Extensive photo gallery of Country Championship and international players, plus photographs of most county and international grounds.</li>\n<li>Commentary by the BBC's Jonanthan Agnew.</li>\n<li>The only PC cricket game to be published in association with Wisden and endorsed by Nasser Hussain.</li>\n</ul>",
  "publishedBy": "Empire Interactive Europe Ltd.",
  "developedBy": "Empire Interactive, Inc.",
  "released": "2000",
  "alsoFor": "Windows | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Cricket",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/international-cricket-captain-2000",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Empire Interactive Europe Ltd.",
          "developer": "Empire Interactive, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2000",
          "ean13": "5 017783 402346",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}