{
  "name": "Jeopardy! 2nd Edition",
  "shortName": "jeopardy-2nd-edition",
  "description": "The next edition of this version of <a href=\"https://www.mobygames.com/game/playstation/jeopardy\">Jeopardy!</a>. <br><br>The Game modes include a Normal game, a Solo game, a Tournament of Champions, and a Contestant Exam.<br><br>In the normal game, 3 contestants compete against each other in a game show, trying to supply the question for answers in several different categories. Each correct answer the player gives earns them money, while giving an incorrect answer will cost them money. The player with the most money at the end of the game is deemed the winner. The solo game is the same as the normal game, except that it's just the player competing against no other contestants.<br><br>The Tournament of Champions is for players who've won five games or accumulated more than $75,000. In this mode, the answers and questions are more difficult.<br><br>The Contestant Exam gives the player a sample of the exams a contestant who wants to be on the real show has to take.<br><br>The game keeps track of the player's career statistics. Tracked stats include the number of games won and lost, the total winnings, the best and worst score, the player's best jeopardy, double jeopardy, &amp; final jeopardy amount, the number of tournament wins, and the number of right &amp; wrong answers.<br><br>The game also offers some behind the scenes videos for the player to view.<br><br>Options include setting the amount time to buzz-in, the amount of time to respond, setting the spelling accuracy to be either more strict or loose, and setting the computer opponent's IQ to either easy, medium, or hard.",
  "publishedBy": "Hasbro Interactive, Inc.",
  "developedBy": "Artech Digital Entertainment, Ltd.",
  "released": "2000",
  "alsoFor": "Macintosh, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/jeopardy-2nd-edition",
  "visual": "",
  "gamePlay": "Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Hasbro Interactive, Inc.",
          "developer": "Artech Digital Entertainment, Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}