{
  "name": "Jikky? Oshaberi Parodius",
  "shortName": "jikky-oshaberi-parodius",
  "description": "<i>Jikky? Oshaberi Parodius</i> is the third in the <i>Parodius</i> series. It retains the same gameplay and humorous elements that substantiated the first two games. Gameplay itself is a parody of Konami's famous <a href=\"https://www.mobygames.com/search/quick?gamegroup=Gradius\">Gradius</a> series; the screen scrolls from left to right (most times) and the player manoeuvres a flying character around the screen destroying waves of enemies and avoiding obstacles. Unlike previous <i>Parodius</i> titles, this game contains a difficulty adjustment option, allowing the player to make things easier or harder. Also unique to this installment are bits of digital voice acting. Survival throughout the level leads the player to a boss fight, which frequently includes some of the strangest characters in the game. <br><br>Power-ups include, besides the standard version (red, used to upgrade weapons), the shield power-up (blue) and a variety of different coloured bells. Green Bells will make the protagonist huge on the screen; Yellow Bells are worth points (points in turn are worth extra lives); Blue Bells are &quot;big bombs&quot; that clear the screen of enemies and can be saved until you need them; White Bells will give the player character a megaphone that will shout out phrases that damage enemies; Red Bells stockpiles the hero with three point-defense lasers, only one of which can be activated at a time and disappears after a short while; Purple Bells will clear the screen of all but the strongest enemies, turning them into power-ups.<br><br>This time around there are sixteen different characters to chose from, each with unique power-ups and weapons. These include familiar faces from earlier games as well as new ones: Vic Viper, the &quot;gradius ship&quot; equipped with its traditional <a href=\"https://www.mobygames.com/game/gradius\">Gradius</a> weapons; Pentaro from <a href=\"https://www.mobygames.com/search/quick?game=Penguin+Adventure\">Penguin Adventure</a>, whose Potion weapon may now hit multiple enemies and his normal weapon shots explode against obstacles; Soitsu, a green stickman surfing aboard a paper airplane, whose laser weapon is able to charge up to deliver more power and who drops little stickmen onto the ground which occasionally dance around rather than attacking; Mike, a cute little kitten who happens to to have a very powerful wave weapon which can travel through obstacles and enemies, as well as a multiple bomb ability which requires his &quot;upgrade ability&quot;; Memim, a flying fairy in bikini who carries missile weapons whose direction is determined by her current location on the screen when fired; Tako, the flying octopus wearing a baseball cap; Upa, the flying baby with a Mega Crush ability that destroys all enemies on screen, and others.",
  "publishedBy": "Konami Co., Ltd.",
  "developedBy": "Konami Co., Ltd.",
  "released": "Dec 20, 1996",
  "alsoFor": "SEGA Saturn, SNES | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/jikky-oshaberi-parodius",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami Co., Ltd.",
          "developer": "Konami Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 20, 1996",
          "ean13": "4 988602 025927",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/227720-jikkyo-oshaberi-parodius-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    }
  ]
}