{
  "name": "Kuroi Hitomi no Noah: Cielgris Fantasm",
  "shortName": "kuroi-hitomi-no-noah-cielgris-fantasm",
  "description": "Noah was quietly plying with her friend Disteen, but as they were exploring a cave they accidentally release a demon who had been sleeping for a thousand years. As Disteen tells Noah to escape, he gets turned to stone. The goddess Nil then appears before Noah and tells her that her friend can be saved. And thus, Noah embarks on a quest to undo the demon's curse, but she has to defeat him within three years. As the game progresses, time also passes, and different events occur at different times.<br><br><i>Kuroi Hitomi no Noah: Cielgris Fantasm</i> plays mostly like traditional Japanese-style RPGs such as <a href=\"https://www.mobygames.com/game/breath-of-fire\">Breath of Fire</a>: the protagonist travels on the map and interacts with various people, and in her travels, also encounters monsters that she must fight. The encounters are typical turn-based battles in which the player assigns actions to be performed by the party members. However, Noah has the ability to befriend monsters and can recruit them when they have been weakened. They can then be summoned in battle to fight alongside the party members. At the end of battle, the participating members and monsters gain experience points to increase their level.<br><br>To gain money, rather than earn it from defeated foes, Noah has to fulfill requests that can be taken at the town tavern. These requests have her perform various tasks such as dish-washing, escort missions, deliveries and monster extermination.",
  "publishedBy": "Gust Co., Ltd.",
  "developedBy": "Gust Co., Ltd.",
  "released": "Jul 01, 1999",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/kuroi-hitomi-no-noah-cielgris-fantasm",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Gust Co., Ltd.",
          "developer": "Gust Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 01, 1999",
          "ean13": "4 943015 030098",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}