{
  "name": "Madden NFL 2002",
  "shortName": "madden-nfl-2002____",
  "description": "<i>Madden NFL 2002</i> is another yearly update in the long-running football franchise. With main series developer Tiburon focusing their efforts on the <a href=\"https://www.mobygames.com/game/ps2/madden-nfl-2002\">new generation of consoles</a>, it fell to developer Budcat to update the game for the new year on the veteran platforms PlayStation and Nintendo 64. The 2002 version is closely based on the <a href=\"https://www.mobygames.com/game/playstation/madden-nfl-2001__\">previous year's game</a>, with almost the same menus and many of the same modes and options, but also several new features, including a redesigned kick meter and mulligans, allowing one to take back and replay a limited number of plays per game.<br><br>The included teams have been updated for the 2001 NFL season and include the 31 regular teams plus the 2002 expansion team, the Houston Texans, NFC and AFC all-star teams and two All-Madden teams (2000 and Super Bowl). Exclusive to the PlayStation version are more than 90 classic NFL teams, 31 all-time franchise teams and the 6 NFL Europe teams.<br><br>The returning modes include Exhibition, Season, Franchise, Custom League, Tournament, Situation (Great Games is again only featured on PlayStation), and Two-Minute Drill (with an added Head-to-Head option, facing off two players with one playing offense and the other defense). The Practice mode has been expanded to the Coaches Corner mode: the team practice option is the same as the previous year's practice while the new training mode is a tutorial that guides players through various plays by explaining when to use and how best to perform them. A special mode exclusive to this version of the game is called Madden Classic. It is a fully featured game-within-a-game that goes back to the early days of the series: regarding visuals, options, and menus, it is based on <a href=\"https://www.mobygames.com/game/genesis/john-madden-football-92\">Madden 92 for Genesis</a>, but features the teams and rosters of the current season.<br><br>The Madden Cards feature returns from the previous game. Tokens to buy cards can be won by completing a number of challenges or through the training mode. The card roster has been expanded from the previous year and now includes cheerleader cards that hype up their team when used.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Budcat Creations, LLC",
  "released": "Aug 14, 2001",
  "alsoFor": "Nintendo 64 | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/madden-nfl-2002____",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Budcat Creations, LLC",
          "ported": "",
          "country": " United States",
          "releaseDate": "Aug 14, 2001",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}