{
  "name": "Madden NFL 97",
  "shortName": "madden-nfl-97__",
  "description": "The Madden football series makes its debut on the 32-bit consoles with <i>Madden NFL 97</i>. Like the <a href=\"https://www.mobygames.com/game/dos/madden-nfl-97\">PC version</a>, the game moves into the world of polygonal 3D graphics, but has a unique set of modes, teams and options.<br><br>The game includes the 30 teams of the 1996 NFL season, the 1996 All-Madden team plus 68 classic teams from NFL history. Playing modes include Exhibition, Season and Tournament. All scheduled games during a season can be either played or simulated. The tournament is for either 8 or 16 players in single elimination mode. The game also includes the 30 team's home stadiums plus one extra arena in Hawaii.<br><br>Many features introduced in previous titles are reused here: variable weather (including night games), injuries and substitutions, ten different penalties (all adjustable), two skill levels, a bluffing mode for play calling, color commentary by John Madden, instant replays, and team roster editing with player creation (stats are set from a point pool), trading, releasing and signing of free agents. Player records and season progress can be saved to memory card/backup RAM. A new feature is the possibility to change which team is controlled at any time during a game.<br><br>During a game, the stadiums are rendered in polygonal texture-mapped 3D, with only the players, referees and ball as bitmaps. The game allows to choose from eight different camera perspectives, including views from the end zones and sidelines, a diagonal view and a &quot;classic cam&quot; emulating the perspective of earlier titles in the series on Genesis and SNES.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Tiburon Entertainment",
  "released": "Sep 11, 1996",
  "alsoFor": "SEGA Saturn | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/madden-nfl-97__",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Tiburon Entertainment",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 11, 1996",
          "ean13": "5 030935 010619",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/236705-madden-nfl-97-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/206205-madden-nfl-97-playstation-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/206204-madden-nfl-97-playstation-media.png",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    }
  ]
}