{
  "name": "Mega Man 5",
  "shortName": "mega-man-5",
  "description": "Dr. Cossack, humbled by his defeat and his allowing of Dr. Wily to influence his ways, decides to help Dr. Light by providing him and Rockman with tools and weapons to help foil Dr. Wily for good. All seems calm and peaceful, until...<br><br>A sudden rampage breaks out, and the cause is found to be a group of robots, led by a mysterious figure. As Dr. Light begins to investigate this rampage and attempts to find a way to stop it, he is kidnapped by the leader of the robots. Rockman hurries to save Dr. Light, but is too late...the only thing he can find at the scene is a yellow scarf...one that almost seems to belong to...Blues!?<br><br>Could Rockman's supposed brother, the strange but good-hearted Blues, be the one who kidnapped Dr. Light? Is Blues the one responsible for the rampages? With these questions racing through his mind, Rockman sets off to find Blues and get the answers he wants.<br><br>Like the other early Rockman / Mega Man games, the Playstation version was only released in Japan, as part of the Complete Works series.",
  "publishedBy": "Capcom Co., Ltd.",
  "developedBy": "Capcom Co., Ltd.",
  "released": "Nov 25, 1999",
  "alsoFor": "Android, DoJa, iPad, iPhone, NES, Nintendo 3DS, PlayStation 3, PSP, PS Vita, Wii, Wii U | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/mega-man-5",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Capcom Co., Ltd.",
          "developer": "Capcom Co., Ltd.",
          "ported": "OeRSTED Inc.",
          "country": " Japan",
          "releaseDate": "Nov 25, 1999",
          "ean13": "4 976219 354806",
          "comments": "Part 5 of Rockman Complete Works"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}