{
  "name": "Mega Man 2",
  "shortName": "mega-man-2",
  "description": "After defeating Dr. Light's six robots that were reprogrammed by the villainous Dr. Wily in <a href=\"https://www.mobygames.com/search/quick?quickSearch=013388110070\">Mega Man</a>, it seemed like the world was safe.  But it was not to be.  Dr. Wily has escaped from prison and is madder than ever, this time creating eight new Robot Masters of his own to take over the world and crush Mega Man!  Is the world doomed?<br><br><i>Mega Man 2</i> is the sequel to the NES game <i>Mega Man</i>. In this game, Metal Man, Air Man, Bubble Man, Quick Man, Crash Man, Flash Man, Heat Man and Wood Man are Dr. Wily's eight prize creations that have been sent to take over the world.  As Mega Man defeats these bosses, he can steal their powers and use them for himself.  Each Robot Master is weak against another's weapon, and through experimentation, Mega Man can gain the upper hand by using the weapon they're vulnerable against.<br><br>Other additions to the game include the 'E-Tank' - an item that can be used at any time to completely refill Mega Man's energy, and a Password System, which allows players to continue their game by recording which Robot Masters have been defeated and how many E-Tanks they have.  <i>Mega Man 2</i> also removes the scoring system from the original game.",
  "publishedBy": "Capcom Co., Ltd.",
  "developedBy": "Capcom Co., Ltd.",
  "released": "Sep 02, 1999",
  "alsoFor": "Android, DoJa, iPad, iPhone, NES, Nintendo 3DS, Wii, Wii U | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/mega-man-2",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Capcom Co., Ltd.",
          "developer": "Capcom Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 02, 1999",
          "ean13": "4 976219 354738",
          "comments": "PS one Books"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}