{
  "name": "Mighty Hits",
  "shortName": "mighty-hits",
  "description": "<i>Mighty Hits</i> is a shooting gallery game and the gameplay and stages are very similar to <a href=\"https://www.mobygames.com/game/point-blank\">Point Blank</a> in theme and presentation. The game has a cartoony wild west theme throughout the cut scenes and menu screens.<br><br>One or two players compete in a series of mini games, which last about 20 or 30 seconds each. The rules of the mini games are displayed before each round. In general players have complete objectives and puzzles by shooting at targets. After each round a results screen shows if the objectives were completed or failed. Failing a round and the player loses a life feather, lose all feathers and the game is over.<br><br>There are 3 courses to select from, represented by a blue, green and yellow tin can. There is Easy (6 mini-games), Medium (9 mini-games) and Hard (15 mini-games) and completing hard mode unlocks a black tin can for Very Hard with 18 mini-games. The game is played in sets of 3 stages, the player has to shoot 3 cards to select the stages. The cards are quickly flipping randomly through mini-games. After 3 stages the player draws a bonus card and moves onto the next 3 stages. A bonus card might contain &quot;2 stage select&quot; where 2 of the stage cards will flip more slowly allowing the player to purposefully select a stage.<br><br>There are many mini games, including shooting away parts to complete a doll, a Three Shell type game, shoot ice to free a penguin, shoot colored bells to recreate a melody, throwing balls into cups, shoot the object in the room that has changed, and in general shooting at various targets like fish, bees, lights, eggs, floating lanterns, toppling pictures frames and other targets.",
  "publishedBy": "Altron Corporation",
  "developedBy": "Altron Corporation",
  "released": "Dec 27, 1996",
  "alsoFor": "SEGA Saturn | Combined View",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/mighty-hits",
  "visual": "",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Altron Corporation",
          "developer": "Altron Corporation",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 27, 1996",
          "ean13": "4 994964 116067",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}