{
  "name": "MLB 98",
  "shortName": "mlb-98",
  "description": "One of the earliest in <a href=\"https://www.mobygames.com/search/quick?gamegroup=Sony+MLB+series\">Sony's MLB franchise</a>, MLB 98 features the standard set of many baseball games.  It has all of the 30 MLB teams and many of the major players, rendered in 3D polygon graphics with complete up-to-date (for that time) rosters.  Real stadiums are also included along with the updated rules including the Interleague play rule that was implemented at the time.<br><br>It also has the standard set of modes including <i>Exhibition</i>, <i>Season</i>, <i>Playoffs</i>, <i>Home Run Derby</i>, <i>All-Star Game</i> and <i>World Series</i>.  Players can also create and save their own players and customize them to their liking as well as keep extensive track of stats.  They also have the option to run a franchise at the same time and manage everything including trades and free agency.<br><br>The controls consist of using certain buttons to either run the bases, bat and throw specific pitches depending upon the pitcher and the D-pad to move outfielders.  Also, to throw to bases the player uses the main buttons (Triangle, Square, Circle and X).",
  "publishedBy": "Sony Computer Entertainment America Inc.",
  "developedBy": "Sony Interactive Studios America",
  "released": "1997",
  "alsoFor": "",
  "genre": "Simulation, Sports",
  "perspective": "Behind view, Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Baseball",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/mlb-98",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Sony Computer Entertainment America Inc.",
          "developer": "Sony Interactive Studios America",
          "ported": "",
          "country": " United States, Canada",
          "releaseDate": "1997",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}