{
  "name": "Moorhuhn Kart XXL",
  "shortName": "moorhuhn-kart-xxl",
  "description": "Moorhuhn's first venture into the racing genre. This kart racing game features a number of new characters that are to be introduced as members of the Moorhuhn-Family (known from the Moorhuhn shooters).<br><br>The game features comic-style 3D-graphics, 5 different drivers - each with its own driving style - and 3 different game modes. <br><br>The whole concept reminds one of the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Mario+Kart\">Mario Kart games</a>. The player chooses a character, either Moorhuhn itself or Lesshuhn, Snowman or Pumpkinhead. The game's objective is to win the race, of course, but your opponent will try everything in their power to keep your chosen character from winning by sending you off the racetrack. To achieve this they resort to things like weights, water bombs, chewing gum, boards larded with nails or even rockets. But the player can also find these so called power-ups, small packages that can be found at random order on the racetrack. Unfortunately, you do not know what is in the packages until they are opened which adds a little surprise to the action.<br><br>The kart is controlled using the arrow keys on the keyboard, but one can also use a Windows compatible gamepad.<br><br>The XL version lacks the Duel mode and two courses.",
  "publishedBy": "ak tronic Software &amp; Services GmbH",
  "developedBy": "phenomedia publishing gmbh",
  "released": "Nov 01, 2002",
  "alsoFor": "Windows | Combined View",
  "genre": "Racing / driving",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/moorhuhn-kart-xxl",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "ak tronic Software &amp; Services GmbH",
          "developer": "phenomedia publishing gmbh",
          "ported": "",
          "country": " Austria, Germany, Switzerland",
          "releaseDate": "Nov 01, 2002",
          "ean13": "",
          "comments": "Software Pyramide release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}