{
  "name": "NCAA GameBreaker 98",
  "shortName": "ncaa-gamebreaker-98",
  "description": "A college football game with three different game styles (simulation, total control, and fantasy league) and three different game types (scrimmage, tournament, and bowl season).<br><br>The game contains all 112 Division 1A Teams with their team specific playbooks along with 130 different NCAA stadiums. The game also contains over 40 classic teams to play as.<br><br>There is also a Create Play mode which lets the player draw up their own plays to use on the gridiron. Players can also create a walk on athlete to play as.<br><br>Gameplay is similar to what is found in <a href=\"https://www.mobygames.com/search/quick?game=NFL+GameDay+%e2%80%9898\">NFL GameDay '98</a>, but with more emphasis on college plays and rules. Players select their plays, try to gain yards on a vertical field, and hopefully score by getting into the end zone. On offense, players can use Total Control Passing which enables a player to under or over throw to a receiver.<br><br>Options include adjusting the difficulty level and the length of each quarter, setting the likelihood of penalties being called, setting the speed of the game, what type of weather to play in, and whether to turn on or off the announcer, music, or injuries.",
  "publishedBy": "Sony Computer Entertainment America Inc.",
  "developedBy": "Sony Interactive Studios America",
  "released": "1997",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/ncaa-gamebreaker-98",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Sony Computer Entertainment America Inc.",
          "developer": "Sony Interactive Studios America",
          "ported": "",
          "country": " United States",
          "releaseDate": "1997",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}