{
  "name": "NFL Xtreme 2",
  "shortName": "nfl-xtreme-2",
  "description": "This football game is a followup to <a href=\"https://www.mobygames.com/game/nfl-xtreme\">NFL Xtreme</a>. The game contains both an NFL and NFLPA license and features over 125 taunts made by 23 real NFL players and over 150 different player celebrations. Game modes include an Exhibition, Season, Playoff and Tournament mode. Other features include trades, free-agent acquisitions, a draft, the ability to create a player, three difficulty levels, adjustable weather, adjustable quarter lengths, and three different game speeds.<br><br>The game is similar to <a href=\"https://www.mobygames.com/search/quick?game=NFL+Blitz\">NFL Blitz</a>. It features arcade-style five-on-five football that emphasizes speed of play and hard hits and tackles. Streamlined play calling and the fact that there are no penalties helps to encourage this fast paced type of gameplay.<br><br>The game also has two passing interfaces, an icon-based passing method and a one-button method where the computer makes the pass for the player. <br><br>Some offensive moves players can perform include power shoulder charges, double spins, super jukes, stiff arms, and clothesline tackles.\n",
  "publishedBy": "Sony Computer Entertainment America Inc.",
  "developedBy": "989 Studios",
  "released": "Jul, 1999",
  "alsoFor": "",
  "genre": "Action, Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/nfl-xtreme-2",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Sony Computer Entertainment America Inc.",
          "developer": "989 Studios",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jul, 1999",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}