{
  "name": "NHL 99",
  "shortName": "nhl-99",
  "description": "After the award-winning <a href=\"https://www.mobygames.com/game/nhl-98\">NHL 98</a>, EA worked to improve what was considered to be one of the most complete ice hockey games in the market. Along the usual and almost obligatory NHL roster updates, the International mode first featured in the previous version was expanded, allowing players to choose IIHF rules and rink size.<br><br>Graphically, the arena is more detailed with more rinkside features, and ice reflections, player faces were improved and stand more seamlessly into the model, enhanced motion capture result in better animated hits (with the ability to break the glass with a well-placed body check making a return), shots and saves, and finally an higher polygon count complete the graphic enhancements to the game.<br><br>As graphic changes aren't enough to make a game better, gameplay was also tweaked, with computer players being smarter, both in offense and defense. Shooting was tweaked (slap shots are easier to pull, players no longer skate in circles to do some backhand shots and must be facing the goal to shoot, particularly in one timers) and a new special move brings dekes, spin-o-ramas and the kind of moves Jágr, Fedorov and Selänne pull when one-on-one with the goalie. However, if the player gets too close to the crease, the referee might want to review the play in the new video goal judge, so the player must think twice before trying to pull a &quot;Brett Hull&quot;. For newcomers to the sport, a new Beginner mode allows players to get used to the ice without having to concern with penalties or an overly strong opponent.<br><br>The season mode was also improved, with the players now having streaks that affect either positively or negatively his abilities. Debuting the Nashville Predators, players can either choose to play with their initial roster, or do a fantasy expansion draft.<br><br>Like in the previous year, <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,7161/\">Jim Hughson</a> and <a href=\"https://www.mobygames.com/search/quick?developer=Darryl+Reaugh\">Darryl Reaugh</a> liven up matches with play by play and colour commentary.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Electronic Arts Canada",
  "released": "Sep 21, 1998",
  "alsoFor": "Nintendo 64, Windows | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "Hockey",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/nhl-99",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts Canada",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 21, 1998",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/240698-nhl-99-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/240700-nhl-99-playstation-inside-cover.jpg",
      "scanOf": "Inside Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/240699-nhl-99-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/240701-nhl-99-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    }
  ]
}