{
  "name": "Nobunaga's Ambition",
  "shortName": "nobunagas-ambition",
  "description": "In the 16th century, Japan's Sengoku (&quot;Warring States&quot;) period divided the nation into numerous feudal states, each ruled by a daimyo. These daimyos would often go to war with each other. Many dreamt of conquering the land, becoming the Shogun and ruling the entire country. One of those daimyos was the ambitious Nobunaga Oda, a merciless ruler and a renowned strategist. Players take on the role of Nobunaga Oda or one of many other daimyos to try to conquer Japan. <br><br><i>Nobunaga's Ambition</i> is a turn-based strategy game which can be played in different modes. Gameplay is similar to <a href=\"https://www.mobygames.com/search/quick?company=Koei\">Koei</a>'s better known <a href=\"https://www.mobygames.com/game/romance-of-the-three-kingdoms\">Romance of the Three Kingdoms</a> game. Players begin by selecting either a 17 regions scenario or a larger 50 scenario. Then, the player must select a daimyo, each of which is rated attributes in several categories; Age, Health, Ambition, Luck, Charm and IQ. As the game progresses, these values change depending on events in the game. The age value represents a time limit of sorts, as an elderly daimyo becomes increasingly likely to die of old age or sickness.<br><br>During each of turn (one per season), players can issue one of several commands from a menu. They include: Recruiting new soldiers, Training the army, Buying  Weapons, Increasing Peasant morale, Forming alliances or Hiring Ninjas to bribe &amp; assassinate. When one player attacks another, there is a war fought over the defender's region. Battles are fought in an overhead-view hex battle map. Each player takes turn moving units and issuing orders, which include attack, move, bribe and surrender. The goal is to defeat all of the enemy units (or force them into surrender). Army units each have a certain weakness against other types of enemies, and are also affected by the terrain. ",
  "publishedBy": "KOEI Corporation",
  "developedBy": "KOEI Co., Ltd.",
  "released": "Jan 22, 1998",
  "alsoFor": "Amiga, DOS, FM-7, Game Boy, Genesis, Macintosh, MSX, NES, PC-88, PC-98, PlayStation 3, PSP, PS Vita, Sharp X1, Sharp X68000, SNES, TurboGrafx CD, Wii, Wii U, Windows, WonderSwan | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/nobunagas-ambition",
  "visual": "",
  "gamePlay": "Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "KOEI Corporation",
          "developer": "KOEI Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jan 22, 1998",
          "ean13": "4 988615 010644",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}