{
  "name": "One: Kagayaku Kisetsu e",
  "shortName": "one-kagayaku-kisetsu-e",
  "description": "Kohei Orihara is a Japanese high school who has experienced much tragedy in his life. When he was a child, both his parents died. After he lost his little sister, Kohei became increasingly reclusive, and eventually creates an alternate reality for himself, called &quot;Eternal World&quot;. This world resembles afterlife, though it is possible to return from it to the real world under certain circumstances. As Kohei forms relationships with the game's female characters, they begin to forget him after a while, which causes him to retreat deeper into the Eternal World. Only by creating a strong bond with one of these girls can Kohei return to real life.<br><br><i>One: Kagayaku Kisetsu e</i> is a visual novel. The player reads text descriptions and dialogues, which are superimposed on still 2D anime-style images that represent locations and events. The interaction is reduced to occasional moments when the player is prompted to make a choice for the protagonist, splitting the storyline into different branches, and eventually reaching one of the several different endings.<br><br>The initial PC release has scened with explicit adult content. These were removed in the subsequent console version, which also added voice acting for the game's characters.",
  "publishedBy": "KID Corp.",
  "developedBy": "Tactics",
  "released": "Apr 01, 1999",
  "alsoFor": "Windows | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/one-kagayaku-kisetsu-e",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "KID Corp.",
          "developer": "Tactics",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 01, 1999",
          "ean13": "4 933516 903083",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}