{
  "name": "Pink Panther: Pinkadelic Pursuit",
  "shortName": "pink-panther-pinkadelic-pursuit_",
  "description": "One Christmas day,  Pink Panther is heading toward the mansion of his late uncle. It is said that there is a treasure hidden somewhere in the mansion. As the inheritor of the mansion, Pink set out to find the treasure as soon as he steps into the mansion. He soon finds out that the treasure is locked inside a safe; the keys of which can be obtained by exploring the &quot;rooms&quot; (probably the places/enemies that Uncle Pink previously explored/defeated) in the mansion. Now it up to Pink Panther to retrieve all the keys to the treasure!<br><br>The main objective of all the levels in the game (except the final level) is to collect the key hidden in each level and get to the goal to proceed to the next level. There are a total of 12 &quot;rooms&quot; (levels) within 3 game modes: platform, race and boss fight. Most levels are in platform mode. In platform mode, the key is guarded by a certain character in a certain place. The way to that place is not straightforward: there are plenty more characters blocking the ways each time players proceed. The only way to proceed is to do the suitable exchanges with these characters (what they need will be displayed in the thought bubbles when players come near them). Very often the object a character needs is also the one another has, so stealing and chasing are essential parts of this mode. Hiding spots are provided for players for convenience during chase sequences. <br><br>In race mode, Pink's controls are restricted: he cannot freely walk; he can only accelerate or decelerate while moving forward. The key will be obtained once players get to the goal. In boss fight mode, players' only objective is to defeat the boss to get the key. <br><br>Various enemies are presented in platform mode and race mode, but only in platform mode can players beat the enemies. At the beginning of the game, players is provided with a key to open the first &quot;room&quot;. The higher the level is, the greater number of keys is needed. Coins are presented in all levels. Players can collect coins to unlock artworks in the gallery opposite the mansion There are some question mark signs which will summon Uncle Pink to explain new things for players when players stand near them.<br><br>The graphics are in 3D. Players have a choice among English, France, German, Spanish and Italian. The game is automatically saved when a level is completed or manually by pressing the certain button (can be set in the option section). After completing a level, players can freely choose to replay that level or the lower levels.",
  "publishedBy": "DreamCatcher Interactive Inc., Wanadoo Edition",
  "developedBy": "&Eacute;tranges Libellules S.A.",
  "released": "Nov 13, 2002",
  "alsoFor": "Windows | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/pink-panther-pinkadelic-pursuit_",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "DreamCatcher Interactive Inc.",
          "developer": "&Eacute;tranges Libellules S.A.",
          "ported": "",
          "country": " United States, Canada",
          "releaseDate": "Nov 13, 2002",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "D3Publisher Inc.",
          "developer": "&Eacute;tranges Libellules S.A.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 27, 2003",
          "ean13": "4 527823 991866",
          "comments": "Simple 1500 Series release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}