{
  "name": "Premier Manager 98",
  "shortName": "premier-manager-98",
  "description": "<i>Premier Manager 98</i> is a team data update of <a href=\"https://www.mobygames.com/game/premier-manager-97\">Premier Manager 97</a>. All 92 teams from the nationwide leagues and international teams were updated for the 1997-98 season, keeping all the features from the previous title (online English league database, 3D match engine) untouched.<br><br>Although only the English league is available, it is still possible to play in pre-season friendlies or international competitions against most first division teams in Europe and South America or scout and sign their players.<br><br>There are two game modes: Manager and Pro-Manager. Manager allows the player to start in any team. Pro-Manager, on the other hand, requires the player to build his career from the Conference, promoting the club from the lower divisions or getting promoted himself to better ranked teams. It's possible to tweak options such as the level of control (&quot;trainer&quot; leaves the player only in control of player tactics and squad selection, &quot;accountant&quot; is the exact opposite, giving the player control over transfers, contracts, staff, finance, board room options and ground expansions, but no limited control over the squad, &quot;Manager&quot; gives control in all but contract deals and &quot;total&quot; gives full executive control) or if players age and eventually retire, or play forever.<br><br>Up to 20 players can play in Manager mode, 8 in Pro-Manager.",
  "publishedBy": "Gremlin Interactive Limited",
  "developedBy": "Dinamic Multimedia, S.A.",
  "released": "Jul, 1998",
  "alsoFor": "Windows | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/premier-manager-98",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Gremlin Interactive Limited",
          "developer": "Dinamic Multimedia, S.A.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Jul, 1998",
          "ean13": "5 013658 085676",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}