{
  "name": "Rakugaki Showtime",
  "shortName": "rakugaki-showtime",
  "description": "Somewhere out there, there lies an imaginary game world called Rakugaki. Many characters inhabit this strange land, like the hero team of Yukiwo, Sasami, Pitan, and Tsubohachi, and an army of enemies led by the infamous Daddy who wants to see them dead. They are all controlled by Rakugaki's creator, the mysterious God Hand, and follow their predetermined fates. Today, the final battle is beginning - but Rakugaki's characters don't want to go just yet! Can they escape the grasp of God Hand and take back their lives?<br><br><i>Rakugaki Showtime</i> is a fighting game in which the player, a character rendered as a pencil drawing, fights through a series of 3D arenas in order to defeat God Hand and restore happiness to Rakugaki. Enemies are attacked by the throwing of missiles, rocks, grenades, land mines, black holes, or smiley balls. In addition, players have a series of moves that they can also use to attack, and a series of Super Smiley Attacks, which are activated by grabbing Smiley Balls that have been completely charged up with attacks. Each of the characters have various strengths and weaknesses that can either help - or hinder - the player.<br><br>The player begins the game with four characters to choose from, but can unlock other characters each time they defeat God Hand. There are a maximum of 16 characters for players to unlock. In addition, a training mode is available, allowing players to practice their moves. Up to four players can also compete in a Versus battle for bragging rights.",
  "publishedBy": "Enix Corporation",
  "developedBy": "Treasure Co., Ltd.",
  "released": "Jul 29, 1999",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/rakugaki-showtime",
  "visual": "",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Enix Corporation",
          "developer": "Treasure Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 29, 1999",
          "ean13": "4 988601 003247",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}