{
  "name": "Rama",
  "shortName": "rama",
  "description": "Nobody has expected it - but one day, something entered the solar system from outside. The mysterious object appeared to be a gigantic cylinder with unknown properties. The International Space Agency (ISA) sent the special Newton Team onto the object, which they dubbed &quot;Rama&quot;. The scientists soon discovered that Rama was, in fact, a huge biomechanical collector of alien species and their cities. One of the explorers, Valeriy Borzov, dies under mysterious circumstances. Another astronaut is sent to replace him, investigate the circumstances that led to his death, and perhaps uncover the mystery of Rama.<br><br><i>Rama</i> is a puzzle-solving adventure game based on <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,2889/\">Arthur C. Clarke's</a> series of science fiction novels. Visually and gameplay-wise, it mostly follows the template of <a href=\"https://www.mobygames.com/search/quick?game=Myst\">Myst</a>, consisting of pre-rendered backgrounds and live action scenes, and focusing almost entirely on complex logic puzzles. The player character has a special device called &quot;wristcomp&quot;, which includes communicative, automapping, and teleporting abilities. A personal android provides descriptions of objects and comments on the events of the game.",
  "publishedBy": "Softbank Corp.",
  "developedBy": "Dynamix, Inc.",
  "released": "May 07, 1998",
  "alsoFor": "DOS, Macintosh, Windows | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/rama",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Softbank Corp.",
          "developer": "Dynamix, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 07, 1998",
          "ean13": "4 512557 600214",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}