{
  "name": "Rayman 2: The Great Escape",
  "shortName": "rayman-2-the-great-escape",
  "description": "Admiral Razorbeard and his gang of robot pirates have enslaved all the creatures in Rayman's world, including the peaceful Teensies and the Lums, which give life to the earth.  Rayman has been captured by the pirates as well and is lamenting his troubles in his prison cell, when he meets his good friend, Globox.  Globox has smuggled in a silver Lum, given to him by the great fairy, Ly.  With the power of the silver Lum, Rayman is able to once more shoot his fists.  With his power restored, the pair escape the flying prison ship and embark on another adventure to save the entire world!<br><br><i>Rayman 2: The Great Escape</i> is the sequel to <a href=\"https://www.mobygames.com/search/quick?quickSearch=008888310013\">Rayman</a>, a 2D side-scrolling platform game.  Unlike the previous game, <i>Rayman 2</i> is entirely in free-roaming 3D environments, similar to <a href=\"https://www.mobygames.com/game/super-mario-64\">Super Mario 64</a>.  Rayman has many unique abilities that can help him get around the world.  In addition to being able to shoot his fists, he can use his hair to hover like a helicopter, and even glide on air currents in certain places.  He can climb certain walls and ceilings and can even use his fists to swing from special purple Lums which are shaped like rings.  Rayman also has many unique items at his disposal, such as powder kegs which can be carried or fly like jets, strange warheads with legs that he can ride and steer like bucking mules, and gigantic plums that can be thrown into the water to create new paths.<br><br>Rayman's goal is to find the four masks of the world, which allow the owner to reawaken Polokus, the spirit of the world.  These masks are scattered far and wide, and are well hidden and guarded, so it is not an easy task.  By gathering the yellow Lums, Rayman will gain access to new worlds, which will take him to the locations of new masks.  Collecting yellow Lums also rewards him with new powers and life meter extensions.<br><br>The Nintendo 64 and Windows platforms are the original version of the game. The Nintendo DS version sticks closest to this version.<br><br>The Dreamcast version adds a new area to the original version called Globox Village which contains exclusive mini-games. The mini-games are unlocked by collecting six hidden Globox crystals. Also, other changes include The Hall of Doors being changed into a new place called The Isle of Doors, and more Robo-Pirates to contend with, including a new type not seen in the original version. The iOS and Nintendo 3DS version are based on this version, but don't include the Globox Village section. However the 3DS version features a dynamic difficulty curve, with the game getting easier if too many lums are missed.<br><br>The PlayStation version features a heavy alteration of the levels with some being merged and some being removed altogether, although there are also some new areas as well. This includes a new unlockable bonus area that was from the originally planned 2D version of the game that was scrapped. The amount of collectible Lums was reduced from 1,000 to 800. This version characters are also voiced with actual real languages instead of the whisper speak of the other versions. <br><br>The PlayStation 2 version adds minigames, exclusive items like the Lumz Radar, and offers more abilities for Rayman to purchase and use.\nAlong with some expanded level revisions with lums being placed in different locations, there are three new bosses to contend with. The Hall of Doors has become hub locations, The Minisaurus Plain, Globox's House, and The Rainbow Creek. Bonus challenges can also be played by freeing caged Familiar Spirits. These prisoners are exclusive to this version of the game. The game also gives the option to use either the real language voice overs or the older version's style and lets players save mid-level.",
  "publishedBy": "Ubi Soft Entertainment Software",
  "developedBy": "Ubi Soft Entertainment Software",
  "released": "Sep 16, 2000",
  "alsoFor": "Dreamcast, iPhone, Nintendo 64, Nintendo 3DS, Nintendo DS, PlayStation 2, PlayStation 3, PSP, PS Vita, Windows | Combined View",
  "genre": "Action",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/rayman-2-the-great-escape",
  "visual": "",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Ubi Soft Entertainment Software",
          "developer": "Ubi Soft Entertainment Software",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 07, 2000",
          "ean13": "3 362932 800965",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/921562-rayman-2-the-great-escape-playstation-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/921563-rayman-2-the-great-escape-playstation-screenshot-main-menu.png",
      "caption": "Main Menu."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/185391-rayman-2-the-great-escape-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/185392-rayman-2-the-great-escape-playstation-inside-cover.jpg",
      "scanOf": "Inside Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/185393-rayman-2-the-great-escape-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/185394-rayman-2-the-great-escape-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/274166-rayman-2-the-great-escape-playstation-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Italy , Spain  and United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/274165-rayman-2-the-great-escape-playstation-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Italy , Spain  and United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/240159-rayman-2-the-great-escape-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Italy , Spain  and United Kingdom",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/147105-rayman-2-the-great-escape-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "France  and Germany",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/147106-rayman-2-the-great-escape-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "France  and Germany",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/148247-rayman-2-the-great-escape-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "France  and Germany",
      "platforms": "PlayStation"
    }
  ]
}