{
  "name": "R?MJ: The Mystery Hospital",
  "shortName": "rmj-the-mystery-hospital",
  "description": "<i>R?MJ</i> is an interactive movie horror adventure game with full voice-acting and without subtitles to feel more like a movie. The story takes place in a summer of 1999, as a large explosion occurred in a General Hospital. Due to a deadly virus being released, the hospital is on lockdown, and you are left with no way out. The player assumes the role of Hajime, who after going to visit his best friend, finds himself trapped in a hospital along with two friends, Ryou and Tomowo, and a rookie nurse, Aya. The gameplay consists of exploring locations in the hospital by moving in a certain direction (forward, turn left or right, or turn back) which uses pre-rendered animation for every movement from one point to another. Certain locations can be zoomed in to give you more details or to pick up an item. Your companions will often give you some comments while you explore, most of which may seem a selection of five sentences that are randomly selected. The game also features the use of player's senses (sight, hearing, touch, smell and taste) which must be used at key locations and events in order to progress the game.",
  "publishedBy": "Bandai Co., Ltd.",
  "developedBy": "System Sacom",
  "released": "Nov 27, 1997",
  "alsoFor": "SEGA Saturn | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/rmj-the-mystery-hospital",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Bandai Co., Ltd.",
          "developer": "System Sacom",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 27, 1997",
          "ean13": "4 902425 599830",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}