{
  "name": "Roswell Conspiracies: Aliens, Myths &amp; Legends",
  "shortName": "roswell-conspiracies-aliens-myths-legends",
  "description": "<i>Roswell Conspiracies: Aliens, Myths &amp; Legends</i> is a game based on the animated TV series of the same name, basically <i>X-Files</i> for kids. The player takes the role of Nick Logan who has the unique ability to see through alien disguises and accompanies him during his work: catching aliens to save the world. The gameplay principle is simple: the player walks through 15 levels with a fixed camera perspective and shoots everything he sees, e.g. werewolves or vampires. To do this he uses one of the many weapons he finds - all of them have unlimited ammo but have to regenerate energy during pauses of fire. But the player doesn't kill his enemies for good: He has to catch them with his alien trap (which is a matter of pressing one button) or they regenerate.<br><br>Besides the shooting the game also features its share of puzzles, e.g. activating a mechanism, and bosses. There is also a mini game which comes into place whenever Logan has to disable a bomb or open a lock: basically a series of quick time events where the player has to press the correct button with the right timing. The levels are divided into five areas: London, Ireland, San Francisco, a Maya temple and Roswell.",
  "publishedBy": "Ubi Soft Entertainment Software",
  "developedBy": "Red Lemon Studios",
  "released": "2001",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/roswell-conspiracies-aliens-myths-legends",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Ubi Soft Entertainment Software",
          "developer": "Red Lemon Studios",
          "ported": "",
          "country": " Germany",
          "releaseDate": "2001",
          "ean13": "3 307212 809184",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}