{
  "name": "Sany? Pachinko Paradise",
  "shortName": "sany-pachinko-paradise",
  "description": "<i>Sany? Pachinko Paradise</i> is the first title in Irem's long-running pachinko simulation series. It features reproductions of two pachinko machines made by Sanyo bussan: <i>CR Umi Monogatari S5</i> and <i>CR Boukenjima</i>. There are two standard modes available: Ts?j? (Normal) mode allows the player to modify a wide range of settings for each machine, while Jissen (Battle) mode challenges the player to win as many balls as possible on the default settings with a limited starting pool and time limit. There is also a View mode where the various animations that play on the in-game display can be freely viewed.<br><br>In addition, there is also a Pachi-Pro (Story) mode called <i>Doki Doki Pachinko Monogatari: Mezase!! Pachinko Senshuken</i> where the player takes the role of a college student who wants to become a professional pachinko player. He must practice his skills under the guidance his coaches, three beautiful young women, training to take part in a pachinko tournament and take on the so-called Don of the pachinko world, Mr. T. This mode combines the pachinko play with a basic time-management simulation game that includes mini-games and a pachinko quiz.",
  "publishedBy": "Irem Software Engineering, Inc.",
  "developedBy": "Irem Software Engineering, Inc.",
  "released": "Jul 29, 1999",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/sany-pachinko-paradise",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Irem Software Engineering, Inc.",
          "developer": "Irem Software Engineering, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 29, 1999",
          "ean13": "4 536592 000037",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}