{
  "name": "Sarara's Little Shop",
  "shortName": "sararas-little-shop",
  "description": "<h3>PlayStation Store Description (from <a href=\"https://www.mobygames.com/game/sararas-little-shop/adblurbs\">Ad Blurbs</a>)</h3><b>Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!</b><br>\n<br> \nExperience a timeless RPG masterpiece!\n<br><br>\nThe game centers around a novice witch who decides to start an item shop to serve the local heroes, knights, thieves, and wizards. She manages the shop, while occasionally going on adventures of her own.\n<br><br>\nThere are many colorful characters in the world of Danjyon Shoutengai who can become your “regular patrons” and help support your shop.\n<br><br>\nAre you ready to set up shop in this immersive RPG experience?\n<br><br>\nDownload this PS one® Classic today! \n<br><br>\nTransferring to a PSP® system from your PS3™ system:<br><br>\n<b>You must be signed into the PlayStation®Network account that originally purchased the game.</b>  You must have at least 92 MB free on your Memory Stick Duo™. Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the ? button and select Copy. <br>  \n<br> \nPC Store Customers:<br>\nLog into your PlayStation®Network account that you originally used to purchased the game. Then, download the game from your &quot;Download List&quot; in the PlayStation®Store onto your PS3™ system.<br>\n<br>\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available. <br>  \n<br>\nPlease Note: This game is a direct import from Japan and is displayed in its original Japanese language.\n<br><br>\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\n<br><br>\n©1998 Tomoyuki Fujinami/Ryou Sasaki. ©1998 Kodansha/Kinotrope.\n<br><br>\n&quot;PS one&quot;, &quot;PlayStation&quot;, &quot;PS&quot; Family logo, and &quot;PSP&quot; are registered trademarks of Sony Computer Entertainment Inc.",
  "publishedBy": "Kodansha Ltd.",
  "developedBy": "Kinotrope, Siesta, Inc.",
  "released": "Oct 29, 1998",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/sararas-little-shop",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Kodansha Ltd.",
          "developer": "Kinotrope",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Oct 29, 1998",
          "ean13": "4 938838 098158",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}