{
  "name": "Seireiki Rayblade",
  "shortName": "seireiki-rayblade",
  "description": "It is the start of a new semester. T?ya, an ordinary high school student, spends his time in school as always: sleeping during the class. After his detention, he went to the schoolyard with his friend K?ichir?. Suddenly, two robots come from the sky and battle it out, with one robot going down. T?ya gets slightly wounded, but manages to operate the fallen robot and defeats the enemy, albeit temporarily. He wakes up, two days later, in bed, completely confused whether or not the events were nothing but a dream. The scar he got from the previous battle is still on his face, leaving him wandering for any sort of reason. Suddenly, he feels weak, and after an encounter with a mysterious man, he is forced to sign a contract. The man tells T?ya the reason why strange thing happen to him: his consciousness no longer exists on Earth, and it now belongs to a different world. T?ya is then taken to a &quot;gate&quot;, where our world and theirs meet. He is now left with the task of finding out what is going on, and eventually, find a way back to Earth.<br><br><i>Seireiki Rayblade</i> (pronounced as &quot;rye-blade&quot;) is a turn-based tactical RPG in a very similar vein to <i>Super Robot Wars/Taisen</i> and <i>Fire Emblem</i>. The player controls pilots of robots throughout the entire campaign, battling against various types of enemies on an isometric field. All main characters possess powers that can give them a necessary edge in the battle. When enemy units are defeated, characters earn &quot;pr?na&quot;, their willpower. When pr?na increases to a certain level, characters can perform more powerful attacks on the enemy.<br><br>This game is actually a spiritual successor to the <i><a href=\"https://www.mobygames.com/search/quick?game=Masou+Kishin\">Masou Kishin: The Lord of Elemental</a></i>, previously developed by Banpresto and Winky Soft. Banpresto went to develop the <i>Super Robot Wars/Taisen</i> franchise, while Winky Soft decided to make a game reminiscent of the original <i>Masou Kishin</i>. As such, the game shares many similarities with each other, including the combat, the gameplay, its mechanics, the science-fantasy setting, and even the design of the protagonist. However, the main story, while similar, plays out differently. Also, all combat in the game is performed on the playing field itself, i.e. it does not cut to a separate combat screen. The biggest addition to the genre is the character progression system in a &quot;visual novel&quot; style. After missions, players can talk to various characters and, depending on the choices, increase their loyalty levels. Such changes can have an impact on the performance of their teammates in battle.",
  "publishedBy": "Winky Soft Co., Ltd.",
  "developedBy": "Winky Soft Co., Ltd.",
  "released": "Mar 23, 2000",
  "alsoFor": "Dreamcast, PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/seireiki-rayblade",
  "visual": "Isometric",
  "gamePlay": "Tactical RPG, Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Winky Soft Co., Ltd.",
          "developer": "Winky Soft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 23, 2000",
          "ean13": "4 988157 010010",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}