{
  "name": "Sentimental Graffiti",
  "shortName": "sentimental-graffiti",
  "description": "The protagonist of the game is a Japanese high school student, who was frequently transferred from school to school in various cities of Japan. During the summer holidays, he receives an anonymous letter, containing only one sentence: &quot;I want to meet you&quot;. He decides to travel to all the cities where he attended high school, and resume the contact with the girls who could have sent him this letter. But which one did send it, and which one is going to be his true love?..<br><br><i>Sentimental Graffiti</i> is what is usually referred to as <i>dating simulation</i>. Instead of following a story, like in adventure games, the player makes choices that influence his relationships with the game's female characters, thus shaping his own story. <br><br>There are twelve cities to travel to, and twelve girls to have a relationship with. Compared to some other dating simulations (such as <a href=\"https://www.mobygames.com/search/quick?gamegroup=tokimeki+memorial\"> Tokimeki Memorial</a>  games), the gameplay system in <i>Sentimental Graffiti</i> is rather simple, focusing on freedom of movement and choice rather than statistics. <br><br>The player can choose between various means of transportation (different kinds of train, plane, boat, etc.), and different locations within each city. The backgrounds are digitized photos of real locations in Japan, while the characters are hand-drawn anime style pictures.",
  "publishedBy": "NEC Interchannel, Ltd.",
  "developedBy": "NEC Interchannel, Ltd.",
  "released": "Mar 29, 2001",
  "alsoFor": "PlayStation 3, PSP, PS Vita, SEGA Saturn | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/sentimental-graffiti",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "NEC Interchannel, Ltd.",
          "developer": "NEC Interchannel, Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 29, 2001",
          "ean13": "4 513244 900464",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}