{
  "name": "Shiritsu Justice Gakuen: Nekketsu Seishun Nikki 2",
  "shortName": "shiritsu-justice-gakuen-nekketsu-seishun-nikki-2",
  "description": "In the first sequel to <a href=\"https://www.mobygames.com/game/rival-schools\">Rival Schools</a>, once again the halls of Taiyo High School are rocked by an evil plot to eliminate the gangs and opposing schools that threaten the city, and every kid able to fight and throw fireballs joins the fray to defend their faction/school.<br><br>The game is a 3D one-on-one arcade fighter, in which you select your character and try to defeat all opponents in each round using nothing but your fighting abilities and special moves. These moves form the core of Justice Gakuen, as the game features extremely over-the-top powers and super-moves that can be triggered when your power bar reaches the appropriate level.<br><br>The game features loads of variations on the fighting modes, with team, team vs, tournament, arcade, training, as well as a story mode which plays like a traditional Japanese adventure game, in which you see snapshots of the characters and settings while the storyline is displayed via text. You have to make decisions every now and then that branch the story in different directions for each character, and decide what kind of mini-game you must play next, as the game places you in small competitions based on sports and other school-related activities in the form of reflex-oriented mini-games. The reward for beating said modes come in the form of additional costumes, hidden features and extra characters.",
  "publishedBy": "Capcom Co., Ltd.",
  "developedBy": "Capcom Co., Ltd.",
  "released": "Jun 24, 1999",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/shiritsu-justice-gakuen-nekketsu-seishun-nikki-2",
  "visual": "",
  "gamePlay": "Arcade, Fighting",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Capcom Co., Ltd.",
          "developer": "Capcom Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 24, 1999",
          "ean13": "4 976219 354639",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}