{
  "name": "Shoot",
  "shortName": "shoot",
  "description": "Shoot is a budget compilation of 7 action mini games. These are:<ul>\n<li>Wild West</li>\n<li>War Drones</li>\n<li>Space Rebellion</li>\n<li>G Squad</li>\n<li>IF22</li>\n<li>Ace</li>\n<li>Air Rescue</li></ul>Though listed as 7 different games, in fact the games are mostly reskinned versions of each other. They all feature the same premise: Take down a certain number of enemies to advance to the next stage. Each game has its own main menu, although it only features three options: New Game, High Score, and Main Menu (which takes you back to the game selection screen).<br><br><i>Wild West</i> and <i>Ace</i> (while graphically different) has the player assume the role of a single character in the foreground seen from behind. The Mission (as in all games on the disc) is to kill a certain number of bad guys per stage to advance. The character can walk sideways or roll, and the game utilizes a <a href=\"https://www.mobygames.com/search/quick?quickSearch=Cabal\">Cabal</a> style aiming system. Meaning that you move the aim as well as the character with the directional pad. There are also a few bonuses such as heavier weapons and bonus points to pick up.<br><br><i>G Squad</i> has the player pilot a big mech robot. The only freedom of movement is strafing sideways to the left or right and some slight movement up and down. Aside from that the player controls the aim and can select from three different weapons to take down enemies with. There are also bonuses, such as ammo, extra points and fuel.<br><br><i>War Drones</i>, <i>Space Rebellion</i>, <i>IF22</i> and <i>Air Rescue</i> are all variants of the same theme. The player controls an airborne machine (airplane, jetfighter, mecha or spaceship, depending on the game), and takes down enemies in a similar fashion to the arcade classic <a href=\"https://www.mobygames.com/search/quick?quickSearch=Afterburner\">Afterburner</a>. There are two types of weapons to use: either a light rapid firing weapon (machine gun or laser, depending on the game) and rockets which are somewhat heat seeking. There are some bonuses, such as more ammo, extra points and fuel to pick up along the way.",
  "publishedBy": "Phoenix Games B.V.",
  "developedBy": "Na.p.s. Team s.n.c.",
  "released": "2005",
  "alsoFor": "",
  "genre": "Action, Compilation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/shoot",
  "visual": "",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Phoenix Games B.V.",
          "developer": "Na.p.s. Team s.n.c.",
          "ported": "",
          "country": " Germany",
          "releaseDate": "2005",
          "ean13": "8 717249 596301",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/413094-shoot-playstation-screenshot-game-selection-screen.png",
      "caption": "Game selection screen."
    },
    {
      "link": "/images/shots/l/413095-shoot-playstation-screenshot-title-screen-from-wild-west.png",
      "caption": "Title screen from Wild West."
    },
    {
      "link": "/images/shots/l/413096-shoot-playstation-screenshot-title-screen-from-space-rebellion.png",
      "caption": "Title screen from Space Rebellion."
    }
  ],
  "cover": []
}