{
  "name": "Silent Möbius: Case: Titanic",
  "shortName": "silent-mbius-case-titanic",
  "description": "In the year 1999, the Guild of Magicians was about to open a portal to the mysterious dimension of Nemesis, intending to rejuvenate Earth's polluted atmosphere. However, one of the magicians betrayed the Guild and used the portal for his own gain, releasing hostile creatures known as Lucifer Hawk onto Earth. Twenty-four years later, a special all-female unit known as Attacked Mystification Police was formed to combat the enemy.<br><br><i>Case: Titanic</i> is based on the manga and anime <i>Silent Möbius</i>. It presents an original episode that involves the sighting of a strange ship in the clouds above Tokyo. Closer inspection reveals that the ship appears to be identical to the famous RMS Titanic that sank in the Atlantic Ocean in 1912. The game's nameless male protagonist boards the ship along with Rally, Kiddy, Nami and other heroines from the manga in order to investigate this seemingly inexplicable phenomenon.<br><br>The gameplay is done in Japanese-style, puzzle-less adventure format. The entire game is set on the Titanic. The player is generally free to visit various areas of the ship in any order, though access to certain locations is restricted and necessary events must be triggered in order to gain it. The commands Look, Talk and Move are used on most screens, and there is no inventory management.",
  "publishedBy": "Gainax Co., Ltd.",
  "developedBy": "Gainax Co., Ltd.",
  "released": "Oct 08, 1998",
  "alsoFor": "FM Towns, PC-98, PlayStation 3, PSP, PS Vita, Sharp X68000 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/silent-mbius-case-titanic",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Gainax Co., Ltd.",
          "developer": "Gainax Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Oct 08, 1998",
          "ean13": "4 984841 014005",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}