{
  "name": "Snatcher",
  "shortName": "snatcher",
  "description": "<i>Snatcher</i> is set in the futuristic Neo Kobe City, a city of madness and decadence. The year is 2047 (or 2042, according to the original Japanese version). Mankind is facing its gravest crisis. A mysterious bio-roid life form has appeared. Its true nature and purpose are unknown. Is it some country's secret weapon, or an alien from another world? They appear in the winter, killing people and taking their place in society. They wear artificial skin and can sweat and even bleed. They are called &quot;Snatchers&quot; because they &quot;snatch&quot; their victims before they take their place.<br><br>A new police force, specifically trained to fight the Snatchers, has been formed. They are JUNKERs (which is deciphered as &quot;Japanese Undercover Neuro-Kinetic Elimination Rangers&quot; in the English version). Every time you encounter someone, a difficult question must be asked — is it a person or a snatcher? <br><br>The player takes control of Gillian Seed, one of the JUNKERs. The gameplay largely follows the structure of a Japanese-style adventure. The player uses a menu-driven interface to execute commands, which include moving between locations and interacting with the environment. Typically, every room contains objects that can be examined, leading to text descriptions and comments. Conversations occupy a large portion of the gameplay, with various topics available and a wealth of information about the game's world and characters. A few parts contain light puzzle-solving elements, though as a rule the game is almost completely devoid of puzzles.<br><br>During key moments of the narrative, the player will be prompted to participate in intense shooting sequences. The goal is usually to kill all the enemies that pop out on the screen before they are able to kill Gillian. Some of such sequences are timed, i.e. the player is required to quickly shoot before another events is triggered, leading to the protagonist's death.",
  "publishedBy": "Konami Co., Ltd.",
  "developedBy": "Konami Co., Ltd.",
  "released": "Feb 16, 1996",
  "alsoFor": "MSX, PC-88, SEGA CD, SEGA Saturn, TurboGrafx CD | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/snatcher",
  "visual": "",
  "gamePlay": "Japanese-style adventure, Quick Time Events (QTEs), Shooter",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami Co., Ltd.",
          "developer": "Konami Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 16, 1996",
          "ean13": "4 988602 008173",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/82402-snatcher-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/82403-snatcher-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/82404-snatcher-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/82405-snatcher-playstation-other.jpg",
      "scanOf": "Other",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    }
  ]
}