{
  "name": "Soccer '97",
  "shortName": "soccer-97",
  "description": "<i>Soccer '97</i> is a one or two player football game based on the English league as it more or less was in the 1997-1998 season.<br><br>There are four modes of play<ul><li>Exhibition mode where the player picks both teams and plays as one of them.</li>\n<li>League mode where a player selects a team and plays through an entire season with the game simulating all other results. The teams in this mode are restricted to the English Premier league for the 1997-1998 season (*see note below)</li>\n<li>Arcade mode is a knock-out tournament</li>\n<li>Tournament mode starts with four groups each with four teams in each which can be manually or randomly populated. Here the teams within each group play each other and the group winners play for the trophy.</li></ul>There is a limited team management function within the game. Prior to the match the player can decide on their preferred formation, and can assign roles such as man marking to their defenders and so on. The game is licensed by the Professional Footballer's Association and so can use footballer's names, however all team emblems and strips are fictitious.<br><br>The teams available in the Exhibition Match mode are  Arsenal, Aston Villa, Birmingham City, Blackburn Rovers,  Bolton Wanderers, Chelsea, Coventry City, Crystal Palace, Derby County, Everton, Huddersfield Town, Ipswich Town, Leeds United, Leicester City, Liverpool, Manchester City, Manchester United, Middlesbrough, Newcastle United, Nottingham Forest, Queens Park Rangers, Sheffield United, Sheffield Wednesday, Southampton, Stoke city, Sunderland, Tottenham Hotspur, Tranmere Rovers, West Bromwich Albion, West Ham United, Wimbledon and Wolves.<br><br>*However the teams in the League are not quite those that played in the 1997-1998 season. The league is largely correct but Bolton Wanderers and Crystal Palace are missing and have been replaced with Middlesborough and Sunderland.<br><br>",
  "publishedBy": "Eidos Interactive Limited",
  "developedBy": "Silicon Dreams Studio Ltd.",
  "released": "1997",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/soccer-97",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Eidos Interactive Limited",
          "developer": "Silicon Dreams Studio Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1997",
          "ean13": "5 032921 001915",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/689433-soccer-97-playstation-screenshot-the-game-starts-with-an-animated.png",
      "caption": "The game starts with an animated sequence that shows a kid playing with a ball in the street, practicing his skills. This cuts to a grown up man doing the same thing on the pitch. Dreams realised."
    },
    {
      "link": "/images/shots/l/689434-soccer-97-playstation-screenshot-it-s-not-on-screen-long-but.png",
      "caption": "It's not on screen long but this is the game's title screen."
    },
    {
      "link": "/images/shots/l/689435-soccer-97-playstation-screenshot-this-is-the-game-s-language.png",
      "caption": "This is the game's language selection screen. It's based on the panels of a football and the game uses the same menu structure throughout."
    },
    {
      "link": "/images/shots/l/689436-soccer-97-playstation-screenshot-the-game-s-main-menu-screen.png",
      "caption": "The game's main menu screen. The player selects the game mode with the left/right controls and cross selects."
    },
    {
      "link": "/images/shots/l/689437-soccer-97-playstation-screenshot-this-is-a-demo-mode-game.png",
      "caption": "This is a Demo Mode game. Pressing any button, as the game is prompting the player to do, will abort the game"
    },
    {
      "link": "/images/shots/l/689438-soccer-97-playstation-screenshot-whenever-a-goal-is-scored.png",
      "caption": "Whenever a goal is scored the letters of the word GOAL appear on screen, spinning. They are always red or blue which are the colours the teams play in"
    },
    {
      "link": "/images/shots/l/689439-soccer-97-playstation-screenshot-a-shot-of-showing-the-crowd.png",
      "caption": "A shot of showing the crowd and the stadium"
    },
    {
      "link": "/images/shots/l/689440-soccer-97-playstation-screenshot-the-full-time-match-stats.png",
      "caption": "The full time match stats. These are for a demo game but the same format is used for all game modes."
    },
    {
      "link": "/images/shots/l/689441-soccer-97-playstation-screenshot-this-is-the-team-selection.png",
      "caption": "This is the team selection screen for an exhibition match, Arsenal has already been selected. The same format is used for League and Arcade modes but in the League mode only one team can be selected"
    },
    {
      "link": "/images/shots/l/689442-soccer-97-playstation-screenshot-prior-to-an-exhibition-match.png",
      "caption": "Prior to an exhibition match the player tweak the conditions. This panel lets the player to select the wind conditions. The one to the right changes the pitch from dry to varying degrees of soggine"
    },
    {
      "link": "/images/shots/l/689443-soccer-97-playstation-screenshot-there-are-twelve-pre-set.png",
      "caption": "There are twelve pre-set controller layouts"
    },
    {
      "link": "/images/shots/l/689464-soccer-97-playstation-screenshot-prior-to-a-match-the-player.png",
      "caption": "Prior to a match the player can tweak their team's strategy by choosing an attacking or a defensive performance. The same option is available during a match too."
    },
    {
      "link": "/images/shots/l/689465-soccer-97-playstation-screenshot-prior-to-a-match-the-player.png",
      "caption": "Prior to a match the player can tweak their team's strategy by assigning roles to players. The same option is available during a match too."
    },
    {
      "link": "/images/shots/l/689466-soccer-97-playstation-screenshot-a-goal-kick-is-about-to-be.png",
      "caption": "A goal kick is about to be taken. The red square shows where on the pitch it will land. The player can move this marker via the direction controls"
    },
    {
      "link": "/images/shots/l/689467-soccer-97-playstation-screenshot-when-a-player-is-given-a.png",
      "caption": "When a player is given a red or yellow card the game switches to a close-up"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/282643-soccer-97-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "PlayStation"
    }
  ]
}