{
  "name": "Stakes Winner",
  "shortName": "stakes-winner",
  "description": "<i>Stakes Winner</i> is a horse racing game. <br><br>Races can be entered by one or two players and involve eight horses struggling for victory; each of the eight horses (in the order which the game presents them in: White Heat, Hot Sand, Euro Union, Asian Hope, Brave Lady —the sole female one—, Be Silent, US Fighter, Sky Dancer) given for selection is characterized by three parameters (named «abilities» in-game): speed, stamina, strength, all measured in stars from a minimum of one to a maximum of five. Rival horses are not available for selection to the player: their names are, for instance, the ominous- or hilarious-sounding «Mr Devious», «Red Vision», «Sunk Star», «HelpMe», «OhMygod», «Nutseater». The names are also differentiated by being written all in capital letters the latter ones, normally the former.<br><br>Before the beginning of the race, while horses approach the starting point, the name of the circuit, course plan, prize money and circuit time record are displayed. During the race, the indicators on the screen are: the course plan (with a moving coloured circular indicator representing the position of each contender), the chronometric indication of time, the horse's energy bar with a line composed of three segments beside it: a red one (that means the horse is in its full strength), a yellow and a blue one (denoting lack of strength); a representation of the horse's face, which portrays its, more or less fatigued or strong status and how intensely it is running.<br><br>The game controls require the use of two buttons and the control stick or directional pad: one button controls the reins, for slight acceleration, which consumes a little of the horse's energies. The other one controls the whip, for sharp acceleration: this consumes the horse's force significantly. Should the energy be consumed entirely, racing will have to be given up for a while. Two rapid touches on the joystick or directional pad in the direction of travel allow to force away a horse blocking the player's road to victory; two rapid touches in the direction opposite to that of travel vigorously reduce speed. <br><br>Power-up items represented by icons placed on the course may be taken during the race, raising one of the parameters of the horse by one for some time, giving a temporary boost in speed, or partially restoring the horse. Weather conditions change from time to time: the drizzle may be an obstacle, worsening the status of the terrain. A real second corresponds to two seconds in game (therefore, for instance, a one-minute race will last half a minute).<br><br>After every stage, the track length, as well as the prize money awarded to the first three finishers are augmented. The series of levels are separated by training stages. If done successfully, training on the dirt or on the turf respectively increases the horse's stamina and speed, whereas training on or «against»,the hill strengthens it. Success in training session is to be attained by pushing a button as rapidly as possible, while avoiding assorted obstacles and hindrances. The player can choose what type of training to opt for.<br><br>Race courses proceed in the ensuing sequence: <ul>\n<li>Maidens</li>\n<li>Sapporo Juvenile</li>\n<li>Juvenile Stakes</li>\n<li>training</li>\n<li>2000 Guineas</li>\n<li>Derby Stakes (the $1.300.000 prize money is mistakenly displayed as «$ 130.000»)</li>\n<li>St. Leger (BC Classic in the original arcade game)</li>\n<li>training</li>\n<li>Japan Grandprix</li>\n<li>Emperor Spring Cup</li>\n<li>Champion Stakes</li>\n<li>St. Leger  (difficulty is now higher than the previous time)</li>\n<li>training</li>\n<li>Japan Cup</li>\n<li>Japan Grandprix (difficulty is this time higher than previously)</li>\n<li>The Arc The Triomphe</li></ul><br><br>The game is identical to the original one in all of its fundamental aspects, save for a number of modifications to minor details: continues are still named «credits» (four of them are given: it is possible to select a different horse when continuing the game using a credit after game over) and their quantity is indicated, likewise in arcade games, at the bottom of the screen (although the flashing «Insert coin» on the opening screen followed by «Push P1 start !» has been replaced with «Push P1 or P2 start !»).<br><br>While the original game was entirely in Japanese (except for race names, given an English translation), the console version, despite not having been released outside of Japan, can be said to be in English (conversely, now race course names have a Japanese translation next to the English name); money prizes are now in dollars rather than in yen, and remarkably changed in value: whereas YPN 5300 were the reward in the arcade version, $540000 are awarded to the winner of a race. Initially, nothing but crossing the finish line in the first place allowed progression in the game; in the console conversion finishing in the first three places guarantees advancement to the next race.<br><br>Horse energy is named «power» in the Neo Geo version, adhering to the original game, while in the Wii version it was renamed to «life»; furthermore, in the Neo Geo version the blue and red segments are shown inverted beside the energy bar. The console version presents fours levels of difficult: easy, normal, hard, MVS.",
  "publishedBy": "Saurus Co., Ltd.",
  "developedBy": "Saurus Co., Ltd.",
  "released": "Dec 06, 1996",
  "alsoFor": "Arcade, Neo Geo, Neo Geo CD, Nintendo Switch, PlayStation 4, SEGA Saturn, Wii, Xbox One | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Horse / derby",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/stakes-winner",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Saurus Co., Ltd.",
          "developer": "Saurus Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 06, 1996",
          "ean13": "4 946318 196010",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}