{
  "name": "Super Robot Wars F",
  "shortName": "super-robot-wars-f",
  "description": "The game takes place 4 months after the events of <a href=\"https://www.mobygames.com/game/snes/dai-3-ji-super-robot-taisen_\">Super Robot Wars 3</a>.<br><br>A special, but shady, secret police force, the Titans, are created in response to terrorist acts and internal trouble between the Earth and its space colonies. Meanwhile in the shadow old and new enemies menaces Earth: they are the Poseidals (aliens from outer space), the Guests (another alien race) and the now rebuilt DC army.\n \n<i>Super Robot Wars F</i> and <a href=\"https://www.mobygames.com/game/super-robot-wars-f-final\"> Super Robot Wars F Final</a> (also known as &quot;Super Robot Taisen F Kanketsuhen&quot;) were originally thought as an unique title but due to production delays the game was split in two parts. F covers the first 34 stages of the game, F Final deals with stages from 35 to the end of the game. It's possible to import a savegame from F and continue the game from here or to start F Final from scratch with default settings and units.<br><br>Gameplay mechanics are the same of <i>Super Robot Wars 4</i>. The title is a turn based strategic game. When attacked by an enemy, the player can react in three ways: counter, evade (halves enemy % of landing an attack on the player) or defend (if hit, the player receives only half of the damage).",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Winky Soft Co., Ltd.",
  "released": "Oct 12, 1998",
  "alsoFor": "PlayStation 3, PSP, PS Vita, SEGA Saturn | Combined View",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/super-robot-wars-f",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Winky Soft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Oct 12, 1998",
          "ean13": "4 983164 734386",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}