{
  "name": "TearRing Saga: Yutona Eiy? Senki",
  "shortName": "tearring-saga-yutona-eiy-senki",
  "description": "Often referred to as simply “TearRing Saga” (TRS or TS), <i>TearRing Saga: Yutona Eiyuu Senki</i> is the first installment in the TearRing Saga series, developed by Tirnanog and created by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,200961/\">Shouzou Kaga</a>, the original director and creator of the Fire Emblem series. The game opens with the rise of the Cult of Gerxel, a group that wishes to revive the dead god Gerxel. The player follows two protagonists, Runan and Holmes, who flee from their homeland as it is conquered by the Cult and its patron, the Zoa Empire. As the story progresses, they gradually gather allies and work to liberate the various lands under imperial occupation. As the story progresses, they learn more about the history of the Cult of Gerxel, the Zoa people, and unrest within the Empire, ultimately culminating in a clash against the Cult's leader, Pontiff Guenchaos.<br><br>Gameplay is essentially unchanged from its Fire Emblem roots: the player strategically controls a number of units on square-grid maps and attempts to fulfill the mission's win condition, which varies from map to map. Characters who fall in battle remain dead, though they can be resurrected late in the game by the use of a limited-use item called the Dakruon. Individual character subplots are greatly affected by whether they are placed into Runan's party or Holmes's, as the two groups visit different locations and can only exchange party members three times across the game's 40 chapters.",
  "publishedBy": "Enterbrain, Inc.",
  "developedBy": "Bits Laboratory, Tirnanog Co.",
  "released": "May 24, 2001",
  "alsoFor": "",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/tearring-saga-yutona-eiy-senki",
  "visual": "",
  "gamePlay": "Tactical RPG",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Enterbrain, Inc.",
          "developer": "Bits Laboratory",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 24, 2001",
          "ean13": "4 541993 000111",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}