{
  "name": "Tokimeki Memorial Selection: Fujisaki Shiori",
  "shortName": "tokimeki-memorial-selection-fujisaki-shiori",
  "description": "This is a spin-off from the main <i>Tokimeki Memorial</i> game series with main focus on Shiori Fujisaki, the main heroine from the original <a href=\"https://www.mobygames.com/game/tokimeki-memorial\">Tokimeki Memorial</a> game.<br><br>Gameplay-wise, the game contains four really shot date visual novels, one for each season (spring, summer, fall and winter) and a rock-paper-scissors mini-game you can play with Shiori. The mini-game rules are like this: the one who wins the rock-paper-scissors game points toward left or right and the one that lost has to look in the right direction or losses a point. The winner is the one who first gets three points. The game features full voice-acting for Shiori whenever she is talking on the screen, whether in visual novels, mini-game or various extras.<br><br>Extras consist of two music video which use animated Shiori incorporated on the live animated backdrops. Videos mostly show sea and nature, as well as some rural and known Japanese cities such as Yokohama. The portrait collection contains over a dozen of scrollable portraits of Shiori in various different outfits and locations. The voice collection includes various words and sentences you can hear Shiori say upon selection. Shiori's mini-character is walking around the screen and stops to say to selected word or a sentence.",
  "publishedBy": "Konami Computer Entertainment Japan Co., Ltd. ",
  "developedBy": "Konami Co., Ltd.",
  "released": "Mar 27, 1997",
  "alsoFor": "SEGA Saturn | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/tokimeki-memorial-selection-fujisaki-shiori",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Konami Computer Entertainment Japan Co., Ltd. ",
          "developer": "Konami Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 27, 1997",
          "ean13": "4 988602 041941",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}