{
  "name": "Voltage Fighter Gowcaizer",
  "shortName": "voltage-fighter-gowcaizer",
  "description": "In 1999 a massive earthquake levels Tokyo, killing nearly all the population and forcing the government to move its capital onto a man-made island off of the coast of Japan where for years they lived in peace. However, in the year 2017 violence begins to erupt between citizens coincidentally enough when a new principal arrives at the National Belnar Institute, the largest university on the island. Around this time a student also arrives by the name of Isato Kaiza, who is secretly the hero of the game <i>Gowcaizer</i>. He arrives with a stone that can manifest energy that allows him to transform. With this stone, he must discover the source of the evil and bring peace back to Japan.<br><br>The main gameplay aspect is a 2D fighting game (one on one)  which <a href=\"https://www.mobygames.com/search/quick?company=SNK+Corporation\">SNK</a> is mostly known for.  The player can choose from 10 different characters each with their own unique moves and abilities.  One feature that this game has over other games in the genre is the ability to add a defeated foes special abilities to their own repertoire, however they can only do one move at a time and if they choose to change a move, the previous one is lost for the rest of the game.  Additionally, when the player defeats their mirror image their move will be amplified.  The player will face each opponent twice in a tournament style before reach the final boss at the end of the game.",
  "publishedBy": "Urban Plant Ltd",
  "developedBy": "Technos Japan Corp.",
  "released": "Jul 17, 1997",
  "alsoFor": "Arcade, Neo Geo, Neo Geo CD, PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/voltage-fighter-gowcaizer",
  "visual": "",
  "gamePlay": "Arcade, Fighting",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Urban Plant Ltd",
          "developer": "Technos Japan Corp.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 17, 1997",
          "ean13": "4 513438 230025",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}