{
  "name": "Wakusei K?gekitai: Little Cats",
  "shortName": "wakusei-kgekitai-little-cats",
  "description": "The galaxy is threatened by robotic enemies from a remote space. In order to stop them, giant combat robots were deployed to a space station under the command of Colonel Goofy Reagan. The combat robots are navigated by the best pilots, which happen to be cute teenage girls. Since the Colonel is very busy, he needs somebody to watch over the girls and train them. This somebody would be Major David Lowe, the protagonist of the game...<br><br><i>Little Cats</i> is somewhat similar to <a href=\"https://www.mobygames.com/search/quick?gamegroup=Sakura+Taisen\"> Sakura Taisen</a> games, with adventure and dating elements reduced, and simulation elements added. David has to make schedules for the girls and decide how much and what exactly they should train. Running competitions, shooting range, robot navigation - everything can be trained, but at the expense of the girls' stamina, which means they will need to rest as well. During the simulation mode, it is also possible to wander around the space station and spend time with the girls.<br><br>The strategy part consists of navigating the robots over a battle field in turn-based fashion. The robots have a wide range of attacks, and it is possible to change their weapons and use items in combat. Once the robots attack each other, an automatic attack sequence is shown.",
  "publishedBy": "Family Soft Co., Ltd.",
  "developedBy": "Family Soft Co., Ltd.",
  "released": "Jun 25, 1998",
  "alsoFor": "PC-FX, PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/wakusei-kgekitai-little-cats",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Family Soft Co., Ltd.",
          "developer": "Family Soft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 25, 1998",
          "ean13": "4 988709 100060",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}