{
  "name": "Waku Waku Derby",
  "shortName": "waku-waku-derby",
  "description": "<h3>PlayStation Store Description (from <a href=\"https://www.mobygames.com/game/waku-waku-derby/adblurbs\">Ad Blurbs</a>)</h3><b>?This game is supported with the PSP® and PS Vita screenshot function?<br>PSP®: Screenshots can be taken by using the menu after holding the PS button (HOME button) in the game. <br>The image will be saved in the photo collection from the XMB™ (XrossMediaBar).<br>PS Vita: Screenshots can be taken by using &quot;Screenshot&quot; from the &quot;Settings&quot; after holding the PS button in the game. <br>The image will be saved as an application photo. <br><br>This software can be played with PlayStation®3 and PSP® (PlayStation®Portable).<br>If you are downloading with PC or via PS3™, after downloading with the device please connect to PSP® with a USB cable and copy the content by inserting a storage media like Memory Stick™.</b><br><br>A new sensational horse racing simulation game as a result of combining board game and racing game together! <br>Raise your horse during the board phase and win the race with your favorite horse during the racing phase to earn the prize money.<br>The trick for wining the race is to plan your strategy by utilizing the characteristics of the horse and make use of information such as the racing distance and courses on the turf or dirt.<br>So work your way to keep winning with your favorite horse!<br><br><b>Copyright:</b><br>©Softgarage<br><br>Purchase or use of this item is subject to SEN Terms of Service and User Agreement.",
  "publishedBy": "KSS",
  "developedBy": "Dream Japan",
  "released": "Dec 18, 1997",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Simulation, Sports",
  "perspective": "Side view, Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "Horse / derby",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/waku-waku-derby",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "KSS",
          "developer": "Dream Japan",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 18, 1997",
          "ean13": "4 988262 301249",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}