{
  "name": "Weltorv Estleia",
  "shortName": "weltorv-estleia",
  "description": "<i>Weltorv Estleia</i> is a non-linear role-playing game set in a medieval fantasy world with its own mythical history and lore. The background story involves a battle between seven legendary warriors, led by the young magician Ten, against an evil dragon. The player assumes the role of a nameless adventurer, male or female, who ventures to the city of Farbell. There, he or she is instructed to join the the Adventurers Guild, and eventually becomes involved in the grand struggle against dark forces threatening Estleia.<br><br>In the beginning of the game the player has to create a customized character, modifying his or her age, hair color, clothes, height, and weight. Character class can not be assigned, but the player character can eventually specialize as either a monk, a magician, or a thief, by completing missions for the respective guilds. The protagonist has three main attributes - spirit, technique, and vitality, which can be manually increased whenever he or she levels up. Other attributes include various aspects of physical preparation and conditions, which act as requirements for equipping weapons and armor. Experience points in the game are awarded for defeating enemies as well as for completing quests.<br><br>Despite its Japanese origins, <i>Weltorv Estleia</i> is a free-form RPG that is closer to Western templates. The game's world consists of interconnected areas and contains several towns, wilderness areas, and dungeons. The player is free to explore the game world and undertake any quests from the onset. The game's scenario system allows players to pursue as many quests as they wish at the same time. By interacting with the various non-player characters, the player gets key words or key phrases indicating details and giving clues about the currently selected active scenario. The scenarios will then trigger when the player, having followed the clues, reaches the scenario point. By fulfilling the requirements for each scenario, the player progresses through the game. There are over a hundred scenarios, ranging in length and difficulty, sometimes having different possible outcomes.<br><br>Interaction with NPCs also allows the player to express emotions by having the player character smile, cry, or become angry. These emotional responses during conversations may influence the way NPCs react to the hero. The player can also have the main character draw his weapon at any time. <br><br>Combat in the game is turn-based. Battles are fairly sporadic and occur either in a scripted manner, dictated by the scenario, or by approaching hostile creatures that may be encountered in the wilderness. The player navigates the main character on the battle screen in a tactical fashion, attacking enemies when they are within the range of the equipped weapon. Over the course of the game, several characters may join the hero's party, usually as a possible scenario outcome. These characters are controlled by the AI during combat.<br><br>The game's outdoor areas (including towns), dungeons, as well as all the characters and enemies, are rendered in 3D. Only smaller indoor locations such as shops, guilds, bars, people's houses, etc., are presented as pre-rendered backgrounds. There are no character portraits and the game generally eschews anime-style aesthetics usually associated with RPGs of Japanese origin.",
  "publishedBy": "Hudson Soft Company, Ltd.",
  "developedBy": "Hudson Soft Company, Ltd.",
  "released": "Feb 25, 1999",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/weltorv-estleia",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Hudson Soft Company, Ltd.",
          "developer": "Hudson Soft Company, Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 25, 1999",
          "ean13": "4 988607 050139",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/630019-weltorv-estleia-playstation-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/630017-weltorv-estleia-playstation-screenshot-the-intro-presents.png",
      "caption": "The intro presents some background mythology..."
    },
    {
      "link": "/images/shots/l/630018-weltorv-estleia-playstation-screenshot-and-contains-some-slightly.png",
      "caption": "...and contains some slightly weird images, accompanied by broad symphonic music"
    },
    {
      "link": "/images/shots/l/630020-weltorv-estleia-playstation-screenshot-have-you-joined-the.png",
      "caption": "Have YOU joined the Communist party of the Soviet Union, comrade?.."
    },
    {
      "link": "/images/shots/l/630021-weltorv-estleia-playstation-screenshot-character-creation.png",
      "caption": "Character creation. Note the detailed haircut selection"
    },
    {
      "link": "/images/shots/l/630022-weltorv-estleia-playstation-screenshot-the-game-begins-in.png",
      "caption": "The game begins in the city of Farbell, as you are approached by guards. Note the dialogue options!"
    },
    {
      "link": "/images/shots/l/630023-weltorv-estleia-playstation-screenshot-each-city-is-fairly.png",
      "caption": "Each city is fairly large, and comes with a map of its own"
    },
    {
      "link": "/images/shots/l/630024-weltorv-estleia-playstation-screenshot-status-screen.png",
      "caption": "Status screen"
    },
    {
      "link": "/images/shots/l/630025-weltorv-estleia-playstation-screenshot-indoor-locations-are.png",
      "caption": "Indoor locations are pre-rendered. This is one of the many guilds in the first town"
    },
    {
      "link": "/images/shots/l/630026-weltorv-estleia-playstation-screenshot-temple-topics-to-discuss.png",
      "caption": "Temple. Topics to discuss and learn"
    },
    {
      "link": "/images/shots/l/630027-weltorv-estleia-playstation-screenshot-combat-screen-tactical.png",
      "caption": "Combat screen. Tactical movement range is displayed"
    },
    {
      "link": "/images/shots/l/630028-weltorv-estleia-playstation-screenshot-visiting-a-small-town.png",
      "caption": "Visiting a small town with a cozy mine, inhabited by dwarves"
    },
    {
      "link": "/images/shots/l/630029-weltorv-estleia-playstation-screenshot-detailed-equipment.png",
      "caption": "Detailed equipment screen"
    },
    {
      "link": "/images/shots/l/630030-weltorv-estleia-playstation-screenshot-i-was-wandering-through.png",
      "caption": "I was wandering through a forest and found this well. Shall I jump in?.."
    },
    {
      "link": "/images/shots/l/630031-weltorv-estleia-playstation-screenshot-3d-battles-feature.png",
      "caption": "3D battles feature dynamic camera panning in the beginning"
    },
    {
      "link": "/images/shots/l/630032-weltorv-estleia-playstation-screenshot-sad-game-over-screen.png",
      "caption": "Sad Game Over screen"
    },
    {
      "link": "/images/shots/l/630033-weltorv-estleia-playstation-screenshot-one-of-the-many-shops.png",
      "caption": "One of the many shops in the town of Tete"
    },
    {
      "link": "/images/shots/l/630034-weltorv-estleia-playstation-screenshot-exploring-the-town.png",
      "caption": "Exploring the town of Tete"
    },
    {
      "link": "/images/shots/l/630035-weltorv-estleia-playstation-screenshot-choose-an-icon-corresponding.png",
      "caption": "Choose an icon corresponding to an action (cry, smile, get angry) during a conversation "
    },
    {
      "link": "/images/shots/l/630036-weltorv-estleia-playstation-screenshot-slums-district-of-tete.png",
      "caption": "Slums district of Tete. Note the Shanghai-like public laundry display :) I had nothing to do at the moment, so I opened the character menu"
    },
    {
      "link": "/images/shots/l/630037-weltorv-estleia-playstation-screenshot-towns-may-have-statues.png",
      "caption": "Towns may have statues on their central squares, dedicated to legendary heroes and giving you more insight into the game's lore"
    },
    {
      "link": "/images/shots/l/630038-weltorv-estleia-playstation-screenshot-well-hel-lo-there-no.png",
      "caption": "Well, hel-lo there!.. No, it's not what you think. This woman is a thief, and you can recruit her as an NPC..."
    },
    {
      "link": "/images/shots/l/630039-weltorv-estleia-playstation-screenshot-which-is-quite-useful.png",
      "caption": "...which is quite useful - you can't open locked chests, but she can!"
    },
    {
      "link": "/images/shots/l/630040-weltorv-estleia-playstation-screenshot-in-battles-you-ll-have.png",
      "caption": "In battles, you'll have to wait until the lower bar fills, depending on the character's speed rating"
    },
    {
      "link": "/images/shots/l/630041-weltorv-estleia-playstation-screenshot-somewhat-abstract-backgrounds.png",
      "caption": "Somewhat abstract backgrounds in a swamp battle. My NPCs bravely hacks at a Level-10 mimic chest"
    },
    {
      "link": "/images/shots/l/630042-weltorv-estleia-playstation-screenshot-the-southern-town-has.png",
      "caption": "The southern town has a quieter, relaxed atmosphere"
    },
    {
      "link": "/images/shots/l/630043-weltorv-estleia-playstation-screenshot-we-were-attacked-by.png",
      "caption": "We were attacked by those blue guys in a dungeon. We split - I took on one of them, while my companion was braver and faced the two others"
    },
    {
      "link": "/images/shots/l/630044-weltorv-estleia-playstation-screenshot-i-have-leveled-up-i.png",
      "caption": "I have leveled up! I can manually distribute the stats!"
    },
    {
      "link": "/images/shots/l/630045-weltorv-estleia-playstation-screenshot-i-ve-created-a-new.png",
      "caption": "I've created a new character, this time female. Gave her some brighter clothes and all. Now she visits the Adventurer's Guild for a funny scene"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/267683-weltorv-estleia-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/267684-weltorv-estleia-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/267685-weltorv-estleia-playstation-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    }
  ]
}