{
  "name": "Wizardry: Crusaders of the Dark Savant",
  "shortName": "wizardry-crusaders-of-the-dark-savant",
  "description": "<i>Crusaders of the Dark Savant</i> is the seventh installment of the <i>Wizardry</i> series and a direct sequel to <a href=\"https://www.mobygames.com/game/wizardry-bane-of-the-cosmic-forge\">Bane of the Cosmic Forge</a>. In the end of the previous game, the party of heroes finally acquired the Cosmic Forge. However, before they were able to decide what to do with it, it was taken away by a servant of the Cosmic Lords, the cyborg Aletheides. It appears that the Cosmic Forge was in fact a clue to the location of the Astral Dominae, the artifact of life, somewhere on the planet Guardia, which has now been revealed to the universe.<br><br>The heroes then travel to Guardia, which is populated by many races and organizations with their own agendas, including the rhinoceros-like Imperial Umpani Federation and the spidery T'Rang affiliated with a malevolent being known as the Dark Savant, whose goal is to get rid of the Cosmic Lords. All these factions are looking for the Astral Dominae, finding which is the primary goal of the game. Depending on the decisions made by the player in the previous game (should he opt to import the party from there), the game will have different openings and begin in different locations. However, regardless of the initial premise, the player is free to follow or betray whatever faction he was supposed to be allied with. <br><br>The gameplay system is very similar to that of its predecessor, retaining the races, the classes, the skills and the magic system it introduced to the series. The trademark first-person exploration and turn-based combat are present as well. Unlike the previous games, <i>Crusaders of the Dark Savant</i> allows the player to explore towns and vast forest areas between them, in addition to several large dungeons situated in different areas of the game world. Many NPCs have their own agendas and may move between locations as well, and even obtain crucial items themselves if the player-controlled party is not quick enough, forcing the player to change plans. The exotic setting contains elements of science fiction on top of the traditional fantasy background. Like in the previous game, encounters, events, as well as the heroes' reflections upon them are described through text messages.<br><br>A few skills have been added, including swimming and climbing, as well as diplomacy. The latter reflects the more important role dialogues and interaction with NPCs play in the game compared to the previous installments of the series. A mapping skill has been added, which, if learned, displays - for the first time in the computer releases of Wizardry games - an automap on top of the exploration screen. Skills are increased with repeated usage and the characters now receive separate bonus points for each category (weapon, physical, and academia). Like before, magic is divided into four schools (Psionics, Alchemy, Theology, and Thaumaturgy) and six elemental categories.",
  "publishedBy": "Sony Computer Entertainment Inc.",
  "developedBy": "Sir-tech Software, Inc.",
  "released": "Oct 13, 1995",
  "alsoFor": "DOS, FM Towns, Linux, PC-98, Windows | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/wizardry-crusaders-of-the-dark-savant",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Sony Computer Entertainment Inc.",
          "developer": "Sir-tech Software, Inc.",
          "ported": "Soliton Soft",
          "country": " Japan",
          "releaseDate": "Oct 13, 1995",
          "ean13": "4 948872 100106",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/778276-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/778277-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Intro: The Dark Savant in glorious (albeit plastic-looking) 3D!"
    },
    {
      "link": "/images/shots/l/778278-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Intro continues: introducing the races. The Umpani looks way better in 2D, if you ask me"
    },
    {
      "link": "/images/shots/l/778285-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Character creation screen. Note the anime portraits"
    },
    {
      "link": "/images/shots/l/778279-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Starting the game. Smooth-scrolling 3D, much easier to navigate than in the computer version. Still... the atmosphere is somehow not there"
    },
    {
      "link": "/images/shots/l/778280-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Character sheet"
    },
    {
      "link": "/images/shots/l/778281-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "You meet a strange young lady. Again, I think she looks way cooler in 2D"
    },
    {
      "link": "/images/shots/l/778283-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Fighting some evil plants near a dungeon entrance"
    },
    {
      "link": "/images/shots/l/778282-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "Exploring the optional &quot;Beginner Dungeon&quot;. Fighting some bats"
    },
    {
      "link": "/images/shots/l/778284-wizardry-crusaders-of-the-dark-savant-playstation-screenshot.png",
      "caption": "The famous Ratkin ambush"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/133815-wizardry-crusaders-of-the-dark-savant-playstation-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    },
    {
      "link": "/images/covers/l/133816-wizardry-crusaders-of-the-dark-savant-playstation-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "PlayStation"
    }
  ]
}