{
  "name": "World League Basketball",
  "shortName": "world-league-basketball",
  "description": "<i>World League Basketball</i>, part of the Mindscape Sports Advantage series, is a realistic basketball game developed using motion capture and physics of real players.<br><br>Change the rules of play for arcade, custom or simulation game with control over the difficulty level to time length of actual play from 5 minutes (10-minute default) to a maximum 25 minutes.<br><br>Players can choose &quot;exhibition play&quot; for practice matches between teams, before committing to one team for a 30-game &quot;season play&quot; or six-round &quot;tournament play&quot; in prearranged series of scheduled games against 36 different countries of various abilities. The latter two allows for simulated games to skip matches - if desired with results automatically calculated by the computer.<br><br>View statistics of your team before embarking in a match to determine the best on-court positions from point guard to centre of talented team members according to their performance and capabilities. Freely adjust player attributes from height, weight, strength, endurance to ball handling skills.<br><br>On-court play includes live commentary by <a href=\"https://www.mobygames.com/search/quick?developer=Chris+Smith\">Chris Smith</a>.",
  "publishedBy": "Mindscape (UK) Limited",
  "developedBy": "High Voltage Software, Inc.",
  "released": "1998",
  "alsoFor": "Windows | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Basketball",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/world-league-basketball",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Mindscape (UK) Limited",
          "developer": "High Voltage Software, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1998",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}