{
  "name": "Zero Kara no Mahjong: Mahjong Youchien Tamago-gumi 2",
  "shortName": "zero-kara-no-mahjong-mahjong-youchien-tamago-gumi-2",
  "description": "<h3>PlayStation Store Description (from <a href=\"https://www.mobygames.com/game/zero-kara-no-mahjong-mahjong-youchien-tamago-gumi-2/adblurbs\">Ad Blurbs</a>)</h3><b>Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!</b>\n<br><br> \nThis sequel to Zero Kara no Mahjong retains all the accessibility of its predecessor but greatly refines the experience.\n<br><br>\nTake lessons based on actual matches to help learn the correct mannerisms and etiquette involved in true mahjong games.\n<br><br>\nOnce your lessons are done, you'll be armed with all the techniques needed to beat your friends in real life.\n<br><br>\nUnleash the mahjong master deep inside you!\n<br><br>\nDownload this PS one® Classic today! \n<br><br>\nTransferring to a PSP® system from your PS3™ system:<br><br>\nYou must have at least 185 MB free on your Memory Stick Duo™. Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the ? button and select Copy. <br>  \n<br> \nPC Store Customers:<br>\nLog into your PlayStation®Network account that you originally used to purchased the game. Then, download the game from your &quot;Download List&quot; in the PlayStation®Store onto your PS3™ system.<br>\n<br>\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available. <br>  \n<br>\nPlease Note: This game is a direct import from Japan and is displayed in its original Japanese language.\n<br><br>\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\n<br><br>\n©2000 Affect\n<br><br>\n&quot;PS one&quot;, &quot;PlayStation&quot;, &quot;PS&quot; Family logo, and &quot;PSP&quot; are registered trademarks of Sony Computer Entertainment Inc.",
  "publishedBy": "Affect Co.,Ltd",
  "developedBy": "Affect Co.,Ltd",
  "released": "Sep 28, 2000",
  "alsoFor": "PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/playstation/zero-kara-no-mahjong-mahjong-youchien-tamago-gumi-2",
  "visual": "",
  "gamePlay": "Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "PlayStation",
      "releases": [
        {
          "publisher": "Affect Co.,Ltd",
          "developer": "Affect Co.,Ltd",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 28, 2000",
          "ean13": "4 537744 109288",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}