{
  "name": "Cheril Perils",
  "shortName": "cheril-perils",
  "description": "<i>Cheril Perils</i> is a 2D platform game starring the character Cheril. Wearing no clothes she leaves her homeland, the jungle of Badajoz, to start a life in the city Yellowenia. When she arrives there she discovers the city is overrun by zombies. A virus created by the pharmaceutic enterprise Parasol meant to make everyone beautiful was transported in a cistern truck not properly cleaned. The previous content was morapio double-malt and the mix of the two substances has an unusual side effect: it turns people into brain-eating zombies. Now the city has been shut down by the mayor using two large spikes boulders. The only way for Cheril to escape the city is to kill 60 zombies so the mayor considers the city safe again.<br><br>The game consists of a large amount of single-screen rooms linked together. Cheril needs to navigate platforms and can only defeat zombies by jumping on top of them. These zombies take on many shapes also as animals and flying creatures. She starts with 20 lives and loses a life when she is hit. The game keeps track of the amount of zombies near the top of the screen. Next to platform elements sometimes she also needs to push blocks to create passages. Other environments have flying pigs that are used to jump higher and reach sections that are otherwise not accessible. Rooms are not only linked horizontally, but also vertically, offering exploration. Certain sections are blocked off by a dirty old man. He only lets Cheril pass when she gives him a piece of lingerie and those need to be located first. When all 60 zombies are defeated Cheril can return to the game's very first screen to exit as the boulder will be removed.<br><br>In the later NES and SMS ports the default game mode borrows a game mechanic introduced in <a href=\"https://www.mobygames.com/game/mega-cheril-perils\">Mega Cheril Perils</a> where enemies can only be defeated for a few seconds after a Resonator device has been activated that halts their movement. Then it is possible to jump on top of them while during normal gameplay it just makes Cheril bump if she lands on top of them. The freeze mechanic carries over between rooms, so a countdown started in one screen goes on in the next, leading to some environment based puzzle-solving. The game's default mode is called the easy mode in the ports. There, enemies can be defeated right away by jumping on top of them.",
  "publishedBy": "Mojon Twins, The",
  "developedBy": "Mojon Twins, The",
  "released": "Mar 25, 2020",
  "alsoFor": "NES, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/sega-master-system/cheril-perils",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "SEGA Master System",
      "releases": [
        {
          "publisher": "Mojon Twins, The",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Mar 25, 2020",
          "ean13": "",
          "comments": "Mojon Twins download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/645663-cheril-perils-nes-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "NES and SEGA Master System"
    }
  ]
}