{
  "name": "Moggy Master",
  "shortName": "moggy-master",
  "description": "<i>Moggy Master</i> is the third game in the <i>Moggy</i> series, following the ZX Spectrum titles <a href=\"https://www.mobygames.com/game/moggy\">Moggy</a> (2005) and <a href=\"https://www.mobygames.com/game/moggy-adventure\">Moggy Adventure</a> (2010). The game re-uses the first title's story. The player controls the character Moggy who has to free his classmates who are under the spell of the evil sorcerer Hibön. The wizard lured them away during a party and wants to use their bodies to expand his power. Moggy is the only one who is not under the influence. The game consists of several levels or fields filled with trapped classmates who have a pink colour.<br><br>The gameplay is close to the original 2005 title as each level is set in a single-screen environment. Moggy needs to quickly collect his pink friends by moving over them, but because he is drunk the controls are not precise with a thrust-like mechanic with slow acceleration/deceleration and a curved trajectory. Meanwhile he also needs to avoid fluorescent green plants and creatures that roam the field in later stages. He has a small amount of lives and colliding with a plant or an enemy removes one. The game is over when all lives are lost but also when Moggy takes too much time to complete a level. No timer is shown, so the player has to guess if it is fast enough.<br><br>The two-player mode is entirely new for the series, making it into a hectic, arcade-like party game. Both players control a character in the same field (Moggy and WAW) and compete against each other collecting the pink friends, bumping each other into hazards or out of the way. The player with the highest score wins the round and the same level progression as in the single-player levels is used. Each player has separate lives.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Oct 29, 2015",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/sega-master-system/moggy-master",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Party game",
  "setting": "",
  "release": [
    {
      "system": "SEGA Master System",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Oct 29, 2015",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/581470-moggy-master-sega-master-system-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "SEGA Master System"
    }
  ]
}