{
  "name": "Ultima IV: Quest of the Avatar",
  "shortName": "ultima-iv-quest-of-the-avatar",
  "description": "Following the defeat of the evil triad in the previous three <i>Ultima</i> games, the world of Sosaria changed beyond recognition: continents rose and sank, and new cities were built, heralding the advent of a different civilization. Unified by the reign of the benevolent monarch Lord British, the new world was renamed Britannia. Lord British wished to base people's well-being on the ethical principles of Truth, Love, and Courage, proclaiming the Eight Virtues (Honesty, Compassion, Valor, Justice, Sacrifice, Honor, Spirituality, and Humility) as the ideal everyone should strive for. The person who could accomplish full understanding and realization of these virtues would serve as a spiritual leader and a moral example for the inhabitants of Britannia; he alone would be able to obtain holy artifacts, descend into the Stygian Abyss, and access the Codex of Ultimate Wisdom. This person is the Avatar.<br><br>The fourth game in the <i>Ultima</i> series features an improved game engine, with color graphics and enhanced character interaction: the player can have conversations with non-playable characters by typing names of various topics. However, the main difference between <i>Ultima IV</i> and its predecessors in the series (as well as other role-playing games) lies in the game's objectives and the ways to fulfill them. <br><br>Instead of building up a character by any means possible in order to face a villain in the end of the game, in <i>Ultima IV</i> the player is trying to become the Avatar, a role model for people. This means upholding the Eight Virtues, basically trying to become a better person. Making morally conscious decisions and helping other people is not done expecting a material reward, but because it is the actual goal of the game and the main focus of its gameplay. The game frowns on behavior typical of most other RPGs, such as backstabbing fleeing enemies or picking up everything that isn't nailed down even if it does not belong to the protagonist. This different approach established the game's reputation as the first &quot;true&quot; <i>Ultima</i>, influencing the design philosophy of later installments and the overall spirit of the series.<br><br>Character creation is done by choosing responses to morally ambiguous questions. Each of the Eight Virtues corresponds to a character class; by determining the player's personal priorities in the virtues, the game assigns a class and a starting location for the Avatar. After emerging in Britannia, the player is free to explore it in various ways (on foot, moongate teleportation, on horseback, by ship, etc.). Certain items must be collected in any order to enter the Stygian Abyss and complete the game. The Avatar also has to reach the highest level in all virtues. This is achieved by various means: donating blood increases Sacrifice, not fleeing from combat increases Valor, etc. The process, however, is not irreversible: should the Avatar overpay a blind seller, he gains Compassion points; should he, on the other hand, cheat the seller by underpaying, his level in several virtues would decrease.<br><br>These unorthodox features of the game co-exist with plenty of traditional RPG elements, such as dungeons to explore and hostile monsters to kill. Enemies are encountered on the world map as well as in dungeons; combat takes place on separate top-down screens, allowing player-controlled and enemy parties freely move on them. Characters accumulate experience points and level up, gaining higher amount of hit points and access to stronger magic spells. Like in the previous installments of the series, world map, town exploration and combat are presented from a top-down view, while the dungeons are pseudo-3D and are explored from first-person perspective.<br><br><i>Ultima IV</i> also introduces several new gameplay features to the series and role-playing games in general. A number of initially non-playable characters living in various areas of the game world are able to to join the party and fight alongside the hero, replacing traditional player-generated characters or mercenaries and adventurers available only in special locations. Additional new elements include buying and combining reagents in order to cast spells, puzzle rooms in dungeons, and others.<br><br>The FM Towns version, while identical to the others in gameplay, introduces upgraded graphics similar to those used in <a href=\"https://www.mobygames.com/game/ultima-v-warriors-of-destiny\">next</a> installment of the series.",
  "publishedBy": "SEGA Enterprises Ltd.",
  "developedBy": "ORIGIN Systems, Inc.",
  "released": "1990",
  "alsoFor": "Amiga, Apple II, Atari 8-bit, Atari ST, Commodore 64, DOS, FM-7, FM Towns, iPad, iPhone, Macintosh, MSX, NES, PC-88, PC-98, Sharp X1, Sharp X68000, Windows | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/sega-master-system/ultima-iv-quest-of-the-avatar",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "SEGA Master System",
      "releases": [
        {
          "publisher": "SEGA Enterprises Ltd.",
          "developer": "ORIGIN Systems, Inc.",
          "ported": "",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "1990",
          "ean13": "4 974365 635718",
          "comments": ""
        },
        {
          "publisher": "Tec Toy Ind&uacute;stria de Brinquedos S.A.",
          "developer": "ORIGIN Systems, Inc.",
          "ported": "",
          "country": " Brazil",
          "releaseDate": "Jan, 1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/50406-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Orc Lightly Wounded"
    },
    {
      "link": "/images/shots/l/50407-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/50408-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Intro"
    },
    {
      "link": "/images/shots/l/50409-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/50410-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Story 1"
    },
    {
      "link": "/images/shots/l/50411-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Story 2"
    },
    {
      "link": "/images/shots/l/50412-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Character generator"
    },
    {
      "link": "/images/shots/l/50413-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.gif",
      "caption": "Overland"
    },
    {
      "link": "/images/shots/l/212707-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "You start the game in different places depending on the answers you gave during character generation. This looks like Moonglow..."
    },
    {
      "link": "/images/shots/l/212708-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "Sage Deli? Sounds like a nice place to stop by..."
    },
    {
      "link": "/images/shots/l/212709-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "You don't have to type your answers: the common conversation topics are already available as a menu"
    },
    {
      "link": "/images/shots/l/212710-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "The dangerously looking wizard attacks from the seaside"
    },
    {
      "link": "/images/shots/l/212711-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "The enemy leaves a treasure chest behind"
    },
    {
      "link": "/images/shots/l/212712-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "You are resting"
    },
    {
      "link": "/images/shots/l/212713-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "You are trying to cross a bridge, but a troll stops you"
    },
    {
      "link": "/images/shots/l/212714-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "Chatting with Lord British in his castle"
    },
    {
      "link": "/images/shots/l/212715-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "You wouldn't want to end up in prison, would you? So be a nice Avatar!"
    },
    {
      "link": "/images/shots/l/212716-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "The Seer will tell you how close you are to your Avatarhood. He is surrounded by sleep fields for some reason. Maybe he enjoys seeing people sleeping, I don't know"
    },
    {
      "link": "/images/shots/l/212717-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "Chatting with Chuckie the jester. New conversation topics might appear in the menu"
    },
    {
      "link": "/images/shots/l/212718-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "Outside of Lord British's castle"
    },
    {
      "link": "/images/shots/l/212719-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "Mixing reagents to prepare the Cure spell"
    },
    {
      "link": "/images/shots/l/212720-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "Your progress is slowed by those yellow fields"
    },
    {
      "link": "/images/shots/l/212721-ultima-iv-quest-of-the-avatar-sega-master-system-screenshot.png",
      "caption": "Battle screen is never the same, it always reflects the terrain you were walking on"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/42728-ultima-iv-quest-of-the-avatar-sega-master-system-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cartridge Case",
      "country": "France , Germany  and United Kingdom",
      "platforms": "SEGA Master System"
    },
    {
      "link": "/images/covers/l/42727-ultima-iv-quest-of-the-avatar-sega-master-system-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cartridge Case",
      "country": "France , Germany  and United Kingdom",
      "platforms": "SEGA Master System"
    }
  ]
}