{"altername_name": ["2010 FIFA World Cup: Minami Africa Taikai", "FIFA Fussball-Weltmeisterschaft Südafrika 2010"], "name": "2010 FIFA World Cup South Africa", "overview": "\"Celebrate the single largest sporting event on the planet with the only official and exclusively licensed videogame on Wii for the 2010 FIFA World Cup South Africa. Experience an action-packed, easy-to-play football game that brings friends together in their living rooms to compete for the 2010 FIFA World Cup with EA SPORTS 2010 FIFA World Cup South Africa.Take on the challenge of leading your home nation in the official 2010 FIFA World Cup tournament, from the group stage through the knockout rounds to a virtual re-creation of the championship final. Presented in an art style that celebrates the cultural vibrancy of the first FIFA World Cup to be held in Africa and in true-to-life detail, including confetti rain, streamers, & fireworks, 2010 FIFA World Cup features all 10 official licensed stadia in South Africa and all 199 national teams that took part in qualification. The stage is set for 32 friends to compete for the chance to be crowned 2010 FIFA World Cup champion. Score the goal that lifts your nation to victory and mark the occasion with user-controlled celebrations. Travel around the world to take on all 32 nations competing in the 2010 FIFA World Cup in head-to-head challenges in Zakumi’s Dream Team. Start your journey with random players and then build your team by stealing an opposition player after each victory. Win a challenge and pick a player until you have conquered the world and built Zakumi’s Dream Team. Plus, take your team to a friend’s house on your Wii Remote. Compete in a multiplayer, knockout-style tournament against up to 3 friends in Global Elimination. Draft and strategically select countries to play as, create alliances and gang-up on rivals until only one player is crowned champion. 2010 FIFA World Cup features non-stop football action that pits you against friends or the CPU in head-to-head challenges utilizing the Strike It System. Shake the Wii Remote perfectly in order to either score or defend free-kicks, penalties, and corners, creating frantic competition on the pitch. Even goal kicks have been enhanced to showcase one-on-one battles.\" Features: • Win the 2010 FIFA World Cup — Compete as one of 199 teams in a virtual reproduction of the 2010 FIFA World Cup. Represent your favourite country and play in any of the 10 official stadiums that come to life with the pageantry and festivity of the official tournament.• Spectacular Presentation: 2010 FIFA World Cup South Africa comes to life in spectacular fashion with a South African art style designed for Wii that captures the emotion and pageantry of the official tournament, including all 10 official licensed stadia. Experience confetti cannons, streamers, flags and fireworks as if you were in South Africa.• Global Elimination Tournament — Compete in Global Elimination, a multiplayer, knockout-style tournament against up to three friends. Draft and strategically select countries to play as, create alliances and gang-up on rivals until only one player is declared the winner.• Build Zakumi’s Dream Team —Take on all 32 countries who have qualified for the World Cup in head-to-head matches with challenges. Begin with random players and then steal your opponents’ players after each victory. Win a challenge and pick a player until you have conquered the world. Take your Dream Team to a friend’s house on your Wii Remote.• Strike It System— Non-stop football action pits you against friends in head-to-head challenges utilizing the Strike It System. Shake the Wii Remote perfectly in order to either score or defend free-kicks, penalties, and corners, creating frantic action on the pitch.• User-controlled Celebrations —Score a goal and then use the +Control Pad to pull off celebrations and admire your performance via a new close-in camera that really delivers the emotion of each goal scored.• Earn Awards— For the first time on Wii, earn awards by scoring goals or completing tasks.• Pick-up-and- Play Controls— New, accessible control scheme option enables even newcomers to videogames to compete for the 2010 FIFA World Cup. Choose to play the style that best suits your skills, from All-Play for novices to Pro Control for experienced players.• Authentic Stadiums — Compete in all 10 official stadiums of 2010 FIFA World Cup South Africa.\"", "platform": "Nintendo Wii", "release_date": "April 27, 2010", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Canada", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.66", "wikipedia": "https://en.wikipedia.org/wiki/2010_FIFA_World_Cup_South_Africa_(video_game)", "video_link": "http://www.youtube.com/watch?v=Bjy71sJJrBY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5340-2010-fifa-world-cup-south-africa\n"}