{"altername_name": [], "name": "5 Spots Party", "overview": "Have fun with the entire family and compete in the different play modes! 5 Spots Party is a game of skill for all ages based on the popular game of finding 5 differences. In its three playing modes, the goal is to find the greatest number of differences in the pictures shown. In the party modes, you must compete with other players and find as many mistakes as possible. In the 1 Player mode, you must find the differences before time runs out in order to to beat the game’s highest scores. How far do you think you can go? Features: • 5 different game modes. • For All Ages. Everyone can play. It is fun to play alone or in a group. • Fun Photos. The photos are funny and varied, and the players enjoy their content. • Surprising Mistakes. We have worked with over 6 different types of errors (shape, size, colour, arrangement, existence and distortion), and we have designed different difficulties. Many of the mistakes used boost the original photo. • Number of Photos. The game consists of over 300 photographs of different subjects and types. From landscapes to drawings, as well as everyday shapes or scenes, the variety of subjects has been a key point in the development of the game. • We created special algorithms that make it nearly impossible to repeat the same differences in the same photo. The game includes 333 photos. • Simplicity. The player controls the game in just a few seconds. The mistakes can be selected in either the left or right photo, the double cursor was enabled to make it easier to highlight the mistakes, and player aids have been implemented, such as controller vibration when the players are near mistakes.", "platform": "Nintendo Wii", "release_date": "July 10, 2009", "game_type": "Released", "esrb": "E - Everyone", "developers": "Cosmonaut Games", "publishers": "Cosmonaut Games", "genres": "Puzzle", "max_players": "4", "cooperative": "No", "rating": "2.77", "wikipedia": "https://en.wikipedia.org/wiki/5_Spots_Party", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71737-5-spots-party\n"}