{"altername_name": ["Bob der Baumeister: Fest der Freude"], "name": "Bob the Builder: Festival of Fun", "overview": "It's Summer Time In Sunflower Valley! The community project is going so well that mr Bentley has suggested a festival to celebrate. Ther will be food and music and fun for everyone. Bob and the \"Can-Do Crew\" are called to help clear the area and help build the Dome for the event. Enjoy a vast array of fun and diverse story-based challenges and build with up to 3 friends in exciting multiplayer modes - play competitively or join forces with a friend to get the job done! Make full use of the unique Wii technology to control the gameplay and use a hammer, a pick axe and a spade to break the rocks, uproot bushes and dig holes in preparation for the final show! Guide Scrambler along the road in the \"Get the Planks\" stage, collect various power-ups and use the extra time, controls, ropes and unlimited jumps to help you progress through the game Wendy and lofty rely on you to help them build the Dome. Flick the Wii remote up, down, left 7 right and see if you can fit all the Dome parts into the right places Help Mr Sabatini make pizzas for the big event! Spin the dough and through it up in the air, add various ingredients to create the pizzas and see if you can win the stage by serving your culinary masterpiece to all the customers within the time limit! Use the Wii remote to pick up rubbish, blow the leaves and mix the concrete and help your favourite characters put on a grand festival for the town! After all the hard work, grab the Wii Remote and follow the onscreen clues to enjoy a fabulous sing-along with Bob the Builder himself! Hold the Wii remote horizontally and see how many notes you can hit right! A fun and colourful gaming experience that reflects the spirit of the cartoon and incorporates a great balance of fun and education, with all your favourite characters, engaging tasks and diverse challenges - Can we fix it? yes we can!", "platform": "Nintendo Wii", "release_date": "November 30, 2007", "game_type": "Released", "esrb": "", "developers": "Atomic Planet Entertainment", "publishers": "blast! Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Bob_the_Builder:_Festival_of_Fun", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82106-bob-the-builder-festival-of-fun\n"}