{"altername_name": ["Wi-Fi 8 Hito Battle Bomberman"], "name": "Bomberman Blast", "overview": "Look out for Bomberman Blast! There's 8-person online multiplayer and you can even use your Mii as a Bomberman! A brand new addition to the Bomberman series is available on WiiWare! Up to eight players can battle online simultaneously via Nintendo Wi-Fi Connection! Simple controls make this a great game for family and friends to enjoy at anytime! New items can be triggered by shaking the Wii Remote controller for excitement never before experienced in a Bomberman title! You can even take the intensity up another notch by adding your own Mii caricatures to the mix! Battle results can be recorded on Nintendo Wi-Fi Connection Ranking, so see how you stack up against others around the globe! This title will prove to be a blast for everyone--from those who've never touched a Bomberman game, to the Bomberman masters! Bomberman Blast was released both as a downloadable title, and a (Japan only) retail release. The WiiWare version only contains the traditional Bomberman battle mode, while the retail release also contains a story mode and other additional features. The game's battle mode features eight-player, worldwide online play with rankings, and players with the retail and WiiWare versions of the game are able to compete against each other. 10 battle stages are included with the WiiWare version, while the retail release includes an extra 2 stages, for a total of 12. Eight-player battle mode is supported by having four players using GameCube controllers and four players using Wii remotes.", "platform": "Nintendo Wii", "release_date": "September 29, 2008", "game_type": "Released", "esrb": "E - Everyone", "developers": "Hudson Soft", "publishers": "Hudson Soft", "genres": "Action", "max_players": "8", "cooperative": "No", "rating": "4.24", "wikipedia": "https://en.wikipedia.org/wiki/Bomberman_Blast", "video_link": "https://www.youtube.com/watch?v=u32dQEnjupI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23782-bomberman-blast\n"}