{"altername_name": [], "name": "Build 'n Race", "overview": "Rev your engines for a fantastic heart-pounding racing experience exclusively for Wii! Build'n Race puts you in the driver’s seat on spectacular courses with insane ramps, death-defying jumps, sharp switchbacks, wild stunts, and more! But there’s more excitement than on your average race track. Players can create an unlimited amount of one-of-a-kind tracks from over 1,000 unique building blocks. Let your imagination run wild! Burn rubber in solo campaigns or against your friends on one of your original courses, or choose one of 80 exciting tracks in a variety of realistic environments. The fun doesn’t end when the checkered flag flies with Build'n Race! Features • Wild & Challenging Tracks-- dizzying courses with huge jumps, massive ramps, hairpin turns, stunt blocks, tunnels, and destructible scenery• Track Construction-- over 1,000 different building blocks & creation tools allow the player to create an infinite number of unique tracks• Varied Game Modes & Race Events-- game modes include Solo Race, Time Trial, Championship, Race Challenge, and Time Challenge; within each mode, try unique game events such as Speed Lap, Style Race, Lap Knockout, and Tournament• Multiplayer Mayhem-- race against up to 3 other players in split-screen mode; play head-to-head or as a team in several multiplayer racing modes on built-in or custom tracks• Unlockable Rewards-- multiple wins, best times, and great style give players access to new tracks, vehicle parts, and trophies• Style Points-- get rewarded for pulling off unique moves (such as big air, handbrake turns, and spins) or taking out opponents (with heavy hits, scraping paing, or causing them to spin out)• 80 Tracks Set Over 4 Game Environments-- 4 very detailed and beautifully presented race environments: Autorace City, Tri-State Circuits, Blackmoors Rally, and Fire Valley Desert• Player Profiles-- create character profiles with game storing progress, best times, and race statistics• Special Effects-- advanced design highlights and modeling effects create spectacular and realistic visual effects throughout the game", "platform": "Nintendo Wii", "release_date": "August 4, 2009", "game_type": "Released", "esrb": "", "developers": "Icon Games Entertainment", "publishers": "Zoo Games", "genres": "Racing", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76760-build-n-race\n"}