{"altername_name": [], "name": "Chibi-Robo!", "overview": "Chibi-Robo! is a platform-adventure game that puts the player in direct control of a tiny, battery-powered robot that does housework for humans. The objective of the game is to become the top-ranked \"Super Chibi-Robo\" in the world by accumulating Happy Points, a collectible gained by doing good deeds for the family and for various toys in the Sandersons' home.[6][7][8][9][14] In order to do this, the player must control Chibi-Robo and explore the Sandersons' home. During exploration, Chibi-Robo can find a wide variety of things to collect, including \"Moolah\", the currency of Chibi-Robo!. An important task in gaining Happy Points is to clean up messes around the house, such as disposing of trash or scrubbing dirty footprints.[7] The player can also interact with and help with the personal problems of the Sandersons and the toys. This ranges from solving a plot-driving crisis or completing a subquest of simply locating a lost object as a favor.[6][8][9] With Chibi-Robo's assistant Telly Vision as his speaker, the player is often prompted to give either a positive or negative response to each question or request.[8] The player loses battery power with every step and action. If his battery is not charged before it empties, Chibi-Robo will collapse and re-emerge in the Chibi-House, having lost half of his Moolah.[8] Throughout the house are electrical outlets, which the player can plug into to recharge his battery or save his progress.[7][14] The player's exploration is limited by a timer representing a full day or full night. Once the timer expires, Chibi-Robo automatically returns to the Chibi-House.[9] There are three collectibles in the game. One is the stickers, which can be obtained throughout the game, either by completing the game, completing quests, playing mini-games, or doing simple tasks for other non-player characters. The Second is the Frog Rings which can be collected and given to Jenny, the daughter of the Sanderson household, for Happy Points and a sticker. The third is the crayons found throughout the house which can be deposited in a crayon box for Happy Points. At the start of both day and night, the player begins in the Chibi-House, where they can charge Chibi-Robo's battery, save at the electrical outlet, or connect to the Citrusoft \"Chibi-PC\" to purchase a variety of items and power-ups with Moolah and use scrap metal to build \"Utilibots\", robotic helpers that ease the navigation of the Sandersons' home.[7][14] The gear available from Citrusoft includes the \"Chibi-Copter\", used to reach far-off points or fly down from a high place safely; the \"Chibi-Blaster\", used to eliminate obstacles and fend off the hostile Spydorz; and the \"Chibi-Radar\", used to detect hidden objects.[6][8] There are several other items of the Sandersons' that Chibi-Robo can find and use. These include the toothbrush, used to clean up stains; the coffee mug, used for protection; the spoon, used to dig holes; and the squirter, used to hold fluids and squirt them.[6][8] Chibi-Robo can also gain special costumes throughout the game, each of which has its own function.[7] For instance, if the player poses for Mr. Sanderson while wearing The Drake Redcrest costume, he will give Chibi-Robo Happy Points. As more Happy Points are acquired, the player's rank increases among all the Chibi-Robos in the world. At certain ranks, Citrusoft will send the player bonus batteries, allowing Chibi-Robo to roam longer without having to recharge until they earn the status of \"Super Chibi-Robo\", which earns the player unlimited battery life.[14]", "platform": "Nintendo Wii", "release_date": "June 11, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Skip", "publishers": "Nintendo", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "https://en.wikipedia.org/wiki/Chibi-Robo!", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117024-chibi-robo\n"}