{"altername_name": [], "name": "Chuck E. Cheese's Super Collection", "overview": "Play fun and exciting games from Chuck E. Cheese in the fort of your own living room with Chuck E. Cheese Party Games. Make pizzas race around the track win cool prizes and so much more! In Sports Games play a variety of fun filled sports as you pete to bee an all-star athlete. Do well to earn experience and medals to make it to the Professional League! It's the only place where a kid can be a kid! Key Features: Avatar Creation Choose from 6 unique Avatars and see how their story pans out in Party Games. Perfect Fun for the Whole Family Enjoy more than 25 different game variations starring Chuck E. Cheese and his international group of friends. Extended Replay-Ability With over 50 prizes to earn new games to discover and an online leader board to spur petition and repeated play Party Games contains hours of enjoyment. Something for Everyone With 9 different sports games with 2 different settings (Amateur and Professional) there is a ton of content for the youngest gamer that will will actively engage and incorporate children into the world of sports in Sports Games. Ease of Use Simple gameplay mechanics with a low learning curve that mimic the games at the retail Chuck E. Cheese locations will have your family playing in no time! Use the Wii-enabled controls to Whack-A-Munch shoot some hoops make pizzas and so much more! Motion controlled sports games are easily recognizable and intuitive allowing for quick pick-up and play sessions for the entire family allowing anywhere from 2-4 players to be actively involved. These sports games are designed to enhance your child's hand eye coordination patience and bring out that petitive spirit!", "platform": "Nintendo Wii", "release_date": "", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "4.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/74013-chuck-e-cheeses-super-collection\n"}