{"altername_name": [], "name": "Chuck E. Cheese's Sports Games", "overview": "Chuck E. Cheese's Sports Games is a family-friendly sports game featuring Chuck E. Cheese and his friends! Using the Wii Remote's motion controls, it is easy and intuitive for kids to interact with and enjoy! Where a Kid can be a Kid! Join Chuck E. Cheese and his friends Helen, Pasqually, Jasper and Mr. Munch as you swing, shoot, steer and putt your way to victory! Play a variety of fun filled sports as you compete to become an all-star athlete. Do well to earn experience and medals to make it to the Professional League! Fun for Boys and Girls - An assortment of fun, bite size sports mini-games specifically designed with young boys and girls in mind. Fun For the Whole Family - Motion controlled sports games are easily recognizable and intuitive, allowing for quick pick-up and play sessions for the entire family, allowing anywhere from 2-4 players to be actively involved. These sports games are designed to enhance your child’s hand eye coordination, patience and bring out that competitive spirit! Positive Entry Point/Age Appropriate - Perfectly designed with the youngest gamers in mind, our title delivers on providing a fun, safe and creative environment that discerning parents, aunts, uncles and grandparents will approve of. We are committed to providing a game that kids will love that also appeals to parents, who are looking for a positive entry point into the videogame market which is overflowing with inappropriate and sometime violent content. Something for Everyone - With 9 different sports games with 2 different settings (Amateur and Professional), there is a ton of content for the youngest gamer that will actively engage and incorporate children into the world of sports.", "platform": "Nintendo Wii", "release_date": "March 1, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Tommo", "publishers": "UFO Interactive Games", "genres": "Party", "max_players": "4", "cooperative": "No", "rating": "3.72", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116314-chuck-e-cheeses-sports-games\n"}