{"altername_name": ["CSI Crime Scene Investigation: Deadly Intent", "CSI: Crime Scene Investigation: Tödliche Absichten"], "name": "CSI: Deadly Intent", "overview": "In Sin City there are no secrets, only hidden answers. Join the new Vegas CSI team and let the evidence guide you to the truth. Explore five brand-new, shocking cases written with CSI writers and bring the guilty to justice. Explore crime scenes, dissect a victim’s body, or follow the twists and turns of the story. CSI: Deadly Intent is an all-new immersive experience thanks to intriguing cases written with CSI show writers, a new rendering engine allowing for more realistic graphics, improved lighting effects, and enhanced character acting and lip sync with the voices of the actors from the show. Partner with the cast of the new CSI Season 9 with characters such as Ray Langston (Laurence Fishburne) and Riley Adams (Lauren Lee Smith). Work together on the crime scene or help each other during tough suspect interrogations. Play one of the most skilled forensic experts ever to join the Vegas CSI team. Help other detectives in their investigations and gain their respect through your actions and teamwork. PERFORM THE TASKS OF A CSI DETECTIVE: Collect evidence at the crime scene: Dust for fingerprints, Search for items that might be related to the case; Unveil hidden evidence through observation; Interview a variety of witnesses and suspects: Utilize an improved interrogation system for more realistic character interactions; Ask the right questions and use evidence collected at the crime scene to get the truth. Analyze the evidence with the latest technology: DNA analysis, Microscopic analysis.", "platform": "Nintendo Wii", "release_date": "November 12, 2009", "game_type": "Released", "esrb": "M - Mature", "developers": "Telltale Games", "publishers": "Ubisoft Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/CSI:_Deadly_Intent", "video_link": "https://www.youtube.com/watch?v=Rbs1J4swZRw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82123-csi-deadly-intent\n"}