{"altername_name": ["Destroy All Humans! Big Willy: Entfesselt"], "name": "Destroy All Humans! Big Willy Unleashed", "overview": "Crypto is back yet again for the 3rd game in the series. The game takes place sometime in the 1970s, a decade after the last installment. Crypto and his mentor Orthopox attempt to exploit the popularity of Big Willy, a fast food restaurant owned by Pox. His secret recipe is actually human meat. The meat is served from the dead bodies that were left behind after Crypto got their brain stems. A kidnapped heiress by the name of Patty Wurst has discovered the secret recipe of the restaurant, Crypto and Pox set on an adventure have to stop her before exposing them. Wurst was working with Colonel Kluckin, the restaurant rival of Crypto and Pox, who had discovered the secret recipe as well. The game is set in the 1970s. There is now a third way to unleash fury besides on foot and in a UFO aircraft, a Big Willy Machine! There are 5 different places to explore: Harbor City, Fairfield, Vietnmahl, Fantasy Island & Antarctica. There are futuristic weapons and unique mental abilities. It wouldn't be a Destroy all Humans game without Humor and over the top, non-stop action. Popular abilities as Psychokinesis and Body Snatch return as well as Crypto's Zap O Matic and Disintegrator Ray. New abilites include the saucer's Electro-Cone and Quantum Deconstructor. Crypto has a new guns including Ball Lightning and a zombie gun that turns his victims into zombies.", "platform": "Nintendo Wii", "release_date": "February 25, 2008", "game_type": "Released", "esrb": "T - Teen", "developers": "Pandemic", "publishers": "THQ", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.92", "wikipedia": "https://en.wikipedia.org/wiki/Destroy_All_Humans!_Big_Willy_Unleashed", "video_link": "https://www.youtube.com/watch?v=FqNCTDbBQJ8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4055-destroy-all-humans-big-willy-unleashed\n"}