{"altername_name": [], "name": "Disney Sing It", "overview": "Disney Sing It is a karaoke video game and sequel to High School Musical: Sing It!. It was released on October 28, 2008 across multiple platforms. The game's product description refers to additional downloadable song packs being available. However, as of 28 April 2009, Disney Interactive Support has replied (to a query): \"Thank you for contacting us.In some circumstances we need to make some business decisions and drop certain projects that might have been planned or even announced previously. This case falls in one of those situations and currently we don't have any plans on adding any downloadable contents for either Disney Sing It title.\"[original research?] The game has received mixed reviews, with both 1UP.com and IGN praising its accessibility towards kids but finding serious fault with the gameplay, with Official Xbox Magazine ultimately calling it a \"gateway game\" at best.[1][2][3] Track List[edit] Aly & AJ - Like Whoa Aly & AJ - Potential Break-Up song Aly & AJ - Chemicals React Billy Ray Cyrus - Ready, Set, Don't Go Camp Rock - We Rock Camp Rock - Start the Party Camp Rock - This is Me Camp Rock - Gotta Find You Camp Rock - Play My Music Camp Rock - Hasta La Vista Camp Rock - Here I Am Cheetah Girls 3 - One World Cheetah Girls 2 - Dance with Me Cheetah Girls 2 - The Party's Just Begun Corbin Bleu - Push It To The Limit Everlife - Find Yourself In You Everlife - Real Wild Child Hannah Montana - Best of Both Worlds Hannah Montana - Life is What You Make It Hannah Montana - Nobody's Perfect Hannah Montana - Rock Star High School Musical - Breaking Free High School Musical - Get'cha Head in the Game High School Musical - Start of Something New High School Musical 2 - Bet On It High School Musical 2 - Fabulous High School Musical 2 - What Time Is It High School Musical 2 - You Are the Music in Me Jesse McCartney - She's No You Jordan Pruitt - Jump to the Rhythm Jordan Pruitt - Outside Looking In Miley Cyrus - Girls Night Out Miley Cyrus - See You Again Miley Cyrus - Start All Over Vanessa Hudgens - Say OK", "platform": "Nintendo Wii", "release_date": "October 21, 2008", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14929-disney-sing-it\n"}