{"altername_name": [], "name": "DJ Hero", "overview": "DJ Hero is a music video game, developed by FreeStyleGames and published by Activision as a rhythm game spin-off of the Guitar Hero franchise. It was released on October 27, 2009 in North America and on October 29, 2009 in Europe. The game is based on turntablism, the act of creating a new musical work from one or more previously recorded songs using record players and sound effect generators, and features 94 remixes of two different songs from a selection of over 100 different songs across numerous genres. To score points, the player must press buttons to activate accented beats, adjust their crossfade between the two songs, and \"scratch\" the turntable on the game's custom controller in time to marks that scroll on the screen to score points and perform well for the virtual crowd. The game features both a single player Career mode and cooperative and competitive multiplayer modes. The game also features a mode for selected songs for a DJ player to play alongside another player using a Guitar Hero guitar controller. Many DJ and mix artists have contributed to the game both in the game's development, the creation of mixes, and in lending their images for playable avatars in the game; these including DJ Shadow, Z-Trip, DJ AM, Grandmaster Flash, DJ Jazzy Jeff, and Daft Punk. DJ Hero was generally well received by game journalists, praising the departure from the Guitar Hero series-style of gameplay, the use of the turntable controller to simulate the motions of a DJ and how the game's difficulty curve helps the player to become skilled on it, and the game's soundtrack; several smaller issues were identified as potential improvements for a possible sequel. However, the game did not perform as strongly as expected by industry analysts, believed to be due to the waning interest in music games during 2009; regardless, DJ Hero is stated by NPD Group to be the highest-grossing new intellectual property of 2009 in North America.", "platform": "Nintendo Wii", "release_date": "October 27, 2009", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "3.07", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=uA0kSEdBygY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14938-dj-hero\n"}