{"altername_name": [], "name": "Final Fantasy Crystal Chronicles: Echoes of Time", "overview": "The idea of DS-to-Wii connectivity is something that interests me in a big, big way. Nintendo currently has the most popular console out there, but the company has also been dominating the handheld world for two decades, so it only seems natural that the two systems would converge into one superpower system, similar to how Voltron, the Power Rangers, or Constructicons form into something more amazing than the sum of their parts. Pretty much every piece of cool tech out there does it, so it's high time Nintendo does too. Right? Unfortunately, there hasn't been too hot of a track record, as GameCube's connectivity started and ended with Zelda and the original Crystal Chronicles, and now Wii's offering is less than stellar. Final Fantasy Crystal Chronicles: Echoes of Time is a great DS game on its own, but it's entirely a cop-out Wii package, and one that not only drops the ball on its own, but is also far from an ideal multiplayer offering from handheld to console. Looking for a great DS dungeon crawler? You've found it. Want to skip on the handheld and grab it on Wii? You'd be better off waiting for the real Crystal Chronicles later down the line. It isn't often I get to review DS and Wii games in tandem, but this is certainly a case where it's vital to do so, and the DS version destroys Nintendo's home console offering. Quite simply, Echoes of Time is 100% a DS port. After an oddly long load process, the Wii version of Crystal Chronicles runs a fully emulated version of the DS game, including everything from legal screens to the system's dual screen setup. The only difference for Wii cosmetically is that the + and – keys on the Wii-mote will resize the two screens on the fly. Wii IR is available for clicking on icons and entering text on the right (bottom) screen just as the stylus does on DS, but outside of that, it's the same game. Identical visuals, identical story, identical tech.", "platform": "Nintendo Wii", "release_date": "June 29, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Adventure", "max_players": "4", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8868-final-fantasy-crystal-chronicles-echoes-of-time\n"}