{"altername_name": ["Family Fishing"], "name": "Fishing Resort", "overview": "Fishing Resort is a fishing video game developed by Prope for the Wii home console. It features 8 different areas for the player to fish and do several \"activities\". Stores located in areas allow people to purchase items for fishing needs. Players can also take a cruiser and explore the ocean surrounding the \"island\" where the game takes place. Gameplay The game requires a Wii Remote with the Wii MotionPlus insert, along with a Nunchuck. The player lifts up the Wii Remote and then swings it down near water to \"cast\". The player picks from a range of rods, varying from Small to Xtra-Large, and a selection of baits and lures. There are more than 200 \"fish\" in the game, all of which are catchable by the player at various locations. Development and release Fishing Resort was developed by Prope, a Japanese company headed by former Sega designer Yuji Naka. Naka was approached by publisher Namco Bandai Games after it released We Ski for the Wii, requesting he create a fishing game in the same line. Naka initially declined because of his own disinterest in fishing, but chose to make the game when considering that there may be people like him who lack fishing knowledge and \"who may enjoy an accessible fishing game\". Rather than market the game to \"core fishing fans\" like many other games in the same genre, Naka aimed at making Fishing Resort accessible to a broader audience. \"It starts at the very beginning of the game where you come into a resort, a place where you’re going to spend a fishing vacation,\" Naka explained. \"The setting puts everyone at ease. You can relax or go fishing right away.\" Naka read books on fishing, as well as resort management, to design the game. Fishing Resort was officially released in Japan by Namco Bandai Games on August 4, 2011. In addition to its stand-alone release, the game was retailed as a combination pack containing both the game and a unique shell accessory which attaches the Wii Remote to the Nunchuk controller to more closely resemble a fishing rod and reel. Fishing Resort was published in North America by XSEED Games on November 22, 2011 in both forms at budget prices. Nintendo's Korean branch chose to publish the game in South Korea on August 1, 2013.", "platform": "Nintendo Wii", "release_date": "November 22, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Prope", "publishers": "Xseed Games", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "3.86", "wikipedia": "https://en.wikipedia.org/wiki/Fishing_Resort", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13223-fishing-resort\n"}