{"altername_name": ["Fragile: Sayonara Tsuki no Haikyo"], "name": "Fragile Dreams: Farewell Ruins of the Moon", "overview": "Seto is a young boy that is extremely special; he may be the last human being alive on the planet. In a post-apocalyptic world that's covered in fog and has lost its light, he searches abandoned cities tirelessly with a flashlight in hopes of finding other humans, any human. As Seto searches through these eerily calm and beautiful ruins of a civilization lost, he comes across a mysterious girl named Ren, who quickly scurries away from him despite possibly being the only other living human in the world. As he struggles to be reunited with Ren and search for other survivors, he must fight off the ghosts and demons that haunt this forsaken land while also piecing together the mystery of what brought about the disappearance of all mankind. • Emotional Story about Abandonment, Loneliness, and Redemption: The game's focus is on human drama as a boy wanders a post-apocalyptic world in search of answers and companionship. • Gorgeous Graphics and Lighting Effects: High production values bring the desolate but eerily beautiful world to life as lighting reflects realistically off environments to show all the minor details of a previously inhabited land. • Moving Musical Score: A haunting and inspired soundtrack help convey the full range of emotions of utter despair to finding small victories even when it appears all is lost. • Controls optimized for the Wii Remote: The Wii Remote is used as a flashlight and to control the direction of movement, while also serving another function as a proximity sensor to track invisible ghosts.", "platform": "Nintendo Wii", "release_date": "March 16, 2010", "game_type": "Released", "esrb": "T - Teen", "developers": "Tri-crescendo", "publishers": "Xseed Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Fragile_Dreams:_Farewell_Ruins_of_the_Moon", "video_link": "https://youtu.be/Zy0YpdZmoCc?t=3780", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7340-fragile-dreams-farewell-ruins-of-the-moon\n"}