{"altername_name": ["Guitar Hero Custom: Rock the Games", "Guitar Hero: Rock the Games", "Guitar Hero III: Rock the Games"], "name": "Guitar Hero III Custom: Rock the Games", "overview": "Song List Includes: Stage 1-1 --------- Megaman X6 - Gate Battlefield 1942 - Battlefield 1942 Theme Super Mario 64 - Bowser's Road Super Mario 64 - Powerful Mario The Legend of Zelda OoT - Lost Woods Stage 1-2 --------- Shadow The Hedgehog - Never Turn Back Sonic Adventure 2 - Escape from the City The Legend of Zelda OoT - Gerudo Valley Sonic Adventure 2 - It Doesnt Matter Banjo Kazooie - Spiral Mountain Stage 2-1 --------- Dynasty Warriors 3 - Yellow Storm Corey Vs. Corey - Katamari Damashii Earthbound - The Final Battle Super Mario 64 - Ultimate Bowser Kingdom hearts II - The 13th struggle Stage 2-2 --------- The Battle of Olympus - Theme of Helene Super Mario 64 - Slider Dynasty Warriors 4 - Eve F-Zero GP Legend - Lightning Golden Sun - Battle Remix Bonus Stage ----------- Megaman X - Chill Penguin Donkey Kong 64 - Aztec Boss Pokémon - Battle Dialga Palkia Megaman X4 - Double F-Zero - Mute City Stage 3-1 --------- Megaman X6 - Hi-Max Super Mario Bros. - Bowser's Castle Megaman X5 - Shadow Devil Metroid - The Perpetual Burn Top Gear - Top Gear Theme Stage 3-2 --------- Contra - Alien's Lair & Boss Music Final Fantasy IX - Hunters Chance Legend Of Zelda Twilight Princess - Midnas Desperation Final Fantasy VI - Battle Theme Final Fantasy VII - J-E-N-O-V-A The Final Destination --------------------- Doom - E1M1 Ninja Gaiden II - Ninja Gaiden II: Act 2 / Scene 2 The Red Wings - The Genius of Doctor Robotnik The Legend Of Zelda OoT - Gerudo Valley Doom 3 - Doom 3 Theme Bonus songs ----------- Super Mario Bros. - Main Theme Super Mario Bros. - Underground Theme Super Mario Bros. - Stage Opera Silent Hill - Silent Hill Opening Theme Silent Hill - Theme of Laura Okami - Reset Baten Kaitos - Violent Storm Beyond Good & Evil - Home Sweet Home Tales Of The Abyss - Karma Kingdom Hearts - Imaginary Depths Super Mario 64 - Penguin Cap Conker's Bad Fur Day - Mad Pitchfork Guilty Gear XX - Awe Of She Final Fantasy Crystal Chronicles - Kazenone C&C Renegade - Command & Conquer Castlevania II - No Flesh Allowed Castlevania - The Raven Battletoads - Surf City Metal Gear Solid - Metal Gear Solid Theme One Must Fall 2097 - One Must Fall 2097 Theme Resident Evil - The End of Heartache Kirby Superstar - Gourmet Race The Legend Of Zelda - Legend of Zelda Rock Final Fantasy VIII - The Loser The Legend Of Zelda ALAP - Dark World Overworld Theme Battletoads - Madd Murdock Duke Nukem - Duke Nukem Theme Super Smash Bros. Melee - Final Destination Super Smash Bros. Melee - Hyrule Temple Metal Gear Solid 4 Brawl Version - Theme of Love Ninja Gaiden - Minibosses Namco Sound Team - Black Winter Night Sky Dr. Mario - Dr. Maro theme Doom - Purgatory Final Fantasy XII - Electric De Chocobo Super Smash Bros. Brawl - The Final Destination Paper Mario 2 - Rawk Hawk Rock Powerglove - Blasting the Hornet Powerglove - Mario Minor Powerglove - So Sexy Robotnik Powerglove - Tetris Battletoads - Frosty Reception F-Zero - Big Blue Kirby Superstar - Sky High Mortal Kombat Deception - Slaughterhouse Jive Super Mario Bros. - Castle Theme Final Fantasy IX - Song of Memory Sonic The Hedgehog - Green Hill Zone Quake II - Quad Machine Sonic Heroes - Sonic Heroes Theme Metroid - Phendrana Drifts Guile Theme - Street Fighter II Tales of the Abyss - Promise The Legend of Zelda Majora's Mask - The Recollection of Zelda Kid Icarus - Kid Icarus Theme Mario Kart DS - Rainbow Road (Remix) Doom - E1M9 Sonic and Knuckles - Flying Battery Zone Glyn Williams - Nintendo Medley", "platform": "Nintendo Wii", "release_date": "2010", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Legendkiller Inc.", "publishers": "", "genres": "Music", "max_players": "2", "cooperative": "Yes", "rating": "3.78", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122994-guitar-hero-iii-custom-rock-the-games\n"}