{"altername_name": [], "name": "Hunting Challenge", "overview": "Hunting Challenge and its new accessory (a hinged barrel hunting gun using the nunchuck™ and the wiimote™) take up the challenge of making you live or relive the experience of real hunting in plains or swamps, with an immersion and reality quality never before achieved. With your weapon in your hand, binoculars hung around your neck, decoy in your pocket, and a hunting dog obeying your every order, move around in beautiful surroundings and get to know each species (whether they can be hunted or not) along with their favorite territories, habits and behaviors. Proximity, noise, weather conditions and wind direction are all settings that should be taken into account when planning to go hunting, while complying with all the hunting laws currently in effect. Main Features: * A new accessory imitating a real hunting gun (the barrel must be broken open in order to reload it!) * The first real hunting simulation on a new generation console * 2 kinds of hunting: Aquatic game hut hunting and hunting in plains. * Ball-Trap mode in bonus! * Set up your hunt according to your preferences: Hunting zones, weather conditions (mist, fog, rain), time of day. * Be attentive to the wind direction so that you don't alert the game. * Direct your hunting dog like you would do in reality! * 18 different hunting areas to choose from. * 11 species with explanations and advice for each of them: Mallard, coypu, deer, boar, stag, fox, goose, partridge, snipe, pheasant, rabbit… * A significant amount of information on current hunting laws.", "platform": "Nintendo Wii", "release_date": "September 18, 2009", "game_type": "Released", "esrb": "Not Rated", "developers": "Exkee", "publishers": "BigBen Interactive", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://m.youtube.com/watch?v=FwypY9eOt74", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82206-hunting-challenge\n"}