{"altername_name": ["Armin van Buuren: In the Mix"], "name": "In the Mix featuring Armin van Buuren", "overview": "Just like Armin, you will be able to excite the audience with their terrific sets. Armin van Buuren - In the Mix is playable in various game modes. They are: Tutorial The tutorial explains the basic principles of the game. There is a step-by-step explanation of the concept of mixing and other basic DJ skills. This quickly prepares the player for the most important part of the game: the Career Mode. Career Mode In Career Mode you follow the career path of the ultimate DJ; you start by spinning music in small clubs and, if you do it well, you can move on to spin at larger clubs, at festivals or even play in other countries! Give it your best shot and get tips from Armin van Buuren, who might even offer you a contract under the Armada label. You can perform at more than 30 venues in 15 cities worldwide. If your career takes off, you can earn more money, enabling you to purchase new and better DJ equipment, like new mixers, effect devices and similar. Party Mode In Party Mode you experience the excitement of being a DJ for a group of friends. You can't make any mistakes in this mode and choose the best tracks from the game or self-made numbers that are mixable with extra effects. Pick the atmosphere for the party and impress your friends with your DJ skills! Studio Mode In Studio Mode you find yourself in a real sound studio. Use all the available equipment and music elements from the game to make new numbers. You start off with a drum track, superimpose a baseline on it and finish by adding synthesisers, vocals and effects. The possibilities are virtually limitless. Quickplay In Quickplay Mode you get a standard set of DJ skills and equipment, an arbitrary set list will be generated and within no time you can experience all the action firsthand. It's the ideal way of quickly putting together an awesome dance session! Features: The first real DJ simulation for the home. 4 different modes, including an exciting career to become a world famous DJ. Create your own tracks in the Studio. More than 60 well-known tracks by Armin van Buuren and other artists, and more than 30 special remixes. No extra hardware required!", "platform": "Nintendo Wii", "release_date": "November 12, 2010", "game_type": "Released", "esrb": "", "developers": "TransGaming Technologies", "publishers": "Foreign Media Games", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "https://en.wikipedia.org/wiki/Armin_van_Buuren:_In_the_Mix", "video_link": "https://youtu.be/Z7q2CDkTA2Y", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72417-in-the-mix-featuring-armin-van-buuren\n"}