{"altername_name": [], "name": "Ivy the Kiwi: Mini", "overview": "The full retail versions of Ivy The Kiwi? for the Wii and Nintendo DS have 100 levels, while the mini version available for DSiWare only has 50 levels. While the game originally began development as a WiiWare game, that version was cancelled as Yuji Naka began adding more features and ideas. The objective in the game is to lead the character, Ivy, a newly born bird, to her lost mother. The game is similar to Kirby: Canvas Curse because the player does not directly control the main character. In the game, Ivy is constantly moving directly right or left, unless presented with something in her way, in which case she turns around and moves the other direction. The player takes advantage of this by drawing lines to guide the chick away from danger and to the goal. The player can make ramp lines to have Ivy walk up or down, make vertical lines to reverse her direction, or pull the vines and slingshot Ivy in a given direction. Ultimately, the player must lead Ivy away from obstacles such as spikes or rats and to the end goal. The game features several different modes. The main game is where levels are simply played in order. Another mode lets the player play any level that has been previously played in the main game to try and beat the high scores. There are also two different ways to play multiplayer. One is the competitive multiplayer mode, where up to four players can compete to see who can get their Kiwi to the goal the fastest, the tricky part being that any player can interact with any other player's Kiwi as well. Separately from this mode, at any point, up to four players can choose to play cooperatively to help the first player in the main game. According to lead designer Yuji Naka, there are various reasons that the game's unusual title has a question mark. Reasons include piquing curiosity in potential players to pick up the game, as well as playing a role in the game's story regarding Ivy's identity.", "platform": "Nintendo Wii", "release_date": "", "game_type": "Unreleased", "esrb": "RP - Rating Pending", "developers": "Prope", "publishers": "Namco Bandai Games", "genres": "", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Ivy_the_Kiwi%3F#Version_differences", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126739-ivy-the-kiwi-mini\n"}