{"altername_name": ["実況パワフルメジャーリーグ2"], "name": "Jikkyou Powerful Major League 2 Wii", "overview": "A baseball game. While the graphics and especially the athletes are not at all realistic, the game still has a strong focus on statistics and the simulation aspect. For example the tactics of each athlete can be changed in detail, there are about 75 skills which change the athletes' abilities and there is extensive statistical tracking for the player's performance as well. On the field the game uses relatively simple two button controls, e.g. swinging is a matter of positioning the bat in the strike zone and hitting a button. The Wii version features limited motion controls, but only in exhibition matches and home run derby. Success mode is the heart of the game: in this mode the player creates a single athlete and follows his way to the top. During this mode the player needs to choose how to utilize the given time, for example with different training exercises. Training eventually awards a level-up and the possibility to improve statistical values. However, there is also the personal life to take care of (which also affects other statistics such as popularity). This is especially important during the first three years when the player character is still in college: here a significant portion of time has to be spent with studying (failing college will end the career early!) or with a part-time job for money. The earned pay can be spent on items (e.g. to restore vitality which limits what can be achieved in a day) or better equipment. At some points there are special events where the player has to make decisions (e.g. answering a request from the girlfriend or the offer to become the team's captain). However, the available options are limited by the available fate cards - for example, two \"yes\" cards result in the option to answer \"yes\" twice. The other playing modes are more traditional: exhibition (a single match), practice, league (with up to six teams), season (the player comes the general manager of a team for ten years) and home derby. There is also a shop where the player can purchase baseball cards (report cards of the included licensed MLB athletes) with Power Major Points. Those are earned after certain game events, e.g. playing an exhibition match or completing success mode. All aspects of the game (pitching, fielding, batting, base-running and management) can be assigned to the AI.", "platform": "Nintendo Wii", "release_date": "October 4, 2007", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163452-jikkyou-powerful-major-league-2-wii\n"}