{"altername_name": [], "name": "Jungle Kartz", "overview": "The race is on to become king of the jungle in Jungle Kartz, the new all-action racing game where all the fun takes place on a tropical island. Race as 8 fun-loving animal characters, each with their own special abilities, and speed across 32 unique tracks in Quick Race, Time Trial or Tournament mode, as you take on all-comers in a frantic race to the finish line. With eight different karts to choose from and nine hilarious power-ups to collect and use, including Speed Boost, Time Warp and Pineapple Rocket, it’s time to experience the thrill of racing Jungle style! Jungle Kartz will bring out the animal in you! Exclusively on Wii™. Features: • Jungle themed arcade racing action! • 8 fun loving animal characters, Race as Sass, Zero, Gus, Ashley, Sal, Dixie, Rocky or Bob, each with their own special abilities and a home track advantage. • 4 player multiplayer racing! • 3 different game modes; Quick Race, Time Trial and Tournament. • 8 different karts to race, from light rapid karts, to big powerful speed machines, each with their own individual look. • 8 challenging environments each with 4 tracks; (32 tracks to race in total). • Tropic Bay – An island paradise zone of bamboo huts, palm trees, ferns and sandy beaches. • Arctic Point – A glacial zone of toboggan runs, igloos, frozen waterfalls and icebergs. • Deep Forest – A dark and overgrown rainforest zone with huge trees, vines and exotic plants. • Rift River Valley - A rolling savannah of tall golden grasses and shady Acacia trees. • Cinder Flow – The lava flows of Fire-top Mountain. • Homestead Ranch – Rolling hills, red and white farm buildings and tall corn fields. • Redstone Canyon – A deep canyon of meandering rivers. • Ra Desert – A hot and dusty region of pyramids, sand dunes and cloudless skies. • 9 hilarious pickups; Speed Boost (A temporary speed increase), Time Warp (Give you a speed boost and slows down time), Blow Pipe (Fires a wall of explosive darts), Pineapple Rocket (An explosion of tropical flavour), Spider Web (slows the kart that rides over it) , Ice Puddle (Freezes the kart that rides over it), Explode Leaders (Blows up the top 3 racers) and Shield. • 2 secret unlockable karts to discover.", "platform": "Nintendo Wii", "release_date": "November 18, 2011", "game_type": "Released", "esrb": "", "developers": "Brain in a Jar", "publishers": "Nordic Games", "genres": "Racing", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/159512-jungle-kartz\n"}