{"altername_name": ["Just Dance 2: Extra Songs"], "name": "Just Dance: Summer Party", "overview": "The good times of summer just wouldn't be the same without good music to go with them. Just Dance throws a Summer Party with 20 hot new hits just in time for the hottest time of the year. Selections include groove-friendly favorites like Mambo No. 5, Firework, and Pon De Replay, all perfect for setting that summertime vibe. All it takes to start the show is your Wii Remote. Create a crew or go head-to-head in Dance Battles, play all the songs continuously for a Dance Party, or sneak in a workout without knowing it in Exercise in Disguise. Song List Includes: 1. Katy Perry - Firework 2. A R Rahman, The Pussycat Dolls Featuring Nicole Scherzinger - Jai Ho! (You Are My Destiny) 3. Rihanna - Pon De Replay 4. Estelle Featuring Kanye West - American Boy 5. The World Cup Girls - Futebol Crazy 6. Studio Allstars - Maniac 7. Sweat Invaders - Skin-to-Skin 8. Blur - Song 2 9. Panic At The Disco - Nine In The Afternoon 10. M/A/R/R/S - Pump Up The Volume 11. Sweat Invaders - Funkytown 12. Steppenwolf - Born To Be Wild 13. NIck Phoenix and Thomas Bergersen - Professeur Pumplestickle 14. Countdown Dee's Hit Explosion - Barbie Girl 15. The Hit Crew - Here Comes the Hotstepper 16. Love Letter - Why Oh Why 17. Carl Douglas - Kung Fu Fighting (Dave Ruffy/Mark Wallis Remix) 18. The Supremes - You Can't Hurry Love 19. The Reverend Horatio Duncan & Amos Sweets - Down by the Riverside 20. A Band of Bees - Chicken Payback 21. V V Brown - Crying Blood 22. The Lemon Cubes - Mambo No. 5 (A Little Bit of Monika) 23. The Lemon Cubes - Moving On Up", "platform": "Nintendo Wii", "release_date": "July 19, 2011", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Ubisoft Paris", "publishers": "Ubisoft Entertainment", "genres": "Music", "max_players": "8", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=7QLdVGqh75M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8507-just-dance-summer-party\n"}