{"altername_name": ["Éxito en Primaria: Matemáticas - Curso 1-4"], "name": "Lernerfolg Grundschule: Mathematik Klasse 1-4", "overview": "Playful learning math! The multi-award-winning learning series »Learners' Training is finally coming to the Wii ™. With \"Learners' Reunion: Mathematics\", elementary schoolchildren can train mathematics without any pressure. The little vampire Freddy leads her through every task and helps if it gets too difficult. On the basis of ten different subject areas, the pupil deals with the teaching material of the first four primary school classes and can thus always solve his / her age-related task types. Whether subtraction and addition, shopping, calculating with size or the time - the tasks are varied and adapted to the current curricula of the schools. Thanks to Tivola, a great learning experience in the home: With the Wii ™ remote control and the nunchuck in the hand, bill newcomers can tackle the many different learning contents of the primary school math quite comfortably in front of their own television. The easy and intuitive operation ensures that the students are already familiar with the first game. If you solve many tasks correctly, you can play great bonuses - this motivating game principle, along with loving illustrations, has proved itself since the beginning of the learning game series and makes math learning a great pleasure.", "platform": "Nintendo Wii", "release_date": "October 28, 2010", "game_type": "Released", "esrb": "", "developers": "Tivola", "publishers": "Tivola", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.google.ch/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwj64PDTyf_UAhXBWxoKHRTED2IQtwIIJzAA&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DNGy1t2E3F4g&usg=AFQjCNGtJxEHrFwvhj_fz3ivFdEjs5GXSw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82328-lernerfolg-grundschule-mathematik-klasse-1-4\n"}