{"altername_name": [], "name": "Let's Sing @ Radio Italia", "overview": "Per la prima volta gli artisti più giovani insieme agli \"intramontabili\" della musica italiana. Canta le tue canzoni preferite di star come Luciano Ligabue, Laura Pausini, Eros Ramazzotti , Alessandra Amoroso e Marco Mengoni con Let's Sing @ Radio Italia. Potrai scegliere tra varie modalità di gioco come il Duetto, il Co-Op e anche il Testa a Testa con i tuoi amici. Caratteristiche: Alta precisione del riconoscimento vocale. Risultati più accurati basati sulla dettatura, la dinamica, il ritmo e l'intonazione, assicurando ai giocatori più abili le migliori ricompense per i loro sforzi. Funzione aiuto per i cantanti alle prime armi. Il microfono (venduto separatamente) è indispensabile per poter giocare. Canzoni: 883 - Nord Sud Ovest est Alessandra Amoroso - Senza Nuvole Alex Britti - Solo Una Volta Annalisa - Senza riserva Arisa - Malamoreno Carmen Consoli - Amore di Plastica Cesare Cremonini - Dicono di Me Eros Ramazzotti - Più bella cosa Eros Ramazzotti - Un'emozione Per Sempre Francesco Baccini e Ladri Di Biciclette - Sotto Questo Sole Francesco Renga - La tua bellezza Gianluca Grignani - Destinazione Paradiso Giorgia - Come saprei Irene Grandi - Alle porte del sogno Irene Grandi - Bambine cattive Laura Pausini - Benvenuto Ligabue - Certe Notti Ligabue - Un colpo all'anima Marco Mengoni - L'essenziale Mario Venuti feat Carmen Consoli - Mai come ieri Max Gazzè - Una Musica può fare Negrita - Gioia Infinita Negrita - Magnolia Nek - Lascia che io sia Nina Zilli - Bacio D'a(d)dio Noemi - Vuoto a Perdere Paola Turci - Sai che è un attimo Pino Daniele - Dubbi non ho Pino Daniele - Neve al sole Raf - InTutti I Miei Giorni", "platform": "Nintendo Wii", "release_date": "2015", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Deep Silver", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371296-lets-sing-radio-italia\n"}