{"altername_name": [], "name": "Let's Sing 8 - Versión Española", "overview": "Let’s Sing 8 Versión Española es la nueva entrega de la célebre franquicia de karaoke Let’s Sing, que regresa con 35 grandes éxitos del panorama nacional e internacional y más voces que nunca. Tú eres la voz y la estrella en Let’s Sing 8 Versión Española, demuestra lo que vales con tu mejor actuación en familia y disfruta interpretando todo tipo de bombazos musicales de artistas de primera fila con vídeos originales. Lista de canciones: Alejandro Sanz - Corazón Partío Cali Y El Dandee - Yo Te Esperaré Chayanne - Humanos A Marte Danza Invisible - Sabor De Amor David Bisbal - Si Pero No Duncan Dhu - Cien Gaviotas Fangoria - Ni Tú Di Nadie Gemeliers - Lo Mejor Está Por Venir Henry Méndez & Dulce María - No Regresa Más Laura Pausini - Entre Tu Y Mil Mares Loquillo y los Trogloditas - Cadillac Solitario Manuel Carrasco - No Dejes De Soñar Nino Bravo - Un Beso Y Una Flor Pablo Alborán - Por Fin Pablo Alborán - Pasos De Cero Ricky Martin - Adiós Romeo Santos - Eres Mía Sofía Reyes - Muévelo Vanesa Martín - Frenar Enero Martina Stoessel - Hoy Somos Más Wisin - Que Viva La Vida Xriz - Miénteme Xuso Jones - Todo Lo Que Tengo Melendi - La Promesa David Bisbal - Culpable Laura Pausini Y Alejandro Sanz - Víveme Rosana - El Talismán Celtas Cortos - Cuéntame Un Cuento Nicky Jam & Enrique Iglesias - El Perdón Nicky Jam - Travesuras Mark Ronson feat. Bruno Mars - Uptown Funk Coldplay - A Sky Full Of Stars Calvin Harris - Summer Sam Smith - Stay With Me Lady Gaga - Applause", "platform": "Nintendo Wii", "release_date": "October 9, 2015", "game_type": "Released", "esrb": "", "developers": "Ravenscourt", "publishers": "Deep Silver", "genres": "Music", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371320-lets-sing-8---version-espanola\n"}