{"altername_name": [], "name": "Let’s Sing 2016: Hits Français", "overview": "A vos micros… Prêts… Chantez ! Et en français! Enfin un jeu de chant dédié à la chanson française ! Avec Let’s Sing 2016 : Hits Français, retrouvez 35 hits de vos artistes préférés dont Louane, Kendji Girac, M. Pokora, Shy’m, Vianney, Tal et Zaz. Branchez vos micros, chantez avec vos amis ou en solo sur Wii™ compatible Wii U™ (jusqu’à 4 joueurs) et découvrez de nombreux modes de jeu ! La première expérience musicale avec près de 30 hits français : Interprétez les derniers succès de vos chanteurs préférés, mais aussi quelques grands classiques de la chanson française, il y en a pour tous les goûts ! Chantez avec vos amis : Let’s Sing 2016 : Hits Français est un jeu musical jouable à 4 en simultané et incluant de nombreux modes de jeu Une technologie de pointe : Depuis 2005, Voxler cherche à offrir la meilleure expérience de jeu musical, basée sur une excellente technologie de jeu de chant, une reconnaissance Modes de jeu: - SOLO – 1 joueur: Chantez une chanson et affinez vos talents - DUEL – 2 à 4 joueurs: Jouez contre vos amis et battez-les à plate couture en obtenant le meilleur score - COOP – 2 à 4 joueurs : Jouez avec l'esprit d'équipe ! Donnez la performance de votre vie en compagnie de vos amis. - DUO – 2 à 4 joueurs: Chantez et partagez une chanson avec vos amis. - MODE DE JEU SURPRISE: Connaissez-vous vos chansons ? Affichez votre savoir dans le mode de jeu Surprise, où les paroles disparaîtront au cours de la partie Liste des chansons: - \"Libérée Délivrée\" d’Anaïs Delva - \"Je Suis Tombé Sous Le Charme\" de Christophe Maé - \"Avenir\" de Louane - \"Double Je\" de Christophe Willem - \"Chandelier\" de Sia - \"Le Graal\" de Kyo - \"Tourner La Page\" de Zaho - \"Andalouse\" de Kendji Girac - \"Bella\" de Maître Gims - \"Boum Boum Boum\" de Mika - \"SOS\" d’Indila - \"Désolé\" de Sexion d’Assaut - \"Cosmo\" de Soprano - \"Soulman\" de Ben L’Oncle Soul - \"Le Portrait\" de Calogero - \"L’Amour à La Machine\" d’Alain Souchon - \"Juste Une Photo De Toi\" de M.Pokora - \"Femmes… Je Vous Aime\" de Julien Clerc - \"Mistral Gagnant\" de Renaud - \"Belle Ile En Mer\" de Laurent Voulzy - \"Le Jerk\" de Thierry Hazard - \"Mirza\" de Nino Ferrer - \"Pas Là\" de Vianney - \"On Ira\" de Zaz - \"Le Sens De La Vie\" de Tal - \"Et Alors\" de Shy’m - \"Sur Ma Route\" de Black M - \"Dernière Danse\" de Indila - \"J’me Tire\" de Maître Gims - \"Clown\" de Soprano - \"Hoy Somos Más\" de Martina Stoessel - \"A Sky Full of Stars\" de Coldplay - \"All Of Me\" de John Legend - \"Uptown Funk\" de Mark Ronson Feat. Bruno Mars - \"All About That Bass\" de Meghan Trainor", "platform": "Nintendo Wii", "release_date": "November 6, 2015", "game_type": "Released", "esrb": "", "developers": "Voxler", "publishers": "Ravenscourt", "genres": "Music", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=HH2OOjcX2p4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371321-lets-sing-2016-hits-francais\n"}