{"altername_name": [], "name": "Madden NFL 11", "overview": "Madden NFL 11 is the 22nd version of EA Sports' classic video game football franchise. Featuring cover athlete Drew Brees, Super Bowl XLIV MVP and quarterback for the New Orleans Saints, Madden NFL 11 incorporates a blend of simpler, quicker and deeper new features with time-tested classic features expected from a game in the Madden franchise. Features included in the Wii version include Franchise mode, the all-new GameFlow system for ease of play calling, a four-player party mode and more. Madden NFL 11 reenergizes the game of football with a fun, exhilarating experience that ignites the passion of any NFL fan. Experience a revamped Franchise mode that puts you at the helm of your favorite NFL team, giving you the power to lead the greatest dynasty of all time in the deepest single player experience to date. In addition, new players can get up to speed quickly utilizing the all-new GameFlow system, in which the plays are called for you until you're ready to take the snap from your center on your own. Lead your team to glory with Madden NFL 11, the ultimate NFL experience on Wii. Key Game Features Crash the NFL Party - Crown a king of the couch in the four-player party mode featuring custom gameplay tweaks and an interactive pick 'em system, or use the Wii Remote to pick up blocks, trip up wide receivers, and create clear paths to the end zone, all while your teammate runs the plays. GameFlow System Play Calling - Designed for new players, The GameFlow System calls plays for you until you feel that you are ready to call them yourself. More details to come...", "platform": "Nintendo Wii", "release_date": "August 10, 2010", "game_type": "Released", "esrb": "E - Everyone", "developers": "EA Tiburon", "publishers": "EA Sports", "genres": "Sports", "max_players": "4", "cooperative": "Yes", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Madden_NFL_11", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/3129-madden-nfl-11\n"}