{"altername_name": ["Marbles! Balance Challenge", "Kororinpa: Marble Saga", "Kororinpa 2: Anthony to Kin'iro Himawari no Tane"], "name": "Marble Saga: Kororinpa", "overview": "In Marble Saga: Kororinpa, the player tilts the playing field, using the Wii Remote to navigate a spherical object around mazes to reach the end goal, similar to Kororinpa: Marble Mania, the preceding title. Players have also drawn similarities to the Super Monkey Ball series. Some mazes cause the player to tilt them in such a way so that a wall becomes a floor, or to interact with objects such as magnets, conveyor belts, or cannons. Depending on the difficulty level, different collectibles are available in each level. On all difficulty settings, players must collect the Yellow Crystals to complete the level. In Easy and Normal Mode, players must also collect the Stump Temple Pieces in order to unlock the game's final level. Also in Normal Mode, players can collect Green Emeralds which will unlock secrets, such as new marbles or Junk for use in creation of new level editor parts. In the highest difficulty setting, players must retrieve the Colony's missing ants from each level. In addition to the collectibles, players may be awarded with bronze, silver, gold, or platinum trophies for completing levels within a predetermined amount of time. Obtaining these trophies will also unlock new balls. The game features 7 different worlds with a variety of gadgets to help players through their journey. The game features 150+ levels with a variety of collectibles available in each mode including, Yellow Crystals, Green Emeralds, Stump Temple Pieces, and eventually ants from Anthony's colony. New features for Marble Saga: Kororinpa include increased customization elements in the game. Players can design their own marble by assigning it certain attributes and techniques, and they can even place their own Mii inside the marble. A brand-new level editor has been included, allowing players to share their creations through WiiConnect2", "platform": "Nintendo Wii", "release_date": "March 17, 2009", "game_type": "Released", "esrb": "E - Everyone", "developers": "Hudson Entertainment", "publishers": "Konami", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4.09", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14659-marble-saga-kororinpa\n"}