{"altername_name": ["Super Mario Stadium Family Baseball"], "name": "Mario Super Sluggers", "overview": "Mario Super Sluggers, the sequel to Mario Superstar Baseball, continues the arcade-style gameplay of Mario sports games. Mario and friends are invited to the Baseball Kingdom to play games against each other. When Bowser hears this, he immediately interrupts the party. There are several game modes to choose from like in the previous game. In Exhibition mode, players play a single game against each other. Players can choose different options such as how many innings to play, if captains can use star powers (each captain has a different star swing and pitch), and toggle error items off and on (error items can be thrown at fielders). The single-player Challenge mode is different this time around. Instead of choosing a team captain, players start with Mario who must find teammates to take on Bowser Jr. and Bowser. Teammates aren't unlocked by playing a game rather they only join the team by clearing certain objectives. Most of the action takes place on areas with an overhead perspective; each area is based around a team captain. Each captain has a special ability to find teammates and coins, which are used to buy items to aid in the quest or in a game against Bowser Jr. or later against Bowser. More coins can be gotten in minigames. Toy Field mode is slightly different to the one featured in Mario Superstar Baseball. Like in the GameCube game, players take turns batting to get points; a turn is granted to whomever grabs and holds the ball after a certain amount of time has passed. Unlike in the previous game, however, fielders can attack each other to steal the ball away from whomever has it. The batter can also throw items at the fielders to cause them to drop the ball and grant the batter another turn.", "platform": "Nintendo Wii", "release_date": "2008", "game_type": "Released", "esrb": "E - Everyone", "developers": "Bandai Namco Games", "publishers": "Nintendo", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.76", "wikipedia": "https://en.wikipedia.org/wiki/Mario_Super_Sluggers", "video_link": "http://www.youtube.com/watch?v=w0kp0L_r1l4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7361-mario-super-sluggers\n"}