{"altername_name": ["Mario & Sonic op de Olympische Winterspelen", "Mario & Sonic bei den Olympischen Winterspielen", "Mario y Sonic en los Juegos Olimpicos de Invierno", "Mario & Sonic aux Jeux Olympiques d'Hiver", "Mario & Sonic at Vancouver Olympic"], "name": "Mario & Sonic at the Olympic Winter Games", "overview": "Mario & Sonic at the (Vancouver 2010) Olympic Winter Games retains the gameplay mechanics of its predecessor, controlling an on-screen character through authentic Olympic events with the specific tailored controls for the Wii and DS. Unlike its predecessor, some of the events in the Wii game can use the Balance Board accessory, but it is not a requirement. All of the playable characters from the previous game return in addition to four new characters. It has been announced via the Nintendo Channel, that this game will have WiiConnect24 capability and the player can use their Miis in-game. A new feature added to the player's Mii is the ability to customize the Mii's clothes.The sequel introduces a Festival mode in the Wii version that allows the player to make their way through the entire Olympic Games, from opening ceremony to closure.The multiplayer mode offers \"co-op and competitive gameplay\" whereas the DS version will use its wireless capabilities. The DS counterpart has \"Adventure Tours\" where players can accept quests and challenge bosses and to stop Dr. Eggman and Bowser before they can stop the Olympics by kidnapping the Snow Spirits. DS Download Play is possible for those without an individual copy of the game.", "platform": "Nintendo Wii", "release_date": "October 13, 2009", "game_type": "Released", "esrb": "E - Everyone", "developers": "Sega", "publishers": "Sega", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.72", "wikipedia": "https://en.wikipedia.org/wiki/Mario_%26_Sonic_at_the_Olympic_Winter_Games", "video_link": "https://youtu.be/N0ok9upwGPM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4907-mario-sonic-at-the-olympic-winter-games\n"}