{"altername_name": [], "name": "Marvel Super Hero Squad: The Infinity Gauntlet", "overview": "Hulk and Iron Man go shopping in Outer Space to get boots for Thor's birthday. At some point the boots are mixed up with the Super-Skrull's laundry, so the two Squaddies follow him. When Thanos receives a box containing The Infinity Gauntlet, he finds out that Iron Man and Hulk are within his ship. After a battle with Super-Skrull, the Squaddies escape back to the Helicarrier. Iron Man notifies the rest of the squad that they must find all of the Infinity Gems before Thanos does. While Iron Man makes his speech, Doctor Doom, Silver Surfer, Nebula and Loki listen in. Falcon and Thor retrieve the Rhythm Gem from Hercules, which is later revealed to be a fake gemstone with Loki and the Enchantress hidden inside. Hulk and She-Hulk retrieve the Mind Gem from Nightmare. Invisible Woman and Nova are sent to the Negative Zone to get the Time Gem from Nebula and Annihilus. Iron Man and Wolverine get the Soul Gem from the Grandmaster. Scarlet Witch and Quicksilver move throughout Asteroid M in order to retrieve the Space Gem. Spider-Man and Reptil later go and retrieve the Reality Gem. Wolverine and Black Widow later pay a visit to the Skrull Throne World where they meet the Silver Surfer as he reveals that Galactus is planning to consume the world. They successfully stop Galactus. Meanwhile, the Helicarrier goes under an attack and the squad loses the Infinity Gems to Thanos. Later on, the Squaddies defeats Thanos, but Silver Surfer steals the Gemstones. He becomes the Dark Surfer, and each squad member (with the exception of Spider-Man) with the same factor team up together to stop Dark Surfer (as he splits himself up into six). Sometime, later as Thor receives his boots, he later finds out that Loki has put a hex on them, so Thor must dance for eternity. Ending the game, Iron Man and Hulk plan to return the boots.", "platform": "Nintendo Wii", "release_date": "November 16, 2010", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Griptonite Games", "publishers": "THQ", "genres": "Beat 'em Up", "max_players": "4", "cooperative": "Yes", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Marvel_Super_Hero_Squad:_The_Infinity_Gauntlet", "video_link": "https://www.youtube.com/watch?v=vABPybwM_8k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/103212-marvel-super-hero-squad-the-infinity-gauntlet\n"}