{"altername_name": ["Mary King's Reitschule: 2nd Edition", "Mary King's Riding School 2"], "name": "Mary King's Riding School 2", "overview": "All the excitement and spectacle of Three Day Eventing is galloping onto your Wii console, courtesy of British Olympic hopeful, Mary King! Start your career in Three Day Eventing, including daily training sessions with your horses to ensure you’ll make the grade on competition day. Experience Show Jumping, Cross Country and Dressage events with stunningly realistic animation and an incredibly intuitive control system that puts you right in the saddle. Skilled riding, dedicated training and meeting your horses’ needs are a must if you’re to move up from the regional heats to the heights of international competition. You and your horse must work together to improve your skills and bring home the glory! * Incredibly deep Career modes in Show Jumping, Dressage or Three Day Eventing with endless replayability. * Work your way up through Regional, National and International career divisions. * Fully realised Training modes in all disciplines. Improve on weaknesses and build on your strengths to make your horses world beaters. * Free Round mode allows you to jump straight into the action in dozens of Show Jumping, Cross Country and Dressage events for all abilities. * Fully customise your horse and rider with dozens of outfits and equipment. Unlock extra equipment by training and winning competitions.", "platform": "Nintendo Wii", "release_date": "September 11, 2009", "game_type": "Released", "esrb": "", "developers": "Midas Interactive Entertainment", "publishers": "Ghostlight", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://www.google.ch/url?sa=t&rct=j&q=&esrc=s&source=video&cd=1&cad=rja&uact=8&ved=0ahUKEwii_r7NuoTVAhVqLcAKHaiRDyoQtwIIIzAA&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DumPXS8SMcqA&usg=AFQjCNEIceNv5OTNTKa3uuZSus9VKH9BOg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82379-mary-kings-riding-school-2\n"}