{"altername_name": ["Metroid Other M Maxximum Edition"], "name": "Metroid: Other M: Maxximum Edition", "overview": "Metroid: Other M-Maxximum Edition-, the first Other M hack project beyond Samus recoloring to release to the public! This hack's additions are mostly on the modest side, however, I think you'll find that they add a lot to the game to create the Other M experience we as a community hoped for and deserved 11 years ago. The goal of this hack is to take the base game, and give it a set of changes to bring it more in line with what the community would have wanted, without straying too far from what's already there. For decades, Samus Aran has been known as one of the first female protagonists in video games, and one of the most enigmatic. Having traded her haunted past for the solitary life of a bounty hunter, Samus™ finally tells her own tale in this revealing, personal story of her failings, her flaws and ultimately her motivation. The story begins immediately following the events of Super Metroid, when a baby Metroid gave its life to protect Samus. With voice acting and a rich story, players learn the engaging backstory of Samus as she weaves through an action-packed adventure aboard the Bottle Ship, a decommissioned space facility. As she hurtles into this new adventure, Samus will encounter her first mentor and Commanding Officer of the Galactic Federation, Adam Malkovich. • An unprecedented collaboration that blends the slick, action-packed production of the world-renowned Team Ninja development team with the game design talents of the creators of the original Metroid. • A dramatic new direction for a legendary franchise and a bold new blend between cinematics, storytelling and the best in interactive entertainment.", "platform": "Nintendo Wii", "release_date": "July 11, 2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Team Ninja, J.Hardy", "publishers": "", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151577-metroid-other-m-maxximum-edition\n"}