{"altername_name": [], "name": "Mini Ninjas", "overview": "Long ago, after the Evil Samurai Warlord was banished the first time, an era of peace and tranquility descended upon the empire for more than 300 years. The dark castles he had built were abandoned and slowly fell into ruin and the villagers across the countryside no longer lived in fear. As the years went by, the secret of the powerful Kuji magic was hidden away in ancient shrines, and the people of the villages and towns went back to farming and going about their daily lives. Then one day, something changed. Terrible storms began to brew over the mountain on the distant horizon. Floods and earthquakes began to appear in the flatlands. looking down from the mountain - where the ninjas once lived and trained, The Ninja Master could see that something had been terribly wrong with the world. animals were seen fleeing for their lives. some spoke of Mysterious figures hunting and caging animals for some unknown purpose. The truth was that the Evil Samurai Warlord had returned, and had started raising an army of evil minions to aid him taking over the world. He had began to use the forbidden Kuji magic to twist innocent animals, transforming them into mindless samurai warriors. the warlord would send them forth to recapture his dark castles of old and use them as bases for terrorising the surrounding country side. But there was just one flaw in his path, by using the Kuji magic for evil purposes, the Evil Samurai Warlord was once again upsetting the balance of nature, bringing the wrath of the gods down upon the earth in the form of ravaging storms. The larger his armies grew, the worse the storms became.", "platform": "Nintendo Wii", "release_date": "September 8, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "IO Interactive", "publishers": "Eidos", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.77", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5083-mini-ninjas\n"}