{"altername_name": ["My Fitness Coach: Get in Shape", "Mon Coach Personnel: Mon Programme Forme et Fitness", "My Fitness Coach: Get in Shape", "Mein Fitness-Coach: Gut in Form"], "name": "My Fitness Coach", "overview": "The player is led by a virtual personal fitness coach named Maya (voiced by Yumi Lee, who is also credited for workout design and modeling. Prior to the first workout, a player must complete a fitness assessment—the player is asked to record their resting heart rate, then, following 2 minutes of jumping jacks, is asked to record their heart rate again. This data is used to approximate the relative intensity of the physical activity of completing that set of jumping jacks. This is then used to determine what types of exercises Maya will ask the player to complete during her exercise routine. The fitness assessment also records the player's self-reported weight and evaluates strength and flexibility. Core strength is measured by the amount of sit-ups (a maximum of 40) the player can complete; lower-body strength is measured by the number of squats (a maximum of 60) the player can complete, and upper strength is measured by the number of push-ups (a maximum of 40) the player can complete. Flexibility is measured on a 1-7 scale by how far the player can reach forward when seated with the legs stretched out in front with feet flexed. On every 10th workout, the player will repeat this fitness evaluation as a Physical Challenge. This results in a dynamic workout program that changes with the player's physical fitness level and ability. Based on the results of each Physical Challenge, Maya will suggest one of 5 areas a player can choose to emphasize in—Weight Loss, Cardio, Upper Strength, Core Strength, and Lower Strength. In addition to this, Maya will also suggest an emphasis for each workout a player initiates. In addition to these workout options, the player can choose to do Yoga by selecting the Meditation Garden. Once a workout is selected, the player can choose the duration of her workout—15 minutes, 30 minutes, 45 minutes, or 60 minutes. The duration is a rough estimate, with the workouts often being a few minutes longer due to additional time spent warming up and stretching. The player can then choose a virtual environment to work out in as well as what genre of background music to listen to—only a few environments and music genres are available at first, but, as the player keeps consistent with her schedule, more are unlocked. The game includes over 500 types of exercises, although some exercises with variable repetitions are counted as separate in this tally. Furthermore, if the player owns an exercise ball, hand weights, an exercise step, or a heart rate monitor, Maya can incorporate these into the program. At certain sections of the routine, Maya will stop to ask how the player is doing; the player's selection of one of three replies will affect whether the program strengthens, weakens, or leaves the current regimen as it is.", "platform": "Nintendo Wii", "release_date": "December 2, 2008", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Respondesign", "publishers": "Ubisoft", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=iDYwPNwWtLs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12806-my-fitness-coach\n"}