{"altername_name": [], "name": "NBA Jam", "overview": "NBA JAM for Wii is an unique multiplayer arcade style basketball game that mixes the over-the-top fun of the original old school coin operated two-on-two game, and later console versions, with slick modern NBA characters and stylings. Designed with the Wii in mind, along with a distinct visual style incorporating specific player likeness', this version of the game contains a variety of game modes not found in other console versions, as well as a variety of controller support options, unlockables and representation from every team in the league. The Return of Classic Arcade Basketball Featuring the sights and sounds that fans of the franchise will instantly recognize, EA Sports' NBA JAM mixes old school and new school round ball stylings to deliver a one-of-a-kind sports presentation on the Wii. In this all-new arena for the game, shoves, spins and of course, backboard smashing dunks take center stage in the classic two vs. two gameplay that lies at the core of NBA JAM. In these battles, every team in the league is represented, with your favorite NBA marquee players from each ready to do your bidding in the paint, in transition and maybe, even on D. Specific to the Wii, players can choose from all new motion controls as you flip the Wii Remote on its side, or plug in the Classic Controller or Classic Controller Pro and jump in using classic controls and play option. Over-the-top NBA arcade action awaits, as well as few special appearances on the hardwood that NBA fans must see to believe. Distinct Art Style In addition to frenetic MVP action, NBA JAM brings photo realism to the Wii. Unmatched player likeness and reactions exaggerate the outrageous moves that make up the core JAM experience, elevating the already intense gameplay to new heights. Couple all this with a wealth of game modes, classic JAM gameplay, and loads of real NBA characters and unlockables, you’ll see why the revival of NBA JAM on the Wii is a slam dunk on any gamer's home court. Key Game Features -An Enhanced Original - EA Sports' version of NBA JAM has the off-the-charts fun factor of the original with updated gameplay that looks and feels better than ever. -All-New Remix Tour - Play NBA JAM like never before in the brand new Remix Tour that features exciting new game modes (21, Elimination, Domination, Backboard Smash), power ups, 1 on 1 Boss Battles against NBA legends and more. -Unlockables Galore - Players of NBA JAM can earn and unlock more than 100 cheat codes, secret characters and legendary NBA players. Secret characters were a big part of the original and EA Sports is committed to keeping the spirit of past unlocks alive. -Player Likeness - Witness as the past and future collide in the visuals of NBA JAM. A distinct art style that screams JAM from the moment you boot up the game is mashed with the most realistic player likeness ever seen on the Wii, creating a presentation that is unlike anything you've seen but yet is strangely familiar. -Many Ways to Play the Game - Fans can play Solo, Versus (against another player) or Co-op (with another player against the AI) modes using their choice of motion or Classic Controllers on the Wii. No matter how you like to play the game, you will have tons of fun playing NBA JAM. - A True \"Pick up and Play\" Experience - The gestures on the Wii are very simple for those new to sports games yet also have enough depth to satisfy passionate gamers who seek challenges around every corner. -Full League Representation - The top three players, as chosen by the fans, from every NBA team in the are featured in NBA JAM, but that's not all. Over 100 unlockable teams, characters, privileges, and mascots are also playable. -Award-winning Fun - NBA JAM is the winner of eight \"Best Sports Game of E3\" award, including the Game Critics Award.", "platform": "Nintendo Wii", "release_date": "October 5, 2010", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Canada", "publishers": "EA Sports", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "4.56", "wikipedia": "https://www.nintendo.com/games/detail/pRSDTeUfnnhUvTvkT3uHp25t8XJA3CT4", "video_link": "https://www.youtube.com/watch?v=B-6NTt2NXho", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/3131-nba-jam\n"}