{"altername_name": ["NCIS: The Game", "NCIS: Based on the TV Series", "NCIS: Basierend auf der TV-Serie"], "name": "NCIS", "overview": "For the first time ever, the world of the NCIS TV show comes to your Nintendo Wii system. As a member of NCIS, some of the world's most advanced technology is at your disposal, but sometimes cracking the case comes down to following your gut. Join the high-profile crime-solving crew of the hit TV series in this Kinect-compatible game based on NCIS. Solve four interconnected cases created with the show's writers. Play as all the agents from the show, including DiNozzo, David, Ducky, McGee, and Gibbs. Chase down leads, analyze crime-scene data, and drop the hammer on suspects. Experience a storyline with the humor and camaraderie of the show, collecting and analyzing evidence in a wide variety of mini-games, then piecing it all together to see where it leads. Features: • PLAY AS THE CAST, BE PART OF THE FAMILY -- Investigate crime scenes as agents Ziva David and Tony DiNozzo, conduct forensics analyses as Abby and victim autopsies as Ducky, interrogate and break suspects as Gibbs, and use satellite tracking to apprehend bad guys on the run as McGee. The game also features cameo appearances by some of the show’s most popular characters, such as NCIS director Leon Vance and Anthony DiNozzo Sr., Agent DiNozzo’s father. • YOUR OWN NCIS ADVENTURE -- An all-new NCIS story arc written with the writers of the show. From a Casino in Atlantic City, USA, to a luxury hotel in Dubai, UAE, work as the NCIS team to save the day. • ENJOY THE NCIS TEAM CAMARADERIE -- Bond with your favorite NCIS characters and get first-hand experience with the group’s humor, personality quirks, and defining characteristics. Interact with the characters through layers of storyline and dialogue designed to make you an integral part of the cast’s compelling dynamic. • TOTAL NCIS EXPERIENCE -- As in the show, use your guts and the cutting edge of technology to solve cases. Engage in varied mini-games and activities: search crime scenes for clues and collect evidence; use the latest forensic tools and perform autopsies; conduct dramatic suspect interrogations; put your reflexes to the tests in tense action sequences. Finally piece the clues together using your wits to deduct the truth. • IMMERSIVE AND EASY TO PICK UP -- Control your character in third person view with simple point and click navigation and controls. On Wii, the mini-games and activities are played using fun and immersive motion-based controls.", "platform": "Nintendo Wii", "release_date": "October 25, 2011", "game_type": "Released", "esrb": "T - Teen", "developers": "Shanghai Ubisoft Computer Software", "publishers": "Ubisoft Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13293-ncis\n"}