{"altername_name": [], "name": "New Super Mario Bros. Wii", "overview": "Run and jump to your way to fun with Mario™ & friends! - Play together with up to 4 friends or family members Rediscover legendary 2D gameplay loved by millions Fun, simple controls—just like classic Mario games Developers at Nintendo have dreamed of creating a simultaneous multiplayer Super Mario Bros.™ game for decades. The Wii console finally makes that dream come true for everyone. Now players can navigate the side-scrolling worlds alone as before or invite up to three others to join them at the same time on the same level at any point in the game for competitive and cooperative multiplayer fun. With the multiplayer mode, the newest installment of the most popular video game franchise is designed to bring yet another type of family entertainment into living rooms and engage groups of friends in fast-paced Super Mario Bros. fun. New Super Mario Bros. Wii offers a combination of cooperation and competition. Players can pick each other up to save them from danger or toss them into it. Mario™, Luigi™ and two Toads are all playable characters, while many others from the Mushroom Kingdom make appearances throughout the game. Players can even ride different Yoshi characters and use their tongues to swallow enemies, items and even balls of fire. In some areas, players use the motion abilities of the Wii Remote™ controller. The first player to reach a seesaw might make it tilt to help his or her character reach a higher platform – or might make it tilt incorrectly just to mess with other players. New items include the propeller suit, which will shoot players high into the sky with just a shake of the Wii Remote, and Mario’s new ability to transform into Penguin Mario. At the end of each stage during the coin battle multiplayer mode, players are ranked based on the number of coins they have collected.", "platform": "Nintendo Wii", "release_date": "November 20, 2009", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo EAD", "publishers": "Nintendo", "genres": "Platform", "max_players": "4", "cooperative": "Yes", "rating": "4.53", "wikipedia": "https://en.wikipedia.org/wiki/New_Super_Mario_Bros._Wii", "video_link": "http://www.youtube.com/watch?v=ht8r30Vk9P0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162-new-super-mario-bros-wii\n"}