{"altername_name": [], "name": "NHL Slapshot", "overview": "Putting a Hockey Stick Right in Your Hands The makers of the EA SPORTS™ NHL® Series, winning 22 “Sports Game of the Year” awards over the last three years, are proud to deliver the most fun and authentic sports experience for Nintendo Wii: EA SPORTS™ NHL® SLAPSHOT. Just pick up and play using the all-new accessible and intuitive NHL SLAPSHOT Hockey Stick, the game accessory that puts every pass, shot, check and deke in your hands. Jump right in to authentic 5-on-5 NHL action with all the real teams and players, or fulfill the ultimate dream of becoming an NHL All-Star by beginning a career at the Peewee level before working your way to the Pros, or take to the ice as ‘The Great One’, Wayne Gretzky, and play out the ultimate Hockey career. However you play it, NHL SLAPSHOT puts the game of hockey right in your hands. \"FEATURES: • It’s in Your Hands—Deke, check, and shoot with the all-new NHL SLAPSHOT Hockey Stick game accessory, included with NHL SLAPSHOT. Simply plug the Wii Remote and Nunchuk into the hockey stick and take over any game like a true NHL All-Star. • The Total Hockey Experience— Whether it’s 3-on-3, or 5-on-5 games, play with or against all the real players and teams from the CHL, AHL, and NHL. Play through a full NHL Season and Playoffs, for your chance to hoist the Stanley Cup! • Play from Peewee to the Pros—In Peewee to Pros Mode, start your hockey career as a Peewee on the neighborhood rink playing 3-on-3, and work your way through Bantam and Junior leagues, to 5-on-5 in the NHL. Level up your skills and attributes as you learn hockey fundamentals during your journey to the Pros. • Be the Next Great One—Play as NHL legend Wayne Gretzky. Wear jersey #99 and take to the ice as the Great One in Peewee to Pros mode, or in Play Now mode at any level. Gretzky also provides game day tips and coaching advice when playing a career of your own. • Split-Screen Shootout!—Practice deking and shooting in a fun, split-screen mini-game for players of every skill level. Take shots on net to beat the goalie, or use your Nunchuk and Wii Remote as your glove and blocker to defend the net! • Exciting New Mini-Games—Experience the mayhem of Free 4 All, the pressure of Classic Shootout, the fun of 2 on 2, and the competition of Shooter VS. Goalie against friends and family with four over-the-top multiplayer mini-games.", "platform": "Nintendo Wii", "release_date": "September 7, 2010", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Canada", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4997-nhl-slapshot\n"}