{"altername_name": ["SpongeBob and Friends: Attack of the Toybots", "Bob Esponja y Amigos: El Ataque de los Juguetes Roboticos", "SpongeBob und seine Freunde: Angriff der Spielzeugroboter", "SpongeBob to Nakamatachi: Toybot no Kougeki"], "name": "Nicktoons: Attack of the Toybots", "overview": "Nicktoons: Attack of the Toybots is the 2007 sequel to the 2005 game Nicktoons Unite! and 2006 game Nicktoons: Battle for Volcano Island. It was released on the Wii, Nintendo DS, PlayStation 2, and Game Boy Advance. is the third game in the Nicktoons Unite! video game series. It features playable characters from various Nicktoons, most notably including a few secret characters from long-cancelled shows. It was then followed by SpongeBob SquarePants featuring Nicktoons: Globs of Doom in 2008. The game features a dozen playable characters from various Nicktoons properties of the time, including SpongeBob SquarePants, Danny Phantom, The Fairly OddParents, The Ren and Stimpy Show, My Life as a Teenage Robot, Invader Zim, Rocko's Modern Life, The Adventures of Jimmy Neutron: Boy Genius, Catscratch, El Tigre: The Adventures of Manny Rivera and Tak and the Power of Juju. The opening intro for the game features Calamitous on some sort of game show (which is called the Biggest Genius). Professor Calamitous states that by feeding fairies the Krabby Patties, they can emit a gas that, combined with Ghost Energy, can be used as a form of fuel for his army of the Toybots. The game itself opens with SpongeBob and Patrick delivering a truckload of several million Krabby Patties to a Krabby Patty processing and toybot factory. Upon arriving at the factory, A robot sucks up all the Krabby Patties, and Patrick unintentionally in the process. SpongeBob chases after the robot, SpongeBob disguises himself as a robot to get into the factory, and save Patrick. After finding his way through the factory, SpongeBob finds Patrick vacuum-packed like a toy. After freeing Patrick, he meets Tak, who claims to have been abducted and scanned. They later find Timmy, Cosmo, and Wanda. Since Cosmo and Wanda ate too many Krabby Patties, they aren't able to wish the factory away, but can still protect the heroes from harms way. They later find Jimmy who also claim to have been abducted and scanned. They meet the Chadbot, a robot who is Calamitous' helper. They ask him to use something to contact Danny Phantom and commands them to find more master models for his collection. After collecting the master models, Jimmy contact Danny who says that Calamitous, invading toy army took over his house to use he energy coming from the Ghost Zone so Jimmy tells Danny and Sam to meet him and the other Nicktoons at the Amity Park (which is almost destroyed) EvilToyCo outlet and when they get there they see Jimmy made some mech-suits that will let them fight the big tin robots. After defeating a giant evil toy Jimmy head, they head back into the factory where they find some more master models. Chad-Bot tells them that Saucer Men toys capture heroes, so the Nicktoons go through the factory, collecting the rest of the master of master models, and destroy the Saucer Men toys, then the Nicktoons head to Fairy World. They then free Jorgen (who was in a frozen state on till Patrick bumped into him thanks to Jimmy), who destroys the fairy harvester, and then get back into the mech-suits to the Professor's lair (Jorgen even tells them to collect 500 fairies which they do). They get to where the opening into of the game was and the winner of the Biggest Genius is none other than Chad-Bot himself who tells Calamitous, plan to abduct the best characters from every universe lead to his victory and the game ends with Chad-Bot cutting Calamitous, mustache off with a electric shaver.", "platform": "Nintendo Wii", "release_date": "October 23, 2007", "game_type": "Released", "esrb": "E - Everyone", "developers": "Blue Tongue Entertainment", "publishers": "THQ", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Nicktoons:_Attack_of_the_Toybots", "video_link": "https://youtu.be/c8Nm3FIXSQ0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33343-nicktoons-attack-of-the-toybots\n"}