{"altername_name": [], "name": "Ninja Captains", "overview": "Ninja Captains is a hilarious party game about four clumsy ninja cats that accidentally find themselves travelling the world and getting into all sorts of trouble! When their city is attacked by a giant mouse, these four felines have no choice but to do what they do best – save the world. They may look like ordinary animals, but whenever there is trouble, they become Ninja Captains! Armed with the latest in mouse-tracking technology, the ninjas follow faulty directions that lead them straight past the robot and into a plane. Join the Ninja Captains as they visit cities such as London, Sydney and Tokyo in a journey that takes them across every continent. During their mouse hunt, they are called on to perform all kinds of wacky activities including running from bulls in Pamplona, racing gondolas in Venice, and sledding down the icy mountains of Antarctica just to finally find themselves back home in downtown New York where their enemy has been right under their noses the entire time! Gameplay Description: Ninja Captains features 20 unique action-packed games set in exotic locations all over the world. Up to 4 players can join in as the Ninja Captains try to save the world, one city at a time! Ninja Captains will test your speed, timing and coordination through a series of zany challenges that include rock climbing in Australia, ice fishing in Sweden, and serving food to hungry customers in Berlin. Learn the secret art of travel firsthand and embark upon a single or multiplayer adventure that is sure to be a hit with friends and family! Features: •20 different games packed with the perfect balance of humour and excitement. •World famous cities such as London, Sydney, Paris, New York, Tokyo, Rio de Janeiro and others. •Plenty of variety as gameplay activities range from racing to climbing, balancing, dodging, dancing, and even surfing! •Countless hours of party game fun for up to 4 players.", "platform": "Nintendo Wii", "release_date": "October 16, 2009", "game_type": "Released", "esrb": "", "developers": "Nordcurrent", "publishers": "Nordcurrent", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=wJQI1u7pjDw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82489-ninja-captains\n"}