{"altername_name": [], "name": "PrimeHack", "overview": "PrimeHack is a specialised build of Dolphin authored by Shiiion that introduces traditional first person shooter aiming and controls to the Metroid Prime games, with the goal of making the game play and feel like a native PC game. PrimeHack is not just a mod of Dolphin, at runtime PrimeHack will modify game code and objects in memory to take direct control of the game. PrimeHack introduces an array of Graphical options, which includes: Field of View Modifier Full Viewmodel Adjustment Automatic viewmodel adjustment for high FoVs Re-enable the secondary weapon effects that exist in GameCube and were removed in the Trilogy release. Disable Bloom Disable Culling Bloom offset reduction to help with exaggerated bloom effects from upscaled internal resolutions Customisable cross-hair for the GameCube versions of the game And more. PrimeHack offers a selection of cheats and useful hacks, which includes: Source Engine Style Noclip Invulnerability from all damage sources Skippable Cutscenes Restore Scan Dash (A speedrunning technique that was patched after Metroid Prime 1 Revision 0) Disable Hud Popups When Acquiring Pickups Skip the mandatory portal cutscene in MP2 Remove Friend Vouchers Requirement for extras, which are now impossible to obtain normally Miscellaneous and QoF Features: Automatically fix the infamous \"Pixel Glitch\" that exists in the centre of the screen at higher internal resolutions Automatically Toggle \"Store EFB Copies to Texture Only\" off while in scan visor to keep the performance benefit without preventing scanning. Standard invert X / invert Y axis settings. Standard camera and cursor sensitivity options. Individual Axis Sensitivity options for controllers. Using PrimeHack's built in mod loader, we have created a new mod that introduces source engine style physics allowing you to bunny hop and rocket jump in Metroid Prime GCN NTSC (Revision 0). This mod also offers the ability to modify most physic values, such as gravity, acceleration and air resistance.", "platform": "Nintendo Wii", "release_date": "2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Metaforce Team", "publishers": "", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://github.com/shiiion/dolphin/wiki", "video_link": "https://www.youtube.com/watch?v=mJzQKVGfYbc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166593-primehack\n"}