{"altername_name": [], "name": "Rayman Origins", "overview": "During what appears to be a normal day, Rayman and his friends are chilling out on a giant tree in their homeland, the Glade of Dreams. Their constant snoring however disturbs an old granny from a land located in the depths below, the Land of the Livid Dead. Determined to put an end to the never ending noises she sends an army of evil creatures across the land, capturing all Electoons and Nymphs that populate the world in the process. As Rayman and his friends are captured from the creatures, they must flee their prison and attempt to bring order back to the Glade of Dreams before it's too late. Rayman Origins is a reboot of the Rayman franchise and a return to the series' 2D platforming roots. Its gameplay can be seen as a mixture between Mario and the first Rayman game. Many of the original game's characters and enemies make an appearance, like Livingstones, Electoons, Betilla and the Magician's hat. There are also various characters from Rayman 2 such as Globox, the Teensies and Lums. The game's atmosphere, however, is different from the original game and has a very \"wacky\" feel instead. The main objective of each level is to rescue as many Electoons as possible similarly to the original game. There's also Lums from Rayman 2 which act as the game's currency, but each area is heavily guarded by creatures from the Land of the Livid Dead as well as many other enemies. There's also a multiplayer option with up to four players which feels very similar to that of contemporary Mario games. It is possible to play as Rayman, Globox and two Teensies.", "platform": "Nintendo Wii", "release_date": "November 15, 2011", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Ubisoft", "publishers": "Ubisoft", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "4.28", "wikipedia": "https://en.wikipedia.org/wiki/Rayman_Origins", "video_link": "http://www.youtube.com/watch?v=MvhwWXF-LfU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7983-rayman-origins\n"}