{"altername_name": [], "name": "Rock Band: Track Pack: Volume 1", "overview": "Continue your Rock-and-Roll fantasy with the first Rock Band expansion pack! Start a band. Rock the world.™ Keep it Going! A fully functional game with all the great features of Rock Band, including: Solo and Band Tour Mode, Quickplay, Tug of War, Score Dual, and song unlock progression. The Best Around! 20 of the most popular tracks in Rock Band history distilled to perfection onto one disc, all utilizing the original master recordings. 30 Seconds to Mars’ “The Kill” All-American Rejects’ “Move Along” Blink-182’s “All the Small Things” Boston’s “More Than a Feeling” David Bowie’s “Moonage Daydream” Faith No More’s “We Care A Lot” Grateful Dead’s “Truckin’” Hives’ “Die, All Right!” Kiss’ “Calling Dr. Love” Lynyrd Skynyrd’s “Gimme Three Steps” Nine Inch Nails’ “March of the Pigs” Oasis’ “Live Forever” Paramore’s “Crushcrushcrush” The Police’s “Synchronicity II” Queens of the Stone Age’s “Little Sister” Ramones’ “Teenage Lobotomy” Smashing Pumpkins’ “Siva” Stone Temple Pilot’s “Interstate Love Song” Weezer’s “Buddy Holly” Wolfmother’s “Joker & the Thief\" Compatible with: Rock Band Drums, Rock Band Guitars, Rock Band Microphone Does not need Rock Band to Play", "platform": "Nintendo Wii", "release_date": "July 15, 2008", "game_type": "Released", "esrb": "T - Teen", "developers": "Harmonix", "publishers": "MTV Games", "genres": "Music", "max_players": "4", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Rock_Band_track_packs#Rock_Band_Track_Pack_Vol._1", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23889-rock-band-track-pack-volume-1\n"}