{"altername_name": [], "name": "Rock Band: Country Track Pack", "overview": "Harmonix released a fifth track pack for the Xbox 360, PlayStation 3, Wii, and PlayStation 2. The disc features 21 songs, and for the first time includes songs never before seen in the Rock Band series. These songs were exclusive to Rock Band Country Track Pack for a limited time before being released to the Rock Band Music Store by late 2009 and early 2010. The Xbox 360 and PlayStation 3 versions also include a code to export the songs to a hard drive for use in other Rock Band games. The Track Pack can also be played as a standalone game for all systems in the same manner as the AC/DC Track Pack and Track Pack Vol. 2. The setlist includes the following songs: Song title Artist Decade Genre \"3 Dimes Down\" Drive-By Truckers 2000s Country \"Any Man of Mine\"a Shania Twain 1990s Country \"Can't Let Go\" Lucinda Williams 1990s Country \"Cry Lonely\"a Cross Canadian Ragweed 2000s Country \"Free and Easy (Down the Road I Go)\" Dierks Bentley 2000s Country \"Gone\"a Montgomery Gentry 2000s Country \"Good Time\"a Alan Jackson 2000s Country \"Gunpowder & Lead\" Miranda Lambert 2000s Country \"Hillbilly Deluxe\" Brooks & Dunn 2000s Country \"I Told You So\"a Keith Urban 2000s Country \"Me and My Gang\"a Rascal Flatts 2000s Country \"Mud on the Tires\" Brad Paisley 2000s Country \"On the Road Again\"a Willie Nelson 1980s Country \"Satellite Radio\" Steve Earle 2000s Country \"She Thinks My Tractor's Sexy\"a Kenny Chesney 1990s Country \"She's Country\"a Jason Aldean 2000s Country \"Sin Wagon\" Dixie Chicks 1990s Country \"Suds in the Bucket\"a Sara Evans 2000s Country \"Swing\"a Trace Adkins 2000s Country \"The Gambler\"a Kenny Rogers 1970s Country \"This One's for the Girls\"a Martina McBride 2000s Country", "platform": "Nintendo Wii", "release_date": "July 21, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Harmonix", "publishers": "MTV Games", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "1", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Rock_Band_track_packs#Rock_Band_Country_Track_Pack", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/15845-rock-band-country-track-pack\n"}