{"altername_name": ["Scooby-Doo! Bienvenidos al Misterio", "Scooby-Doo! Geheimnisvolle Abenteuer"], "name": "Scooby-Doo! First Frights", "overview": "Scooby-Doo! First Frights is for fans of all ages. You will be able to explore spooky environments as Scooby, Shaggy or any of the super-cool teen Mystery, Inc. team. The action-adventure game features co-op play allowing two members of Mystery, Inc. to work together to solve puzzles, combat enemies, and collect clues before unmasking each episode's mysterious villain - all while gaining prestige as world famous sleuths! Once you have solved the mystery, you can return to completed levels in Explore mode with any unlocked character, costumed character or villain to access new areas. With ghosts and ghouls around every corner, high school has never sounded so fun! •Multiple Mysterious Environments: Featuring four all-new mysteries spread over more than 20 levels; explore the Phantom Cruise Ship, Haunted High School, Foreboding Castle and more! •Sleuthing times Two: Switch between characters or play with friends at any time using two player co-op with easy drop-in, drop-out gameplay. •Spooky Disguises: With access to a variety of spooky disguises, you can camouflage yourself in super-powerful costumes with new abilities unique to each character. •Back to the Beginning: Become part of the Mystery, Inc. team and solve their first cases with hours of entertainment in Story or Explore mode. •Solve Exclusive Mysteries: Each story has a new setting with a mysterious villain created specifically for the game. Collect clues and try to solve the mystery!", "platform": "Nintendo Wii", "release_date": "September 22, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Torus Games", "publishers": "WB Games", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.36", "wikipedia": "https://en.wikipedia.org/wiki/Scooby-Doo!_First_Frights", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14168-scooby-doo-first-frights\n"}