{"altername_name": [], "name": "Shaun White Snowboarding: World Stage", "overview": "Shaun White Snowboarding World Stage is Ubisoft's second game in the Shaun White Snowboarding series. This time it is exclusively released on the Wii. As with the Wii version of the previous game, it once again makes full use of the Wii Balance Board. Shaun White World Stage is also one of the first games to use the Wii Motion Plus. With it, the controls are more precise when riding down the slopes. Another feature is that with the Wii Motion Plus, the player can access a trick editing mode where he can create his own tricks. The Wiimote is moved as if it was the snowboard and its movements are mimicked by the rider. These tricks can then be used on the slopes by activating the one shot tricks. This year, the goal of the game is to reach the world stage. To do so, the player must climb up the world ranking. The player's crew starts at a world ranking of 100 and must reach the 10th position to get access to the world stage. The world stage is composed of many events and the player gains points in each of them. The ultimate goal is to be the best in the world by winning the world stage. All the riders from the first game return, and 4 new riders have been added for a total of 13 riders, including Shaun White. As with last year's title, before riding down a slope, the player chooses a rider and a cameraman. The cameramen chosen from the riders has a special ability that can be used while riding. There are some other new features since the last instalment of the game such as leaderboards, achievements, rider customization, difficulty settings and new events. Each slope has a leaderboard for the time and tricks score, separated into Wii Balance Board and Wiimote results. There are over 180 achievements. Riders can be customized by changing their clothes and board. New gear is awarded after completing events. The player can also change the game difficulty between normal and hard. The hard mode is very challenging and is an option mainly for players who played the first game. There are several new events like knockout race, overtake racing, checkpoint time attack, checkpoint trick attack, air trick attack, rail trick attack, big air, slope style and free ride.", "platform": "Nintendo Wii", "release_date": "November 10, 2009", "game_type": "Released", "esrb": "E - Everyone", "developers": "Ubisoft", "publishers": "Ubisoft", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "2.92", "wikipedia": "https://en.wikipedia.org/wiki/Shaun_White_Snowboarding:_World_Stage", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8633-shaun-white-snowboarding-world-stage\n"}