{"altername_name": [], "name": "Shaun White Skateboarding", "overview": "Shaun White Skateboarding, a game that puts an innovative twist on the action-sports genre, is the latest offering in the award-winning franchise developed in collaboration with dual-sport super-athlete, Shaun White. The most ambitious installment yet, Shaun White Skateboarding brings all the sensations of skateboarding to a wide audience making skate dreams possible and allowing players to transform a dull, lifeless city into their own extraordinary skating utopia. As players skate, they add color, life and brilliance to the city by extending handrails into endless grinds, carving alleys into half pipes, morphing streets into ramps and much more. Players can skate their way, any way they want, to create their own customized skating world that can also be shared with friends. Shaun White Skateboarding empowers skaters to push the limits of what’s possible. Key Features: · TRANSFORM – Create incredible skate lines using city structures, stretch and twist handrails to dizzying heights, empty fountains to create bowls, make alleys into epic quarter pipes and so much more. New areas are revealed, better skate lines are created and buildings are transformed. Creativity is rewarded with points, gear and new skating opportunities. · INNOVATE – With 80+ skate tricks hand-picked by Shaun (including a Shaun creation called the “Armadillo”), enjoy a unique and fun gameplay experience where you can shape, influence and transform the city while pulling off authentic skate moves. Experience all the sensations of an expert skater – the big air, sticking a landing, eating it and more! · EXPLORE – Find or create skate spots you’ve only dreamed about. The city is stretched over massive districts with tons of challenges to complete, including race, collect, narrative missions and more. · ENGAGE – Jump online to challenge your friends in co-operative or adversarial modes: online or local split-screen. Create your own maps, play with friends and see how you rank against players from across the world using online leaderboards.", "platform": "Nintendo Wii", "release_date": "October 24, 2010", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Ubisoft Montreal", "publishers": "Ubisoft Entertainment", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Shaun_White_Skateboarding", "video_link": "https://www.youtube.com/watch?v=fbP81Wxtz0M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/16005-shaun-white-skateboarding\n"}