{"altername_name": ["Bob Esponja: El Garabato", "SpongeBob SquarePants SquigglePants", "SpongeBob Schwammkopf: Verflixt und zugemalt"], "name": "SpongeBob Squigglepants", "overview": "SpongeBob SquigglePants is an action video game based on the SpongeBob SquarePants television series, developed by WayForward Technologies and published by THQ. The game was first announced on March 23, 2011 and was released for Wii in North America on April 12, 2011, April 14, 2011 in Australia, and in Europe on April 15, 2011. The Nintendo 3DS version was released on May 17, 2011 in North America and in Europe on May 27, 2011. It is the fourth game to use the uDraw GameTablet accessory and borrows its concept from the WarioWare series, consisting of a series of minigames. SpongeBob SquigglePants also features appearances from Patchy the Pirate, the president of the SpongeBob fan club, as its live-action host. SpongeBob SquigglePants consists of over 100 mini-games (or Nanogames) which require using the uDraw GameTablet. Each game has a time limit of a few seconds and can only be tried five times before failing. Examples include \"Flying Disc of the Deep\", where the player flicks the stylus to toss a flying disc to Larry the Lobster; \"That Takes the Spongecake\", where the player tilts the tablet to help SpongeBob blow out all the birthday cake candles; and \"A Bridge Abridged\", where the player draws a quick line between two cliffs to create a bridge for Plankton to cross and grab his coveted Krabby Patty, which it's mini-games borrows its concept from the WarioWare series. SpongeBob SquigglePants also features appearances from Patchy the Pirate, the president of the SpongeBob fan club, as its live-action host. Patchy guides players through the game and makes surprise appearances and interacts with players as they play the Nanogames. SpongeBob SquigglePants also lets players digitally draw, paint and color with a free-form drawing function, or choose from several SpongeBob-themed stamps. With the uDraw's exclusive ability to export art to the Wii system's SD card slot, players can also put their drawings aworthy of a place in Patchy's own collection of SpongeBob art – or their own refrigerator. The SD card capability also makes it possible to share artwork with friends via e-mail or save it to computer desktops.", "platform": "Nintendo Wii", "release_date": "May 27, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "WayForward Technologies", "publishers": "THQ", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.21", "wikipedia": "https://en.wikipedia.org/wiki/SpongeBob_SquigglePants", "video_link": "https://www.youtube.com/watch?v=Gv6p0ZguhLM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/105672-spongebob-squigglepants\n"}