{"altername_name": [], "name": "StarSing: International Vol. 2", "overview": "Adele - Set Fire To The Rain Alexandra Stan - Get Back (ASAP) Britney Spears feat. Sabi - (Drop Dead) Beautiful Calvin Harris feat. Florence Welch - Sweet Nothing Caro Emerald - Back It Up Cee-Lo Green - Fuck You Chris Brown - Don't Wake Me Up Ciara ft. Justin Timberlake - Love, Sex, Magic [MULTI] Crystal Castles feat. Robert Smith - Not In Love David Guetta & Sia - Titanium David Guetta feat. Nicki Minaj - Turn Me On David Guetta ft. Chris Brown & Lil Wayne - I Can Only Imagine David Guetta ft. Flo Rida & Nicki Minaj - Where Them Girls At [MULTI] Deepest Blue - Deepest Blue Dido - White Flag Elton John - Candle In The Wind (Goodbye England's Rose) Empire Of The Sun - Walking On A Dream Enrique Iglesias feat. Ciara - Takin' Back My Love [MULTI] Enrique Iglesias feat. Pitbull - I Like It Enrique Iglesias ft. Ludacris & DJ Frank E - Tonight (I'm Lovin' You) Enrique Iglesias ft. Nicole Scherzinger - Heartbeat [MULTI] E-Rotic - Megamix Estelle ft. Kanye West - American Boy Gotye & Kimbra - Somebody That I Used To Know Groove Coverage - 7 Years And 50 Days Groove Coverage - She Groove Coverage - The End Inna - I Need You For Christmas Inna & Juan Magan - Un Momento Israel Kamakawiwo 'Ole - Over The Rainbow Wonderful World Jennifer Lopez & Pitbull - On The Floor [MULTI] Jennifer Lopez ft. Lil Wayne - I'm Into You Jessie J ft. B.o.B. - Price Tag Junior Senior - Move Your Feet Kat Deluna - Whine Up Kat Deluna feat. Busta Rhymes - Run The Show Kat DeLuna feat. Lil Wayne - Unstoppable Ke$ha - We R Who We R Kyau & Albert - Once In A Life Kylie Minogue - Get Outta My Way Lady Antebellum - Need You Now [MULTI] Leona Lewis - Run LMFAO - Sexy and I Know It LMFAO - Sorry For Party Rocking LMFAO feat. Natalia Kills - Champagne Showers LMFAO ft. Lauren Bennett & Goon Rock - Party Rock Anthem Loona - Vamos A La Playa Madonna - Love Profusion Mariah Carey - Vision Of Love", "platform": "Nintendo Wii", "release_date": "February 11, 2013", "game_type": "ROM Hack", "esrb": "", "developers": "PsyKos", "publishers": "PsyKos", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83886-starsing-international-vol-2\n"}