{"altername_name": [], "name": "StarSing: Pop Hits 10", "overview": "Track List Includes: 1789 Les Amants de la Bastille - Ca Ira Mon Amour 1789 Les Amants de la Bastille - Tomber Dans Ses Yeux 1798 Les Amants de la Bastille - Pour La Peine African Connection - Ami Oh Amandine Bourgeois - Sans Amour Anggun - Echo (You And I) Axelle Red - Parce Que C'est Toi Ben l'Oncle Soul - Soulman Brice Conrad - Oh Là Cali - C'est Quand Le Bonheur Calogero - Yalla Chimène Badi - Entre Nous Christophe Willem - Si Mes Larmes Tombent Circus - Sur Un Fil Coeur de Pirate - Place de la République Collectif Paris-Africa - Des Ricochets Dis l'Heure 2 Zouk - Laisse Parler Les Gens DJ Antoine feat. The Beat Shakers - Ma Chérie DJ Antoine Vs. Timati ft. Kalenna - Welcome To St. Tropez Etienne Daho & Dani - Comme Un Boomerang [DUO] Faf la Rage - Pas Le Temps [DUO] Garou - Je n'attendais que vous Garou et Michel Sardou - La Rivière De Notre Enfance Isabelle Boulay - Fin Octobre, Début Novembre Isabelle Boulay - Mieux Qu'Ici-Bas Jenifer - L'Amour & Moi Julie Zenatti - I Will Always Love You Laam & Jennifer Paige - Ta Voix (The Calling) Lara Fabian - Si Tu M'aimes Le Roi Soleil - Etre A La Hauteur Lynnsha - S'évader M Pokora et Tal - Envole-Moi Marc Lavoine - Je Descends du Singe Marc Lavoine et Claire Keim - Je Ne Veux Qu'Elle Maurane & Lara Fabian - Tu Es Mon Autre Mika - Elle Me Dit Nâdiya - Et C'est Parti... Nâdiya - Parle-Moi Patrick Bruel - Lequel de Nous Renaud & Axelle Red - Manhattan-Kaboul Soha - Tourbillon (Serre-Moi Fort Si Tu M'Aimes) Tété - A la faveur de l'Automne Thomas Dutronc - Demain Tragédie - Hey Oh Tribal King - Façon Sex Véronique Sanson - Pour Me Comprendre Willy Denzey - Le Mur du Son Willy Denzey - L'Orphelin Zaz - Je Veux", "platform": "Nintendo Wii", "release_date": "November 11, 2011", "game_type": "ROM Hack", "esrb": "", "developers": "PsyKos", "publishers": "PsyKos", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83889-starsing-pop-hits-10\n"}