{"altername_name": [], "name": "StarSing: International Vol. 1", "overview": "2 Fabiola ft. Medusa - New Year's Day AaRon - U-Turn (Lili) Adele - Rolling In The Deep Akcent - Love Stoned Akcent - My Passion Akon - Angel [MULTI] Alesha Dixon - The Boy Does Nothing Alexandra Burke - All Night Long Alexandra Burke - Broken Heels Alexandra Burke - Start Without You Alexandra Burke feat. Flo Rida - Bad Boys Amy Winehouse - You Know I'm No Good Amy Winehouse feat. Mark Ronson - Valerie Avicii - Levels Band Of Horses - The Funeral Belanova & Lena Katina - Tic-Toc Bob Sinclar feat. Steve Edwards - Together Bob Sinclar feat. Steve Edwards - World, Hold On Carly Rae Jepsen - Call Me Maybe Caro Emerald - A Night Like This Cascada - Reason Cascada - Runaway (DJ Yoshinori Remix) Everything But The Girl - Missing (Todd Terry Club Mix) Far East Movement ft. Ryan Tedder - Rocketeer Free Deejays - Around The World Freemasons Feat. Sophie Ellis Bextor - Heartbreak (Make Me A Dancer) Madcon - Beggin' Maroon 5 ft. Christina Aguilera - Moves Like Jagger Mike Oldfield & Maggie Reilly - Moonlight Shadow Moby Feat. Gwen Stefani - South Side [MULTI] Muttonheads ft. Eden Martin - Trust You Again Nelly Furtado feat. Timbaland - Promiscuous Girl [MULTI] No Doubt - Ex-Girlfriend Pascale Picard - Gate 22 Plan B - She Said Psy - Gangnam Style Revolver - Get Around Town Snoop Dogg Vs. David Guetta - Sweat Swedish House Mafia - One (Your Name) Swedish House Mafia - Save The World (Tonight) Taio Cruz ft. David Guetta - Little Bad Girl Taio Cruz ft. Kylie Minogue - Higher [MULTI] The Cranberries - Ode To My Family The Pretty Reckless - Make Me Wanna Die The Pretty Reckless - Miss Nothing The Pretty Reckless - You Tiësto ft. Christian Burns - In The Dark Vinylshakerz - One Night In Bangkok Yves Larock - Rise Up", "platform": "Nintendo Wii", "release_date": "February 11, 2013", "game_type": "ROM Hack", "esrb": "", "developers": "PsyKos", "publishers": "PsyKos", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83885-starsing-international-vol-1\n"}