{"altername_name": [], "name": "Swords", "overview": "Swords pits you against the best of the best from past, present, and future in the ultimate sword fighting contest. This is what you’ve trained for, this is your destiny. Make your way from the dojo to the Final Showdown, and prove that you are the greatest swordsman of all time! Features • The Wii Remote, with Wii Motion Plus, is your ultimate weapon! – Experience the realism of 1:1 sword movement, real time blocking, and advanced combos! • Earn new swords with every victory, each with its own unique abilities. • Travel through time and space, compete in challenging tournaments, and face-off against the masters of each style in brutal boss battles. • Challenge a friend or play together in a variety of training drills. • Increase your skills and learn new combos in mini game challenges, like carving, sparring, blocking, and even battling a horde of zombies! • Battle against 8 unique characters, each with a distinct look and home arena that represents their fighting styles: – Sensei Musashi: Your sensei, and adopted father. He will prepare you for the tournament. – Rognir: This giant Viking chieftain swings a big sword and is looking to take your head off. Be alert, and quick! – Lancelot: Sir Lancelot is a brave knight of the round table. Using a broadsword and shield, his only weakness is his ritualized fighting style. – Princess Aisha, the Generous: Aisha is a swift and dangerous foe. Catch her when she changes direction and exploit this short window of vulnerability. – Captain Jack Rackham: A clever and nimble opponent, Captain Jack is a first class scoundrel. Watch out for his cheating ways and his bag of blinding sand. – Keiko Anamura: This flirtatious lady will lure you in with compassion before stabbing you in the back. Her temper is her greatest strength, and also her weakness… – Razor: The last of the Jumandi hunter droids, Razor comes from the distant future. Armed with laser swords and capable of incredible acrobatic moves, Razor almost seems undefeatable… – Mysterious final combatant: who will it be?", "platform": "Nintendo Wii", "release_date": "September 28, 2010", "game_type": "Released", "esrb": "T - Teen", "developers": "Panic Button Games", "publishers": "Majesco Entertainment", "genres": "Beat 'em Up", "max_players": "", "cooperative": "No", "rating": "2.2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=q1vpWd1gV5o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102967-swords\n"}