{"altername_name": [], "name": "Taiko no Tatsujin Wii: Minna de Party 3 Daime!", "overview": "The third Wii Taiko no Tatsujin, released on December 2010. As the title 'Minna de Party' would suggest, Taiko Wii 3 places emphasis back on the Wii casual audience, allowing up to 4 players on one screen at the same time, which hasn't ever been done before. It's cramped, but it works fine. To add to it, the main gimmick this time are the seven minigames of the Dream Taiko Land, 4 of which involve drumming skills, and the remaining three harks back to the PS2-era minigames, which is a welcome addition. That isn't to say Taiko Wii 3 has ignored the fans of the Oni metagame though. Continuing on from Taiko Wii 2, Minna de Party finishes off the remaining Taiko 13/14 generation songs not already seen in Wii2/DS3. And in a very unexpected twist, after several unremarkable unlocks involving old songs (though they've been updated well enough to justify their presence), the Ura Oni unlock presented many surprises, giving many popular and new songs Ura Oni difficulties never before seen on any arcade (previously, Taiko Wii 2 simply ported Ura Onis from arcades, but didn't introduce any new ones). Many unexpected new songs came through Wii 3, including the Xbox 360 music Doom Noiz from Galaga Legions, and a new, unconventional 2000 song. In other minor news, the loading screen has been tweaked to feature less blinding colors and now shows the song title while waiting for the song to start playing. Returning Wii features like Everyday Taiko Dojo, Miis, song lyrics and the mailbox are here, though there are no costumes or alternate Don-chan voice samples like in the previous games. Also the first Taiko game to not stick strictly to the number of songs as advertised, featuring 71 songs instead of 70 in all other promotional material.", "platform": "Nintendo Wii", "release_date": "December 2, 2010", "game_type": "Released", "esrb": "E - Everyone", "developers": "Namco Bandai Games", "publishers": "Namco Bandai Games", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=I0ZztYjheNo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76348-taiko-no-tatsujin-wii-minna-de-party-3-daime\n"}