{"altername_name": ["Das Duell: Männer vs Frauen: Partyspaß Total!"], "name": "The Ultimate Battle Of The Sexes: Quizz & Play!", "overview": "Can women steer their cars perfectly into the next parking space, and can men possibly make toast and boil soup while also washing dishes, feeding the dog and having to answer the door? What is actually going on with the stereotypical role clichés? In „The Ultimate Battle Of The Sexes – Quizz & Play!“ players can have done with the tired old prejudices and really prove just who is wearing the trousers. Single players, or up to ten party players step into the roles of ten sympathetic characters, such as the sex bomb It-Girl Rosalie, or the gorgeous tanned and sporty Wesley as they duel it out in exciting games. The games will also have players getting physical thanks to the new control options offered by Playstation®Move, the Wii Remote™ Plus controller or the Wii Balance Board™. Saving the ball in football penalties, mastering the precise steps for the catwalk, sawing through mighty tree trunks in no time at all, or rocking babies to sleep. There are 25 mini-games in which players can dispel all the usual clichés… or maybe simply confirm them? And for players to prove they’ve also got some brains, there’s a TV Quiz Show mode, with more than 500 questions on wide-ranging themes like sport, movies & TV, geography and history. Features: * 25 mini games with gender specific topics * 10 unique avatars with new outfits * New TV Quiz Show mode with more than 500 questions * 2 teams with maximum 10 players * Single gaming possible * Three different game modes", "platform": "Nintendo Wii", "release_date": "March 16, 2012", "game_type": "Released", "esrb": "M - Mature", "developers": "Neopica", "publishers": "dtp young entertainment", "genres": "Action", "max_players": "10", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=nDkcg3qDDx0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/65570-the-ultimate-battle-of-the-sexes-quizz-play\n"}