{"altername_name": ["Der unglaubliche Hulk"], "name": "The Incredible Hulk", "overview": "Bruce Banner was a scientist turned fugitive when he was affected by doses of gamma radiation and a suicide attempt fails as he transforms into the beast within him---the Hulk. Somewhere in a town in South America, Bruce was chased by soldiers led by Emil Blonsky who were sent by General Thunderbolt Ross. As the chase ends when Banner heads inside a factory building, the soldiers fire missiles to the building which causes tons of debris to fall on Banner but his life was saved when he transformed into the Hulk instantly. He escaped the factory after fighting Emil Blonsky and his troops. Hulk then makes a quick getaway to New York City. After arriving in the city, the Hulk confronts and saves the life of Rick Jones, a teenager held captive by soldiers working for an organization called Enclave. Soon after, the Hulk goes on some missions while protecting Rick Jones from the forces of Enclave's Ceres section. After they start a few missions, the Hulk manages help disarm Earthquake Bombs, trash an Enclave lab, and save Jones from a gigantic cyborg called the Kyklops. Soon after, Bruce Banner begins to work with Samuel Sterns who was, in truth, his friend \"Mr. Blue\". In one mission, the Hulk manages to destroy a satellite as well as a building with it, only to be confronted by the U-Foes, a superhuman group consisting of a metallic being called Ironclad, a telekinetic being named Vector, a humanoid cloud by the name of Vapor and an inside-out, radioactive being called X-Ray. The Hulk manages to beat them, though the U-Foes survived and soon vowed to destroy the Hulk once he interferes with them once more. Hulk is then sent to retrieve Nanites stolen by Enclave which are hidden in garbage trucks that are also targeted by the army.", "platform": "Nintendo Wii", "release_date": "June 5, 2008", "game_type": "Released", "esrb": "T - Teen", "developers": "Edge Of Reality", "publishers": "Sega", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.07", "wikipedia": "https://en.wikipedia.org/wiki/The_Incredible_Hulk_(2008_video_game)", "video_link": "https://www.youtube.com/watch?v=orLYpo2LyVk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5342-the-incredible-hulk\n"}