{"altername_name": ["ザハウス· · ·オブザ·デッドオーバーキル"], "name": "The House of the Dead: Overkill", "overview": "The House of the Dead: Overkill charges you with mowing down waves of infected, blood-thirsty zombies in a last-ditch effort to survive Bayou City and uncover the horrific truth behind the origins of The House of the Dead. A pulp-style take on the classic SEGA light-gun shoot 'em up franchise. Back when the famous Agent G was still fresh out of the academy, he teamed up with hard-boiled bad-ass Agent Washington to investigate stories of mysterious disappearances in small-town Louisiana. Little did they know what blood-soaked mutant horror would await them in the streets and swamps of Bayou City. Pulp Funk Horror - Zombie cool, one of the most popular shooter classics injected with a whole new retro b-movie look. An utterly in-your-face zombie-dismembering blast. Non-stop light-gun style action on Wii, blow apart zombies for high-score thrills. Co-op action on Wii. Bring a friend and play the game as intended in your own buddy action movie as two of the meanest mofos in video gaming. Relentless, gore-drenched, over-the-top action - Only the coolest, most cold-hearted agent’s going to keep his head against the zombie flood. Use \"Slow-Mofo Time\" to make the perfect head-popping shot and \"Evil Eye\" to spot moments of opportunity that’ll send the whole environment up in flames. Wiimote reactions. Get knee-deep in the dead with motion-sensitive Wii-controls. Shuck a shotgun and when the zombies get too close, pistol whip jaws off or cave some heads in with the stock of your pump-action - all in stomach-churning close-up.", "platform": "Nintendo Wii", "release_date": "February 10, 2009", "game_type": "Released", "esrb": "M - Mature", "developers": "Headstrong Games", "publishers": "Sega", "genres": "Horror", "max_players": "2", "cooperative": "Yes", "rating": "4.19", "wikipedia": "https://en.wikipedia.org/wiki/The_House_of_the_Dead:_Overkill", "video_link": "http://www.youtube.com/watch?v=1tF6oUhDpnA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4715-the-house-of-the-dead-overkill\n"}