{"altername_name": ["Tortugas Ninja: TMNT", "Teenage Mutant Ninja Turtles"], "name": "TMNT", "overview": "Leonardo, training in the woods, is then given the mission to find a mystic amulet by Master Splinter's orders. After he finds the amulet, it is revealed that Splinter was telling the story of how they stopped the four Stone Generals, and asks Donatello and Michelangelo to continue it. Once, Raph infiltrated Max Winters' tower (as Nightwatcher), and eavesdropped on a conversation with Winters and Karai. Raph was then defeated by one of the Stone Generals. Later on, Leo found out that Raph was the Nightwatcher, and a chase ensued, ending up with Leo being ambushed and captured by the Foot. Raph, feeling guilty, decides to go after the Foot. He then encounters one of the Stone Generals, and defeats her, with the help of Don and Mikey. The turtles then head off to rescue Leo, and they achieve this goal, right before the temple self-destructs. The turtles then go to Max Winter's tower, and Winters tells his story of being an immortal warrior named Yaotl. Yaotl was planning to activate a portal to another world, but it released 13 monsters into the earth. Yaotl became immortal, but it also turned his generals to stone. Yaotl then planned to stop his mistakes and his immortality by waiting for the portal to come again, and send all the monsters back to whence they came. He also made his generals come to life, but they remained in stone form. The Stone Generals wanted to live forever, so they turned on Yaotl. The turtles, however, managed to defeat the Generals, the portal opened, and the monsters returned to their dimension. Yaotl then thanks the turtles and dies happy and free from guilt. After the story, the turtles all realize the importance of family and grow closer as not only a family but also as a team.", "platform": "Nintendo Wii", "release_date": "March 20, 2007", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Ubisoft", "publishers": "Ubisoft", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "2.75", "wikipedia": "https://en.wikipedia.org/wiki/TMNT_(video_game)", "video_link": "https://www.youtube.com/watch?v=j8pqkXxSJYY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4747-tmnt\n"}