{"altername_name": ["Transformers: Prime: Das Spiel"], "name": "Transformers: Prime: The Game", "overview": "Transformers: Prime – The Game is a brawler video game developed by Nowpro for the Wii, Wii U, and Nintendo 3DS and Altron for the Nintendo DS. Transformers: Prime – The Game is published by Activision during October–November 2012. The game is based on the television series Transformers: Prime, which airs on The Hub, a Hasbro and Discovery Communications joint venture. The game features the voice cast from the show such as Peter Cullen, Frank Welker, Sumalee Montano, Steven Blum, Josh Keaton, Jeffrey Combs, Kevin Michael Richardson, and Daran Norris. The game focuses on Team Prime (consisting of Optimus Prime, Arcee, Bulkhead, Bumblebee and Ratchet) Jack, Miko and Raf embark on a journey to defeat the villainous Megatron and the Decepticons in his plan to use his secret new weapon. Gameplay The gameplay has been described as containing \"brawler-style combat and diverse driving sequences\". There is a multiplayer function, both cooperative and competitive. Competitive modes include Brawl, Energon Match, and Emblem Battle, and up to 2 players can play at the same time, with 2 additional AI-controlled characters; the same character can't be picked up my multiple players, including the AIs. The Wii version of the game featured motion controls while the Nintendo Wii U, 3DS and Nintendo DS featured touch-based input. The game's Story Mode features 13 stages, each with a varying number of segments. Though only the Autobot characters are playable in this mode, progressing through it unlocks the Decepticon characters for the multiplayer mode. There are a total of 11 playable characters: the Autobots Optimus Prime, Arcee, Bulkhead, Bumblebee, and Ratchet, and the Decepticons Megatron, Starscream, Soundwave, Airachnid, Knock Out, and Dreadwing. Cybertronian Artifacts - relics resembling the Spark Extractor from the TV series - are hidden around the story mode levels and unlock pieces of artwork in the gallery once found.", "platform": "Nintendo Wii", "release_date": "October 30, 2012", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Now Production", "publishers": "Activision", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Transformers:_Prime_%E2%80%93_The_Game", "video_link": "https://www.youtube.com/watch?v=RaZdo2zYN9w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/15577-transformers-prime-the-game\n"}