{"altername_name": [], "name": "Tsuushin Taikyoku: World Chess", "overview": "\"Communication game world chess\" can fine-tune the strength of the computer in 10 steps. If you set the strength of the computer higher, you can enjoy playing enough opponent players with confidence in your skills (*). Even those who just started chess, you can aim at improving your skill by challenging the level of the computer according to your progress. (*) I am adopting the \"Loop Express\" thought engine which was ranked third in the world computer chess championship held in Amsterdam in 2007. If you connect to the Nintendo Wi - Fi connection, you can play against Japan and European players while staying at home. You can play with the simple operation using the Wii remote control. When you play with your family or friends in front of the TV, you can play with one Wii Remote alternately. The game with two Wii remote controls is also possible. Depending on the setting, you can display the move destination of the piece or you can flip the board face automatically for each turn, so you can play according to your preference. You can save up to 20 pieces of \"game record\" data which recorded the process of the game, with a comment. You can look back on the game flow from the first game based on the game record, save the game with your computer and friends halfway, and restart later. You can change the design of the piece and board face and enjoy the game with your style of your choice. More than 8 kinds of designs prepared. By victory against the computer, the number of designs that can be selected will increase.", "platform": "Nintendo Wii", "release_date": "September 30, 2008", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/88140-tsuushin-taikyoku-world-chess\n"}