{"altername_name": [], "name": "We Dance", "overview": "We Dance, exclusively for Wii, is the ultimate dance party game for up to four players. Get on the dance-floor as you use the controller, dance mat, or a combination of both, to dance along to 40 chart-smashing songs from some of the world's hottest artists. With dance steps choreographed by professional dancers and great game modes including dance school lessons, party games and a Dance TV jukebox, We Dance is a great party game that everyone can enjoy. Features: * 40 CHART-SMASHING DANCE HITS - Four decades of incredible music from all original artists. From classic floor-fillers to modern hits, covering a massively diverse range of genres including rock, pop, disco, rap and hip-hop. * FULLY CHOREOGRAPHED DANCE MOVES – Learn the dance moves of professional dancers and perform iconic dance routines from 40 of your best-loved songs. * 3 DIFFERENT STYLES OF PLAY - Play using your hands only, with the Wii Remote, feet only, with the dance mat, and when you’ve mastered the moves, try putting both together! * MULTIPLAYER FUN! Invite your friends and family to a dance party, with up to four players dancing together! * 3 PARTY GAME MODES - For up to four players, featuring ‘Jump, ‘Step’ and ‘Pose’, each with their own style of play. * DANCE SCHOOL - Learn the dance moves of professional dancers, with step-by-step instructions. * WARM-UP SESSIONS – Get fit the fun way with We Dance! Prepare for those energetic dance moves with warm-up routines. * DANCE TV - Play through each of the 40 songs on We Dance whenever you like, with ‘Dance TV’, just like a Jukebox. * PERFORMANCE STATISTICS - Check out how well you’ve performed with statistics relating to your dance performance. * CHARTS – Leader boards display high scores, for the competitive dancer. * DOWNLOAD NEW SONGS AND DANCE MOVES! - Keep things fresh and check out the ‘Dance Shop’ to download all new songs and dance moves. Tacklist: - A.R. Rahman feat. The Pussycat Dolls - Jai Ho! (You Are My Destiny) - Ace of Base - Don't Turn Around - Agnes - Release Me - Axwell feat. Max'C - I Found U - B-52s - Love Shack - Baby D - Let Me Be Your Fantasy - Barry Manilow - Copacabana (At the Copa) - Basement Jaxx - Where's Your Head At? - Basshunter feat. DJ Mental Theo's Bazzheadz - Now You're Gone - Blue - One Love - Carl Douglas - Kung Fu Fighting - Chamillionaire feat. Krayzie Bone - Ridin' - Chuckie & LMFAO - Let The Bass Kick In Miami Girl - Donna Summer - I Feel Love - Fatboy Slim - The Rockafeller Skank - Fedde Le Grand - Put Your Hands Up 4 Detroit - Gipsy Kings - Bamboleo - Jay Sean feat. Lil Wayne - Down - Jive Bunny - Let's Twist Again - Junior Senior - Move Your Feet - Kid Cudi - Day 'n' Night - Kool & The Gang - Jungle Boogie - Los Del Rio - Macarena - MC Hammer - U Can't Touch This - OK Go! - Here It Goes Again - Outkast - Hey Ya! - Pendulum - Slam - Pixie Lott - Boys And Girls - Puretone - Addicted To Bass - Room 5 feat. Oliver Cheatham - Make Luv - Rose Royce - Car Wash - Sergio Mendes feat. The Black Eyed Peas - Mas Que Nada - S-Express - Theme From S-Express - Sister Sledge - He's The Greatest Dancer - Snap! - Rhythm Is A Dancer - Spice Girls - Spice Up Your Life - Survivor - Eye Of The Tiger - The Saturdays - Forever Is Over - The Village People - YMCA - Whigfield - Saturday Night", "platform": "Nintendo Wii", "release_date": "", "game_type": "Released", "esrb": "", "developers": "Le Cortex", "publishers": "Nordic Games", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=enZSeFC5-ZU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122081-we-dance\n"}