{"altername_name": [], "name": "We Sing: Deutsche Hits", "overview": "We Sing German hits - these are 40 top songs that make every karaoke party boil! The new part of the successful We Sing series exclusively for Wii offers karaoke fans this time only German-language hits including original video clips. In the varied playlist, full of original songs from rock to pop, from evergreen to chart hit, every karaoke fan, young or old, finds his favorite song quickly. We Sing German hits are available individually or as a bundle with two high-quality microphones. Three different difficulty levels ensure that beginners do not despair and skilled professionals find enough challenge. In addition to the modes for solo artists, there is also a wide selection of'Versus ','Group Battle','Pass The Mic', We Sing', First to X',' Marathon','Blind' and'Expert' To multiplayer modes for long karaoke nights with family and friends. The ability to connect up to four microphones at the same time ensures ultimate multiplayer fun. We Sing German hits - just the thing for those who have always wanted to transform their living room into the hottest karaoke bar of the city! Tracklist: 2Raumwohnung - Besser geht's nicht Christina Stürmer - Fieber Costa Cordalis - Anita Culcha Candela - Hamma! Deichkind - Remmidemmi Die Atzen - Disco Pogo Die Fantastischen Vier - Gebt uns ruhig die Schuld Die Toten Hosen - Strom DJ Ötzi & Nik P. - Ein Stern (Der deinen Namen trägt) Extrabreit - Flieger grüß mir die Sonne Fettes Brot - Jein Geier Sturzflug - Pure Lust am Leben Hans Albers - Auf der Reeperbahn nachst um halb eins Heinz Rühmann - Ein Freund, ein guter Freund Hildegard Knef - Für mich soll's rote Rosen regnen Howard Carpendale - Hello again Hubert Kah - Sternenhimmel Ich & Ich - Vom selben Stern Jan Delay - Feuer Juli - Geile Zeit Kettcar - Landungsbrücken raus LaFee - Heul doch Marianne Rosenberg - Er gehört zu mir Max Raabe & Palast Orchester - Kein Schwein ruft mich an Mia - Tanz der Moleküle Münchner Freiheit - Ohne Dich Nena - Nur geträumt Polarkreis 18 - Allein allein Revolverheld - Freunde bleiben Rio Reiser - König von Deutschland Rosenstolz - Liebe ist alles Sido - Hey du! Söhne Mannheims - Und wenn ein Lied Sportfreunde Stiller - Ein Kompliment Udo Lindenberg - Sonderzug nach Pankow Udo Lindenberg & jan Delay - Ganz andersUnehilig - Geboren um zu leben Wir sind Helden - Aurèlie Wolfgang Petry - Wahnsinn Xavier Naidoo - Dieser Weg", "platform": "Nintendo Wii", "release_date": "May 26, 2011", "game_type": "Released", "esrb": "", "developers": "Le Cortex", "publishers": "Nordic Games", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "0.5", "wikipedia": "https://en.wikipedia.org/wiki/We_Sing_Deutsche_Hits", "video_link": "https://www.youtube.com/watch?v=-LOY6prB5Gg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83468-we-sing-deutsche-hits\n"}