{"altername_name": ["Wii 备份盘 v1.31"], "name": "Wii Backup Disc v1.31", "overview": "The Wii Backup Disc is a service disc apparently used inside Official Nintendo Repair shops to transfer personal data like savegames and console settings between Wiis as part of a repair. While it does not transfer channels, it is capable of transferring enough to be able to redownload the channels from the Wii Shop Channel, which the disc says to do. It is not clear how it does this; the ticket may be resigned, or the whole Wii Shop account might be transferred. The ticket would probably go together with the save data in an RBK file. \"Change WiiId\" is mostly useless. WiiId is only used as your Wii Number that you give to your friends so they can send you Wii Mail. When you pick it, it assigns you a new random ID, possibly by incrementing the reset counter. It also doesn't boot on full bricked Wiis and it's unlikely that it repairs half bricked Wiis since delete all only deletes savegames/settings and not any channel content (Weather/News/Games..) or IOS. The \"DevCerts\" are two WAD files on the disc FS called \"dummy-cls.wad\" and \"dummy-loc.wad,\" both of which have one content which is 0x40 bytes. dummy-loc is empty while dummy-cls has the word \"dummy\" together with the title ID. The \"dummy-loc.wad\" file also has a certificate chain including the debug certificates. \"dummy-cls.wad\" has a ticket which retail Wiis do not accept, therefore it cannot be installed. While the ID of this disc is 410E (or possibly 408E for some versions), the TMD itself reports it as 1-2, probably to get access to ES_SetUid.", "platform": "Nintendo Wii", "release_date": "October 19, 2008", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Nintendo", "publishers": "Nintendo", "genres": "", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369726-wii-backup-disc-v131\n"}