{"altername_name": ["Wii Sports & Wii Sports Resort"], "name": "Wii Sports + Wii Sports Resort", "overview": "Wii Sports Resort: Wii Sports Resort takes the inclusive, fun and intuitive controls of the original Wii Sports to the next level, introducing a whole new set of entertaining and physically immersive activities. With the deep control enhancements of Wii MotionPlus, veteran Wii users and newcomers alike can enjoy unprecedented gaming precision as they cruise on a water scooter, duel with swords, throw a Frisbee® and much more. This sequel to the popular Wii Sports makes use of the Wii MotionPlus accessory, which gives players the most responsive and realistic experience possible. The Wii MotionPlus accessory, which is included with Wii Sports Resort, plugs into the base of the Wii Remote™ controller and, combined with the accelerometer and sensor bar, provides an experience that gives players an even greater sense of immersion. Just as with Wii Sports, people will love competing against friends and family. As the competition heats up, Wii Sports Resort is as much fun to watch as it is to play. First-time players will find it easy to pick up a Wii Remote and jump into the action. Wii Sports: Wii Sports introduces a whole new way to play your game. This is what video games should be: fun for everyone. Wii Sports offers five distinct sports experiences, each using the Wii Remote controller to provide a natural, intuitive and realistic feel. To play a Wii Sports game, all you need to do is pick up a controller and get ready for the pitch, serve or that right hook. If you've played any of these sports before, you're ready for fun! Play Tennis, Baseball, Golf, Bowling and Boxing in the comfort of one's living room. No ball boys scurrying about, no oil from the alleys to get players dirty and no rain to keep anyone from a day at the court, park or course. Use the Wii Remote controller to mimic the actions of swinging a racket, bat or club, roll a ball down an alley or bring the left jab. Players can use their own Mii caricatures in the game and play them against their friends' Miis for a more personalized experience. As players improve, their Miis' skill levels will increase, so that they can see exactly how much better they've become. People of all skill levels can pick up and play any of the games in the unprecedented Wii Sports package, making this truly a title for everyone!", "platform": "Nintendo Wii", "release_date": "2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "4.39", "wikipedia": "https://en.wikipedia.org/wiki/Wii_Sports_Resort#Wii_Sports_+_Wii_Sports_Resort", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112725-wii-sports-wii-sports-resort\n"}