{"altername_name": ["Zenobureido", "ゼノブレイド"], "name": "Xenoblade Chronicles", "overview": "Life in the world evolved on the bodies of two giant motionless world-gods named Bionis and Mechonis. In this world, Shulk, a young man with mysterious origins, comes across a magical sword named Monado, that allows him to see glimpses of the future. Shulk finds himself caught in the struggle between the humans from Bionis and the machines from Mechonis. Along his quest to defeat the machines he will have to help the inhabitants of Bionis rebuild their world. Xenoblade Chronicles is a Japanese-style role-playing game with several distinguishing characteristics. Exploring the vast world takes a significant part in the gameplay. Weather and day/night cycle influence the availability of quests and characters. In such an open world it is not uncommon to encounter creatures much stronger than what Shulk and his allies can manage. When the player dies he is teleported to the last save point with no penalty. Objectives can be completed in any order and many side quests are available. The fighting system resembles the one from Final Fantasy XII. There is no \"battle screen\"; battles happen directly in the open field without transition. During the battle attacks are launched automatically at regular intervals. The player selects his actions via a menu. Aside from Shulk, the player can control a team of characters with various abilities. Team attacks are available to inflict extra damage. However, once the player enters a battle, characters cannot be switched, and all other allies are AI-controlled.", "platform": "Nintendo Wii", "release_date": "June 10, 2010", "game_type": "Released", "esrb": "T - Teen", "developers": "Monolith Soft", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.39", "wikipedia": "https://en.wikipedia.org/wiki/Xenoblade_Chronicles", "video_link": "http://www.youtube.com/watch?v=0Q_KFemPumA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6356-xenoblade-chronicles\n"}