{
  "name": "6085",
  "manufacturer": "Xerox",
  "type": "Professional Computer",
  "origin": "U.S.A.",
  "year": "1985",
  "production": "1989",
  "language": "None",
  "keyboard": "95 key Typewriter style with 20 funtion keys and numeric keypad",
  "cpu": "Xerox Mesa",
  "speed": "8 MHz",
  "coprocessor": "Unknown",
  "ram": "1.1 MB up to 3.7 MB",
  "vram": "Unknown",
  "rom": "Unknown",
  "text": "Bit-map characters",
  "graphics": "880 x 697 dots",
  "colors": "Monochrome",
  "sound": "Yes, see below",
  "size": "Unknown",
  "ports": "2 serial ports",
  "power": "Built-in power supply unit",
  "price": "From $4995",
  "description": "\nThe Xerox 6085 was the successor of the revolutionary Xerox Star, first commercial computer to use a graphical user interface (GUI) with the familiar desktop, icons and a mouse. \n\nThe 6085 series was offered in models for network, remote (linked by Ethernet) and stand alone operation. The main unit was founded upon Xerox\u0027s Mesa 8 MHz processor which had 256 auxiliary registers and executed 48-bit-wide instructions. It also used an 80186 as an auxiliary processor. \n\nThe basic system came with 1.1 MB of memory, expandable up to 3.7 MB, a 10 to 80 MB hard disk drive, two serial ports and a 15-inch high-resolution monochrome display. An optional card allowed the 6085 to run MS-DOS software.\n\nThe operating system and GUI interface was called ViewPoint. It also came from the Star. It was written in a language developed at  Xerox PARC in the 1970\u0027s and also called Mesa. This strongly-typed and structured high-level language, would have a large influence on future well known languages like Pascal or C. \n\nTwo improved versions were launched afterwards, the 6085-II with an almost twice as fast processor, and the XPIW (Xerox Publishing Illustrator\u0027s Workstation), basically a 6085 workstation with a scanner.\nSadly, like the Alto, the 6085 didn\u0027t meet a large success in spite of numerous vanguard concepts, mainly because the Xerox marketing policy was, at the time, above all directed towards copiers rather than computers.\n_______________________",
  "shot": [],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;XEROX RANGE, AUGUST 1985\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Xerox_6085_Advert_s1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/Xerox_6085_System_s1.jpg",
  "builtInGames": "None",
  "controllers": "",
  "media": "5.25 floppy drive, 10 to 80 MB HDD",
  "numGames": "",
  "peripherals": "Unknown",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}