{
  "name": "80.2",
  "manufacturer": "WELECT",
  "type": "Professional Computer",
  "origin": "France",
  "year": "1982",
  "production": "",
  "language": "",
  "keyboard": "Full-stroke keyboard with function keys and separated numeric keypad",
  "cpu": "Zilog Z80 A",
  "speed": "4 MHz",
  "coprocessor": "",
  "ram": "128 KB (up to 256 KB)",
  "vram": "",
  "rom": "2 KB",
  "text": "80 x 25",
  "graphics": "Unknown",
  "colors": "monochrom",
  "sound": "Unknown",
  "size": "",
  "ports": "Bus 50B Mistek",
  "power": "PSU built-in",
  "price": "Multi-Tap model: $7,890Prof model: $10,980",
  "description": "\nLittle information available about this professional computer running CP/M.\n\nAn optional hard disk (5 or 10 mb) could be connected.\n \n\n\n",
  "shot": [],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UK ADVERT, OCT 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Toshiba_T100_Advert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FIRST AD\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;February 1983 - The real-size system picture occupied almost the full right page. \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/HP_75C_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT (JUNE 1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;Goupils invade Paris area\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/smt_goupil2_ad_region-parisienne.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;CHARLIE CHAPLIN #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;1982 - It was the time when one still lacked good programs for the IBM PC...\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Advert said: \u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt;\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Attention, all programmers. Here\u0027s a chance to reach the top.\u0026lt;br\u0026gt; If you\u0027ve written software that\u0027s completed and runs on the IBM Personal Computer (or another computer), we could be interested in publishing it...\u0026lt;br\u0026gt; ... We select programs that will make the IBM Personal Computer an even more useful toll for modern times...\u0026lt;/font\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/IBM_5150_ChaplinAdvert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UK ADVERT, OCT. 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Kaypro_II_UKadvert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #18\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; In order to provide as much information as possible, we have selected the most frequently asked questions about MSI products for inclu\u0026shy;sion in our catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the MSI 6800 Computer\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are the main differences between the MSI 6800 Computer and the MP 6800 Com\u0026shy;puter manufactured by Southwest Technical Products Corporation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI 6800 Computer is bus compati\u0026shy;ble with the SWTP 6800 system. Both use the SS-50. bus architecture. However, the MSI 6800 overcomes the engineering disadvan\u0026shy;tages associated with the MIKBUG monitor, incomplete address decoding, interface ad\u0026shy;dresses in the middle of user memory, inade\u0026shy;quate power supply, and mother board capacity. The MSI 6800 system has a 20 amp power supply and a heavy duty mother board with 16 slots and gold-plated connectors. Our CPU Board has separate baud rate and system clocks, 4K of EPROM memory and a much improved MIKBUG compatible monitor. MSI interface cards bring all strappable options to a DB-25 connector on the rear panel via a rib\u0026shy;bon cable connector. This permits any terminal to be plugged into the computer without alteration of the interface card. Other advantages of the MSI 6800 are described in this catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use my SWTP memory boards and interface boards in the new MSI 6800 Com\u0026shy;puter?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, since the bus architecture is identical, they will worlk fine. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI 6800 mother board and power supply only to beef up my SWTP 6800 system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the MSI mother board (MB-1) has the same hole centers as the SWTP mother board and will mount easily in the SWTP chassis. However, the MSI interface adapter board (IA-1) must also be used to furnish an interface bus. The MSI power supply (PS-1) may also be used to replace the SWTP supply. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is the MSI6800 available wired and tested?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, see catalog listings. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI CPU card in my SWTP 6800 system in order to gain a faster system clock and on board EPROM memory?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, however the MSI power supply should also be used in order to adequately supply the EPROM memory. A MIKBUG replacement monitor must also be used if interface ad\u0026shy;dresses used by MIKBUG are to be retained. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the FD-8 Disk Memory System\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have an SWTP 6800 System. What is needed to hook up your FD..a Floppy Disk Memory to my system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD..a Disk Memory System interfaces to any microprocessor system via a single PIA chip. For the SWTP 6800 System, we furnish our PIA-1 interface card which plugs in directly to port 7 of the interface bus. A ribbon cable then plugs into the interface card and to the disk. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is provided with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides a complete disk operating system software package for use with 6800 based microprocessor systems. The operating system gives the user the capability of having named files at three levels: object code files, source code files for the assembler, and BASIC files. The system contains a coresident as\u0026shy;sembler/editor which can pull source files from disk, assemble, and pass object code to either tape cassette or disk memory. Password pro\u0026shy;tection is available for both program as well as random and sequential data.\u0026lt;br\u0026gt; The new TSC editor is now available in a MSI FD-8 disk version. This excellent editor allows very long source files to be stored on disk, edited, and assembled with the object code being placed on disk as well.\u0026lt;br\u0026gt; In BASIC, both program as well as random and sequential disk data files are available. All files are named with optional password pro\u0026shy;tection. Other basic programs on disk can be chained to or called as subroutines from a parent program. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What charges are made for software, and what documentation do I receive?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The complete disk operating system, in\u0026shy;cluding the coresident assembler/editor are provided free of charge with the purchase of an FD..a Disk System. A $65.00 charge is made for MSI BASIC. An operating manual for disk oper\u0026shy;ating system, assembler/editor, and BASIC is provided. Partial source documentation is also provided for the input and output routines and other appropriate addresses. In addition, com\u0026shy;plete source documentation is provided for the disk driver subroutines and MINIDOS which allows the user to read or write any desired sector or number of sectors from any beginning disk location to any destination in computer memory. This enables the user to have access to the disk in his own assembly language pro\u0026shy;grams or by direct communication with the control terminal completely independently from the MSI disk operating system. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is it possible to interface the FD-8 Floppy Disk to microcomputer systems using the 8080, Z80, or 6502 processors? If so, do you provide the technical details on interfacing?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 can be connected to any micro\u0026shy;processor via a single PIA chip interface. Elec\u0026shy;tronically, there is no difficulty in interfacing to any system since transfers between the disk and the host computer are carried out via a sector buffer RAM on the disk controller card. Information transfer is under the control of a crystal clock on the controller board, thus mak\u0026shy;ing the FD-8 completely independent from processor speed or clock frequency. It is possi\u0026shy;ble to interface the FD-8 using parallel data ports without a PIA chip, however, the software for interfacing has already been written for both 8080 and 6800 systems using a PIA interface. Since some of the ports are used bi-direction\u0026shy;ally, the PIA interface provides an overall sim\u0026shy;plifi9ation of the interfacing problem. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is available for 8080 sys\u0026shy;tems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides complete source listings and documentation for MINIDOS and the disk driver subroutines which have been written for the 8080. This allows the user to have complete access to the disk to write any desired sector or number of sectors from any desired starting location to any desired destination memory address. A complete 8080 based disk operating system is not yet available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is your FD-8 Floppy Disk double density?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI Floppy Disk uses the GSI Model 110 drive which has the capability of operating in the double density mode. However, double density operation requires data to be written using a modified FM technique. This requires special data separator and data writing circuitry which is not contained within the present ver\u0026shy;sion of the FD-8. Double density version of the FD-8 will be introduced at a later time.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s18.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;JAPANESE AD #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/casio_pv2000_advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #7 \u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s7.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MOTOROLA AD.\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;In fact, this advert didn\u0027t promote the Macintosh II computer but the 68020 microprocessor.\u0026lt;br\u0026gt; Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; ...While Apple\u0027s choice of the MC 68020 was a smart move, there\u0027s no licence on genius: the 68020 is the microprocessor of choice in advanced business system design by such industry leaders as Altos, Alpha Micro, Casio, C.Itoh, Fujitsu, Honneywell Bull, NEC, NCR, Olivetti, Plexus, Ricoh, Sanyo, Sharp, TI, Toshiba and Unisys...\u0026lt;/font\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Apple_MacII_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ACORN AD #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert said:\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; Success in the future will depend upon confidence in using new technologies. That\u0027s why a computer in the home has to be more than just an interesting diversion or even a useful tool. It has to an investment in tomorrow for you and your children... \u0026lt;/font\u0026gt; \u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;8bs.com\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Acorn_MasterCompact_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH PRICE LIST\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is a part of a complete French price list of the C64 and VIC-20, including peripherals, accessories and software.\u0026lt;br\u0026gt; You can download the \u0026lt;a href\u003d\u0026quot;http://www.old-computers.com/Museum/downloads/Commodore/FrPriceList.zip\u0026quot;\u0026gt;complete version\u0026lt;/a\u0026gt;.\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;b\u0026gt;Jacques Sorro\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_64_FrPriceList_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UK ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;November 1987\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Special Spectrum offers before christmas period. Packages including a Sinclair joystick and 6 games.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Advert said:\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; The new Sinclair ZX Spectrum+3 is a real hero because it helps you to be one.\u0026lt;br\u0026gt; The fantastic 128K memory gives you the power to outsmart the most sophisticated ennemy...\u0026lt;br\u0026gt; ...But the real hero is the person who buy it...\u0026lt;/font\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Sinclair_SpectrumPlus3_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BROCHURE - CARTRIDGE LIST\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.retrorene.nl/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;Retro Rene\u0027s Gaming Corner\u0026lt;/a\u0026gt; for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/ormatu_spelcomputer-2001_brochure_4.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;GERMAN LEAFLET #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;The high performance Computer System for practice-oriented applications.\u0026quot; \u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;www.sharpmz.org\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Sharp_MZ3500_GermanAd_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;One of the first 1982 U.S. Advert.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Advert said \u0026lt;br\u0026gt;\u0026lt;br\u0026gt;THE COMMODORE 64 COULD BE THE MICROCOMPUTER INDUSTRY\u0027S OUTSTANDING NEW PRODUCT INTRODUCTION SINCE THE BIRTH OF THIS INDUSTRY.  (Shearson / American Express) \u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt;             The value of a computer is determined by what it can do. What it can do is largely determined by its memory.\u0026lt;br\u0026gt;             The Commodore 64\u0027s basic RAM is 64K. This amount of power is unusual in a micro at any price.\u0026lt;br\u0026gt;             At $595 it is astonishing.\u0026lt;br\u0026gt;             Compared with an Apple II+, for instance, the Commodore 64 offers 33% more power and considerably les than 50% of the cost.\u0026lt;br\u0026gt;             Compared with anything else, it\u0027s even more impressive...\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;             If you\u0027ve been waiting for the \u0026quot;computer revolution\u0026quot;, consider it as having arrived...  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_64_Advert_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PROMO PIC #6\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Thanks to its optional modem, the TO-7/70 could be connected to the Teletel communication network. This skilled photograph is browsing the Liberation (popular french newspaper) site. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; But there are still no cables shown here ! How the whole system is running ?!\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/thomson_to770_pub-libe.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (1980)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Dated december 1980\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/tandy_trs80-model1_ad_grande-ouverture_s.gif"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Dave Dunfield and his \u0026lt;a href\u003d\u0026quot;http://parse.com/~ddunfield/museum/index.htm\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;website\u0026lt;/a\u0026gt; for this advert\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/morrow_decision_ad_2_s.gif"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;IN SCHOOLS #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/bull_micral-80-22_in-use_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;TANDY BROCHURE COVER\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Cover of a Tandy catalogue.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Tandy_Model1_Advert_6.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (JAN. 1985)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;Laser 3000. For 5980F, play the double compatibility !\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/vtech_laser3000_pub_jouez-la-compatibilite.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1979)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The advert says:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt;The new ASC8000-6 single board computer is packed with ultra-high technology: Z80 double density computer, up to 2048Kb of high speed RAM, Floppy-disk and Winchester Hard Disk controllers, DMA, up to 6 serial / 2 parallel I/O, optional 32 bit floating point processor... All on one board, fully socketed, fully documented, reliable and maintainable...\u0026lt;/font\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Altos_Acs8000_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (JULY 1984)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sinclair_zx81_ad_initiateur_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (DEC. 1986)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/multitech_mpf_pub_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/welect_80-2_1.jpg",
  "builtInGames": "Two 8\u0027\u0027 disk-drives",
  "controllers": "",
  "media": "Two 8\u0027\u0027 disk-drives",
  "numGames": "",
  "peripherals": "",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}