{
  "name": "WREN",
  "manufacturer": "Thorn EMI",
  "type": "Transportable",
  "origin": "United Kingdom",
  "year": "1984",
  "production": "",
  "language": "",
  "keyboard": "Full-stroke keyboard with 5 function keys and arrow keys, 67 keys",
  "cpu": "Zilog Z80 A",
  "speed": "6 MHz",
  "coprocessor": "",
  "ram": "64 kb (up to 256 kb)",
  "vram": "32 kb",
  "rom": "8 kb",
  "text": "80 x 25 / 40 x 25",
  "graphics": "512 x 256",
  "colors": "monochrome built-in display",
  "sound": "",
  "size": "235 x 420 x 470 mm / 12 kg",
  "ports": "Centronics, RS232c, Winchester Hard Disk, Paddle (2), Modem socket, RGB video output",
  "power": "Built-in PSU",
  "price": "?1,000 (UK, april 84)2881  (France, october 84)",
  "description": "\nThe Wren was one of the last \u0026quot;laptop\u0026quot; CP/M computer. It can be described as a combined personal computer and Teletext terminal. It weights more than 12 Kg !\n\nThis Computer was assembled at the Thorn EMI factory in Treorchy South Wales. Only about 1000 were made before Wren went bust and many companys were left holding the parts for the other 9000 units that were part of the first production run. \n\nIt was very advanced for its day and the software package was very good quality and comprehensive for that era.\n\nAlthough the Wren computer was manufactured at Thorn EMI in Feltham, they were a subcontractor to Wren Computers Ltd.  Wren was a joint venture company between Transam Microsystems (www.transam.co.uk) and Prism (who distributed computers for Sinclair). Transam have recently been aquired by Eurodata Systems.\n\nThe Wren was sold with several good softs : Perfect Calc, Perfect Writer, Perfect Filer, Executive Desktop (agenda, phone directory, note-pad, etc.), the popular BBC Basic (the same as the Acorn BBC or the Electron) and a communication application. Indeed the Wren has a built-in modem and is Prestel (english videotex) compatible. But it can also be used to automaticaly dial phone numbers stored in a directory.\n\nThe whole system looks quite strong and robust. When transported, the whole monitor and drive assembly slides over the keyboard. The 7\u0026quot; built-in screen is monochrome but it is also possible to connect the WREN to an external RGB monitor. The two disk-drives (40 tracks) can stored 190k each. Weird fact : the drives LEDs light up when one of the floppies is selected but don\u0027t light off when this drive stop to work...\n\nQuality control was a major issue which certainly delayed production and caused a few financial problems for Wren. It might just have been too far advanced a concept for the time....\n \n\n\n",
  "shot": [],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PROUD !\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This authentic picture show a proud owner of a Wren transportable computer ! It looks like it bought it 5 minutes ago as he doesn\u0027t really know from which side to handle it...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/thorn-emi_wren_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.K. AD (APR. 86)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/ThornElmi_Wren_Advert_2.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/thorn-emi_wren_1.jpg",
  "builtInGames": "Two 5.25\u0027\u0027 built-in disk-drives (190k each)",
  "controllers": "",
  "media": "Two 5.25\u0027\u0027 built-in disk-drives (190k each)",
  "numGames": "",
  "peripherals": "",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}