{
  "name": "PC 6300",
  "manufacturer": "ATT",
  "type": "Professional Computer",
  "origin": "U.S.A.",
  "year": "June 1984",
  "production": "",
  "language": "GW-Basic delivered on disk",
  "keyboard": "QWERTY full-stroke keyboard, function keys, separated numeric keypad",
  "cpu": "Intel 8086",
  "speed": "8 MHz",
  "coprocessor": "optional Intel 8087 arithmetic co-processor",
  "ram": "128 kb or 256 kb, expandable to 640 kb",
  "vram": "",
  "rom": "16 kb",
  "text": "40 x 25, 80 x 25",
  "graphics": "640 x 400 - 640 x 200 - 320 x 200",
  "colors": "16",
  "sound": "Beeper",
  "size": "38 (W) x 37 (D) x 16 (H) cm / 14 kg",
  "ports": "RS232c, Centronics, mouse, keyboard, monitor, 7 expansion slots",
  "power": "Built-in PSU",
  "price": "Monochrome, 2xFDD $2745 - Color $3395 - Mono+10 MB HDD $3975",
  "description": "\nThe PC 6300 was in fact an Olivetti M24 sold under the ATT brand.\n\nLaunched a few months after the presentation of six new UNIX super-micro and mini ATT computers (march 1984), the PC 6300 was the first ATT system to be IBM PC compatible. It represented the low-end system of the ATT products.\n\nBut the PC-6300 (and the Olivetti M24) was an excellent PC compatible system, twice faster than the IBM PC XT computer thanks to a real 16 bit CPU, the Intel 8086, which ran at 8Mhz as opposed to the 8088 of the IBM PC running at 4,7Mhz. The standard graphic possibilities were also better than those of the IBM PC.\n\nMichael Hildenbrand reports :\nWhen I got it, there was also an option to get a 720k 3.5\nfloppy with it instead of the 5.25 floppy. When I got mine in 1986, one of the 5.25 floppy drives went bad and I had them replace it under warranty. It would have cost me $500 to replace it if I had had to replace it. Cool machine, anyway. I used that machine for many years!\n\nDavid Punia adds:\nDuring the early 80\u0027s, it became apparent that PC\u0027s were becoming an important tool to engineers and to businesses. The University of Vermont, where I worked at the time, was an early adopter of what later became common practice, that of requiring incoming students in certain disciplines to purchase personal computers.\n\nIn those days, compatibility was a huge issue, i.e. there was very little, so sole-source vendors were often chosen to supply PC\u0027s. The AT\u0026amp;T PC6300 offered a significant performance advantage over the IBM PC and others. It\u0027s full 16-bit processor/bus interface, 8 MHz processor, high resolution graphics modes (proprietary to Olivetti/AT\u0026amp;T) and 8087 math coprocessor socket made it a good choice for CAD, circuit analysis, and other graphical and math-intensive applications. There were a couple of 16-bit expansion slots also, but the card configuration was proprietary, eventually supplanted by the PC/AT\u0027s form factor for expansion cards.\n\nThe design of the chassis was interesting; the motherboard was accessed by removing the bottom cover of the system unit, exposing the entire motherboard. A daughterboard in the upper section of the system unit carried hardware for the expansion slots, and housed the drives. I still have one of these boxed away in my basement, with a side-attached hard drive chassis that could carry a full-height 5.25\u0026quot; hard disk. Mine has a 72 MB Seagate, about 5 pounds and $650 at the time, that dims the lights while it spins up ;-). and makes a loud clunk when the mechanical brake kicks in during power down.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ANOTHER VIEW\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;b\u0026gt;Blake Patterson\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/ATT_6300_System_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT, AUGUST 1985\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/ATT_6300_Advert_s1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [
    "http://www.obsoletecomputermuseum.org/att-6300.html"
  ],
  "image": "http://www.old-computers.com/museum/photos/att_pc6300_1.jpg",
  "builtInGames": "GW-Basic delivered on disk",
  "controllers": "",
  "media": "5.25\u0027\u0027 disk-drive (360k or 640k) and optional 10Mb hard-disk",
  "numGames": "",
  "peripherals": "",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}