{
  "name": "ADAM",
  "manufacturer": "Coleco",
  "type": "Home Computer",
  "origin": "U.S.A.",
  "year": "June 1983",
  "production": "1985",
  "language": "SmartWriter wordprocessor, Smart BASIC delivered on data-pack",
  "keyboard": "Full-stroke keyboard with separated arrow keys, ten command keys and six programmable function keys. 75 keys",
  "cpu": "Zilog Z80 A",
  "speed": "4 mHz",
  "coprocessor": "6801 Master-microcomputer",
  "ram": "64 kb (25 kb available with Smart Basic), upgradable to 144 kb",
  "vram": "16 kb",
  "rom": "32 kb",
  "text": "40 x 24 / 36 x 24",
  "graphics": "256 x 192",
  "colors": "16",
  "sound": "3 voices, 5 octaves",
  "size": "",
  "ports": "Cartridge slot (complete system only), RGB video out, 2 x Joystick sockets, expansion port, 2 x ADAMNET port (serial port used to connect printer, digital tapes and keyboard), 3 x card connectors inside the case",
  "power": "Built-in the printer !",
  "price": "$700 (USA, 1983)$300 (USA, 1985)$100 (USA, 1987)1510  (France, 1984)915  (France, 1985)",
  "description": "\nThe ADAM is available in two models, the complete system and Expansion Module #3. When the memory console of Expansion Module #3 is connected to the ColecoVision, the two models are essentially identical in function. The unit pictured here is the expasion module #3 (it is shorter than the complete unit). The expansion module #3 uses part of the Colecovision hardware, thus the memory unit doesn\u0027t have any cartridge slot, and isn\u0027t delivered with any controllers nor TV switch box.\n\nThe whole system is made of the daisywheel printer, the memory unit and the keyboard. The power supply is built-in the printer!\n\nThe Smart Basic isn\u0027t in ROM and has to be loaded from a tape, however there\u0027s a little word processor in ROM, this word processor prints the text to the printer at the same time the user types on the keyboard, but can also be used as a classic wordprocessor.\n\nThe Adam had a pretty short life, only two years! Despite this there is still a community of Adam fans who still use their system. Nowadays, most Adam users use a 320k 5 1/4 inch disk drive, an external 2400 baud modem, and a 20, 30 or 40 megabyte IDE harddisk. Adams often have memory expanders up to 2 MB in size (which is usually used as a RAM disk), and also a parallel printer (like a bubble jet)!\n\nGreg Bowman reports that he got an external CD drive for his Adam from his uncle who was then Vice President of Coleco. He notices that this CD drive was designed especially for the Adam. If anyone has more information about this CD drive, don\u0027t hesitate to mail us.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;COMPLETE UNIT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The memory unit was available in two versions : the complete Adam memory unit and the Expansion Module #3. This expansion module was meant for people already owning a Colecovision system. So part of the hardware is not in the module but in the Colecovision... In fact the Expansion module #3 uses the hardware of the Colecovision system ! \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The unit pictured here is the complete memory unit. We recognize it by its cartridge slot, necessary as there is no Colecovision system attached to this configuration. In fact the Colecovision system is literally built-in this complete unit. \u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_main-deck_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADAM PROTOTYPE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;When presented for the first time at the Chicago\u0027s Consumer Electronics Show in june 83, the Adam looked like this... \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; It\u0027s nearly identical to the final project, except for the digital tape drives which look more like the Exatron stringy-floppies than the digital data-packs finally adopted... Here the tapes seem to be loaded horizontaly into the drives.\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_prototype_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;EXPANSION MODULE #3\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is the expansion module #3, aimed for the people who already have a Colecovision system. Without the Colecovision, this version of Adam can\u0027t work ! It needs the hardware of the Colecovision. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The system looks like the complete version but its right part is shorter and there\u0027s no cartridge slot as the Colecovision provides one. The Colecovision plugs at the back of the main unit as shown on this picture.\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_module3_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MODULE #3 REAR\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This picture shows well how the Colecovision system is attached to the back of the expansion module #3.\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_module3_rear.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;COMPLETE MODULE #3\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is the complete configuration of the expansion module #3, except that there\u0027s normaly the Colecovision system attached to the back of the Adam unit... \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The black controller comes from the Colecovision and no \u0026quot;white\u0026quot; Adam specific controllers are sold with the Expansion Module #3, as the Colecovision provides already two of these...\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_module3_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MODULE #3 IN ACTION\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;A beautiful french woman using the built-in wordprocessor software of the Adam (expansion module #3 version). \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; In some countries, like in France for example, only the Expansion module #3 was available. Thus people wanting to buy an Adam, HAD to buy a Colecovision if they hadn\u0027t already one... This didn\u0027t help the sales at all !\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_module3_in-use.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MODULE #3 PROTOTYPE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;When presented for the first time at the Chicago\u0027s Consumer Electronics Show in june 83, the expansion module #3 looked like this... \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; It\u0027s nearly identical to the final project, except for the digital tape drives which look more like the Exatron stringy-floppies than the digital data-packs finally adopted... Here the tapes seem to be loaded horizontaly into the drives.\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_module3_prototype.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;KEYBOARD CLOSE-UP\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;It\u0027s a quite complete keyboard with 6 function keys, arrows keypad and numerous editing keys.\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_keyboard_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PRINTER\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;ADAM technical says : \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;i\u0026gt; The printer is a letter-quality, bi-directional, daisy wheel printer. Paper feeds into the printer through a friction-feed mechanism that accommodates single sheets of paper up to 9-1/2 inches wide. With the addition of an optional tractor-feed mechanism, the printer also accommodates continuous, \u0026quot;fan-fold\u0026quot; paper. Pitch is 10 characters to the inch, and printing speed is 10 characters per second. The printer contains two printed circuit boards, one for the printer and one for the power supply. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The printer houses two printed circuit boards: the Printer Board and the Linear Power Supply Board. The Printer Board includes a 6801 microcomputer and parallel drivers that control the printer\u0027s electro-mechanical devices. The electro-mechanical devices include the daisy wheel motor, the carriage motor, the platen advance mechanism, the print solenoid, and the ribbon solenoid. The Linear Power Supply Board includes regulators, rectifiers, and a transformer. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The printer 6801 communicates with the Master 6801 on the Memory and I/O Board via AdamNet to receive data to be printed, controls the motions of the printer\u0027s mechanical parts, and ensures that the printer performs the optimum number of motions simultaneously. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Within the printer 6801 RAM is a 16-character buffer for data being sent to the printer over AdamNet. The buffer ensures that time is not lost between characters being printed, and maximizes printing speed. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The printer 6801 responds to some ASCII control codes, including carriage return, line feed, backspace, escape, shift-out, and shift-in. Shift-out causes the printer 6801 to reverse its left and right directions, allowing printing from right to left. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The printer 6801 controls the printer\u0027s electro-mechanical devices. It also ensures that lateral carriage motion, rotation of the daisy wheel, and stepping of the platen can be activated simultaneously.\u0026lt;/i\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_printer_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;SYSTEM EXPLAINED\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is the expansion module #3. This Adam model can not work without the Colecovision game system. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(1)\u0026lt;/b\u0026gt; The separate keyboard is undoubtly an advantage very few home computers offered. It is complete and of good quality. The 6 function keys have their actions re-defined for each software used (with the built-in wordprocessor for example).\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(2)\u0026lt;/b\u0026gt; The joystick attached to the right of the keyboard is also a good idea. The control stick is small but efficient with all games.\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(3)\u0026lt;/b\u0026gt; The standard joystick offers two shooting buttons (same function). \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(4)\u0026lt;/b\u0026gt; The joystick\u0027s keys act as a numeric keypad and can be used in every Adam software. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(5)\u0026lt;/b\u0026gt; This plastic part helps to make the joystick a true keyboard extension.\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(6)\u0026lt;/b\u0026gt; Reset button used to reboot the complete system (console + computer). \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(7)\u0026lt;/b\u0026gt; Connecting the ColecoVision console with the Adam computer does not prevent from playing with the great choice of available game cartridges. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(8)\u0026lt;/b\u0026gt; This expansion port is used to connect the ColecoVision game system and the Adam computer.\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(9)\u0026lt;/b\u0026gt; Keyboard connector.\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(10)\u0026lt;/b\u0026gt; Housing for an optional second tape unit. The standard version of the Adam version is sold with only one tape unit. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(11)\u0026lt;/b\u0026gt; It looks like a standard cassette, but is a specially preformatted, thus costing much more... This means that standard cassettes can\u0027t be used. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(12)\u0026lt;/b\u0026gt; This is a smart tape recorder, much faster than a normal one and completely controled by the system for file management. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(13)\u0026lt;/b\u0026gt; Connector for the Adam printer which also provides power supply. Thus, the printer must always be turned on, even if it is not used. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(14)\u0026lt;/b\u0026gt; The Colecovision is fixed to the Adam through a fragile plastic plate. It is not recommended to move the whole unit too often. \u0026lt;br\u0026gt; \u0026lt;b\u0026gt;(15)\u0026lt;/b\u0026gt; Some logical functions of the ColecoVision console are used by the Adam module which hold the Z80 microprocessor and the memory. \u0026lt;br\u0026gt;  \u0026lt;b\u0026gt;(16)\u0026lt;/b\u0026gt; Joysticks housing. \u0026lt;br\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/s_ColecoAdam_Inside.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is the box of the complete system. It comes with joysticks as opposed to the Expansion Module #3 which doesn\u0027t.\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/photos/coleco_adam_box_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT#1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;I did click\u0026quot; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Cool french young boy, proud of its brand new Adam. Only the expansion module #3 version was available in France...\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/adverts/coleco_adam_advert-clic.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT#2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This is another french advert, not from CBS, but from an independant store \u0026quot;le jeu electronique\u0026quot;. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Only the expansion module #3 was available in France and people had to buy a Colecovision if they wanted to have an Adam !\u0026lt;/blockquote\u0026gt;",
      "link": "https://www.old-computers.com/museum/adverts/coleco_adam_advert_2.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [
    "http://www.sacnews.net/adamcomputer/",
    "http://drushel.cwru.edu/atm/atm.html",
    "HTTP://COLECO.FREESERVERS.COM/",
    "http://www.adamcon.org/"
  ],
  "image": "https://www.old-computers.com/museum/photos/coleco_adam.jpg",
  "builtInGames": "SmartWriter wordprocessor, Smart BASIC delivered on data-pack",
  "controllers": "",
  "media": "1 - Digital data pack reader (real to real magnetic tape encased in a Lexan cassette), 256 KB. There is a room for an optional second one",
  "numGames": "",
  "peripherals": "Second digital data-pack drive, 5\u0027\u00271/4 disk-drive, modem, 64k RAM expansion",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": "",
  "categoryId": 0
}