{
  "name": "32:16",
  "manufacturer": "Fortune",
  "type": "Professional Computer",
  "origin": "United Kingdom",
  "year": "1982",
  "production": "",
  "language": "None",
  "keyboard": "Full-stroke 99 keys with numeric keypad and 16 function keys",
  "cpu": "Motorola 68000",
  "speed": "6 Mhz",
  "coprocessor": "",
  "ram": "from 256 KB, to 2 MB (4 x 256 KB  + 1 MB)",
  "vram": "",
  "rom": "unknown",
  "text": "80 chars. x 24 lines",
  "graphics": "optional High resolution graphic card",
  "colors": "Monochrome",
  "sound": "Beeper",
  "size": "Total system weight : 24 Kgs",
  "ports": "External hard-disk unit, Serial RS232 (up to 16), monochrome display",
  "power": "Built-in power supply unit",
  "price": "from $5000 to about $15000 according to hardware configuration",
  "description": "\nWhen the 32:16 was launched, Fortune Systems Corp. advertised that it was the first integrated Unix-based system for $5000. Actually, the cheaper version was a single floppy disc, single user system that was never sold. A practical small business multiuser configuation, called System 10, and including a 10 MB hard disk and 512 KB of RAM costed about $9000.\n \nThe system could support up to 4 four-port serial terminal controllers and several other peripheral controllers: storage modules, Parallel interfaces, high resolution graphic board and Ethernet network board. The keyboard was a close cousin of the Wang word-processing system one. Keys was well arranged and color coded. The system came with different hard-disk storage options, 5, 10, 20 or even 70 MB on latest models.\n\nThe Fortune 32:16 was a true multiuser multitasking Unix based system offering services that was a length ahead over CP/M\u0027s. However, both Unix and Fortune was new to most of the dealers and users. Fortune offered them training courses in hardware, operating system and application software. \n\nA wide range of high quality business application software was available, as well as programming  languages, like a very extended BASIC able to convert code written in other BASICs (AppleSoft, MBASIC, CBASIC, TRS-80 BASIC), PASCAL, FORTRAN 77, COBOL and, of course, C language.\n\nThe 32:16 was also built and sold in France by Thomson under the name of Micromega 32\n\n \n\n\n",
  "shot": [],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UK ADVERT, OCT. 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Fortune_3216_Advert_s1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/Fortune_3216_System_1.jpg",
  "builtInGames": "None",
  "controllers": "",
  "media": "One or two 5\u0027\u00271/4 800 KB FDD -  Hard disk from 5 to 70 MB - optional tape unit",
  "numGames": "",
  "peripherals": "External hard disk, cartridge tape,",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}