{
  "name": "Cortex",
  "manufacturer": "CW/P",
  "type": "Professional Computer",
  "origin": "United Kingdom",
  "year": "1983",
  "production": "",
  "language": "None",
  "keyboard": "Full stroke 83 keys, PC style, 10 function keys and numeric keypad",
  "cpu": "Z80A,",
  "speed": "4 MHz",
  "coprocessor": "6502 (Screen)",
  "ram": "64 KB",
  "vram": "40 KB",
  "rom": "Unknown",
  "text": "80 chars x 25 lines",
  "graphics": "640 x 300 pixels",
  "colors": "Monochrome",
  "sound": "Beeper",
  "size": "34 (W) x 31 (D) x 30 (H) cm",
  "ports": "Parallel Centronics, Serial RS-232",
  "power": "Built-in power supply unit",
  "price": "?1795 (U.K., 1984)",
  "description": "\nWith a few modifications en route, the Cortex system was bought by the British company C/WP (\u0026quot;Computers and Word Processors\u0026quot;) from Ontel in USA where it was called Amigo.\n\nMajor modifications were both to hardware, including easy service access, and software, all designed to make this micro more friendly.  CW/P aimed it firmly at the mainstream office Word Processor market.\n\nThe Cortex was in three main units, the keyboard, disc drive and display which housed the main logic board. The plastic housing was available in six vivid colours (some of them were not really restful on the eyes). Only four screws allowed to quickly change any part of the system.\n\nThe IBM-like keyboard was set up to generate various Wordstar control codes, and the version of WordStar shipped with it was modified to use them.\n\nIt was basically a CP/M machine with some improvements: second processor for display management and graphics capabilities. It was also one of the first machines that GSX (Digital Research\u0027s graphics standard) was supported on.\n\nThe weird styling and high price relative to other CP/M boxes didn\u0027t help it in the market. Furthermore, its 8-bit processor couldn\u0027t compete with the new wave of 16-bit professional computers, and the Cortex never met a large success although it was a nice, small-footprint machine.\n\n\n \n\n\n",
  "shot": [],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.K. AD. 1984\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; CORTEX has been designed not to dominate your desk, to leave room for your calendar, your telephone, your in-tray and the rest. If you want it inconspicuous, buy iy in conventional cream. But for extroverts, and the fashion conscious, CORTEX comes in bright, bright colours - warm red, C/WP green, sunshine yellow, ice white and all black...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/CWP_Cortex_Advert_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/CWP_Cortex_System_1.jpg",
  "builtInGames": "None",
  "controllers": "",
  "media": "2 x 200 KB 5.25\u0027\u0027 floppy disc drives in separate unit",
  "numGames": "",
  "peripherals": "5.25\u0027\u0027 or 8\u0027\u0027 Hard disk controller connector, 800 KB 5.25\u0027\u0027 floppy drives",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}