{
  "name": "HP-9830",
  "manufacturer": "Hewlett Packard",
  "type": "Professional Computer",
  "origin": "U.S.A.",
  "year": "December 1972",
  "production": "1977",
  "language": "HP BASIC Plus",
  "keyboard": "Full stroke 107 key with numeric keypad, Function and arrow keys",
  "cpu": "4-board CPU set, 16--bit microprogrammed processor",
  "speed": "Unknown",
  "coprocessor": "",
  "ram": "3.5 KB up to 16 KB - 9830B: 16 KB",
  "vram": "",
  "rom": "From 15 KB up to 62 KB (31 KB of 16-bit words)",
  "text": "LED display. 1 line x 32 alphanumeric chars.",
  "graphics": "None",
  "colors": "Red!",
  "sound": "Built-in speaker and \u0026quot;BEEP\u0026quot; command in the Basic interpreter",
  "size": "46 (W) x 63.5 (D) x 15.2(H) cm / 21 kg",
  "ports": "5 x ROM module slots, 4 x interface module slots",
  "power": "Built-in power supply unit",
  "price": "$6000",
  "description": "\nThe HP 9810, 9820 and 9830 were all announced simultaneously by HP in the December 1972 HP Journal. They were all four bit machines and all of them used a serial bus internally. \n\nThe 9830 was by far the most capable machine of this group and ran what HP called BASIC Plus. In many ways, it was one of the first true \u0026quot;Personal Computers\u0026quot; ever marketed.\n\nThe 9830 was also significantly more expandable than the 9810/9820, with five user-accessable ROM cartridge slots. The 9830-B was introduced four years later in the 1977 HP catalog. HP said that three things set the HP 9830 apart from the other desktop systems:\n? First, it\u0027s used of BASIC Plus with it\u0027s English like vocabulary and structure,\n? Second, the entire operating system and firmware were in ROM and did not take up any of the read/write memory space,\n? Third, the use of the cassette tape drive with features that they said were only found on large computers.\nThe basic 9830 came with 1760 16 bit words of memory, a 32 character display, the cassette tape drive and a large well-featured keyboard.\n\nIn addition to the ROM cartridge slots, the 9830 could hold three more ROMs internally. The internal ROMs were on cards instead of plug in cartridges and had to be installed by HP. When the internal ROMs or extra memory were installed, a sticker that listed the ROM or new memory size and option number was added to the outside ROM door.\nThe 9830A came with 3520 bytes (1760 words) of memory and could be expanded up to 15808 bytes (7904 words). The 9830B came with 15808 bytes (7904 words) of memory and could be expanded up to 30144 bytes (15072 words). The Matrix and String Variables ROM cards were also standard in the 9830-B. \n\nThe HP 9830 was commonly found with a special version of HP 9866 printer (see picture) that sits on top of the calculator and looks like it\u0027s part of the original machine. The 9866 was a full width page printer that printed up to 80 columns of characters on thermal roll paper. It could print a full 80 character width using 5 x 7 dot matrix characters at 240 lines per minute. It could also print simple plots and tables or other formatted text. The \u0026quot;B\u0026quot; version of this printer was introduced in 1977 and it added the capability of printing both upper and lower case letters and vertical lines. The printer used a short cable that connected to a special socket on the back of the computer. \n\nThe HP 9830 was dropped from the HP catalog after 1977 or 1978. But, in 2000, some companies still used it...since 1975! \n\nThanks to Joe for most of the information.\n_______________________",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;TOP VIEW\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/HP_9830_Top_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;KEYBOARD CLOSE-UP\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/HP_9830_Keyboard_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;LEFT SIDE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Five ROM cartridges could be plugged in by the user. Four internal slots for additional ROM firmware were also available.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/HP_9830_LeftSide_1.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;DECEMBER 1972 HP JOURNAL\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy \u0026lt;b\u0026gt;Joe Rigdon\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/HP_9830_HPjournal_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [
    "computer.asp?st\u003d1\u0026amp;c\u003d938",
    "computer.asp?st\u003d1\u0026amp;c\u003d879",
    "computer.asp?st\u003d1\u0026amp;c\u003d930",
    "computer.asp?st\u003d1\u0026amp;c\u003d1068",
    "computer.asp?st\u003d1\u0026amp;c\u003d141",
    "http://www.hpmuseum.net",
    "http://www.classiccmp.org/hp/9800.htm",
    "http://www.oldcalculatormuseum.com/hp9830a.html"
  ],
  "image": "http://www.old-computers.com/museum/photos/HP_9830_System_1.jpg",
  "builtInGames": "HP BASIC Plus",
  "controllers": "",
  "media": "Cartridge tape drive (2 x 64 KB sides)",
  "numGames": "",
  "peripherals": "I/O modules: Serial, Parallel, BCD, external FDD, HDD, General I/O, AD/DA converter, etc...",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}