{
  "name": "Colour TV Game (model n? 01 / 4931)",
  "manufacturer": "Binatone",
  "type": "",
  "origin": "United Kingdom",
  "year": "? 1978",
  "production": "",
  "language": "4 games : squash, squash practice, football, tennis",
  "keyboard": "Two detachable paddles with knob",
  "cpu": "Unknown",
  "speed": "Start, Manual serve",
  "coprocessor": "Game selection and player options (power, speed, bat size, angle, serve, sound)",
  "ram": "On screen",
  "vram": "",
  "rom": "",
  "text": "",
  "graphics": "",
  "colors": "No, black \u0026amp; white display",
  "sound": "Built-in speaker",
  "size": "",
  "ports": "RF TV video output, 2 x controller plugs",
  "power": "External power supply unit",
  "price": "?21.95 excluding vat (UK, 197x)",
  "description": "\nThis pong is one of the many Binatone systems. It is the first of the \u0026quot;Colour TV game\u0026quot; serie and offers 4 pong games (squash, squash practise, football, tennis).\n\nIn order to understand how this system fits into the Binatone pong range, here is simplified list of the systems :\n\nTV Master MK IV\nTV Master 4 plus 2\nTV Master MK 6\nTV Master MK 8\nTV Master MK 10\n\nColour TV Game\nColour TV Game 4 plus 2\nColour TV Game MK 6\nColour TV Game MK 10\n\nThe TV master serie are black \u0026amp; white pongs (first generation). The Colour TV Game system is the same as the TV Master MK IV except that the games are in colour.\n\nSo how to differentiate a Colour TV Game from a TV Master MK IV ? Well first, the name... ;-) The underside and switches of the former are grey while those of the TV Master are orange. The Colour TV Game has also a small \u0027colour\u0027 logo next to its name (upper right).\n\nThe paddles are rather small, with one knob each, but are detachable and connected to the system through two small sockets. One interesting feature is that there is a switch to turn sound on / off (great !).\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;CONTROL PANEL\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/binatone_colour-tv-game_pc.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/binatone_4931_box.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;GERMAN ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;i\u0026gt;A computer, which grows with your requirements\u0026lt;/i\u0026gt; \u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;b\u0026gt;Joscelyn Flores\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Casio_FP6000_GermAdvert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PROMOTIONAL LEAFLET\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;cover\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/thomson_to770_promo_couv.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MAIL ORDER\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Computer assisted mail-order \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; As soon as the home computers could communicate easily through modem with large computer sites, the major mail-order companies had the idea to sell products to the computers users. This  concept was facilitated in France by the free distribution of the \u0027Minitel\u0027 Videotex terminal that was gradually integrated into home computers. The success gained by this system in France did not have any equal in the rest of the world.  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Thomson_TO7_MailOrder_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;AMTEXT BROCHURE #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The brochure says:\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; When you buy, lease or rent word processing equipment from AM Jacquard Systems, you get our total commitment, now and in the future, that assures the successful installation and operation of your AMtext word processing system. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; To support that commitment, we have offices in over 100 cities throughout North America staffed with skilled professionals ready to meet your neads with planning, training. supplies, and service... \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; ...The AMtext 100 is a true shared resource, multifunction information system capable of supporting multiple work stations and peripherals simultaneously. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The Amtext 425 and 425A are powerful stand-alone work stations with a full-page video display \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The AMtext 225 is a low-cost system that turns electric typewriters into flexible text editors. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The AMtext product line includes a complete selection of peripheral devices, including telecommunications, an optical character reader. magnetic card reader, phototypesetters, daisy wheel printers. high-speed line and matrix printers, as well as mass storage on floppy and hard disk drive units.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Jacquard_J100_AmText_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FIRST AD\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;February 1983 - The real-size system picture occupied almost the full right page. \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/HP_75C_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;IBM T-SHIRT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/IBM_AT_T-shirt_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/LNW_LNW80_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US AD. JUNE 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This advert puts forward network capabilities of Televideo systems.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; ... If you want a personal computer that gives you professional performances, it\u0027s obvious that you have a lot of choices for today.\u0026lt;br\u0026gt; But there\u0027s only one with choices for tomorrow. Televideo ...\u0026lt;/font\u0026gt; \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Televideo_PM4T_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;QD VERSION ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;1980 Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt;Our new QD model has all of the features of our phenomenally popular SuperBrain with the addition of double-sided disk drives and an extra of dynamic RAM. So, for only a modest increase in price, you can order your next SuperBrain with more than twice the disk and memory storage capability. But, best of all, the new QD model has the same tough, rugged construction and exceptional quality that made our SuperBrain such a success. \u0026lt;/font\u0026gt;  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Intertec_SuperBrain_QD_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PROMOTIONAL PICTURE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;School teaching with a Goupil 2\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/smt_goupil2_promo_school-teaching.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PROTOTYPE SOFTWARE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This picture from an early advert published in january 1983 is very interesting (the TO-7 was just released then). The text below it said \u0026quot;Hours of entertainment...\u0026quot;. But when you look more carefully at the software boxes you realise that they are fake! Only the two extreme boxes are real, but still shows the same game title \u0026quot;3-D TIC-TAC TOE\u0026quot;! So there is only one game presented here! The photograph was surely taken at an early development stage... \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Even the name of the computer written on top of the boxes: \u0026quot;TOM 7\u0026quot; (Tele Ordinateur Multimedia?) seems to be an early name for the TO-7... \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Hours of entertainment they said...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/thomson_to7_software-proto.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #19\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What kind of diskettes do you recommend for use with the FD-8?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have our diskettes manufactured by the Dysan Corporation. They are packaged for us under the MSI label and have proven to be the most reliable diskettes available for use with the FD-8. We have tried other manufactur\u0026shy;ers but have found none to be as reliable as Dysan. We pay more money for Dysan diskettes and, as a result, cannot offer them at a price quite as competitive as some other manufac\u0026shy;turers. However, we feel that the reliability is most important. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does the FD-8 use IBM compatible format?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 is not IBM compatible since we use hard-sectoring on the diskette. Our format uses 16 sectors of 256 data bytes each per track. In addition, track and sector identification, checksum (CRC), and other error checking information is written on each sector in addition to the data. This gives a total capacity of 315,392 bytes of data which can be stored per diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are diskette hardholes, and what do they do?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Hardholes are small mylar doughnuts which may be affixed to the center hole of a diskette for additional protection. It is possible to damage the center hole of a diskette if it is not properly centered at the time the disk drive door is closed. The mylar doughnut serves to reinforce the center hole of the diskette and give it additional protection against damage. The hard hole also provides for additional fric\u0026shy;tion between the diskette and the clamping hub in order to provent slippage of the diskette dur\u0026shy;ing rotation. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does MSI offer application software packages?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI is in the process of developing ap\u0026shy;plication software for use with the FD-8 System. We will be offering a library of standard busi\u0026shy;ness programs for accounting, inventory and mail list applications in the near future. These programs will be written in BASIC using the disk data file capability of the FD-8. The availability of application software will be announced in periodic MSI newsletters and will be made available to FD-8 users for a small copying charge plus the cost of the diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does a user program library exist for the MSI FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We are in the process of organizing a user group for the FD-8. Users of the FD-8 System are encouraged to submit programs which may be included in the user library. Member\u0026shy;ship in the user group may be achieved by either submitting a program for publication or by payment of a nominal membership fee. Membership then entitles the user to receive periodic listings of user library contents and newsletters. Programs contained within the user library will be made available for a small copying charge. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between MSI TAPE BASIC and MSI BASIC used with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have added several features to the MSI version of BASIC. We offer multiple statements per line, user defined verbs, a string\u0026shy;length command which allows strings up to 128 characters to be used, and have increased the speed of execution. In addition, we have completely removed the dependence upon the MIKBUG ROM and MIKBUG RAM areas. The stack pointers have been moved to the user program area, and the input/output routines for each of the ports are fully documented so that these can be easily changed. Interrupts are now allowed and can be used to vector the program to a user subroutine and then return to BASIC. We are also developing multi-user BASIC which will be released in the near future. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can MSI BASIC and the disk operating system be relocated?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Essentially, no difference exists between the two versions of BASIC insofar as the BASIC interpreter is concerned. The tape version has disk and DOS commands removed from its library. The interpreter resides from memory location $0100 to $1 FFF in both versions. In addition, memory locations below $0100 are used as pointers. In the Disk version, memory locations from $2000 - $2FFF are used to con\u0026shy;tain disk driver subroutines, DOS, and other file handling routines. User memory begins at $2000 for the tape version and $3800 in the Disk version of BASIC. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between SWTP 8K BASIC and MSI BASIC?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; It is not considered feasible to attempt relocation of these programs since so many of the individual routines which are used in the disk operating system are integrated. It would require a major revision of the disk operating system, BASIC, coresident assembler/editor and other associated utility programs before such a relocation could be performed. However, a version of MSI BASIC will soon be available on PROM which will reside at a high memory location. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; How difficult is it to run MSI BASIC and the disk operating system on the Motorola Ex\u0026shy;orciser, or other 6800 based microcomputer systems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The primary changes which must be made are in the input and output character routines. These routines must be changed in all MSI software so as to be compatible with the sys\u0026shy;tem on which software is running. In addition, the PIA Interface which communicates with the disk, the FD-8, is presently located at mem\u0026shy;ory address $801 C. A PIA residing at this ad\u0026shy;dress will also be necessary, or alternatively, this address must also be changed in the disk driver subroutines. Several different versions of the MSI software package are currently being developed for use with other 6800 systems. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle tape commands as well as disk?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the commands TSAVE AND TLOAD are used with the tape, whereas the commands SAVE and LOAD are reserved for use with the disk. It is also possible to place a label at the front of a block which is saved on tape. When this label is specified during a LOAD opera\u0026shy;tion, the program will search for the appropriate block on tape before loading in the information which has been stored on the tape. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle data files?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, both random and sequential data files are available for the disk system under MSI BASIC. Named files for object code, source code, BASIC program, and BASIC data files are all available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have heard that 1702A PROMs are too slow for use with 6800 systems running at full clock speed. Is this true?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; This is not true, if the memory addressing scheme employed by MSI is used to address the 1702A PROMs. The MSI PROM/RAM Board does not employ Phase 2 of the clock in the memory addressing scheme. This permits a tolerable memory access time of approxi\u0026shy;mately 9OQns. MSI uses 650ns access time 1702A PROMs in all applications. This provides completely satisfactory reliability of operation. We have experienced no problems whatsoever when using fast 1702As. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I buy a Bootstrap routine on PROM in order to bring the disk system into operation quickly?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, MSI is presently delivering a 512 byte Bootstrap Program known as Short Boot. This routine is available on a two-PROM set using 1702A PROMs for use with the MSI PROM/RAM Board. Short Boot and the PROM Board are delivered with most Disk Systems. This allows the disk to be placed into operation by simply executing the Bootstrap routine which is orged at $COOO. The system then responds immediately with DOS READY and programs may then be called immediately by file name. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I am interested in purchasing MSI software but am having a hard time evaluating its use\u0026shy;fulness. May I purchase the documentation for your disk system and BASIC separately for evaluation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the complete operating manual for the FD-8 Disk System may be purchased sep\u0026shy;arately for $35.00. This manual includes as\u0026shy;se\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s19.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (1984)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;I clicked\u0026quot;... \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/coleco_colecovision_advert_click.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sord_is11c_advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;SOFTCARD COPY\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;An advert for one of the numerous copies of the Microsoft SotfCard. Initially, they were manufactured in the United States then in Asia.   \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Apple_II_SoftcardCopy_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT, AUG. 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;\u0026lt;a href\u003d\u0026quot;http://www.aci.com.pl/mwichary/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;Attached\u0026lt;/a\u0026gt;\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Osborne_Executive_Advert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ENGLISH LEAFLET\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Advance_86_Engleaflet_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;April 1983 \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Advert said \u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; Simple Isn\u0027t it?. The COMPAQ portable computer can do what the IBM Personal Computer does. To go.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; It runs all the popular programs written for the IBM. It works for the same printers ans other peripherals. It even accepts the same optional expansion electronics that give it additional capabilities and fonctionality.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; There\u0027s really only one big difference. The COMPAQ computer is designed to travel.\u0026lt;br\u0026gt; Carry the COMPAQ computer from office to office. Carry it home on the weekend. Or take it on business trips...\u0026lt;/font\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Compaq_Portable_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;USA RADIO SHACK CATALOG (1991)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/tandy_wp2_ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UK ADVERT, OCT. 1983\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Semitech_PiedPiper_Advert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;KIT VERSION (1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Sinclair_ZX81_KitAdvert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.K. AD. (DEC. 1985)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_128_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This guy has so much power in his hands that he has attracted two girls (so far) in his swimming-pool ! \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Notice the classical symbol of the 80s adverts : the glass of orange juice with a straw...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/commodore_sx64_sweden-ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #18\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; In order to provide as much information as possible, we have selected the most frequently asked questions about MSI products for inclu\u0026shy;sion in our catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the MSI 6800 Computer\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are the main differences between the MSI 6800 Computer and the MP 6800 Com\u0026shy;puter manufactured by Southwest Technical Products Corporation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI 6800 Computer is bus compati\u0026shy;ble with the SWTP 6800 system. Both use the SS-50. bus architecture. However, the MSI 6800 overcomes the engineering disadvan\u0026shy;tages associated with the MIKBUG monitor, incomplete address decoding, interface ad\u0026shy;dresses in the middle of user memory, inade\u0026shy;quate power supply, and mother board capacity. The MSI 6800 system has a 20 amp power supply and a heavy duty mother board with 16 slots and gold-plated connectors. Our CPU Board has separate baud rate and system clocks, 4K of EPROM memory and a much improved MIKBUG compatible monitor. MSI interface cards bring all strappable options to a DB-25 connector on the rear panel via a rib\u0026shy;bon cable connector. This permits any terminal to be plugged into the computer without alteration of the interface card. Other advantages of the MSI 6800 are described in this catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use my SWTP memory boards and interface boards in the new MSI 6800 Com\u0026shy;puter?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, since the bus architecture is identical, they will worlk fine. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI 6800 mother board and power supply only to beef up my SWTP 6800 system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the MSI mother board (MB-1) has the same hole centers as the SWTP mother board and will mount easily in the SWTP chassis. However, the MSI interface adapter board (IA-1) must also be used to furnish an interface bus. The MSI power supply (PS-1) may also be used to replace the SWTP supply. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is the MSI6800 available wired and tested?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, see catalog listings. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI CPU card in my SWTP 6800 system in order to gain a faster system clock and on board EPROM memory?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, however the MSI power supply should also be used in order to adequately supply the EPROM memory. A MIKBUG replacement monitor must also be used if interface ad\u0026shy;dresses used by MIKBUG are to be retained. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the FD-8 Disk Memory System\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have an SWTP 6800 System. What is needed to hook up your FD..a Floppy Disk Memory to my system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD..a Disk Memory System interfaces to any microprocessor system via a single PIA chip. For the SWTP 6800 System, we furnish our PIA-1 interface card which plugs in directly to port 7 of the interface bus. A ribbon cable then plugs into the interface card and to the disk. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is provided with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides a complete disk operating system software package for use with 6800 based microprocessor systems. The operating system gives the user the capability of having named files at three levels: object code files, source code files for the assembler, and BASIC files. The system contains a coresident as\u0026shy;sembler/editor which can pull source files from disk, assemble, and pass object code to either tape cassette or disk memory. Password pro\u0026shy;tection is available for both program as well as random and sequential data.\u0026lt;br\u0026gt; The new TSC editor is now available in a MSI FD-8 disk version. This excellent editor allows very long source files to be stored on disk, edited, and assembled with the object code being placed on disk as well.\u0026lt;br\u0026gt; In BASIC, both program as well as random and sequential disk data files are available. All files are named with optional password pro\u0026shy;tection. Other basic programs on disk can be chained to or called as subroutines from a parent program. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What charges are made for software, and what documentation do I receive?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The complete disk operating system, in\u0026shy;cluding the coresident assembler/editor are provided free of charge with the purchase of an FD..a Disk System. A $65.00 charge is made for MSI BASIC. An operating manual for disk oper\u0026shy;ating system, assembler/editor, and BASIC is provided. Partial source documentation is also provided for the input and output routines and other appropriate addresses. In addition, com\u0026shy;plete source documentation is provided for the disk driver subroutines and MINIDOS which allows the user to read or write any desired sector or number of sectors from any beginning disk location to any destination in computer memory. This enables the user to have access to the disk in his own assembly language pro\u0026shy;grams or by direct communication with the control terminal completely independently from the MSI disk operating system. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is it possible to interface the FD-8 Floppy Disk to microcomputer systems using the 8080, Z80, or 6502 processors? If so, do you provide the technical details on interfacing?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 can be connected to any micro\u0026shy;processor via a single PIA chip interface. Elec\u0026shy;tronically, there is no difficulty in interfacing to any system since transfers between the disk and the host computer are carried out via a sector buffer RAM on the disk controller card. Information transfer is under the control of a crystal clock on the controller board, thus mak\u0026shy;ing the FD-8 completely independent from processor speed or clock frequency. It is possi\u0026shy;ble to interface the FD-8 using parallel data ports without a PIA chip, however, the software for interfacing has already been written for both 8080 and 6800 systems using a PIA interface. Since some of the ports are used bi-direction\u0026shy;ally, the PIA interface provides an overall sim\u0026shy;plifi9ation of the interfacing problem. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is available for 8080 sys\u0026shy;tems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides complete source listings and documentation for MINIDOS and the disk driver subroutines which have been written for the 8080. This allows the user to have complete access to the disk to write any desired sector or number of sectors from any desired starting location to any desired destination memory address. A complete 8080 based disk operating system is not yet available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is your FD-8 Floppy Disk double density?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI Floppy Disk uses the GSI Model 110 drive which has the capability of operating in the double density mode. However, double density operation requires data to be written using a modified FM technique. This requires special data separator and data writing circuitry which is not contained within the present ver\u0026shy;sion of the FD-8. Double density version of the FD-8 will be introduced at a later time.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s18.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [],
  "image": "http://www.old-computers.com/museum/photos/binatone_colour-tv-game.jpg",
  "builtInGames": "4 games : squash, squash practice, football, tennis",
  "controllers": "",
  "media": "",
  "numGames": "",
  "peripherals": "No",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}