{
  "name": "Benjamin Blümchen: Ein verrückter Tag im Zoo",
  "shortName": "benjamin-blmchen-ein-verrckter-tag-im-zoo",
  "description": "<i>Benjamin Blümchen: Ein verrückter Tag im Zoo</i> (&quot;A Crazy Day at the Zoo&quot;) is based on the long-running German children's audio play series starring talking elephant Benjamin Blümchen and his friends. In the game, Benjamin and his friend Otto are hired by newspaper reporter Karla Kolumna to take some photographs of the zoo animals for an article she's writing. This of course leads to all kinds of trouble for the two: they must navigate ice floats to get to the polar bear, take part in an animal race and must get back the camera when it's stolen (twice). Images in comic style illustrate the story between levels.<br><br>The game consists of six action-filled levels, with most of them featuring a unique gameplay mechanic. Levels one and six feature Benjamin in a side-scrolling environment. He must avoid household objects come to life or various animals while searching for the stage exit. His health is measured in sugar cubes that get removed if an enemy touches him. He can find new cubes in the levels, but losing them all means restarting the current stage.<br><br>Level two takes place underwater. Otto must swim through a cave system, avoiding dangerous plants and animals and periodically coming up for air. It's again Otto's turn in level three, which takes place on a large lake filled with water lily leaves, seen from a bird's eye view. Otto must jump from leaf to leaf to find the level exit. In level four, Benjamin finds himself in the house of zoo director Mr. Tierlieb and gets chased around by a mouse. Seen from a top-down perspective, it is the player's job to guide Benjamin through the house by not bumping into any furniture. Sugar cubes are again available to refill the elephant's health.<br><br>Level five is the animal race, consisting of three rounds. Otto rides a zebra and must take on two other children riding a kangaroo and an ostrich. The races are seen from a top-down perspective and consist of several laps. Acceleration pads on the tracks can be ridden over for a short speed boost.<br><br>Level progress is saved via passwords. It is always possible to play completed levels again, trying to get a better score by using less tries or by finishing in a better place in the race.",
  "publishedBy": "KIDDINX Entertainment GmbH",
  "developedBy": "BVM Produktion GmbH",
  "released": "Nov 06, 2001",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view, Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/benjamin-blmchen-ein-verrckter-tag-im-zoo",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "KIDDINX Entertainment GmbH",
          "developer": "BVM Produktion GmbH",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Nov 06, 2001",
          "ean13": "4 001504 321017",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/367395-benjamin-blumchen-ein-verruckter-tag-im-zoo-game-boy-color-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "Game Boy Color"
    },
    {
      "link": "/images/covers/l/367396-benjamin-blumchen-ein-verruckter-tag-im-zoo-game-boy-color-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "Game Boy Color"
    }
  ]
}