{
  "name": "Keitai Denj? Telefang: Speed Version",
  "shortName": "keitai-denj-telefang-speed-version",
  "description": "In the near future, special cell phones called D-Shot allow their users to teleport from place to place by interfacing with antenna trees. One day, a young man named Shigeki uses his D-Shot and is accidentally transported to another world which is inhabited by various cell phone-owning monsters called Denj?. The Denj? love to battle one another, and are willing to team up with humans who can help them hone their skills. These humans are known as T-Fangers, and Shigeki decides to become one and help solve problems in the Denj? world.<br><br>Shigeki starts with a single Denj? partner, and can befriend more by exchanging phone numbers with ones he has defeated in battle. Up to three of Shigeki's Denj? can participate in a single battle, but since only the starter Denj? travels with him, he will need to call the others and invite them to join the fight. Depending on where these other Denj? are stationed, it can potentially take several turns before they've arrived at the battlefield. A Denj? may have one of six elemental alignments, each of which trumps another in a rock-paper-scissors-style succession.<br><br>Denj? can evolve to become stronger and gain new attacks, and there are three methods of doing so. Natural evolution takes place once a Denj? has hit a certain level threshold. Mod evolution happens when Denj? are fused with certain items, and while it is easier than other forms of evolution, it typically provides the worst stat gains of any method. Finally, experimental evolution occurs when a Denj? is fused with DNA samples from other species.<br><br><i>Speed Version</i> is one of two versions of <i>Telefang</i>, the other being <a href=\"https://www.mobygames.com/game/keitai-denj-telefang-power-version\">Power Version</a>. The two versions have different sets of available Denj?, though players with different versions can trade with one another to complete their collections. Certain area layouts and puzzles also differ between versions.",
  "publishedBy": "Smilesoft Co.,Ltd.",
  "developedBy": "Natsume Co., Ltd.",
  "released": "Nov 03, 2000",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/keitai-denj-telefang-speed-version",
  "visual": "",
  "gamePlay": "Japanese-style RPG (JRPG)",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "Smilesoft Co.,Ltd.",
          "developer": "Natsume Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 03, 2000",
          "ean13": "4 542058 000053",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/947955-keitai-denju-telefang-speed-version-game-boy-color-screenshot.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}