{
  "name": "Knockout Kings",
  "shortName": "knockout-kings_",
  "description": "<i>Knockout Kings</i> is the only appearance of EA Sports' boxing series on the Game Boy Color, adapting several of the modes of the console versions and featuring a smaller selection of boxers.<br><br>The game includes ten all-time greats: Muhammad Ali, Oscar De La Hoya, Sugar Ray Leonard, Joe Frazier, Shane Mosley, Michael Grant, Lennox Lewis, Floyd Mayweather, and Rocky Marciano. Ringside commentary is provided via voice samples of Mills Lane.<br><br>Game modes include Slugfest, Career and Vs Mode (via link cable). In Slugfest mode, players select one of the legends and take on the other nine in a ladder of matches. In Career mode, players create their own boxer by picking nickname and weight and setting stats from a point pool. The career then progresses through a variety of divisions with fights against smaller opponents, with the hope of progressing far enough to take on the champions. Between matches, stats can be increased through training sessions. Progress is saved via passwords.<br><br>The fights are displayed in a 2D scrolling view of the ring, with the fighters drawn in a cartoony style with oversized heads. The controls allow for a variety of punches by combining the A, B and Start buttons with the D-Pad. Unlike in many other boxing games, there is only a single health bar that combines strength and stamina. When knocked down, button-mashing is necessary to get back up. In Slugfest mode, power-ups can be picked up that restore or increase strength, stamina or speed.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Digital Eclipse Software, Inc.",
  "released": "Dec, 1999",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Boxing",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/knockout-kings_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Digital Eclipse Software, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1999",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/463205-knockout-kings-game-boy-color-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/463206-knockout-kings-game-boy-color-screenshot-main-menu.png",
      "caption": "Main Menu"
    },
    {
      "link": "/images/shots/l/463208-knockout-kings-game-boy-color-screenshot-in-career-mode-you.png",
      "caption": "In career mode you have to create your own boxer"
    },
    {
      "link": "/images/shots/l/463209-knockout-kings-game-boy-color-screenshot-choose-boxer-screen.png",
      "caption": "Choose boxer screen"
    }
  ],
  "cover": []
}