{
  "name": "Little Magic",
  "shortName": "little-magic",
  "description": "May is an apprentice mage at Magic School and must pass the final exam.<br><br>A puzzle game seen from a top-down perspective. The goal of each level is to open the exit by pushing a magic stone on a designated spot. May can also push objects one tile ahead without moving herself. This is often used to get the stone over water that she can't cross herself. May's other ability is to create magic bubbles. She can create bubbles in three different sizes. Bubbles will pop after a certain amount of time, depending on their size. If they pop while next to the stone or another bubble, the stone or bubble will be moved one space. Since May can create several bubbles simultaneously, it is possible, and often necessary, to create chain reactions to maneuver the stone into the desired position.<br><br>As the game progresses, levels become increasingly difficult and new hazards and enemies are introduced. Enemies follow a set movement pattern and can sometimes be stopped, but not destroyed by magic bubbles. Later levels are made more complicated by different types of tiles including: grass that slows down May, ice that May and the magic stone will slip over, spikes that destroy the stone if it is pushed into them, collapsing tiles that can only be walked over once, rune tiles on which May cannot create magic bubbles, teleporters and others.",
  "publishedBy": "Altron Corporation",
  "developedBy": "Altron Corporation",
  "released": "Nov 26, 1999",
  "alsoFor": "SNES | Combined View",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/little-magic",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "Altron Corporation",
          "developer": "Altron Corporation",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 26, 1999",
          "ean13": "4 994964 111116",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}