{
  "name": "Nintama Rantar?: Ninjutsu Gakuen ni Ny?gaku Shiy? no Dan",
  "shortName": "nintama-rantar-ninjutsu-gakuen-ni-nygaku-shiy-no-dan",
  "description": "Nintama Rantar?: Ninjutsu Gakuen ni Ny?gaku Shiy? no Dan is based on the anime Nintama Rantar?. The game is a collection of 6 minigames. Five of these minigames can be accessed through the Shugy? no Maki (????) option. You can select one of three players for each minigame: Rantar? (???), KiriMaru (???), and ShinB? (????).<br><br>The first game in this mode is Ch?hitsu (???), where you must wall jump up 15 meters and reach the goal as fast as possible within 60 seconds. The second game is H?jutsu (??), where you must shoot as many targets as possible within 30 seconds. The third game is Shuriken (????). This plays similar to H?jutsu, where you must hit as many targets as possible within 30 seconds. However, the targets move up and down, and you can no longer move your character, and must move the D-pad left or right to aim, as well as pressing up to hit certain targets. The fourth game is Ashikogijutsu (????), where you must row 30 meters to the goal as fast as possible within 60 seconds. The last minigame in Shugy? no Maki is Eijutsu (??). This is similar to Ashikogijutsu; you must swim 30 meters to the goal as fast as possible in 60 seconds. However, you now have a breath meter, which means you must stop paddling when it gets to low and get your breath meter back up.<br><br>Finally, there is Taisen no Maki (????). In this game, you and your opponent aim to collect all 5 scrolls on the map. If you don't have all the scrolls because your opponent has the rest, you must attack them using one of three weapons; shurikens, spikes, and bombs. These can be picked up on the map and are generated randomly. Once you have all 5 scrolls, you must try to avoid the opponent until the 3-minute timer expires. Whoever has the most scrolls wins the game.\nYou play against two students (who the two students are depends on which character you choose), before finally going up against the teachers Doi and Yamada.<br><br>The game offers two-player support in Taisen no Maki, and features the option Kiroku no Maki (????), which allows the player to look at the high scores attained in the 5 Shugy? no Maki minigames.",
  "publishedBy": "ASK Co. Ltd.",
  "developedBy": "Polygon Magic, Inc.",
  "released": "Mar 23, 2001",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/nintama-rantar-ninjutsu-gakuen-ni-nygaku-shiy-no-dan",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "ASK Co. Ltd.",
          "developer": "Polygon Magic, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 23, 2001",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/890062-nintama-rantaro-ninjutsu-gakuen-ni-nyugaku-shiyo-no-dan-game.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/890063-nintama-rantaro-ninjutsu-gakuen-ni-nyugaku-shiyo-no-dan-game.png",
      "caption": "Main menu."
    },
    {
      "link": "/images/shots/l/890064-nintama-rantaro-ninjutsu-gakuen-ni-nyugaku-shiyo-no-dan-game.png",
      "caption": "One of the characters."
    },
    {
      "link": "/images/shots/l/890065-nintama-rantaro-ninjutsu-gakuen-ni-nyugaku-shiyo-no-dan-game.png",
      "caption": "Shuriken technique."
    }
  ],
  "cover": []
}