{
  "name": "Puchi Carat",
  "shortName": "puchi-carat",
  "description": "In the world of <i>Puchi Carat</i>, thieves stole the twelve gems that made the people's dreams come true. They sold them to evil sorcerers who used them to suppress the people. Now, a long time after these events, the gems came into the possession of twelve mysterious characters. Each one of them tries to get a hold of the remaining jewels to fulfill their dreams - some of them seek peace while others want to satisfy their hunger for power.<br><br>Puchi Carat takes its inspiration from the video game classic <a href=\"https://www.mobygames.com/search/quick?game=Breakout\">Breakout</a>. The player has to clear rows of gems with a ball launched from a cursor that can only move horizontally on the bottom of the screen. In regular intervals, the stones will move one row towards the bottom. Once they reach a line just above the cursor, the game is over. New rows of jewels also appear if the player is unable to catch the ball and it bounces off the floor on the very bottom of the screen.<br><br>The single player mode has four different variations. In trial mode, the player has to destroy a certain amount of rows to advance to the next level. Story mode pits the player against the computer in a split screen fashion. It is possible to send rows of stones to the other player in three different modes, depending on the attack pattern the player selected. The third mode is time attack: here the player competes for the fastest time destroying 50 rows of gems. The final mode is called rapid mode where the player competes for the highest number of rows they destroyed.<br><br>It is also possible to play against a human opponent. In this mode, difficulty and handicaps can be selected by the players. The player who wins the most rounds is the winner of the multiplayer match.",
  "publishedBy": "Taito Corporation",
  "developedBy": "ITL Co., Ltd., Taito Corporation",
  "released": "1999",
  "alsoFor": "Arcade, PlayStation, PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/puchi-carat",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Paddle / Pong",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "Taito Corporation",
          "developer": "ITL Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "1999",
          "ean13": "4 988611 990056",
          "comments": ""
        },
        {
          "publisher": "Evolution Entertainment srl.",
          "developer": "ITL Co., Ltd.",
          "ported": "",
          "country": " France, Germany, Italy, United Kingdom",
          "releaseDate": "2000",
          "ean13": "8 027190 002012",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}