{
  "name": "Singer Izek",
  "shortName": "singer-izek",
  "description": "A Game Boy cartridge that could interact with a bundled sewing machine that <a href=\"https://www.mobygames.com/search/quick?company=Singer+Corporation\">Singer Co.</a> hoped to use to attract new people to the world of loopers and bobbins. The devices are connected by a link cable that rolls out from inside the sewing machine.<br><br>The cartridge contains 84 stitch patterns, including abstract designs, symbols, numbers, and animals such as dolphins. A custom pattern may also be designed. Letters, in block, script, and outline fonts, may also be added to a stitching, ten at a time. The words you use can be added as favorites which can be easily reselected. The patterns can be put together in different combinations.<br><br>The cartridge also allows one to do buttonholes, by selecting between five different styles of holes. <br><br>Should something jam on the sewing machine, or some other sort of error occur, a diagram of the machine will appear on the screen with the trouble area flashing. Similarly, should the machine require any attention the information will be supplied through the screen.<br><br>On the Game Boy Color one can also set the color fabric and thread on the screen. ",
  "publishedBy": "JAGUAR",
  "developedBy": "Natsume Co., Ltd.",
  "released": "2000",
  "alsoFor": "",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/singer-izek",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "JAGUAR",
          "developer": "Natsume Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}