{
  "name": "Star Wars: Yoda Stories",
  "shortName": "star-wars-yoda-stories",
  "description": "<i>Star Wars: Yoda Stories</i> is the second game in Lucas Arts' <a href=\"https://www.mobygames.com/search/quick?gamegroup=LucasArts+Desktop+Adventures+series\">Desktop Adventures</a> series, which were designed as infinitely re-playable action/puzzle games to be played in short bursts. Set loosely during the events of the first three Star Wars movies (Episodes IV, V and VI), the player takes control of Luke Skywalker who is given pocedurally generated short adventures on every new playthrough.<br><br>The game starts on Dagobah, where the player must find Yoda to be given a randomly generated mission on either a desert planet, a snow planet or a forest planet (or moon for that matter). Missions vary from rescuing kidnapped allies to destroying Imperial bases to finding lost artifacts. As the game's storyline and puzzle design is based around trading or using multiple chains of items, Yoda always gives the player a single item to begin with. R2-D2 can also be picked up on Dagobah and can be used as a tooltip hint activator by dragging him onto any on-screen item or tile. After receiving the mission, the player is free to fly between Dagobah and the target planet with Luke's X-Wing.<br><br>When exploring the world, the player will come across friendly NPCs who can give hints or trade for items, houses which can be entered, and items scattered around the world. The world is also full of danger. The player starts with the lightsaber, which, when equipped, can be used to defeat Imperial troops, Tuskens or deadly creatures. Enemies can drop blasters, stormtrooper rifles or thermal detonators that the player can use for ranged combat, or rations and medical kits that the player can use to heal themselves.<br><br>The worlds generated can be rather large and filled with secrets and are divided into several key areas such as spaceports where the player can get healed by medical droids, puzzle areas where new items can be found, blockades which require items or puzzles to be solved, as well as teleporters, which the player can use to quickly traverse the world map if they have found the valuable locator item, which displays the world map. The locator also marks areas either solved or unsolved, so it becomes a valuable item to have. The player is allowed some limited manipulation of the game world in the form of pulling or pushing certain blocks, blowing up blockades, using the Force to move items around or even minor button combination puzzles.<br><br>The game is played with mouse controls: moving the mouse cursor holding down the left mouse button makes Luke move, while items and weapons are used by having the desired item in the active item slot and pressing the right mouse button. Alternatively, the player can use the arrow keys to move and the spacebar to use the item. Shift can be used to drag movable items around. The player can create unlimited save files at any time, restart the currently generated world any time when it's still loaded (such as during the game over screen) and generate a new world at any given time and even change the world generator to generate either small, medium or large worlds. The player can also change the combat difficulty and game speed from the options.<br><br>In the original Windows release, the game CD also includes <i>Star Wars: Making Magic</i>, an interactive behind-the-scenes look at the production of the Star Wars Special Edition release. ",
  "publishedBy": "THQ Inc.",
  "developedBy": "LucasArts Entertainment Company LLC, Torus Games Pty. Ltd.",
  "released": "Dec, 1999",
  "alsoFor": "Windows | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/star-wars-yoda-stories",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "LucasArts Entertainment Company LLC",
          "ported": "",
          "country": " United States",
          "releaseDate": "Dec, 1999",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/59880-star-wars-yoda-stories-game-boy-color-screenshot-intro.png",
      "caption": "Intro"
    },
    {
      "link": "/images/shots/l/59881-star-wars-yoda-stories-game-boy-color-screenshot-luke-is-this.png",
      "caption": "Luke is this orange one ;)"
    },
    {
      "link": "/images/shots/l/59882-star-wars-yoda-stories-game-boy-color-screenshot-near-the-forest.png",
      "caption": "Near the &quot;forest&quot;."
    },
    {
      "link": "/images/shots/l/59883-star-wars-yoda-stories-game-boy-color-screenshot-o-yes-i-can.png",
      "caption": "O yes, I can!"
    },
    {
      "link": "/images/shots/l/59884-star-wars-yoda-stories-game-boy-color-screenshot-fighting-scorpions.png",
      "caption": "Fighting scorpions"
    },
    {
      "link": "/images/shots/l/59885-star-wars-yoda-stories-game-boy-color-screenshot-fighting-gas.png",
      "caption": "Fighting gas-mask men ;)"
    },
    {
      "link": "/images/shots/l/59886-star-wars-yoda-stories-game-boy-color-screenshot-and-finally.png",
      "caption": "And finally fighting imperial soldiers."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/8817-star-wars-yoda-stories-game-boy-color-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Color"
    },
    {
      "link": "/images/covers/l/596521-star-wars-yoda-stories-game-boy-color-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Color"
    },
    {
      "link": "/images/covers/l/181161-star-wars-yoda-stories-game-boy-color-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Color"
    }
  ]
}