{
  "name": "The Wild Thornberrys: Rambler",
  "shortName": "wild-thornberrys-rambler_",
  "description": "<i>The Wild Thornberrys: Rambler</i> is a mini-game collection, and the first licensed game based off the television series. The plot of the game involves the family wanting to win the Gold Schweitzer Award for Best Nature Documentary, so they decide to travel the world in order to do so. <br><br>There are six different mini-games to play:<ul>\n<li>Beetle Mania: this game takes place in the African Savannah. Donnie, the show's wild child, is hungry for beetles. The player must collect them for him until he is full.</li><br>\n<li>Born to be Free: this game takes place on the Galapagos Islands. Eliza, the show's heroine, must rescue animals that have been trapped in cages by the evil poachers Kip &amp; Neil.</li><br>\n<li>Commvee Rally: this game takes place in the Congo. Debbie, Eliza's sister, must drive the commvee to collect CDs from her favourite band, which have been scattered outside due to a rainstorm.</li><br>\n<li>Down and Outback: this game takes place in the Australian Outback. The comvee tips over into a ravine and out spills a box of videotapes. Nigel, Eliza's father, has to collect them all while swinging on a rope.</li><br>\n<li>Monkey Business: this game takes place in the Amazon Rainforest. A group of marmosets steal the family's video camera, break it into pieces, and scatter it across the rainforest. Darwin, the family's pet monkey, has to collect all the pieces before everyone else comes back.</li><br>\n<li>You Ain't Seen Nothin' Yeti: this game takes place in the Himalayas mountains. Marianne, Eliza's mother, decides to capture footage of the elusive Yeti, but she'll have to photograph other animals first.</li></ul>There are three different difficulty levels - Wild, Wilder, &amp; Wildest - and they each have different endings. The number of items to collect in each game also varies by difficulty mode.",
  "publishedBy": "Mattel Interactive",
  "developedBy": "Vicarious Visions, Inc.",
  "released": "Nov, 2000",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-color/wild-thornberrys-rambler_",
  "visual": "2D scrolling",
  "gamePlay": "Mini-games, Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Color",
      "releases": [
        {
          "publisher": "Mattel Interactive",
          "developer": "Vicarious Visions, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov, 2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/895894-the-wild-thornberrys-rambler-game-boy-color-screenshot-title.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}