{"altername_name": ["Blue Doragon: Ikai no Kyoju", "Blue Dragon: Ikai no Kyojuu", "蓝龙 - 异界巨兽"], "name": "Blue Dragon: Awakened Shadow", "overview": "Customize your character and overcome formidable bosses in a grand adventure! In Blue Dragon: Awakened Shadow, the Nintendo DS sequel to the beloved Blue Dragon original, players will completely customize their character for the first time ever in the series and embark on epic quests to solve the mystery of the stolen Shadows. Blue Dragon: Awakened Shadow is designed to take full advantage of the Nintendo DS capabilities, allowing players to engage in impressive boss battles with up to two friends, and earn and trade exclusive items through local and Wi-Fi multiplayer, another first for the series. Featuring more than 30 hours of gameplay, players will enjoy real-time, action role-playing combat which allows them to attack enemies faster than ever before with multiple weapons or summon Shadow powers at will as they explore eight challenging worlds in an expansive 3D environment KEY • Brand New Head-to-Toe, Character Customization - Unique for Nintendo DS role-playing games, players will customize their character’s physical appearance, from gender, hair and facial expressions down to armor, weapons and even voice. Elemental and stats boosts can also be added to equipment through item synthesis • Fast Paced, Real-Time Combat - Quickly attack enemies with a variety of weapons or summon Shadow powers at will to unleash devastating spells. • Adventure Through Various 3D Worlds – Players can complete multiple quests at their own pace and roam expansive 3D worlds inhabited by formidable bosses. • Original Storyline Based in the Blue Dragon Universe – Set two years after the original 2007 Blue Dragon story, Blue Dragon: Awakened Shadow features multiple side quests to unlock special items and characters and continues the series' contemporary approach to traditional Japanese role-playing games.", "platform": "Nintendo DS", "release_date": "May 18, 2010", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Tri-crescendo", "publishers": "D3 Publisher", "genres": "Role-Playing", "max_players": "4", "cooperative": "No", "rating": "2.87", "wikipedia": "https://en.wikipedia.org/wiki/Blue_Dragon:_Awakened_Shadow", "video_link": "https://www.youtube.com/watch?v=VZ3aL4dpuAg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10789-blue-dragon-awakened-shadow\n"}