{"altername_name": ["Book Worm"], "name": "Bookworm", "overview": "Spell F-U-N on the run in an all-new Bookworm for the DS! Have an appetite for words? Then join Lex the Bookworm in the hit word-puzzle game created by PopCap for your Nintendo DS! Link letter tiles left, right, up and down to spell words and keep your bookworm smiling. Spell words to fill your bookshelves, unlock 20 themed folios and build out 18 unique library rooms. Boost your score using bonus words and Word of the Day. Then track your progress with the all-new Lex-Ray to see how big your Bookworm brain can be! Work wordy wonders in three game modes: Start with Classic for the most popular Bookworm experience. When you’re ready to test your skills, speed through the fast-paced Action mode. And if you want to compete with friends, match wits in Multiplayer mode. No matter which mode you like best, you’ll relax and tune up your brain every time you play! Features • Flex your lexicon in three game modes – Classic, Action and Multiplayer • Form words from 20 themed book collections • Unlock 18 rooms to build your library • Customize your game backgrounds with your libraries • Pick up and play — it’s easy to start working wordy wonders in seconds • Compete with friends and family with wireless Multiplayer • Unlimited levels to keep you rising up the ranks in the Hall of Fame • Boost scores and advance faster with Bonus Words and Reward Tiles • Learn the meanings of words you may not know along the way • Save your high scores and track your progress with the Lex-Ray • Take the brain-boosting fun anywhere you go!", "platform": "Nintendo DS", "release_date": "December 8, 2009", "game_type": "Released", "esrb": "E - Everyone", "developers": "Black Lantern Studios", "publishers": "PopCap Games", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "1.38", "wikipedia": "https://en.wikipedia.org/wiki/Bookworm_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12920-bookworm\n"}