{"altername_name": ["Broken Sword: La Leyenda de los Templarios - Montaje del Director"], "name": "Broken Sword: Shadow of the Templars: The Director's Cut", "overview": "Broken Sword: The Shadow of the Templars – Director’s Cut for the Nintendo DS system builds on the original, boasting a new and explosive narrative interwoven with the first story. After witnessing the brutal and horrifying murder of one of Paris’s richest and most influential statesman, the player will be pulled into a sinister conspiracy rooted in a long-forgotten medieval legend. New puzzles have been added that specifically utilize the unique DS stylus control. The game also features stunning animated facial expressions drawn by Dave Gibbons, artistic genius behind the comic book and upcoming movie Watchmen. • Intriguing storyline following a journalist’s eyewitness account of a tragic assassination. • DS stylus controls create a whole new level of interaction and accessibility to vibrant and detailed settings. • New hint system prevents players from ever getting stuck on puzzles by offering tips and advice when needed. • New story elements and settings – piecing together events before and after the original Broken Sword. • Exclusive puzzles add new depth to the exploration gameplay • Stunning hand-drawn illustrations by renowned artist Dave Gibbons. • Animated facial expressions depict empathetic and emotional storytelling", "platform": "Nintendo DS", "release_date": "March 24, 2009", "game_type": "Released", "esrb": "T - Teen", "developers": "Revolution Software", "publishers": "Ubisoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.16", "wikipedia": "https://en.wikipedia.org/wiki/Broken_Sword:_Shadow_of_the_Templars_%E2%80%93_The_Director%27s_Cut", "video_link": "http://www.youtube.com/watch?v=xCuREOrSke4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14668-broken-sword-shadow-of-the-templars-the-directors-cut\n"}