{"altername_name": ["Capitán América: Super Soldado"], "name": "Captain America: Super Soldier", "overview": "Become Captain America, the ultimate Super-Soldier, as you face the Red Skull’s army in this gripping original third-person action adventure set in the darkest days of World War II. Wield Captain America’s legendary shield to take out enemies at a distance, interact with your environment, and deflect incoming fire back at foes as you traverse Hydra’s massive castle to save the world from Cap’s villainous archenemies. Using a highly athletic combat system, spectacular shield attacks, melee combos, and fluid platforming, infiltrate a mysterious castle complex and battle the cunning scientist Arnim Zola, the Hydra Army, and a host of evil enemies under the Red Skull’s control. Move freely through castle battlegrounds that serve as both an acrobatic playground for Cap’s superhuman abilities and a house of mystery with enemies and danger at every turn. Penned by noted Marvel writer Christos Gage, the original story for Captain America’s first standalone console game adventure is set in the movie universe but created specifically for the game. The game features the voice of Chris Evans as Captain America and the compelling plot brings dramatic depth to gameplay with immersive twists and all-new cinematic action sequences. Get ready to hurl yourself shield-first into the fray—create your own superhuman feats with the superior force of the world’s first Super-Soldier at your fingertips.", "platform": "Nintendo DS", "release_date": "July 19, 2011", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Sega Europe", "publishers": "Sega", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.79", "wikipedia": "https://en.wikipedia.org/wiki/Captain_America:_Super_Soldier", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32524-captain-america-super-soldier\n"}