{"altername_name": [], "name": "Code Lyoko", "overview": "A Universal Game of Friendship Join Yumi, Ulrich, Odd and Jeremy in their fight to save planet Earth and the parallel universe Lyoko from total destruction! The central computer that runs Lyoko, has been infected by a megalomaniacal virus, X.A.N.A, that wants to take over the world. Within Lyoko one virtual being by the name of Aelita is fighting to take X.A.N.A. down, but she can't do it alone, and has recruited a team of boarding school students from Earth to help her. Now X.A.N.A. has set his sights on Earth and is sending pieces of the virus through to Earth. With an emphasis on team interaction, puzzle solving, exploration and intense combat, this game will provide a great deal of fun for fans of the Code Lyoko cartoon series. The fates of Lyoko and planet Earth are in your hands so fight, explore, drive and hack your way to victory in this Action-packed RPG adventure in the digital realm. Take on the roles of each of the four characters – Odd, Yumi, Ulrich and Aelita – and customize play based on each of their individual strengths. • Fight tons of enemies, find your way through virtual platforms and hack into towers through hacking puzzles. • Become a digital hero by using the upgrade system, allowing you to unlock new skills and upgrade your health or Magic Lyoko powers. Use your Lyoko Powers to perform extra abilities allowing you to resolve puzzle or go to unexplored sections. • Buy new equipment, armor items, and weapons with “Data Bits” dropped from defeated enemies. Jeremy re-codes the Data Bits into new virtual equipment for your characters. • Experience 3D Action Role Playing within the world of Lyoko and 2D Adventuring in the Real World. • Evolving characters, plenty of enemies, intense mini-games and fast driving sections will have Code Lyoko players blasting, fighting and exploring for hours on end! • Experience 15 quests and 15 levels and all the special Nintendo DS features such as the Touch Screen.", "platform": "Nintendo DS", "release_date": "May 15, 2007", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "DC Studios", "publishers": "The Game Factory", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Code_Lyoko_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14710-code-lyoko\n"}