{"altername_name": ["Cooking Mama 2: Cocina con tus Amigos"], "name": "Cooking Mama 2: Dinner with Friends", "overview": "New recipes, ingredients and friends Hot on the heels of her award-winning debut title’s sales success, Mama returns to the kitchen with new recipes, ingredients and friends in Cooking Mama 2: Dinner with Friends. Think your dishes are delicious? This time, only your hungry friends will be the judge of that! • Use the stylus as your ultimate cooking utensil to chop, grate, slice, stir, spread, sprinkle, roll, and much more in 150 different mini-games • Create 80 new recipes including macaroons, lobster, chili dogs, escargot, California rolls, seafood salad, shark fin soup, meatloaf, ice cream, bananas foster and many more! • Four gameplay modes including new additions to the series! • Cook with Mama: Even if you make mistakes Mama will help you complete the recipe so you can continue cooking. • Let’s Cook: You’re on your own without Mama’s help. Now it’s just you, the food and your nine hard-to-satisfy friends who will try out your creations and judge you based on how they taste. Mistakes made during preparation will affect the final taste so use caution in the kitchen! • Cooking Contest: Play against up to 3 friends with only one game card using wireless download play. All players complete various mini-games to determine who’s the better cook! • Change Design: Customize your kitchen décor or change up the background with various designs you earn through gameplay. You can even change Mama’s outfits and accessories! • Improved graphics and real-time effects make you feel like you’re actually cooking. Adjust your timing and make decisions about your next course of action based on what you see on screen (i.e. if food is starting to look burned, quickly remove it from the burner, etc.) • Recipes progress from simple to complex, from small to large dishes, so do your best to meet Mama’s expectations and impress your friends. If your friends think your dish is delicious, you’ll unlock another new friend! • Earn bronze, silver, and gold medals from Mama based on the quality of your cooking. • Keep a diary of your best creations and add earned seals to dress it up and share with in-game friends", "platform": "Nintendo DS", "release_date": "November 13, 2007", "game_type": "Released", "esrb": "E - Everyone", "developers": "Office Create", "publishers": "Majesco Entertainment", "genres": "Life Simulation", "max_players": "4", "cooperative": "No", "rating": "3.54", "wikipedia": "https://en.wikipedia.org/wiki/Cooking_Mama_2:_Dinner_with_Friends", "video_link": "http://www.youtube.com/watch?v=QZ830HbWx2c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8772-cooking-mama-2-dinner-with-friends\n"}