{"altername_name": ["Digimon Story Moonlight", "数码宝贝传说 - 月光"], "name": "Digimon World Dusk", "overview": "In Digimon World Dusk, take control of a Tamer from the elite Night Crow team of Dark Moon district. When a huge earthquake with unknown life energy strikes the Digital World, the whole town is heavily damaged. With rumors that the incident was caused by Light Fang team, it is now is up to you to find out what caused the incident, and restore the city. • Hundreds of Digimon: As you travel throughout the land, collect, tame, train, and evolve over 400 Digimon from 8 different species. Each game contains some unique and rare Digimon that can only be obtained through wireless communication with the other version of the game! • Never leave home without it: Digimon World: Dusk contains a new world map, which always shows where you have been and where you are currently located. The maps also show info on each dungeon, including what items and Digimon are available. • New & Improved Digifarm: Raise, train, and evolve your new Digimon at the Digifarm. While down on the Digifarm, you can chat with your Digimon, and install or remove Farm Goods! Different Farms and Farm Goods help your Digimon learn new abilities and boost stats, even while you are not at the DigiFarm! • Deep & Strategic Battle System: With intense 3 on 5 turn-based battles, manage your Digimon’s locations to gain an edge over your enemies. • Unique storyline and characters: Digimon World Dusk has a unique storyline that interweaves the stories of two very different characters and journeys! • Battle with your far-away friends: Take your Digimon to battle over wireless and Nintendo Wi-Fi Connection. The winner of wireless/Wi-Fi battles obtains “Tamer” points. Trade your Tamer points obtained during wireless/Wi-Fi battles for rare items! Rare Digimon can also be created by Digi-matching through wireless/Wi-Fi connection!", "platform": "Nintendo DS", "release_date": "September 18, 2007", "game_type": "Released", "esrb": "E - Everyone", "developers": "BEC", "publishers": "Namco Bandai Games", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "4.06", "wikipedia": "https://en.wikipedia.org/wiki/Digimon_World_Dawn_and_Dusk", "video_link": "https://www.youtube.com/watch?v=vEb93lRGfDc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13743-digimon-world-dusk\n"}