{"altername_name": ["Digimon Story Sunburst", "数码宝贝传说 - 日光"], "name": "Digimon World Dawn", "overview": "In Digimon World™ Dawn, take control of a rookie Digimon Tamer from the powerful Light Fang team of Sunshine district. When a huge earthquake with unknown life energy damages the access points to the Digital World, many Digimon mysteriously devolve into Digi-eggs. With rumors that the incident was caused by the Night Crow team, you must investigate the cause of the earthquake, understand what happened to the Digimon, and restore the city! • Hundreds of Digimon: As you travel throughout the land, collect, tame, train, and evolve over 400 Digimon from 8 different species. Each game contains some unique and rare Digimon that can only be obtained through wireless communication with the other version of the game! • Never leave home without it: Digimon World: Dawn contains a new world map, which always shows where you have been and where you are currently located. The maps also show info on each dungeon, including what items and Digimon are available. • New & Improved Digifarm: Raise, train, and evolve your new Digimon at the Digifarm. While down on the Digifarm, you can chat with your Digimon, and install or remove Farm Goods! Different Farms and Farm Goods help your Digimon learn new abilities and boost stats, even while you are not at the DigiFarm! • Deep & Strategic Battle System: With intense 3 on 5 turn-based battles, manage your Digimon’s locations to gain an edge over your enemies. • Unique storyline and characters: Digimon World Dawn has a unique storyline that interweaves the stories of two very different characters and journeys!", "platform": "Nintendo DS", "release_date": "September 18, 2007", "game_type": "Released", "esrb": "E - Everyone", "developers": "BEC", "publishers": "Namco Bandai Games", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "3.79", "wikipedia": "https://en.wikipedia.org/wiki/Digimon_World_Dawn_and_Dusk", "video_link": "https://www.youtube.com/watch?v=vEb93lRGfDc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13742-digimon-world-dawn\n"}