{"altername_name": ["Doragon Kuesuto Monsutazu Joka Tsu", "勇者斗恶龙怪兽篇joker 2"], "name": "Dragon Quest Monsters: Joker 2", "overview": "A Monster Scouting Report As Monster Scouts, players can recruit wild monsters to build a team and battle against other players in this turn-based role-playing game. Each year, monster scouts from around the world gather to compete for the title of world’s greatest scout. Players crash-land on a mysterious island after their airship is struck by lightning. They must rescue their missing passengers and crew members by fighting various enemies using their own monster parties. The only way off the island is to solve its many mysteries. • Become the world’s greatest Monster Scout in Dragon Quest Monsters: Joker 2, a spinoff of the fan-favorite DRAGON QUEST core series. Players scout and collect monsters in order to build a team to battle enemies. • When a player’s party encounters other monsters in a battle, they can try to recruit those monsters with their scouting skills. A meter on the top screen indicates the chance that players can scout a monster. The higher the number, the higher the chance the monster will join a player’s party. • More than 300 different monsters are available to scout and synthesize. By synthesizing two different monsters, players can create new, more powerful monsters. These monsters can be customized using more than 240 skill trees. Some monsters return from previous DRAGON QUEST games, while others are new. • In battles, monsters level up to learn new skills and become more powerful. • Players can battle their monster teams against one another using a local wireless connection. Or, using a broadband Internet connection, they can connect to Nintendo Wi-Fi Connection to battle against other players. • The Wi-Fi World Tournament lets players battle against other monster teams around the world. • The game supports a variety of Tag Mode options that let players connect and share data with others: • Players who connect via Tag Mode with owners of DRAGON QUEST VI: Realms of Revelation or DRAGON QUEST IX: Sentinels of the Starry Skies can scout monsters from those games. • Players who connect via Tag Mode with other Dragon Quest Monsters: Joker 2 players can battle against them and have a chance to scout their monsters without affecting their games.", "platform": "Nintendo DS", "release_date": "September 19, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Square Enix", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Dragon_Quest_Monsters:_Joker_2", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13798-dragon-quest-monsters-joker-2\n"}