{"altername_name": ["Slime of Gusto Dragon Quest 2: Tails Brigade and the Giant Tank", "Suraimu Morimori Doragon Kuesuto 2: Daisensha to Shippo Dan", "Slime MoriMori Dragon Quest 2: Daisensha to Shippo Dan", "元气史莱姆2"], "name": "Dragon Quest Heroes: Rocket Slime", "overview": "The latest game from the creative minds behind the 2005 RPG hit, Dragon Quest VIII: Journey of the Cursed KingTM, has arrived on the Nintendo DSTM. The hero of this brand-new action-adventure is a slime—one of the most popular monsters from the Dragon Quest series. Experience an action-packed adventure with slime rescue missions, addictive monster and item collection, and fierce multiplayer tank battles. The game is set in the kingdom of Slimenia, a peaceful land that is suddenly invaded by a mysterious cartel called “the Plob,” who then proceed to kidnap all the slimes in the capital city of Boingburg. Our protagonist, Rocket, is the only slime left behind, and must embark on a journey throughout Slimenia to save his friends and uncover the Plob’s nefarious plot! • Perform unique slime actions such as stretching, bouncing, carrying things on your head, and your awesome “Elasto Blast” attack! • Rescue your captured slime friends and collect items, money, and monsters as you solve the adventure stages. • Each adventure stage culminates in an exciting battle in your Schleiman Tank against other enemy Monster Tanks. • A cornucopia of colorful characters from the Dragon Quest world takes part in this wildly entertaining new adventure. • Customize your tanks by collecting a vast array of weapons and items. You can even shoot your fellow slimes or yourself from your tank’s cannons to infiltrate and sabotage the enemy’s Monster Tanks. • Simple, streamlined controls allow players of all ages and skill levels to take part in the action with ease. • With the Nintendo DS wireless play feature you can pit your tank against a friend’s in exciting player vs. player action.", "platform": "Nintendo DS", "release_date": "December 1, 2005", "game_type": "Released", "esrb": "E - Everyone", "developers": "TOSE", "publishers": "Square Enix", "genres": "Action", "max_players": "16", "cooperative": "No", "rating": "3.98", "wikipedia": "https://en.wikipedia.org/wiki/Dragon_Quest_Heroes:_Rocket_Slime", "video_link": "https://www.youtube.com/watch?v=XW6yEhsuvkk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10627-dragon-quest-heroes-rocket-slime\n"}