{"altername_name": ["Dragon Quest: The Chapters of the Chosen", "Dragon Quest IV: Michibikareshi Monotachi", "Dragon Quest 4: Chapters of the Chosen", "Dragon Quest IV Capítulos de los Elegidos", "勇者斗恶龙4被引导的人们"], "name": "Dragon Quest IV: Chapters of the Chosen", "overview": "A prestigious army captain, an adventurous princess seeking to test her skills beyond palace walls, a humble merchant aspiring to open his own shop, and two sisters who wish to avenge their father’s death… These seemingly unrelated individuals will soon cross paths when fate brings them together to journey alongside you, the hero. Dive into this unique adventure, and discover an epic tale told through the experiences and emotions of characters from all walks of life. For the first time, a full-fledged DRAGON QUEST adventure arrives on Nintendo DS with DRAGON QUEST IV: Chapters of the Chosen. The brainchild of series creator Yuji Horii, the DRAGON QUEST series has continued to excite and enchant players with its engaging storylines, charming characters designed by world-famous manga artist Akira Toriyama and imaginative worlds complemented by the memorable scores of renowned composer Koichi Sugiyama. Experience an adventure of epic proportions, presented through a unique portrayal of multiple character perspectives. While retaining the classic look and feel of the original release, this remake breathes new life into a much-loved entry in the DRAGON QUEST series with 3D graphics, dual screen presentation and newly animated monsters.", "platform": "Nintendo DS", "release_date": "November 22, 2007", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "ArtePiazza", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.18", "wikipedia": "https://en.wikipedia.org/wiki/Dragon_Quest_IV#Nintendo_DS_remake", "video_link": "https://www.youtube.com/watch?v=0rHcE98gHxU&ab_channel=Volcynika", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6502-dragon-quest-iv-chapters-of-the-chosen\n"}