{"altername_name": ["Dragon Ball DS", "Doragon Boru Di Esu", "龙珠DS"], "name": "Dragon Ball: Origins", "overview": "Kid Goku and Young Bulma embark on the adventure of a lifetime! Dragon Ball: Origins introduces Goku and his clever sidekick Bulma who must travel the world overcoming enemies and obstacles to collect the 7 Dragon Balls. • Innovative Touch-Screen Control - Dragon Ball Origins is innovatively controlled by using only the touch screen although button shortcuts can be assigned. • Fun and Light Hearted - Based on the original Dragon Ball series. Players will experience a thrilling adventure that is more fun and lighthearted compared to later Dragon Ball Z stories. • Two Modes of Attack For Goku - Use either standard Combat Mode or Power Pole Mode. The type of attack or move differs depending on what mode Goku is in. Use the extendable Power Pole to solve puzzles, cross rivers, and break rocks. • Power-Up Goku and Bulma - To increase overall health Goku and Bulma can collect \"heart pieces,\" found in treasure chests throughout the stages. Players can increase skill points by collecting \"skill orbs\" which appear after defeating enemies. Skill points can be used to power up all of Goku's attacks as well as Bulma's sub-weapon. • Unique 3D feature - The entire game is in 3D, including full polygon cut-scenes. • Martial Arts Tournament - Gamers will have an opportunity to play through the Martial Arts World Tournament. • More Characters - Characters that appear include Master Roshi, Yamcha, Ox King, Oolong, Puar, Chi Chi and more!", "platform": "Nintendo DS", "release_date": "November 4, 2008", "game_type": "Released", "esrb": "T - Teen", "developers": "Game Republic", "publishers": "Atari", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.16", "wikipedia": "https://en.wikipedia.org/wiki/Dragon_Ball:_Origins", "video_link": "http://www.youtube.com/watch?v=sEPFs7effe8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29558-dragon-ball-origins\n"}