{"altername_name": ["最终幻想水晶编年史: 时之回声"], "name": "Final Fantasy Crystal Chronicles: Echoes of Time", "overview": "An innovative new concept in multiplayer gaming, Final Fantasy Crystal Chronicles: Echoes of Time enables Wii and DS users to play side by side for the first time. This breakthrough in gaming connectivity allows players on both Nintendo platforms to journey together in the fantastical world of the beloved Final Fantasy Crystal Chronicles series. Echoes of Time offers a gameplay system that allows for a seamless, hassle-free in-game switch from single to multiplayer mode. Play anytime, anywhere, with anyone and experience a new level of connectivity with this latest adventure in the FFCC series. A triumphant return from a monster-infested forest marks the completion of the 16-year-old hero's coming-of-age ceremony. However, the hero's joy is short-lived as a young village girl is found to be afflicted by a mysterious illness known as \"crystal sickness.\" Determined to obtain the cure, the hero steps out of the secluded village for the first time, only to discover a world in which crystals are merely artifacts of the past and no longer exist. Players can switch between single and multiplayer modes at any time while playing, enjoying two great gaming options in one integrated experience. A personalized hero can be generated from a choice of the four familiar races of the series; Clavats, Lilties, Selkies or Yukes. Players can continue to enjoy the game even after completing the main adventure, as the New Game+ feature provides increased difficulty and better items with every new round.", "platform": "Nintendo DS", "release_date": "March 24, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10633-final-fantasy-crystal-chronicles-echoes-of-time\n"}