{"altername_name": [], "name": "Homie Rollerz", "overview": "Homie Rollerz is a fast-paced, mayhem-laden kart racer where players can pick one of the 10 most popular Homies, customize their slick rides, then trick, hop, and battle through courses with settings, shortcuts, and secrets as unique as the Homies themselves. Features • Trick Out and Roll Out: Earn respect points by doing stunts and winning races, then cash them in to trick out your car. Use the stylus to paint and mod your ride, fit your car with a better engine and exhaust system for more speed, beef up your suspension and hydraulic systems for better turning and cooler tricks when racing.• Rivalries and Respect: Challenge your fellow Homies on their turf. Beat Jokawild under the big top in the Homie Circus or drag race down Venice Beach against Big Loco. To win, you’ve got to learn the hoods, find the shortcuts, earn respect, and show your Homies who owns the street.• Multiplayer: Is one of your friends challenging your street cred? Show them who owns the hood with up to 8 players via Local Wireless or four players via Nintendo Wi-Fi Connection. Homie Rollerz also supports Download Play, so you and another Homie can play a trial version using only one cart!• Get to Know the Homies: Play as one of 10 slick Homies and enter the “Wizard Circuit,” a mysterious racing series through which the winner is granted a single wish by the wise and legendary Homie known as Wizard. Each character has a unique vehicle that can be upgraded in the garage for improved stats. Learn what’s motivating each of your Homies: Why is Alien Ese stuck on Earth and how can he get back home? How did Zombie become undead and will he ever return to the land of the living?", "platform": "Nintendo DS", "release_date": "February 27, 2008", "game_type": "Released", "esrb": "E - Everyone", "developers": "Webfoot Technologies", "publishers": "Destineer", "genres": "Racing", "max_players": "", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84621-homie-rollerz\n"}