{"altername_name": ["Kirby: Mouse Attack", "Hoshi no Kirby Sanjo! Dorocche Dan", "Hoshi no Kirby: Sanjou! Dorotche Dan", "Kirby: ¡Roedores al Ataque!", "Kirby: Topi all'attacco", "Byeorui Kirby: Dopang Ildangui Seupgyeok", "星之卡比 - 参上！多罗奇团"], "name": "Kirby: Squeak Squad", "overview": "Kirby is enjoying his picnic until someone snatches his strawberry cake. As usual, it turns out be his eternal rival, King Dedede. So Kirby rushes off to get his cake back. Along the way he meets up with the Squeak Squad, a team of mysterious and infamous thieves. After Kirby defeats Dedede, the Squeaks turn against Kirby and steal the treasures he has collected, because they believe the they \"grant you the ultimate power\". It's up to Kirby to defeat the whole Squeak Squad, and get the treasure back. Kirby can copy the abilities of certain enemies by inhaling and swallowing them, as Kirby can do in most of his games. Squeak Squad also includes new features such as interactive environments, allowing the player to use copy abilities to pass objects. For example, using the Ice ability on water will freeze it, allowing Kirby to cross. A new feature, Copy Scrolls, let the player power up Kirby's abilities. For example, Spark can create thunder clouds and make electrical currants that can run through metal. Kirby can collect and store objects in his stomach which is represented on the touch screen. The player can also roulette by one copy ability over another using the stylus. Roulette stops on a random ability including abilities only available through the roulette.", "platform": "Nintendo DS", "release_date": "November 2, 2006", "game_type": "Released", "esrb": "E - Everyone", "developers": "Capcom", "publishers": "Nintendo", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "4.08", "wikipedia": "https://en.wikipedia.org/wiki/Kirby:_Squeak_Squad", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6523-kirby-squeak-squad\n"}