{"altername_name": ["Pokémon Pearl Version", "Pokémon Versione Perla", "Pokemon Pearl Version", "Pokémon Edición Perla", "Pokemon Perl-Edition", "Pokemon: Pearl Version", "Pokemon: Edicion Perla", "Pocket Monsters: Pearl", "Pokemon: Version Perle", "Pokemon: Versione Perla", "Pocket Monsters DP: Palkia", "口袋妖怪 - 珍珠"], "name": "Pokémon Pearl Version", "overview": "Together with Pokémon Diamond, this game starts the 4th generation of the Pokémon series. Set in a new region, Sinnoh, it includes 107 new Pokémon, bringing the total up to 493. It is also the first online game in the series, featuring Wi-Fi battles and trading. Players can collect badges, challenge the Elite Four, and become the ultimate Pokémon master. The game continues the basic idea of previous Pokémon games - you, a new trainer, set out on a quest to catch every Pokémon and defeat the Pokémon league. Along the way, you will foil the plots of the evil organization Team Galactic, who seek to use a trio of legendary Pokémon to awaken a sleeping titan with the power to control space. There are many sidequests and other activities along the way, including the Battle Tower and catching other legendaries. The core Pokémon series features an RPG turn-based battle system. Each monster can learn up to four attacks. In a single turn, the two opponents select their attacks, and the one with the higher Speed attacks first. The amount of damage is influenced by the Attack and Defense stats. In the past, attacks were automatically classified as Physical or Special based on their elemental type. In Diamond and Pearl, each attack can be individually categorized, so attacks which use natural elements are Special, and those which use simple force are Physical. The Pokémon Contests from Ruby and Sapphire return, with many new features. In addition to the attack performance, where you must try to impress the judge with flashy moves, you'll also dress up your Pokémon and dance in time to music. Diamond and Pearl also bring back the real time system from Gold and Silver, where day and night are reflected in your game. Some Pokémon are only catchable during certain times.", "platform": "Nintendo DS", "release_date": "September 28, 2006", "game_type": "Released", "esrb": "E - Everyone", "developers": "Game Freak", "publishers": "Nintendo", "genres": "Adventure", "max_players": "4", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Diamond_and_Pearl", "video_link": "https://www.youtube.com/watch?v=4NYLAR5oz4A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2244-pokemon-pearl-version\n"}