{"altername_name": ["Pokémon Versione Oro HeartGold", "Pokemon: HeartGold Version", "Pokémon Edición Oro HeartGold", "Pokemon: Goldene Edition HeartGold", "Pokemon: Edicion Oro HeartGold", "Pocket Monsters: HeartGold", "Pokemon: Versione Oro HeartGold", "Pokemon: Version Or HeartGold", "口袋妖怪 - 心金"], "name": "Pokémon HeartGold Version", "overview": "Pokémon HeartGold is an enhanced remake of one of the second installments in the Pokémon Main RPG Series, Pokémon Gold. Set in the region of Johto, the player controls a new Pokémon Trainer on his/her way to meet up with Pokémon Researcher Professor Elm at his lab to receive his/her first Pokémon. While running an errand for Elm, the player returns to find that a thief has stolen one of the professor's Pokémon. This event starts your quest to becoming a Pokémon master, leading you through the region of Johto and later Kanto, to battle the mysterious Team Rocket and capture all 493 Pokémon. Along with retaining most of the original game's features, HeartGold contains quite a few new updates. Like Gold the story will incorporate the legendary Pokémon Ho-Oh (who can be seen on the game's box art), although this time in a bigger fashion. Graphics have been upgraded to 3D models to resemble the series previous Nintendo DS iterations, Diamond, Pearl, and Platinum. The ability to have any one of your Pokémon following you on the Overworld Screen which was limitedly seen in Pokémon Yellow has been added. Included with the game is a peripheral known as the Pokéwalker. Acting as a pedometer, the Pokéwalker allows you to wirelessly transfer a Pokémon from HeartGold to it. When there is a Pokémon in the Pokéwalker it gains \"experience points\" for each step you take. The player also earns a form of money known as \"watts\", which is used to help catch other Pokémon and buy items. The game is compatible with the following games via Nintendo Wi-Fi Connection: Pokémon SoulSilver, Diamond, Pearl, and Platinum.", "platform": "Nintendo DS", "release_date": "September 12, 2009", "game_type": "Released", "esrb": "E - Everyone", "developers": "Game Freak", "publishers": "Nintendo", "genres": "Adventure", "max_players": "4", "cooperative": "No", "rating": "4.39", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_HeartGold_and_SoulSilver", "video_link": "https://www.youtube.com/watch?v=M3zpC6Zfqh8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2246-pokemon-heartgold-version\n"}