{"altername_name": ["Pokémon Mystery Dungeon: Esploratori dell'Oscurità", "Pokémon Mundo Misterioso: Exploradores de la Oscuridad", "Pokemon Mystery Dungeon: Explorers of Darkness", "Pokémon Mystery Dungeon: Explorers of Darkness", "Pokemon Fushigi no Dungeon: Yami no Tankentai", "Pokemon Bulgasaui Dungeon: Eodumui Tamheomdae", "口袋妖怪不可思议迷宫 - 暗之探险队"], "name": "Pokémon Mystery Dungeon: Explorers of Darkness", "overview": "In the newest installment of the Pokémon Mystery Dungeon series, players find themselves transported to a world of Pokémon—Pokémon that talk and shop and form exploration teams to journey into randomly generated dungeons to look for treasures and rescue other Pokémon in trouble. The player joins one of these exploration teams, looking for the cause of their mysterious transformation—once they were human, but now they are a Pokémon. Which Pokémon the player becomes is determined by a personality test given at the beginning of the game. The player is also given a partner—another Pokémon that will join you on your adventure as the two of you discover the secret of the Time Gears, mysterious artifacts that are being stolen by an elusive thief and whose loss puts the world in grave danger. Explore random dungeons, collect Treasure Boxes, and recruit over 493 Pokémon—including those from Pokémon Diamond and Pokémon Pearl. Pokémon exclusive to Explorers of Darkness include Burmy, Buneary, Lopunny, Mewtwo, and Rotom.", "platform": "Nintendo DS", "release_date": "April 20, 2008", "game_type": "Released", "esrb": "E - Everyone", "developers": "Chunsoft", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Mystery_Dungeon:_Explorers_of_Time_and_Explorers_of_Darkness", "video_link": "https://youtu.be/5TBhdy8kNQg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2253-pokemon-mystery-dungeon-explorers-of-darkness\n"}