{"altername_name": ["Pokémon Mystery Dungeon: Squadra Blu", "Pokémon Mundo Misterioso: Equipo de Rescate Azul", "Pokemon Mystery Dungeon: Blue Rescue Team", "Pokémon Mystery Dungeon: Blue Rescue Team", "Pokemon Fushigi no Dungeon: Ao no Kyuujotai", "Pokemon Bulgasaui Dungeon: Parang Gujodae", "口袋妖怪不可思议的迷宫 - 青之救助队"], "name": "Pokémon Mystery Dungeon: Blue Rescue Team", "overview": "Natural disasters have been occurring in the Pokémon world! And if that's not enough of a dilemma, you've woken up one day to discover that you've mysteriously transformed into a Pokémon yourself! After teaming up with another Pokémon, the pair of you decide to form a rescue team, and save other Pokémon who are in trouble and need help. Pokémon Mystery Dungeon: Blue Rescue Team is a Pokémon-themed version of a game series called Fushigi no Dungeon, or Mystery Dungeon in English. The basic concept for each of these games is that you must travel through a series of randomly generated dungeons, battling enemies and collecting items as you make your way deeper until you reach a specified floor in the dungeon. Pokémon Mystery Dungeon applies various aspects of the Pokémon Universe to the Mystery Dungeon series. You can level up your characters, have other Pokémon (up to a maximum of six characters in your party) join you, level up, evolve, and learn new attacks and abilities. You do not directly control other members of your team; they are AI controlled, but you can issue them specific commands such as \"follow me\", \"avoid first attack\", and \"attack enemies\". Another goal of the game is collecting all of the different types of Pokémon by recruiting them as members of your rescue team. Pokémon Mystery Dungeon can also communicate with other copies of Blue Rescue Team and Red Rescue Team. You can choose to rescue a friend who has become stranded while performing a rescue mission of their own, or you can trade items with them instead.", "platform": "Nintendo DS", "release_date": "September 18, 2006", "game_type": "Released", "esrb": "E - Everyone", "developers": "Chunsoft", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.92", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Mystery_Dungeon:_Blue_Rescue_Team_and_Red_Rescue_Team", "video_link": "https://youtu.be/8Dh1E_DiZRU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2251-pokemon-mystery-dungeon-blue-rescue-team\n"}