{"altername_name": ["Profesor Layton y la Caja de Pandora, El", "Professor Layton and Pandora's Box", "Professor Layton und die Schatulle der Pandora", "Il Professor Layton e lo Scrigno di Pandora", "Layton Kyouju to Akuma no Hako", "Professor Layton en de Doos van Pandora", "Professeur Layton et la Boite de Pandore", "Layton Kyouju to Akuma no Hako: Friendly Ban", "Layton Gyosuwa Angmaui Sangja", "雷顿教授与恶魔之箱", "El Profesor Layton y la Caja de Pandora"], "name": "Professor Layton and the Diabolical Box", "overview": "In the world of Professor Layton, puzzles hide in every corner. When the professor's mentor is mysteriously murdered, a cursed artifact called the Elysian Box appears to be behind it. With a ticket to the Molentary Express as their only lead, Professor Layton and Luke embark on an adventure that will test their wits and work their brains. Calling all brainteaser fans! With tons of in-game puzzles of different types and difficulties, there's something for everyone from kids to adults. As Professor Layton, you'll open doors with sliding puzzles, uncover clues with logic puzzles, and find answers by solving riddles. A cinematic experience! This large-scale sequel to Professor Layton and the Curious Village features three times the voiced dialogue and movies of its predecessor. The fully voiced movies, hand-drawn art style, and cast of eccentric characters bring the story to life and are sure to charm puzzle fans young and old.", "platform": "Nintendo DS", "release_date": "August 24, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Level-5", "publishers": "Nintendo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.12", "wikipedia": "https://en.wikipedia.org/wiki/Professor_Layton_and_the_Diabolical_Box", "video_link": "https://www.youtube.com/watch?v=eHWttaixDEc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10103-professor-layton-and-the-diabolical-box\n"}