{"altername_name": [], "name": "Shaberu! DS Oryouri Navi: Marugoto Teikoku Hotel", "overview": "Shaberu! DS Oryouri Navi Marugoto Teikoku Hotel ~Saikouhou no Ryouricho ga Oshieru Kateiryouri~ (しゃべる!DSお料理ナビ まるごと帝国ホテル ～最高峰の料理長が教える家庭料理～; translated as: \"It talks! DS Cooking Navigator: The Ins-and-Outs of the Imperial Hotel ~The Best Chef de Cuisines Teaching Everyday Cooking~\") is the second entry of Nintendo's Shaberu! DS Oryouri Navi cooking simulator series. Shaberu! DS Oryouri Navi is a step-by-step instructing simulator that seeks to help people of all levels cook delicious foods that \"everyone can enjoy\". As such, the game's concept is devised for the user to participate with the program in their own kitchen with their own tools. This trait is the main difference from Nintendo's other cooking simulation series, Cooking Mama, which handles all of its cooking within the game's world through a series of mini-games. Unlike the first title, the main draw of this entry is the chance to create homely cuisine taught from the minds serving food at the royal Imperial Hotel. The cooking instructors are actual head chefs from the hotel with over twenty years experience. They offer a total of 201 beginner friendly recipes to try. In the main menu, users can choose to read each participating chefs' comments and a little background history of their restaurant. An option to omit certain meats from recipes and to utilize the DS microphone over the touch screen have also been implemented within the game.", "platform": "Nintendo DS", "release_date": "June 21, 2007", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/141618-shaberu-ds-oryouri-navi-marugoto-teikoku-hotel\n"}