{"altername_name": [], "name": "Shorts", "overview": "Bring the outrageous and enchanting mayhem of Shorts, the movie, to your Nintendo DS. After a magical rainbow rock that grants wishes brings chaos to the suburbs, players must fix wishes-gone-wrong in this entertaining platformer with classic puzzle elements. Play as 4 of your favorite characters from the movie. Free your house from booger monsters as Nose Noseworthy. Escape the canyon of doom and the castle that Loogie Short wished into existence. Choose between Toe Thompson and Helvetica Black to destroy the power-mad Mr. Black in the Black Box factory. It’s up to you to return the community of Black Falls to normal. Features • Run through 26 replayable levels in 3 distinct episodes from the movie that take place in a laboratory-like house in the town of Black Falls, a factory, and a castle with a moat • Play as Nose Noseworthy, Loogie Short, Toe Thompson and Helvetica Black, each with their own special jump and unique ability • Use the stylus to draw temporary platforms to jump on and get around obstacles or create a shield to avoid dangerous threats • Activate special jumps and unique abilities like the alien and wasp hover-jumps, telekinesis super-attack, invincibility, and growth and shrink ray guns for sticky situations • Collect energy balls to power special abilities. Find hidden heart pieces to increase your health and pick up keys to unlock your way forward • Get help from alien friends, giant wasps and a pterodactyl dinosaur to reach new areas • Face a multitude of enemies like booger monsters, bomb shooting crocodiles, poison spitting snakes, bats, and sparking robots", "platform": "Nintendo DS", "release_date": "August 18, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Artificial Mind & Movement", "publishers": "Majesco Entertainment", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99045-shorts\n"}