{"altername_name": ["守护甜心!兴高采烈!甜心旋律"], "name": "Shugo Chara! Norinori! Chara na Rhythm", "overview": "Shugo Chara! Norinori! Chara na Rhythm is an Action game, developed and published by Konami, which was released in Japan in 2009. Shugo Chara! Norinori! Chara Formation-Rhythm♪ (Shugo Kyara! Norinori! Chara-Narizumu) and there are 50 stars Yua Sakurai and her Guardian Character, Cecil, for story mode. It counts as more or less as a DDR (Dance Dance Revolution) style game. When the symbols for tapping appear, you touch them on the touch screen and count them for points. In story mode, it talks about Yua releasing a CD. Her ?-Transformation also makes an appearance, as well as a transformation, \"Wonderful Singer\", not seen in the series. Kukai is now in middle school, so the current Jack is Nagihiko. However, Kairi makes an appearance in the middle of story mode. Once again, you can play mini games (which are music based) with Ran, Miki, and Suu. Playing mini games helps to earn coins to buy things like screen shots and draft drawings. When you buy them you can view them in your inventory. Also, in your inventory, you can view videos and screenshots that you have seen in story mode. The point of the game is to try and dance to the rhythm. At the beginning of the game, Amu, Ran, Miki, Suu and Dia all shout Shugo Chara! Norinori! Charanarizumu! (the 'Zumu' is part of the word). The cover features Amu dressed in a green version of her school uniform, holding three fingers up in one hand, and holding a microphone in the other. She has Ran, Miki, Su, and Dia around her.", "platform": "Nintendo DS", "release_date": "August 6, 2009", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136077-shugo-chara-norinori-chara-na-rhythm\n"}