{"altername_name": ["Tarta de Fresa: La Tarta Cuatro Estaciones"], "name": "Strawberry Shortcake: The Four Seasons Cake", "overview": "Strawberry Shortcake, her friends and the pets Pupcake, Custard and Marmalade are getting ready to enjoy a fun afternoon of races, contests and, of course, dessert as they participate in the Nearly-Once-a-Yearly Strawberryland games! It would be a berry sweet event if not for the bragging Peppermint Fizz and her pet, Cola Chameleon. Peppermint wants to show off her pet Cola so much she's been cheating during the races and rigging the contests. The girls have decided to give her a lesson in humility by winning - fair and square… Compete in three different Strawberryland events: Berry Boarding down the whip cream slopes of the Sundae Mountains, Balloon Rise through candy cloud skies of Strawberryland and Black Liquorice Leap from one end of Punchbowl Pond to the River. Features • Compete as Strawberry Shortcake and Blueberry Muffin with your favourite pets in the 3 events - with 12 fun levels per event! • Select the pet with the most appropriate skills to get the best scores on different events • Help improve your pet's performance by whipping up delicious dessert boosters from the Bakers corner. • Have fun in between the events with 3 cool activities: The Balloon Ride, Carnival Games and The Baker's Corner! • Several levels of difficulty for each mini game make the game exciting and challenging for children of different ages! • Take full advantage of the special Nintendo DS features such as the DS Stylus and the touch screen. You can even play a 2 player wireless version of Berry Boarding using the WIFI multiplayer!", "platform": "Nintendo DS", "release_date": "December 6, 2007", "game_type": "Released", "esrb": "E - Everyone", "developers": "Shin'en Multimedia", "publishers": "The Game Factory", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98248-strawberry-shortcake-the-four-seasons-cake\n"}