{"altername_name": ["An M. Night Shyamalan Film: The Last Airbender", "Airbender: El Ultimo Guerrero: Una Pelicula de M. Night Shyamalan"], "name": "The Last Airbender", "overview": "DISCOVER YOUR BENDING POWERS \"The Last Airbender” is the official video game of the highly anticipated summer live action adventure film by M. Night Shyamalan. The game follows the climax of the movie from the perspective of the antagonist Prince Zuko, exiled prince of the Fire Nation, who embarks on an epic journey to capture the Avatar, a young boy named Aang, in order to regain his father’s honor. Players immerse themselves in an incredible interactive world as Aang, Zuko and the Blue Spirit – participating in epic battles, hand-to-hand combat and various challenges throughout the game discovering and mastering amazing Firebending and Airbending abilities. Become Aang, Zuko & The Blue Spirit – As Zuko, use destructive Firebending fireballs , bombs and more to battle for power. As Aang, use amazing Airbending powers such as air walls and blasts to manipulate the environment and control the elements. As the Blue Spirit, Zuko’s Ninja alter ego, defeat your foes using stealth maneuvers and unique weapons. Discover Your Bending Powers - Players utilize the stylus to bend fire and air as they combat, destroy, battle and maneuver through the mystical Avatar universe. Action-Packed Levels – Journey through 14 levels of dynamic game play and 3 intense boss battles to a climatic ending. Exclusive Character Powers – Playing as Aang, players can bend water and use Aang’s glider to escape and maneuver. Playing as Zuko and the Blue Spirit, players use dodge rolls, slash attacks, and parkour abilities to avoid and stun enemies. Nintendo DSi Feature – The Bender Detector - Shoot a photo and discover what type of bender you and your friends are. The Movie Experience Plus More – dynamic physics and graphics bring the movie experience to life like never before. To add further depth and uniqueness, the game not only follows the climax of the movie from Prince Zuko’s perspective utilizing special telekinesis fire bending powers but also takes the player to exclusive in-game environments.", "platform": "Nintendo DS", "release_date": "June 29, 2010", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "THQ", "publishers": "THQ", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.62", "wikipedia": "https://en.wikipedia.org/wiki/The_Last_Airbender_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45414-the-last-airbender\n"}