{"altername_name": [], "name": "The Price is Right", "overview": "\"Come on Down!\" Experience all of the classic moments from the show with up 4 people. You will hear your name called as you’re announced to \"Come on Down!\" to Contestant’s Row. Play all of the favorite pricing games, including Plinko, Cliff Hangers and Punch-A-Bunch. Spin the Wheel for the chance at the big prizes in the Showcase Showdown. Play all of the best pricing games - Play Plinko, Hole in One, Punch-A-Bunch, Cliffhangers, Three Strikes, Shell Game, It’s in the Bag, Flip Flop and more. Make your way out of Contestant’s Row, Spin the Big Wheel, and compete to take home the big money in the Showcase Showdown. Real moments from the show - Rich Fields will tell you to \"Come on Down\" as you start an authentic Price is Right experience. The actual music and sounds of the show are used in the game. Additionally, classic video footage of The Price is Right models will introduce the games and items up for bid. A party game for everyone - Fans of all ages can compete against each other for big money and fabulous prizes. Party game mode is for up to 4 players. In single player mode play through the game as a real contestant or try to beat your top score on individual pricing games. Unlock classic moments - Special achievements will unlock additional video footage of some of the all-time most memorable Price is Right moments Come on down and experience all of the classic moments from The Price is Right show with up 4 people. You will hear your name called as you're announced to \"Come on Down!\" to Contestant's Row. Play all of the favorite pricing games, including Plinko, Cliff Hangers and Punch-A-Bunch. Spin the Wheel for the chance at the big prizes in the Showcase Showdown.", "platform": "Nintendo DS", "release_date": "September 9, 2008", "game_type": "Released", "esrb": "E - Everyone", "developers": "Ludia", "publishers": "Ubisoft", "genres": "Quiz", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23499-the-price-is-right\n"}