{"altername_name": ["Genmu no Tou to Tsurugi no Okite"], "name": "The Dark Spire", "overview": "Calling all fans of classic, first-person role playing games! The Dark Spire is an RPG of exploration and character development in the purest sense. The powerful Archmage Tyrhung resides in a tower of mist and shadow. He holds in his possession a jewel of great worth and power. A group of adventurers assemble. Will they be able to conquer Tyrhung and his nefarious tower? The party sets out, its fate yet to be determined… Parties will be assembled, stats will be rolled, items, weapons and armor shall be equipped, and monsters will be slain. Play in Classic Mode to experience a nostalgic black-and-white wireframe dungeon environment or Modern Mode for the full 3-D atmosphere. • Homage to classic RPGs — Take back the age of the great classic RPGs where you build your perfect party from the ground up. Shrewd strategy is required to navigate tough dungeon floors with limited resources, earning experience by taking on 80 different enemies out to end you. • Dual dungeon modes — The traditional RPG experience is fully realized in Classic Mode, which offers a black-and-white wireframe dungeon environment reminiscent of the nostalgic PC RPGs. Switch back to Modern Mode to update to the full 3-D atmosphere of The Dark Spire. • A captivating story of mist and shadow — A second person narrative reaches out from the game to speak to you of codpieces and killer rabbits, enveloping the gamer in an unforgettable adventure that offers three possible endings.", "platform": "Nintendo DS", "release_date": "April 14, 2009", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Success", "publishers": "Atlus", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.14", "wikipedia": "https://en.wikipedia.org/wiki/The_Dark_Spire", "video_link": "https://youtu.be/G9nVlVwJHFY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/16044-the-dark-spire\n"}