{"altername_name": [], "name": "Tomodachi Collection", "overview": "Tomodachi Collection (トモダチコレクション Tomodachi Korekushon?, lit. “Friend Collection\") is a life simulation game for the Nintendo DS released on June 18th, 2009, exclusively in Japan. It is the first game in the Tomodachi series. A sequel named Tomodachi Life was released in Japan on April 18th 2013, and in America and Europe on June 6th, 2014. The game takes place on an island in the middle of the ocean, that can be populated with various Miis created from the built in Mii Maker, or transferred wirelessly from a Wii console. These Miis can be given a personal voice and personality based on the player's liking. Once each Mii is made, they will move into their own apartment on the island, allowing them to explore the island and its various facilities. As more Miis are added, more facilities and activities are unlocked, and the Miis may even become friends with one another, hanging out in their apartment or outside. Miis themselves can also be interacted with in their apartment, allowing the player to give them food, clothes, or an interior for their apartment. Depending on how much they like it, the Mii's happiness will go up, and once it reaches a certain point, the Mii will level up, allowing the player to give them a level-up gift, such as a phrase or a song as a reward. If the Mii is asleep, the player may have a chance to view a dream, leading to a bizarre mini-game, event, or activity. At certain times, events can be held that the player can witness, be it Street Live at the fountain, or Question at the Question Hall.", "platform": "Nintendo DS", "release_date": "June 18, 2009", "game_type": "Released", "esrb": "", "developers": "Nintendo SPD", "publishers": "Nintendo", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Tomodachi_Collection", "video_link": "https://www.youtube.com/watch?v=wq9LTML2A-0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124148-tomodachi-collection\n"}