{"altername_name": [], "name": "Ultimate Card Games", "overview": "Telegames, Inc. has again teamed with Cosmigo to create the most comprehensive and feature-rich compilation of Classic, Casino, and Solitaire games ever released for any portable system. Features • 11 full-featured Classic card games - select from Hearts, Spades, Euchre, Bridge, Gin Rummy, Canasta, Cribbage, Crazy Eights, Go Fish, Romme, and Skat. • 13 full-featured Casino card games - play your choice of BlackJack, Texas Hold’em, Double Flop Hold’em, Omaha, 5 Card Draw, 7 Card Stud, Pineapple, Crazy Pineapple, and 5 unique versions of Video Poker. • 20 full-featured and unique versions of Solitaire - select from your favorite Solitaire games like Klondike, FreeCell, Spider, Golf, Yukon, Beleaguered Castle, Forty Thieves, Canfield, and many others. • Automatically tracks and saves many of your game stats. • Select your choice of backgrounds from cool pictures and gradients. Select your favorite card faces to use. • Over 45 minutes of original sound tracks. Edit the playlist to only hear what you want to hear. • Single-player options. Selectable AI difficulty so your computer opponents will challenge all skill levels from beginner to experienced. • Multi-player options. Live multi-player action either locally via Wireless Play or over the internet via the Nintendo Wi-Fi Connection (WFC). Communicate with other connected players using Text-chat and speech (Push2Talk technology). One to five players. • On-screen \"How to play\" instructions and button actions. • Select in-game language from English, Spanish, or French language. • Game Share feature - wirelessly send the games to your teammates for the duration of one session so they can take part in a multiplayer game without purchasing the cartridge.", "platform": "Nintendo DS", "release_date": "November 8, 2008", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14150-ultimate-card-games\n"}