{
  "name": "Las Vegas ES-2208",
  "manufacturer": "Philips",
  "type": "",
  "origin": "Europe",
  "year": "1977",
  "production": "",
  "language": "6 games",
  "keyboard": "2 analog joysticks",
  "cpu": "AY-3-8550 from General Instruments",
  "speed": "Reset, Service",
  "coprocessor": "Speed slow/fast, Angle 40?/20?, Game selection, Paddle size, Power on/off, Auto/manual service",
  "ram": "On screen",
  "vram": "",
  "rom": "",
  "text": "",
  "graphics": "",
  "colors": "Yes",
  "sound": "Built-in speaker",
  "size": "",
  "ports": "RF TV video output, Light-gun (female DIN connector)",
  "power": "9v DC",
  "price": "",
  "description": "\nThis pong from Philips is a bit special. It uses the unusual AY-3-8550 from General Instruments. This chips offers 4 classic pong games (Tennis, Squash, Squash practice, Football) and 2 shooting games. The paddles can be moved verticaly AND horizontaly, hence the analog joysticks (instead of the classic sliders). The display is in color.\n\nThere is a female DIN plug at the bottom-right part of the case. It is used to connect an optional light-gun to play the two shooting games.\n\nThere are switches to control the different options like ball speed, paddle size, angle 20?/40?, manual/auto service. There are two buttons: reset and serve. There is even a TV channel selection knob to adjust the picture on the TV.\n\nThe Las Vegas ES-2208 is in fact one of the Las Vegas pong systems from Philips. Here is the list:\n\n- Las Vegas Tele-Spiel ES-2203 (6 games, black \u0026amp; white display, vertical movements)\n- Las Vegas Tele-Spiel ES-2204 (6 games, color display, vertical movements)\n- Las Vegas Tele-Spiel ES-2208 (6 games, color display, vertical \u0026amp; horizontal movements)\n- Las Vegas Tele-Spiel ES-2218 (8 games, color display, vertical \u0026amp; horizontal movements)\n\nThere was also a:\n- Travem?nde Tele-Spiel ES-2207 (4 games, black \u0026amp; white display, vertical movements)\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UNIT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/philips_las-vegas_es2208_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;INSIDE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The motherboard is quite basic with all the switches, the sound speaker and the AY-3-8550 chip from General Instrument.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/philips_lasvegas-es2208_inside_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PADDLES\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/philips_las-vegas_es2208_paddles.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/philips_las-vegas_es2208_box.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1977 ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/ProcessorTech_Sol_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT #4\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/indata_dai_advert_espace.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MICROSOFT MULTIPLAN, APR. 1986\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_128_Advert_s4.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;NORTHSTAR CARDS\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Northstar also designed cards for S100 Bus. These cards were used in the Horizon and were also available separately for competing systems.\u0026lt;br\u0026gt; Cards on the photo are:\u0026lt;br\u0026gt; - 16 KB RAM board ($459 assembled)\u0026lt;br\u0026gt; - Micro Disk System (card \u0026amp; interface) to connect Shugart FDD ($799)\u0026lt;br\u0026gt; - Z80A processor board ($259 without EPROM option, $330 with)\u0026lt;br\u0026gt; - Hardware floating point card ($359).  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/NorthStar_Horizon_Cards_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ARGENTINIAN ADVERT \u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.speccy.org/czarg/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;CZARG\u0026lt;/a\u0026gt; for this picture.\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/microdigital_tk82c_ad-arg_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (JANUARY 1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;At 68 years old, taunt Rose discovered that she was an exceptionally gifted child\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/atari_2600_ad_tante-rose.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;The advert show the built-in user menu and system status.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The right located system is the dual-drive version.\u0026lt;br\u0026gt; The left one is the 10 MB hard-disk version.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/QuasarDataPr_QDP100_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;SEMI-TECH BROCHURE #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Semitech_PiedPiper_Brochure_s2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (SEPT. 83)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;The incredible Secam color micro-computer !\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/vtech_laser200_fr-advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;GERMAN ADVERT (1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Karl-Heinz  -  www.sharpmz.org\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Citoh_YD8110_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1977 ADVERT #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt;... The 6800 will never win any beauty prizes. It is like the Model \u0027T\u0027 and the DC-3, not pretty but beautiful in function. It is simple, easy to use and maintain and does its job in the most reliable and economical way possible. What more could you want?\u0026lt;/font\u0026gt; \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Swtpc_6800_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert from the Nieman-Marcus catalog.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Honeywell_H316_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FIRST AD.\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;January 1983\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; Telcon needed customers payments before manufacturing the systems:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; Upon receipt of your check, we will forward an end-user agreement. Allow 6 to 8 weeks for delivery of the units. \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Telcon_Zorba_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;8-PAGE US ADVERT #4\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Compaq_PortableIII_Advert_s4.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #19\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What kind of diskettes do you recommend for use with the FD-8?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have our diskettes manufactured by the Dysan Corporation. They are packaged for us under the MSI label and have proven to be the most reliable diskettes available for use with the FD-8. We have tried other manufactur\u0026shy;ers but have found none to be as reliable as Dysan. We pay more money for Dysan diskettes and, as a result, cannot offer them at a price quite as competitive as some other manufac\u0026shy;turers. However, we feel that the reliability is most important. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does the FD-8 use IBM compatible format?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 is not IBM compatible since we use hard-sectoring on the diskette. Our format uses 16 sectors of 256 data bytes each per track. In addition, track and sector identification, checksum (CRC), and other error checking information is written on each sector in addition to the data. This gives a total capacity of 315,392 bytes of data which can be stored per diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are diskette hardholes, and what do they do?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Hardholes are small mylar doughnuts which may be affixed to the center hole of a diskette for additional protection. It is possible to damage the center hole of a diskette if it is not properly centered at the time the disk drive door is closed. The mylar doughnut serves to reinforce the center hole of the diskette and give it additional protection against damage. The hard hole also provides for additional fric\u0026shy;tion between the diskette and the clamping hub in order to provent slippage of the diskette dur\u0026shy;ing rotation. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does MSI offer application software packages?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI is in the process of developing ap\u0026shy;plication software for use with the FD-8 System. We will be offering a library of standard busi\u0026shy;ness programs for accounting, inventory and mail list applications in the near future. These programs will be written in BASIC using the disk data file capability of the FD-8. The availability of application software will be announced in periodic MSI newsletters and will be made available to FD-8 users for a small copying charge plus the cost of the diskette. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Does a user program library exist for the MSI FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We are in the process of organizing a user group for the FD-8. Users of the FD-8 System are encouraged to submit programs which may be included in the user library. Member\u0026shy;ship in the user group may be achieved by either submitting a program for publication or by payment of a nominal membership fee. Membership then entitles the user to receive periodic listings of user library contents and newsletters. Programs contained within the user library will be made available for a small copying charge. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between MSI TAPE BASIC and MSI BASIC used with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; We have added several features to the MSI version of BASIC. We offer multiple statements per line, user defined verbs, a string\u0026shy;length command which allows strings up to 128 characters to be used, and have increased the speed of execution. In addition, we have completely removed the dependence upon the MIKBUG ROM and MIKBUG RAM areas. The stack pointers have been moved to the user program area, and the input/output routines for each of the ports are fully documented so that these can be easily changed. Interrupts are now allowed and can be used to vector the program to a user subroutine and then return to BASIC. We are also developing multi-user BASIC which will be released in the near future. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can MSI BASIC and the disk operating system be relocated?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Essentially, no difference exists between the two versions of BASIC insofar as the BASIC interpreter is concerned. The tape version has disk and DOS commands removed from its library. The interpreter resides from memory location $0100 to $1 FFF in both versions. In addition, memory locations below $0100 are used as pointers. In the Disk version, memory locations from $2000 - $2FFF are used to con\u0026shy;tain disk driver subroutines, DOS, and other file handling routines. User memory begins at $2000 for the tape version and $3800 in the Disk version of BASIC. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What is the difference between SWTP 8K BASIC and MSI BASIC?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; It is not considered feasible to attempt relocation of these programs since so many of the individual routines which are used in the disk operating system are integrated. It would require a major revision of the disk operating system, BASIC, coresident assembler/editor and other associated utility programs before such a relocation could be performed. However, a version of MSI BASIC will soon be available on PROM which will reside at a high memory location. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; How difficult is it to run MSI BASIC and the disk operating system on the Motorola Ex\u0026shy;orciser, or other 6800 based microcomputer systems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The primary changes which must be made are in the input and output character routines. These routines must be changed in all MSI software so as to be compatible with the sys\u0026shy;tem on which software is running. In addition, the PIA Interface which communicates with the disk, the FD-8, is presently located at mem\u0026shy;ory address $801 C. A PIA residing at this ad\u0026shy;dress will also be necessary, or alternatively, this address must also be changed in the disk driver subroutines. Several different versions of the MSI software package are currently being developed for use with other 6800 systems. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle tape commands as well as disk?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the commands TSAVE AND TLOAD are used with the tape, whereas the commands SAVE and LOAD are reserved for use with the disk. It is also possible to place a label at the front of a block which is saved on tape. When this label is specified during a LOAD opera\u0026shy;tion, the program will search for the appropriate block on tape before loading in the information which has been stored on the tape. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Will MSI BASIC handle data files?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, both random and sequential data files are available for the disk system under MSI BASIC. Named files for object code, source code, BASIC program, and BASIC data files are all available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have heard that 1702A PROMs are too slow for use with 6800 systems running at full clock speed. Is this true?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; This is not true, if the memory addressing scheme employed by MSI is used to address the 1702A PROMs. The MSI PROM/RAM Board does not employ Phase 2 of the clock in the memory addressing scheme. This permits a tolerable memory access time of approxi\u0026shy;mately 9OQns. MSI uses 650ns access time 1702A PROMs in all applications. This provides completely satisfactory reliability of operation. We have experienced no problems whatsoever when using fast 1702As. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I buy a Bootstrap routine on PROM in order to bring the disk system into operation quickly?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, MSI is presently delivering a 512 byte Bootstrap Program known as Short Boot. This routine is available on a two-PROM set using 1702A PROMs for use with the MSI PROM/RAM Board. Short Boot and the PROM Board are delivered with most Disk Systems. This allows the disk to be placed into operation by simply executing the Bootstrap routine which is orged at $COOO. The system then responds immediately with DOS READY and programs may then be called immediately by file name. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I am interested in purchasing MSI software but am having a hard time evaluating its use\u0026shy;fulness. May I purchase the documentation for your disk system and BASIC separately for evaluation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the complete operating manual for the FD-8 Disk System may be purchased sep\u0026shy;arately for $35.00. This manual includes as\u0026shy;se\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s19.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;Z-2D ADVERT (1977)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Z-2D 1977 price list:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; - Kit version with 1 F.D. drive: \u0026lt;b\u0026gt;$1495\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; - Assembled version: \u0026lt;b\u0026gt;$2095\u0026lt;/b\u0026gt;\u0026lt;br\u0026gt; - Additional F.D. drive: \u0026lt;b\u0026gt;$495\u0026lt;/b\u0026gt;  \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Cromemco_Z2D_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (DEC.1983)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/televideo_ad_prenez-de-l-elan.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1980)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;In september 1980, over 200,000 Model 1 were sold, more than 50,000 units per month since the computer was launched.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Tandy_Model1_Advert_5.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PREVIOUS SYSTEM\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Before manufacturing the MPC, Columbia tried to sell a massive multi-user, Z80 based system.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Columbia_PC_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0027\u0027The sound, the color, the intelligence\u0027\u0027\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/indata_dai_advert_leson.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;UK ADVERT (FEB. 1980) \u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to David Wilson for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sinclair_mk14_uk-advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;THINKJET ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;August 1985\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/HP_150_Advert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://www.guiguy.com/Schiff/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;www.guiguy.com/Schiff/\u0026lt;/a\u0026gt; for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/seequa_chameleon_brochure_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US DEALER ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Advert said:\u0026lt;br\u0026gt;\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;#666666\u0026quot;\u0026gt; Until now, parents interested in expanding their children\u0027s educational experience, turned to expensive encyclopedias. With the advent of the PET personal computer a new avenue of visual learning is now available for your youngsters for as low as $595....\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; ... Your youngster will think he\u0027s playing, you\u0027ll know he\u0027s learning with the remarkable PET... \u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; At the time, parents often thought a personal computer could help their youngsters learning, but 80% of the home computers sold in the 80\u0027s was used only for playing. \u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to Douglas Reedy\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_Pet_Advert_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [],
  "link": [
    "http://www.pong-story.com/spiel08.htm"
  ],
  "image": "http://www.old-computers.com/museum/photos/philips_lasvegas-es2208_1.jpg",
  "builtInGames": "6 games",
  "controllers": "",
  "media": "",
  "numGames": "",
  "peripherals": "Yes, optional",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}