{"altername_name": ["Drei mal Drei"], "name": "3 x 3", "overview": "3 x 3 is a German language 3 round quiz game and was published in Input 64 1987/02. General knowledge is required for this game. Whoever has collected the most points at the end of the three rounds wins. And we've already got to the heart of the matter. In this game, the number \"three\" is dominant, which means: There are three playing fields, one for each round. Each playing field consists of three by three boxes and up to three people can participate. After the title picture you can enter the names of the individual players. The program accepts one, two or three players. The length of the names is limited to ten characters. If you want to play with or without a partner, press the left arrow key after entering the player names. A list with eight areas appears in the lower half of the screen. The arrow shows you which area you can activate with the RETURN key. Here, too, the \"three\" is used again, because three areas must be selected. The beep that can be heard when each button is pressed can be switched on or off (toggle) with the \"£\" (round button). The area clicked is activated or not activated with the RETURN key. You can use the left, right, up and down cursor keys to move the arrow itself to the area you think you know the most about. Again, after three areas have been selected, click left button to advance. Now that everything is selected, let's get to the actual gameplay. Three playing fields can be seen in the upper half of the screen. One for each round. In each of these fields, the smaller squares are marked with numbers from 1-9. In the lower half of the screen, the names of the individual players are listed on the far left and the points in the middle. The respective round, the associated area and the input window are displayed on the right-hand side. In the first round the game is played on the flak, in the second round on the middle field and in the third round on the right field. The arrow to the right of the scoreboard shows which player has to answer the next question. To do this, you can select one of the nine boxes on a playing field by entering a number (1-9) in the input field and confirming with the RETURN key. The bottom half of the screen will be cleared and a question from the first selected area will appear. If you don't want to or can't answer this question, simply press the RETURN button. In this case, the message WRONG will appear and points will be deducted if you have already collected any. If you now press the space bar (space) you will come back to the previously mentioned picture and the next player will be shown and can make his selection. If you answer the question correctly, 100 points will be credited to the respective account and the box will be filled with the color in which the respective player name is written. There is a bonus if you have correctly answered all questions in the three boxes in a row, column or diagonal. This bonus is indicated by these three boxes flashing in different colors. Each of the nine boxes on a playing field can have up to three questions, depending on the number of players. With one player, each box is assigned only one question, with two or three players, one or two more questions are assigned. If no more questions are allowed in a box, the number of the respective box is deleted.", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Thomas Langenkamp", "publishers": "Verlag Heinz Heise GmbH", "genres": "Quiz", "max_players": "3", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111949-3-x-3\n"}