{"altername_name": ["Dragons"], "name": "64 Dragonmaster", "overview": "COMPUTE! 1983/10 (Issue #41). In this fast-action adventure game, your mission is to maneuver through the countryside until you reach the castle and save the princess - if you can. There are all sorts of dragons you must first conquer and a wily, evil wizard in steady pursuit. The game has four difficulty levels. This game involves three courageous knights who have returned home from war only to find that the countryside surrounding their castle is infested with dragons that were placed there by an evil wizard. Trapped inside the castle is the beautiful princess, who anxiously awaits the first knight who can rescue her. One at a time, the kinghts try to slay all the dragons and enter the castle to save the princess. The knights quickly discover the many dangers of the hunt. A dragon will eat anyone who comes near its head. The only way to get rid of one is to zap in the stomach. Guarding the castle is a phantom dragon that can only be eliminated when all the others have been overcome (The castle drawbridge will remain closed until he is conquered). At times a dragon will appear from nowhere, and occasionally a dragon you thought you'd disposed of sill reappear to have another try at the knight. And last, but certainly not the easiest of the perils, is the evil wizard himself, who chases the knights as they hunt the dragons. If the wizard catches a knight, the knight is destroyed. - How to Play - Manoeuvre your knight through the countryside with the joystick. You are allowed three knights at the start, but watch out, the knights can be consumed very quickly by a dragon. When you encounter a dragon, you must act quickly. Using the fire button, aim at the dragon's stomach, this is the only vulnerable spot. You have no defense against the evil wizard except speed. You must be constantly aware of his distance from you. Remember, if he catches you, your knight is destroyed. Also released on The Big 100 and King Size collections in Europe under the name Dragons.", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Chris Metcalf", "publishers": "COMPUTE! Publications", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=xA3TEO2_4h4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/86559-64-dragonmaster\n"}