{"altername_name": [], "name": "Acid Rain", "overview": "Aicd Rain is a text adventure for several personal computers, as it was written in Infocom Z-Code, which means it can easily be ported to various computers. This was the version ported to the C64 in the same year that the original was written. Introduction: You were driving home from the Second National Conference on Acid Rain when you started getting tired. As it was late at night, and you were in the middle of nowhere, you pulled over to the side of the road for a bit of shut-eye. When you wake up, you find that it's dark and dismal outside and raining heavily. You'd better get a move on and get the car under cover. Despite all the protective coating you've applied, acid rain can still make a mess of your duco. Goal: Your goal is to start the car and drive home. You will soon find that this is not as easy as it sounds. As the story develops, you will find that there are multiple sub-goals. I can't tell you what they are, as that would spoil the fun. Instructions This is a traditional text adventure that was written for ParserComp 2021. A text adventure is a form of computer game that presents you with a story. You take on the role of the main character in the story and control that character's actions. The story has a goal, and you will need to solve puzzles in order to achieve that goal. The computer tells you where you are, what you can see and what's happening around you. You can then move around, examine the things you find, and manipulate those things by telling the computer what to do using simple English commands. Commands consist of a verb phrase, optionally followed by a noun phrase. Most commands can be abbreviated to a verb followed by a noun. For example, START THE CAR can be abbreviated to START CAR. In some cases, the verb phrase and first noun phrase may be followed by a second noun phrase. The two noun phrases are usually separated by a preposition. For example, UNLOCK GATE WITH IRON KEY. If you only use a verb and a noun, the game will generally tell you if it needs an extra phrase or implicitly try to deduce what is needed for the second phrase. Don't panic! It's not as complicated as it sounds. Just use simple English sentences starting with a verb, and it will all feel quite natural. Movement: To move around, use commands like GO NORTH and WALK SOUTH. You can move in any of the four cardinal compass directions, as well as UP and DOWN. (There are no diagonal directions in this game.) To save typing, movement commands can be abbreviated to N, S, E, W, U and D. You can sometimes use other movement commands such as CLIMB, ENTER, EXIT, GET ON, GET OFF and JUMP. Most of these are alternatives to normal compass directions. There is only one exception, and this will be reasonably obvious when the time comes. Whatever you do, make sure you draw a map as you go. This is a medium-sized game. If you don't draw a map, you will most certainly get lost or miss exits to other locations. Examining things: Make sure you EXAMINE everything you find, as subtle hints and clues are scattered everywhere. It might even reveal a new object. When you enter a new location, scan the location description for nouns and examine each of those nouns. If the responses reveal any new nouns, then examine those as well. To save typing, EXAMINE can be abbreviated to X. For example, EXAMINE CAR can be abbreviated to X CAR. You can also try your other senses when it seems appropriate, e.g. SMELL, TOUCH and LISTEN. Unlike EXAMINE, these actions probably aren't necessary to solve any puzzles, so don't feel obligated to use them. Manipulating objects: Apart from exploring and examining things, most of your time will be spent manipulating objects. Use commands like GET or TAKE to pick up an object, e.g. GET CAR KEY. Use commands like DROP or DISCARD to drop an object, e.g. DROP TORCH. Use WEAR to wear something, e.g. WEAR RAINCOAT. Use REMOVE to remove something that is already worn, e.g. REMOVE RAINCOAT. There are many other verbs that can be used to manipulate objects. These will be fairly obvious when the time comes. Common verbs include OPEN, CLOSE, LOCK, UNLOCK, TURN ON, TURN OFF, EAT, DRINK, PUSH, PULL and so on. Use verbs like INSERT or PUT to put objects in containers or on supporters, e.g. INSERT CAR KEY IN IGNITION or PUT BOOK ON TABLE. Warning: There are many dark locations in the game and you will need a light source to see in those locations. The light source uses batteries and these only last for 200 turns, so don't waste them. However, you can easily find some new batteries and these will last for the remainder of the game. Inventory: To see what you're currently carrying and wearing, use INVENTORY (or I). As you are not a pack horse, you can only carry eight objects at a time, not counting the things you are wearing. As a consequence, inventory management is an important aspect of the game. Most objects only have one use, so drop them when you're finished with them. Otherwise, drop them in a central location and come back for them later. Communicating with characters: You will encounter quite a few creatures in the game. When you first meet a new creature, in addition to examining it, you should try talking to it, e.g. TALK TO MACAW. It won't necessarily answer you, but it never hurts to try. If it does appear to communicate, try asking it about something relevant to get further information, e.g. ASK MACAW ABOUT SCREWDRIVER. You can also try showing it something or giving it something, e.g. GIVE BONE TO DOG. Advanced features You can use the pronouns IT, HIM, HER or THEM to refer to objects used in previous commands, e.g. EXAMINE NOTE, READ IT. You can refer to multiple objects by separating the objects with AND, e.g. GET APPLE AND ORANGE. You can use ALL to refer to all the appropriate objects with GET and DROP, e.g. GET ALL to get everything in the current location, GET ALL FROM TABLE to get everything on the table, DROP ALL to drop everything you're holding. When using ALL, you can use EXCEPT or BUT to exclude some objects, e.g. DROP ALL EXCEPT HAMMER AND NAILS. Finally, you can enter multiple commands on the same line by separating them with a period, e.g. UNLOCK DOOR. OPEN IT. Scoring: There is no score in this game. The number of moves is shown in the status bar at the top of the screen. Other commands: Use LOOK (or L) to refresh the display. Use VERSION to get the game version. Use ABOUT or INFO to get some background information and credits for the game. Use CREDITS to get the credits only. Use SAVE to save your progress. Use RESTORE to restore a saved game. Use UNDO to undo the last move. This is handy if you change your mind, make a mistake, or get killed. (You can get killed, but the game shouldn't allow you to get into an unwinnable situation.) Use AGAIN (or G) to repeat the last command. Use WAIT (or Z) to do nothing apart from pass the time. Use RESTART to restart the game from the beginning and QUIT (or Q) to quit without restarting. For an extra challenge This game is all about exploration, finding things, managing your resources, solving puzzles and having a bit of a laugh along the way. For an extra challenge, once you have completed the game, try solving it in the minimum number of moves. You should be able to do it without replacing the batteries in your light source. Most importantly, have fun, enjoy the game and keep out of the", "platform": "Commodore 64", "release_date": "2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Garry Francis", "publishers": "Public Domain/Freeware", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161308-acid-rain\n"}