{"altername_name": [], "name": "Acrobat", "overview": "Published in COMPUTE! 1985/02 (Issue #57) and also in 64'er Spielesammlung #5.a realistic, fast-moving arcade-style game. You must guide your alter ego on a perilous journey through mountains, jungles, and underground caves, while avoiding numerous obstacles by jumping, flipping, or sliding under them. You can select any of three different speeds to start off with, but the action will get faster and harder with each new level you reach. Acrobat will challenge your sense of timing as well as your reflexes. The playing field of \"Acrobat\" is divided into two sections. The top of the screen contains your man, the obstacles, and the background scenery. The scoreboard is located at the bottom of the screen. It contains your current score, the high score so far, and at the far right, the number of men you have left. You begin the game standing in the middle of a mountain valley, ready for your journey. At the beginning of each game, you can choose between three levels of difficulty by pressing the corresponding number. Level 1 is the easiest. Level 3 is almost impossible. After you have chosen the difficulty level, press the START button or push the joystick in any direction to start the game. The Unstoppable Runner After you have started the game, your man will begin to run. He runs forward automatically, and he cannot be stopped. You must maneuver past the various obstacles that come at you. You can push the joystick forward to jump, backward to slide, or press the joystick button to flip. If you manage to stay alive long enough, you will advance a level, and face new challenges. If you touch any of the obstacles, you will collapse in a heap and lose a man. Push the joystick in any direction to continue. You will receive a free man when you reach 2000 points, and at every 1000 points thereafter. You will advance a level after playing for a certain length of time. The screen is redrawn and you are placed into a new setting. Bonus points are also awarded depending on the number of men you have left. Push the joystick in any direction, or push START to begin running again. You can also pause Acrobat while you are running. Simply press the space bar. Press CTRL-S or the joystick button to begin again.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Peter Rizzuto", "publishers": "COMPUTE! Publications", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.69", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=e7sI2uYWFvA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/86655-acrobat\n"}