{"altername_name": [], "name": "Adventure of Cleopatra's Pyramid", "overview": "A standard text adventure for the C64 that was originally converted from the TRS-80 Color Computer. Originally from the book The Third Rainbow Book of Adventures. You remember boasting how you, \"took it single-handedly! Those 200 natives didn't scare me a bit. I defeated their toughest warriors with my bare hands. The rest of 'em just backed off while I simply walked up and snatched the stolen diamond away from the old chief.\" You soon became quite a celebrity, retelling the story for anyone who would listen, while adding more suspense and d anger each time. People everywhere believed you had barely escaped death by your sheer wits and brute strength alone. You were a respected hero for accomplishing the marvelous task. Of course, nobody knows what really happened on your adventure to recover the rare and precious stone. Sure, according to reports, the diamond was stolen by a gruesome tribe of head-hunting cannibals. But, in reality, when you arrived on location in Africa, the diamond was quickly discovered in a rather small village, occupied by a peaceful, vegetarian tribe. And, it didn't take you long to regain the treasure which h ad been found and innocently taken by one of the village children. Of no use to the tribal members, it was easily exchanged for some food you carried in a pack. But why not steal a little glory for the rescue? After all, there was no one who could prove otherwise. A few weeks later, while still enjoying your fame and recognition as a hero, you are approached by a short and stocky, gray-haired man in a local pub. With nervousness in his voice, he says, \" I have heard of your courageous efforts in Africa and have come to make you an offer. I need an adventuresome explorer to travel to Egypt to complete a mission. Finding someone capable of navigating through the vast deserts has not been easy. But, I feel that you may be competent and daring enough to accomplish the task. \" While taking a piece of paper from his pocket, he continues the story. \"About three months ago, as a result of many years of research, I found an approximate location of the pyramid which has eluded archeologists and scientists for centuries - the pyramid of Cleopatra. There, within its walls, are hidden the fabulous treasures of the great queen. However, to this day, no one has been able to conquer the obstacles of the desert surrounding it. \"The man unfolds a piece of paper appearing t o be a map. \" I think it is here,\" he says, pointing to a spot on the paper. \"I sent an archeologist named Dr. Jones to find the pyramid and return with its treasures. However, he radioed after about a week and said a medallion was found that was associated with the pyramid and he was certain of the tomb's location . \" The man pauses. \"Unfortunately, I never heard from him again. Maybe h e ran out of food or water, or was stung by a deadly desert scorpion. Of course, Jones might have foolishly tried to cross the treacherous Nile River. \" More than intrigued with the proposition, you request further details and the mysterious character continues. \"I am in desperate need of the items inside that tomb. You see, I hastily promised a prominent museum I would deliver 25 artifacts from the pyramid before the fifteenth, which is only a week away. The museum paid me in advance and the money was used to repay researching debts, so now I can't pay it back. I desperately need your help ! \" Realizing that you may really have t o prove yourself if you tackle the proposition, you are apprehensive about jeopardizing your credibility. But then, the man pulls a yellow envelope from his hip pocket and flashes a large stack of green bills in front of your nose. \"All for you, if you can complete the quest Jones started, within the next five days,\" he offers, making the deal irresistible. Without thinking twice, you accept the challenge. How could anyone pass up the chance of earning that much money? The man, eager to get you started, gives you the map . It pinpoints the location of the campsite fro m which you will start and the intricate trails of the expedition. He firmly concludes, \"When you have collected 25 treasures, just press the red button on this radio, and I will come to pick you up. Oh, and one other thing ! If it has been more than five days , don't bother calling! \"", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Nathan Butcher", "publishers": "Falsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=WZljZO68_iI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108878-adventure-of-cleopatras-pyramid\n"}