{"altername_name": ["Spy Attack", "Alien Attack (Wicked Software)"], "name": "Alien Armada", "overview": "Published in COMPUTE!'s Gazette 1985/05 (Issue #23), also in Jim Green PD Disk #53 (1990/08), in Super VIC & C64 A3-N01 (January 1986), and also in the 75 Spill Datatronic collection. If you like the fast action of arcade games like Space Invaders, you'll like \"Alien Armada.\" The original version, written by a 14-year-old, demonstrates the versatile sound and graphics available on the C64. They told you it would be easy, farming on the planet Scelor. All you'd have to do is direct the agribots to plant the seeds in the spring and harvest the valuable crop in the autumn. There are no aliens within hundreds of light years, they said. As the shuttle pilot dropped you off, she wished you good luck. You're going to need good luck. The day after you landed, the aliens came. First the mothership, which apparently opened up a space warp from another dimension. Then, row after row of menacing droids. Thinking quickly, you equipped each of your robots with a laser to send the invaders back to their own dimension. The droids don't actually attack you; they simply hover in the sky, waiting to land. But they drop smartbombs, which are impervious to lasers. Your only defense is to move out of the way. The mothership also releases birds that home in on your robots. As the birds descend, they drop slow-moving bombs. Fortunately, you can shoot the birds and their bombs. Your ultimate goal in \"Alien Armada\" is to get to the source of the invading aliens: the ominous mothership. If you can hit it with a single laser shot, you'll send it (and the droids) back to its own dimension. But it's not an easy task. You must first eliminate the droids who guard the mothership. Each changes three times before being sent back home. Published in COMPUTE!'s Gazette 1985/05 (Issue #23), Jim Green PD Disk #53 (1990/08), Super VIC & C64 A3-N01 (January 1986) / 75 Spill Datatronic and published as Spy Attack and Alien Attack by Wicked Software.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "John Matias", "publishers": "COMPUTE! Publications", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/86847-alien-armada\n"}