{"altername_name": [], "name": "Alley Wars", "overview": "A game created by Victor Barbee and published in the ReRun Special Summer Edition 1990. DOG-GONE IT! This could be a real cat-astrophe. The city is in an uproar as canines and felines batte for dominance. That's the scene in Alley Wars, a C-64 game designed for two, three or four players. The battleground covers nine neighborhoods of nine blocks each. Wide boulevards separate the neighborhoods, with a single block at each intersection. The combatants are divided into four squads: two cat squads, represented on the board by red and purple, and two dog squads, represented by green and yellow. As top cat or top dog you must lead your charges to occupy a horizontal, vertical or diagonal line of three blocks within a neighborhood or across an intersection— and prevent opposing squads from doing the same. Blocks you occupy become your squad's color. When four people play, each commands one cat squad or one dog squad. When two play, the first person commands both cat squads and the second both dog squads, but a winning line can still consist of only one color. When three people play, they don't have specific squads and can win with any color. Alley Wars is played with either a single joystick in port 2 or joysticks in both ports 1 and 2. The red cat squad goes first. As its commander, use the joystick to position the white frame over the desired block and press the fire button. The block will become yours and change to your squad's color. You can't claim blocks that are already occupied. As soon as you've claimed a block, game control passes to the next squad. When a squad succeeds in forming a three-block line, a winning fanfare sounds, the border color changes and the game ends. To start another game, press the fire button. Alley Wars is somewhat similar to tic-tac-toe, but unlike tic-tac-toe the block arrangements and playing strategies seem endless. When you command two squads, often one can be used for diversion as the other executes a complex and hopefully subtle offensive move.", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Victor Barbee", "publishers": "RUN", "genres": "Board Game", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367649-alley-wars\n"}