{"altername_name": [], "name": "An Actor's Nightmare", "overview": "Born in Great Britain over a quarter of a century ago, and given the name Nigel Wrath-Horn, you have worked hard trying to make it a name that would be well-known and respected by everyone. Touring the provinces as a stage actor with your original one-man play has not exactly been duck soup. Night after night, traveling from one place to another has you on the verge of mental burnout. Somehow, you manage to keep going, in search of the elusive dream...your big break. One rainy Saturday night, in a rather small theater pub, you deliver what you feel is your finest performance. The small crowd's standing ovation is, in itself, quite rewarding. However, a favorable response from one half-drunken audience is hardly the fame and recognition you are seeking. Pleased, but still somewhat depressed, you join your understudy backstage to help pack the stage props, when suddenly, the two of you are started by a man who appears in the doorway. He introduces himself as Bradley Scott Gordon, a talent scout for the Queen's Royal theater. Much to your amazement, he wants to book your act to be performed for her majesty and a host of dignitaries. The request renders you speechless, as you stare almost paralyzed by the invitation. Fortunately, your sand-in quickly speaks on your behalf and accepts. You just nod in agreement and finalize the deal with a friendly handshake. On the highly anticipated day of the special command performance, your dream of fame appears to be shattered as you wake from an unscheduled nap and discover that there is very little time before the play is scheduled to begin. Your understudy, who has recently been unable to conceal his jealousy, must have put a sleeping pill in the cup of tea he so graciously prepared for you earlier this evening, and insisted you needed. His conspicuous scheme to make you oversleep worked, and he undoubtedly plans to steal all the glory by performing in your place. But not if you can make it to the stage on time. You frantically look at your watch and are astonished to find that only 10 minutes remain before the 8 :00 p.m. curtain call. Realizing that you know absolutely nothing about the large London theater, finding the stage in such a short period of time could be impossible. And to make matters worse, your personal identification and backstage pass are missing from your wallet. Without them, no one will ever believe you are Nigel Wrath-Horn. An Actor's Nightmare begins in an alley outside the theater. Type T I ME and a digital watch will display that it is 7:50 p.m. Remember, the curtain rises in 1 0 minutes and every move you make or each command entered consumes five seconds, which equates to 120 moves per game. Even incorrect requests, and commands of V E R B and T I ME are counted as moves, so plan them carefully.", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Nathan Butcher", "publishers": "Falsoft", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/86663-an-actors-nightmare\n"}