{"altername_name": [], "name": "Archon III: Exciter", "overview": "Archon III: Exciter was a fan-made, unofficial sequel of the highly acclaimed computer game Archon and Archon II, created in 1985 for the Commodore 64 computer. Archon III was never published by Electronic Arts or any other company, nor was it ever formally reviewed by a video game magazine. It was, however, freely copied amongst Commodore 64 users. The creators of Archon III borrowed heavily from the original Archon title and credit screens, crediting Electronic Arts as publisher, and Anne Westfall, Jon Freeman, and Paul Reiche IV (Paul Reiche III developed Archon and Archon II) as the authors. This initially confused many people who saw the game into believing that it was an official sequel. The most telling sign of its forgery however, was the title screen editing of \"Free Fall Associates\". The word \"Fall\" was replaced with \"Fuck\" by Archon IIIs authors. The noticeable lack of quality in Archon III added further proof of its unofficial status. In Archon III, players fought with sluggishly moving, sprite characters in the game's combat sequences. The battles did not involve the use of melee or projectiles but rather a circle of \"fire\" (similar to the Banshee character in the original Archon) that could reduce the health of the other player should it make contact. Different characters all moved and acted based on weighted strategy, thus winning was based on choosing right characters. Any kind of board game strategy plays, a feature which existed in the original Archon games, was completely non-existent. There was no single player mode or computer AI, meaning that it was strictly a two-player game, unlike either official Archon game.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Free Fuck Associates", "publishers": "Public Domain/Freeware", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=rlYBR35QNNc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107552-archon-iii-exciter\n"}