{"altername_name": [], "name": "Artax", "overview": "Artax is a horizontal scrolling shooter developed by Maurice and Raymond Penders and published in Magic Disk 64 1989/04. A new space game is currently very popular with the entire editorial team: \"Artax\" has been blocking all computers in our rooms for days. Only MANIAC-FRED is quite disappointed with this game and annoys us all the time with sentences like \"Much too lax, the game\" or \"Where are the screams?\" . Why does a \"shooting specialist\" like Fred not like a \"shooting game\" like \"Artax\"? Very easily: \"Artax\" is a well presented skill game that is about (much) more than just \"banging around\". In addition, we suspect that our new acquisition is just a little too difficult for our \"Redaktionskaspar\", but he does not want to or cannot admit it. . . \"Artax\" should already inspire you right from the start: A nicely arranged intro \"whisks you away\" to the distant galaxy where a hot battle is waiting for your little spaceship. \"Of course\", you will surely say now, \"We know that\" . \"Bombastic intro, great cover picture, and the actual game is once again as lean as a gnawed bone...\" . Unfortunately we have to disappoint you here, because \"Artax\" does what the introduction promises. What is \"Artax\" about? Unfortunately we don't have a story in stock; such a would also be inappropriate. You fly with your spaceship along a long tunnel and have to try to avoid the enemies approaching in the convoy or to let them burn up in the fire of your laser cannons. Should the latter happen, please avoid directing your spaceship into the explosion nebula. . . As soon as you have completely destroyed an approaching line of enemies you will be rewarded with an additional laser (example: you destroy a complete convoy of enemies with one laser, and as a \"reward\" you can defy the next attack with two lasers...). But do not rely too much on your fire abilities: It is wiser to avoid some convoys than to take them under fire and thus \"die\" early. Laser barriers await you at irregular intervals in the middle of the tunnel, through which you cannot always pass. Just wait for a suitable opportunity, but always expect a sudden attack from behind. . . ! So if you feel like doing some \"joystick exercise\" again (or just want to play a good game), \"Artax\" is made for it!", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Maurice Penders & Raymond Penders", "publishers": "CP Verlag", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=HR2Myswxgmw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/87538-artax\n"}