{"altername_name": ["Awalé"], "name": "Awale", "overview": "Awalé, though little known in Europe, is one of the world's most widely played games. It is played throughout Africa and can be found under a variety of names and with different formats. This version comes from a region of the Ivory Coast, called Baoule, and is a game for two players. The equipment is very simple: a board, generally made of wood, which has had hollows carved in it, (most usually there are 12 for the game itself and often another 2 to hold the players' gains), and 48 grains, so-called because in the original these would have been whatever was to hand - perhaps coffee beans or pebbles. Each row of 6 hollows represents the camp of one of the players, known as north and south. At the start of the game, each position holds 4 grains. The 2 positions for the players' gains are empty. North (or the computer) plays first. The game is played by distributing the contents of one of the player's own positions around the board in an ant-clockwise direction. Each player in turn takes all the contents from the chosen position and distributes them one at a time until none is left, missing the starting point if going round more than once. The last position added to is checked to see if it is both in the opponent's camp and now contains either 2 or 3 grains. If so, the player takes all the grains from that position and adds them to their own gains, in the place designated for these, then moves back one position to apply the same 2 tests. This continues until a square is not in the opponent's camp or does not hold 2 or 3 grains (or both). A player can defend a position from attack by moving the threatened grains, by taking the threatening grains or by moving grains in such a way as to make the intended attack pointless or impossible. If one player has no grains left in their camp, the other must 'feed' them by making a move which will place grains in the opponent's camp, if such a move is possible, thus allowing the game to continue. The winner is the first player to amass 25 or more grains. In the event of a stalemate, the game can be abandoned (by pressing C= Q) and the winner is the player with the most gains. Choose your position by pressing its letter key, change your mind as many times as you like, then press RETURN to make your move.", "platform": "Commodore 64", "release_date": "", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Bob Mockford", "publishers": "Public Domain/Freeware", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130896-awale\n"}