{"altername_name": [], "name": "Bagman Strikes Back", "overview": "This game is a tribute to Bagman, an arcade game released by Valadon Automation in 1982. It is also the sequel to Bagman Comes Back. This version is made up of 24 completely new stages. The game works perfectly on both PAL and NTSC models. However, for game speeds similar to the original arcade game, it is suggested using an NTSC model. Gameplay The objective of the game is to maneuver the bagman through various mine shafts, picking up money bags and placing them in a wheelbarrow at the surface of the mine. The player must avoid pursuing guards, moving ore carts, and descending elevators. The player can temporarily stun the guards by striking them with a pickaxe or by dropping a money bag on them when they are below the player on the same ladder, or by sliding a bag on them when they are further down the same slope. The guards can also be stunned by placing the wheelbarrow at the top of the ladder or elevator while they are going up. The pickaxes can also be used to break down walls that obstruct the passage. Keep in mind that bagman can hold the same pickaxe for a few seconds, after which it disappears. The initial duration of each pickaxe is 8 seconds, but if the player drops a pickaxe before it expires and then picks it up again, the duration resets to 4 seconds each time. Bagman can jump into an ore cart after grabbing a ceiling handle as well as he can jump off the cart by moving the joystick left/right or by moving it up/down when the cart is on a vertical ladder.", "platform": "Commodore 64", "release_date": "March 4, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Luca Carminati", "publishers": "Public Domain/Freeware", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=7SpfrDexE1g", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168167-bagman-strikes-back\n"}