{"altername_name": [], "name": "Be Logical", "overview": "Be Logical is a single player puzzle game for the Commodore 64. It was developed by Marc Pfadenhauer and published in the following: - 64'er 1992/02 - 64'er 1999/06 At first glance, this game by Marc Pfadonouor is quite simple: all you have to do is copy the pattern that appears on the right side of the screen after the start on the left side.Unfortunately, this is associated with a problem: You cannot set the individual values of a stone directly, you can only influence it through the neighboring stone. Be Logical unzips and displays the status bar and two play fields. In the status line you can see the last game status reached (of course 0 after loading). After pressing the fire button on joystick 2, this status line switches. Now the time in which you have to complete this level will be counted down. The current score, the current level and the number of lives are continuously displayed at the top of the screen. Move the cursor in your (left) field with the joystick in port 2. The cursor follows on the right field. In this way, you retain clarity with complicated patterns. With the fire button you place a star with the value 1 in your playing field. The value of such a stone cannot be increased if you place a stone on this position a second time. If place a 7wide stone immediately above or below this. The new stone also has the value 1. The previously placed stone then has the value 2. Use the space bar to determine the direction in which other stones will be affected. The cursor in your field always indicates the direction in which other stones are being affected. If the cursor shows ropes, the stones on the left and right are increased by 1; if it points up and down, the value of these stones is increased by 1. If you made a mistake: end this round with the upper right arrow key. A life will now be deducted from you. If you want to take a break, press P. Time will stop and the playing fields will be turned off so you don't think up a strategy to solve the level during the pause If you have completed a level, the remaining time is added to the score and a new round begins.", "platform": "Commodore 64", "release_date": "February 1, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Marc Pfadenhauer", "publishers": "Markt & Technik", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/329744-be-logical\n"}