{"altername_name": [], "name": "Beach Blanket Volleyball", "overview": "Serving the Ball : In order to serve the ball, you must first select the angle of your serve. When you move the joystick right or left, the direction indicator at the bottom of the screen will move in response. When you have selected the direction you would like the ball to go (straight, left, or right), press the joystick button and the server will throw the ball in the air. To hit the ball, press the joystick button a second time when the ball starts its downward motion. The higher the ball is In the air when the server hits it, the farther it will go. Do not wait too long, or the ball will drop to the ground and you' will lose the serve! Returning Hits : To return the ball, move the direction indicator, as you did during the service, to pick the direction of your hit. At the bottom of the screen you will see a bar indicator which controls the power of ,-your hit. To the left is the tetter \"S\" for soft, and to the right is the letter \"H\" for hard. The indicator is always set to the lowest power after each hit. To increase the power, press the joystick button and the bar will lengthen. The longer the bar, the harder the ball will be hit. You do not have to worry about moving the players or hitting the ball, that is done automatically by the computer. However, you control how high you hit the ball. If you move the stick forward when the player hits the ball, it will cause the ball to go very high. All spikes must be setup using a high hit. If you move the stick back towards you, it will give the ball its lowest arc. This will also give the ball more speed. If you do not move the stick at all, the ball will have a normal arc. Spiking the Ball : Only the net man can spike. To spike the ball, a player must set it up for the net man with a high shot very close to the net. You control the strength and angle of the hit as you would any other shot. You do not need to worry about the height of your spike, all spikes go down with no arc. Returning a Spike : Returning a spike is very easy. All you need do is pick the angle of the return. The strength of the return is always the same, and all spikes are returned with a high shot. The return is always hit to one of your own teammates, as you cannot return a spike directly over the net. When returning from a spiked ball, you need to hit the ball at least twice before you can spike the ball back. Catching Your Opponent Out Of Position : You will notice that on long rallies the players will sometimes get out of position. While the ball is in the air, players will return to their original position. However, if the ball is hit before a player is in position, that player will stop where he is. You can use this to your advantage by making your opponent move long distances to return your hits. This can cause areas to become unprotected, and allows you to hit that winning spike! Ending the Game : The winner is the first team to score 15 points with at least a two point lead. If 15 points are reached without a two point lead, the winner is the first team to obtain a two point lead. You may reset the game at any time using the (RESTORE) key. When you reset a game you will be sent back to the game selection screen. Released as part of \"Commodore Pro-Pak\" game pack.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Walter Denny La Croix", "publishers": "Advantage*Artworx", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=qKxsIusRwfY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/88221-beach-blanket-volleyball\n"}