{"altername_name": [], "name": "Bellringer III", "overview": "Bellringer III is a game which was submitted to the C64 16KB Cartridge Game Development Competition 2013, organized by RGCD. You are the Bellringer, whose mission is to find your way through various castles, and collect as many bags of gold as possible on your way. You will be awarded 750 pts for each bag collected. Avoid the evil knights and other bad guys who guard the castle. Your health will decrease when you get too close to them, or if you are hit by arrows or other objects which they use to attack you (and this actually includes boiling hot water!) If you find a small, yellow box in one of the castles, you should pick it up to refresh your health. The game will end when you run out of health, or if you should be so unlucky to fall or jump into the fire at the end of a castle. You may kill enemies by using the fire button to throw magic at them. Please note that your supply of magic is limited, but you may find something in a castle which will increase your supply again... There are eight bells at the end of each castle, and you need to ring four of them in the correct order. All bells (except one of them) will lower a wall and raise another, or extend a bridge part and retract another, when you pull their rope. You need to be positioned directly below a bell and then jump straight up in order to pull a rope. When both walls are lowered and both bridge parts are extended, you may exit the castle to the right. You will be awarded a bonus which depends on how many bells you had to ring to be able to exit the castle. The bonus will be at least 1000 pts.", "platform": "Commodore 64", "release_date": "2013", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Geir Straume", "publishers": "Public Domain/Freeware", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=krsPAQ03dXg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75486-bellringer-iii\n"}