{"altername_name": [], "name": "Below the Root", "overview": "This game was highly ambitious and had many subtle and clever details woven into its universe. First of all were the social norms of Green-Sky. Theft and violence were alien concepts to most of the books' characters. Therefore, one could not (as is common with adventure games) simply walk into a room and pocket an unattended object. One had to find the owner of the object and ask permission, buy the object with money (called tokens) in a shop, or locate the object in a public area. In the books, the Kindar economy was a moneyless quasi-communism; it was the Erdlings who used tokens and were used to being able to buy whatever they could afford. Particularly interesting was the extremely low level of violence in the game. The player could be hurt only by falling, coming into contact with snakes or tree spiders (invented for the game), or walking into walls. These incidents merely resulted in a jarring \"bump\" sound effect and an animation of the character crouching and rubbing their head, as if recovering from a nasty knock, rather than any gruesome or graphic injury. Even the occasional adversary did not hurt one's character grievously, although one did slowly lose health points and game time, and might find oneself sent back to one's nid-place (house) with an ominous notice that \"you were found unconscious.\" Alternately, your character could be kidnapped and held prisoner by the racist factions of the Salite or Nekom in one of the two \"prison houses\" in the game. A player with no other way to escape these prisons (or who found themselves otherwise trapped) could \"renew\", which was essentially a process of slipping briefly into a sort of recuperative coma, which resulted, as with the loss of all health points, in a loss of game time and the character returning to their nid-place (again, assuring that the character could never actually die during the game). In the Nekom \"prison house,\" you could find a machete (called a \"wand of Befal\" after Axon Befal, the Erdling faction's leader, but its primary use was to cut thick vegetation. If you killed people with this blade, there were serious, permanent penalties to your abilities. Taking lives would essentially make the game unwinnable, which is consistent with the themes expressed in the original story. It was among the first games that offered a choice of multiple protagonists, as well as a choice of gender, age, race, and beginning level of psychic powers (referred to as \"Spirit-skills\"). Furthermore, people treated the characters differently based on your choice of avatar. A child character could be invited to play. Erdling characters could be given a chilly reception at some Kindar houses and vice versa. Consistent with the books, these people were portrayed as being opposed to any alliances between the two cultures, and thus had to be avoided whenever possible. Pensing to read thoughts and emotions when encountering a stranger provided clues to their attitudes and distinguished friend from foe. While the game's technology limited the extent of these features, they were certainly present. Another interesting detail is that the vegetarian Kindar characters did not get much nutrition out of eating meat, and temporarily lost psychic abilities. Likewise, the narcotic Wissenberries were somewhat more health-damaging to Erdling characters. In the books, Kindar — even children — often used the berries in rituals and ceremony, as well as recreationally, and for relief of physical and emotional pain. Most of the gameplay focused on the challenges of getting the character to move around the game world. Various objects in the game were used for this. Of primary importance was the shuba, a flying-squirrel-like garment which allows the character to glide diagonally instead of falling, and also prevented the character from being hurt by falls. Along the way, one learns a variety of \"Spirit skills\" or psychic abilities of progressive difficulty. The Spirit-skills, which included telepathy (called \"pensing\"), telekinesis (called \"kiniporting\") and the ability to make tree branches grow to create temporary bridges across impassible gaps (\"grunspreking\") are the key to making progress in the game world and achieving the ultimate goal. Communicating with animals as well as people through telepathy is vital to enhancing the character's Spirit-skills. The graphics were exquisitely colored, highly advanced for the time. Users have described the deeply evocative and compelling qualities of the images as being one of the main reasons they kept playing. Snyder's husband Larry wrote a number of bell-like musical phrases very much in the style of the choral chant important to both cultures as described in the books. As in today's games, these pieces are heard when an important discovery is made or the player gains important skills or advances. The game is a direct sequel to the books, and is meant by the author to be taken as canon. It originated in Snyder's realization that one of her final plot elements had been a huge mistake. She was being flooded with mail from adults and children, but could not see any way to change the ending now that the book was on the market. In addition, she had believed the event she described to be necessary to the ultimate resolution of the plot. Introduced to the concept of computer games, Snyder saw a way to redeem the situation while keeping and even advancing the original plot. The object of the game is to solve the mystery of what really happened.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Dale Disharoon", "publishers": "Windham Classics", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "https://en.wikipedia.org/wiki/Below_the_Root_(video_game)", "video_link": "https://www.youtube.com/watch?v=xdUBefQ1cT4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33270-below-the-root\n"}