{"altername_name": [], "name": "Bionik Granny Returns", "overview": "Back in 1984, Granny was waiting outside the school gates, waiting to clobber the brats who were responsible for making her life a misery. Now 26 years later after her hard earned rest, SHE'S BACK. The cantankerous old lady is on a little adventure, which is to go out into town and grab her pension from out of the local post office. Unfortunately for her, the town's full of pushers and shovers. Not only is this bad for her - she's very annoyed. She finds herself in a situation where modern society seems to be too much for her. So she puts on her blue raincoat, picks up her walking cane and gets ready to go out and clobber the poor folk. Using (or emulating) a joystick in port 2, help Granny clobber passers by with her cane - to retrieve coins. To be able to release a coin, granny must clobber at least five people. If a coin is visible, she can keep clobbering folk and then after the coin has disappeared, she can clobber five people again to release a new coin. Then when a coin has appeared, quickly help Granny grab it. You are not against time in this level. So if you want to do a load of clobbering to boost up your score, then that's what you can do. Out to stop Granny are some people and other beings, throwing or shooting hazards. Avoid those at all costs. After each level has been successfully completed, you will move on to the bonus round. This is where you will have to help the old lady cross the road and enter a building to grab her pension - otherwise something daft will happen. Complete all 8 levels to win the game.", "platform": "Commodore 64", "release_date": "2010", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Richard Bayliss", "publishers": "The New Dimension (TND)", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=7TG2p0by0w8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75412-bionik-granny-returns\n"}