{"altername_name": [], "name": "Blades of Steel", "overview": "Based on the arcade game, Blades Of Steel is a hockey arcade action game (gameplay doesn't require the need to worry about statistics or provide the ability to customize teams.) Two players can play against each other, or one player against the computer. In one player mode there are single game and tournament mode options. From time to time a fight may break out, which will provide a close up view of the two players. The player has control during the miniature fight game sequence, with the loser having to spend time in the penalty box. The referee will break up fights that go on too long, and calls a few penalties such as icing. Several short clips of digitized voices are also featured. At the beginning of the game, players can select either \"Exhibition\" or \"Tournament\" matches. An exhibition match is just one game played against either the computer or another player. Tournament matches are similar to the NHL playoffs. It starts out as one team of the player's choice going against other teams in a playoff style tournament. The team that is successful in beating all of the opposing teams is awarded the Cup. Fighting in the game is initiated whenever two players bump into each other three times in a row without hitting another player. The two players will stop skating and engage in pre-fight confrontation where they are able to exchange punches if they choose. If one player is able to rapidly punch their opponent during the pre-fight there is a chance they will knock their opponent down and neither player suffers a penalty. If mutual punches are thrown during the pre-fight sequence, then a voice yells \"fight\", the fight screen appears, and the gamers take control of their players. During the fight a player can punch high, punch low, block high, or block low and is given a health bar of five hits. The loser is the first person to get hit five times, is given the penalty, and sent to the penalty box (the winner is not punished), creating a power play opportunity of 5-on-4 skaters. Up to four players can be penalized, for a maximum of a 5-on-1 advantage. If a fight occurs close to one of the nets, the referee may break up the fight and call a \"penalty shot\".", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Antal Zolnai", "publishers": "Konami, Inc.", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "1.83", "wikipedia": "https://en.wikipedia.org/wiki/Blades_of_Steel", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/65764-blades-of-steel\n"}