{"altername_name": [], "name": "Blow It", "overview": "Blow It is a 1-2 player clone of Bomberman for the Commodore 64. It was developed by Gerrit Knoef and published in Input 64 1986/12. The game also includes speech. Blow it: training game for under cover agents. This game was written by the Dutch author Gerrit Knoef, so this time the texts within the program are, contrary to our usual habit, in English. You can play alone or in pairs, with two players you can choose whether you want to play consecutively or simultaneously. To play simultaneously, select the COOPERATE YES option. The aim of the game is to get as many points as possible, you get them in different ways. Repelled monsters score 100 or 150 points, depending on their type. Monsters want to get you. Try to escape them and find the hidden treasures. But be careful, it's all too easy to blow yourself up with non-suicidal intent. An uncovered and collected treasure is worth 500 points. If you complete a level within the time limit, you get additional bonus points. In order to find the treasure or to make your way, you have to blast through the cracks in the masonry. You place the bombs required for this by pressing the action button on the joystick or press the corresponding button. After a moment the bomb will explode, so get to safety and keep your distance! You can also use this method to fend off attacking monsters. When the time is up or you have caught all the monsters, you go to the next level. Some levels get tricky: in the Auto-Bomb level you lose the bombs by yourself. And then there's the level where a prankster turns off the light and you have to find your way in the dark. But players with strong nerves will also be able to do this.", "platform": "Commodore 64", "release_date": "December 1, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Gerrit Knoef", "publishers": "Verlag Heinz Heise GmbH", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=pDHpoiA9zws", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368135-blow-it\n"}