{"altername_name": [], "name": "Bowling Champ", "overview": "Released in COMPUTE!'s Gazette 1983/12 (Issue #6); 75 Spill Daratronic. Some games like Space Invaders or Adventure create their own fantasy worlds, while others are simulations of reality. \"Bowling Champ\" is one of the latter. It's not easy to take a game with countless physical variables, such as bowling, and reduce it to numbers so it can be re-created by a computer - especially a small computer. Compromises must be made. But Bowling Champ is a reasonable simulation of a game of ten pins, given the limitations imposed. The elements of skill and luck have been preserved, and the scoring is authentic. For Up To Three Players When you first run Bowling Champ, it asks for the number of players. One, two, or three people can play. Next you type in the players' names. To fit the names on the screen, the program truncates them to six characters. Now you're ready for the first frame. The bowling ball rapidly moves up and down across the alley undl you press the space bar. This rolls the ball down the alley and knocks over the pins, unless you've thrown a gutter bail. The trick is to time your release so the ball rolls down the center of the alley to score a strike. In case you're unfamiliar with how a game of ten pins is scored, here's a brief summary: A game consists of ten frames or turns. Each player gets one or two balls per frame. If you roll a strike - knocking down all ten pins with the first ball - you don't get a second ball, but the current ball's score is ten plus the total of your next two throws. It some pins are left standing after your first ball, you get a second ball. If you knock down all the remaining pins, it counts as a spare, and the current ball's score is ten plus your next throw. If any pins remain after your second ball (no strike or spare), the number of pins knocked down in that frame is added to your previous score. Rolling a spare in the tenth (last) frame gains you one extra ball; rolling a strike in the tenth frame gains two extra balls. Therefore, a perfect game - ten strikes during regular play plus (wo strikes with the extra bowling balls— scores 300 points. Needless to say, this doesn't happen very often, either in real bowling or in Bowling Champ.", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Joseph Ganci", "publishers": "COMPUTE! Publications", "genres": "Sports", "max_players": "3", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108632-bowling-champ\n"}