{"altername_name": [], "name": "Brickbusters", "overview": "You are being held prisoner in the dreaded mile-deep dungeons of the evil Toragard, dictator of Myoria. Once every five years, evil King Toragard selects a prisoner to play a game he calls Brickbusters. If that prisoner wins the game, he is freed. If he loses, he is put to death. To your great surprise and delight, you are chosen to play the game this year. You are taken from \"your dungeon cell to a small circular room. Inside sits King Toragard. Af- ter greeting you with an evil smile and wishing you luck, he proceeds to give you instructions. Your objective is to knock out every brick in the room above you, using a limited supply of Dynaballs and a remote-controlled Dynaboard that you can move left and right. Toragard leaves the room and suddenly you are all by yourself, ready to play Brickbusters. A Dynaball flies up toward the bricks far above. It hits one and is suddenly propelled straight back in your face. You push left on your controller and deflect the speeding ball back at the bricks. Minutes later, you are still going strong. Only one more brick and... wow! What's happening? The room above you is filled with bricks again, only there are more than before. You abruptly realize that no one has ever won King Toragard's Brickbusters, and you now know why. \"Ybu clear screen after screen and still it goes on. Will it ever end? When a Dynaball hits a brick, the brick is ionized instantly. After hitting a brick, the Dynaball will be propelled at a random angle away from the brick it hit. The Dynaball will not affect the walls or ceiling when it hits them. Instead, it will bounce off with an opposite angle to the one it had upon collision, unless you are moving the Dynaboard in the direction the board was moving when it hit the board, but at a shallower angle. This is called putting \"English\" on the ball. There is only one time when it is absolutely necessary to use English: when the ball is bouncing straight up and down between the ceiling and the Dynaboard. The room above you is unaffected by gravity, and no friction will be put on the ball when it hits the walls, the ceiling, a brick, or your Dynaboard. The ball will never lose enough speed to stop because it picks up energy from everything it hits. After clearing the first room or level, you will be put on a new level. After clearing all four screens, you will be sent to the first again. Every screen is slightly faster, and you will receive one extra Dynaball for every screen you clear. Available in Ahoy! 1986/03 (Issue #27).", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Paul Seeburger", "publishers": "Ion International, Inc.", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Fumh88-SoXs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90085-brickbusters\n"}