{"altername_name": [], "name": "Brilliant Maze", "overview": "GAME OBJECTIVE: Your mission is to guide our little, green hero through the maze and collect the four diamonds. You will be awarded 750 pts for each diamond collected. When all diamonds have been picked up, an EXIT wil open in one of the corners of the maze. Escape through this exit to reach the next level. One or two arrows will appear on screen to guide you to the currently closest off-screen diamond, or to the location of the maze exit. Avoid all enemies (the evil Maze Protectors), because a too close encounter with them will cost you one of your three precious lives. An extra life is awarded at 20000 pts. Some useful tools will appear at random locations in the maze: - Pick up a TAR BARREL to be able to create tar pits, which will slow down enemies passing through them. Your score will increase when an enemy gets slowed down by a tar pit. - If you pick up an E.M.P. TOOL, you may generate electromagnetic pulses which temporarily stun and confuse the enemies. - Pick up a SHIELD TOOL to be able to generate a temporary shield, which will allow enemies to pass straight through you without causing any harm. - The SPEEDx2 tool will give you a temporary boost in movement speed, allowing you to outrun the enemies. Some levels contain TELEPORTS and TRAMPOLINES, which you should make use of to avoid enemies and to reach otherwise inaccessible parts of the maze. Developed by Geir Straume on code and graphics, and Sean Connolly on sound and music. Released as part of the RGCD C64 16KB Cartridge Game Development Competition 2014.", "platform": "Commodore 64", "release_date": "2014", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Geir Straume", "publishers": "Public Domain/Freeware", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=j_KXaoT-ca0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75418-brilliant-maze\n"}