{"altername_name": [], "name": "Brothers of the Bow", "overview": "11th Century China. The elderly and tyrannical Duke Zhao of Chongqing, fearing the approach of death, expels the Buddhist priests from his court and appoints a coven of alchemists and sorcerers to discover the secret of immortality.Their rituals summon the demon Narodakini: an extra-dimensional entity that was once praised as a goddess in ancient Ti-bet, before the disciples of Buddha put an end to her cult and drove her into powerless exile, deprived of the psychic energy of her former worshippers. Narodakini offers to reveal to Duke Zhao the secret of eternal life, if he will re-establish her cult in his province. Temples and statues are quickly raised in her name, all Buddhist priests are exiled from Chongqing, and the people are commanded under pain of death to do homage and make sacrifices to the power-hungry spirit.As her worship increases, so does her energy, until Narodakini’s psychic influence spreads throughout the province, enslaving the duke, his servants, his soldiers, and all whose minds are not protected by virtue and wisdom.“Fulfilling” her pact, Narodakini transforms Duke Zhao and his courtiers into the living dead, and banishes them to tombs in the wilderness. She replaces them with an inner court of her own demonic subordinates.Most of the righteous people who are spared her influence flee from Chongqing, hoping to summon aid from the neighboring states before Narodakini’s power is too great for even the emperor to challenge. In the town of Nanchang, however,seven brothers remain: all humble, virtuous, and normally peaceful men who work the land. Horrified when the mind controlled soldiers of Narodakini invade their town and murder those of their friends and family who have been too slow to escape, they seek advice from the one Buddhist monk who has remained in Chongqing.He advises them to ride to the local Shaolin temple and ac-quire the Sacred Arrows of Mahakala: the only weapons capable of exorcising the newly-empowered Narodakini. However,in order to seize the arrows from the enslaved Shaolin warriors,and then to travel to Narodakini’s stronghold in the necropolis of Fengdu, the brothers will need a few more useful items, not to mention all of their hunting and riding skills, and all of the help that the divine powers can send them ... Published in Commodore Free #064.", "platform": "Commodore 64", "release_date": "2012", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Anthony Burns", "publishers": "Commodore Free", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Nw3q5k86AJc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75501-brothers-of-the-bow\n"}