{"altername_name": [], "name": "Bruce Lee II", "overview": "The Original of the Original: Back in 1984, Datasoft Inc released a game based on the Bruce Lee character featured in motion pictures. The game was ported to many platforms at the time and it got pretty good reviews. Many people look back and remember the game with love and warmth in their hearts. So do I. The Original: In 2013, Bruno R. Marcos released a spiritual successor to the Bruce Lee game on his website, www.bruneras.com. The game was called Bruce Lee II. It featured an Amstrad CPC mode and a Commodore 64 mode, which gave the game a retro look like it was created for those two platforms in the first place. It also featured sampled sound from the 1984 Bruce Lee game in addition to some new ones. The Conversion: Mid-April 2014 development started to port Bruno's Bruce Lee II to the Commodore 64. Almost a year later the game was finished. Even if the game originally looked like a Commodore 64 game, it was very difficult to make it run on a real Commodore 64. The reasons are basically that the game contains a lot of features and also pushes the limits of the graphics hardware, even if it looks simplistic. The conversion isn't perfect, and some small things differ from the original due to hardware and effort limitations. Difficulty: The original game has a couple of places where you need to perform pixel perfect jumps to get forward in the game. This can be frustrating, so an easy game mode has been added. This adds a small amount of walkable blocks, which removes the need for pixel perfect jumps. The easy game mode also makes one room with dangerous moving floor tiles easier, and you have ten lives to begin with instead of five. I would recommend you to play the easy game mode unless you are prepared to grind and replay the game a lot. The Game: Play the game with joystick in either port or use the WASD keys and SPACE on the keyboard. Pressing the STOP key pauses the game. Pressing STOP again resumes. The game exists in two formats, a diskette version and an EasyFlash cartridge image. The diskette version requires a disk drive device of some sort and the cartridge image can be burned on an EasyFlash cartridge and played using the cartridge only. No disk drive is required in the cartridge version. The game has been made with compatibility in mind. It works on PAL or NTSC machines with no speed differences and should work nicely with a lot of add-ons, even some CPU accelerators, like the SuperCPU. The game features background loading on 1541, 1571, 1581, CMD FD drives and CMD HD. If the game can't detect the drive type, it will fall back to kernal loading between screens. It should basically work on anything that loads using the kernal, just not as smooth as with background loading supported drives. Some people report that the drive detection fails on some drives and loading gets stuck before the menu. You can force kernal loading by holding the commodore key (left ctrl key on VICE emulator by default) in the intro with the black background, releasing the key first when you see the main menu.", "platform": "Commodore 64", "release_date": "March 30, 2015", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Bruno R. Marcos", "publishers": "Jonas Hulten", "genres": "Beat 'em Up", "max_players": "1", "cooperative": "No", "rating": "4.49", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Wt8SNxr1pG4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113918-bruce-lee-ii\n"}