{"altername_name": [], "name": "Bruce Lee: Return of Fury", "overview": "Bruce Lee: Return of Fury \"Return of Fury\" is a continuation of the original game \"Bruce Lee\" developed by DataSoft, Inc in 1984. It features all of the classic gameplay in a brand new world. Bruce's long-time foes, The Yamo and The Ninja also return, as always hell-bent on foiling Bruce's challenge. WELCOME TO BRUCE LEE - RETURN OF FURY 35 years later, The Emperor had rebuilt the Forbidden World. Enemies regrouped and came back even stronger. There was no backing out of the challenge ahead. Be like water, my friend, and you will be victorious. The Legend has returned - The Adventure continues. HOW TO PLAY Up to 3 players simultaneously using Protovision's 4 player adapter. PLAYER SELECT Use joysticks 1-4 left/right to select character. Press fire button to assign a device for the character, press again for CPU control. Push up for bare upper body or iconic yellow jumpsuit. Press fire button on difficulty level NORMAL or HARD to start the game Bruce must be human controlled, or game will not start. GAME MODES NORMAL mode: 3 continues available, normal gameplay. HARD mode: Faster enemies and NO continues. Kung-fu masters only. IN-GAME SPACE to pause/continue the game. F1 to return to the Titles. CREDITS Original game by DataSoft, Inc. 1984 Return of Fury modification by Megastyle Published by Megastyle 2019 BRUCE LEE Original programming by Ron J. Fortier Graphics by Kelly Day Sound Effects and Title Theme by John A. Fitzpatrick RETURN OF FURY Maps, music and additional programming by Vidar \"dmx\" Bang Loading picture by Rune \"Sparkler\" Spaans Tape loading music by Anders \"Rage\" Rodahl Megastyle intro by Kåre \"Docster\" Johansen, Roy \"Rotteroy\" Widding Testing by Rotteroy, Docster, Rage, Andrew \"Merman\" Fisher and Vinny Mainolfi Linking by Chris \"Microbit\" Stanley Final compilation by Rotteroy Tape version mastered by Tom Roger \"SLC\" Skauen of Pond Software Tape loader made by Paul Hughes", "platform": "Commodore 64", "release_date": "March 1, 2019", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Megastyle", "publishers": "itch.io", "genres": "Beat 'em Up", "max_players": "3", "cooperative": "Yes", "rating": "4.38", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=nDOp_dXOIbs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113687-bruce-lee-return-of-fury\n"}