{"altername_name": ["Chimp Challenge", "Knees Calhoon's Chimp Challenge"], "name": "Calhoon's Chimp Challenge", "overview": "Game credited to Knees Calhoon and published in Loadstar #152 in 1997. Chimp Challenge: Knees' latest contet dares you to find the quickest way to get four chimps under control. The program started out to be a simple-one-puzzle challenge, inspired by the puzzlemaker known as Pentagra, but by the time it was done, it had turned into a rather confusing set of random puzzles. Thanks to Lee Novak's revolutionary Mr. Mouse, this game works with a mouse in Port#1 or a Joystick in Port#2, no keyboard control is offered on this one. The program is set up like a scientific experiment, with the idea that you will play around with various randomly generated puzzles or 'Trials\" until you get good enough to go to the full challenge that will be offered in another Loadstar game. When you click on Trials a maze of up to nine boxes appears on the left, some of them connected by bridges. In four o f the boxes there'll be color mismatched Gonzo the Chimp faces. Your job is to move the right halves of the faces from box to box until all four chimps are matched, color wise. The left halves do not move. Two right halves cannot occupy the same box at the same time. To move, click on a right Gonzo face and it starts flashing. Then click on adjacent box and if the face can move there, it will. If you change your mind after picking a chimp, clock on the flashing box and that chimp will be de-selected. Try to make matches in the fewest moves. New Trial will erase the current trail from memory and generate another random trial. The current set of trials can be overwritten, but I hope you will try those before overwriting. The Challenge. This is a special trial that never changes. Whenever you beat the best score in it you will get an opportunity to print it out for posterity. Sorry, the full contest has been over for a few *cough* years...decades.", "platform": "Commodore 64", "release_date": "1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Knees Calhoon", "publishers": "J & F Publishing, Inc.", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90644-calhoons-chimp-challenge\n"}