{"altername_name": [], "name": "Calhoon's Chicken Challenge", "overview": "An brain\\logic game created by Knees Calhoon and published in 1994's Loadstar #121. Not only is an egg a day is required from the 8 Loadstar Hens; Abigail, Beatrice, Clara, Dora, Eunice, Fiona, Gertrue and Hilda, but it is expected that Randy the Loadstart rooster will help out. We have them housed on the 94th floor of Loadstar Tower and they are arranged as a Star Hatchery as there are 10 pens laid out n the shape of a five-pointed star. As there are 10 pens and only eight pens, and a rooster, you'd think that there would never be a problem getting the chickens to get in a pen and lay. But these are not ordinary chickens. Oh no, these are Loadstar chickens, and are consequently quite contrary. When a Loadstar chicken is placed in an empty pen, she immediately flies in a straight line to one of the two pens that are two pens away. For instance, if a hen is placed in pen B it will try to fly to D or M. A hen placed in pen G will fly to I or A. It makes no difference if the pen in between is empty or if there is a chicken in it. To make your job a little easier, when you place a chicken in a pen, if both of its possible destination pens are empty, you can tell the hen which one to take. If you place a hen in pen C and both I and E are empty, you can make the hen go to the one you want. It sounds easy (really?), and there is a simple solution that works every time. However, my bet is that you will find yourself stuck before you get all nine chickens into their pens. Remember you MUST place a hen in an empty pen and there must be at least one empty pen for the chicken to fly info.", "platform": "Commodore 64", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Knees Calhoon", "publishers": "Softdisk Publishing, Inc.", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90252-calhoons-chicken-challenge\n"}