{"altername_name": ["Mandala Challenge"], "name": "Calhoon's Mandala Challenge", "overview": "A puzzle strategy game attributed to Knees Calhoon and published in the 1995 issue of Loadstar #131. A challenge from the mysterious East! Knees drove all the way to Jackson Mississippi for this inspiration. Oṃ maṇi padme hūṃ. Nom yoho ringay kyo. Now that I'v brought good fortune up on myself and my descendants for a thousand generations with those undoubtedly misspelled mantras, I feel safe in admitting that I don't know much about mandalas. I'm told it is a circular design used by adherents of Hinduism and Buddhism for meditation. This circular meditation includes a a board layout for this puzzle, a wheel of 8 circles with a central hub circle. In it are several games. Challenge is the layout from the original contest. Old Mandala is a tournament of sot which you can keep playing, trying to get a better score than before. New Mandala will start the current tournament. The top scoreboard shows your name an the amount of moves it is currently taking you. The bottom one shows the best score yet and the name of the player who achieved it. There is a different set of scores for Tournament and Challenge play. When you choose a game you will see the numbers from 1 to 8 positioned on the outer circles, your task is to move the numbers around to get them in the order shown in the story. Either 1 to 8 clockwise or counter-clockwise. One of them is nearly always impossible and the other is nearly always possible, depending on the starting semi-random layout. You move the numbers by pressing the key of the number you want to move, and it moves into the empty circle. Only numbers adjacent to the empty circle can move. The game will make this easier by highlighting them white. Do it in the fewest moves and try again if you like to beat your previous score! F3 to restart, F7 for main menu.", "platform": "Commodore 64", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Knees Calhoon", "publishers": "Softdisk Publishing, Inc.", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90257-calhoons-mandala-challenge\n"}