{"altername_name": [], "name": "Calhoon's Gordian Challenge", "overview": "A puzzle/strategy game whose developed is attributed to Knees Calhoon, it was published in Loadstar #132 in 1995. This knotty three-part puzzle is so tough that Knees DARES you to find a solution. Here's one that might frustrate you so much that you swear off challenges forever. Even Al Vekovius, Ph.D in math, says it looks like too much work for a sane person. And he should know! It's named after the legendary Gordiian Knot, a tangle of rope so convoluted and confusing that no one could untie it. Finally, Alexander the Great said to hell with it and sliced through it with his sword. If he were around today he'd probably unsnarl traffic jams with small nuclear devices. The idea for this challenge was taken from Douglas Hofstadter's book \"Metamagical Themas\", Basic Books, 1985. Pangrams and Self-Reference: A Pangram is simply a sentence that has all of the letters of the alphabet in it. The most famous is, \"The quick brown fox jumps over the lazy dog.\" There are lists of them, some amazingly short. A self-referential sentence is a sentence that refers back to itself in some way, such as, \"I am twenty-four letters long.\" A variation of the self-referential sentence was brought up: a self-documenting sentence. Jonahtan Post came up with this one: \"This sentence contains ten words, eighteen syllables and sixty-four letters.\" It is simple to confirm, but horrible to assemble, tweak one part and it reverberates around itself. Think about it and see if it doesn't vaguely resemble a Gordian Knot. Your job is to replace the questions marks in the next sentence, proposed by logician Raphael Robinson: In this sentence, the number of occurrences of 9 is ?, of 1 is ?, of 2 is ? of 3 is ?, of 4 is ?, of 5 is ? of 6 is ?, of 7 is ?, of 8 is ?, and of 9 is ?. You can use integers from 1 to 99 to make the sentence true. Other parts of the challenge are variations on this theme. Have fun and exercise your brain!", "platform": "Commodore 64", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Knees Calhoon", "publishers": "Softdisk Publishing, Inc.", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90255-calhoons-gordian-challenge\n"}