{"altername_name": [], "name": "Captain Blood", "overview": "The objective of the game is to track down and disintegrate five clones (referred to as Duplicates or Numbers depending on the version of the game) of Captain Blood. To find them, the player must speak to various aliens and gain their trust. Communication with aliens occurs via an icon-based interface known as UPCOM. This consists of around 150 icons, each representing a different concept. As each alien race discovered speaks its own language and reacts differently, the player must learn to negotiate using these UPCOM concepts in a style that suits the races. Other unique facets of the game play of Captain Blood included changes in the player interface as the game progressed; as time wore on, the character's health deteriorated. This was represented in-game via an increasing amount of shaking of the mouse cursor, making the game more and more difficult to control. Disintegrating a clone would temporarily relieve the symptoms. The player starts the game at the bridge of a biological ship, the Ark. The ship begins in the vicinity of one of four predetermined planets, each inhabited by a single alien. To make contact with an alien, the player launches an OORXX - a biological probe - to the planet's surface. The player must successfully navigate the probe over a fractal landscape, eventually reaching the alien at the end of a valley. The UPCOM interface then appears so that the player may talk to the alien and find out more information—most importantly, the coordinates of other inhabited planets. The Ark also has the capability to hyperspace to other planets, scan planets for defences, destroy planets and teleport aliens to an area known as the Fridgitorium, for disintegration or transportation to another planet. An alien can only be teleported to the Ark after it has consented to do so.", "platform": "Commodore 64", "release_date": "January 1, 1988", "game_type": "Released", "esrb": "Not Rated", "developers": "ERE Informatique", "publishers": "Infogrames", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.50", "wikipedia": "https://en.wikipedia.org/wiki/Captain_Blood_(video_game)", "video_link": "https://www.youtube.com/watch?v=mePwnvJWdJI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27305-captain-blood\n"}