{"altername_name": [], "name": "Captain Cloudberry Episode IV: Helium", "overview": "A flying Collect-em-up game that was published as part of \"Single Button Games\" collection. For more than 13 years, citizens of DOUGAL CITY have suffered terrible weather and heavy rainstorms. It turns out that an evil witch, SABA MONTHBLEED, has peppered the sky with radioactive weather balloons! This has given her complete control of the atmosphere, keeping the villagers trapped in her meteorological terror. The citizens has tried to destroy the balloons, but the witch has thrown a spell on the clouds, freezing the clouds to stone hard ice, making it impossible for them to get to balloons and destroy them... The desperate villagers contact a local stunt pilot CAPTAIN CLOUDBERRY and begs for his help as he is the only man capable of maneuvering around the frozen clouds. The famous Ace agrees to restore natural order, but he has one little problem: A few days ago, there was an incident. While on stunt practice, he had a close call with a hang-gliding desperado. This flyboy maniac attacked the rudder, leaving it damaged. Now, Cloudberry's plane can only turn one way! AIM OF THE GAME - Fly the plane and ram all the balloons. - Pop the blinking balloons in the correct order for bonus points. - Avoid the frozen and lethal clouds. - Your plane can only turn one way, but thunderclouds may be helpful - lightning is known to cause a change of direction! - The evil witch will attempt to thwart you by respawning balloons! - There are unlimited planes, but limited fuel. - When the fuel tank is empty, Captain Cloudberry is grounded. Grounded... FOREVER!", "platform": "Commodore 64", "release_date": "2017", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Eric Hilaire", "publishers": "Komoda & Amiga Plus", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122913-captain-cloudberry-episode-iv-helium\n"}