{"altername_name": [], "name": "Carvalho: Los Pájaros de Bangkok", "overview": "The story begins on any day and in a city that is not appropriate to name, when the detective -in this case you- Pepe Carvalho receives from Bangkok a mysterious call from an old friend, Teresa Marsé, who very scared requires your help: - \"It's a miracle I can call you, I'm in a hurry, they want to kill us, Pepe ...\" - Kill yourself? To who? To the whole expedition? The white race? The Catalans? - Archit and me. - Who is Archit? - \"It's too long to tell and I'm not sure here, it's my companion, they're chasing us, Pepe, I'm serious, do something, come on, Pepe!\" With just this information and suffering all kinds of hardships , you meet her family (her son, a waiter, her husband, a dog-sitter, and her father, an old, stingy, millionaire who wants nothing to do with her) at the travel agency that took her to Bangkok, where her guide She informs everyone of what happened: \"In Bangkok, Teresa meets a young native -Archit- who falls in love, but he turns out to be a diamond dealer.\" Teresa can not think of anything else to convince him to steal diamonds from her. boss, Jungle Kid, but his son discovers them, and Archit has no choice but to kill him ... Now the whole Thai mafia is chasing them, and it will be difficult for them to escape ... \"With all this, nobody seems to want to go looking Teresa or hire someone for the trip. You get to convince your father that something has to be done, and he chooses you as a forced volunteer after haggling the price of the trip with the owner of the agency. It also refuses to give you more than 200,000 baths for the trip ... ... After a long plane ride you arrive in Bangkok, and you do not know where to start looking. You only know that you have to go to the Spanish embassy in Bangkok, where the ambassador will explain your mission more thoroughly.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Fabián Escalante", "publishers": "Dinamic Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110162-carvalho-los-pajaros-de-bangkok\n"}