{"altername_name": [], "name": "Castle Northstar", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". The sword Deathtouch was alive. It sensed the darkness and the coolness of the stone. It was self-aware and in that awareness lay a sense of duty. The sword Deathtouch was Chaos incarnate. True to its name, no living creature could survive after being dealt a wound from its edge or point. The sword Deathtouch was a prisoner in the Realm of the Dead, a fitting place for it. For what death could it deal to those beyond life? What torture could it inflict on those tortured beyond the grave? The sword Deathtouch had not tasted warm blood for a long time. Butwarm bloods were crossing the river. Soon the blade of Chaos would be among the living, and many would die. The Priests of the Snake were nervous, as they had cause to be in this creepy sub-dungeon of Castle Northstar. And the High Priest, though outwardly confident, quivered in his robes at the misty waters of the river Styx. This was a spellbound place, the only place in the kingdom where the living joined the dead. The ferryman was Death' s minion; and the Ruler of the Dead was a shade of evil-a shadow of Alabastria, the Black Kingdom beyond the doors of Star gate. He held the keys to unlocking the Demons of Chaos and, by the tongue of the Snake, those keys would ride the ferry in the pocket of a red cloak. The girl was Human. She was too young to have reason for fright. The tall Priest spoke kindly to her and allowed no one near her but the two young guards. They never spoke at all. The Pries t had given her a bracelet and promised her another if she was good. She missed her father but she did not cry. She'd seen many wonders on her journey and had not had time to think of her family. She couldn't see much here because of the fog. She could hear strange sounds though, moaning in pain, softly whispering in agony through the mist. She was now a little frightened and moved closer to the High Priest, her protector. She wanted to cry but she could not. She could feel the tears within her but she could not cry. So the mist and the unseen voices cried for her, as though they knew her fate. The ferry cut through the dark water and through the hovering mist, bumped into the shore and grounded. The Priests and the girl disembarked and moved away from the shore. The ferry backed away and turned into the mists, the single oar of the ferryman rippling the water very slightly. The ferry moved across the river as if its pilot could see through the mists. Maybe he could. It stopped on the opposite shore and awaited its next passenger. The sword Deathtouch could sense the approaching Priests, warm bloods all. A deal had been struck that would return it to the upper world. Soon it would drink deep draughts and Law would be no more. The Master of the Dead would have the girl. She would serve him and remind him of beauty in a realm of zombies and shades. Beauty was his weakness, his perversion. It had cost him his Alabastrian citizenship. He'd been expelled for being less than perfectly evil. But he'd have the girl. She would comfort him with her presence, yet torture him at the same time. For he could not touch her and she could not lay eyes on him. Even in the Land of the Dead, Law protects innocence. He did not wish a confrontation with the Law. In such a case even Deathtouch would not protect him. Besides, that sword was going into sunlight. A fine trade, was it not? In the upper reaches of Northstar, a hero began his descent. He was canny and bold. But Northstar was a harsh obstacle, its traps cruel and deadly. The vermin of the upper levels hungered for the remains of the would-be heroes. Above Northstar, the sky was as blue as ever, shading the valley lake and contrasting the greens, greys and snowcap whites of the surrounding countryside. A hawk soared, a drama played, a hero strove, a menace rose and in the end five Priests were slain and Deathtouch drank hero's blood. The Master of the Dead was safe, the sword was lost in the life-side of the dungeon and the world was no different for life, death or trying. The girl is there still: never ageing, never crying, never knowing sky or flower. She awaits her rescuer and the sword Deathtouch awaits him also.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126559-castle-northstar\n"}