{"altername_name": [], "name": "Cell Mates", "overview": "Created by William K. Balthrop and published in Home Computer Magazine Vol.5, No.6, the game asks the question, how complex is a living cell? Is it a static structure— or a dynamic system? How do symbiotic organisms make all cellular life possible? Find some answers with this fascinating bio-simulation. There is more going on inside a living cell than meets the eye. Even the most powerful microscopes have not yet revealed the entire story— the secret life of the cell. Ask most people what they know about this basic life unit, and their reply, if any, may invoke a static picture of the cell and its interior: the cell wall, the nucleus, and \"a bunch of little floaty things.\" But when biologists look closer at these little floaty things, they see participants in an incredibly complex, wonderfully cooperative, and dynamic ecosystem; for the metabolism of a living cell involves some strange and alien participants who apparently learned to live together millions of years ago. Directing this metabolic dance, communicating with each cell part through encoded molecules, is the nucleus. Some of the participants— called organelles— possess their own DNA (deoxyribonucleic acid) and reproduce themselves independently from the nucleus. Together, they are all Cell Mates. The program presents the actual playing screen. This screen contains a graphics representation of the cell (in the upper-left corner), and 12 indicators that show the status of the various processes in the cell. You can gauge your progress by viewing these indicators. Some of the indicators contain areas highlighted against the background color. To maintain and eventually reproduce the cell, you must manipulate the cell's life processes so that the pointers remain in these \"safe\" areas. Indicators that contain no distinguished area show the actual level of energy going to specific activities.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "William K. Balthrop", "publishers": "Emerald Valley Publishing", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90450-cell-mates\n"}