{"altername_name": [], "name": "Ciuffy", "overview": "An early Cute-em'up vertically scrolling shooter created by Emiliano Sciarra. He writes about the game: Back in 1986, I designed several videogames on paper, without actually programming them -- I was only 14 then and I knew BASIC only. One of them was a scrolling shoot'em up starring a cute little dog (dubbed \"Ciuffy\" after one of my sister's most beloved peluche) escaping from the city whose inhabitants ruled against animals. His main weapon were his barks (or, as we say in Italy, \"BAU\"), while his enemies were all sorts of citizens either on foot or on cars, motorbikes, automatic dog-catchers, farm tractors, roadrollers etc. The more fierce the opponent, the more BAUs were required to send him off. Two years later, I got SEUCK and was immediately fascinated by this impressive software. After just days I was, rather unexpectedly, working on \"Ciuffy\", whose design was almost perfect for such a construction kit. I worked alone, as many programmers then: I did all in the game, from the graphics to the sound effect -- and while I am quite proud of the \"BAU\" sound, the fact I was not a graphic artist shows in several rough and sketchy parts. I put all together very quickly, and after about two weeks the game was ready. The game was intended just to get in touch with the basic SEUCK routines (that is why some details are not very refined), but the final result was quite good and entertaining, so I tried to send it to one of the publishing company in Italy accepting games from independent programmers: Systems Editoriale, which at the same time was printing the notorious (in Italy) \"Commodore Computer Club\" magazine. Very unexpectedly, the magazine director liked the game and decided to release it in one of their monthly cassette-only periodical, \"Software Club\", as the opening game, the very same year.", "platform": "Commodore 64", "release_date": "March 10, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Emiliano Sciarra", "publishers": "Systems Editoriale", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=G08hTLFErqQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153477-ciuffy\n"}