{"altername_name": [], "name": "Cliffhanger", "overview": "After several grueling months in the jungle you finally reach your destination: the cliffs of Mount Gemstone. At the top of the mountain are large rubies and diamonds worth a fortune. Getting the precious stones will not be easy. Over the centuries deep crevices have formed in the mountain, making it extremely difficult to scale the cliffs. Crocodiles roam the fiat areas, always in search of a meal . As if these weren't enough to worry about, strange winged creatures called Hooties hover around the mountain, ready to knock you off a ledge. Cliffiianger is a game for the C-64 which pits your skills against those of a swarm of Hooties. Using a joystick in Port 2, it is your goal to reach the diamond at the peak of the mountain. You may move your man north, south, east, or west. Your first concern is to stay on the mountain. Falling off will cost you one of the four lives that you begin the game with. Running into one of the crocodiles will also cost you a life. If you reach the diamond you will receive the points remaining on the bonus clock which counts down from 500. If the clock reaches zero, you lose a life. The mountain and crocodiles are dangerous, but the main threat to your mission is the Hooties. There are four of them flying around, the most dangerous of them being the light green Hootie. This creature has you homed in from the start and he moves at a different speed on each level, making him very unpredictable. All Hooties possess keen eyesight and all are capable of knocking you off a cliff with a flap of their wings. Published in Ahoy! 1987/12 (Issue #48).", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "James C. Hilty", "publishers": "Ion International, Inc.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bz_SAaE561o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90777-cliffhanger\n"}