{"altername_name": ["Congo Bongo 1985"], "name": "Congo Bongo (Version 2)", "overview": "In 1983 the game was released for the first time. That version had simpler graphics and only two levels of the arcade game (Level 1 (v.1) = Level 1 (v.2), Level 2 (v.1) = Level 4 (v.2). The game principle of the two comparable levels has approx. stayed the same. Congo Bongo is an arcade platform game similar in many ways to Donkey Kong, but with an isometric perspective. The player takes control of a safari hunter who is searching for an ape named Bongo, determined to punish him for setting the hunter's tent on fire. The game consists of four one-screen stages, each with an objective to jump on platforms and reach the top. Level 1: Primate Peak In the first level you climb a steep rock wall, cross torrential rivers and fight with a horde of monkeys gone wild, which try to push you from the cliff. At the very top sits \"Congo Bongo\", obviously a mean relative of \"Donkey Kong\". It also throws things down on you. But this time no barrels, but coconuts that do not hurt any less. When you have reached the summit of the hill, the game continues with the second level. Level 2: Snake Lake At the famous \"Snake Lake\" you fight your way from island (platform) to island, between aggressive scorpions and hungry snakes. The latter start the chase over the narrow paths with which the islands are connected as soon as you have entered one of them. If you have managed to avoid them successfully you can rescue yourself by jumping onto the back of a hippo to get to the other side. But beware! The hippo will dip its head under water in irregular intervals, so always stand on its back. Then you go on to level 3. Level 3: Rhino Ridge Here you should avoid the deadly puddles and go out of the attacking rhino’s paths. Either you jump over them or hide from them in one of the holes. But you should not spend too much time in them, because a mole-like creature appears in certain intervals randomly in a hole and fills it up. And if you are in this hole at that moment, this will cost you a life. When you have made it to pass the rhino herd, you climb on the hill where Congo is. Moving on to Level 4. Level 4: Lazy Lagoon In this level, heavily inspired by Frogger our gorilla hunter fights on the back of swimming lily leaves, hippos and piranhas his way through the lagoon. Hardly have you arrived at the other side of the dangerous river, you will be pestered by a rhino gone wild. When you have sneaked past it, you only have to climb the small rock ledge and you have defeated the insidious gorilla. After a short loading time, the game starts again at level 1 with the next higher difficulty grade.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Beck-Tech", "publishers": "Sega Enterprises", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.11", "wikipedia": "https://en.wikipedia.org/wiki/Congo_Bongo", "video_link": "https://www.youtube.com/watch?v=rKd-bBvYmWs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6430-congo-bongo-version-2\n"}