{"altername_name": [], "name": "Conquest for the Crown", "overview": "A war strategy game published in Magic Disk 64 1988/12. A great strategy game for anyone who has had a lot of fun with games like this in the past. As is often the case with good games, the game is in English, which some of you may not be particularly enthusiastic about. But since the texts are limited and it is not a text adventure, you quickly got used to the game and the English is no longer important. To make it easier to understand, here are the brief instructions:: It is a battle simulation in which the aim is to conquer a continent that has so far been made up of many small provinces. Up to eight players can play against each other. Everyone has his army and is trying to conquer the whole continent by invading the other provinces. In addition, there are troop remnants from the former king of the continent, which can be either friendly or hostile to the other player. But first you have to create your own continent. To do this, you connect individual hexagons on the playing field with the 'cursor', a sword. Of course, it is also possible to delegate this task to the computer. A continent must consist of at least 10 provinces. Now it is the turn of the royal troops to be recruited. These, as mentioned, can be friendly, which means they'll join you and add to your troop numbers. But you can also choose to have the royal troops hostile and defend themselves against you. In addition, this condition can be increased by making them more aggressive. Then they invade the provinces you have already occupied. If you don't have enough enemies yet, you can also call a brother of the king onto the field, who is on a crusade at the start of the game, but who comes later to stand by the royal troops. Then you can move your own troops to another province and finally recruit new soldiers. However, each new soldier costs 1 gold piece. For 20 gold pieces you can also build towers to improve the defense situation. In order to collect more taxes it is also possible to build new villages. However, that costs four gold pieces at first. After each round it is the turn of the royal troops, the King 's Men. They behave as you have determined beforehand.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Imperator Software", "publishers": "CP Verlag", "genres": "Strategy", "max_players": "8", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91177-conquest-for-the-crown\n"}