{"altername_name": [], "name": "Construction Co.", "overview": "It's a nice summer day and you decide that a backyard barbecue would be just the thing to put the family in a good mood. Later, while the hot dogs and hamburgers are slowly cooking, you have a chat with your neighbor, the real estate broker. While he's mowing his lawn he tells you about some property he has that he wants to build on. If he could just find a contractor he could trust he would be able to put up some houses and sell them to his customers at a nice profit. \"You wouldn't know a good contractor?\" he asks. You think quickly. You've been out of work since March, when the butter churn factory closed, and are getting low on cash. You then tell your neighbor that you would be glad to build those houses for him if you can agree on a fair price. He offers you $50,000 for every house you can build and you meet in his office the next day to sign the papers. Contract in hand, your next stop is the bank where you take a $35,000 loan at 12% interest with your own home as security. Unfortunately, the loan is only for 30 days, but you think you can have the first house finished and sold by that time. Now the only problem is the fact that the only house you ever built was a birdhouse, and even the birds won't touch it. Then you realize that you don't have to do the actual work yourself if you just hire experienced laborers. Offering $70 a day, you make the rounds of the local bars looking for anyone who knows which end of a nail you +hit with a hammer. Soon you have enough people to build a small city. You explain what you're building and give a rousing speech (aided by several stiff shots and a couple dozen beers) and tell everyone to show up for work in the morning. The next morning when you get to the job site you find about 50 people waiting to work. You quickly come to the conclusion that you can only keep an eye on a maximum of 9 at a time. You tell the rest to come back tomorrow, promising to hire new people every day. Taking your truck, you head to the local building supply to get your materials. Not knowing how much of anything to buy you consult the plans for the house, but all you can understand is that you'll need about 25 windows, 20 doors, and a garage door for each house. After buying what you hope will be enough materials you chillingly remember that you told your workers that if at any time they ran out of materials they would be paid for the full day and sent home. With thoughts of living in a cave for the next 20 years you head for the job and (you hope) success. Since you can only hire one type of worker at a time (i.e., carpenters), when one type of job is finished everyone goes home for the day. If you are fortunate enough to pay off your loan on time, you will be given the chance to borrow more money. Keep in mind that all loans are for 30 days only. Published in Ahoy! 1984/12 (Issue #12).", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "B.W. Behling", "publishers": "Ion International, Inc.", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91179-construction-co\n"}