{"altername_name": [], "name": "Cruiser-X 79", "overview": "It is the year 2072. A giant asteroid was heading towards planet earth. During that event, a special rescue operation was taking place. The Interspace Legion has transported good people to the neighboring planet “Mars”. People were able to live there as a temporary settlement until a new suitable planet was found. The remaining people, the bad people, were all left to perish back on Earth. They were being punished for the crimes they committed towards humanity, the environment and animal cruelty. After the asteroid impact, Earth was now deemed to be uninhabitable. Inside a Space Lab down on Mars, Scientists made an amazing discovery, a brand-new green and blue planet. Intrigued to find out more about the planet, the scientists sent out a drone. It was discovered that the planet contained oxygen, gas and water and was a perfect match for humanity to evolve even further. The planet was named EarthX (Earth 10) The Interspace Legion trained many pilots and sent them to transport people from “Mars” to “EarthX” (Earth 10) via Cruiser-X starships. The special operation was becoming successful. That was, until the ships were on their way back to Mars. Fleets of alien bases mysteriously appeared, and then shot the Interspace Legion’s Cruiser-X ships down. Nobody survived, except for you, the pilot of Cruiser-X 79. Instead, you get pulled into a prison base, where your ship was captured with you inside it. You attempt to hack into the alien base using the supercomputer on board your starship. It releases the cargo bay doors, and you fly for freedom. - That was until the aliens spotted you. Now they are out to stop you. Not only do you have an escape mission. You also have a big battle for survival in your hands.", "platform": "Commodore 64", "release_date": "December 24, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Richard Bayliss", "publishers": "itch.io", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160297-cruiser-x-79\n"}