{"altername_name": [], "name": "Crypt of Fear", "overview": "Following your epic adventure in the Vault of Terror, the kingdom of Sarnoth was returned to normalcy, as near as anyone could tell. You were rewarded by the king with a cottage over- looking the sea and a handsome pension for life, the remainder of which you planned to spend in retirement. Your macabre battle against the Naga, the ancient race of evil serpents which had captured the castle, somehow wearied and fatigued your soul , leaving you a tired knight-at-arms who felt there were no great challenges left in life. You hung your enchanted sword over the fireplace mantle and left your armor to rust in the barn. Although you often jousted with neighbors for amusement, your body lost its muscle tone and became that of an ordinary laborer, robbing you of your identity as a knight. While you rested, the world around you changed, too. Many of the old dragons were reported to have died. A wizard or sorcerer became a rare occurrence in the realm, and those that remained could perform nothing but parlor tricks. The beasts that had once blocked frequently travelled roads had retreated into the high country, ending the need for knights to escort royalty through the woodlands. An old fisherman summed it up one night for you as you sat with him at dinner in the tavern, his hoary beard catching glints of firelight. \"It's the magic, boy.. .it's drying up. The world has no room left for monsters and enchantment, mighty heroes and warriors. The old earth is fading away, giving up its secrets to these new men of science, with their abacus and alchemy, many numbers and ideas. The day for your kind has passed on.\" And you knew then that he spoke the truth. Many months passed in your lonely cottage before the night your door swung open, and in from the blustering cold night walked the king, accompanied by the royal guards. While his men warmed their hands at your fireplace, the two of you sat together in the far corner, \"I know it's a lot to ask of you, son. But once again, I need your help,\" he said, his voice trembling as his fingers ran over the gold crown on the oak table before him. \"I don't know if you've heard the stories about a horrid demon that still dwells on the tar side of Shadowthorn Mountain, deep inside a crypt built by a race long dead. There have been rumors, a few extravagant tales, but I ignored them. Superstitious villagers, I presumed. I know now that I should've looked into the matter further. \"According to the legends, this demon requires a new bride every hundred years, preferably a young virgin. He took his bride last night from the kingdom. Her screams were heard over the village as She was snatched from her bed by a great winged abomination and flown I over die mountain in its claws.\" Your brow knotted with apprehension. \"Who was it?\" you asked the old ruler. \"It was my daughter, the princess!\" he sobbed brokenly, burying his head in his hands. You strode toward the fireplace and pulled your sword from the wall. My editor was firm on one point. He would be willing to publish a sequel to Vault of Terror, my 3-D adventure from the October '86 issue of Ahoy!, only on one condition: no more 100 block gargantuan listings. The sequel would have to require fewer than seven pages of copying in order to see print. He insisted that nobody but escaped patients from hospitals for mentally disturbed speed-typists ever wanted to copy in my agonizingly long games. I squeezed, I crammed, I wedged. And here it is. A page- flipping, real-time adventure game in three dimensions. If you liked Vault of Terror, you'll be pleased to discover that Crypt of Fear is to the Vault what the motion picture Aliens was to Alien. Incredibly, it's not only significantly shorter, but it actually has more sprite shapes, better graphics, better music and sound effects, faster animation, and a drastically improved game scenario. If you ever copy in a program from this magazine, copy in Crypt of Fear. It's the best 58 blocks you'll ever put on a disk, and the sort of thing you'll only find in Ahoy! Although other 3-D dungeon adventures are available commercially, you'll realize that few of them are this much fun. The game is straightforward and simple. Find the princess inside the crypt and guide her to the exit. Fight off the hordes of slithering nasties that try to use your head for a scrub pad. Collect the sword, shield, wand, ring, crypt map, the princess's brooch, and the chalice along the way. Kill the Demigorgon, the winged villain who inhabits the crypt. ...and do all this before the foul air inside the underground labyrinth uses up your lantern fuel and your lite. Easy, right? Published in Ahoy! 1988/02 (Issue #50).", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Cleveland M. Blakemore", "publishers": "Ion International, Inc.", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95177-crypt-of-fear\n"}