{"altername_name": [], "name": "Cunning Running", "overview": "Cunning Running is one of a suite of computer programs that have been written to complement Moving Into Maps, the pre-atlas book in the Jacaranda Atlas Programme. Designed for use by students from 7 to 13 years of age, Cunning Running provides an extension activity for the \"What's It Say?\" section of Moving Into Maps. It also reinforces the concepts learnt in the \"Lost and Found\" and \"Where Is It?\" sections. However, as the computer program is entirely self- contained and self-explanatory, it will be useful in any classroom where basic map concepts are being taught. Cunning Running is a computer simulation for up to four players that provides an opportunity for students to practice the basic map skills of reading and understanding map language, understanding compass directions, and using alphanumeric grid-square references. The computer screen displays a plan view of a section of countryside. The plan depicts areas of open ground, swamp, forest. etc., including tracks, bridges and a river, and has an alphanumeric grid superimposed on it. Each player must move a small figure around the plan to recover markers in an orienteering course. Students must plot a fast and efficient course around the countryside. To do this, they must understand the map language used, and remember and take account of movement restrictions. The game will finish when every player has recovered at least four markers. Each student's objective is to recover as many markers in as few moves as possible during the game. Players tend to discuss their choices of routes, and so the program also encourages discussion and the development of planning skills.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Ian Treacy", "publishers": "Jacaranda Wiley Pty. Ltd.", "genres": "Strategy", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95363-cunning-running\n"}