{"altername_name": [], "name": "Cut-In", "overview": "Published in Magic Disk 64 1991/04. After a space shuttle glides across the screen right at the start of the game - more precisely, while it is loading - it should be clear what kind of game it is: a space adventure, and a rather action-packed one. As with most other games in this genre, at CUT IN you dash through the galaxies in a fast space car to bring fame and glory, i.e. highscore, to your home get-together. The environment is as usual: you fly from left to right and the background scrolls past you from right to left. In this game, it consists of futuristic halls, containers, tanks, etc., which probably belong to a huge spaceship complex. Unfortunately, the spaceship has no turning ability, so the direction of flight is clearly predetermined. Every few seconds you are attacked by soap bubble-like structures, which firstly always appear in packs and secondly rob you of valuable energy when touched; at the start of the game you have 99 energy cells. These will be destroyed depending on the intensity of the enemy touch. The only antidotes are avoiding or shooting down the slimy bullets. For a \"game to abreact\" (original sound), your spaceship has frustratingly little firepower; the shot frequency is somewhat low. You also face danger from the spaceship itself. As soon as the speedster touches parts of the facility or superstructure, the important energy cells are destroyed as well as in the event of enemy contact. Unfortunately, touching the spaceship usually takes longer than you would like. But be comforted: You only lose energy until you are dead! The real highlight of the program, however, is the control of your vehicle. A little clumsy at first glance, it quite simulates the weightlessness of space in a very convincing way, because the space car doesn't turn in the desired direction when the joystick is counter-steered. The exact control needs to be mastered! After each more or less successful game round you get the opportunity to register yourself in the highscore list.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Axel Teichmann", "publishers": "CP Verlag", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=aZotdgPcEdM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95392-cut-in\n"}