{"altername_name": ["Lunar", "Roofus"], "name": "Cyclon Zap: Space Bomb", "overview": "This originally went by the title of Omicron -- until Compute!'s Gazette published the code of an identically named program that was actually an Omega Race rip-off. This one isn't. It looks beautiful, first of all. Your cannon slides along the ground, Space Invaders-style, and it's drawn in exquisite detail. It looks like one of the smaller Death Star gun towers. A row of five aliens zooms by overhead, roller-coastering in tricky patterns. If you only shoot, say, three or four before the group careens off-screen, it comes back, the missing aliens having been replaced with little Outlines of the Dead (as I call them). If you clear out the whole group, you get a new one. The aliens are drawn impeccably, and the backdrop is this painting-quality moonscape with vivid colors that jump right out at you. The speed and smoothness of the attacks and player control are uncanny. This guy really knew his game design. None of the player's lightning-fast shots ever go through aliens due to collision-detection errors; there's no break in the fluidity. It's still only a shoot-'em-upward game, but it might well be the best I've played on any 8-bit computer. You can choose your speed, and the fastest is really fast. You can't master this game easily, but it's easy to learn. Published with the Italian publication Go Games n.2 (October 1985). Also released in North America by Keypunch Software under the name Cyclon Zap: Space War in 1987, as part of their Star Fighter game pack.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Jim Roof", "publishers": "Keypunch Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.edicola8bit.com/riviste/go_games/c64/preview/lunar.webm", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95455-cyclon-zap-space-bomb\n"}