{"altername_name": [], "name": "Cygnus", "overview": "In Cygnus you have to find in each level 10 Magic Pots then try to reach the exit before the time limit has ended. Published in Magic Disk 64 1991/05. The idea of the game is to use a ball to collect ten pots that are in a kind of cave. The ball is of course controlled with the joystick - if you press it to the right, it rolls in the desired direction, it works the same with the left; if you push the joystick forward, the ball bounces. This is important because the cave is not flat and level, but rather rugged and impassable. The screen shows the section of the cave that you are currently in. The pots are on different levels, on which the player has to hop with his ball. If he succeeds, he can take the pot there with him if necessary. But if he jumps next to it and the ball falls into the depths, one of the five (ball) lives that he has at the beginning is withdrawn from him. But do not worry, with small heights you do not have to give the spoon (the ball) in a humane way, it only becomes critical at great heights. Dangerously there are villainous villain balls on the large plateaus, who also try to kill your ball. It's best to just jump over them. Lanterns also bring some light into the dark cave from time to time, but they are more likely to be added to the decorative accessories. From some plateaus, arrow-like \"ray bands\" go up or down. These are elevators that safely transport you in the desired direction. In order not to make the level gain too easy, the programmer Fabian Libeau has set a time limit within which the pots must be collected and the saving exit of the level must be found. This limit is exactly six minutes. With every second that has passed, your score increases by one, with every pot you get awarded one hundred points.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Fabian Libeau", "publishers": "CP Verlag", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5ZbZFtOzn94", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95467-cygnus\n"}