{"altername_name": [], "name": "Cylogic", "overview": "A brain\\puzzle game by Hakan Akbiyik and published in Magic Disk 64 1991/04, Game On GE 1993/2, Abo Disk #3. In the game you need to recreate the scene found in the right pane in yours. Get them in the correct order of will need to do it again. Cylogic is an immensely captivating game of skill and puzzles in which, in addition to a steady hand, a quick talent for combination is required. Cylogic is divided into two separate, completely independent play areas, which are appropriately titled Game 1 and Game 2 and which I will introduce one after the other in the following. Incidentally, both areas can be conveniently selected using a joystick. So let's start with Game 1. At first glance, there are certain parallels to the arcade hit \"Tetris\". As with Tetris, the screen in Cylogic is split into two parts and you have to move the pieces that fall down from the top of the screen to the correct place. With Cylogic, however, the player does not have to compete against a teammate or an imaginary computer opponent, but instead has to recreate a predefined arrangement of stones. More on that now. As already mentioned, the screen is divided vertically into two halves - with the right half showing the stone arrangement to be reproduced, which must then be reproduced in great detail on the left half of the screen. The difficulty now is to put the stones, which are meanwhile falling fairly quickly, into their place before they hit anywhere else. If that happens, one of five lives is withdrawn from the player. The stones do not necessarily have to hit the ground - it is sufficient to let them land on some horizontal surface (ledge, etc.). As expected, the stones are controlled by a joystick. As soon as the player has completed the stone arrangement, the next level is reloaded in no time at all. So much for the NORMAL level - at the EXTRA level, the player can open up the number pieces that are falling in the usual manner according to a pattern that is again given on the right-hand side of the screen. The control, which reacts extremely sensitively to joystick movements, is particularly noticeable here. In order not to die the quick screen death, the control of the stones has to be very precise and calm - but here, too, practice makes perfect. In the case of particularly shaky contemporaries, in the long run, a certain degree of disgust with playing is likely to set in; however, they can also be helped. The programmer Hakan Akbijik has given the game an editor mode.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Hakan Akbiyik", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=VRoGgOrkTmI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95468-cylogic\n"}