{"altername_name": ["Daffy Duck"], "name": "Daffy Duck Starring in The Great Paint Caper", "overview": "“Daffy Duck – And The Great Paint Caper” was to be one of Hi-tec’s first new Premier Range titles, making great use of a recent licence agreement with Warner Bros. As a result, the title was to be bigger and better than previous Hi-tec titles – resulting with Daffy being a large multi-load based title. In development for almost 12 months across platforms such as the Spectrum, Amstrad, Amiga, ST, PC and finally C64 – there was very little actually mentioned about the game in the press. The Spectrum scene seemed to know the most, with magazines having news snippets and a preview in Crash magazine. The C64 scene was surprised with a review of the title out of nowhere in the August 1992 issue of Zzap 64. The game wowed the Zzap team, and the game scored the highest ever rating ever for a Hi-tec game, with a grade of 94% overall (Phil King himself gave the game 95%) – making the game very desirable for many readers at that time who were still with the C64. Featuring awesome graphics, including a incredible Daffy sprite, various different levels and other Warner Bros characters.. the game remained faithful to the cartoon in many ways. The game played extremely well, solving various puzzles and collecting objects, the only fault was the music not fitting in with the game (Even though Gerard did a great job anyway according to the Zzap crew.). When nothing appeared on the shelves, news later filtered through that Hi-Tec was no more – and Daffy didn’t quite make it to the mastering stage to sneak out (with only Turbo the Tortoise managing that feat). Rumour had it that WH Smith received 250 copies before Hi-Tec folded, all of which sold – giving speculation that the game was out there somewhere in original form. David Palmer however confirmed that it never got to the mastering stage. Although Turbo got picked up by Codemasters, the licence costs for other Hi-Tec titles were too much to bear, and so Daffy Duck was never to be seen on any of the promised platforms and slipped into legendary unreleased game status.", "platform": "Commodore 64", "release_date": "1992", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Hi-Tec Software", "publishers": "Unreleased Prototype", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=0dTV5IQJzJE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163664-daffy-duck-starring-in-the-great-paint-caper\n"}