{"altername_name": [], "name": "Dammen 64", "overview": "Checkers is a board game . The board consists of 100 squares, called fields, in 10 rows of 10, the fields alternating between white and black. They play with checkers. These are round discs (usually made of wood ). 20 white and 20 black checkers are used for the game. The origin of dams is the board game Alquerque . The oldest archaeologists have found - that looks like dams - is a mud board divided into 5,000-year-old windows. The game was played with cone-shaped stones. There is disagreement as to whether this game may be called the first drafts game. One theory is that the queen of the French medieval chess game gave her name to the game, namely \"fierges\". Later the queen was called \"lady\" and the game was called \"jeu de dame\". In Dutch it became checkers and in German \"Damespiel\". Various experts combat this theory, among other things because it is incorrect etymologically . The English checkers (also called Checkers ) originated in the 12th century. They used the Backgammon bricks, the board with 64 spaces as the playing field and the way Alquerque played, an Egyptian game. The original checkerboard has 64 fields (nowadays also called the small board ). A much used story is that in 1723, a Pole from Paris devised drafts on a board of 100 fields. This is called the Polish checkers and is the checkers we play, nowadays usually referred to as international checkers. Historically this story is demonstrably incorrect. The Westfries Museum in Hoorn has a 100-field checkerboard dating from 1696. The story goes that Napoleon Bonaparte and his soldiers thought it was a great game and took them on their campaigns. Polish dams, also known as draughts, became an internationally known drafts game. In the Netherlands, the international or Polish checkerboard variant with 100 pitches is played in competitions. On the board with one hundred fields, there is Frisian Checkers in the Netherlands, which may also be hit horizontally and vertically.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Softpak", "publishers": "Softpak", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116614-dammen-64\n"}