{"altername_name": [], "name": "Darkwood II: The Gryphon's Pearl", "overview": "These are the words of Lo'ana, the Deedspeaker, a precious telling of the events leading to the Queen's arrival: Once, in a time before any living man remembers, a King, strong of spirit but weak of body, died without an heir. Most people thought this was the end of the Darkwoodrealm, but a prophet, called Antetime, the One Always Here, spake of a woman that would come from a world away and lead Darkwood from ruin. Many years passed waiting for the woman, and the realm-dwellers began to doubt the prophesy. Foolish men! For she came, assisted by an experience-young cleric. Many questioned the necessity of the cleric, but the Queen, called Yannah by the realm-dwellers but Didi to those she was fond of, would hear no doubts. The cleric had saved her life, she said, and had always been a loyal friend. She would not abandon the cleric now. Nor did she, for the cleric proved wise and well able to rule the realm in the company of the Queen, banishing all question of necessity. All was well. Together, they lead Darkwood to rebirth. So goes the song of Lo'ana. But it is not the end of the song, for forces began again to dwell in Darkwood, affecting the dwellers of Darkwood Castle in different ways. The queen, Didi, began to walk in her sleep, crying the name Kas, and the cleric soon after suffered unsought trips into the Dream-estate, returning sweat-soaked and memory-less, knowing only that a battle would soon be fought and won. So be it. Originally listed here with a 1988 date. The text adventure was uploaded to Q-Link in 1986, according to the 1988 Public Domain QLink Software Catalogue. Version 2 of the game is dated 1988.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Elise C. Bucher (Zosia the Pious)", "publishers": "Q-Link", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164976-darkwood-ii-the-gryphons-pearl\n"}