{"altername_name": [], "name": "Dark Force", "overview": "It is the year 2173, and the Cygons are threatening to activate a huge laser satellite, which if activated, can destroy all of the planets in the solar system. War has broken out loose from all planets beyond. No such pilot survived the attack, except for the Cygons. You are a proud pilot of the Dark Force, the fittest hunk of junk in the entire galaxy. Your mission is to fly through 3 sectors, and destroy all 20 generators which control the power of the laser. The Cygons and their Allies will be out to stop you no matter how tough or weak you really are. Every 6 generators destroyed will award you an extra life. The sections are as follows: 1. Deep space. - The Cygons have planted some stations, in which stores various trajectory machines, and also on one station are 6 generators. Start off by blasting your way through the asteroid belt (Avoid the darker asteroids as they are indestructible. Fight the Cygon ships, and blast really hard at everything in sight. The first mission won't be all that easy - considering that the Cygons will attack back. A big Cygon ship will be waiting, and can only be blasted in parts. 2. Planet Hox - At first, it was a lone planet, but now taken over by the Cygons. What used to be a peaceful planet has turned into a war zone. Advanced technology, built by the Cygons are stored there. The battle is within your hards and the Cygons will be ready to fight back. Planet Hox contains another 6 generators, in which must be destroyed. Two Cygon ships will be waiting, and can be blasted in parts in order to destroy them. 3. Finale - After escaping from Planet Hox, you enter space once again, but the Cygons have planted more dangerous enemy forces on some asteroids. You must zap those away, if you are to survive the finale. After escaping the asteroids, you will be flying through the Cygon's very own territory and must blast the last 8 generators, stored there. Unfortunately, the final fight will be a tough challenge. Can you put a stop to the Cygon's powerful laser cannon, and cause a malfunction to it - or will the laser be fired and wipe out all planets of the solar system? Good luck, you'll need it!", "platform": "Commodore 64", "release_date": "2014", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Alf Yngve", "publishers": "The New Dimension (TND)", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=SwQYkm2R83o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75449-dark-force\n"}