{"altername_name": [], "name": "Deadly Dungeon", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". The youth was curious. He'd heard many tales told by wandering minstrels. They spoke of dark and deadly dungeons in whispered, cautioning tones, as if something dreadful awaited anyone entering those murky depths. Yet it seemed to the youth that they were hiding something wonderful from him. He thirsted for treasure and his little-used blade hungered for the excitement of the storybook heroes, hungered for the blood of Not men on its tip. The youth had been born and raised on the lower Delta River plain. He'd wandered among the bullrushes and swum in the deep waters. He'd rafted the rapids below Smaegor's cavern and dared the upstream Temple. He'd even seen the Manatee once, but had swum away, very quickly. But not until now had he braved the Dungeon in the Glades. For there lay illusion, creatures and traps - according to one who'd returned to the youth's village and spoken of the horrors of his journey to the attentive firelight warriors. Now the youth would show his mettle. He would brave the Deadly Dungeon and show the cowards of his village that he was now a man. He entered the Dungeon and, though warned, continued onwards. The dank walls flickered in shadow caused by his torch. Something moved. The youth dodged, but not fast enough. He screamed in terror, and then screamed and screamed again until the sound died in his throat. Dragged away in soundless panic, he was taken to the depths of the Dungeon. His torch lay burning where it had been dropped on the floor, while the shadows danced in a silent epitaph to the death of a foolish youth.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126324-deadly-dungeon\n"}