{"altername_name": ["Deep Space"], "name": "Deep Space: Operation Copernicus", "overview": "From: Terran Defense HQ, UPSF Date: 5 June 2123 0714 SMT Fellow Fighter of Solaria: Seventeen hours ago, forces of the Hegemony of Andromeda made an unprovoked attack on United Planets Territory, treacherously killing over 200 of our citizens in the Herculis Quadrant of the Trajan group. Therefore, a state of war now exists between the United Planets of Solaria and the Hegemony. The Andromedan fleet is known to be making its way toward the Copernicus Quadrant, the richest and most densely populated portion of the asteroid belt. It is doubtless the intent of the Andromedan commanders to wreak havoc among innocent civilians who want only to go about their peaceful and lawful pursuits. Moreover, Andromeda's continued presence in Copernicus Quadrant would interrupt, perhaps forever, the production and shipment of metals vital to the needs of Earth's teeming billions. Every freedom-loving human must now rally to the great task of thrusting this evil invader back into the depths of space from whence he came, ending his nefarious schemes forthwith. It is with a heavy heart that I must tell you that, although the resources and manpower of Earth are being mobilized, you must face the beginnings of this challenge to the sovereignty of mankind alone. It will be weeks before the forces necessary to assist you in this struggle can be assembled and sent to your side. During those weeks, you, and you alone, must delay the enemy from the heartless execution of his bloody task. You must form the wall of our defenses, harrying the enemy, letting him feel the shadow of our rightful wrath. You must give him a taste of the doom that will so inevitably encompass him when the vast and mighty fleets of humanity arrive to put him to the sword. You, and you alone, must soar the trackless wastes of space in your tiny ship, searching out this affront to decency, and destroying it wherever you may find it. We do not doubt that you will find it, nor that you will destroy it. The trust and hopes of all humanity fly with you. Good Luck, Wilbur Tark, Gen., UPSF", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Edward Lerner", "publishers": "Sir-tech Software, Inc.", "genres": "Vehicle Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96185-deep-space-operation-copernicus\n"}