{"altername_name": [], "name": "Defensive", "overview": "The game was pretty much a clone of Defender with knobs on – with some impressive parallax scrolling (similar to Sanxion in some respects), a neat ship and cool end of level guardians. A preview managed to sneak out many moons ago, which consists of 3 levels, with no attack waves, just a few crafts and end baddies. There is also no sound present. The preview though was much older than you might think, and was developed in the mid-late 1980s. The original developers were Ian and Martin (Known more as ‘God and Hake’) and were good friends of Russ. They had ditched the game before moving onto fully fledged commercial projects such as ‘Galdregons Domain’ and ‘Volfield’. When EBES became a company back in 1994, EBES’ Russ Michaels dug it out and planned to enhance the game with his team of programmers. However, it was planned to be a release that required a CMD RAMLINK, allowing instant loading, video cutscenes and large animated sequences. The graphics were to be more colourful and defined, more animation and ultra smooth scrolling. These were the features mentioned in Commodore Format at least. It is likely that a cutdown version would have been done for those without a RAMLINK. The support for the C64 was decaying badly, and no-one was buying the hardware that Russ was importing. Things also became difficult at EBES, with most of the development team leaving Russ by himself. Russ took the game on briefly, messed around briefly, but that was it. As Commodore World was being imported into in the UK by EBES as part of its many ventures (this to save the magazine readership in the UK), Russ asked readers to let him know if they wanted to support Defensive. No response was given at all, so the game was axed for good.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Ian Denny", "publishers": "Electric Boys Entertainment Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164982-defensive\n"}