{"altername_name": [], "name": "Demons of Dex: Eino's Quest", "overview": "Remember those first days at work? When you were asked to go and get a left handed hammer from the hardware store, or asked to use a computer where they've turned the background picture into a screenshot of the desktop... Well think yourself lucky you didn't go to Druid college, like poor Eino here, applying for the role of Arch Druid in Demons of Dex. A brand new roguelike dungeon crawler from Digital Monastery, the game development arm of Hokuto Force. He's been sent to fight the hell spawn, inhabiting the depths of dungeon Dex, with nothing but a robe and a rusty knife. I expect if you manage to survive the 30 levels, you'll meet one of your Druid colleagues, who'll tell you it was all one big joke. You start the game with a melee weapon, able to attack enemies, and beat down doors, in an effort to find the steps leading to the next level. You'll encounter a variety of enemies from rats and bats, to undead, orcs, demons and even invisible stalkers and fast spawning slimes. You'll need to explore everywhere to find the powerups required to fight in the later tougher levels. Potions restore health, gems reveal the current level's layout, the staff offers a ranged lightning attack, useful to weaken enemies before engaging in melee. Invisibility cloaks can also be found, as well as the super powerful \"Ankh\" spell, which will kill all enemies nearby, but you won't be rewarded with XP for these kills.. which will cost you later when you find you're not a high enough level to kill the tougher demons. This game is a fully featured, well executed roguelike, easily the best on the platform, and one of the best I've played on any platform, for many years. From the docs, to the extensive game mods and graphical options.. You can even play in old school ascii mode, for a more authentic rogue experience (it was originally a unix based game drawn entirely in ascii font). When you've finished the game you can try in extended mode with larger maps, or hard mode with more levels and demons. This game was built with love, and most importantly total respect for the platform's capabilities.", "platform": "Commodore 64", "release_date": "2016", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Digital Monastery", "publishers": "Public Domain/Freeware", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=1AUeHwZAevs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125219-demons-of-dex-einos-quest\n"}