{"altername_name": [], "name": "Destiny (Destiny Software)", "overview": "Destiny is a graphic text adventure developed by John A. Fitzpatrick and published by Destiny Software Ltd. in 1985. SEEK YOUR DESTINY! Deep within the craggy, mountainous area of Adventura, guarded by an army of fiercely competitive Orcan warriors, stands the ancient fortress of the once great and benevolent ruler, King Ecreip III. The land that King Ecreip III ruled was grand and prosperous, rich in gems and blessed by good spirits. But the good King Ecrip III was a lonely man, for he had no Queen and no heirs. Shortly before his death, the King announced that he would allow his kingdom to be ruled by none other than the wisest and most courageous man in the land. That man, it was stated, must slay the feared Faldrakrin, the invincible red dragon that threatened Adventura with evil and doom. But King Ecrip III died quickly and quietly, and no man had yet conquered the great red dragon. In fact, much to the chagrin of the folks of Adventura, Faldrakrin soon occupied the fortress of King Ecrip III and is shielded from its attackers by the mighty Orcan warriors. Your mission is to enter the land of Adventura and retrieve the kingdom that has been seized by the Orcans and deprived of the goodness and prosperity that the King Ecrip III strived to withhold. This mission is a complex and difficult one; it has been attempted by but one other man, Sir Marcos Dracos; he never returned... Be warned! The path you take will not be an easy one, nor will it be well-marked. You must use your savvy, your senses, and your survival skills to overcome the enemies you encounter, outwit the obstacles, and unravel the mystery of the crystal key, to discover what Destiny has in store for you!", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "John A. Fitzpatrick", "publishers": "Destiny Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75456-destiny-destiny-software\n"}