{"altername_name": [], "name": "Do or Die", "overview": "A strategy game published in Magic Disk 64 1994/02. You are in the Empire of Tiror, which has existed for millennia, but the birth rate has been falling steadily for the past 500 years. This caused serious problems, since there were simply too few Tironians to control the colonial system, but these are absolutely necessary to maintain the standard of living. Fortunately, however, Dr. Smirtok at the last minute developed the so-called ROBCOM system. This is an intelligent computer system, which was then installed throughout the empire and has since taken over all tasks. This enabled the Tironians to live a life in peace and without work in the main Tiror system. But suddenly contact with the colonial systems broke off. The Robot war fleet was dispatched immediately, but it also disappeared. So a small manned squadron was sent under Captain Preiner, but shortly afterwards Preiner sent SOS from the Starxis colonial system. So King Xerix IV had no choice but to ask the SPACEWARRIORS caste for help. This emerged from the original war fleet before ROBCOM took over the war trade. Since then, the members of this caste have lived a life as hermits in their legendary SPACEFIGHTER spaceships. But their code of honor tells them to comply with the king's request, and so the last 4 space warriors Kriz, Geriex, Samier and Rex start to save the empire. Game screen layout: Top left: Here is a section of the playing area and in the middle a symbol that represents your squadron. Top-middle: Here you will find a small screen for various graphics. Top right: This is the communication window for texts and the system card. Middle: Logo of the manufacturer Middle left: Here is a line of text that shows you the current location coordinates in the system and the designation for the field on which you are currently located. Below: There you can see the skills of your team.", "platform": "Commodore 64", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "CP Verlag", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96828-do-or-die\n"}