{"altername_name": [], "name": "Double Deck Duo", "overview": "Double Deck Duo is a set of solitaire games by Maurice Jones and published in 1995 in Loadstar #131. Two new card solitaires from the Master. Use two decks for twice the fun! Here are two variations of a double deck solitaire. Since the rules are somewhat unusaul it may be necessary to read the instructions by hitting H at any prompt. Game one, The Dutchess: You begin with 4 cards being dealt to the tableau piles (2-5) and two more being dealt face down to form the reserve. As they become available, one ace of each suite and one king of each suit is played to the foundation piles (indicated by A and K respectively). Aces are built upwardly by suite to the Kin and Kings are built downward by suit to the Ace. When all possible plays have been made, four more cards are dealt to the tableau and two are dealt to the reserve. The top cards of the tableau are available. When the deck is exhausted, all cards in the reserve are available for play, along with the top cards of the tableau which may become playable. Three redeals are allowed, with no cards being dealt to the reserve on the third redeal. The game is won if all cards are played to the foundation. Game two, Parisienne: This game differs from The Dutchess only in that one Ace and one King are removed from the deck and played in the foundation before play begins. Space deals 4 cards to tableau and 2 to the reserve. 1-5 chooses pile to be played from. Only piles 2-5 can be selected until reserve is turned. A or K chooses pile to be played to, the computer will determine pile by suit. F1 ends the game, F2 resets stats, F3 is Rage Quit and ends the game without updating stats. O is the OOPS key and can take back the most recent play. R redeals, S spreads to allow card examination. If PEEK is on, it will ask which pile 1-5 or space for desk. H for help.", "platform": "Commodore 64", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Maurice Jones", "publishers": "Softdisk Publishing, Inc.", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97321-double-deck-duo\n"}