{"altername_name": [], "name": "Dragonquest", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". The Dragon Smaegor was old. His bones creaked with the weight of the years and his body ached with the scars of old wounds. He was tired. He wanted to lie down and sleep. But the matters of Dragondom pressed heavily upon him. He was, after all, Smaegor, Monarch of all Dragonkind, and there were duties to perform. From his lair, high in the caverns above the pillar, he stirred. Men and Graylocks had plagued Dragonkind for many centuries. They sought out Smaegor's subjects and slew them outright when they could. And when they could not, they hounded them until they could do little else but flee. Where Dragons had once ruled the Delta River Valley, now only a very few remained. Despite such persecution, Dragonkind were nevertheless still peaceful. But Smaegor had been informed of the loss of a grandling, a victim of Royal Guardsmen on a hunt. The grandling had been helpless, slain by the King's soldiers enjoying their sport. So Smaegor stirred, and took to the skies over the River Delta. He descended on the Palace garden in a fit of fury and grabbed the King's only daughter in his main claw. He rose in the air and circled the Palace. Far out of range of the volleys of arrows being loosed by the Guardsmen, he roared a challenge to the warm bloods below. It was a traditional challenge of personal combat which he knew one of the wise Elders would translate to the King. At sundown the Princess would be consumed in a ritual sacrifice to avenge the death of the grandling. Smaegor vanished into the clouds and returned, unseen, to his cave to await his opponent. The Fighter came to the Palace within moments of Smaegor's raid. He expressed sorrow at the loss of the Princess and asked the King what he might do to help .. \"You must rescue her before sundown,\" said the King, who opened a passage leading to a storeroom. \"Take what you need and save her please!\" The Fighter knew the Delta River Valley well. He knew that there were things he would need if he were to defeat the mighty Smaegor and secure the return of the Princess. There was the dark wood and the alchemist beyond. There was the River Delta and the dock where there was always a rowing-boat moored, ready for use by anyone who might need it. There was the Temple and a sword sunk into a stone. Even the river - that lazy muddy mass - held secrets. The Fighter held a deity stone. With this he could ask for help to guide him. The gem, however, was flawed, so the advice wasn't always accurate. Then there was Old Smaegor himself, a tough, wizened old Dragon, waiting for the Fighter in his lair. Smaegor the angry, Smaegor the intelligent. What traps were laid in the caverns, the Fighter could not tell. He shouldered his supplies from the King's storeroom and bid the monarch farewell. \"It's going to be a long day,\" he mused to himself. \"And the Dragon awaits...\"", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Charles Forsyth", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126345-dragonquest\n"}