{"altername_name": [], "name": "Draw Poker (Alpha Software/Data-Tronic)", "overview": "Released as part of the \"75 Spill Datatronic\" collection. The game is uncredited but the code was almost entirely done by Early Wuchter for the PET Computer in 1978. Excerpts from a Norwegian game history site ( https://spillhistorie.no) \"The first thing that strikes me when I start this game is the use of the word \"grazing\" as a translation for \"bet\". I was going to make fun of Data-Tronic for this, but then I checked online and it looks like it is actually called in Norwegian. This poker game is in any case competent. It uses simple keyboard graphics, but since the Commodore 64 has signs for all the symbols in poker, it works just fine. The only thing an ordinary poker game needs is actually that the cards are presented clearly and clearly. About the computer player there is not much more to say than that he was almost taking me, until I struck with a little luria (and at the same time got lucky with the cards). Poker just ends up in the middle of the tree. So, where does Poker come from? The Data-Tronic version says nothing, but it is like so many times before based on a version of Alpha Software, which once credits someone else: Computer Genius (1986). Unfortunately, \"computer genius\" is actually a bit difficult to google. However, I find several almost identical games, and the oldest of these are Draw Poker from 1978, programmed for Commodore PET by Earl Wuchter. It also has a Commodore 64 version. I download it and test it - and quite rightly. It lacks colors, and the instructions are a little different, but otherwise it is quite similar. Maybe there are some improvements behind the scenes - smarter computer games, for example - but at least it's obvious we've found its predecessor here. The earliest reference to the game I can find is from the September-October 1978 edition of PET User Notes , the member magazine of the PET Computer Group. The game is in the group's member library and can be ordered on cassette. I really didn't think there would be so much gaming history in this package. \"", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Alpha Software Ltd.", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ufjw_C7-cLQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97633-draw-poker-alpha-softwaredata-tronic\n"}