{"altername_name": [], "name": "Drixella's Dilemma", "overview": "Published in the COMPUTE!'s Gazette section of Compute magazine 1992/09. The evil witch Drixella has taken you hostage, however all is not lost. She dangles before you one chance for freedom. \"Here you will remain, \" she shouts with a booming voice, \"until you solve the puzzle!\" The door slams shut and her chilling laughter fades into silence. You notice a clay board in the corner with 96 squares, 12 across and 8 vertical. Nearby are a scroll and a small velvet pouch. Opening the scroll, you see faint writing. \"Herein are 72 tiles that have been painted six different colors. On them are six different icons that represent the realm of witchcraft; broom cauldron, beetle, black cat, crow and Drixella's hat. Your goal is to place all 72 tiles on the playing board. The first six have been placed for you. To complete the task you must follow these five rules. 1. Tiles are taken out one at a time 2. To play a tile, you must place it next to an occupied square. Diagonals are NOT included 3. Surrounding tiles must match the played tile in either color or icon. 4. If a played tile touches more than one other, the matches must balance. If two tiles are adjacent, one must match by color or the other by icon. If three should boarder, two much have the same color or icon and the other must match in icon or color. If four should border, then there must be two color matches and two icon matches. 5. You must play a tile before the timer runs out. After each play the timer will be reset but will run a bit faster. \" So just play the tiles and you can go free! Bwhahahahahaha!", "platform": "Commodore 64", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Arthur Moore", "publishers": "COMPUTE! Publications", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KOE_EE-1dkw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97695-drixellas-dilemma\n"}