{"altername_name": [], "name": "Empius", "overview": "A military strategy game that takes place in God knows when and where. Your goal is clear, destroy all unfriendly units and thus become Lord of Empius. But quite interesting- know you can play against 1 to 3 different player armies (that means that the game is for 2 to 4 players). After selection one of the five maps can be chose, where your strategic plans will transform into reality. Plan unit creation and make sure you are able to replenish soldiers, weapons and supplies. Units are shown using a 2x2 square, in which there are 3 numbers and an or symbols. They indicate the number of already mentioned soldiers, weapons and supplies, while the highest value that an individual number can reach is 9. The + (or -) sign indicates whether the unit moves at normal speed or if its movement is slowed down (for example in hills or forests ). Individual items in the unit (number of soldiers, etc.) are supplemented in two ways. Either in the menu, which we get to by hovering over the selected unit, holding fire and selecting an item, or using the keys A,D,S+ fire. After finishing this activity, the phase of moving your units will come. Use space to convert \"Numerical units in the form of some kind of Russian antediluvian Katyushas, which are capable of movement. Then just determine which unit should move and where, and it's just that you can move with several units at once. If you have everything set, then select the GO command in the menu and leave the game to your opponents. When it's your turn, you have a chance to create a new unit by placing the crosshair on the field where your units were already and pressing fire. This can mean that you can play even a light map like MICRO for hours. By the way, if you don't know how to fight: you simply enter your enemy's unit as the destination for your unit and send it. Published in 1992 in Starlight Magazine #5, and later in Starlight Magazine #8.", "platform": "Commodore 64", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Masters' Design Group", "publishers": "Logo Software", "genres": "Strategy", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98456-empius\n"}