{"altername_name": [], "name": "English Darts", "overview": "A pub style darts game created by Michael E. Townsend and released in Ahoy! 1986/05 (Issue #29). With the popularity of the new electronic dart games in pubs today, you can brush up on your aim before taking on the pros on your evening out with a home version of English darts. This program allows you to choose between the standard '301' game or the extended '501'. Up to seven players may participate at one time, making it an ideal home party game. Rules are the same as with ordinary board darts, with the advantage being that you don't scar up your walls with your overthrows! There are three throws per player per round: to win, an exact score must be made or you will 'break' and return to your previous score. Choose the game you wish to play and the number of players. The game will automatically prompt you as to which player is up. The screen will clear and the program title along with six informational boxes will appear at the top of the screen, plus a listing of each player's current score in the lower right hand comer. The dartboard will appear, as well as a dart moving up and down on the left hand side of the screen. To throw a dart, simply press any key. Scoring is from the center of the board (a bull's eye for 50 points) to the outer edges of the board (from 20 down to 1 point as you advance to the edge). You may also score double and triple points as in the real board game: the computer will evaluate your throw randomly. Following each round, a 'box score' is presented with the current standing of each player. When a person has won, you will be prompted as to whether you wish to see the final scores, as well as asked if you wish to play again.", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Michael E. Townsend", "publishers": "Ion International, Inc.", "genres": "Sports", "max_players": "7", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98690-english-darts\n"}