{"altername_name": [], "name": "ESP", "overview": "Party style game created by Walter E. Meyers and published as part Commodore Magazine 1987/01, Loadstar #031. A computer adaptation of a widely used clairvoyance test. The scientific study of extrasensory perception (ESP) began in the 1930's at Duke University under Dr. Joseph Rhine. These studies, which were very controversial, led one skeptical psychologist to sneer that ESP stood for \"error some place.\" Now, with this simple game for the Commodore 64, you can judge for yourself. ESP studies often used (and still do) a special deck of 25 cards. These Zener cards, as they are called, each bear one of five figures: a circle, a square, a cross, a star, or several wavy lines. There are five cards of each figure in the deck. The subject, often separated from the examiner by a screen or in an- other room, guessed which figure appeared on the card as it was turned over. The program ESP makes you the subject. After a brief title display, you will see the back of a card on the screen. The five figures appear below it, and beneath them is the pointer. The program selects a card from the deck of 25 and you are asked to guess which figure it carries. With a joystick in port two, move the pointer to your figure choice, then hit the fire button. You will immediately see the card that the computer has turned up, and your score will be updated. After 25 cards have been turned, you will receive an evaluation of your score and be given the opportunity to quit, review your earlier scores at the current sitting. or play another round. You may question whether mind reading is the correct term for what you're doing here, because presumably the computer has no mind, so what the player does can hardly be called mind reading. Perhaps the right term is precognition, foretelling which card is going to turn up, or maybe it is yet another psychic skill. Try your hand at reading your computer's \"mind.\" The program, which uses six sprites for the main part of the display, is written in a straightforward BASIC. It not only illustrates that even the default values of the Commodore 64 can provide striking graphics, but what really makes a game most interesting is its subject.", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Walter E. Meyers", "publishers": "Commodore Magazine", "genres": "Party", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99645-esp\n"}