{"altername_name": [], "name": "Evolution (Pan Books)", "overview": "Evolution is a series of six programs which have been divided into three self-contained groups. It represents the evolution of life from the single celled amoeba to modern man, linked by a single theme - survival! Evolution 1 begins with the amoeba stage, in which the player controls the movement of a tiny amoeba which must wander round the screen eating spores whilst avoiding attack from other single celled creatures. In the second program in this suite the player is transformed into a frog which has to dodge from side to side avoiding capture by birds whilst zapping the required number of airborne flies with its tongue. There is no fairy princess as a reward for this one but instant promotion into the form of a beaver in the third program, in which you must swim around and capture ten fish while avoiding contact with a vicious crab. In the next section you control a large gorilla which lumbers round a forest collecting bananas which drop randomly to the ground. The computer controls a small and extremely agile monkey, which makes for tough competition. In the following program you control a caveman who tries to fight off raiders attacking your territory from surrounding caves by firing arrows. Lastly you play as the leader of the global superpower of your choice. you must destroy your enemy's capitals with cruise missiles before you are destroyed by one of their ICBMs. To do this you have a very short time to pre-program the flight of your missile with a series of direction codes as the enemy's missile moves towards your capital. From the book \"Sixty Programs for the Commodore 64\".", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Geoff Amabilino", "publishers": "Pan Books", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99782-evolution-pan-books\n"}