{"altername_name": [], "name": "Face-Off", "overview": "Released in COMPUTE!'s Gazette 1986/01 (Issue #31), COMPUTE!'s Gazette 1994/11, Best of COMPUTE! & Gazette, and COMPUTE!'s Third Book of C64. If you've played Air Hockey, you already know how to play \"Face- Off.\" Based on ice hockey, Air Hockey pits two players against each other, each trying to shoot a puck into his opponent's goal while The player on the right has missed blocking the puck, which is headed straight for the goal, defending his own goal. A center line splits the playfield. Neither player is allowed to cross this line. The object of the game is simple: The first player to score five goals wins. The one-player game pits you against your computer; the two-player game is for two human opponents and requires two joysticks. Next, you're prompted to select the speed (1-3). Speed 1 is the slowest and 3 is the fastest. (It is suggested that you play your first game at the slowest speed, although speed 2 is probably the one you'll choose after playing a few times,) If you selected a two-player option, the game begins after you've selected a speed. If you chose the one-player option, there's one more prompt to answer: Skill Level (1-9). This determines the intelligence of the computer-controlled player. If you choose 1, the computer plays a pretty easy game. At 9, it's very wily. With a speed of 3 and a skill level of 9, the computer is next to impossible to beat. When the game begins, you see a red puck, a cyan player on the left, and a yellow player on the right. The cyan player controls the puck to start. Contact with the puck starts the game. (Notice that the puck gradually slows down if it's not hit.) After each goal scored, the player scored against gets control. (You can knock the puck into your own goal, which awards a point to your opponent.) A total of nine pucks are placed per game. You can move anywhere up to the center line. (At slower speeds, one strategy is to play along the center line, like rushing the net in tennis. This keeps the puck in the computer player's territory most of the time if you can react quickly enough.) Current scores for each player are posted at the top of the screen. After nine pucks are used, the game is over. You're then prompted to press the fire button to play again, then to press up on the joystick to change play options or down to play with those of the previous game.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Kevin Mykytyn", "publishers": "COMPUTE! Publications", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/100121-face-off\n"}