{"altername_name": [], "name": "Firekeep", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". AWAKEN NOW AND HARKEN TO THY DREAMS FOR WHAT STANDS BEFORE YOU IS NOT WHAT IT SEEMS A WIZARD'S DANGER HOVERS WHILE YOU SLEEP AND YE SHALL DIE WITHIN THE WALLS OF FIREKEEP The town of Skyshade was more than an odd name on a traveler’s map. It was home to five inns, a weaponry shop, two general stores, six food shops, and twenty-one undertakers. Skyshade had the largest transient population in the land, sitting as it did squarely across the entrance to Lost Canyon (which, in turn, led to Firekeep). Pilgrims from all over Graylockland -Humans, Graylocks, Halflings from the Forbidden Territories -came to Skyshade with only one thing on their minds the treasures of Firekeep. The Barbarian was no exception to this general rule. He'd heard of Firekeep during a recent stay in Belestria, the desert city. The lure of treasure was a powerful one and Thoran was more interested in pressing on than stopping; that is, until he heard music coming from the Dragon Inn. A vision of cool ale and comfort lured him off the road. He took the table farthest from the door and sat with his back to the wall, waiting for the tankard promised him by the waitress. Although he didn't wish to draw attention to himself, his size, weight and fighter's countenance were difficult to disguise with a cloak and a stick. Several locals took his measure and decided that they could do without broken bones and bruised heads. A couple of others - outlanders like Thoran -considered asking him to join their assault on Firekeep. But the scowl on his face and the thickness of his staff made them think twice. It was a young pilgrim, a south boy, who came over to the Barbarian's table and politely asked if he could sit down. Not yet fully grown, this slight youth seemed to offer little in the way of danger. But he met Thoran's gaze unflinchingly, causing the giant warrior to agree to his company. The pilgrim moved his chair to the table and seated himself as an equal. The crowd quietened. When no confrontation took place, they resumed their chatter. Thoran sipped his ale and smiled to himself at their wonder. \"I am the best swordsman in my village,\" said the youth, \"lean slice a candle twelve times without dousing its flame.\" Thoran considered this. \"How many enemies have you killed?\" the lad continued, pointing to the sword that just peeked out, handle first, through the Barbarian's cloak. \"I only kill friends,\" Thoran growled. Some of the colour drained from the boy's face. \"Why's that?\" His voice almost betrayed his fear. \"Because no coward dares stand against me,\" explained Thoran. \"I may fight only brave men. Since no man of courage may be my enemy, I fight only those who know my name. Since those who know my name respect me, they are my friends. Since no warrior can better me, they al\\ die. I only kill my friends.\" \"Must I die to be your friend?\" \"All do, sooner or later. Better you should drink and not ask my name.\" The Barbarian and the southboy drank their ale in silence, each lost in thought. Thoran was thinking of the compulsion that had led him to Skyshade and Firekeep - a powerful spell laid on him by the treacherous illusionist Thomas Dreamweaver, a spell that placed him in bondage to the Wizard of Firekeep. What sweet revenges would be his when he freed himself of this urge to go to Firekeep. How utterly dead Dreamweaver would be then. The southboy too was lost in thought, but Thoran' s thoughts intruded upon him. The south boy was a Sensitive, one of the gifted who could read the minds of others. He knew of the Barbarian's plight at the instant Thoran thought about it. 127 \"I shall help you, Thoran, \" the south boy said. Thoran instantly stood to his full height and clouted the lad soundly across the ear, sending him crashing across several tables. \"Do not speak my name again,\" he roared. \"I want no more blood on my hands. The only way to help me is to defeat me in armed combat. You cannot. I want no more blood on my hands.\" So saying, he strode through the door of the Dragon Inn and out on to the Lost Canyon road. The much chastised southboy bought himself another tankard and sat down again at the abandoned table. Sipping cool ale, he studied an old parchment that had been provided for him by his employer, the White Wizard of the South. Old Wilgus' words came back to him. \"At any cost you must see that the Barbarian Thoran comes to Crystal Hall. The future of life depends on it. You must free him of the bondage he faces at Firekeep and bring him here. It is up to you.\" The southboy downed his pint, pocketed his map, gathered up his resolve and set off for Firekeep, the captive warrior, and the Wizard who held him prisoner. It was going to be a long, long day...", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126659-firekeep\n"}