{"altername_name": [], "name": "Flix", "overview": "Flix - a game of action with thought, the joystick killer64'er was created by Jan Westphal and published in 1992 in Sonderheft 85. It can be solved. Even if you will have a different feeling the first time you try it. If you do this, the second level will bring you a little more calm, but it does contain some tactical landmines. The third level is reminiscent of a chessboard. It's not just about tactics here. Good reaction skills and the ability to make quick decisions should you have hurdles to bring. Otherwise it's game over before you know it. For success, the first level in particular must be played extremely quickly. You will see a playing field on which green stones are apparently randomly distributed. Your task is to use the joystick to hit the stones with the ball (roughly in the middle of the screen) and shoot into the explosion field (top right) with FIRE. Of course, this is not possible all at once. So shoot the stones to the edge of the screen first - but definitely not into a corner. Level two is for tacticians, Try to clear the chess board. If you've succeeded (perhaps after several attempts), level two will reward you with a little more peace. The tactic remains the same. Here, too, you shoot colored stones across the playing field with the ball and sink them. she. But here are four blast holes ready - one in each corner. Be careful where you throw the stones. After this level, a chess board will appear. Only tactics (and speed) can help here. Beware of the little ones. asterisk lower right. If the ball touches it, it explodes and the level is lost. Stones should not be thrown there either. Three lives are available in which this screen must be cracked, otherwise the game starts over.", "platform": "Commodore 64", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Jan Westphal", "publishers": "Markt & Technik", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/101250-flix\n"}