{"altername_name": [], "name": "Flying Cobra: Special Edition", "overview": "A variant version with improved music and graphical elements. Also a new tape version is available. An evil Dictator has risen. A new war has taken place in the Gulf of Mexico. He threatens to start a worldwide Nuclear war, which could result to devastating consequences. The president sent in many of the armed forces to do battle against the evil dictator. Although weakening the enemy forces was going well at first, nobody survived. In order to win the nuclear war. A code has been broken, and intelligence has detected that the dictator is located at an unused airport at the other side of the warzone The president has called in the Flying Cobra pilots... Unfortunately this is where you take the piece of the action. The Game Your mission is to pilot Flying Cobra fighter jets (using a joystick in port 2) across the enemy lines. Your plane is armed with forward rockets, and also guided missile launchers. To fire the guided missile launcher, you must move the direction of the plane and fire whilst in motion. You must fight against all enemies that are located on ground, air and sea. During the battle you will be under firing range - which is very easy for the enemies. Some enemies will aim for the current position of your jet and then when ready, they will fire. Try to avoid the enemy fire. Later on in the game, you will find your plane's altitude is getting critically low. During that stage crashing into any buildings, otherwise you'll waste one of the jets. If all jets are wasted, the game is up and the dictator wins. Can you survive, land safely at the airport and finally get dictator arrested? Or will the nuclear war break out across the world? The fate is in your hands.", "platform": "Commodore 64", "release_date": "January 2, 2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Martin Piper", "publishers": "The New Dimension (TND)", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=wxj-V_aCOr8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150618-flying-cobra-special-edition\n"}