{"altername_name": ["Crypt 64"], "name": "Forbidden Crypt", "overview": "Type-in clone of the Exidy arcade game Venture written by Ted Reynolds and published in COMPUTE!'s Gazette 1985/02 (Issue #20). You're a leading archaeologist who's happened on a fabulous treasure. But spiders, bats, snakes, and ghouls guard the riches. How long can you survive in the forbidden crypt? A local legend, long dismissed as mere myth, speaks of a great and powerful king who once ruled this area. While investigating the origins of this tale, you've discovered a cenotaph covered with unusual glyphs. They're difficult to translate, but seem to say something about the king and guardians and forbidden treasure. Undaunted, you open the door and enter. The door slams shut, leaving you stranded in the crypt. Survival in \"The Forbidden Crypt\" is not easy. Each level contains four rooms into which you must enter and retrieve a treasure. That's easy enough, but avoiding the spiders, bats, snakes, and ghouls guardians of the treasure — are not. And the only way to get to the next level is to claim the treasure from all four rooms. Thrown Into Action Game play begins with an overview of the four rooms, each with two doors, one on the left and one on the right. Below the playing screen is Score, Level, and Lives. You're represented by the red dot on the screen, and you can begin in any room at any door. Using a joystick (port 2 on the 64, port 1 on the Plus/4 and 16), move into a room (hint: You'll have more success if you enter from the door on the right), and you're immediately thrown into the action. The screen changes to a full view of the room you've red. The treasure is often difficult to get to as the guardians, four per room, pursue you. Their touch is deadly. You can defend yourself by aiming the joystick at a guardian and pressing the fire button. A hit eliminates a guardian. In the 64 version, you have only three shots per room and the guardians move faster towards you after one of their companions has been eliminated. After grabbing the treasure and avoiding the guardians, head for the exit. You must leave the door opposite the one you came in (either door in the VIC version), If you make it, you'll be back to the four-room overview, and the room you've just left will contain a mark to indicate that you've completed it. Sometimes, you'll be doing well just to escape the room, even without the treasure. In this case, you'll have to return to the room and try again. Remember, you can't get to the next level until you've found a treasure in each of the four rooms. Extra Lives You begin with five lives, but get an extra one for every four levels completed. Also, the guardians speed up after an extra life is awarded, so the game becomes increasingly difficult. The Forbidden Crypt is not an easy game beyond the first few rounds. Success will come with some practice and devising a good strategy.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Ted Reynolds", "publishers": "COMPUTE! Publications", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Yq8zK5sZoCc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115877-forbidden-crypt\n"}