{"altername_name": [], "name": "Frantic!", "overview": "A game attributed to John Patrick Green but bearing an uncanny resemblance to the German game Mensch ärgere Dich nicht which came out five years earlier, which was made by Ralf Hahn, this game was published in ReRun Special Summer Edition 1990. FRANTIC!, BASED ON the popular board game Parcheesi, is a game of excitement and strategy for both children and adults. By rolling a die you must move the four pawns of your color from square to square around the playing board until they eventually reach home base. Sound easy? Well, as you're moving your pawns, other players will be trying to land on them and remove them from the board, so your pawns must start over again. To play Frantic!, first load and run the boot program, then, at the prompt, press return to load and run the main program. When the title screen appears, press the space bar to specify the number of players (computer and/or human), their colors and, if human, their names. There can be one to four players with the colors yellow, blue, green and red. For the first game, I suggest you have all four computer players play against each other, to see how the game goes. (You might not want to watch the whole game, because it can take up to an hour for the computer to defeat itself.) The player with the highest number rolls first, then the others take turns clockwise around the board. The computer rolls automatically, but people must press the space bar to roll the die. You get three rolls of the die per turn until you roll a six, which places one of your pawns on the starting arrow of your color. This ends your turn, and on subsequent turns you get only one roll, unless all your active pawns get bounced from the board, you make it to home base, or you roll another six. Then you get three rolls per turn again until you roll six and another pawn goes to the starting arrow.", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "John Patrick Green", "publishers": "RUN", "genres": "Board Game", "max_players": "4", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367645-frantic\n"}