{"altername_name": [], "name": "Froggy (Verlag Heinz Heise)", "overview": "A collect'em up type game published in Input 64 1986/01. Do you know FROGGY? No? Well, FROGGY is a lovable little frog who's always hungry for the little round bonus points. Luckily there are plenty of them. Your score increases for each eaten point. So far the matter is quite simple. You could lie back comfortably in the chair and watch. Unfortunately, the frog has a silly quality: it recognizes the spots where it has already scored a point and takes away the hard-earned points every time you pass this spot again. What a hassle! In the first level, this only happens after four 'grazed' fields, but in the further game levels he manages fewer and fewer of these fields without losing points. You as the player should ensure that FROGGY can score points by skillfully moving the sub-pictures, because only when all the points have been eaten will you get to the next level. To make things easier, you have 2 jokers in each round. When you press the J key, FROGGY stops and you have time to move the sub-images to a favorable position. Pressing the J button again will resume the game. However, you should not treat your jokers lightly, because you receive a bonus of 10 points for each unused joker at the end of the game. It's a matter of weighing up, sacrificing a few during the game points and saves the joker, or do you use the joker break to prepare a favorable path for the frog. You can play the game with both the keyboard and a joystick (Port 2). The SPACE key takes you to the actual playing field. You can move the sub-fields with the T (up), V (down), F (left), G (right) keys or with the corresponding joystick control. With J you can request a joker and then let the frog hop on. Finally, the Fl key turns the jumping sound on or off.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Verlag Heinz Heise GmbH", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/101837-froggy-verlag-heinz-heise\n"}