{"altername_name": [], "name": "Fröhn", "overview": "Fröhn is a Jump and Run from the year 1985. You play in said Fröhn and must free his Fröhnline. For this you have to follow the instructions from the joke poem (see the background), which is printed on the package and in the title image by banner appears. The Fröhn can carry an item and carries the \"Dong\" at the beginning of the game, which can also be used as a limited weapon. The game is an implementation of a joke from the German edition of the MAD magazine. The article claimed that video game rules are deliberately heavy and illogical, requiring users to play much longer (pay more) to play the game properly. There was a report on gambling halls following \"rules of the game\": Protect the beautiful Fröhn before the evil groan by the creaking of black warts, but they turn into dead Goths, if they are not fed red breads by the messengers, if not before the five-snubbed Zong has poured your dong into the pong. Destroy the joke and get the treasure with the cat - then your Fröhn will be nice again For the game that was then implemented, the text has been changed: Protect the beautiful Fröhn from the evil groan by the creaking of the black warts, which, however, turn into dead Goths, if they are not fed by the messenger with red breads, if not before the five-nose Zong has poured your dong into the Pong, which turns the gray woman into a blue sow ... Get the treasure with the cat and kill the watz! Use flashes from the hand in temples and rempel the stamp there to avoid bumps from the owl's clubs. Escape the grotto with the fleet, but first destroy the gullet from which round dogs hop, after chasing the Hottentot out of the grottos with the moths. Do not free Fröhnline with the machine until you have not gotten yourself into trouble with Ms. Holle and her great trolls, and then your Fröhnine is fine again!", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Frank Wienberg", "publishers": "Kingsoft", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KxtOgjjxOHk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75863-frohn\n"}