{"altername_name": [], "name": "Garfield: Winter's Tail", "overview": "Garfield: Winter's Tail is a game based on the Jim Davis comic strip, Garfield. It was released in 1989 for Amiga, Atari ST (will not work on Atari STe computers), Commodore 64 and ZX Spectrum. It is the fourth video game to be based on Jim Davis' Garfield Comics. After a fruitful day spent on his favorite hobby (food, what else?), Garfield the cat falls asleep next to Jon's still open fridge. The chill coming out of the refrigerator induces a dream of the Swiss Alps, with Garfield going after the largest lasagna factory in the world and a mythical chicken that can lay chocolate eggs. It is the player's goal to make sure Garfield's dream comes to a happy ending before he wakes up. Garfield: Winter's Tail comprises of three different mini-games.The first one has Garfield skiing downhill towards a ski-jump that will lead him straight to the rooftop of the lasagna factory. The second mini-game is set in the chocolate factory where the mythical chicken is employed: Garfield must ensure all the mechanical chickens in the factory are provided their chocolate supply flowing through a pipeline. Finally, he must ice-skate across a frozen lake, following the trail of chocolate footsteps left by the chicken. As a disturbing element, Odie appears throughout the whole game. The drooling dog can steal some of the food Garfield needs to replenish his energy, but he can also tamper with the lift controls in the factory and saw holes in the frozen lake. The three mini-games can be played in any order. However, playing the whole game from the skiing level first is the only way to be able to see the ending.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Softek International Ltd.", "publishers": "The Edge", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Garfield:_Winter%27s_Tail", "video_link": "https://www.youtube.com/watch?v=aRoB-0v9GZw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95941-garfield-winters-tail\n"}