{"altername_name": [], "name": "Gauntlet of Death", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". The Barbarian moved silently through the streets of Belestria, his huge frame dwarfing the Graylock throngs that mingled and flowed from the side-streets. Humans were not an uncommon sight in the Trade City and this one, though larger than most, aroused little attention beyond the ordinary caution taken in the presence of an obviously dangerous being. The Barbarian was called Thoran, which in his own language meant Wolf Slayer. He hailed from the mountains of the far north of the Great Outback, the refuge of the last tribes of Human nomads. He wore no Guildband or armour. Rather, he dressed in traditional loose desert garments. Although his hood partially concealed his features, his bulk betrayed his race to any who might care to examine him more closely. He was intent on his mission. He moved through the streets of the Trade City as though he knew them well. He worked his way amongst merchants, beggars and thieves towards the Palace of the King. His mind and his body were concentrated on a single task. By the time he reached the square opposite the Palace gates he was so preoccupied with his mission that he failed to notice the quiet build-up of troops around him. Not until he heard the twang of a crossbow did he become aware of them. Thoran spun like a cat, whirling to face the direction of the sound. His hand moved so fast it was a blur to the onlookers. He dropped to one knee. Then he rose to his feet again, stretched out his hand in the direction of a young soldier, and opened his clenched fist. The youth who had fired the bolt was one of the youngest and least experienced of the King's garrison. He had done the unforgivable: fired without an order. Although the garrison soldiers didn't flinch, the youth took haIf a step backwards. In Thoran's outstretched hand was the very bolt that had been aimed at him! Thoran shook the hood off his head, revealing decidedly Human features and a shaggy mane of jet-black hair. He moved towards the offending soldier until his outstretched arm was only inches from his face. The air was electric with tension. By Graylock law, Thoran had a right to claim the youth's life for this unprovoked attack. A crowd had gathered by now, and each of the onlookers wondered what would be the outcome of this confrontation between a Human and a Royal Trooper-a rare occurrence in these times of stealth and assassins. Thoran broke into a thunderous laugh; his mirth cracked through the air like a great whip. Lt was not a laugh of ridicule, but one of great amusement. He ripped away his desert garments to reveal the leather dressings of a Hekero, a northern warrior. \"l have no quarrel with anyone,\" he said, loud enough so that all could hear. And then, softly, for the youth's ears only, \"But you'll not find me so generous after a second mistake.\" With this, he tossed the bolt back at his assailant and strode boldly through the gates and up the Palace steps, as if he'd been born there. The Troopers and the crowd were left to contemplate the worth of a being who could catch an arrow barehanded. The Palace guards ushered him through to the inner chambers, on instructions from the Court, and the herald announced him as if he were a visiting royal. He strode between two lines of reposing courtiers and approached the King's throne. He clenched his right hand into a fist and slapped it against his left breast - a salute between equals. The courtiers began to mutter at this audacity but the King motioned for them to be silent. \"We've been waiting for you, Thoran,\" His Highness said, his voice echoing throughout the room. ''I'll not waste words with you, Ruler of Child Snatchers,\" Thoran spat. \"Where is the daughter of Broton, Chief of the Eagle Clan of North men, abducted by raiders on your orders?\" \"She is uninjured and well looked after, my Barbarian friend, and you may return her to her sire after her ransom is paid.\" \"What treachery is this?\" roared Thoran. \"She is an innocent and by the law of the land cannot be bartered or detained.\" \"I am the law of the land!\" thundered the King, leaping to his feet. \"I alone will decide who is to be detained and what the ransom will be!\" Then, more quietly, \"For too long Humans have forgotten their place as guests in the Kingdom.\" He turned his attention from Thoran to the court at large. \"To retrieve the freedom of she whom you seek,\" he proclaimed, \"you must stand a test of courage and endurance. If you succeed you will win her release and the respect of the House of Royal for Humankind. If you fail you will die and the hopes of Humankind for equal citizenship will die with you.\" \"Then bring on the test,\" said Thoran softly, \"and pray that I find no treachery in its conclusion. For if l do, your blood will stain an assassin's dagger before my breath escapes my body.\" \"Escort him to the Gauntlet,\" said the King. \"Instruct him well. I want him to die more slowly than those before him.\" \"Surrender your weapons, sir,\" said the keeper, \"for they will encumber you.\" Without taking his eyes off the King, Thoran loosened his scabbard belt and handed over his sword. He saluted the King a second time in the same manner as before, and followed the keeper out of the throne room. The keeper began to speak of what awaited him. \"The rooms are filled with traps,\" the keeper was saying. \"The corridors and cubby -holes are poorly lit. Be alert to any possibility, both mechanical and organic. The best defense against these chambers are the very wits and strengths by which you have survived thus far. Ahh, we are here.\" The keeper opened a door that led into a single narrow room. Above could be heard the tittering of the courtiers, who watched his moves out of harm's way. Thoran moved through the portal. \"Good luck,\" sighed the keeper, as he'd said before to a hundred other Men and Graylocks. And he closed the heavy door, barring it behind him. Thoran crouched at the ready and took a single step. A dart flew past his face and the courtiers gasped, then applauded as he dodged it. Taking a deep breath, Thoran stepped forward once more. Spiders lurked in the shadows. The machinery was set. The honour of Humankind was at stake. This then was the Gauntlet of Death -as told in lore and around camp-fires - from which no being had emerged alive. Already Thoran was making plans to survive. .", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126570-gauntlet-of-death\n"}