{"altername_name": [], "name": "Geometric", "overview": "A logic puzzle game by Art Project Studios which was published in Magic Disk 64 1995/05. The year is 2077. A mad scientist has developed a GIGA computer with the help of which he can transform a whole world into the shape of an egg - in a matter of seconds. However, one day the main processor of the computer catches a malicious virus and threatens - completely insecure - to use its terrible abilities. Now of course it is your job to get rid of the viruses as quickly as possible. With four geometric Geo-virostone killers you have to eliminate the stones in the correct order. The Virostones have established themselves on a total of 32 micro-grid centers, each of these centers in turn having eight individual grids. The operation With SPACE or FIRE (joystick in port # 2) you come to the password query. A ten-digit word can now be entered. If the password is not correct, the first step is started. The game is controlled as follows: When SPACE is pressed, you can choose between four different geometric figures. You can then move it to the desired position with the joystick and activate it with FIRE. After all virostones have been removed from a grid, you get to the next level and receive a corresponding password. If you have got yourself into a hopeless situation, just press the \"\" key to repeat the level. But a life is deducted for this. Extras Many gamers love to mess around with computer games. The developer does not want to disappoint anyone, but there is only one way to cheat the game: namely with the password request! Have fun trying out and searching!", "platform": "Commodore 64", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Art Project Studios", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102088-geometric\n"}