{"altername_name": ["Gitty's Dreams II"], "name": "Gitty's Dream II", "overview": "32 stages of platforming fun. A 2D side-scrolling arcade game in which the player controls either Gitty or her sister Maria. The game supports alternating 2 players, with second player taking control of Maria. Each level contains a number of dream crystals which gives points when collected in order to make the game's high score. An extra life can be gained by collecting 100 dream crystals. Extra lives can also be found in the form of hidden \"Lollipop\" items. Enemies can be defeated by jumping on them or shooting them after obtaining the relevant powerups. The enemies include owls, rolling eyeballs, flesh eating fish and deadly insects. The \"Fire Wheel\" transforms Gitty into a punk with the ability to crush rocks by jumping beneath them. \"Lightning Bolt\" will award Gitty \"Dream Bubbles\", a single projectile shot. \"Double Lightning\" gives her ability to shoot recoiling projectiles. \"Strawberries\" gives the ability to shoot homing projectiles. There is one defensive item in the game, the \"Water-Drop\", which protects Gitty against fire. A number of special items can also be triggered that affects the entire screen, such as the \"Clock\" which will freeze all enemies on-screen, and the \"Magic Bombs\" will kill all enemies. These items are found in the item blocks scattered around the stages. There are two types of stages in the game, an \"Overworld\" and \"Underground\" stage. The \"Overworld stages\" feature green scenery and pipe shaped objects, along with bottomless pits for Giana to avoid. The \"Underground\" stages feature additional hazards such as water and fire, as well as bosses. There are in total 32 stages in the game. Hidden \"Warp-Blocks\" can be found to jump through portions of the game.", "platform": "Commodore 64", "release_date": "1989", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Armin Gessert", "publishers": "Public Domain/Freeware", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=XI_zrheGJkc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102465-gittys-dream-ii\n"}