{"altername_name": [], "name": "Guardian (Ahoy!)", "overview": "the year 4025, the star Sol far on the rim of the Milky Way spiral began to pass through a massive gas cloud, dragging the earth and surrounding planets with it. The gas cloud was no natural phenomenon left over from the Big Bang, but the debris and residue of one of the largest intergalactic wars ever fought. The motives and identities of the long-dead civilizations that were involved are forever lost in the miasma of time, but unfortunately the machines they built to wage war for them are still functioning. The other major planets have already been destroyed, and the earth is calculated to be next in line, although earths scientists are not quite sure what is in store for us. Reconaissance has revealed several synthetic moons with trenches running the circumference, ending in colossal pyramids topped with strange power crystals. The scientists know that the moons are in orbit with an artificial gravity well, a \"black hole\" which somehow draws its energy from the power crystal on top of the pyramid. When the crystal lines up with the black hole, anything intersecting the conjunction will be annihilated. Earths terrified masses have taken to calling the crystals \"the eyes of doom.\" Earth's greatest pilots have been scraped together amidst the hysteria to fly a suicide mission across the surface of the moon, through the trench towards the pyramid. Your mission is to destroy the pyramid before the black hole aligns with \"the eye of doom.\" Just before the pyramid releases its deadly blast of energy, our scientists believe a second crystal opens at the base of the pyramid. If you can fire a laser torpedo down this opening they believe the pyramid's power source will be knocked out of commission, and the earth will be saved! In the 3-D game Guardian, you fly a shuttlecraft down a constantly scrolling trench, avoiding or blasting the weird machines that attack you in endless ranks, launched from the pyramid far away on the horizon. The pyramid grows larger as you approach it, while the earth moves across the sky in the background. If you look closely, you may see the \"black hole\" as it approaches from the other side of the screen.", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Cleveland M. Blakemore", "publishers": "Ion International, Inc.", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/103031-guardian-ahoy\n"}