{"altername_name": [], "name": "Guillotine: The Doom Machine", "overview": "Guillotine is a horizontal fast-paced scrolling blaster, written by the web master. It was created using Jon Well's Sideways Scrolling adaptation of the Shoot 'Em Up Construction Kit. The game features two amazing previously released tunes (Title music: Guillotine, In game music: Doom Machine). The front end features additional code, based on the tutorial game Rocket 'n Roll (See SEUCK School).The main idea of this game was based on the music, previously released on Mix Box #10). Guillotine features 3 different levels, with power ups that will enhance the player's shoot ability. The enemy bosses will explode in one go. SEUCK has its own timed feature, but in this game, if the boss explodes before time on a still screen expires. The next level begins. INSTRUCTIONS: You and a friend are pilots of the Interstellar Justice Federation. You have been assigned a very important mission. An alien Emperor has illegally built a Doom Machine, called the Guillotine. Its purpose is to create a dangerous substance and generate a giant atomic explosive device. The alien forces have been capturing and transporting humans from Earth to the planet of Jetan, and took them to the factory and used them on the machine. The Emperor also threatens to wipe out the universe should it wish to. Your mission, should you accept it is to enter the planet Jetan, locate the Guillotine and destroy it. However, you will have to fight the alien ships, since a galactic war has also broken out. There are 3 levels in which you can fight through. They are as follows: - The Jetan caves - The factory construction works - The main entrance to the factory, where you will find the Guillotine. Luckily our dead pilots left out power pods, which can help you through your mission. They are as follows: - Red - Better fire power - Blue - Matter Splatter explosive - Green - Bonus lives Watch out for the bosses at the end of each stage. You'll need a nerve of steel. Can you thwart the evil Emperor, or will the Universe be forever gone? Good luck pilots. You will need it. This game finished third in the 2020 SEUCK Competition.", "platform": "Commodore 64", "release_date": "January 4, 2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Richard Bayliss", "publishers": "The New Dimension (TND)", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=2G3Cl712Olw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136834-guillotine-the-doom-machine\n"}