{"altername_name": [], "name": "Halifax", "overview": "Halifax is a color contact puzzle with pieces based on the binary system created by Onyx Design and published in Magic Disk 64 1991/07. Do you like to play puzzles? No? Then you definitely haven't played HALIFAX! yet. HALIFAX! by Onyx Design is a color contact puzzle in which the aim is to meticulously reproduce a given puzzle image displayed on the screen and to catch as many points as possible. The game, called \"Mastermind 2\" by the programming team, actually does not need an introduction to the game section of the Magic Disc, as you can press the F3 key to call up a short introduction in which the game principle is briefly outlined. Therefore, here are detailed instructions, although I will try to stick to the terms of the original instructions (for the sake of simplicity). As already said, HALIFAX is! a so-called color contact puzzle. In plain language this means that the puzzle pieces do not show flowers or animals, but a very specific subdivision of segments with defined combinations. Each of the square puzzle pieces can be divided by two imaginary lines into four also square sections, which then either have the puzzle piece basic color black or are colored yellow. So there are a total of 16 different ways a puzzle piece can look; each of the four fields can be either black or yellow, regardless of the color of its neighboring fields. Now each piece of the puzzle is assigned a four-digit number, which only consists of ones and / or zeros. The first digit of the number stands for the upper left field, the second for the upper right field, the third for the lower left field and the fourth position of course stands for the lower right field of the puzzle piece. . . . . . ufff. There is a one at the relevant point if the relevant field (or corner) is colored yellow, and there is a zero if the relevant field has remained black. As an example: The number 1000 describes a piece of the puzzle that is yellow in the top left field and black everywhere else. Or a puzzle piece is colored yellow except for the lower left field, then it has the number 1101. All well and good - but what's that supposed to mean? The four-digit numbers are used to assign a kind of play value to the puzzle pieces, which is then reflected in the score. However, the four-digit numbers are not directly included in the score, they are first converted into numerical values from 0-15 for the respective stones according to the binary system.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Onyx Design", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=wKuFtgH7Dlk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/103101-halifax\n"}