{"altername_name": [], "name": "Happy Hacker", "overview": "A single-screen style (not scrolling) platformer created by Gerrit Knoef for one or two simultaneous players and published in Input 64 1987/03. If you like hacking pits for others... ... is definitely a friend of the Happy Hacker. It is well known that malicious joy should be the purest joy, but who is so evil and lets his friends stumble into the self-made trap? But when it comes to monsters, things look very different. This game consists of a total of 40 levels, which are divided into two areas. The first twenty levels can be selected as the LEVEL«- EASY option in the start menu. Beginners should first practice in this position before playing the next 20 levels: these are reached with LEVEL 4-HARD. In order to get from one level to the next, it is important to render harmless all the monsters that are stalking you. First you have to catch a monster by setting a trap for it. Just hack a hole with the pick-axe; now a little patience and waited until a monster is trapped. When the time comes, little remains to be done, and the monster is eliminated. Hurried to the trap and swung the pick-axe! One, two, three — get to the next critter! Of course, the sack of gold is not forgotten, because 500 points are no small matter, but a further rung on the way to the leader board. Experienced monster hunters get a bonus before they go to the next level. However, this is only possible if you don't dawdle beforehand. But you'll soon find out. If there are two players, they can play one after the other or together. The interaction offers the possibility to trick the other players. Simply select COOPERATE «- YES! All other questions are quickly clarified during the first audition.", "platform": "Commodore 64", "release_date": "March 2, 1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Gerrit Knoef", "publishers": "Verlag Heinz Heise GmbH", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=E4P5MMJRdrc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168261-happy-hacker\n"}