{"altername_name": [], "name": "Hazar", "overview": "Friends of the puzzle game, watch out! HAZAR challenges you to a tactical duel in which you have to compete against your computer. Leave happiness at home, because it is of no use to you here! Instead, sophisticated strategies and skillful advance planning are required - prerequisites that make every MANIAC FRED freezing cold, get goose bumps on the arms and quickly run away. For this game you need a lot more than a \"quick thumb\" and a robust joystick! The aim of HAZAR is to enclose the blue discs horizontally, vertically or diagonally from two sides with their own (red) discs. With the glowing cursor, the player drives to the desired field and places a red disc there at the push of a button. All blue (= opposing) targets that are now enclosed between this one and one or more \"old\" targets are then turned over to the red side by the helicopter, and points are awarded for each one won in this way. If the fire button is then pressed again, the computer now executes its move, and the helicopter hovers up again (the thing works tirelessly!) To transform the enclosed red disks into blue as an \"executive organ\". It is important that every move must win at least one disc. However, the computer always thinks for itself and does not even make incorrect moves. If the player is temporarily unable to profitably place a disc, this is indicated at the bottom of the screen. In this case, the computer continues to play on its own until the player has the opportunity to place their own targets again (in such a case, please start the computer's actions again and again by pressing the fire button, as this only ever takes a single move executes and then \"waits\"!). When the field is filled, the winner is whoever has the most discs. If the player has won, he can compete at a higher level with a new and better (computer) opponent. Each level has its own password, so that the player can immediately continue working on the last score achieved by pressing the F5 key in the intro. With the F3 key you can influence the acoustic background of the game. The pause function is activated with the \"P\" key so you when you need to take one, push one. Have fun! Published in Magic Disk 64 1991/03, Abo Disk #4.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Sebastian Broghammer", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104356-hazar\n"}