{"altername_name": ["Advanced Dungeons & Dragons: Hillsfar", "AD&D: Hillsfar", "Advanced Dungeons & Dragons: Forgotten Realms: Hillsfar"], "name": "Hillsfar", "overview": "Play a would-be hero in the city of Hillsfar, where action and adventure await the daring adventurer. Join the local guild and complete missions from the guild master in a quest for glory and gold! Hillsfar is a single-hero role-playing game (in comparison to other Advanced Dungeons & Dragons role-playing games, where the player usually controls a group of characters). A combination of first person perspective (when traveling in the city of Hillsfar) and third person perspective (usually in some action-style mini-quests) viewpoints. As a would-be-hero, four classes are available in a randomly generated mission-based plot: fighter, thief, cleric, or magic-user. Each class to a certain extent, have different assigned quests given by each respective guild. In Hillsfar, gameplay usually consists of various mini-games that are needed to complete the quests or missions provided at the local guild by the guild master. These mini-games (and their viewpoints) include: Fighting in the arena (third person). Competing at the archery range (first person). Exploring buildings or mazes (top-down). Riding a horse outside Hillsfar while avoiding obstacles (third person/side-scrolling). Locking picking doors and chests (first person). Unlike most role-playing games, there aren't any randomly generated monsters to battle. In Hillsfar, combat only occurs in the arena.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Westwood Associates", "publishers": "Strategic Simulations", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.29", "wikipedia": "https://en.wikipedia.org/wiki/Hillsfar", "video_link": "https://www.youtube.com/watch?v=X0Mhv2uvIL8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/86723-hillsfar\n"}