{"altername_name": [], "name": "Ice Palace (K-Tel)", "overview": "The game is divided into three separate stages, each of which features a different style of gameplay. Stage one involves a conveyor belt dropping blocks of ice on to the play-field. The position of the blocks is random, so the player has to avoid the falling blocks whilst using them as a set of steps to reach the other penguin. Pieces of fruit will occasionally fall from the conveyor and these can be collected for bonus points, but you mustn't stand on a block of ice for too long as it will melt, potentially leaving you in a hole that you cannot escape from. You're able to make two super-jumps by pushing up on the joystick, which can get you out of sticky situations, but they must be used sparingly. Stage two sees our love-lorn penguin atop a tower of ice that is just below a platform where the other penguin awaits. To build up the tower, the player must pick up an ice block from either end of the platform and drop it on a truck before it reaches the central column; this is a game all about quick reactions and timing. To complicate matters, fires appear from either side of the screen and these will melt existing blocks in the tower if they are not put out in time. These can be extinguished by dropping ice on them, but you run the risk of missing a truck by doing this. The third and final stage requires you to build a flight of stairs out of ice in order to reach your mate. It took me a while to figure this out, but pressing 'up' on the joystick will assemble a block of ice one square ahead of your position, whilst pushing 'down' will remove it. Fires descend from the roof of the cavern and will melt all blocks of ice it touches, hampering your efforts. The fires can be extinguished by building an ice block on top of the space that the fire currently occupies, but you have to be quick. Just to make matters worse, a levitating snowman located to the left of the screen fires snowballs in your general direction. You can choose to avoid these either by getting out of the way, or by constructing blocks of ice behind you to act as a shield. The game features eight increasing levels of difficulty, which basically makes everything faster. In particular, the speed makes the second stage the toughest since the fires and trucks move so quickly that it becomes almost impossible to time the dropping of the ice blocks correctly. Once you reach the eighth level, the game simply loops and there doesn't appear to be an ending.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Interplay Productions", "publishers": "K-Tel Software", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=RsROgK4Lqwk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/105983-ice-palace-k-tel\n"}