{"altername_name": ["IK Ultimate"], "name": "International Karate Ultimate", "overview": "Originally released at Melbourne's Demo Party: Syntax '17 by JonEgg. This updated version of the classic martial arts fighting game is a 30th anniversary homage to the Archer MacLean classic. It comes with new backdrops like Ayers Rock and Syntax dojo as well as 17 hidden areas. A remix of the original Ron Hubbard music by Geir Tjelta. Also added are some excellent training modes, one of which sees a modification which was added to one of the IK+ cracks a while ago, where you can fight 2 players, without the round resetting, and play for a high score. You can't get better than a \"first to 1 million\" bout against a friend. You can also change the player colours, starting belts, deactivate the mini games or add hotkeys to skip levels and add points. 2 Player Unlimited Mode: Probably the best feature of IK Ultimate, you can now play 2 players without rounds resetting. This leads to epic 2 player bouts! Infinite Time Trainer: Remove the time limit from single player rounds. 2 Player Handicap Trainer: Select 0 for no handicap, or any number up to 5. Selecting a number will give Player 1 a head start in the 2 player bouts, 5 being the hardest for Player 2, allowing Player 1 to win with 1 successful point in a bout. Starting Belt: Give yourself more of a challenge in the 1 player game, by starting at a higher belt colour. Suppress Mini Games: Prefer the fighting? Simply remove 1 or both of the mini games. Player 1/2 Colour: Choose from 16 colours for each of the players, including pink, which makes you look like you're fighting with no clothes on. Game Speed: Turbo charged games are officially awesome!", "platform": "Commodore 64", "release_date": "December 5, 2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "JonEgg", "publishers": "Public Domain/Freeware", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=uufCZf2mBTI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157044-international-karate-ultimate\n"}