{"altername_name": ["Killer Bees!"], "name": "Killer Bees", "overview": "The Beebots from the insect civilization of BEM are invading the Earth, protected by swarms of Killer Bees, and it's up to a swarm of white bees to stop them. The player control the white bees swarm, trying to kill the Beebots by flying over them and stinging them. The longer the swarm flies over a Beebot, the slower it moves, until it finally stops and dies. When a Beebot dies, a grave marker will be raised in its place, making the movement of the remaining Beebots more difficult. The red Beebots move clockwise, the blue ones move counterclockwise. The Beebots are protected by swarms of Killer Bees. If a swarm of Killer Bees attacks the player's swarm, it will lose its bees gradually, until none are left and the game is over. The longer the Killer Bees stay on screen, the stronger they get. They'll change their colors gradually, from green (the less harmful) to blue and then finally to red (the most dangerous). The only defense the player has against the Killer Bees is the bug-zapping RoSHa Ray, released by pressing the action button. It is recharged each time a Beebot is killed, and it follows the white bees swarm vertical movement. Once all Beebots are killed, the round ends, and a new one starts with a new level of difficulty. There are 26 difficulty levels. The player scores one point per sting, ten points per zapped swarm and 100 points per Beebot killed. At the end of each round, a bonus is also given, consisting in ten points per each survivor bee, multiplied by the number of the round.", "platform": "Commodore 64", "release_date": "2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Digital Monastery", "publishers": "Public Domain/Freeware", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Sa6FClBklbg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157291-killer-bees\n"}