{"altername_name": [], "name": "La Sala Degli Enigmi", "overview": "La Sala Degli Enigmi is a 1985 Italian language miscellaneous genre game, including a shoot em up for the Commodore 64. The coder is unknown. It was published in Videoteca Computer #09. The game is keyboard control only. THE ROOM OF PUZZLES: You have finally arrived at the conclusion of the trio of games useful for saving the princess: what a struggle to be a hero! To conclude your mission which has gradually become more daring, you just have to pass the last tests. A good rider must undoubtedly possess three essential requirement: have excellent aim, exhibit exceptional reflexes, and of course have some luck! Here is the first test: La Mira:Hit the ghostly figures that appear with the magic stars. The movements you have available are governed by the following keys: Z M which allows you to move to the left which allows you to move to the right BAR/SPACE to shootBe careful because to obtain the information you are interested in you must be able, as always, to pass the test more than brilliantly. Second test: THE REFLECTIONS:Evil spirits of an ancient warrior, of the magician and of the ever-present ghost of the castle, appear evanescent and very rapid in the room of puzzles: you have to identify them and, precisely with quick reflexes, fix them on the screen by pressing the relative keys: M for the wizard, F for ghost and G for warrior. It must be admitted that it is not easy at all, but after all being heroes is not a trivial matter. If you overcome even this difficult undertaking, all you have to do is give \"checkmate\" also to... FATE: following the instructions you will have to beat your enemy by contrasting the ghostly figures that he summons to destroy you with the right counterpart. Be careful because in order not to start over you will have to be exceptionally fast. Finally, if you heroically win, don't think it's over: you can use your ingenuity to solve the mystery and finally receive the dazzling image of the castle you won at a great price. Well admit it, wasn't it worth it?", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Edizione Logica 2000", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168106-la-sala-degli-enigmi\n"}