{"altername_name": [], "name": "Lady Bug", "overview": "Ladybug is a C64 conversion of the maze game \"Lady Bug\" which was brought into the arcade halls by the company UNIVERSAL in 1981 and which was one of the successful followers of the famous Pac-Man. The aim of the game is to \"eat\" all the flowers (points) and the bonus flower with the pawn, a ladybug (or ladybird), and reach as many points as possible. You start the game with three bugs (lives). The pawn is disturbed in its task by four hostile insects that emerge one after the other from their nest in the centre of the maze. Their speed rises in the course of the game. When the last insect has left its nest, a vegetable appears in the middle of the maze which gives bonus points when it is collected. In the maze next to the normal flowers also several bonus flowers with letters and hearts are scattered. You get an extra life or 10.000 bonus points when you make it to put together the words „EXTRA“ or „SPECIAL“. If you eat a flower with a heart, a multiplicator is switched on that doubles all other points that come after that, the second heart triples them and the third even quintuples them. The game has another special feature which differentiates from the known Pac-Man: these are 20 green revolving doors with which Ladybug can changed the maze. The \"evil one's\" cannot turn the doors. The skillful turning of the doors is the only possibility for Ladybug to escape the followers; because the bug's speed stays the same in all levels, while the speed for the enemies rises. You should close the doors quickly when you are chased by a follower; if it comes too close to Ladybug, the turning door will not have any use: The \"evil guy\" will also slip through and get the Lady. The skulls that are on the field mean death to the Ladybug and also for its opponents. The player loses a life (one ladybug) when running into a skull. The other insects are transported back to their nest in the centre and get into the game when the timer has run down again. The timer is an interrupted white stripe that runs around the game area. When the lady bug has entered the maze, the single elements of this stripe change their colour in clockwise order: they get green starting at the top. When all elements of the stripe are green, the first opponent leaves its nest and the next round starts; all elements get white again one after the other. The speed of the timer rises with rising levels. Source: https://www.c64-wiki.com/wiki/Ladybug", "platform": "Commodore 64", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369521-lady-bug\n"}