{"altername_name": ["Latent"], "name": "Latent Fusion", "overview": "Published in Magic Disk 64 1995/02. This Armalyte clone H-Scrolling space-shooter is pretty well done. As a punishment for all your misdeeds, you should now sit in your spaceship as a punishment and into the depths of the Hell be thrown down. You swallow hard but the old man's judgment could not be shaken. The guards grab you, and have loaded you into a small, trusty spacecraft and find yourself catapulted into the middle of the worst purgatory. \"Four\", the great devil signals to you when you have passed the gate to the underworld, \"four levels!\" And out of sheer malicious joy he rammed his pointed trident into your bottom. Four levels, four bosses. In order to advance one level of the game or to reach the goal, all four must be dumped. For a laser volley, the fire button must be held down until the display at the bottom of the screen has fully charged (it then starts to flash). If you then let go of the fire button, the laser beam is fired. When eradicating the opposing rows on the opposite side, a bonus particle occasionally falls off, which the player should collect with his space shuttle. By shooting the bonus field several times, various bonus options are activated. One can thus among other things. Acquire a protective shield, reinforced weapons, guns above and below, a rear laser, etc. It is well known that a cat has several lives, in this particular case you have ten to start with. If the above story is too unimaginative, too crazy, too emotional or whatever, you will find an alternative framework in the Game intro. And now have fun!", "platform": "Commodore 64", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Direct Designs", "publishers": "CP Verlag", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=atmo0zDio50", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109369-latent-fusion\n"}