{"altername_name": ["Let's Invade II"], "name": "Let's Invade 2", "overview": "After the success of \"Let's Invade\" back in 2016. The New Dimension strikes back to bring a sequel to its predecessor. \"Let's Invade 2\". A game, which has been specially produced for the RGCD 16KB Cartridge Game competition 2019. - A bonus digital Disk + Tape version is also to be released on the same date. This is a Space Invaders style game, featuring 40 levels inside a 4 way scrolling void. Also featuring SID melodic trance music all the way through. Unless of course you choose in game sound effects instead - which the background flashes to the alien movement (unless disabled). This game also features random power ups where either the player, or the aliens take advantage. Some power ups can be helpful to the player, but some can also be pretty much cruel. Just watch out for the all new bullet shower and alien shield. There's also the brand new feature close encounter, in which can be quite rewarding. THE STORY Back in 2116, planet Earth fought against a massive elite of alien invaders and the planet was saved. Unfortunately however, the alien mother ship managed to escape. There was no trace of it for a very long time. Fast forward to 2 and a half years later, the mother ship returns and the aliens are back, this time in a different form. They are even tougher than ever, with more powerful bombs. Earth has also been thrown into a giant void once again. The planet is in turmoil. Fleets of Invaders start screaming down towards the Earth's surface... - But their movement behavior is different. They are Ready to wipe out all life on Planet Earth, so that they can make the planet their new home. Only one tough warrior can attempt to save the planet... and that is YOU! HEALTH AND SAFETY NOTICE LET'S INVADE 2 consists of in game flashing/strobe effects, to fit with the in game trance music, sound effects and psychedelic nature of this game. This effect may be unsuitable for some gamers. If you are too sensitive to strobe flashing, or suffer from a condition such as epilepsy. Select the option to switch off the flashing effects before playing the game. Or avoid playing this game. Also, to make viewing of the video. The video featured linked to this page doesn't feature the trance flashing effects during game play. Please also note that: Loading picture is NOT included in 16KB cartridge release. Programming, Graphics, Loading picture, Documentation, Sound Effects and music by Richard Bayliss Original 16KB cartridge framework by Enthusi IRQ Tape Loader system by Martin Piper", "platform": "Commodore 64", "release_date": "2019", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Richard Bayliss", "publishers": "The New Dimension (TND)", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=u3aSpE6sCV4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117015-lets-invade-2\n"}