{"altername_name": [], "name": "Life (Creative Computing)", "overview": "Published in the type-in book, \"BASIC Computer Games - Microcomputer Edition\". The game of Life was originally described in Scientific American magazine, October, 1970. The computerized version of LIFE can be found on many computer systems--in many cases with Teletype print routines. This version allows initial patterns to be composed directly on-screen and instant visualization of each generation as it is created. In addition,patterns may be stored and recalled from seven memory pattern registers. The generation speed may be controlled from the console. A.Genetic Rules Cells (organisms, ducks, people, plants, etc.) reproduce, exist or die according to certain genetic laws. Conway derived the genetic law of the game of LIFE from the following criteria:1. There should be no initial patterns for which there is a simple proof that the population can grow without limit.2. There should be initial patterns that apparently do grow without limit.3. There should be simple initial patterns that grow and change for a considerable period of time before coming to an end in one of three possible ways: a. fading away completely (no life) b. becoming stable (no change in pattern or population) c. a pattern oscillates in an endless cycle of two or more periods. Think of each cell as being a square of a checkerboard. A celI may be either empty (shownas a space [no *] on the screen and in the following examples) or living (shown as an * bothon the screen and in the examples). In the following examples, a '+' indicates an empty cell which is becoming a living cell.", "platform": "Commodore 64", "release_date": "1978", "game_type": "Released", "esrb": "Not Rated", "developers": "Clark Baker", "publishers": "Creative Computing Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/121532-life-creative-computing\n"}