{"altername_name": [], "name": "Lincoln", "overview": "When the war ended, humanity agreed that as long as it ruled itself, there would be new wars and the idea of eternal peace throughout the universe would remain a dream. \"Lincoln\" was the name of the computer that was to rule mankind from then on. A machine has no feelings and therefore no desire for power, that was the idea that motivated mankind to use this computer as a ruler. However, a clever designer's plan was to use his own brain as a processor on the computer to gain power over the entire universe. Lincoln did his job for years, and everyone believed that there would be no more wars under his government. One day when Lincoln knew that people trusted him fully, his brain came to life. His home planet became a fortress and people his slaves. After a few years, no one was allowed to enter a planet in their solar system unless they made a sacrifice. These victims consisted of living women who were placed in dungeons in their forbidden planet, waiting to be sacrificed. The plan You are the leader of a 90-man rebel unit dedicated to defeating Lincoln. To do this, they brought your men to the planet Ganama 4, from which you can go indirectly to all planets of the forbidden solar system on Lincoln's home planet. For this purpose, the men are in the so-called \"speed gnats\", in small docking capsules that cannot be seen by any radar. The speed gnats can be docked while space dreamers are waiting for their permission to start. With the space transporters, the men each travel one planet further towards the forbidden planet. Even before the last female transport has reached the forbidden planet, the speed gnats must be in the atmosphere, since the planet will then be surrounded by a protective shield. The landing site closest to Lincoln is guarded by some vehicles and equipment that a sniper already placed on the forbidden planet will try to take out so that the Speed Gnats can land. The defense vehicles are unmanned and are almost unlimited. There are space scooters behind the landing field, with which the men can fly to the city. At the same time, another group with watercraft has to penetrate the cave system protected by technical security measures, where the next woman victim is waiting. The “tripsies” live at the place of the three gates behind which the women are. A tripsi is a wooden being who can open the gates with his flute playing. If you control a Tripsy, you can free the women. Meanwhile, the other group will try to break into the city. To do this, you have to take one of your men over the city using a hot air balloon. There he can parachute to the landing site in the city. The man will fly the surface of the city with a space scooter until he finds the location of Lincoln. The computer has three internal inputs through which the woman victims are brought to it. If you manage to inject nine computer viruses through the entrances, you will have done it: Lincoln has been destroyed! Game 1 - The way to the forbidden planet The ten speed gnats are located on the planet Ganama 4. If you place the cursor on a planet, it shows how many speed gnats are on the planet. If a planet is marked with a cross, a space transporter waits for its launch permit. Move the joystick to the planet where you want to dock next. Hold the fire button down while a spacecraft is waiting to be launched. Game is successfully completed when at least one speed gnat has reached the forbidden planet before the female transporter arrives. Game 2 - landing on the forbidden planet The speed gnats must be protected from the security systems. From the point of view of the sniper, you can shoot down the unmanned systems so that the speed gnats can land safely. Make sure you always shoot down the systems whose shot will hit the Speed Gnat as the next test. If game 2 is successfully completed, 9 men are available for game 3 per speed gnat. Game 3 - The way to the forbidden city and the way to the place of the three gates Control the space scooter in the upper part of the picture and the watercraft below. With the joystick movement up / down you can avoid the prehistoric birds with the space scooter, with the joystick movement left / right you avoid the electrical systems in the cave system. Game 4 - The place of the three goals There are two women behind each goal. Game 4 has ended successfully when all three goals have been opened. Catch one of the tripsies using an echo sounder (fire button) when it catches your breath. If you have brought a trip into your power, you must try to crack the code of the respective gate with its flute game. Every wrong tone triggers a death mechanism, every right tone opens the gate further. Dodge the guns should you have played the wrong note. Warning: the third gate always has the same code as the first. Game 5 - Balloon Flight into the City Control the balloon so that it does not hit missiles or UFOs. Press the fire button to give the balloon a boost. If the balloon is not hit, it will shatter at the latest at the end of the atmosphere. As soon as the balloon is destroyed, the skydiver can try to reach the landing site in the city. Again, it may not be launched by the missiles. Three balloons are available. Game 6 - Finding Lincoln With a space scooter from the city you fly over the roofs until Lincoln is found. You may not collide with another space scooter, nor be shot by police scooters. If you have successfully overcome the path, you can destroy Lincoln. Game 7 - The Destruction of Lincoln You did it! It is only a matter of time before you have infiltrated all 9 computer viruses into the computer. Lincoln has three hardware inputs and four ground lines. However, its hardware structure is constantly changing. Introduce the viruses so that they get directly into the computer system. Hiscore list", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Andreas Mettler", "publishers": "Multisoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=n46pKUjAaFk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118827-lincoln\n"}