{"altername_name": ["Little Nippers: The Deluxe Edition"], "name": "Little Nippers DX", "overview": "This is a deluxe edition of the single button game Little Nippers, which is bigger than the 4K version. The 4K version of this game was originally submitted for the 2022 4K Craptastic Game development competition run by Reset Magazine and Austrogamer. This is a brand new deluxe version of this game, submitted for the Zzap! 64 Micro Action magazine issue 9's cover mount. Little Nippers Deluxe consists of the following new features (not featured in the original 4K compo entry): - Loading bitmap - Colourful front end presentation - Hi score table - Nice summery tunes - 5 different seaside locations, based on skill level - Bonus incentives (Higher skill level, less crabs - more points) - Compatible with theC64 mini , theC64, theVIC20 (in c64 mode) full size computer - Compatible with both PAL and NTSC, although best played on PAL The story: It is Summer time. On the previous day it was a beautiful day for beach-goers, who were swimming in the sea, bathing in the glorious sunshine. That was until it started raining. Everybody had to run for cover, their excuse – they didn't want to get wet. Even the people who were bathing in the sea ran off. A large family of children left 8 buckets on the beach which eventually gets occupied by red migrating crabs. The migrating crabs were sleeping in the buckets for the night. The next day was a glorious day, with a long-term forecast that it will be sunny all this week. The sleeping crabs get a rude disturbance by a stampede of running kids. This has made the crabs more grumpy and want their revenge on the pesky kids, so they have called on “The Lord of the Crabs”, which of course is you. Instructions: This is a funny hi-score attack challenge, which features 8 levels to complete, and 5 skill levels to select from. On the title game options screen, select the skill level to start, and then start the game. The game skill level options are as follows: - Skill level 1 = 20 crabs + no bonus per successful nip - Skill level 2 = 15 crabs + 2 x score bonus per successful nip - Skill level 3 = 10 crabs + 3 x score bonus per successful nip - Skill level 4 = 5 crabs + 4 x score bonus per successful nip - Skill level 5 = 1 crab + 5 x score bonus per successful nip The higher the level, the less bonus points you will get on level completion, due to the limited number of crabs which you have. How to play: You have eight buckets lying in line on the beach. There are kids running across the beach at varied speed (depending on the level which you are on). The idea of this game is to use the fire button or the space bar key to launch a crab out of the bucket and move towards its target and nip the kids' feet. You will have 10 seconds (which will show on the bucket) to respond, otherwise as a penalty a cross will appear on the bucket and the crab or jellyfish will automatically leave the bucket and go straight into the water without nipping a runner. You cannot launch another crab out of the bucket until either the crab has nipped a runner or the crab has entered the deep area of the sea. If the crab enters the deep area of the sea, you will lose a crab (the crabs left is your lives counter). No crabs are lost if it successfully nips an enemy, or a successful sting by the jellyfish. You will get all of your crabs back after you complete a level. Scoring and completing a level: Scoring points is based on every successful nip your crab makes after you have successfully launched it. The score achieved is based on the distance in which your crab travels. The further the distance (closer to the sea) the more you points you will game. The distance scoring are as follows: - Close to the sea: 500 points - A little further away from the sea, 300 points - Further away from the sea 200 points - Close to the buckets 100 points You will also have a set target number of kids in which you need to nip before you successfully complete a level. Bonuses and surprises: Bonus points can be scored on level completion. The amount of crabs you have left at your disposal are counted down, and 1000 points for each crab will be added to your score. There's also a surprise in store during game play. A little reward in fact. If your score panel reaches every 10,000 points, you will also get to fling a jellyfish to sting the running kids for double points as your next move, but of course the same rules and penalties apply. So no slacking!!! Winning the game: In order to win the game, you must complete all 8 levels. However, after all 8 levels have been completed, you will start the game again on a higher skill level until you have reached skill level 5– should you wish to. Otherwise the game is over. Losing the game: The game is over when all of your crabs (including jellyfish) have fallen into the deep area of the sea (Crab count = 00). Controls: Use joystick in either port, or keys: (1 (up) ← (down), space (fire)). Credits: Programming, sound effects, text font and music by Richard Bayliss In game graphics and loading bitmap by Hugues (Ax!s) Poisseroux Tape loader system with RLE (de) compression by: Martin Piper Copyright © 2022 The New Dimension First released by Zzap! 64 Micro Action Magazine", "platform": "Commodore 64", "release_date": "September 1, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Hugues Poisseroux", "publishers": "itch.io", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=EB-XBl9eQm8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160232-little-nippers-dx\n"}