{"altername_name": [], "name": "Magazine", "overview": "A logical brain game published in Magic Disk 64 1995/08. Bruno is a warehouse worker at CP-Verlag. His working day is long and arduous, his wages and remuneration, like that of the editors, meager and small. Bruno's job is to bring the heavy pallets with the recorded Magic Disks to the freight elevator. However, since the data carriers are just stuffed full of cool games and programs, Bruno can only push them forward, but not pull or even lift. This is a real problem. You now have the unique opportunity to slip into the role of Bruno and to do his heavy day's work completely free of charge, on a voluntary basis and above all for nothing (and someone else said that we wouldn't offer our readers anything!). But be careful: first think, then press! Bruno is controlled with a joystick in port 2. If you want to push a box, then you have to keep the fire button pressed and steer it in the appropriate direction. As it will happen sooner or later (at the latest in the second level) that you have played yourself into a dead end, then you can throw the symbolic towel in exasperation by pressing the space bar, deducting a life and then you may attack the level again from the beginning. In order to make the work in the stuffy disk warehouse really uncomfortable, Bruno also has to fight against a merciless time limit. The clock is running visible to the player and when it has expired before Bruno has heaved all the boxes into the elevator, the angry foreman rushes over immediately with the hippopotamus whip. Out of consideration for our younger players (and the federal testing agency for extremely violent games) we left this sequence and the subsequent punitive action hidden. Note anyway: dawdling is not!! (= at Game Over) Bruno still has the opportunity to immortalize himself with the employees of the month. You can also hide the music in the main menu or return to an earlier save by entering a code word. To do this, simply steer Bruno around as usual and push a crate onto the desired option. After this game, think twice about whether you really want to contact CP Verlag for holiday work in August...", "platform": "Commodore 64", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Szymon Krawczyk (TOYA)", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=LDEPrpoplWU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130079-magazine\n"}