{"altername_name": ["Magic Poker"], "name": "Magic Poker 64", "overview": "A Poker style game published in Magic Disk 64 1989/10. Wild West atmosphere, it's noon. Everything pushes from the dusty street into the saloon to have a cool drink in the hot temperatures. In the saloon, however, the atmosphere is more than tense: four men are sitting at a corner table, immersed in the cards they are holding in their hands. The motto is \"poker\", and in the middle of the table there is already a considerable pile green banknotes. The mood turns icy when the four men at the table pick up the playing cards and sort them in their hands. No sound can be heard in the saloon, it is dead quiet. The four players attract everyone's attention, and everyone feels that there is something in the air. \"I'll raise it by 50,\" grumbles the tall man with the scarred face and slides a corresponding note across the table. \"Go with me and want to see \", his counterpart replies. The cards are turned over and lo and behold: both the scarred face and his opponent each hold four aces! ! The two opponents get up slowly, always keeping an eye on the other. Chairs are knocked over and those present hold their breath in tension. \"You messed up, cheater!\" Yells the scarred face, \"and you will pay for it!\" . In the same second the two cowboys hold two revolvers in their hands. Shots are fired, lead hisses through the air, and the smoke from the pistols drifts across the room. Covered in blood, the cheater drops the pistol and sinks to the floor with a contorted face. But the scarred face was also fatally hit. Before he goes to hades, he stammers one last sentence: \"If only I had invested the 9 .80 DM in a new Magic Disk...!\" . The bystanders just shake their heads uncomprehendingly at this sentence and turn back to their drinks. The computer gives you 5 cards and at the same time shows you all the winning opportunities in a box in the top right corner. With the keys 1 to 5 you can now turn over the \"superfluous\" cards and thus release them for exchange. If you have particularly good cards in your hand, you can double your stake with SPACE (as long as you do not exceed the number 5!). The second drawing is also started with RETURN . If you have won, you can RISK the number of points you have won.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Th. Omilian", "publishers": "CP Verlag", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/121699-magic-poker-64\n"}