{"altername_name": [], "name": "Mike Mech", "overview": "Note: This game works perfectly on both PAL and NTSC models. However, the game was developed and tested on an NTSC model, so it is suggested using the latter. Gameplay: The game is set inside a spaceship invaded by alien entities that have deactivated the supply batteries necessary for the propulsion of the rockets. The aim is to guide Mike, the mechanic on board, inside the various power rooms and reactivate the batteries. To activate a battery, the player simply has to touch it on one of the four sides. The player has the option of moving around the rooms by jumping from battery to battery or by using elevators that move vertically or horizontally. Sometimes there are portals through which the player can teleport to another point in the room. Mike has no defense against aliens. The only way to complete a level is therefore to avoid them not to lose a life. Even the contact with the cooling fans, present in some rooms, is fatal. To complicate matters there is a time limit, beyond which the player will lose a life. After activating a certain number of batteries, a crystal will appear for approximately 10 seconds. The player can try to pick it up to increase the score. Once all the batteries in a room have been activated, the player will earn an extra score based on the amount of time left and will go to the next level. Every 10000 points the player earns an extra life, for a maximum of 8 lives. Options: The game includes 70 levels in total. By choosing Ship Layout A, you will play the easiest 35 levels. By choosing Layout B, you will play the 35 most difficult levels. By choosing Layout A+B, you will play all 70 levels. Controls: Joystick left/right = Move Mike Fire button = Jump Joystick down = Teleport While playing, press F7 to pause or F1 to stop the game and go back to the title. While the best scores are showing, press F1 to reset the ranking.", "platform": "Commodore 64", "release_date": "August 10, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Haplo", "publishers": "itch.io", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168931-mike-mech\n"}