{"altername_name": [], "name": "Missione H", "overview": "An Italian language vertically-scrolling shooter based on Moon Cresta published in Linguaggio Macchina C64/ZX n.10 (Ottobre 1985). You can never be calm! Here, immediately after the signing of the intergalactic peace treaty, the rebels, who we believed by now subject, organized themselves to regain the upper hand over the galaxy. You had already parked your spaceship in the hangar, the agency had found you a holiday home on Mars and you thought you could finally enjoy a period of well-deserved rest but, now, you find yourself forced to take off to this new mission. It seems that at the Base they do it on purpose: as soon as you organize your holidays, they call you immediately for a new task! But by now you know that this is your destiny and you cannot change it. So put aside your thoughts and assumptions and... go. Your powerful and sophisticated spaceship is made up of three ships that you can only use once. If you manage to pass the fourth game screen with the first and second, the three spaceships will \"assemble\" and you will be able to fight with a supercharged spaceship of the highest level and almost indestructible. Shoot the enemies with extreme precision, remember that if you don't hit their spaceships perfectly in the center, they will continue to fight and bomb you even if half disintegrated. A good game strategy may be to position yourself sideways on the screen at the start of the first massive attack by the enemy fleets to avoid being surrounded by the attackers. After this first attack you will be able to return to a central defense position. Watch out for phantom enemies that \"take shape\" when they're too close to you to dodge! Good luck... Mission H!", "platform": "Commodore 64", "release_date": "October 1, 1985", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Edizioni Foglia", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122531-missione-h\n"}