{"altername_name": [], "name": "Missile Command (CP Verlag)", "overview": "A Missile-Command clone game created by Jürgen Weiland and published in Magic Disk 64 1990/11. In this variation as well as defending against incoming ICBMs you need to defend the planet from the Romulan Warbirds and other alien ships. As fascinating as the game is, its instructions are simple. There are no cumbersome controls and no superfluous displays, and there is no great storyline either. Since CP-Verlag does not concern me with doing nothing, I will tell you a little bit more about MISSILE-COMMAND. In the distant future: The extraterrestrials (who else?! In this regard It seems that from the year 2000 a lot is coming towards us earth dwellers...!) one is planning more of an attack on our good old earth. This time our friends have come up with something very special: We are being irradiated! Contrary to their usual practice, this time we don't have to shoot our way through countless waves of attack and bomber formations and - instead, stop the rays that are inexorably moving towards our mother planet with a gigantic rocket launcher. In any case, it is important to prevent a jet from falling directly on one of the six cities and dissolving them into dust and rubble. It is therefore a matter of firing a rocket into orbit the descending rays. If the rocket explodes a little in front of the beam, the resulting short-term protective screen absorbs the attacker and thus renders him harmless. When all cities are hit and destroyed, the battle is lost! Every now and then ships of the aliens cross the screen at great heights. If your hands are full, you might want to remember them and send them a missile or two. This not only has a positive effect on your points account, but also testifies to the great, unselfish commitment of your fellow players!", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Jüggisoft", "publishers": "CP Verlag", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KkHW5ErnZrk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122449-missile-command-cp-verlag\n"}