{"altername_name": [], "name": "Miss Milligan", "overview": "Miss Milligan is a patience game which is played using two decks of playing cards. According to Peter Arnold, author of Card Games for One, this classic game's enduring popularity is in part due to its amazing tendency to enable complete recovery from seemingly hopeless positions. Rules: First, eight cards are dealt in a row; they are bases for eight columns in the game. Any ace that becomes available is put onto the foundations, to be built up by suit. Other cards are built down by alternating color. One card can be moved at a time, although a sequence can also be moved in part or in whole as one unit. When an empty column occurs, only a King or a sequence starting with a King can be placed on it. When no more moves can be made, a new set of eight cards is dealt, each for every column, whether full or empty. Then the game resumes until all possible moves are exhausted, after which a new set of eight cards is placed. This cycle of dealing new cards and making moves continues until the stock is exhausted. After the stock has run out, there is no redeal. However, there is special move called either \"waiving\" or \"weaving\". The player can pick up a card or a sequence of cards and set it aside (this is the dominant rule; some rule sets state that only one card can be picked up). The card or sequence can later be placed back on to the tableau at any time as long as it can be built legally. Only one card or sequence of cards can be set aside at a time. Computerized solitaire applications that feature this game include a reserve cell for this purpose. The game ends when no more useful moves can be made. The game is won if all cards are built onto the foundations. The C64 version was written by Maurice Jones and published by J & F Publishing in Loadstar #167 in 1998.", "platform": "Commodore 64", "release_date": "1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Maurice Jones", "publishers": "J & F Publishing, Inc.", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137591-miss-milligan\n"}