{"altername_name": [], "name": "Mission Egg", "overview": "A whimsical, ova themed collect'em up game published in Magic Disk 64 1988/06. It's the year 2020. After a nuclear war, the earth was devastated. But the surviving people have already adjusted to their new way of life. Actually, life goes on just as it did 33 years ago, but there are exceptions. There are z. B. Giant chickens, which of course also lay giant eggs. The giant chickens just don't want to hatch their own eggs themselves. As a chicken farmer, you only have one option: You have to take matters into your own hands. Fortunately, in this warm climate, which prevails all over the world, a small step (FIRE BUTTON) is enough for you to go against the giant eggs to bring the chicks to hatch. However, these actions are not entirely safe, especially since there are radiation-contaminated clouds everywhere, which our chicken farmer PIT has to cleverly avoid. Any contact with the shadow of the clouds and the clouds themselves means death for PIT. Only the cloud that PIT constantly chases is harmless. Because this cloud is enriched with cosmic rays and only leads to a small change of location. Fortunately, PIT can jump too. After pressing the SPACE key, PIT can break free from any predicament with one jump. But there the jumps at them are limited to each level, you should divide the jumps well. The aim of the game is to free all chicks from their eggs and then to kick them off the screen with one last kick. If the chick and cloud collide while being ejected, the radioactive force of the cloud is discharged and the chick explodes. Since this effect also earns points and can also destroy dicey clouds that have come close, you should make use of this effect. In all the pictures there are small coins that can be picked up when PIT approaches them horizontally. These coins give bonus points when you reach a new level. Have fun!", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Jörg Sieslack", "publishers": "CP Verlag", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122448-mission-egg\n"}