{"altername_name": [], "name": "Mono", "overview": "Mono is a vertically scrolling shoot ’em up that features a couple of fairly unique and pretty important gameplay elements that set it apart from similar games. Firstly your ship wraps around the edges of the screen. Move off the left side of the screen and you’ll reappear over on the right. Move off the top or bottom of the screen and you’ll reappear at the opposite end. Once you get used to this it’s actually a great gameplay enhancement and one that becomes essential with some of the bosses you’ll encounter later in the game. However it does take a few minutes to get used to and led to me dying on my first play-though. I kept accidentally moving off the bottom of the screen straight into the aliens spawning at the top! The second unique feature is that your score and your ships life are one and the same. As you play you’ll notice a series of positive and negative numbers scrolling down the side of the screen. Kill an alien and a positive number will appear. Take a hit and a negative will appear instead. So long as you do more killing than getting hit you’ll be fine. However take too many hits and your score dwindles to zero leading to a ‘game over’. Like many shoot ’em ups there are weapon power-ups to be had, but again these are linked to your score. Score well and power-ups will appear on screen for you to collect. However take some hits and you will lose your last power-up until you are back down to your standard issue guns. As soon as you start building that score back up the power-ups will start flowing again. Only runs on PAL machines, so if you want to run the game in NTSC regions, you have to run your emulator in PAL mode.", "platform": "Commodore 64", "release_date": "2018", "game_type": "Released", "esrb": "Not Rated", "developers": "Raphael Graf", "publishers": "clay.ch", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=rVRkzRmC350", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118423-mono\n"}