{"altername_name": [], "name": "Moojub", "overview": "Moojub is a solitaire card game which is played using one deck of playing cards. Invented by Geoffrey Mott-Smith and Albert H. Morehead and included in their book The Complete Book of Solitaire and Patience Games, it has been included in some solitaire computer packages such as Solitaires, Solitude, and TDC Games Suite. It is also one of the easier games to win: a player can win half of his games. To start, four cards are dealt in a column, forming a reserve. To form the first foundation column, the player has to pick out the card with the lowest value (aces are ranked low in this case). Then the card with the next lowest value in a different suit is placed under the first card, below that a card of a third, and a card of a fourth suit, forming the first foundation column with each card the lowest one in each suit at the time. The order of suits in the first foundation column determines the order of suits in the other columns. The foundations are built up by suit; they are also round-the-corner, i.e. an ace can be place on a king; in turn a two can be played on the ace. Cards are then dealt continuously in batches of four, one on each reserve pile. If a card can be built on a foundation, it must be built. However, if the card can't be built, the player can use it as a base for a new foundation pile, provided that: Each foundation column must contain all suits before a new one is formed. It should also be put in order from top to bottom, Each new foundation card should be of the same suit as its left-hand neighbor, and If there are at least two cards of the same suit that are available as bases, the lower-ranked one is taken. The reserve is only ever filled by the subsequent dealing of cards. The game is won when the stock is exhausted and all cards are in the foundation columns. The C64 version was developed by Maurice Jones and published by J & F Publishing, Inc. in Loadstar #173", "platform": "Commodore 64", "release_date": "1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Maurice Jones", "publishers": "J & F Publishing", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119051-moojub\n"}