{"altername_name": ["Mision X"], "name": "Moon Cresta", "overview": "This is a licensed conversion of the 1980 Nichibutsu Arcade game. The player has 3 stages of a ship with which to defeat 10 waves of aliens. You start with the first stage of the ship which is small and can only shoot 1 laser cannon. The second and third stage of the ship each have 2 laser cannons but increase in size making them easier to hit. If your ship is destroyed, you move onto the next stage of the ship until you have no stages remaining. The first two waves of aliens is made up of 4 eye shaped creatures which split into a smaller half sized creature when hit. The creatures dive at your ship and a collision will result in the destruction of the stage you are using. If you survive these stages, you get two more stages with insect style creatures that attack you in formation. If you reach the end of the 4th wave with at least 2 stages remaining, you get a bonus stage that allows you to try and dock 2 stages of your ship. The smallest remaining stage of your ship raises up and you must then control its descent, firing a thruster if required, in order to land on the next largest stage of your ship. Succeed and you will the game with the combined stages giving you enhanced fire power. Fail and one of the stages will be destroyed. The 5th and 6th waves consist of bird-like creatures that dive at you. Waves 7 and 8 consist of a pair of fireballs that fly at high speed diagonally down the screen. This is the only wave that doesn't require all aliens to be destroyed in order to continue - you can just keep out of the way until the wave is completed. After the 8th wave, you get the same bonus level provided you have at least 2 remaining stages. If you still have stage 1 and 2 joined, you can attempt to pair all 3 of your stages to complete the ultimate in fire power. The final two stages consist of small arrow ships that will track your ship and dive bomb directly down meaning you need to be constantly on the move to avoid them. Destroy both waves and you get a celebratory message and the games loops back to the start at a harder level. These", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Incentive Software", "publishers": "Alternative Software", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.62", "wikipedia": "https://en.wikipedia.org/wiki/Moon_Cresta", "video_link": "https://www.youtube.com/watch?v=wIwx1JCCW6M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108892-moon-cresta\n"}