{"altername_name": [], "name": "Morse Code", "overview": "Learn Morse code with this game by Vince Apps and from the book \"40 Educational Games for the Commodore 64\", published in 1984. If you are planning to become a sea captain or a pilot then this is the game for you. Even if you are just planning to help your parents on a yachting weekend you will be able to show off with this one. There is plenty of fun here as well as you can set your own speed of reply to the computer; set your own messages; ask other people to translate what you have sent. The computer will put up on the screen a menu which is a list of items from which you can make a choice. Menu is 1 . Send a message 2. Random letters 3. Words 4. A to Z in Morse The computer will ask you to choose from 1 , 2, 3 or 4. You will then be asked to choose a speed which you would like from 1 to 100. As 100 is for professional morse code operators we suggest you start at 10. Type in 10 and press RETURN. The computer will then ask you for your message . If you have chosen 1 you could type in MAY THE FORCE BE WITH YOU, remembering to use capitals, press RETURN and the computer will play the message back to you in morse code. When the message is complete the computer will return to the menu and ask you for your next choice. No. 2 will mean that the computer will put random letters on the screen whilst sounding them at the same time. If you choose No. 3, words, the computer will sound out a word, at the speed you choose, which you must identify. When the computer completes the word it will ask you to type in the answer. If you are right - well done. If you are wrong however you will hear a nasty ‘raspberry’ and the computer will show you the correct answer before moving to another word. Remember that your knowledge of morse code could save lives.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Vince Apps", "publishers": "Granada Publishing Ltd.", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166114-morse-code\n"}