{"altername_name": [], "name": "Move Out", "overview": "A puzzle\\brain\\logic game published by Magic Disk 64 1991/01. Push the boxes down the grates and listen to some pretty good music while you do it! Never before have we presented you a game on MAGIC DISK that corresponded more to reality than this, called MOVE OUT! Take on the responsible work of an employee of the CP-Verlag field service department and do your best - you will see that this is a lot of fun, but also requires a little imagination and ingenuity and also has a huge advantage: You save yourself to hire us as a temporary worker during the next vacation (be honest: That was always one of your greatest dreams, wasn't it? But don't worry - many thousands of other MAGIC DISK readers feel the same way!) and you can use the days off enjoy somewhere on a cozy, warm sandy beach in the distance! You have still not really worked for us, but MOVE OUT has meanwhile conjured up an (almost) original atmosphere of work in our home, and so you will have yourself at the latest after the 3rd Level swore never to touch a broom less than 15 DM an hour again! That's right - have a nice vacation! That nobody gets me wrong now: What is called for is not working in the editorial office (i.e. writing texts, making phone calls, eating pizza, etc.), but the extremely tough job in the warehouse! Yes, the current issue of MAGIC DISK has been created, copied and packaged ready for dispatch and now only has to be delivered. Your task now is to use a fork lift truck to move the wooden boxes with the magically valuable freight that are lying around wildly around the nested hall (old buildings are simply cheaper to rent!) Into the freight elevator, one after the other. Unfortunately, the boxes are much too heavy to be our high-. . . Excuse me, the forklift could lift it and the only option left is to push it towards the exit. But be careful: one wrong push, the box is in the corner or on a wall, can no longer be moved (because it cannot be pulled out), and one shift (= one life) is forfeited! There are easier and harder setups, because our warehouse workers leave everything standing and lying with the gong at the end of the day, and depending on the situation, the situation is sometimes more and sometimes less complicated for you. \"It is the man himself\" is our motto, and so on you also have to judge for yourself whether the current line-up can still be achieved. If not, just press SPACE , your life will be deducted and everything will start all over again. Each loaded edition of MAGIC DISKS earns 10 points on the account! Of course, you can also bribe the warehouse workers with a case of beer. These then move away with them beaming with joy, but not without having adjusted the numerous boxes as desired beforehand (in good German: MOVE OUT also has an editor built in with which you can develop your own set-ups according to your wishes!). You can get to the editor during the opening credits by pressing F3 (F1 = Start, F5 = further levels are loaded), back at any time with the RUN / STOP button. This selection cannot be made on the info page, which appears approx. Every 10 seconds.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Robin Stember", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=aYSnE4debGE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122771-move-out\n"}