{"altername_name": ["Mr. Wimpy", "Crazy Burger", "Super Burger"], "name": "Mr. Wimpy: The Hamburger Game", "overview": "At the start of the game, Mr. Wimpy has to cross his kitchen while avoiding moving manholes to get to the larder so that he can collect ingredients and make his burgers. As an added hazard, a character called Waldo tries to steal these ingredients from him. After the opening level, the game becomes a BurgerTime clone where the player must guide Mr. Wimpy across the platforms while walking over four various burger ingredients, which in turn causes them to crash to the platform below and finally to the four plates at the bottom. Mr. Wimpy must also avoid various enemies. The player can spray pepper at the enemies, which temporarily freezes them for a few seconds. Enemies can also be trapped and squashed by walking over burger ingredients while they are on the level below. The platform portion of the game features the following enemies: Sid Sos (a walking sausage), Ogy Egg (a walking fried egg), Sam Spoon (a walking spoon), and Pam Pickle (a walking pickle). As the player progresses in the game, the number of enemies increases. Mr. Wimpy's only defences against the enemies are to trap them between the falling burger ingredients and to temporarily freeze them with pepper. Only a small supply of pepper (up to 4 bottles) can be carried at a time; when the player is low on pepper, more can be acquired by collecting a coffee cup or ice cream. Players are given four lives at the start of the game, any of which can be lost in the opening Larder level by falling down a moving pothole or by getting caught by an enemy in the platform portion of the game.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Ocean Software", "publishers": "Computer Records", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Mr._Wimpy_(video_game)", "video_link": "https://www.youtube.com/watch?v=x_1hRoT6ue0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71416-mr-wimpy-the-hamburger-game\n"}