{"altername_name": [], "name": "NeaGox", "overview": "Neagox is a Commodore 64 h-scrolling shoot'em up game released in 1990 by Commodore Disk User, it was published in Commodore Disk User 1990/11, and in Your Commodore 1991/04 (Tape #16). NEAGOX THE NEAGOX PLOT In the year 2020 the earth has become so polluted that most people are dying of different strange diseases. Every time a new child is born it's mutated. Therefore the earth's government decided that the earth's population had to move to some other planet if mankind should survive. Three years later, in the year 2023, the first planet was colonized. From then on mankind colonized more than 11 planets in 30 years. Your planet NEAGOX was colonized as planet no.8 in the year 2044. Some 40 years later an alien ace arrived on earth... It was the Zyxonions. They came in peace and people had belief in them. But then one day the Zyxonions showed their real intentions and took over the world. After which the Zyxonions took over the world government-no longer allowing people to live a decent life with their strict rule. The Government of the colonized planets eventually joined forces and made a defensive pact which involved a group of special fighter pilots. This group was called TERRORFORCE (032) and the headquarters were situated on NEAGOX. A couple of years after this pact was made, the Zyxonions began to attack the colonized planets. The newly trained TERRORFORCE fighter pilots were sent to destroy the Zyxonions but they were destroyed one by one. Now, this is where you take over!!! You are the last of the fighter pilots and you have to win the final battle on your planet NEAGOX. Do you have to what it takes to free the human race from enslavement of the Zyxonions????", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Brian Schau", "publishers": "Alphavite Publications", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=URAej61NbYY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160592-neagox\n"}