{"altername_name": [], "name": "Opium", "overview": "Published in Magic Disk 64 1991/06, and created by Joachim von Haacke and Michael Kukat, this simultaneous 2 player game is a Snake/Worm variant. OPIUM - In this game, the uninitiated observer is immediately struck by the unusual name. Should this game have an intoxicating effect, a kind of dope on disk? Do you get addicted to it or is it forbidden to use it? Many unanswered questions that prompted the Magic Disc team to start a large-scale awareness campaign - in the form of this game test. First of all, I can reassure you; OPIUM on the MD is completely harmless in every respect and in no way endangers the life and limb of our users. With OPIUM, Joachim von Haacke, Michael Kukat and Stefan Harwig from Heaven Artworks have created an entertaining pastime for two players competing against each other. With OPIUM there is a choice between two different background graphics, which are prompted at the start of the game. Paradoxically, the display for both players at the bottom of the screen is exactly the wrong way round. The principle of OPIUM is as follows: When a player moves his \"dot\" away from the wall, the spots on which the dot sits will glow for a number of game movements. The player's point thus receives a kind of tail and soon looks like a snake. However, he is not allowed to touch the wall or the background or his opponent with his snake. Touching oneself by walking back is also not allowed. If a player violates these principles, he has one less round, his score increases by one point and his opponent receives this point - a so-called Carnap - in the final scoring. The only exception to this principle is the diagonal crossing of both \"player lines\" on both sides, nothing happens here and the game continues without incident. As you have probably already noticed, the whole thing boils down to encircling the enemy by skilfully manoeuvring his snake and leaving him no other option than to touch the wall, the background, himself or you. This would then be a point - or Carnap - for you. Generally speaking, the longer you play, your queues get longer, longer and longer. . This also increases the risk of carelessly \"biting your own tail\" and losing it in this way. The winner is the player who has the most Carnaps in his account at the end of all rounds.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Joachim von Haacke", "publishers": "CP Verlag", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123195-opium\n"}