{"altername_name": [], "name": "Orb", "overview": "Published in Magic Disk 64 1994/06. A decent enough puzzle game in which you have to remove all the four-balled things by moving them into pillars. In a different time, in a different place: The Orbs live on a gigantic space station in a distant solar system called Theta Boroni, very close to the well-known Altair. There are four inhabited worlds in this system: 1. the mining planet Auron, 2. the farm planet Hestia, 3. the ocean planets Hydron and 4. the high-tech planet Argonia. The orbs are very talented transport engineers, and they have therefore been hired with their space station to ensure the distribution of the goods to the individual planets. It was precisely for this purpose that the Orbs developed the large-capacity container, which consists of five spheres. These are connected to one another: a small control and drive ball in the middle and four large balls on the outside, which contain the cargo space. In addition, the orbs have invented special transmitters that pick up the containers and set them down on the correct planet. Each planet has been assigned a color so that there can be no mix-ups. For example, the goods for Hestia arrive in green containers and are only transmitted to Hestia through the green-colored transmitter fields. Red stands for auron, gray for argonia and blue for hydron. If a transmitter field is reached by a large-capacity container of the same color that is moving towards it, it emits it and then closes again. It is completely irrelevant from which side the container approaches, since the transmitter field is so strong that it also works through its boundaries. It is only necessary that the container is already moving towards it at a certain speed and is not located directly next to the transmitter field when it is heading towards it. Of course, the orbs also have problems to contend with. First of all, there is inertia. Such a heavy large-capacity container, when it is in motion, can only be slowed with so much energy that the orbs have not even bothered to integrate brakes. Instead, they use high-density walls and simply let the containers made of special steel collide against them. If a container is not supposed to go in a certain direction, the orbs incorporate rebound elements. These send the containers back in the direction from which they came. To make things easier, the orbs have also built in rotating segments that deflect the containers that are heading for them in the direction of the arrows.", "platform": "Commodore 64", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Masters' Design Group (MDG)", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=6NbUiABm6lw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123200-orb\n"}