{"altername_name": [], "name": "Out of Order", "overview": "Game created by Penny DeGroff and published in ReRun Special Summer Edition 1990. OUT OF ORDER is a great game for learning to alphabetize letters or for just having fun. All it takes is a little imagination! The scenario: You've just obtained a part-time position with the ABC Letter Car- riers Association. Your job: to quickly arrange, in alphabetical order, seven random letters and earn money in the process. The game screen shows a six-by-seven matrix of squares, with seven letters in the bottom row and a \"guard\" moving back and forth in each of rows 2 through 5. The letter carrier starts on row 2 and places the alphabetized letters on the top row. Suppose the letters at the bottom are N, C, T, Z, D, E and P. With a joystick in port 2, move the letter carrier to the square direcdy above the C (the first letter alphabetically) and press the firebutton; the C disappears. Then move the carrier to the first square in the second row, press the firebutton again, and the C appears direcdy above in row 1. Repeat this procedure until all the letters are in their correct alphabetical positions in the first row. Of course, you don't have all day to do this! You must complete the alphabetizing task before a border, representing your work time so far, has been drawn around the screen. The guards, continually moving back and forth in their rows, make the job more difficult. You can't move the letter carrier to a square occupied by a guard, and so must scoot around or wait for the guard to pass. Also, the guards won't hesitate to capture the carrier. When this happens at skill level 1 (the easiest), you keep the letter but lose some time. At level 2, the letter returns to its original square at the bottom of the screen, and you must fetch it again. At level 3, the guard takes the letter and won't give it back! When you've placed all the letters in the top row, or when the border is completely drawn, the delivered letters appear in a separate screen display. A letter is in its correct position if there is a green pointer below it. Otherwise, the appropriate letter for that position is shown beneath a red pointer.", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Penny DeGroff", "publishers": "RUN", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367636-out-of-order\n"}