{"altername_name": [], "name": "Paradroid Redux", "overview": "\"A high-tech toilet,\" Andrew reminisces when you ask him where the name Paradroid came from. \"That's what Technobots always reminds me of... We were messing around with some names and somehow we came up with Technobots. I even had it on the title screen for a while,\" he continues. \"But then Paradroid came along and saved the day. It's a play on PARAnoid anDROID - everyone's out to get you.\" TheOne: Work in Progress - Paradroid '90 Bugs Enemy laser 1 / laser 2 damage was swapped. fixed Rarely droid mode wasn't initialized correctly, making some droids explode when entering level. fixed Player could go through walls by abusing asymmetry in wall collision check. fixed Droid exploding simultanously with other events had multiple problems: Transfer with such droid resulted in droid 402 (index $40, explosion). fixed Player droid in multiple collision. This might also lose one of exploding enemy droids. fixed Player droid bumped off from explosion, thinking it was 402-type droid. fixed DroidNear() returned true for some faraway droids. fixed Waypoints had multiple problems too: Droids might lose waypoints if bumped into when they were just leaving one. This resulted in droid reversing its direction and going where no droid has gone before. fixed Droids ignored waypoints if they paused (either they fired or were bumped into) at the exact same time they entered waypoint. fixed Game checked for waypoints twice as often as necessary. (And how much did it help...) fixed Non-visible area scanned was different in each direction. fixed Hardware collision checks are basically crap. Originally game tried to handle this by checking the topmost colliding sprites, ignoring others. fixed Interrupts didn't clear decimal flag, causing sound corruption every now and then. fixed (This was also fixed in the Heavy Metal Paradroid) The very last waypoint of the very last deck (maintenance) sent droids to wall. fixed", "platform": "Commodore 64", "release_date": "2007", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160033-paradroid-redux\n"}