{"altername_name": [], "name": "Park Patrol", "overview": "Park Patrol is a collecting game by Activision, which was first released only on the American market in 1984 and only in 1987 published in Europe under the budget label \"Silverbird\" of the software house Firebird. In the Poconose National Park all hell is loose: Careless tourists have litttered the whole area with cans, bottles and gummi balls and they also bathe of all things in the only reserve of the white dotted blue striped pink swamp snake that is left. If something goes wrong there, there will be lots of trouble with the tourist association...or Greenpeace, depending! Therefore they are looking for competent boys and girls who want to fill in the sacrificially honorary post of park guard in their holidays. A motor rubber boat, snake defence spray and supply are provided, you get for free lots of exercise and fresh air. Also, the animals are totally grateful that somebody helps them! As highly motivated park guard collect all twelve carelessly thrown away bottles, cans etc. in every section on water and land and jump in to help if one of the bathers is threatening to drown. But also take care that you do not get too close to the local fauna, the turtles and snakes are only curious, but you never know! For you not to keel over, you need to eat enough, because if your calories go to zero, you lose one of your four screen lives. Unfortunately, also hungry army ants have zeroed in on your supply, so keep your eyes and ears open so that they do not steal your meals. When all trash in a section has been collected, the calories left are added as bonus points. There is an extra life every 20.000 points. If the supply in the storage is empty, the game ends independent of the screen lives left when the current character has an accident or the energy is empty.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Tony Ngo", "publishers": "Activision", "genres": "Adventure", "max_players": "2", "cooperative": "No", "rating": "3.82", "wikipedia": "https://en.wikipedia.org/wiki/Park_Patrol", "video_link": "https://www.youtube.com/watch?v=nfmHj4Ypmz8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/49115-park-patrol\n"}