{"altername_name": ["Paul Whiteheads Schachschule"], "name": "Paul Whitehead Teaches Chess", "overview": "Paul Whitehead was a better chess player than the average high school student. So good, in fact, that before he completed his teenage years he had won a number of chess titles, including the Masters Division of the American Chess Championship. Now, the young chess master has concocted a computer chess tutorial which includes a program that teaches the fine points of the age-old game of chess, as well as a chess program for you to play against. Paul Whitehead Teaches Chess is two programs contained on several disks—a three-disk set for Commodore. The main instructional program provides tutoring for what Whitehead terms \"absolute beginner to middle-level\" players. (By the way, his middle level is well above my high level.) The tutorials are divided into 11 groups. A poster-size road map gives the user an overview. The tutorials covering the rules include topics such as How the Pieces Move and How the Pieces Capture, progressing to Checkmate and Stalemate Is Better Than Losing. When you're ready to move on from the basics, other tutorials come under such headings as Opening Principles, Tactics, and Strategy. The last of these three—Strategy—includes 167 separate screens. Despite the large size of the tutorial, you're never stuck within the program. I really appreciated the fact that I wasn't trapped in any long runs of sequenced screens. I could duck out any time I wanted and move to any other screen I requested.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Julio Kaplan", "publishers": "Ariolasoft", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Paul_Whitehead_Teaches_Chess", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76036-paul-whitehead-teaches-chess\n"}