{"altername_name": [], "name": "Pegasus Odyssey", "overview": "Pegasus Odyssey is an action video game released in 1983 for Commodore 64 by Comm * Data of Milford . You control a Pegasus with a mechanism similar to that of the well-known arcade Joust . The game takes place on a fixed screen showing a range of mountains, including a glowing volcano. The player's pegasus and enemies move in two dimensions across the screen, and when they leave the left side they reappear on the right side and vice versa. The player must repeatedly press the button to make the pegasus flap its wings and gain altitude, while if you stop pressing it tends to spontaneously go down. For horizontal displacements you can accelerate and decelerate only while flapping your wings, then the movement continues indefinitely by inertia. The bottom side of the screen is the ground, on which you can land and slide horizontally. On the upper side of the screen it bounces. The enemies are giant bats that come out a little at a time from a cave in the mountains and fly continuously. To eliminate them, the pegasus must strike them from a higher position; on the other hand, if the bat arrives on the pegasus from above, the player loses a life . Each downed bat becomes an egg that bounces to the ground, and when it finally stops it can be made to disappear by walking over it. If, on the other hand, you lose too much time, a bat is reborn from the egg. When the pegasus is eliminated, if you still have lives, you re-enter the game when the player commands it; the volcano shoots out a fireball which then turns into the new pegasus. Two players can participate in simultaneous cooperation, controlling two pegasi, who cannot touch each other, but pass through each other unscathed. Ten levels of difficulty are available.", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Mike Blackman", "publishers": "Comm*Data Computer House", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123922-pegasus-odyssey\n"}