{"altername_name": [], "name": "Perfect Symetrie", "overview": "A puzzle game made by Sascha Brauner in 1994 and eventually published in both 64'er 1996/05, and in 64'er Top-Spiele #6. Life is a mixture of puzzles, action and hustle and bustle, but here you build complex structures that the C 64 specifies in no time at all. If you spell \"Perfect Symmetry,\" you have to get a good dose of hectic, the goal of the game is to reproduce the objects on the right side of the game true to the original in the game field. It starts out very easy. But be careful, some things will pop up that will challenge you, but there is always only one solution, so keep your eyes open! Tip: always pay attention to the dot grid. Here you can see off which stone was actually set in the original. Once all three Levels done, you can count on a little surprise. Extras can also provide a lot of help in a thinking game, Bel Perfect Symmetry there are six. These extras are shown as small loon in the lower edge. Whenever you have completed a level and there are still more than 30 seconds left on the time account. you can enjoy a special weapon. One scrolls the tiles at twice the speed. This makes it available to set the element. The second is a preview function, so it allows you to take a look at the next stone before the current one is placed. Once level three has been reached, the goal stays difficult. Extra number four contains three different bonuses that fall from the ceiling: for example, you can increase your score by ten points, get an extra minute of time or jump straight to the next level In order to get the bonus, it must fall directly on the vehicle.", "platform": "Commodore 64", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Sascha Brauner", "publishers": "Markt & Technik", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166396-perfect-symetrie\n"}