{"altername_name": [], "name": "Pertharion", "overview": "Pertharion is a game that gets your grey brain cells going again, namely a mind game. The shooting friends among you should also keep reading, because the game hardly lacks excitement and thrills. Now the boy shouldn't talk so much, but go to medias res. So, let's go! You see a rotating ball on a playing field, with which you have to drive over differently coloured fields (control options: left, right, up, down, but not diagonally). These boxes have different influences on the further course of the game. But you have to stay on the box, otherwise you have unfortunately lost. The following selection of fields are available on the field: GREEN that you can rest on, it's safe land. But there are also greens that show cracks, they disappear once you have rolled over them. BLUE, it is no longer possible to change direction here. H. the ball moves as if on ice to the next differently coloured field. So it can happen that at the end of the ice field there is no more box and you go on it without being able to do anything about it. Usually they remain, but if you come across a blue field with cracks, it disappears again. What a pity! ! ! A little friendlier are the VIOLETS, which flash and which you have to collect in every level. Unfortunately, they move away after rolling over once. So you have to take care that you don't suddenly stand there and only the black background surrounds you, cut off from the environment, lonely on a small island. Because then it's unfortunately GAME OVER! ! ! ! ! Another complication is that you only have one life at your disposal. So think first before you take the next step. You mustn't stand on a box that disappears when touched (all with cracks and purple), because otherwise you can make your will very quickly. The control of the ball takes a little getting used to, but you are quite used to it and after a night session you master the control, but the game is far from exhausted. Because there is also the possibility to create or change your own or existing levels, namely 989 pieces. Created by Jürgen Graser and published in Magic Disk 64 1991/09.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Jürgen Graser", "publishers": "CP Verlag", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=X_Chki-xoag", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123932-pertharion\n"}