{"altername_name": [], "name": "Powerplay: The Game of the Gods", "overview": "The game takes place on an 8x8 chess board shown with an isometric perspective . Two to four players can take part, each of which initially has four pieces (two if many are played) that represent mythological creatures, arranged at the corner of the board. The goal is to eliminate all the pawns of all the other players. On your turn you choose any of your checkers, so you must answer a question. The topic depends on the color of the box in which the creature is located: blue for general culture, red for sports and leisure, yellow for history and geography, green for science and technology. The text of the question is shown below and there are always four possible answers, arranged crosswise and selectable with directional controls. Time to respond is limited and depends on the level of general difficulty chosen (2.5-10 seconds). If you respond well, you can move the piece in an adjacent box in any direction. There are also four special teleportation boxes, which send the checker to another of the four randomly. If you make a mistake or do not answer in time, you can not make any moves. The right answers also increase the points of wisdom of the creature, of a quantity proportional to how quickly it is answered. After accumulating at least 25 points, you can change the piece to the next level creature from four possible. In 8-bit computers the types of pieces are, in order of power: Hercules , Cyclops , Minotaur , Satyrs . More difficult questions are asked of the most powerful creatures. When you move a pawn, you try to enter the space occupied by an opponent, a challenge occurs between the two creatures. A question is posed to which both players can answer simultaneously. The argument is casual and the difficulty level is that of the most powerful piece. Who answers first and well wins, who mistakes loses, and if no one responds in time loses the attacker. The loser's creature has the power reduced by one level, or if it was already at the minimum it is eliminated. There are around 2000 possible questions in all. The program includes a question editor to create and edit sets of new questions, which can be loaded as an alternative to the default ones (which are not editable).", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Arcana Software Limited", "publishers": "Arcana Software Design", "genres": "Board Game", "max_players": "4", "cooperative": "No", "rating": "4.67", "wikipedia": "https://it.wikipedia.org/wiki/Powerplay:_The_Game_of_the_Gods", "video_link": "https://www.youtube.com/watch?v=95LJHTSoZlo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109254-powerplay-the-game-of-the-gods\n"}