{"altername_name": [], "name": "Price of Peril", "overview": "Price of Peril is a German language text adventure with graphics for the Commodore 64. It was developed by Michael B. Schmidt and published in Input 64 1988/04. There are enough science fiction novels and films out there, but have you ever projected yourself into the future? It's possible with a sci-fi adventure. Put yourself in the shoes of the hunted. You will be hounded and pursued throughout the city. You are exhausted and can't take it anymore, it's over. Your pursuers have caught up with you, a shot is fired — you can actually feel yourself sinking to the ground. But then the door opens: “Come on, dinner is ready” — you breathe a sigh of relief, it was just a game: Price of Peril. The year is 2013. Four years ago voluntary suicide became legal. However, this innovation, which initially appears harmless, is being unscrupulously exploited by the media by putting on television shows in which the individual candidates risk their lives. Jim Raeder also lived during this time. He has never been very successful professionally and is persuaded by a friend to take part in such a program. The television company takes an interest in Jim and initially lets him act in a few small shows in which, apart from a few injuries, he is more or less successful. But then comes the big breakthrough for Jim. He gets an offer to take part in the most popular gladiator game of modern times: Price of Peril. In this game you are hunted by one of the worst crime gangs in New York. If the criminals succeed in killing the candidate, they will be pardoned by the government. The contestant wins if he survives the predetermined time limit. The hunt is broadcast live on television using cameras installed in helicopters. The show will be hosted by the very popular Mike Terry. In addition, viewers can take part in the murderous game by calling the broadcaster as so-called \"Good Samaritans\" and then giving the candidate tips and tricks via television.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Michael B. Schmidt", "publishers": "Verlag Heinz Heise GmbH", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158298-price-of-peril\n"}