{"altername_name": [], "name": "Project Hell-Storm", "overview": "Control your Hell-Storm attack helicopter through levels of underground peril in this horizontally scrolling shoot'em up published in Magic Disk 64 1989/05. What disaster has befallen mankind! Lord Rübe robbed all breweries around the world in a night and fog action and carried the beer supplies into his underground cave labyrinth. Should mankind from now on eke out its existence with a dry throat? Will Walter Sedlmaier be robbed of the strong beer tapping and the Paulan acquisition, unemployed? Does Werner only have a chance of \"Tass' Kaff '\" or \"Glass Wass'\"? And what about the editorial team of Magic Disk (rattle!)? But the rescue seems to be near: Prof. Tom has developed the mega helicopter HELLSTORM (double laser, air rocket, beer sensor, CD player, Playboy collection...) And is now entrusting his old friend and warrior KILLERBYTE with the procurement of the delicious liquid. You are KILLERBYTE (ha, surprise! You probably didn't expect that. . .)! Save humanity from doom! There are several rules for the game: MAIN RULE 1: When KILLERBYTE kills, there will be a PILS soon! MAIN RULE 2: You have three beers. . . uh, three lives! MAIN RULE 3: Collisions with Lord Turnip's minions and the walls of the cave system lead to the loss of a life! \"Lord Turnip's henchmen?\" You will surely ask yourself now. Yes, the underground caves and the secret beer hiding place are guarded by Lord Rübe's guards. These guards immediately go on a collision course if KILLERBYTE approaches in his helicopter. Every now and then Lord Rübe's robbery squad lost a couple of barrels of beer on the way to the secret hiding place. These barrels in the form of a flashing star need to be collected, because the ingenious Prof. Tom designed his helicopter in such a way that the beer barrel is converted into additional drive and laser energy. If the scrolling suddenly stops, this is not a program error, but something that will make you happy: You have (in fact and contrary to expectations) almost (!) Reached the next level! What now? Just fly out of the right edge of the screen and you are one coaster closer to the beer supply. . .", "platform": "Commodore 64", "release_date": "May 1, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Ingo Sander", "publishers": "CP Verlag", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=3NE4M9eyJko", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124403-project-hell-storm\n"}