{"altername_name": [], "name": "Pulz 64", "overview": "Avoid the tanks and bulldozers and keep the snakes from growing out of control. Night falls, and I'm taken by sleep, hot air blows up balloons in my dreams, Ding-dong!! rings the bell and something's at the door, So I put on my slippers and I creep across the floor. For the door from hence I heard, another ding-dong, I peep through the door hole but something's very wrong as on my porch there are thousands of snakes ready to strike, I feel queasy, and my knees start to shake. My perilous fate, I see no escape as serpents lay siege to my country estate. The Devil must have opened up hell's gates and called up millions of snakes to take me from this place. Big ones Little ones, fat ones skinny ones. Protect me from their venomous drug. That springs from the needles of fangs... Attacked by Snakes By Snakes! So many snakes, you could fill the Great Lakes with snakes. Ha ha ha, run. I try to hide. But snake bites on my face testify I've been attacked by snakes. By snakes! So many snakes, it would take a thousand crates to contain the snakes after me. I'd rather be burned at the stake than be... attacked by snakes. Welcome to my world, or should I say this land of snakes. Serpents lie and wait at every take, my knees quake as my life these snakes invade. Snake invaders show their fangs on the snake parade. My perilous fate, I see no escape as my family prays and waits I fight them off with shovels and rakes and bats and phones, but I just can't seem to shake these bones. That slither from the dark to destroy my home. One snake, Two snake, are there any more? There's two more knocking at my door...", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Saturn Developments", "publishers": "Saturn Developments", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=sS7qOO57QLw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124460-pulz-64\n"}