{"altername_name": [], "name": "Push'em", "overview": "A puzzle game by Frederic Thiesse and published in 64'er Sonderheft 49, and in 64'er Sonderheft 73. The moving of (Boxes in reserved spaces is a strenuous job, especially when you can only move boxes that have free space next to them. You need skill, overview and, above all, the right strategy when you're at \"Push'em \" don't want to block the way. Once you've got a playing field in order, another 15 parking spaces are waiting for you. With an editor, you can design additional fields according to your wishes, so that your fun can be expanded as you like. Fizzy synthesizer sounds provide a suitable background music this exciting strategy task. You control the robot, which is represented by a silver ball, with a joystick in port 2. You can also see the storage area with green, square boxes and the parking spaces provided for them, which are marked by blue hollows in the ground. Your robot's task is to transport the green boxes into these hollows. To do this first place the robot ball directly next to a box. Then the fire button is pressed and the joystick is moved in the direction of the crate. Always place the robot on the opposite side to which you want to move the box. If a box is to be “pushed” more than one spot, the fire button must be pressed for each movement to be carried out. However, the robot can only move one box at a time; if there are two or more boxes, his power fails. If a crate is on one of the parking spaces, it turns blue. It can also be moved away from there and thus once again assume the green or blue color. At the bottom of the playing field, two counters indicate the number of your robot movements (»MOVES«) and box displacements (»PUSHES«). It is thus possible for experts to determine optimal strategies, i.e. the most economical ways possible. The main difficulty with this task is that it is very easy to get into a dead end situation, such as when you have maneuvered a box into a corner or blocked your own way. In this situation, only the emergency brake F7 helps, with which you can abort the game and go back to the beginning. A playing field is completely drawn when there are no more green boxes or no more parking spaces. Then it continues with the crates in the next of the 16 levels.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Frederic Thiesse", "publishers": "Markt & Technik", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124583-pushem\n"}