{"altername_name": [], "name": "Puzzle Bobble", "overview": "Puzzle Bobble is an unofficial conversion of the Taito arcade classic of the same name, for the Commodore 64. It was released on February 1, 2022. although, the conversion has been in the works since sometime around mid-2019. The conversion was done by a group called JHB. It even allows you to insert credits using the same keys you would use on MAME and even has a version of the classic NEO-GEO green startup screen and splash screen to make it look more authentic. The game is currently PAL only. Supports keyboard, joystick, and paddles. Game description: Puzzle Bobble is a real-time puzzle game in which the player controls a device called \"pointer\" at the bottom of the screen, aiming and releasing randomly colored bubbles upwards. Depending on the aiming, the bubbles may float up directly or bounce off the walls, changing their trajectory. The goal is to aim the bubbles in such a way that they will touch identically colored ones. When such bubbles form a group of three or more, they pop and disappear from the screen. If the ceiling of the area is covered by too many bubbles, it will gradually descend; the game is over when it nearly reaches the player-controlled pointer. Should the player fail to release the bubbles within a specific time limit, they will be released automatically, unaffected by the pointer's aiming. A two-player mode is included as well. Each player competes on an area occupying half of the screen, dealing with identically generated bubbles. Whenever a player successfully disposes of a bubble group, a part of it is transferred onto the opponent's part of the screen. The game features the two dinosaur protagonists (Bob and Bub) as well as other characters from Bubble Bobble, even though the two games have distinctly different gameplay.", "platform": "Commodore 64", "release_date": "February 1, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "JHB", "publishers": "Public Domain/Freeware", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=EhLnVCI1GZA&t=385s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158679-puzzle-bobble\n"}