{"altername_name": [], "name": "Quadratic Area", "overview": "A very tricky isometric collect em up with a Pacman-esque character created by Guido Mersmann and Klaus Hegemann and published in Input 64 1988/05. What do the following terms have in common: Pacman, Cubert, Domino, Wedel and Marble Madness? \"Not much,\" I hear you say. Not even close! Quadratic Area was created from the essence of all the games mentioned. Our character is similar to Pacman: a happily grinning Janus-faced ball man who scurries eagerly across the playing field without complaint, guided by one or two joysticks. We are already weaving, known to the skiers among us as an elegant downhill technique, swinging zigzag to the left, then swooping to the right, so you can steer well and keep the shot down the steepest mountain under control. This is also the case here in our game: The ball man has to swing over the diagonals while waving the joystick. Beautiful with feeling, of course, so that it comes across the field well. But if it goes wrong, then what happens then is reminiscent of the well-known computer game Cubert, also known as Hexbert: our little man falls and loses one of his few game lives. The playing field looks like after a successful game of dominoes after the game pieces are laid out nicely. All of the gameplay taken together again has something in common with the legendary arcade hit \"Marble Madness\": Like this one, it has beautiful 3D graphics, is exciting, so that you like to play it again and again, and our Pacman-chen can also be used as one \"Marble\" can be described with a face. The \"Madness\" soon seizes the two players, because you can also play Quadratic Area for two. On your marks... In the cover picture you can decide whether you want to play alone or in pairs. Using the keyboard, press button 1 for one player or button 2 for two players. Play with your joystick, trackball or mouse, plug it into port 2 of your C64 and possibly a second one into port 1. The keyboard layout for the game with one player is shown in figure 1. Pressing the fire button or the space bar several times will start the game after loading. You leave the opening credits and find yourself in the middle of the field. Hurry up because the countdown will start immediately. When it expires, your male's life is over and you are left with only two. The man's life is also forfeited, if you leave the domino track by steering too hard, your friend will fall. Incidentally, you never have to decide whether you prefer joystick control or the keyboard; because both are always possible. So feel free to find out what you like better.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Guido Mersmann", "publishers": "Verlag Heinz Heise GmbH", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=CfrHXLL8W38", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124736-quadratic-area\n"}