{"altername_name": [], "name": "Quest of Riemannian", "overview": "Quest of Riemannian is a text adventure game developed by Tim Hartnell and Brett Hall. It was published as a type-in listing in their book \"The Big Fat Book of Commodore 64 Games\" by Interface Publications. Science fiction seems to occupy a niche in the mind of modern man which was in earlier ages filled with tales of witches and werewolves. Science fiction stories are an underlying myth of our age. This explains, in part, the popularity of computer games based on science fiction backgrounds which are now part of the accumulated information we carry in our heads. Television programs, like Paramount Picture's perennial classic 'STAR TREK', and movies such as STAR WARS have spawned a huge number of popular games, and novels of writers Like Asimov and Heinlein have given game creators flesh to fill out the relatively bare Trekkers’ universe. Who would not gladly take on the training to become a Jedi knight? QUEST FOR RIEMANNIAN steps into the same arena, making assumptions about 'future history’ background that will be understood and accepted by anyone who has’ visited such exotic locations as Niven's RINGWORLD. At the start of your mission, you tell the computer your name, and enter the name of your ship. Your task is to go boldly where millions of men have gone before, into the busy sectors of Known Space. You start off on Earth (in, of course, the Terran Sector Of The Galaxy) and have to ensure your craft and crew stay together Long enough to make it through the galaxy, and back to earth. It seems that, a Long time ago (around 2048, on the Old Calendar) a particularly benevolent alien race Landed on earth, and gave us an enormous, all-wise computer’ to help us out. Being essentially Lazy, humankind gave more and more responsibility to the computer, until eventually it was running everything of importance on the planet. There was one thing the benevolent aliens forgot to mention. As it operated, the computer used up atoms of a rare and precious metal called Riemannian. From time to time, the supply of Riemannian must be _ replenished. There is Little Riemannian in Known Space, and your task is to find some, mine it, and bring it back for the computer.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Brett Hale", "publishers": "Interface Publications", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136504-quest-of-riemannian\n"}