{"altername_name": ["QWAK Reset Edition"], "name": "Qwak", "overview": "New remake of an Amiga game. Much like Bubble Bobble and Rodland. It was released as part of the RGCD C64 16KB Cartridge Game Development Competition 2015/2016, Reset #10 Mix-i-Disk. Like the original In this game, you play a duck and the object of the game is to get the highest score without losing all your lives. This can be achieved by getting all the fruits and gems in the level, or killing off enemies. There are many levels to complete and once you complete all of them, the levels are repeated. You exit each level by collecting all the gold keys then entering through the door that opens. You have a certain amount of time to complete the level before spikes fall down the level. There are eight areas, all consisting of ten levels. At the end of each area, there is a guardian waiting for you, and again, you have a certain amount of time to defeat them. You kill enemies by throwing orange-colored eggs at them, and in the earlier levels, they go down in one or two shots, but in later levels, you'll find out that all of them take more than two shots to bring down, so your orange balls would be useless here. The solution is to get a special power-up that will give you chocolate eggs. Besides gold keys, you can also collect silver keys. This lets you unlock a gate, giving you access to more shots or power-ups. There are also booby traps in the level, such as spikes, and some parts of a level are blocked off by spikes. Get a mushroom and they turn into flowers that you can pick up. Beware, getting another mushroom will make them turn into spikes again.", "platform": "Commodore 64", "release_date": "2016", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Oziphantom", "publishers": "Reset64 Magazine", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160292-qwak\n"}