{"altername_name": [], "name": "Rags to Riches", "overview": "The game starts with the player assuming the role of an unnamed homeless vagrant living in a fictional city, divided into four sections, titled North, South, West, and East. The player begins in the South section. To complete the game the player must accumulate $1,000,000 cash by progressing from the life of a vagrant, cleaning up by getting a haircut, securing odd jobs, attending High School, College, and eventually becoming a millionaire. Money is collected by finding dimes and $1 notes on the street and taking up employment. Bottles can also be found and exchanged for money at several stores. Movement within the city is within a scrolling two-dimensional landscape containing non-interactive pedestrians and foes. A subway system with an entrance in each section of the city allows the player to travel between sections of the city. Before travel, the player must purchase a ticket, with a maximum of five tickets able to be held at any one time. An alcohol, food/rest, and two education meters indicate the player's current status. If both the alcohol level and food/rest level reach zero, the player dies and the game ends. Restaurants, fast food outlets, and convenience stores offer the player nourishment, with price depending on the establishment; there is also a soup kitchen in which a filling meal is available for free. Some stores have limited opening hours displayed on store windows, and others are open at all hours. At night, it is usually advisable that the player find accommodation such as a hotel room, ranging in price from $2 per night to $40 per week; the food/rest levels deplete twice as fast during nighttime. When accommodation is pre-paid, the player leaves his hat \"at home\". Drinking alcohol is an inexpensive means of staying alive; however, the player cannot gain employment while affected. Both education meters, High School and College, require three visits to complete. There are no icons or indications that show the player has a diploma or degree, though, it is simply implied when the meter is full. High School is free to attend, however University requires a $100 tuition payment with each visit. Both are situated in EAST city. Shops and institutions located throughout the city can be entered for special purposes including purchasing alcohol or food, attending school and work, obtaining a haircut and travelling the subway. Besides staying alive, the key focus in the game is accumulating money. The amount of currency possessed by the player is shown in three areas. The majority is represented in a green dollar readout at the bottom of the screen. However, that only shows multiples of $10. The balance of currency (dollars and dimes) are represented in unary notation. Up to nine dollar bills and up to nine dimes are shown, representing how many the player holds. Ten dimes are automatically converted into a dollar bill, and a tenth dollar bill results in the equivalent amount being moved to the green dollar readout section. In early stages of the game, money is collected in the street. Bottles can also be collected from a junkyard and traded for money at an adjacent convenience store. Before entering the junkyard, the player is required to purchase dog bones to appease a guard dog. In late stages of the game, the player can make investments in increments of $10,000. Once an investment is made, the money is removed from game play, aside from the generous 20% interest paid every morning. However, investments don't count towards winning the game. Robbers carrying guns steal any dollar bills you are currently holding (but not dimes or larger amounts). IRS agents take all money the player is currently carrying in the game, except for dollar bills and dimes. Police arrest the player for not having a recent haircut. (A haircut is also a precondition for employment.) On the fifth day, the player's facial hair regrows, requiring another haircut. If arrested, the player is transferred to the City Jail in the South End for a brief period, which can be inconvenient. The four sections of the city have each their purpose: South - initial survival. West - get a haircut and a job. East - get an education. North - make your money grow. A common complaint about the game was that it was sometimes impossible to avoid the IRS character when exiting the subway. As the IRS character would remove the bulk of money from the player, the player would be required to continue the game, almost as if starting again. It was also sometimes impossible to evade a policeman or robber, but the consequences were not as dire. As was usual for many games of the era, no save game feature was available; there was also no pause function. The game also lacks a formal ending. After players reach the $1,000,000 goal, nothing changes in the game - the total keeps increasing but does not show any digits past $999,999.00. Some emulators for modern day personal computers offer pause functions and have the digits roll over when over a million dollars is accumulated. The music in the game is taken from the theme in the first movement of Mozart's Trio for Piano, Clarinet and Viola in E flat major (K498).", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Bob Keener", "publishers": "Melody Hall Publishing Corp.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.6", "wikipedia": "https://en.wikipedia.org/wiki/Rags_to_Riches_%28video_game%29", "video_link": "https://www.youtube.com/watch?v=vcXIJxHevI0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/105961-rags-to-riches\n"}