{"altername_name": [], "name": "Reaction (Haavar B. Hojem)", "overview": "Head to head action game published in Magic Disk 64 1991/08. Hooray! REACTION represents a thoroughbred reaction test for one or two players and four fingers. Depending on whether you are playing alone or with opponents, one or two player displays will appear on the screen. These appear one below the other on a black stripe in front of the blue screen background. In addition to the names of the players, four gray squares can be seen on this black stripe, each with a blue light in the middle. These blue lights now have the habit of flashing red in an irregular sequence. And now the highlight: the four lamps are assigned four letters on the C64 keyboard - namely A, S, D, and F (with two players there are of course eight keys). Depending on which of these four lamps is currently lighting up red, the corresponding key must be pressed. Each time you press the right key, you get two points; if you press the wrong key, the game is over. The longer the game lasts, the less time you have to find the right key. While leaving out a letter has no consequences at the beginning, just not pressing it will limit your urge for highscore after a certain point and the game will end abruptly. Depending on the highscore you got, of course you have the opportunity to immortalize yourself in the leaderboard. Right at the start of the game, when the title graphic appears, you have various options: There is, for example, changing the number of players, which is done using buttons 1 and 2. You can also redefine the four control buttons using the \"Redifine\" function at the beginning of the game. In response to the question \"Redifine Keys On / Off\" at the bottom of the screen, you can enter the definition mode with the R key on your computer. The old game keys are then displayed on the left, which you can then vary according to your shape and finger span. With Space, the accompanying music can be turned off if it interferes with concentration.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Haavar B. Hojem", "publishers": "CP Verlag", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125350-reaction-haavar-b-hojem\n"}