{"altername_name": [], "name": "Relentless 64", "overview": "Back in 2013, Paul 'Axelay' Koositra, rexbeng and Tom & Jerry released a stunning 16KB shoot 'em up called Relentless for the Amstrad CPC - also, somewhat fittingly, as an entry in a 16KB cartridge competition - which it ultimately won. Then, to celebrate Psytronik releasing the cassette version of the CPC game, rexbeng uploaded a C64 version of the loading screen to CSDB as a teaser - but that was all - there was no C64 conversion planned... Until now! Similar to the original, Relentless 64 is a high speed, non-stop score-chasing shmup with some neat score chaining mechanics. The enemy waves come at you thick and fast, and taking out an entire wave rewards you with an increasing score multiplier, resetting back to 1x should you miss a ship or crash. Level progression is akin to Konami's Scramble - no pause to catch your breath, no 'level complete' text, just a scenery/enemy change and onwards you go, leaving a trail of destruction in your wake. The gameplay, aside from the scoring, is pure - no power-ups or bosses, just classic horizontal shooting action at a breathtaking speed. It's fantastic stuff, with multiple difficulty settings (changing the rate of fire of the scenery mounted turrets and player autofire), options for music, sfx or both (with the soundtrack provided by the awesome Cyborgjeff) and proper high score entry (which even remembers your initials between rounds). Download includes the original 16KB cartridge ROM image, a promo demo program and a disk version of the game for use with hardware or an emulator.", "platform": "Commodore 64", "release_date": "2019", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Harris Kladis", "publishers": "Public Domain/Freeware", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=OxlcFyMkvlI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124285-relentless-64\n"}