{"altername_name": ["Balrog of Triad"], "name": "Revenge of Balrog", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". There were Notmen loose on the Northern Steppes. Creatures who were intelligent, yet lived a life ruled by fang and claw, roamed the high mountain meadows and haunted the caves of the cliffs. There were dragons. Though they lived under the rule of Smaegor the Wng they were not peace-loving as he was. They extracted blood from the shepherds and from the tent gypsies who lived off the land. Balrog was the most terrible of these Notmen. For he, with his demonspawn powers, was invincible and roamed where he felt like it, unopposed. Seerson had an itch to reach the far side of the hill. He'd travelled the Delta Valley and the bleak desert Outback with his mother and the Clan. They pitched camp either on the sands outside Belestria or, just as easily, on the grass in the Highlands. Always there was the Crystal to reveal the future to his mother. So, when Seerson struck out over the grassy hillocks in search of his fortune, his mother didn't weep. For the Crystal revealed the landscapes of his journey in advance. She could neither warn him, nor stay with him. What would be, would be. And yet she trembled. For the Crystal did not reveal all. She saw Balrog, a ~ark and evil apparition, looming overhead like a great scavenger bird. She saw the youth collecting the things he would need for his journey. She even saw a glimpse of his destination, a great Fortress in the valley of Time-Stands-Still. but no matter how she stirred the smoke, or how intently she muttered the incantations, she could not cajole the Crystal into revealing the outcome of the battle she knew was inevitable. She could not know if Balrog would slay her child. The Spirit-of-the-Sky hovered above the Northern Steppes, alien to this world, yet knowing the Law. It would not intercede in combat or change the course of events, even though it possessed absolute power. But it would make the Sword easier for Seerson to find, as he struggled for success on the grass below. The Spirit-of-the-Sky had no vested interest in Seerson's quest, only a curiosity in events as they unfolded and a distaste for Balrog's advantage. In the end, a cosmic dice roll decided Seerson' s fate. The Spirit-of-the-Sky watched as the battle drew the last ounce of strength from both combatants. Balrog had superior strength, but Seerson had greater agility. Balrog was the most fearsome looking of the Notmen, but Seerson was not intimidated for he had the Sword. Balrog had raw ferocity, Seerson had cunning. The dice rolled. Seerson slew Balrog and his mother breathed relief over the Crystal, which unfolded the events as they occurred. The Spirit-of-the-sky drifted benignly above the battleground, pleased with its restraint. Seerson gathered all that he had accumulated and started off towards the Fortress and the Valley of Time-Stands-Still.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Andrew Swanson", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126741-revenge-of-balrog\n"}