{"altername_name": [], "name": "Rings'n'Up", "overview": "A single screen platformer created by Francesco Chiola and published in Commodore 64 Club #09 [Italian Release] and also in Alga Soft 1989 n.7a. \"A new adventure for the hero of the famous game Mr. Hat; once he has recovered the magical golden hat, our cute character finds himself again in the midst of dangers and monsters of all kinds. However, the magic hat alone will not be of use to our hero to be able to definitively get out of the enchanted labyrinth into which he has fallen; instead he will have to collect as many rings of power that he will encounter scattered around the numerous rooms of the underground labyrinth. The monsters encountered by the brave Mr. Hat vary according to the rooms in which you are found, just as the traps strewn by the evil guardians of the sacred golden hat vary from the heavy steel balls that suddenly descend from the ceiling to the dense clouds of wandering corrosive gas. through the immense corridors. The ancient legends, however, want as builders of the magical labyrinth a lineage of men with highly advanced scientific abilities who, after we do not know what reason, have reached a state of evil bestiality. At the beginning, however, they developed a series of mechanisms to move quickly in the corridors of the labyrinth; these mechanisms are still functioning and our hero can use them to move from one part of the area in which he is to the other, or to leave the corridors that have no visible exit. These teleportation devices often appear as two small colored platforms placed one on the ceiling and the other on the floor, or as large white buttons highlighted by the teleportation symbol. Once you have collected all the rings present in the visible part of the labyrinth, the hidden case containing a key will open. This key is used to open the door that leads out of the section of the maze you are in, in order to access another area or, who knows, the exit.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Francesco Chiola", "publishers": "Systems Editoriale", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=_Bi8S9F_Ig8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166476-ringsnup\n"}