{"altername_name": ["Rolly"], "name": "Robby", "overview": "An action game reminiscent of Pipe-Dreams where you need to move the different segments to link up flow of water. Published in Italy as Rolly in Go Games n.10 (June 1986). In Input 64 1985/11, and in Input 64 1988/12. The oldies have not only become modern again in the music scene, but also in computer games. The game Robby was such a hit back then. Of course, the old INPUT hands will still know it, but how do our new customers get the game? Unfortunately, that edition is now out of print. That's over now, because here's the game again for those who haven't gotten to know it yet. In this game, Robby, the little robot - once you have started him with the space or fire button - runs through a kind of labyrinth and independently collects various objects whose position is described by a character resembling a T. The labyrinth has it four inputs or outputs and consists of two parts, the inner, moving part and the outer, fixed part. The objects to be collected are in the fixed one, with the inner one representing the actual labyrinth. This consists of a field that is divided into four by four smaller fields. Of these sixteen squares, fifteen are filled with squares identified by symbols. There are seven different symbols in total. Your task is to move these squares using the joystick or keyboard (see table for keyboard assignment) in such a way that Robby always gets a way in front of his roles. You should lay the path in such a way that the robot also has the opportunity to enter the fixed paths in order to collect the objects. It should also be noted that the robot does not turn at intersections, but always goes straight ahead. Ten points are awarded for each item Robby picks up. If all four items are collected in less than three minutes, you will of course receive additional points. A total of three robots are available to you per game. If you score more than 499 points, you get an additional Robby as a bonus, so to speak.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "B. Greiff", "publishers": "Verlag Heinz Heise GmbH", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142431-robby\n"}