{"altername_name": [], "name": "Roberto Lopez: Ritorno alla Locanda du Sol", "overview": "The third game of a text adventure and graphics trilogy featuring Roberto Lopez by Alessandro Zanello published in Adventure Time n.3 (07/1986). Roberto Lopez: Return to the Locanda du Sol The young Mexican archaeologist Roberto Lopez after various studies carried out in Mexico City sets out in search of a hypothetical Aztec treasure. Arriving near the pyramid of Teohuacan, a meticulous work of toponymy begins, reconstructing the plan of the city in outline. Constancy and self-confidence soon give results, in fact, after the discovery of a hidden pyramid, sunk underground, Lopez already seems satisfied, but traveling far and wide he finds what he had always dreamed of. : countless gold objects, from the simplest furnishings to warrior shields and necklaces of all types and sizes, are enclosed in a secret room of the temple. What amazes him, however, is the fact that this find is linked to the previous discovery of a medallion, depicting a hawk's eye, with a ferocious expression. In fact, by inserting this medallion into a falcon's head, carved in the rock, he opens a stone door behind him, which leads precisely into the secret room. But what is strange is the eye symbol, an uncommon symbol in the Aztec period. Determined to investigate, by any means, any detail of his discovery, Roberto Lopez thinks of having an old friend of his, also interested in the Aztec period, named Fernando Cabas, come to the site. The two, excellent friends at the time of university, had met after several years in a specialized shop just a few days before Lopez's departure, and he had informed his friend of his expedition. Fernando had shown himself to be very interested in his colleague's theories and was sincerely sorry not to be able to follow him in this enterprise, but he had promised to join him later if Lopez needed help. Now Lopez must leave the temple and return to the Locanda du Sol, the place from which he left in his van, and, if he gets there, he will have to get in touch with...", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Alessandro Zanello", "publishers": "Edisoft S.r.l.", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166479-roberto-lopez-ritorno-alla-locanda-du-sol\n"}