{"altername_name": [], "name": "Roberto Lopez: Il Segreto di Teohuacan", "overview": "The second game of a text adventure and graphics trilogy featuring Roberto Lopez by Alessandro Zanello and published in Adventure Time n.2 (06/1986). Roberto Lopez, Mexican archaeologist, left Mexico City determined to discover new treasures of the Aztec people. In fact, he is not at all convinced by the assertions of official archaeology, according to which the Aztec treasure was lost during the Spanish invasion of Captain Cortes, therefore Lopez leaves the Mexican capital in a south-easterly direction. After many hours of travel he stops in a village to refuel and decides to stop one night at the Locanda du Sol, a very squalid place but the only one within several miles. The next morning it continues towards Puebla de Saragoza. At one point he notices an Aztec pyramid on the left side of the road, after a quick consultation of the geographical map he recognizes the pyramid of Teohuacan, here he decides to stop and visit it. The entrance to the cave is completely barred by shrubs of all kinds, but after a quarter of an hour of machete blows a passage finally allows passage inside. Wandering through the mazes of the pyramid, Roberto Lopez realizes that he doesn't even know what he is looking for, in fact there is nothing to study or observe here, all the objects of a certain interest have either been stolen or are found in some museum of who knows what nation. However, carefully observing an altar near the entrance to the pyramid, he notices a tiny protrusion resembling a lever, pulling it, a piece of wall begins to move, who knows what strange mechanical reaction. Beyond the opening, a very dark and almost interminable corridor can be seen, but after going down it, the archaeologist finds himself in an underground room certainly outside the perimeter of the pyramid he had entered. Reviewing his movements he realizes that he has ended up in a set of rooms belonging to another building, which remained intact despite the collapse it suffered, which made it invisible from the outside, a collapse due to who knows what strange and fortunate movement telluric. At this point the archaeologist discovers many terracotta vases full of colored powders and remembers that the Aztecs used these powders to dye the precious fabrics, to paint the frescoes in their temples, and they paid by weight every small quantity of these pigments with very intense colors is gold, in fact at the time it was lacking in wealth to own garments dyed with rare and sought-after colors.", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Alessandro Zanello", "publishers": "Edisoft S.r.l.", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166477-roberto-lopez-il-segreto-di-teohuacan\n"}