{"altername_name": [], "name": "Roberto Lopez: La Piramide di Teohuacan", "overview": "The first game of a text adventure and graphics trilogy featuring Roberto Lopez by Alessandro Zanello published in Adventure Time n.1 (05/1986). The pyramid of Teohuacan: Roberto Lopez is a game about a Mexican archaeologist who for several years has been trying to prove that the Aztec treasure was not all lost with the Spanish conquest of Mexico by Cortes but that there must still be something left somewhere. According to Lopez, the recurring archaeologists who have so far dealt with the Aztec excavations have always searched in the temples near Tenochtitlan (Mexico city), the ancient capital of the Aztec kingdom, underestimating a rather important feature, namely the origins of this people. The Aztecs were originally a nomadic people and only later did they settle themselves in a well-placed territory, creating their own region and therefore a capital. After years of studies and failures Lopez believes he has finally come to the head of something, by carefully examining the engravings of the first half of the fifteenth century he realizes that in two of these the image of an Aztec temple drawn in the background is recurring. . So far nothing interesting but on closer inspection Lopez notes that the tiny engravings of the pyramids have an atypical detail in common, the bottom shelf of the pyramid actually represented represents a spherical dome, the discovery of this detail excites him enormously and it is not difficult for him to imagine how this could have remained unknown for so long. The pyramids were in fact engraved in very small dimensions and in fact he too had examined them who knows how many times without noticing anything strange. From here the journey begins!", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Alessandro Zanello", "publishers": "Edisoft S.r.l.", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166478-roberto-lopez-la-piramide-di-teohuacan\n"}