{"altername_name": ["Rocket Away II"], "name": "Rocket Away 2", "overview": "This is a fun hi score attack challenge, suitable for parties and event competitions. This game is not suitable to be played if you have consumed too much alcohol. I think you might know why. :) Your rocket is controlled using a joystick in port 2. If playing on the web player, press \"Spacebar\" on the Blazon intro screen. Also press \"Spacebar\" or \"Fire\" to skip loading picture. Your task is to guide your rocket through an asteroid belt. After approximately one minute, the speed of the map scrolling will go up a level. While controlling your rocket freely through space. You should avoid colliding into the asteroids. Should you hit an asteroid, your energy level will drain. Once the energy level has run out completely, your ship will explode. Once you're gone, you're gone. SCORING, BONUSES AND WINNING THE GAME Points are scored according to the distance your rocket travels during play. The score will stop increasing once you have lost all of your energy and exploded. There are also 'B' pods, which will give you an extra 1,000 points should you pick those up.If you complete all 8 levels (Which will be extremely hard to master) you win the game. GAME OVER After the game is over, your score will be compared to other scores on the hi score table. If your score reaches a higher position, compared to other scores, you will earn a position on that rank. Should your score be below the last position, you will get no hi score position. HIDDEN CHEAT If this game proves to be too hard for you, there is a hidden cheat lurking somewhere in the code. We would love to tell you what it is, but we won't. It will be up to you to find the energy cheat. As a reward, you will get infinite energy on impact. - but there will be a price, especially if you play the disk version. - Your hi score will not save!!! CREDITS Programming, logo design, sprites, sound effects and music: Richard (Starhawk) Bayliss 2x2 Charset, loading bitmap: Firelord 1x1 Charset: Dirk S Tape loader system: Martin Piper & Richard Bayliss Testing, suggestions and feedback: Logiker, Firelord, Baracuda Directory artwork: Logiker", "platform": "Commodore 64", "release_date": "October 15, 2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Richard Bayliss", "publishers": "itch.io", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160356-rocket-away-2\n"}