{"altername_name": ["The Legend of Atlantis"], "name": "Rocky Memphis: The Legend of Atlantis", "overview": "Stuart Collier & Trevor Storey have teamed up once again and have recruited the musical talents of Saul Cross to bring you ROCKY MEMPHIS - THE LEGEND OF ATLANTIS. Explore the ancient temple ruins on a quest to find the secret of the lost city of Atlantis! Use all your cunning and skill to search the rooms in the temple for clues, useful objects and hidden switches. Watch out for the deadly inhabitants of the temple including bats, scorpions and lethal boobytraps! ** THE LEGEND OF ATLANTIS STORY ** For centuries men have searched for clues to the once great city of Atlantis. But in the heart of Africa, in the centre of a dried inner ocean the last remaining temples of Atlantis have remained. Water now replaced by sand, hidden from man for thousands of years. Yet on the other side of earth, in the new world lie clues waiting to be discovered. Clues that point the way to a temple in North Africa and possibly the path to Atlantis. The Legend of Atlantis (C64) ** THE LEGEND OF ATLANTIS FEATURES ** · Lots of screens to explore · Detailed hi-res graphics · Atmospheric music · Cunning traps and puzzles to solve · Lots of objects to collect and use · Intro & end sequences · SD2IEC compatible · PAL and NTSC compatible The Legend of Atlantis (C64) ** THE LEGEND OF ATLANTIS CREDITS ** Coding by Stuart Collier Game Design & Graphics by Trevor Storey Music by Saul Cross Packaging Artwork by Trevor Storey The winner of the 2018 Reset64 Magazine Game of the Year", "platform": "Commodore 64", "release_date": "June 17, 2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Stuart Collier", "publishers": "Psytronik Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=AJJ65NqoiyM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118406-rocky-memphis-the-legend-of-atlantis\n"}