{"altername_name": [], "name": "Rogue Burger One", "overview": "\"Rogue Burger One was viciously thrown into the sewers after being discarded by a Norwegian vegan. Angry with the world she grew up in, rogue burger one swore to hunt down the suffering fast food revenants in the sewers beneath Oslo, putting them out of their misery by smiting them with pizza. While undertaking this huge burden, she came across a score of sacred scrolls that would forever change her destiny. Will rogue burger one ever find true happiness? Only the most audacious adventurer will ever reveal this divine secret, unravelling a recipe for the ultimate delight!\" Rogue Burger One is an modern epic and truly heartwarming adventure that lets the player enjoy a wonderful journey through ... fast-food infested sewers? Uhm. Actually, the game has some rough graphics, harsh environments and viciously punishes the unprepared player. Deaths will be plentiful, either through good or poor level design. Attacking unprepared will lead to more pain and suffering, and worst of all: you only have a single life. Fortunately, health, ammo and other kinds of upgrades are haphazardly stashed around the labyrinth, preparing the diligent adventurer for a possible legendary boss fight. Or not. Instructions Pick up blinking stuff. Avoid moving stuff. Shoot by pressing fire. Space bar to view current scroll fragments. Don't die. Search for upgrades and friends. Rogue Burger One is a 22kb game for the Commodore 64. It runs best on original hardware, but can also be enjoyed on a modern emulator such as Vice. It is LemonSpawn's first (but not last) C64 game, and is the first production developed entirely with the new Commodore 64 game development suite named Turbo Rascal Syntax Error (TRSE) . Which, incidentally, is also developed by LemonSpawn. Original release: 29/08/2018. The full source code & resources for the game are included in the TRSE framework package (from version 0.03). Hint: There actually exists a proper main pacifist-like ending for this game. Some burger action footage can be seen in this development promo video:", "platform": "Commodore 64", "release_date": "August 29, 2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Leuat", "publishers": "Public Domain/Freeware", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=0qtepUV5iMY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166484-rogue-burger-one\n"}