{"altername_name": [], "name": "Rolling Twins", "overview": "Published in Magic Disk 64 1991/11, Game On GE 1993/2. ROLLING TWINS \"The legend of the rolling balls\" - this is how the author of ROLLING TWINS, Gabor Gaspar, called his game. Whether it will become a legend remains to be seen, but see or. It is definitely worth playing. The aim of ROLLING TWINS is to collect a certain number of \"cells\" by touching two balls within a merciless time limit. The highlight, however, is: You control the two balls at the same time! ! ! This is possible because the screen is split horizontally into two halves and so a ball can move in each half. Since the area on which the balls are rolling unfortunately not only the bonus cells but also obstacles (obstacle stones) are located, the harmony of the \"rolling twins\" on the cell hunt will soon be disrupted.Do you have any idea what this is going to be? Yes - due to the differently distributed obstacle stones in the two balls, one ball hits one very soon, while the other rolls through the area completely unmolested. So it can (could) happen that the upper ball has already \"cleared everything\", while the lower one is still waiting idly between some stones for help. So you should try to keep an eye on both balls simultaneously and to steer them accordingly. This is the main difficulty with ROLLING TWINS. Then there are other bonus and obstacle stones as well, e.g. B. those with question marks that turn the vertical control of your balls so that they roll instead of up, down or vice versa. With each level, the number of cells that you have to collect increases. It is the same with the number and variation of the various sturgeon stones. So you have to hurry up to collect all the cells in time; to be honest, even in the first level, I didn't find the time very generous. The fact that the balls do not react immediately to horizontal changes of direction, but only with a slight time delay (they roll slower and slower until they finally come to a standstill), makes control even more difficult. The number of cells still to be collected in the respective level can be found in the display bar in the middle of the screen, as well as the time remaining for this.", "platform": "Commodore 64", "release_date": "November 4, 1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Gábor Gaspar", "publishers": "CP Verlag", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Vq8NHHlntv0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126350-rolling-twins\n"}