{"altername_name": [], "name": "Royal Rescue", "overview": "A single screen platformer written by Ligia Latino and published in COMPUTE!'s Gazette 1990/01 (Issue #79). The kingdom is in a royal mess. It's almost time for your wedding, but the princess is nowhere to be found. Word has it that she has been kidnapped by a fire-breathing dragon and taken to its lair — the dreaded Dark Castle. Hmm, sounds like the king is behind this one. But you have no choice; you must fulfill your destiny and prove yourself worthy of his daughter's hand. So, off you ride on yel another perilous adventure. In Royal Rescue, you search the Dark Castle for the princess and attempt to rescue her from the fiery dragon. The castle is a labyrinth of rooms connected by halls, doorways, and stairs. Each room is filled with treasures, keys, and the keepers of the castle — the deadly Tink Marshmallows. So get ready. If you're not quick and quick-witted, you'll soon find yourself well done! Save the Princess The princess is hidden somewhere within the Dark Castle's 16 rooms. To move around in the castle, push the joystick in the direction you wish to go. Press the fire button to jump over any obstacles. Some rooms in the castle have doors that are locked. To unlock a door, you need a key. Keys and other treasures — cherries, flowers, and bells — are scattered throughout the castle. Whenever you come across a treasure, pick it up by touching it. Points are awarded for each treasure you capture. Cherries are worth 50 points; flowers, 100 points; bells, 200 points; and keys, 500 points. Also, every door you open gives you 1000 points. You begin the game with six lives. Each bell you capture gives you an extra life. You can have as many as nine lives at any point in the game. As you move from room to room, be sure to avoid the Pink Marshmallows — the dragon's unconditional allies. There are two types of Pink Marshmallows: roving marshmallows, which you can destroy, and stationary marshmallows, which you never can get rid of. If you collide with either, you'll lose a life. A game ends when you reach the princess or lose all of your lives. Press fl at any time to start a new game. Game strategy To increase your chances of success, closely watch the Pink Marshmallows. These fiendish blimps always appear at the same locations in rooms and follow the same paths. A good strategy is to enter a room, observe the Marshmallows for a moment, and then quickly exit the room. Repeat this procedure until you've learned where the safe spots in the room are. Some rooms in the castle have areas that appear impossible to reach, even by jumping. But be patient. As you become more familiar with the castle, you'll find ways to reach these areas from other rooms.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Ligia Latino", "publishers": "COMPUTE! Publications", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=N0zt858xoXc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116652-royal-rescue\n"}