{"altername_name": ["Sam's Journey EasyFlash Edition"], "name": "Sam's Journey", "overview": "Sam's Journey is a brand-new original scrolling platform game developed for the Commodore 64 home computer. It's about a cute little hero called Sam who finds himself on an unexpected journey in a strange world. Guide Sam through many different locations such as deep forests, hot deserts or frozen mountains! Find hidden gems and discover secret passages, but beware of the creatures! Sam can run, jump, climb and swim. He can pick up items, carry them around and throw them at enemies. And with the power of special costumes, Sam completely changes his appearance and gains additional skills! Protovision is proud to present Sam's journey from Knights of Bytes, probably the most ambitioned platform game for the Commodore 64 of all times! The digital edition of Sam's Journey includes: - Sam disk version PAL (4 d64 files) - Sam disk version NTSC (4 d64 files) - Sam cartridge version PAL English (GMod2 files) - Sam cartridge version PAL Spanish (GMod2 files) - Manual as PDF Note for cartridge versions: the cartridge files are currently emulated only by VICE 3.1+. They cannot be used with an EasyFlash cartridge or 1541 Ultimate. For the disk versions, these limitations do not apply. Although Sam is quite small, he can run very fast and jump even higher. That's why the camera has to hurry up and keep track, no matter where he's going! Sam has a variety of basic moves. While running and jumping are obvious skills, his ability to climb makes him able to reach new heights. And with his free diving skill, he can explore the underwater passages of the deep sea. The world of Sam's Journey is not only a visual one. Every scenery that Sam traverses on his journey comes with its own unique song that emphasizes the location's atmosphere. Game Features: - Classic 8-Bit Platform Action - Very colorful Graphics - Fast Free-Directional Scrolling - Many Basic Moves Plus Climbing And Swimming - 6 Special Costumes With Additional Skills - 3 Overworld Maps - 27 Huge Levels With Multiple Sections - 2000 Screens To Be Explored - 14 Different Graphical Settings - 19 Beautiful Tunes - Sound Effects - Hidden Items To Be Found - Secret Passages To Be Discovered - Checkpoint System - Savegame Option, also on Cartridge", "platform": "Commodore 64", "release_date": "December 24, 2017", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Knights of Bytes", "publishers": "Protovision", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.82", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=vE5jF2ACdbk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92959-sams-journey\n"}