{"altername_name": [], "name": "Santa's Rats Issue", "overview": "It's Christmas Eve! Your longest night is nearing its end when you discover that, in a small town, rats have joined forces with other animals to fill houses with dangerous presents as revenge for the traps\\n So your task doubles: not only will you have to deliver the right presents under the Christmas trees, but you'll have to remove the bad ones - all before morning comes. A little new-old Xmas C64 game, by Marco Giorgini (with an original soundtrack by Andrea Capitani) A special thanks to Eric Akeson for his priceless testing time. This is my first C64 game. I really hope you enjoy it. If so, and if you have the time, I'll be really happy if you help spread it around by sharing your gameplay or talking about it. Ah, this game is free. I won't mind a few dollars for a coffee or a beer, but they're not really necessary. If you have something extra to share, please do so with those close to you who may be having a better day for a little unexpected surprise. Hey, it is Christmas after all :-) Some general notes about the game: - the complete game is the full version. It's the one with 9 different levels and a game movement change while going on playing again them with less time - if you're able to beat them. The game has not a specific end - it's you against your top score (that won't be saved once you leave, sorry). The original version (released before Xmas) has just the first three levels (and then goes on repeating with them). - exploding gifts give you more points, so if you can it's better to take them in order (after a trembling one check where's the new next one) - rats and bats defeat you with a single touch, so watch out when you jump even for animals moving on the above level - inside walls with a hole in the lower part leave rats running thru them, while of course you can't (this will happen in levels 4-5-6-7-8-9) - holes in the background (black) walls let the rats to move from a room to another one, even on a different floor (this will happen in levels 7-8-9)", "platform": "Commodore 64", "release_date": "December 22, 2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Marco Giorgini", "publishers": "itch.io", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtube.com/watch?v=-B3jPa3s0Wg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158310-santas-rats-issue\n"}