{"altername_name": [], "name": "Sargon II", "overview": "The original SARGON was written by Dan and Kathleen 'Kathe' Spracklen in a Z80-based computer called Wavemate Jupiter III using assembly language through TDL Macro Assembler. The name was originally written entirely in capitals because early computer operating systems such as CP/M did not support lower-case file names. SARGON was introduced at the 1978 West Coast Computer Faire where it won the first computer chess tournament held strictly for microcomputers, with a score of 5-0. This success encouraged the authors to seek financial income by selling the program directly to customers. Since magnetic media were not widely available at the time, the authors placed an advert in Byte Magazine and mailed $15 photocopied listings that would work in any Z80-based microcomputer. Availability of the source code allowed porting to other machines. For example, the March–April 1979 issue of Recreational Computing describes a project that converted Sargon to an 8080 program by using macros. Later the Spracklens were contacted by Hayden Books and a book was published. The Spracklens made significant improvements on the original program and released Sargon II. In 1978 it tied for third at the ninth North American Computer Chess Championship despite being seeded ninth of 12 entries. Sargon finished only behind Belle and Chess 4.7, and defeated AWIT—running on a $5 million Amdahl mainframe—amazing the audience. That year they published a series of articles in BYTE on computer chess programming, stating \"we think it would be nice if not everyone had to reinvent the wheel\". Sargon II was ported to a variety of personal computers popular in the early 1980s. The game engine featured multiple levels of lookahead to make it more accessible to beginning chess players. BYTE in 1980 estimated that Sargon II had a 1500 rating at the highest tournament-time difficulty level, and speculated that it was the best chess program on sale, including dedicated devices.", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Alex Ford", "publishers": "Hayden Software Co., Inc.", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Sargon_(chess)", "video_link": "https://www.youtube.com/watch?v=m-oYQP5qZMs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33351-sargon-ii\n"}