{"altername_name": ["Schwert und Magie"], "name": "Schwert und Magie I", "overview": "Schwert und Magie I is a German text adventure that incorporates elements of a fantasy single-player role-playing game in which the player embodies a 1st degree hero (or heroine) who has to solve a specific task by choosing between given alternatives. Your character is assigned certain primary attributes that are randomly determined at the beginning, for which you have to take tests as you progresses. The primary attributes are assigned among four choices: Intelligenz (Intelligence) (In), Charme (Charm) (Ch), Stärke (Strength) (St) and Geschicklichkeit (Dexterity) (Ge). The attributes that have an effect in combat are: Vitalität (Vitality) (Vit), Tapferkeit (Bravery) (Ta), Angriff (Attack) (An) and Verteidigung (Defense) (Ve). Folge Nr. 1: Das geheimnisvolle Kraut - You wander, with both your wallet and stomach empty, aimlessly through the narrow streets of the city of Seghem in the province of Elluria which you reached this afternoon, asking here and there for something to do. A master craftsman, who informs you with feigned regret that he has no vacancy at the moment, says goodbye. However, he has heard that the court magician is looking for someone for a difficult task. So you decide to go up to the castle. There you meet a pretty young woman with long black hair. Her name is Ijale and she is the daughter of His Majesty King Kasimirs. She asks you to find a specific medicinal herb that is difficult to obtain. Otherwise her father might die. Then her fiancé, the court wizard Thyron, a tall man in his thirties, clad in a dark cloak embroidered with magical symbols tells you that there is only one remedy for this Purple Fever disease: a tea made from a rare medicinal plant called Sanarie (sanus = Latin healthy; author's note). Unfortunately, he doesn't have this herb in stock. The only place where it can still be found is in a large forest a day's journey from the castle. You're supposed to get one of those plants from there. After he warns you about a witch that lives in the forest, he also gives you a left-handed glove that prevents dirt from your hands to affect the healing power of the plant and an old textbook with the page that shows a Sanarie, describes its development and its use against Purple Fever and other diseases. The next morning you leave early. In the evening you can already see the forest where you decide to spend the night at the edge of the forest.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "German Design Group", "publishers": "CP Verlag", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/189070-schwert-und-magie-i\n"}