{"altername_name": [], "name": "Scorpion (Argus Specialist Publications)", "overview": "Scorpion is a 1988 horizontal scrolling shooter developed by Leslie Wigmore and published in the following: - Commodore Disk User 1988/09-10 - Your Commodore 1990/11 (Tape #10) Big place, the Galaxy. But not big enough. It's all summed up in Semionovich's First Law, a sociological corollary of the famous Lorentz-Fitzgerald equations. Semionovitch broadly stated that, just as it is completely unfeasible to achieve the speed of light within the constraints of normal space- time, it is similarly impossible for any intelligent life form to attain the point at which it is satisfied with its supply of resources and living space. Of course, just as the Lorentz-Fitzgerald equations were overthrown by Grace's Hypergeometry Theory in 2243, so Semionovitch may yet be disproved. Tell it to the Space Marines. Our job, as an unbiased multi-racial peacekeeping force is to keep those lifeforms who insist on obeying the Semionovitch dictums in line (the expression 'blowing them away' is frowned on in the modem SM. We prefer keeping the peace with maximum prejudice'). The finest tool of the Space Marines is the galaxy fighter Scorpion. Now you too can sample the danger and excitement that a spell in the Space Marines offers you. Just drop in at your local recruiting office and ask to try our Scorpion simulator. You will incur no obligation. We stress that the brain-to-computer input techniques used in the Scorpion simulator are entirely non-invasive -only the sensory centres of the brain are stimulated. The fact that 99 percent of simulation users subsequently join up can simply be attributed to the excellent terms and conditions of service contained in our standard 99-year contract. Well what are you waiting for, kid? Hit that simulation. We'll see you in the Marines.", "platform": "Commodore 64", "release_date": "September 15, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Leslie Wigmore", "publishers": "Argus Specialist Publications", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156677-scorpion-argus-specialist-publications\n"}