{"altername_name": [], "name": "Scout the Stray", "overview": "The character that the player will have to control is Scout, a stray dog, who has to go through different mazes munching on the bones scattered in them and avoiding being captured by the dog catchers who are chasing him. A level will end when all bones have been eaten. The game has 32 levels to complete. It must be said, however, that the mazes are procedurally generated in a random way, therefore, with each new game, the player will find himself facing ever-changing levels. As the player advances through the levels, the speed of the chasers will increase more and more until he reaches the last level. As a defense weapon, Scout has \"barks\" at his disposal, with which he can scare the dog catchers who will run away from our hero for a few seconds. As long as the enemies are scared, they are completely harmless. However, the barks cannot be used repeatedly, since about 3 seconds will have to pass before being able to bark again (at the top left of the screen there is a small bar that indicates the \"charge\" status of the bark). For every certain number of bones devoured, a \"magic\" ball will come into play which, depending on the color, will perform different actions once collected. The red ball will activate the “x3” (the bones eaten later will be worth 30 points instead of 10). The blue ball will make all the enemies run away just like when using the bark. The purple ball will activate a letter inside the writing EXTRA placed at the top center of the screen; once the writing is complete, the player will earn a life. The cyan ball will make the dog catchers disappear for a few seconds, after which they will re-enter the entrance gate of the maze as if nothing had happened. Finally, there is a ball that changes color and that will give a different score depending on it (brown = 1000, green = 2000, yellow = 3000).", "platform": "Commodore 64", "release_date": "December 16, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "LC-Games", "publishers": "itch.io", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bgNYQfEifS4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167907-scout-the-stray\n"}