{"altername_name": ["Bomber (Italy)"], "name": "Shaft Raider", "overview": "A Skramble style horizontal shooter released in Italy in Go Games n.8 (Aprile 1986) as \"Bomber\". Shoot or bomb fuel to keep your reserves up and see how far you can penetrate the dangerous and twisting shaft. What do you do when you want to write a game that is better than Airstrike, Protector and Caverns of Mars? Easy, you write one that combines the best of all three and add some improvements. That is basically what Shaft Raider is. You start with five ships in a horizontally scrolling landscape as in Airstrike but the first thing you notice is that the graphics of the cavern or the shaft are much better. In the early stages there are no missiles being launched but you have to bomb or shoot fuel and ammo dumps and stationary missiles whilst avoiding flak. The flak is quite dangerous, appearing at random, sometimes right on top of your ship giving you no chance to maneuver. As you enter and progress down the shaft there are space mines bobbing up and down which you cannot shoot, just avoid. When there are three or four in quick succession it is quite a feat of navigation to weave between them. Shortly after the space mines come force fields to navigate through followed by the Protector- type buildings with fuel tanks embedded in their roofs and the first of the launching missiles. Some of them you can shoot but others you must avoid, there is no way of telling which. So it goes on. More and more hazards, narrower passages and more difficult force fields until you reach the Master Mine.", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Gregory S.M. Helleren", "publishers": "Program One, Inc.", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=zjbIFQJrLu0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127136-shaft-raider\n"}