{"altername_name": [], "name": "Shedmaster Bounds Green", "overview": "The introduction of Inter-City 125 High Speed Trains in the mid and late 1970s brought new standards of passenger travel, and radical changes in methods of railway operation. Fixed formation sets are diagrammed for intense utilization and rapid turnrounds by day and depot attention by night. Sets clocking up typically 800-100 miles of running in the course of a day require a nightly 'environmental' service supplemented by a comprehensive 'A' examination every other night. Major examinations are undertaken at progressively longer intervals, culminating in a complete works overhaul every few years. To service HST's depots were designed on a flow line system, and in this simulation you are the mid-week (Monday to Thursday) Night Production Manager at Bounds Green depot some five miles north of Kings Cross. You direct and oversee servicing and maintenance of HST's arriving at Bounds Green each night, ensuring that where possible mechanically sound sets are provided for the following day's workings. Your screen display shows the progress of HST's through the flow line system. Time is updated in 20 minute increments by pressing the RETURN key rather than inputing a set number. On each hour the supervisor provides updates, if HST work is outstanding you will be given the opportunity of diverting labour from the heavy repair shop to aid service and maintenance roads. Two men may be directed to one or more of the roads. Enter the required codes in response to the 'men' prompt, a direct pressing of the RETURN key will result in a result to normal working. Any such redeployment will obviously disrupt the scheduled workload and in practical terms this may delay a spare power car becoming available later. Each shift begins with a TOPS listing giving the condition and expected arrival times of incoming sets. Having been informed of the staffing situation try to formulate a strategy for dealing with the night's work. From 2040 hrs onwards, coaching stock undergoing daytime servicing will vacate the depot, and HST's will begin to arrive at Ferme Park. As sets become available they must be directed through the washing facility by specifying the 'W' command, if the washer is free and no more than one set is waiting at Bowes Park Waiting sets are directed into a service or maintenance road in the shed by entering a road code (S1-S4, M1 or M2) ensuring the selected road is free. Sets requiring remedial attention (denoted by /R on the end of their service code) should, if possible, be dealt with in maintenance roads (M1,M2) with any spare capacity in the M roads being sued for A examinations (AEX) rather than environmental (ENV) servicing. If remedial (AE/R or EN/R) looks like taking too long you have the options of swapping to a spare, if available (type PS), or aborting the work (type PA) sending the set out with a single working power car as a last resort measure.", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Dee-Kay Systems", "publishers": "Dee-Kay Systems", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367527-shedmaster-bounds-green\n"}