{"altername_name": [], "name": "Slipstream", "overview": "** SLIPSTREAM STORY ** In the year 14634 the inhabitants of the Omikron system built a shielding system to protect their home planets from asteroid showers that regularly struck their world. Something went wrong. An energy burst detected near the shielding station caused the robots defending the system to malfunction. The robots began to classify whole planets in nearby star systems as asteroids and began attacking them. It was only a matter of time before they started attacking inhabited worlds. The SLIPSTREAM starship was constructed as a way of stopping the robots. Your mission is to take control of the Slipstream through a remote interface, find the missing robots and destroy them. GOOD LUCK, CAPTAIN. ** SLIPSTREAM FEATURES ** · Runs on a standard C64 + Plus/4 or expanded C16! · Slick presentation. · Awesome 3D polygon graphics. · Digitised Speech. · Boss Battles. · Single or dual joystick control system. · PAL and NTSC compatible · SD2IEC compatible. · C64 version supports SuperCPU and Turbo Chameleon 64 hardware for improved framerates. ** SLIPSTREAM CREDITS ** Idea & concept: Stefan Mader Graphics: Rainer Muehr + Stefan Mader Music: Ingo Jache + Ronny Krueger (C16) + Ronny Engmann (C64) Loader: Gunnar Ruthenberg Editing: Csabo of Lod Artwork: Nero A 2017 Boyknecht Production Published by www.psytronik.net ** SYSTEM REQUIREMENTS ** Slipstream is a game for the Commodore 64, Commodore Plus/4 and Expanded C16 computers. You can play the game in an emulator (we recommend VICE for C64 and YAPE for C16 / Plus4) or you can port the game onto real C64 hardware if you have the resources to do so. The download file features the .d64 (disk version) of the game + game instructions.", "platform": "Commodore 64", "release_date": "2017", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Bauknecht Production", "publishers": "Psytronik Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "https://youtu.be/9B1D4lviOik", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97297-slipstream\n"}