{"altername_name": [], "name": "Snakman", "overview": "A Pac-Man style game from Peter J. Glaze and published in 1983. The SNAKMAN accumulates 5 points for each green token and 25 points for each red token captured. You may obtain more green and red tokens by capturing all of the green tokens. Whenever red tokens are captured, the four colored gremlins turn white and become vulnerable to capture for a period of approximately six seconds. A sound change during the vulnerability period indicates that the period is almost over. The point value for gremlin capture increases according to the number of gremlins captured during a single vulnerability period, and always shows at the bottom of the play area. The colored gremlins must not touch SNAKMAN otherwise the SNAKMAN is forfeited, and replaced with an available spare SNAKMAN. The number of barrier. available spare SNAKMAN tokens always shows in the game play area. The high score for a game session is always dis- played. From time to time, bonus tokens will appear in the bonus area of the maze. The point value of the token is also shown at the bottom of the play area. The joystick for the keyboard keys) have memory. That is to say that the direction indicated by the position of the joystick is remembered. The SNAKMAN will continue in the same direction when the joystick is in the center position or when no keys are pressed. If you control the SNAKMAN in a direction it cannot go (because of a barrier in the maze). it will continue in its original direction until it can move in the desired direction. The duration of a vulnerability period can be extended by capturing an additional red token before the end of the period. When a gremlin is captured, it returns to the jail in the center of the play area. It does, however. quickly escape from jail. A technique of \"working the jail consists of repeated capture of a gremlin just as it escapes from jail. See if you can figure out how to trap and capture gremlins at will while they are in the jail. Working the jail\" can build large scores quickly. The bonus tokens are not presented for capture until tokens in the \"U-shaped area of the maze are captured. SNAKMAN can be \"parked\".", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Peter J. Glaze", "publishers": "Microdigital", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127756-snakman\n"}