{"altername_name": [], "name": "Sonic the Hedgehog", "overview": "From the developer of the C64 port of Prince of Persia and Donkey Kong Jr. comes Sonic the Hedgehog, a faithful port of the Sega Master System version of the game. This port requires REU emulation (in VICE, click on the settings tab, then click on settings, then cartridges, then RAM Expansion Module, and make sure you choose a minimum of 512K, but it doesn't hurt to choose higher). This port was released on December 19, 2021. Description: To stop the evil Dr. Robotnik, Sonic must traverse six zones consisting of three levels each. Most of the zones are based on those in the original game, but some are entirely new, including a jungle environment and a huge airship. Other unique differences are one level that scrolls automatically and one that is aligned vertically instead of horizontally. Most of the enemies (mechanized animals, defeated by Sonic's spikes when jumping or rolling) and power-ups (speed-ups, shields, extra lives) are the same as in the Genesis version as well. Sonic can pick up golden rings for protection (when hit, he simply loses all of his rings instead of a life) and bonuses: 100 rings gain Sonic an extra life, and 50 remaining rings at the end of a level allow access to pinball-themed special stages full of bumpers and springs. The final level of a zone is always a boss fight against Robotnik. Some of the boss fights differ in the Master System and Game Gear versions of the game, with special designs for the handheld version due to the smaller visible screen area. Sonic should also collect the six Chaos Emeralds to keep them from falling into Robotnik's hands. In a departure from the original game, these are not hidden in the special stages but somewhere in the regular levels. Code and SFX: Andreas \"Mr. Sid\" Varga Graphics: Oliver \"Veto\" Lindau Music: Mikkel \"Encore\" Hastrup", "platform": "Commodore 64", "release_date": "December 19, 2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Andreas Varga", "publishers": "Public Domain/Freeware", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.40", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=_Cg8r-VmeMk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157320-sonic-the-hedgehog\n"}