{"altername_name": [], "name": "Space Taxi", "overview": "Piloting a Space Taxi, you must pick up passengers from \"pads\" and carry them to whatever other pads they wish to go. Space Taxi features 25 screens with varying obstacles and challenges that must be navigated in order to collect your fare. Although Space Taxis sort of resemble yellow Checker Cabs, they operate on a different principle - the longer you take to deliver a passenger, the less money you collect. In addition to watching the clock because of an incentive to collect money, players have to be aware of their fuel supply. Run out of fuel, and you will crash. Quote from Developer from the Lemon64 Website 25 Feb 2008--- \"Hey Everyone! Thanks for the many very nice comments about Space Taxi. My 11 year old son found this site the other day and showed it to me. It's nice to see the game had so many fans. I wrote the game my freshman year at Hopkins amidst going to school full time. I remember creating many of the levels during winter break once I had developed the main physics engine and the main game play loop. I think one of the reasons the play caught on with people is due to the true physics formulas used for gravity, thrusting, etc, used to move the taxi. The voice is actually my own, which I recorded with some electronics that I had to build myself and figured out how to wire into the C64 (back then digital recording was not very commonplace!) I have many fond memories of my time at Muse and the opportunity to create this game. After seeing everyone's comments I thought I would drop a quick line, and thank you all for your kind words. Right now I'm running a medical database software company ([www]) that I founded in college and sadly never had time to program any more games once I got into that. Thanks again all! - JK\"", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Muse Software", "publishers": "Muse Software", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "4.56", "wikipedia": "https://en.m.wikipedia.org/wiki/Space_Taxi", "video_link": "https://www.youtube.com/watch?v=Qukr6V3G4zs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/17889-space-taxi\n"}