{"altername_name": ["Space-Pilot"], "name": "Space Pilot", "overview": "Space-Pilot is a multi-directionally scrolling shooter based on the arcade classic Time Pilot by Kingsoft from 1984. The player steers a figher jet, which has obviously been equipped with a time machine, through 5 time zones, in which he has to defend himself against hostile flying armed forces fitting the corresponding epoch. If 56 hostile machines have been destroyed, a mother ship appears which can be shot with 5 shots, whereupon the time jump to the next era follows: - Bonus points can be gained by collecting sky divers and destroying enemies in formation flight. - After finishing the fifth and last time zone successfully, the game starts anew. - Time zone 1 - 1919: The age of the double deckers. These are slower than the own jet but they defend themselves with bombs. To finish this epoch of WWI you need to shoot a zeppelin. - Time zone 2 - 1940: \"Spitfires\" and \"Heinkels\" are now the enemies. These fly faster and have a stronger firepower. A bomber can also appear, which needs to be hit 3x to get a bonus of 1.500 points. At the end of this level a \"Junker\" appears. - Time zone 3 - 1970: Here you meet combat helicopters that reach the speed of your own jet and shoot missiles. At the end of the level you need to shoot a Chinook transport helicopter, although the manual talks about a \"Gunship\" combat helicopter. - Time zone 4 - 1984: The age of the fighting jets. They are very fast and agile and have a deadly armoury. This epoch is finished by shooting an oversized prototype. - Time zone 5 - 2001: The attack of the flying saucers. In a meteorite field you need to make your way against the attackers and then destroy the mother ship.", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Henrik Wening", "publishers": "Anirog Software", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=0UUhGsMO5x0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29764-space-pilot\n"}