{"altername_name": [], "name": "Space-Ball II", "overview": "A racing game for 1 or 2 published in 64'er Sonderheft 61. In the vast universe, far from any imagination, lies the wall of time. Yes, any one of us can fall into one of the innumerable dimensional holes and, in order to return from the other side of the universe, has to compete in the big race in the Space Ball. It was late in the evening and there was nothing sensible on the television (although he had a front row seat). So Walter Hombert put down his diet biscuits and decided to switch off the boob tube. Slowly, somewhat disappointed by what the program makers had offered him today, he switched himself out of his bulky television armchair, which, due to its unfavorable construction, had not even allowed him a well-earned television sleep. With weary steps he shuffled to the light switch to tell his living room by depriving himself of the light that this was finally the end of it - he didn't believe his senses, his hand groped in emptiness. Walter, a normally stressed person, lost his balance almost immediately. But the wall, as usual, did not stop his fall: he fell right through it. Into the great, dark nothingness. When Walter regains consciousness, he notices that everything around him has changed. Slight nausea galls his general condition, and he soon knows the reason. A constant up and down movement, each followed by a melodic pop: A water bed? What happened? Walter remembers reading about dimension holes in a paper by Anton Einfels. But can you believe it? Just now, before he went to bed, he fell into one of them. And much worse: According to Professor Einfels' theory, the big spaceball race is imminent. Somewhere in our real world, a C64 owner loads the game LOAD \"SPACEBALL II\", 8 and starts with RUN. With this he activates Walter's spaceball and perhaps wakes him up from his nightmare.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Hannes Sommer", "publishers": "Markt & Technik", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129468-space-ball-ii\n"}