{"altername_name": [], "name": "Spelunker", "overview": "As far back as I can remember, I was born to explore caves. This is probably the same with all cavers. The prickling in the tummy, even already when you see a cleavage in the rock, can be enormous and if you also have the suspicion that maybe, as in this cave, there could be treasures hidden, one cannot hold oneself back any longer. But be warned, this cave is different from all the others, it has the reputation to devour researchers. At first, it is so dark that you cannot see your own hand in front of you, and it is hot, because steam is shooting out of every crack in the volcanic rock. This steam cooks you in 10 seconds, then you look like a lobster. And then those bats, really disgusting creatures, they eat you neck and crop and can only be chased away with flares. Then you also need dynamite to bomb away the boulders that block the main shaft again and again. And I tell you, if you do not pay attention, you can sweep yourself away. That this has happened to many before can be seen by the ropes that hang around everywhere, by the ladders that were attached and the rails. The stuff is helpful until you reach the underground waterfalls. There you need to use a barrel to go on. What a luncay, I tell you!! I will never forget that. Deep in the main shaft there are artefacts and treasures, but most important are the keys, without them you cannot proceed. If I had found none, it probably would have been better for me... Then everything happened so fast... I saw the gleam of the fathomless treasure, I had found it, the hidden pyramid!! Then I felt a hit from behind, the ghosts of cavers that have lost their lives here!! This was it, I had no chance any more. And thus I can only warn you, keep an alert eye and a keen mind, because I am now also down here. For ever!! I am now one of them. And I also wait for only one of your mistakes... Spelunker can be assigned to the genre of action-adventures, but has also some strategy elements. The graphics which scroll into all directions (the scrolling happens when the border of the screen has been reached) are kept relatively simple due to the early date of creation, in return, the labyrinth is enormously big and the build-up is very well thought through. The sound consists mainly of a series of sounds and FX. Steering the character must be done very exactly and jumps need to be done pixel exact.", "platform": "Commodore 64", "release_date": "March 13, 1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Tim Martin", "publishers": "Brøderbund Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.94", "wikipedia": "https://en.wikipedia.org/wiki/Spelunker_%28video_game%29", "video_link": "http://www.youtube.com/watch?v=uEqHov8BwwI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33205-spelunker\n"}