{"altername_name": ["A Tale of Spider Mountain"], "name": "Spider Mountain", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". A cold desert wind whipped across the dunes. Iron Knife stirred under the coarse blanket, opened one eye just a little, then closed it again, determined to wring the last moment of sleep from the night. As the light of the dawn grew brighter, the burdenbeast began to stir. The wind began to fade and the last wisps of smoke from the dying camp-fire hung over the camp like a shroud. Iron Knife was awake, though his eyes were still closed. He thought about the legend that had brought him into this miserable outback, a story spun by the most gifted and respected of all the minstrels of Graylockland. It had been Freerover the Bard who'd been story-telling in that Belestrian market-place; his tale was that of a Wizard in recluse, a necromantic power so awesome that no one dare seek him out as long as he breathed. But now he breathed no longer, according to the bard, and only stories guarded his treasure - and a spider called Shadow. Wealth heyond imagination, beyond dreaming, lay inside that mountain. Iron Knife opened his eyes to the day. He rose quickly, stashed the carry sacks he'd been using as a pillow, and slung them aboard the hurdenbeast. \"No dawdling today, you ill-tempered, foul-breathed creature, II he thought, \"for today is the day Iron Knife makes his mark on the world.\" Beyond the edge of the outback, rising like a needle in the eye of the Gods, Spider Mountain protruded into the dawn sky. It stood, foreboding, yet beckoning, but whether it offered treasure or death, who could say? Off in the distance, almost at the base of the mountain, lay a village. At an angle to the village, there was a hint of a road. Iron Knife chose the village. As he came into town, the shimmering desert heat had become overpowering. He trudged through the abandoned ruins, his eye catching a sign on an intact building. 'Tavern', it said, and seemed to invite him in. Dusty, musty and smelling of time and neglect, it still felt good compared to the heat outside. Iron Knife allowed his eyes to play over the ruined interior: broken glass, shattered chairs, and on the only upright table there lay an unused torch. \"What luck,\" he exclaimed, \"a bottle of Ambrosia!\" He moved over to the shelf where the Ambrosia sat so invitingly. Caressing it appreciatively, he popped the cork and quaffed the contents in one mighty gulp. The room began to spin around, and he crashed to the floor. He slept for a full day and night, and woke with a throbbing head that felt as if all the Royal Guardsmen were tramping through it. While his head cleared, he looked around. A box of assorted quarrels and darts lay in disarray on the floor; he had knocked them over as he fell. A lever had been pulled downwards, although he did not remember doing it. Beyond that, a trapdoor in the floor yawned open. \"The treasure of Spider Mountain,\" cried Iron Knife aloud, \"lies beyond that doorway. I've discovered the secret, with no lost time.\" On that note, he gathered up his carrysack, drew forth his dartshooter, and stepped boldly through the opening. The torch was on the table, leaving Iron Knife in the dark. Shadow struck with such lightning speed that Iron Knife had no time to cry out. He was dead even before the juices began to flow from his body into that of the spider. \"And that,\" said the bard, \"is a reason for caution, when seeking gold in that mountain. Beware of the spider, for she gets quite hungry and strikes without warning ... Like this!!\" Freerover emphasized the last two words, and jumped towards the crowd of children in the square, sending them shrieking and scurrying in all directions. He laughed most heartily and began strumming his lute. In the shadow of a tree, a young Adventurer pondered the information he had accumulated, shook the treasure dreams from his head and headed west towards the outback-the most desolate mountain in the kingdom, and a spider-to test his courage.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126382-spider-mountain\n"}