{"altername_name": [], "name": "Stalactites", "overview": "Stalactites is a computerized version of the solitaire card game of the same name. It was developed by Maurice Jones and published in Loadstar #185. Rules: The player deals four cards from the deck. These four cards form the foundations. They are turned sideways (although it is not necessary to do so). The rest of the cards are dealt into eight columns of six cards each on the tableau. These cards can only be built up on the foundations regardless of suit and they cannot be built on each other. The initial layout of a game of Stalactites. Before the game starts, the player can decide on how the foundations should be built. Building can be either in ones (A-2-3-4-5-6-7-8-9-10-J-Q-K) or in twos (A-3-5-7-9-J-K-2-4-6-8-10-Q). Once the player makes up his mind, he begins building on the foundations from the cards on the tableau. The foundations are built, as already mentioned, up regardless of suit, and it goes round the corner, building from King to Ace (if building by ones) or from Queen to Ace (if building by twos) if necessary. The foundation cards turned sideways, though not necessarily be done, is a reminder of the last card's rank on each foundation. The cards in the tableau should be placed in the foundations according to the building method the player decides to use. But when there are cards that cannot (or does not want to) be moved to the foundations, certain cards can be placed on a reserve. Any card can be placed on the reserve. But once a card is placed on the reserve, it must be built on a foundation; it should never return to the tableau. Furthermore, the reserve can only hold two cards. The game is won when all cards are built onto the foundations, each having 13 cards. The four starting cards in the foundations don't have to be of the same rank; so results vary with each won game.", "platform": "Commodore 64", "release_date": "1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Maurice Jones", "publishers": "J & F Publishing, Inc.", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130876-stalactites\n"}