{"altername_name": [], "name": "Stargate (Virgin Books)", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". When I was a very young lad,\" the bard began, \"I fancied myself as an adventurer, a blades man of rare talent and a hero of epic quality.\" He glanced round at the attentive faces of his audience. They were young, for the most part; firelight warriors who would not see the far edges of the fields they tilled year after year. But they' d come for a story and that much he would surely give them. \"During my earliest travels, I chanced to come across a gypsy caravan, led by a matriarchal old crone named Moola. She invited me for a taste of soup and a night of music -as is their custom with strangers -and offered, after the victuals were done, to read my future, for a few coins of course. \"After much hocus-pocus and ceremony, and after lightening my purse of several ducats, a crystal ball was brought forth. It was a stunning sight, larger than any hall I' d ever seen in my short life or, as I can now testify, in the seventy-odd years since then. \"She approached this crystal ball with much reverence and muttered several incantations over it. From where I sat, I could see inside it, a swirling mist of pattern and hue blended together in perpetual motion. I was fascinated. \"But my fascination turned to horror as the inside of the globe plunged into blackness. Moola recoiled as if slapped, and cried out in pain. But she returned to her vision at once and with renewed intensity peered at the images only she could see. \"At length she spoke, in a strange voice, different from the one I knew to be hers. 'Henceforth, wanderer,' she intoned, 'you shall journey with purpose, you shall quest with a goal in your eye and you shall canya song in your heart. You shall be minstrel to the masses. You shall carry word of great deeds and small failures from village to town, from mountain to desert. Your name shall be spoken of as bard to the world.' \"There had been wandering minstrels for as long as there had been Men and Graylocks struggling against each other and the evils of the land. I knew not a single song or a heroic story other than the bogy stories of my camp-fire days. Perhaps this gypsy Moola was mistaken. \" 'I see the North Mountains,' she continued, ignoring my doubts. 'I see Northstar Castle, a secret entrance. I see your destiny, Freerover the Bard, for that is your name now and you can accept no other.' \"And as ls at there, listening in disbelief to the journey that was to be my quest, I quaked in my boots.I was no hero, but rather a badly frightened boy, a long way from the safety of my father's fire, charged with a task no sane warrior of the elite would have accepted. Until she mentioned The Book. \"In the depths of a special dungeon of Northstar, she told me, was a Key to other worlds. Fire and Water, Sand and lee were these worlds in their turn. Each held secrets of incredible value, but one (she dare not tell me which) held the pedestal of all life upon which rested the First Book of Graylockland, a volume of history and chronicle concerning our world, stored there for safekeeping. \"And so I became Freerover, the shell of a bard -for who listens to a minstrel without tales? I listened to the deed stories of hero after hero, and remembered each in its turn. But as I travelled aimlessly throughout the Kingdom, I found myself drifting towards the North Mountains, drawn inexorably by the call of The Book. \"To look at me now, my friends, you'd not believe me a mountaineer, but there was strength in my body as a youth and as sure Iy as I stand here I made the Northstar climb. I made the climb to the plateau of Thunder Mountain and negotiated the treacherous passage to the valley of the Castle Northstar. Moola's instructions, though 1 swore I'd never use them, guided me through traps that generations of warriors had died to discover. In the end I was able to enter that part of the Castle known as the Guardian of the Gates. \"There was no treasure here -as always seems to be the case in such places - for though the Gods and Wizards like to tease mortal men with wealth before striking them dead, this place seemed to be the work of neither. Though the stonework was smooth, gaily patterned and flawlessly seamed, it bore the unmistakable mark of the human hand. It was not the product of necromantic engineering such as I have seen in the Wizard's Tower of the Great Outback. Nor was it the product of slave labor. There was far too much attention to detail for any slave's hand to have touched this work. \"It seemed to me, as I wandered the corridors and side-rooms, that this place was cleaner than any guarded or unguarded structure I'd visited then, or since. And that seemed strange to me, as strange as the dull glow of light which chased away the gloom. \"After much exploration I came at length to a room filled with paintings of indescribable beauty. One depicted an aquatic scene in hues of blue and green, with schools of swimming fishes large enough to feed a village for a year. Another portrayed a fiery volcano and rivers of lava, fountains of fire bursting into the sky. A third showed a chilling winter scene, the frost-frozen lands covered with impassable snows. A fourth was simply black, like midnight in a cave, like death or undeath, a black such as I could not look at for too long lest it devour me. A fifth painting was deep sand rippled by timeless winds; a sixth was a mountain ledge. Each had a symbol inscribed underneath it on a gold plate, in a language I did not recognize. These other-worldly paintings were beautiful beyond all reason, and I drank them like upland wine before finally moving on. \"The room beyond contained wheels and pulleys of unusual shape, jewel-handled levers and glowing windows in which appeared other symbols from the same cryptic language. After some experimentation, which twice loosed lightning about me and nearly sent me to the Gods, I found a lever matching a plate upon which were engraved the symbols from the room of paintings. I chose the symbol from the lee painting and moved the lever to that position. I could find no other similar symbols so I left the room and entered the one behind it. \"On a raised platform rested a large painting, higher than me and wider than the length of a spear. It was a reproduction of the Ice painting, but so much more lavish that I had to touch it to verify its reality. I am wiser about such touching now. \"I found myself in the midst of a howling blizzard. The wind sucked the very breath from my mouth and froze it to my cheeks. I looked behind me and saw nothing but ice and snow. Determined not to die while stupidly standing around, I pressed forward at a right angle to the wind. It was a fortunate choice of direction. \"I walked what I believe to be the length of this village when a cave came into view. Believing this luck to be too good to be just random, I made for it with all haste and entered without caution, believing that I was meant to be here. A great white bear plunged past me and out into the storm, frightening me so badly that I still jump at the thought of it. \"At the end of a long ice tunnel was a pedestal upon which rested a gigantic book. It was not bitterly cold in here, as I would have expected; the temperature, though high, did not seem to melt the ice. I approached the pedestal reverently. \" 'Who are you?' demanded a great booming voice. 'Why do you disturb my meditation?' \"I chose my words carefully, not wishing to offend such an obviously powerful demon. '1 am a humble minstrel, a bard of the Graylock South come to study from The Great Book,' I replied. \" 'If bard you be,' boomed the voice, 'then sing me a ballad such as would move me, for none of your kind have been here for many, many years.' \"I unslung my lute and sang him the Dungeon Delver's Lament. \"Tread softly, oh my friend, For the ground is soft and danger lurks anon. Hold high the torch, For what you see one moment may the next be gone. Hand on your sword, For that which lurks strikes quickly in the gloom. Peace unto you, For fang, claw and blade conspire to seal your doom. Pity be to me, For in these depths I travel now alone. And that which claimed you, Prepares now to strike me to the bone. Treasure awaits For me if! Can just prevail, And if escape Some bard will sing my name nut in a hero's tale. But I am trapped And I shall die a dungeon delver's death. Yet I will live on In song and music to the last draw of legend's breath.\" \"From what seemed to be a great distance came a sobbing, an all too human sound that gave me pause to wonder . 'Your song has touched me,' said the voice, which now echoed rather than rumbled. 'You are a true poet and minstrel of the people. Come forward and drink of the Book of Life and History. Know of your heritage and the secret of existence.' \"So I fulfilled Moola' s prophecy by standing on the pedestal, before the Book of Life . And, true to the promise, there were great truths contained therein. But much was sealed. That was the Book of the Future and, although I was permitted a small glance, it was deemed too dangerous for me to know too much.\" Freerover studied the crowd, now quiet at the wonder of his tale. Then he spoke again. \"There are young people of the Kingdom who will drink of The Book,\" he said, \"and those whose bones will litter Thunder Mountain for the trying. There are those who will stay and till the field and not be worse off for being where they are. To some this story is just a story, to others it is a clue, a puzzle in a larger puzzle. Here my story ends and your story begins.\" And Freerover the Bard, spry of limb and nimble of finger - even after eighty-five summers - picked up his lute and began a song and dance which was quickly joined by all. By most, I should say, for one was deep in thought and another had already made up his mind.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126397-stargate-virgin-books\n"}