{"altername_name": [], "name": "Starbase 2000", "overview": "You find yourself in Scorpio sector, ship's log stardate 1000. You've identified zero aliens thus far but hope that by using the long range scanners you will find some, figure out how to move toward them and complete your mission. The residents of Starbase 2000 have been hit by an outbreak of Quintett Plague. A distress message has been received at HQ and you have been dispatched with the necessary serum to save the residents’ Lives. However, the people who control the movement of the base through space have come down with Quintett, and the base has wandered quadrillions of miles from its proper position. Therefore, you have to locate the missing Starbase, and take your craft there with the serum, before all the inhabitants are dead. The Galactic Area within which you will find the Starbase is very, very Large, and heavily populated. Not only are there are other starbase in the sector, but a number of alien races — not friendly to humankind — also spend their time in this Area. While attempting to find the Starbase 2000 and get to it, you have to avoid running into friendly starbases and not-so-friendly aliens, and make sure you do not run out of energy before your task has been carried out. A number of other incidents Lie in wait for you as you undertake this quest. You will find that only a few of them will be triggered each run of the game, so it will differ considerably from run to run. As well, the Location of every object in the Galactic Area (you, aliens, starbase and Starbase 2000) changes from game to game.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Brett Hale", "publishers": "Interface Publications", "genres": "Vehicle Simulation", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/131062-starbase-2000\n"}