{"altername_name": [], "name": "Storm-Tamer: The Numehra Saga", "overview": "Storm-Tamer: The Numehra Saga is a text based RPG for the Commodore 64. It was developed by Jon Mattson and published in Loadstar #78. Written with Jon's QuestWriter program (from Loadstar #76) this huge text adventure teleports you to a land that never was, but will always be. Gazing out over the nearly empty tavern, you idly wipe an ale mug with a cloth and whistle tunelessly. AS you set it down at the end of a long, neat row, a humorless smile flickers across your lips. You must have the cleanest, shiniest mugs on coast... Business has been dismal lately. The weather has been wreaking havoc With Village commerce in general. Weather? Well, that's a tame word for it. Hurricane winds, battering tidal waves and insidious floods hardly qualify as mere weather. A terrible thing to have happen to an honest innkeeper. You frown and chastise yourself: at least you have a roof over your head, and a stout one at that. Many of the villagers have been forced to desert their homes or flee from homes deserting them! What's worse, those that have journeyed up the coast return with stories of even worse conditions. 'Tis indeed a grim time. Your musings are interrupted by the clatter of the door being forced open against the wind. An old man pauses for a moment on the threshold, as if deciding belatedly how best to make an entrance. Rain runs in rivulets off his floppy hat and down his dark grey robe, forming little pools around his feet. With a decisive lurch forward, he steps up to the bar and faces you, his eyebrows knitting together as he studies your face. \"I would have words with the owner of this establishment.\" The words seem to echo up from a grumbling pit. \"Then, it is I you seek.\" You bow your head deferentially. Long years of dealing with strangers have taught you that those of rank do not always appear in noble guise, and this one has an odd feel about him. \"Impossible.\" He gazes at you like a liar, then raises one eyebrow. how foolish of me. Your father. is your father I want.\" \"Ah, It It is your turn to look dubious. \"Well then, my friend, you are a good deal too late. My father died.. Well on nine years ago пон.\" But your curiosity is piqued: your father was a mage of some note and an adventurer before retiring to the inn. Anyone looking for him could prove very interesting, indeed... \"Dead?\" He looks thoughtful. \"Has it been so long?\" A sigh, and then he sits down on a stool beside you. \"Well, then, I guess it has. have my deepest sympathies... A drink is sorry consolation, but you pass him one nonetheless \"It's all right. That was a long time ago. But perhaps I can help you...?\" \"Yes, Breaking out of his reverie, he eyes you long and steadily. perhaps you can. It is actually an object I seek - something that was in your father's possession. You could fetch that for me.\" \"An odd request.\" It is safe to say by this point that he is no noble, So, \"You might first tell me why I should feel inclined to hand my father's property over to a complete stranger.\" His head snaps up, and the gaze makes it clear that you may have misjudged his authority after all \"It has, indeed, been too long, if you have forgotten the face of the Wizard Roth. Or perhaps you have not your father's keen mind, after all.\" Roth! In your childhood thoughts he is a mysterious figure, a cloaked giant who spoke solemnly to your father Who even deigned bring a few magical trinkets to a shy child... It is Roth, indeed, and your expression speaks a better apology than the few Words that tumble forth. He smiles sadly, his momentary anger fading. \"That is all right. Time makes poor acquaintances of us all. And you are quite correct; I owe you a tale, if nothing else, for what I shal1 ask.\" He muses, as if to himself, \"There is little enough to tell... You lean forward against the bar to catch his words, as he begins his tale. \"It is about this terrible storm, of course. You must have heard how it ravages the eastern coast and shows no signs of abating. All agree that it is a disaster without precedent. Yet, I tell you something more: it is not natural at all, but a work of sorcery.\" \"Sorcery...\" You savor the word like a particularly tasteful poison. \"Even so. And it has fallen to me to seek its source and put an end to it. From the first, I sought out the Hisdom of Jasmine, the Seer of Arlen, hoping that she could guide my path.\" He grimaces. \"As is oft the way with such oracles, her words were little better than the riddles I already faced, and asked more than they answered.\" He tests your patience, as he takes a long and thoughtful sip from his mug. \"Nevertheless, I did dredge out a few useful bits. The source of our problem lurks in an ancient keep on an island near the Northern Sea. She was quite clear on one point, though: it is the last of two such seaside citadels that must be visited to complete the quest successfully. Then there is the Temple of Pel...\" That, at least, you know, for it is rumored to lie somewhere northwest of your own village. \"The Temple? What of it?\" He eyes you over his drink. \"You never were very patient with stories. Well, this time I have no answer for you, anyway. She simply said that I must first visit the Temple, with appropriate offerings. Altmir knows what that entails...\" \"The objects you want from me?\" He shakes his head vehemently. ''NO, по. That is for something else the final stage, and the final piece of wisdom Jasmine saw fit to bestow.\" He smiles, as if to himself \"Well, not quite the final piece...\"", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Jon Mattson", "publishers": "Softdisk Publishing", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/147310-storm-tamer-the-numehra-saga\n"}