{"altername_name": ["Sturgrat: Mission 1"], "name": "Sturgrat: Mission I", "overview": "Sturgrat: Mission I is a miscellaneous shooter for the Commodore 64. It was developed by Robert Germino and published in Loadstar # 054 in 1988. Use your joystick and your tactical skills to pilot the Sturgrat, the most sophisticated starship in existence. Your planet is depending on you! It is with a certain amount of pride and trepidation that you take the helm of the Sturgrat -- a Sturgrat pilot must move quickly and juggle several factors at once. One of the main factors is fuel. The transport vessels, which fly side-by-side behind you need occasional replenishment from the asteroids that inhabit the galaxy. The shields will protect them from damage should they collide with an asteroid, but the shields may become damaged. The indicators of the status of the shields are two vertical bars on either side of the Fuel and Warp gauges. If either of these two indicators becomes low, you must stop your forward movement and scan for local energy by pressing the F1 key. If you run low on fuel, which is shown in the Fuel gauge, you must have the transport vessels collide with the fuel-rich asteroids. Your shields will become damaged but often the increase in fuel is worth it. All of your requirements are inter-related and you must keep track of all of them. Your ship, alongside its primary armament are equipped with 8 neutron cylinders which will destroy any attacker in sight. They are indicated by vertical bars near the top of the screen. Press F5 to invoke them. If you have sufficient fuel you can convert fuel into more cylinders by pressing F7.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Robert Germino", "publishers": "Softdisk Publishing", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367995-sturgrat-mission-i\n"}