{"altername_name": [], "name": "Sultan of Turkey", "overview": "Sultan of Turkey is a solitaire card game more famously known as Sultan. The C64 version was developed by Maurice Jones and published in Loadstar #147. Game Rules: Sultan is a rarity, a two-deck game that doesn’t need a huge table. Play is simple and wins are frequent. A won game shows you the “sultan” (the King of Hearts) surrounded by his harem of eight Queens. Layout: Remove all eight Kings and one Ace of Hearts from a double deck of cards. Lay them face-up in three rows of three, with one King of Hearts in the center spot and the Ace of Hearts below it in the bottom row. Except for the central King of Hearts (the “sultan,” which is never touched again and can’t be played upon), these cards are the foundations. Shuffle the remaining cards and lay out eight of them face-up in two columns on either side of the Kings and Ace. These cards are called the divan. Keep the remainder of the deck in your hand. There is also a discard pile which starts out empty. Play: The top card of the discard pile, and all cards in the divan are available for play on the foundations, which build up in suit to the Queen (Aces go on Kings). Empty spaces in the divan must be filled immediately from the discard pile. Dealing: Deal one card from the deck onto the discard pile, any time you like. You may redeal twice, for a total of three times through the deck: when the deck is empty, pick up the entire discard pile and turn it face down to form a new deck. Goal: Move all cards to the foundations. Remember that Aces go on Kings, and that the central King of Hearts cannot be played upon. Tips: Sultan offers no real choices; just make every possible foundation move, and try not to miss any.", "platform": "Commodore 64", "release_date": "1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Maurice Jones", "publishers": "J & F Publishing, Inc.", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/138422-sultan-of-turkey\n"}