{"altername_name": [], "name": "Super Scramble Simulator", "overview": "The game consists in facing straight paths to obstacles in race against time, with only one participant at a time. The screen during the race is divided into three parts: at the top you have the main view of the rider on the track, profile view with horizontal scrolling to the right; in the middle, a view on a smaller scale of the track from above, always with horizontal sliding; below are the on-board instrumentation (tachometer, speedometer, gear) and the time and score indicators. The player can steer, adjust the speed, use the three-speed manual transmission, rear wheel or rear wheel both on the ground and in the air, lower the rider. The steering changes the lateral position of the bike, which is only visible in the plan view. The routes may include various obstacles such as steep slopes, suspended trunks, rivers, parked vehicles, rocky stretches or with bumps, all to be faced with different techniques and speeds. At the beginning the obstacles are all aligned, but as the difficulty increases, the lateral movement of the bike becomes necessary to intercept them. You can suffer time penalty in various ways: missing an obstacle, facing it incorrectly, or falling, which may depend on unsuitable speed to the ground, landing with the wrong wheel, stall. After each mistake, the race is immediately resumed from a point just before, with no damage except for the time penalty; after a certain number of attempts the obstacle is automatically skipped.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Shaun Southern", "publishers": "Gremlin Graphics Software", "genres": "Racing", "max_players": "6", "cooperative": "No", "rating": "2.67", "wikipedia": "https://it.wikipedia.org/wiki/Super_Scramble_Simulator", "video_link": "https://www.youtube.com/watch?v=A67YSsAah8c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109994-super-scramble-simulator\n"}