{"altername_name": [], "name": "Superbrain", "overview": "Superbrain is a high-tech innovation of the computer-age. A program which tests the deductive powers of the mind, and stretches them to the limit. In Superbrain, the player confronts the ultimate opponent-the computer itself, a highly evolved and intricate thinking machine, which considers its options and makes its move with alarming speed and accuracy. But the human spirit is sometimes as effective a weapon as the cold micro-chip strategy of the Superbrain. Outwit the system...if you can. Superbrain a program of extreme intelligence. After the title appears, press any key to begin. You will receive instructions. Press another key to receive the remaining instructions, then another key to begin the game. The object of the game is to guess the color and order of 5 colored squares. The computer chooses the 5 squares. At the top of the screen is a gray box with 5 question marks. These represent the 5 squares. Under this box are 10 pairs of gray boxes. You have 10 chances to guess the order and color of the squares. The right-hand column displays the squares as you guess them. The left-hand column will give you clues as to the accuracy of your guesses. In order to guess the color of the squares the following keys must be pressed: 1) BLACK 2) WHITE 3) RED 4) CYAN 5) PURPLE 6) GREEN 7) BLUE 8) YELLOW If you guess the right color of a square but in the wrong place, the clue box will display a white square. If you guess the right colored square in the right place, the clue box will display a black square. In order to change any squares you have guessed, press the F7 key to move the cursor backward, and the F1 key to move forward. After you have made your guess, press the RETURN button. If you guess all 5 squares correctly you win the game. You have 10 chances to guess the squares in proper order. You may quit at any time by pressing the F4 key.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "ALA Software", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/355975-superbrain\n"}