{"altername_name": [], "name": "The Successors of the Throne: War for the Crown II", "overview": "A 2D-RPG\\adventure for up to 4 players, who play in hot seat fashion. Game translated into Polish which was created in 1990. Before you start the game, you can customize a large number of settings using the menu, for example: the initial branches, the total number of provinces, the cost and maximum number of villages, the attitude of realists, the presence of fortuitous events, therefore for each player is selected the name, color, coat of arms and province in which the owner is initially located. The game represents a relegation war to control the world of fantasy on a large island. The map of the kingdom is randomly generated and consists of many provinces of irregular shape and size with square borders. In each province there are a number of the owner's soldiers, not distinguished by type, a certain number of villages that determine the return of provincial cash, and a fortification of variable size. You can spend all or part of your money on recruiting soldiers, building new villages, upgrading fortifications. Each unit can perform only one attack per turn. Player's turn begins with the automatic collection of taxes from villages, after which it is possible to launch attacks to conquer provinces bordering the coast. The game can be saved between turns. Curiosity: The heirs to the throne or heredity of the throne are the original German title of Erben des Throns. This is a continuation of Krieg um die Krone (\"war for the crown\"), published by GDG in 1989.", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Marcin Hladki", "publishers": "German Design Group (GDG)", "genres": "Role-Playing", "max_players": "4", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=MaGC7ZtysEQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106534-the-successors-of-the-throne-war-for-the-crown-ii\n"}