{"altername_name": [], "name": "The Isle of the Cursed Prophet", "overview": "The award-winning ICON 64 team are back with an absolute gem of a game for the Commodore 64. Embark on a sombre quest to resurrect your dead wife by uncovering the secrets hidden on the mysterious Isle of the Cursed Prophet. This is an enthralling arcade adventure game that oozes mystery and atmosphere from the moment you first set foot on the island. The Isle Of The Cursed Prophet (C64) ** STORY ** With the death of his young wife to influenza Oliver Taylor has spent several years since searching, looking for a way to bring his beloved Madalin back from the dead. Studying ancient manuscripts and scrolls for answers, seeking out anyone that can help him. Just as all looked lost the great book of the dead, the tome of ancient spells and dark arts finds its way into his hands. The Necronomicon, bound in human skin and written in the blood of a thousand dead. With its knowledge of re-animation studied Oliver heads to the place of re-incarnation, the one place on the one night of the year his wish could possibly come true to bring his wife back from the other side. The Isle Of The Cursed Prophet (C64) ** FEATURES ** · Huge scrolling map to explore · Atmospheric soundtracks · Detailed hi-res overlaid player and enemy sprites · Stunning animated movie-style intro · SD2IEC compatible · PAL and NTSC compatible · C64 Mini + Maxi compatible The Isle Of The Cursed Prophet (C64) ** CREDITS ** Code - Achim Volkers Art and Game Design - Trevor Storey Music - Jason Page & Saul Cross Tape Master - Richard Bayliss & Martin Piper Additional Packaging Design - Kenz", "platform": "Commodore 64", "release_date": "June 21, 2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "ICON 64", "publishers": "Psytronic Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=d6Y_c66RpRI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/139370-the-isle-of-the-cursed-prophet\n"}