{"altername_name": [], "name": "The Temple of Vishtari", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". The Novice wasn't doing badly. He'd entered the Great Canyon from the desert side and passed through the Corridor of the Seven Deadly Traps without a hitch. His training in disguises allowed him to blend in with the road traffic. To the farmers and peasants on the byway he looked just like one of them. But he was not trying to escape their attentions; rather it was the guardsmen of the High Priest of Vishtari that the Novice did not want to meet. Discovery by the guards would be time-consuming and materially expensive. Better not to be noticed. The road from the wall of the Great Canyon to the outer wall of the Shrine of Vishtari was a long and dusty hike. The Novice was grateful for the training that had molded his finely-tuned athletic body. The sun overhead was merciless, as it had been when he'd crossed the Outback. There had been times when he'd believed he would not survive in the Graylock desert, but never a time when he doubted the purpose of his mission. \"The first ten miles from the Canyon wall are the most dangerous,\" his teacher had warned him. \"The wall dwellers are bandits and villains, even by Vishtarian standards. If it becomes necessary to fight, do so as quickly and with the least amount of visible skill as possible, lest you be observed and your true mission ascertained.\" \"Good advice,\" the Novice mused silently, as he trudged along. The first bandits he'd encountered at the wall had to be soundly thrashed by means of kick boxing and flat hand blows that were part of his elementary training. The yelping curs had been dispatched with a minimum of skill and had not returned. He had acquired a sturdy sword from the fracas and its owner had showed no inclination to try and recover it. In the distance, the dome of the Shrine could be seen. A gate barred the road into the city and there were armed Guardsmen searching everyone. As he drew closer, the Novice could see evidence of just how careful the searches were: beside the gate lay a jumbled pile of swords, knives, chains and other weaponry that had been confiscated. In a smaller pile lay some of their owners. Drawing the bandit sword from his belt, with two hands the Novice raised it above his head, a gesture of concession to the authority of the gate guardsmen. When he surrendered it, blade-first, to a burly gatekeeper, he was questioned: \"Tell me, why have you come here?\" the keeper demanded. \"I am a humble minstrel,\" replied the Novice, \"I seek a song, a tale and perhaps a ducat or two in return for my playing, which I will gladly share with the Priests of the Red Cloak in return for their indulgence and hospitality.\" The Novice had cleverly referred to the red-cloaked minions of the Snake by their chosen name rather than one of the more colorful titles afforded them by the families and friends of children stolen in the name of Vishtari and the Red Magics. \"A strange possession for a man of word and lute,\" said the keeper as he took the sword. \"An unfortunate loss for the bandit who owns it,\" replied the Novice. \"I suspect that he is the worse for it being here.\" \"Pass on,\" said the keeper, chuckling at the thought of so frail and weedy a lute strummer battling with a road thief for the blade. \"Mind you, the penalty for misbehavior is death.\" \"Indeed, I shall not forget.\" The Novice made the traditional sign of health and prosperity and strode on through the gate. The City of the Red Priests was a city of transients. There were a few taverns and inns, bu t except for those who attended the Temple, and the initiates to the Order, there was no resident population. Indeed, few Men or Graylocks possessed courage enough to remain within these walls after sundown. Those who did -who did not enjoy the protection of the Order-simply vanished. The Novice did not relish or need the protection of the Order. His purpose was the destruction of the Order, even the destruction of Vishtari, the Great Snake himself, if opportunity allowed. This was to be achieved through the theft and use of the Tooth of the Serpent, the legendary Sword of Vishtari. \"On the Graylock continent, there exists two magical swords,\" the Novice's teacher had told him. \"Deathtouch, the blade of Chaos, and Tooth of the Serpent, the blade of Law. The blade of Chaos is in the possession of the Guardian of the Dead, the blade of Law is in the Temple of Vishtari. When these two swords were originally fashioned, it was decreed that their combined power would transcend life and death. That is true. If the two blades ever touch, the world will end and the combatants will fight in limbo for ever.\" This was the kind of historical data that initiates of his Order received routinely. But shortly after the Novice's trial in the Maze of Darkness , he was summoned to the Master's side. \"Minions of the Snake have struck a bargain with the Lord of the Dead,\" he was told. \"Death touch is about to be won by the Red Priests of Vishtari. A quest has been mounted but may fail. Therefore, you must go to Vishtari and obtain the Sword of Law. The Snake must not be allowed to possess both swords.\" \\\\/hy another, more experienced, member of the Order had not been chosen for this task was explained simply: \"As a Novice, lad,\" the Master had said, \"you are flexible in decision-making. Each must have his first assignment in order to earn the rank of Guildsman. This one is yours.\" The s un began to wane. The shadow of the Great Canyon began to creep towards the walled ci ty. Like rats abandoning a ship, the visitors to the city streamed towards the gate, each hurrying to avoid some real or imagined danger that the night would bring. The Novice moved like a ghost in the shadows against the flow, until at last he stood before the Grand Cathedral of Vishtari - the entrance to the Temple beyond. \"I, a Guildsman,\" thought the Novice, rolling the concept around in his mind. A fitting one, he decided. Had he not trained since babyhood, learning the ways of the wire and the dart? Had he not honed every muscle in his body with the kick and the chop? He was no Journeyman Assassin, no Guildsman yet, but this night's acts would decide his fate. He would write the song with the stealth of a thief, the daring of a fighter, the wit of a bard. Then he would sign it with the mark of the Assassins' Guild, an agent of Law in the most feared Secret Society known to civilization. \"I am Novice no more,\" he silently vowed, \"the Sword is mine to take, and the life of the Devil Snake as well. I will puzzle, I will gather, I will fight -and deal Chaos a blow such as it has not received since before I was born.\" He moved swiftly, silently, up the Cathedral steps, keeping in the shadows. He moved around the wall to the Cathedral door, then through it. At that instant he found himself face to face with a red-robed priest. He spat the dart he'd been clenching between his teeth; it hit the enemy's left eye, penetrating into his brain. He staggered, took five steps and collapsed down the stairs in a rolling, tumbling heap. So much for secrecy. They would be searching for him now. In the dim interior light, he turned his cloak inside out. The black lining would disguise him in the halls of the Temple. Fleet of foot and nearly invisible, armed with darts and determination, the Novice - soon to be Journeyman -disappeared into the Temple of Vishtari. Chaos and Law were at war once more.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126561-the-temple-of-vishtari\n"}