{"altername_name": ["Slaughterland"], "name": "The Slaughter Land", "overview": "Andrea writes: First of all, thank you for your wonderful vault. I always loved the whole SEUCK scene... and now here I am, two decades later, looking for some enlightenment about SEUCK. Exactly 20 years ago I made a game with SEUCK called \"Slaughterland\". I think it's a quite interesting game, since it tries to tweak the SEUCK possibilities in order to create bonuses, enormous end-of-level bosses, hidden routes and so on. Nothing you haven't seen before, but, still, it's a original SEUCK game not yet shared online or offline. Problem is, that back in 1989 I only had a tape cassette recorder. I managed to transfer from tape to PC only the \"finished game\" as a .TAP image, while the other files (ie the \"ALL DATA\" one) are lost. I'd really like to share the game, but I'd also like to re-edit it here and there to make it more enjoyable... I tried the \"SEUCK REVIVE\" tool by Entropia but it didn't work for me (maybe because of the .TAP format?) What I'm asking is: do you, SEUCK gurus, know any other way of restoring my game from the \"finished game\" grave? It would be great if you could extract the data: I'd love to rearrange things a bit - as you'll notice, the difficulty level makes the game nearly impossible to complete (without cheats/savestates). Moreover, I was 14 when I created the game, so the texts are very silly and written in bad English. I'm still proud of the level played inside a jelly monster's belly, thou. With the final fight in the mouth of the monster itself, battling against his... teeth. The data was not altered in any way, since I wasn't (and I'm not) able to fiddle with code, assembly and stuff like that (and it's a pity, since the \"SEUCK REDUX\" tool seems sooo interesting).", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Andrea Babich", "publishers": "", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=mV5rEXs2kDc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155669-the-slaughter-land\n"}