{"altername_name": [], "name": "The Curse of Volcan", "overview": "Once upon a time, before your father's father was nothing more than a sparkle in his dad's beerglass, thee was a young boy named Algernon The Hopeless. His home was a tiny island ni the middle of the Sea of Storms known as Rotena. Algernon didn't have a very full life, he spent most of his time gardening in his small allotment. One fine day he was digging up potatoes for his mother to roast with the Sunday lunch when he found three small strange objects. He decided that the best thing to do with the objects was to rub them togehter in his soil stained garden mittens. In an almost predictable manner, there was a sudden, blinding flash that scattered the objects and while striking Algernon dead, awoke the Curse of Volcan. Volcan was an exceedingly evil wizard in the early days of the world and being true to all the classic conventions of evil wizards, he admired the stunning beauty of the small island of Rotena and wanted it all for himself. So he build himself an even smaller island off the coast from which he could cast long range spells in order to drive the natives away from their homeland. Finally, he had succeeded in driving most of the occupants away and turning the rest into small green tree-frogs. Over time the fate of the island faded into the mists of time until one day a stone tablet describing the whole affair was found by our hero, Oswald, the son of Galahad the Druid king. The tablet told of a way to restore the island to its original inhabitants. The three magical objects must be brought together again and taken over to the island in order to rid it of the terrible tyrant Volcan once and for all. You must guide Oswalt to find the lost objects, then to Rotena to do away with the evil Volcan. Published in Commodore Format 1993/12 (Issue #39).", "platform": "Commodore 64", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Richard Thompson", "publishers": "Future Publishing", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=DWWdNsLtvJs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95386-the-curse-of-volcan\n"}