{"altername_name": [], "name": "The House (River Software)", "overview": "Mornings were generally spent in the good company of a pot of coffee, some warm rolls and a copy of THE TIMES and this morning was to prove no different... with the slight exception that your attention was not drawn by the usual 'world-affairs' but by a small and rather unusual advert. The advert briefly outlined some plans for a competition ... the prize for which was a fine house, set in its own grounds and worth quite a few thousand pounds of anybody's money. The owner, a somewhat eccentric character (as you were later to discover), hoped to make a small fortune by selling tickets for this competition at 5 pounds a throw and raking in the profits. A nice idea you thought .. if it works out as planned .. and one that you wish you had thought of in the first place. But never mind, you could always send off your fiver and hope for the best. With this in mind you quickly unearthed a writing pad and an envelope and sent off the cheque for the necessary five pounds. Some while later a small brown envelope came by post and in it were the keys to the house and some instructions on how to get to it. Reflecting upon how trusting the owner must be to hand out numerous sets of keys, not to mention how thoughtful of them it was to have the instructions printed out so neatly, you set out for the location indicated on the latter and after a train and a taxi ride arrive at the main entrance to the house. From the outside it looks quite innocuous and you wonder why someone had not won the competition before now ... if only you had known what awaited you then perhaps you would have understood why the house was still on the open market.", "platform": "Commodore 64", "release_date": "", "game_type": "Released", "esrb": "Not Rated", "developers": "Jack A. Lockerby", "publishers": "Adventure Probe Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/105572-the-house-river-software\n"}