{"altername_name": [], "name": "The Search for the Nether Regions", "overview": "Originally created for the ZX Spectrum in 1994, this game was officially ported to multiple platforms as part of Zenobi Software's New \"25th Anniversary\" DAAD Version. In the stereotypical magical kingdom of Kwargz, the peace and quiet had been shattered by the arrival of the evil orc-lord Beydm - a being with far too many consonants in his name! The orc-lord and his troops had taken to holding all-night parties, which were greatly disapproved of by the local natives - mainly because they were never invited. Eventually, after the orc's annual spate of \"hobbit bashing\", things got too much for the poor people to bear and YOU were called upon to help. YOU are not a \"bold warrior\" or an \"elf\" or even a \"mighty wizard\". YOU are a sadly pathetic little person who will use any excuse at all to take part in an adventure full of \"thrills\" and \"high excitement\" - or at least its nearest equivalent for £2.49 or less. And so YOU find yourself on a quest to obtain the only item that can rid the land of these orcs - Jeremy's Fabled Golden Camcorder - the most orc-terrifying object in the entire universe. In fact legend has it that it can even create more fear and loathing than an invitation to have tea with a Balrog. Legend also has it that the infamous camcorder can only be found in one place ... the even more infamous and highly mysterious area known as \"THE NETHER REGIONS\". None have ever returned from there - if only for the simple reason that nobody knows how to get there in the first damn place! - so your task will be a fairly simple one. Just find out where the \"Nether Regions\" are, make your way there and recover the Golden Camcorder ... easy!!!!!", "platform": "Commodore 64", "release_date": "July 4, 2019", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Gareth Pitchford", "publishers": "Zenobi Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158770-the-search-for-the-nether-regions\n"}