{"altername_name": [], "name": "The Clone Wars", "overview": "A game about money, power and influence in a war that held an entire galaxy under its spell. The clone wars have cast a spell over the editorial staff. It is entirely possible that you will not feel otherwise, and we are very happy to see it. I would like to take this opportunity to thank Thomas Kemmer, the author of the game, for the detailed and clear instructions that he enclosed on the program diskette. ONCE UPON A TIME IN THE FUTURE ... Along with various other superlatives bestowed on them by posterity, the Clone Wars were also the largest mass slaughter of intelligent life forms the universe has ever seen. You may think (if you know a little about galactic history) that the Trantaalic Wars took the lives of a lot of people, or that the Muncholian Conflict was a pretty big deal, but compared to the Clone Wars, those were nothing. As you know, in the year 3714 AD some experienced local politicians declared war on one another and against each other, each with the intention of eliminating the others and becoming sole ruler of the clone sector. War, at that time, was still fought with conventional hyperspace ships, which practically ruled out surprise attacks and contributed to the long duration of the conflict. Control Fighters, Cruisers, Dreadnoughts, Freighters and Troop ships, rally the local population and sway the Governors to keep up morale, influence the economy, wage taxes and raise troops while fighting off the guerrillas. Keep up your industries and increase your tech levels to protect the valuable resources scattered around your sphere of influence. And whatever you do, you must keep up ship production if you want to put all your strategies to work. Published in Magic Disk 64 1991/02.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Thomas Kemmer", "publishers": "CP Verlag", "genres": "Strategy", "max_players": "6", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90781-the-clone-wars\n"}