{"altername_name": ["Beyond the Tunnel of Time"], "name": "The Fortress at Time's End", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". Also published in Stonysoft #0403 as Beyond the Tunnel of Time. The Fortress was both ancient and new; in the valley of Time-Stand s-Still time was not. The sun froze at midday, for there was no night. The battlefields were strewn with freshly slain soldiers of two forgotten armies. Death hovered above the Fortress at Time's End, and chuckled at the cosmic joke. The dead could not die, because to do so would be to advance in time a kitten's breath, an instant - and, of course, that could not happen because time was frozen. Legend has it that the two great armies, squabbling over some forgotten cause, entered the valley from opposite ends, each thinking to surprise the other. They clashed in the middle of the valley, within sight of the Fortress, oblivious to it, each hoping to slay the other before turning their energy towards the unexpected prize. The battle raged on for weeks, but neither side could gain advantage over the other. The expense to life was staggering. Finally, one of the two Kings enlisted the help of a powerful Black Wizard, whose task was to slay the opposing army leaving no soul alive. But spies from the camp of the intended victims discovered the impending necromancy, and the second King enlisted a Black Wizard of his own. In the Fortress lived Sreptula, a Sorcerer whose power was greater than any living magic-maker of the time. He was reclusive and therefore indignant at the intrusion of these quarrelling Barbarians. He was offended, but took no action until he sensed the presence of the two opposing Wizards. Sreptula was a roaster of the art of illusion and projected an image of such horror as to frighten all but the most strong-willed of the combatants. But the two Wizards dismissed these illusions and calmed their troops, each returning to his preparations for mass slaughter. Twice more Sreptula tried to frighten the two armies with illusions, and twice more they were calmed by the Wizards. Finally, the opposing Wizards were ready and each led his army into conflict against the other. One Wizard let loose a plague, the swiftness and deadliness of which has never since been surpassed. The other unleashed a wall of heat lightning designed to wipe out everything in its path. As each of these spells were being executed, Sreptula enacted a spell of his own. He initiated a time spell freezing time within the confines of the valley. In defiance of Law, it held the fabric of life and death in suspended animation. The sun froze at midday and the valley of Time-Stands-Still became both a reality and a legend. The Sorcerer Sreptula was never heard from again. Law allowed time to be frozen in the valley, but outside the valley time flowed on like a river round an island. From that river came Seerson -as had explorers and Adventurers before him - seeking the key that would unlock the Fortress, releasing the secrets contained within. The Spirit-of-the-Sky hovered above the valley, as did Death, each waiting to see what would become of Seers on. These two cosmic entities eyed each other warily, while below Seerson tackled the puzzle. The cosmic dice rolled once more ...", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Donald L.", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126792-the-fortress-at-times-end\n"}