{"altername_name": [], "name": "The Kingdom of Craal", "overview": "The Kingdom of Craal is an unofficial conversion of a 1985 Amstrad text adventure for the Commodore 64. The original Amstrad version was done in BASIC by Mike Bibby. The C64 conversion was done in 2012 by Steve Bakke, also In BASIC. The game was originally released as a type-in game in a 1985 issue of Computing With the Amstrad magazine. Story: Far, far away, beyond the Ice Mountains, lies the weird and wonderful Kingdom of Craal with its magnificent palace, crystal clear lake and enchanted forest. It is a peaceful land, ruled for many happy years by King Meek who was respected by most of his subjects for his good nature and integrity - and his rather dishy, if inefficient, handmaiden Jajut. There was one character however who was not party to this overwhelming admiration - Vadham the evil wizard. Many years ago, he was banished to the castle dungeons for trying to nick the king's gold-plated penknife -the one with a special blade for taking stones out of horses hooves. In his spare time when he was not mixing spells or playing Ghouls, he turned the dungeon into a labyrinth of despair, where only the brave had the courage to enter. Having said that, we haven't seen any of them come back yet. You were born in Craal the handsome son of a cobbler and many years ago you decided to seek a fortune in far off lands. You returned many times over the years to visit your old mum and dad and spend the occasional happy hour in the company of the king's daughter, Andrea. What was once a childhood crush on his heir blossomed into love, and you have returned for good to claim your bride. Alas, on this last visit, you found the king dead and the palace in uproar. The wizard had taken a heaven sent opportunity and, as the king opened the door down to the dungeons to let out the castle moggie, he grabbed his magnificent gold crown and disappeared into his hiding hole in the depths - better than a penknife no doubt, but not much use for getting things out of horses hooves. You, in your typical youthful manner, were only interested in your future wife - Andrea. The palace guards, the footmen, the courtesans and even Ethel the cleaner, however, were not impressed with your infatuation and by a unanimous decision volunteered your services to retrieve the crown. They threw you head-over-heels down the dungeon steps with a warning that should you return empty-handed all your beloved possessions will be forfeit, even your subscription to Computing with the Amstrad -they'll stop at nothing, some people. Well, you have your challenge, and you don't really have much option but to accept it. In this serious adventure, you have at your disposal six single letter commands. These are n, s, e, w, I and i - for the four compass directions, look and inventory respectively. The program will also accept other standard adventure commands such as take, drop, hit and say. These words are intelligent, which means that if you have a key and want it in a lock, all you need to say is 'drop key'. It will automatically go in the lock. Now there's not much point in your typing in an adventure and finding, as you do, all the solutions within the listing. In order to conceal the clues, therefore, I've written the important messages in code, and they're all in the data statements at the end of the program. There's nothing clever in what I've-done, and I'm sure you'll soon spot that all the printed text has been offset by three letters. The subroutine starting at line 560 decodes it all and turns it into sensible English in the finished product. It is imperative that great care is taken when entering these data lines if you are to enjoy the result of your toils. Well, I think I've told you enough now. Any more hints, and it wouldn't be much of an adventure, would it? It only remains for me to wish you luck when you set out in your search for the crown - you're going to need it.", "platform": "Commodore 64", "release_date": "2012", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Mike Bibby", "publishers": "Public Domain/Freeware", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368696-the-kingdom-of-craal\n"}