{"altername_name": [], "name": "The Escaping Habit", "overview": "The time is January 1942 - the place a P.O.W. camp somewhere in Italy. You are captured when en route to a meeting with the various Allied commanders in North Africa. you were carrying highly-confidential papers concerning the plans for the campaign in the area and luckily enough you were able to prevent these falling into enemy hands. However, you are bundled off to a small holding-camp whilst attempts are made to ascertain just how important you may be to the war effort. After several abortive attempts at escaping you are finally sent to this present camp, situated somewhere in northern Italy...allegedly reputed to be escape proof and a place where the authorities feel sure you will remain for the duration. You are taken to meet the senior British office on your arrival at the camp and he gives you the general low-down on the camp and its regime. Your hut is number one and your meal times are 8 AM, 13 PM and 18 PM and you are told to drop whatever you are doing when you hear roll-call sounded and to head for the square. Failure to do just that can have untold consequences. However, just as you are leaving the senior British office leans across and slips a small piece of paer into your hand... you quickly clench your fist and drop your hand to the side. Once in the safety of your new hut, you unscrew the paper and read its contents. It is a hastily scribbled note informing you that there is a very good chance that you will not be around to eat dinner. It seems the GESTAPO are on their way to the camp with the sole purpose of forcing you to reveal the hiding place of the highly-confidential papers that you secreted away. Of course you do not have to stay around long enough for them to exact their evil ways...you could always beat them to the punch and escape first! The only other course of action is to wait around until they turn up and then surrender yourself to the inevitable torture that will surely follow at their hands.", "platform": "Commodore 64", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Jack A. Lockerby", "publishers": "River Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99641-the-escaping-habit\n"}