{"altername_name": [], "name": "The Spy Strikes Back", "overview": "You thought you had pulled perpetual office duty while recuperating from your mission in the Russian embassy in Korea, when the phone call yanked you from bed at 4:00 Sunday morning demanding your presence in 3's office. When you arrived, Ms Moneypenguin showed you right in. The old man sat at his desk with the contents of a dossier spread out before him. The name at the top of the folder was Dr. Xavier Tortion, an international terrorist of particularly vile repute. Present whereabouts: unknown. \"I think we've located Dr. X,\" 3 said. \"Several of our operatives have vanished into a converted castle in the East German town of Aichenbach. One chap finally got back out and managed to let us know the name of the owner before transmission abruptly ended. \"As you well know, Dr. X has threatened to detonate a nuclear device in a major population center if the world community does not meet certain demands. Our time is running out. We're sure that we can find where he plans to use the device by searching the fortress, but the security is so tight that none of our agents has managed to return. I'm sorry, 00P, but your administrative career is over. You must enter that castle and find the information it contains. \"It is imperative that your presence go undetected. Should you be spotted, run. Do not fight. As long as Dr. X feels that his security has been successful he will not change his plans. However, should you destroy any of his electronic guards, he is likely to alter his strategy and we'll need to start over, totally in the dark. Need I emphasize the need for stealth? Now be on your way and don't dally in the outer office!\"", "platform": "Commodore 64", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Mark Pelczarski", "publishers": "Penguin Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96843-the-spy-strikes-back\n"}