{"altername_name": [], "name": "The Brass Helm", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". Frankie loved 'Dungeons and Dragons'. He lived for his time in his fantasy world and slept the sleep of dreamers. He prowled the bookshops and libraries, gleaning any pieces of information on Swords and Sorcery, Chainmail and Chivalry. His game life and his real life were one. He breathed the breath of The Game. Other players brought maps, blueprints and volumes of papers for the games. They brought lead figures of Griffins and winged horses and armoured fighters in poses of battle readiness. Frankie brought a single figure of a nondescript fighter to those games where he was not the dungeon master and played the game from wit and memory with an uncanny knack. Ali dungeon master, Frankie appeared in character - cloaked, daggered, bedecked with the trappings of the wizard or warrior whose world would be invaded by the players. He introduced the scenarios one after another with elegant orchestration. His world was so detailed that the players had notebooks - reams of papers devoted solely to his world. Every so often, Frankie would visit a costume and junk shop in a side-street on the edge of the theatre district. His dark wizard's cloak had come from this shop. His dagger had played many a scene from Shakespeare before finding its way to Frankie's belt. The Future seer's feathered turbin, the Red Wizard's ruby, and the sword of Damien the Dangerous - renowned fighter had all come from the same shelves. The costume shop was Frankie's favourite place in Real world. The proprietor, Kelly, liked Frankie. The boy had a good eye for the unusual and was a fair judge of fabric and quality. He knew about The Game from listening to Frankie endlessly expounding on the adventures of his friends in The Kingdom. So whenever something special came in - something that was right for The Game - Kelly laid it aside for Frankie. One day Kelly saved a red, hooded cloak with a sequined belt, which instantly made Frankie smile. Despite this good fortune, Frankie felt there was something missing from the new character he was building. Then he saw the brass helm. He found it partially hidden beneath a musty pile of old rags on a table in the back of the costume shop. It was tarnished and dull but the shape was perfect for his new campaign. Best of all it had a five pound price tag. The cloak made it nine pounds fifty, just enough to be covered by his allowance. \"Owned by a famous bard,\" Kelly told him, \"said to have magical properties.\" He winked at Frankie. Frankie mustered a grin and pulled the money from his jeans. Already he was plotting ways to integrate the new costume into his campaign. He ran all the way home. In the quiet of his room he examined the helm more closely. He had come in through the garage and picked up a can of Brasso and a rag. In a few minutes the helm would be as shiny as new. As he rubbed, Frankie noticed that the helm was engraved with pictures - scenes of personal combat and landscape. Inside the helm there were words inscribed in a strange language which he could not read. As he finished his task of rubbing away the layers of neglect, he could not help but admire the workmanship of the brass helm. He was pleased with himself for making such a good buy, but he was also puzzled by the writing on the inside. It was still daylight when Frankie climbed the stairs to the library. He had decided to visit old Tom Parker, the head librarian. Tom was known to all the children who played The Game; he answered their questions about swords and chainmail and the culture of the Middle Ages with such authority that one would have thought he'd lived at that time. \"The writing is Gaelic, Frankie,\" Tom told him. \"I'm not fluent in it but I might be able to translate this.\" He scratched his head, jotted down the words and disappeared into the rows upon rows of bookshelves. Several minutes later he returned. \"Here's your translation,\" he said, \"I hope it's what you're looking for.\" Frankie took the paper and read it carefully. A smile lit up his face as the words sank in. SEEK KNOWLEDGE IN THE DREAMS OF THAT WHICH ISN'T WHAT IT SEEMS THE TRUTH OF IT SHALL COME TO YOU AND TRUTH WILL GUIDE THE THINGS YOU DO Then he scooped up the brass helm. \"Thanks, Mr Parker,\" he said, and dashed for the door. The ageing librarian shook his head. The children were very involved with The Game. As the pounding of Frankie's feet echoed in the corridors and faded with the slam of the door, Tom Parker pondered the writing on the inside of the brass helm. \"Gaelic?\" he said aloud to no one in particular. \"I wonder where that helmet came from?\" Then he wandered back among the bookshelves to find the answer. Back home in his room, Frankie was thrilled with his good fortune. Gaelic was an ancient language; he knew that much from the researching he did to improve the quality of The Game. But what was a Gaelic inscription doing on a modern theater prop? Or was the brass helm something else? Frankie kicked off his shoes and settled back on his bed. He used his stamp magnifying-glass to examine the engravings more closely. They were exquisitely detailed down to the musculature of men and beasts locked in combat. There were scenes of castles and kingdoms, mountains and rivers - a world engraved in brass. He wondered at the beauty of it all and at his luck in the find. Closing his eyes, he imagined what it would be like in the kingdom of the engravings. Then he placed the brass helm on his head. Everything began to spin around...", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126344-the-brass-helm\n"}