{"altername_name": [], "name": "The Yuppie Trainer", "overview": "A Wall Street strategy game published in Magic Disk 64 1991/12. Who has not wanted to be involved in the struggle for power and money on the international stock market? For everyone who has not been able to do this so far, we now offer an authentic stock market simulation on the MD, with which the goings-on on Wall Street can be experienced up close. THE YUPPIE TRAINER is controlled from a central menu, from which you can use a joystick to control the various sub-functions that you need for successful stock market trading. At YUPPIE-TRAINER there are exactly six in number: I. ECONOMY shows how things are going Your finances are in place; the bar and arrival partial assets are listed separately and then as total assets and then the current profit (or loss) is displayed. II. The title page of the Herald Tribune appears under NEWS and provides you with the latest news from business, politics and society, from which the market development can be predicted, in addition to the current date. Here you will also be confronted with the reasons why your shares suddenly only bring in losses or begin to soar unexpectedly. III. At TIPS you can get advice from so-called economic experts for good money on which stocks you should buy or sell best. Of course, these profiteers charge different amounts for their not always flawless information, a kind of consultancy fee, which is called \"Bagschisch\" in stock exchange circles. IV. Continue to STOCK MARKET, the stock exchange. The daily prices of twenty different stocks are listed here, the selling and buying prices. In addition, the changes to the previous day's rate are shown in a + / - column and in the column on the far right you can see how many shares you have from the respective company. This is also where the \"day changeover\" takes place - the days at YUPPIE TRAINER only pass by looking at the stock exchange prices. You can also speed up the course of the week by not clicking on the main menu with the arrow at the bottom of the screen, but on the day of the week to the right of it. The next day is then automatically displayed. V + VI. The last two menu items are BUY and SELL SHARES. Here you can (oh no...) Buy and sell shares. The daily prices of the shares are displayed to you, which you can then - and this is important - only purchase or sell in 1000-piece quantities. If you overestimated your wallet when purchasing, you have the option of reselling the shares you have just bought too much by return of post. In this way you cannot checkmate yourself, you just have to be able to cope with the loss of price. THE YUPPIE TRAINER is a fun simulation that conveys an amazingly accurate picture of reality. If there is a risk of war, the prices of armaments stocks etc. rise. Due to the relatively large number of shares that you can buy, it is also possible to vary between fundamentally different industries, even entire branches of the economy, when buying shares. This also ensures variety in this aspect. In addition, YUPPIE TRAINER offers a possibility that withholds the real life from you: If the situation becomes too hopeless, you stop and just start again.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Josh", "publishers": "CP Verlag", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=q_tX5RMBoaI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137798-the-yuppie-trainer\n"}