{"altername_name": ["Dallas Quest"], "name": "The Dallas Quest", "overview": "In the game, you are a famous detective who has been summoned to South Fork for a secret meeting with Sue Ellen. She has called you here to offer you a proposition. Sue Ellen is in possession of a letter from Jock Ewing written to Miss Ellie, describing an extremely rich oil field he had discovered during his stay in South America. When Jock left for his ill-fated trip back to Southfork Ranch, he carried a map of the oilfield with him. But he also took the precaution of leaving a copy of it with an old friend and former fellow wildcatter named \"Chugalug\" Jones who now runs a trading post in South America in a village called Playa Peligro. Should anything happen to Jock, Chugalug has been instructed to give the map only to the person who possesses a particular ring. This ring was enclosed with the letter written to Miss Ellie; also enclosed was a snapshot of Chugalug. Sue Ellen explains that she wants the map for herself. She wants to become financially independent of J.R. so that if he begins pulling any of his old tricks she can use her own wealth to either make him behave or finance her escape from him. You must, therefore, avoid J.R. at all costs; first, because he will want to stop Sue Ellen from obtaining this independence, and second, because he will most assuredly feel that the map and the oil fields are rightfully his. J.R. will use any means to stop you! Sue Ellen continues, saying that you will be paid very handsomely for your services and, if you find the map and return it safely to her, she will pay you a bonus of two million dollars. Unbeknownst to you and Sue Ellen, J.R. has been listening to your conversation while lurking in the hallway outside the living room doors. After Sue Ellen quickly gives you the snapshot, the ring, and $500,000 for expenses, she leaves you and proceeds upstairs to her room. You now must leave at once to meet the unknown challenges that await you.", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Datasoft", "publishers": "Datasoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.42", "wikipedia": "https://en.wikipedia.org/wiki/Dallas_Quest", "video_link": "https://www.youtube.com/watch?v=LX5OhG2f1ss", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71323-the-dallas-quest\n"}