{"altername_name": ["The Transformers: The Computer Game"], "name": "The Transformers: Battle to Save the Earth: The Computer Game", "overview": "The Transformers The Computer Game Vol. 1: Battle to Save the Earth is an action role-playing game released by Activision in 1986, based on the popular Transformers animated series. The game was released for the Commodore 64 in Datasette and floppy disk formats. It was the first Transformers game by Activision, which subsequently published more games for the franchise over two decades later. Based on the popular 1980s animated cartoon of the same name, The Decepticons are building a giant robot to threaten the Earth. Players must keep track of their action on a game map and send the appropriate Autobot (Cliffjumper, Bumblebee, Rodimus Prime, Hot Rod, Hound, Pipes, Blurr and Kup are featured) to combat each threat and prevent the Decepticons from stealing energy to build their giant robot. In order to accomplish this, the Decepticons must undergo a sequence of events in their complicated plan that takes place in such locations as: offshore oil rig, nuclear power plant, Dinosaur Park, space center, Andreas Zoo, and a pipeline. As a brief overview: First, energy must be collected to power-up a dinosaur in Dinosaur Park. This dinosaur will then be sent to collect Space Dust from the space shuttle before destroying it. The space dust will be used to grow hippopotami to gigantic proportions and use them to collect more energy from the pipeline. The Autobots' ultimate goal is to interrupt and delay this sequence. In Transformers players choose the Autobot to go to locations on the map. When they reach the location the game switches to a first-person view, and players have to move a cross-hair to shoot at a near-endless stream of Decepticon jets that fly onto the screen. Players can be hit by their missiles - too many hits and the screen cracks up and the Autobot is defeated, requiring another one to take its place. The more Decepticon jets that are destroyed, the longer it takes for the Decepticons to progress to the next stage of the plan, in sequence. The game's intro features over a minute of speech, which is notable both in 1984 and for the Commodore 64 platform itself.", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "David Crane", "publishers": "Activision", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.33", "wikipedia": "https://en.wikipedia.org/wiki/Transformers:_The_Battle_to_Save_the_Earth", "video_link": "https://www.youtube.com/watch?v=JvoHhjfkRE4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81696-the-transformers-battle-to-save-the-earth-the-computer-game\n"}