{"altername_name": [], "name": "Thunder Mountain Passage", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". As heroes go, this one didn't quite measure up to the standard. He was not overly tall, or even terribly muscular. His horse was showing the effects of the ten-week journey from the far south. A great deal of desert lay between home and the northern foothills that bordered the high-cloud country. Both beast and rider were covered with layers of dust, giving them an apparitional appearance when seen from afar. This in fact was exactly how the thief observed their progress. As heroic missions go, this horseman's quest required a titan, a fully-fledged swordsman, a man of steel. Taggar was the opposite. He was a farmer, a simple man, barely acquainted with weapons of war. He was driven not by politics or the lure of riches, but by love for his little daughter. So he pressed onward towards an ancient Graylock stronghold, protected by black witchcraft of such power that even the King's elite guardsmen shuddered and feared to advance. Taggar was the unwitting guide through the trap falls of Thunder Mountain Passage. The guardsmen followed him, their mission to restore the sword Death touch to the realm of the living. But when the Captain had announced their probable destination, the dite guardsmen had mutinied. The thief, travelling in the company of the guardsmen, pitied the Captain but he had been hired to follow Taggar, and follow he would ... Taggarwas no tracker, nor much of a hillsman for that matter, but he knew the Northstarpath as surely as if he'd been a regular visitor to the hellish place. He knew it from the tales told round the camp-fires of his youth, long before his family had abandoned the nomad life for the uncertain existence of a southern grain farm. The Northstar legend was guaranteed to send small children scurrying in terror to the nearest wagon or loft, or whatever might be handy to hold back the night. Taggar pressed grimly onwards and upwards. The thief followed in the shadow of the evening sun. Some two days journey ahead lay Castle Northstar, situated in a deep canyon between two impassable masses of sheer granite. Inaccessible, save for a narrow, winding pathway hewn into the rock along the west face, Northstar was the ultimate stronghold. On the northern shore of the natural lake that stood between an intruder and Castle Northstar, there was a lush meadow, enriched by the bodies of soldiers whose ambitious commanders had, for the last three centuries, led them here to capture the stronghold. And yet if they'd known the secret of Northstar's dungeons, they'd have surely turned tail and run. Taggar made camp for the night in a small cave as shadows fell across the trail and the evening sky boiled into red. This was not a good place to be at nightfall without shelter or a fire at the very least, a fact that had not escaped the thief, strategically placed behind some boulders at firelight's edge. Taggar, warm and content in the safe glow of the fire, pondered his reasons for being so far from home. In his mind there formed the image of a little girl wrenched from village and family by red-robed Vishtarian priests and taken to Northstar to be exchanged -with the Guardian of the Dead - for Deathtouch, a black, magical sword of outland origin. At least that was what one of the red dogs who'd been wounded and left behind had said before being clubbed to death by vengeful farmers. That little girl was Taggar's daughter. He flinched at the thought of her in the hands of such men. Beads of sweat broke out on his brow at the thought of the Guardian of the Dead. His mission involved climbing down the stairs of Hellsgate and crossing the river. Who had ever returned from there? Taggar knew of no one, real or legendary. Taggar's quest had come to the attention of the King's Prime Minister when it became obvious that he might actually reach Northstar. Taggar's connections with the gypsy nomads had attracted the royal eye. Apparently, there were gypsies (at least, this was Freerover's account) who had looted the Castle of some of its less important magical items and lived to tell the tale. Taggar had sought them out in the person of Moo la, futureseer and tale-teller to the nomad nation. Armed with information on how to penetrate the Castle's outer defenses, Taggar set forth with a vengeance. The thief had been employed to track Taggar, and had worked in the employ of the Monarch on other occasions. Bravery was not one of the thief's strong points, but greed was. When the guardsmen balked, three bags of gold and the promise of more motivated him onward. The darkness deepened to an evil blackness. A light rain began to fall, penetrating the flimsy cloak which protected the thief. A wet chill soon racked his body and he began to shiver uncontrollably. The rain grew heavier, carried by a wind that howled above the peaks, echoing eerily among the ravines. The droplets pounded at him with such numbing ferocity that they soon beat him into unconsciousness. The last thing he remembered was a shadow against the firelight, driving rain, and the feeling of being lifted and moved. Then everything was a blank. When the thief's senses came back to him, he found his quarry bent over him with a cup of soup. The warmth of the fire had dried him; his convulsions were gone. \"Even the elements conspire against those who approach Northstar,\" said Taggar. \"Past this cave there is only a footpath (half a day's climb upwards, half a day's climb downwards), a small meadow for the horse just beyond the boulders where I found you, and a dozen false paths leading into deadfall traps. I advise you to join me. You'll live a little longer.\" The thief said nothing for a moment, then nodded in agreement. There was nothing in his arrangement with the Captain of Guardsmen that prevented this liaison. Indeed, this turn of fortune could only aid his mission - to secure Deathtouch for the King. The cave was warm; the fire was bright. The fire flickered. Only the raindrops on the ground, and the rustle of the wind in the trees, broke the silence. The thief spoke. \"You saved my life,\" he said. \"My name is Jerrel and some day I will repay this debt.\" No further words were spoken. None were needed. The next morning was grey and foggy. Taggar pastured the horses at first light, while Jerrel laid out the rope and pitons that would be needed for parts of the climb. From here on the journey would be on foot along a treacherous series ofpaths, ledges, and booby-trapped byways known as the Thunder Mountain Passage. The going was slow for the first hour or so. Visibility was near zero. Taggar led the way and Jerrel was quite willing to follow behind. The fog clung to them in eerie gloom; there was not a breath of movement except their own. Suddenly, Taggar disappeared from sight. Jerrel peered through the mist and stepped forward. He felt the hole under him, and only his cat-like reflexes saved him from falling in. Somewhat shaken, he crept on hands and knees to the edge of the pit and peered in. There, some eight feet below, lay Taggar on a bed of wooden spikes, mortally wounded, but still conscious. By the time Taggarcould be rescued from the pit, he had lost a great deal of blood. He'd been pierced in several places by the sharp spikes at the bottom of the trap. He knew he was dying. \"You must press on,\" Taggar gasped. \"You must rescue my daughter from the fiends who have imprisoned her.\" Jerrel listened intently while Taggar repeated much of the instructions the gypsy had given him. \"I will dedicate my last breath to this task,\" said Jerrel. \"She will be free, or I will die in the trying.\" In the swirling fog, the thief buried the farmer in the mountainside. Then he set himself to the task before him. As heroes go, this one didn't quite measure up to the standard. He was not overly tall or muscular, though a thief's reflexes and lock-picking abilities might be useful. He was on his way to Northstar Castle to keep a promise. And the Thunder Mountain Passage, treacherous and unforgiving, waited for him to make a mistake…", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126383-thunder-mountain-passage\n"}