{"altername_name": ["Being a Smart Thinker With the Tink Tonks"], "name": "Tink! Tonk! Tonk in the Land of Buddy-Bots", "overview": "Imagine you have become a beam of light and are magically swept along inside your computer. Below you is a deep blue sea crisscrossed by a glowing grid. Above you is a peach-colored sky. On the horizon, little disk-shaped islands float in the air above the CrissCross Sea. You fly down for a closer look. On the islands are mountains and valleys, lakes and rivers, forests and fields. One island even has a little town with houses and streets. You have found TinkTonk Land, the home of the TinkTonks. And here are the TinkTonks: Tink is their trusty leader.He is good at helping all the FnkTonks. Tonk is Tink's best friend. He usually needs Tink’s help, because he is good at getting into trouble. Tuk tends the TinkTonk garden. He likes to watch his flowers grow. Gork’s Soldiers: These soldiers try to stop Tonk from collecting Buddy-Bot parts. Be careful! if Tonk is captured by a soldier, he is sent to Gork’s Castle. At Level 4, you lose a Buddy-Bot part if Tonk is captured. Then you must search for the part in the castle. Black Holes: Stay away from these traps! If Tonk falls through a Black Hole, he goes directly to Gork’s Castle. You can also use the map to help find your way around Buddy-Bot Land. Sky Holes: These blue holes appear in Gork’s Castle. Look out! If Tonk falls through a Sky Hole, he is sent back outside his house. You can then play again or send Tonk home. You keep the Buddy-Bot parts you’ve collected if you play again. You lose the Buddy-Bot parts you’ve collected if Tonk goes home. The program then starts again from the beginning. Gork’s Castle: Mean, old Gork lives in Gork’s Castle. Watch out! Don't let Tonk touch Gork or Tonk is sent back outside his house. You can then play again or send Tonk home. (See Sky Holes.)", "platform": "Commodore 64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Angelsoft", "publishers": "Mindscape", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=s975T5soiig", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76129-tink-tonk-tonk-in-the-land-of-buddy-bots\n"}