{"altername_name": [], "name": "Tower of Fear", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". Blackheart Firethrower was not lamented when he passed into the world of shadow. Indeed, there was much cause for celebration, since he was a dark cloud upon the blue skies of Graylockland. He was a Wizard, and the Wizards were not native to Graylock soil; rather they came from the alien lands beyond the fabled stargates of Northstar Castle. They had been driven from their land by an uprising of so many dissidents that even the powers of necromancy could not stay the tide. In Graylockland, the Wizards flourished - B1ackheart with them - and, in time, they grew so powerful that no one dared oppose them. They built impregnable fortresses and fell to fighting among themselves. Blackheart Firethrower was the most powerful of the outland Wizards, for he alone understood the secrets of immortality. With each reincarnation, he grew more and more powerful until eventually no other necromancer could withstand his attacks. The other Wizards commissioned a youth of sixteen, who would not be suspected, to enter into the service of their adversary, Blackheart Firethrower. He would gain the trust of Firethrower and poison him with blood of Medusa obtained from Hiatia the serpent-seller. This was the only death from which there could be no awakening for the dreaded Blackheart Firethrower. The boy did his job well, but so powerful was his victim that death was not immediate. Indeed, B1ackheart employed his last strength to transform his assailant into a Cyclops who, when killed, became reincarnated. Thus began a living death. The stricken Blackheart Firethrower then caused huge vines to grow, covering all the ground-level entrances to the Tower. He scattered his treasures in the mazes and corridors of the interior to confound and destroy anyone who might try and plunder it. Then he laid back his head, rested a moment, and uttered a fearsome curse upon the plotters. Gathering strength from the looming darkness, he loosed a fireball, the likes of which were so devastating, as to level and melt the stone fortresses of his enemies. His revenge complete, B1ackheart died. The historian, Freerover, outlined this tale in answer to the questions of a would-be explorer. \"Far from the city of Belestria, in Graylockland - where all adventurers equip their expeditions - lies, in the Great Outback, the Tower of Fear. The fortress of Blackheart Firethrower has been occupied only by Wraiths and Cyclops for the past three hundred years. Anyone who has dared to disturb the slumber of evil in that dank place has paid with their life. \"You, Sir Adventurer, shall enter the Wizard' s Tower, defeat all those Notmen who oppose you, and emerge victorious with treasure and glory. You shall be proclaimed a true hero, a man amongst men. \"But if you fail, the slimy slugs of the Dungeon shall feed upon your mortal remains while the Wraiths suck away your spirit. Do not fail, oh mortal, or surely you shall feel the hot breath of utter devastation upon your nape.\" The adventurer was never seen again.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126566-tower-of-fear\n"}