{"altername_name": [], "name": "Traverse", "overview": "An action collect-em-up game created by Tony Brantner and published in RUN 1992/05-06 magazine. This action game will drive you crazy in minutes and keep you entertained for hours. Traverse combines features of Pac-Man and Pinball, with unique twists of its own. Like Pac-Man, it's a travel-the-path-and-eat-the-dots game, each level being a maze with dots along the paths. Unlike Pac-Man, however, you don't direct the ball with traditional joystick commands. Instead, your joystick controls yellow flippers at each intersection of the maze. Press the fire button to start, then guide the ball across all of the dots, making them disappear. Pressing your joystick in the 8 possible directions will make your ball deflect right, left continue straight or bounce back when it hits the intersection. You'll need to experiment with the controls the first game to get the hang of it. To pause the game, press the SHIFT-LOCK key. A game consists of three turns, and for each turn a timer counts down to zero. The timer counts down from 100 at level one, from 96 at level two and so on. At the higher levels, the ball also rolls faster. When you collect all the dots you advance to the next level. In level one, you earn one point for each dot you eat, in and end your turn. level two you earn two points, and so on. Clear a level, and you get a 1000 point bonus. Earn 10,000 points, and you win an extra turn. The turn ends when you run out of time or lose the ball. OUT OF CONTROL So far, so good. The hazards you find scattered along the paths, however, can quickly confound you! Spinners-the only permanent hazards-send the ball off in random directions. The other hazards turn off and on every few seconds. U-shaped magnets hold the ball until the hazards disappear. Round bumpers reverse the ball's direction. Diamond-shaped teleporters zap the ball to one of the spinners. Purple squares take the ball and end your turn.", "platform": "Commodore 64", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Tony Brantner", "publishers": "RUN", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5LQ7-ATX8wI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167213-traverse\n"}