{"altername_name": [], "name": "Tutankham", "overview": "This game for Commodore 64 is the port of Tutankham, an arcade game developed by Konami in 1982. The game works perfectly on both PAL and NTSC models. However, for game speeds similar to the original arcade game, it is suggested using an NTSC model. Overview: In this game, the player controls an explorer who is robbing Tutankhamun's tomb. The player will search for precious treasures (maps, lamps, chests of gold & jewels, and, above all, the golden mask of King Tut) and fight off the various creatures that guard the tomb to ultimately find the way through the catacombs. Gameplay: The player must guide the explorer through a series of progressively more difficult mazes across different stages. The explorer may move in four directions, but can only fire in two directions, left and right, making the player helpless in vertical shafts. There are also \"warp zones\" located in random parts of each maze that allow the explorer to be teleported from one area of the maze to another. There are several different creatures that constantly materialize from \"spawning zones\" within the maze and attack, including crows, snakes, bats, dragons, and other magical beings. Those creatures can be destroyed to score between 20 and 60 points with either bullets or a \"flash bomb\". The explorer has a single \"flash bomb\" per life that destroys all enemies on the screen. On each stage, the explorer must pick up keys in order to unlock the door to the room where each of the treasures are kept, allowing the passage to the next stage. Along the way, the explorer may grab optional treasures (rings and coffers) for bonus points. If the timer reaches zero, the player's ability to fire is removed. Bonus points are awarded based on the amount of extra time left over when a stage is completed. After the player has recovered the King Tut's treasures in all the stages, the game starts over again with increased difficulty and more keys to pick up. At 30,000 points, the player earns an extra life.", "platform": "Commodore 64", "release_date": "February 24, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "LC-Games", "publishers": "itch.io", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/159597-tutankham\n"}