{"altername_name": [], "name": "Underground (Markt & Technik)", "overview": "An action game from Jørgen Østergaard Jørgensen and published in 1991 in 64'er Sonderheft 61. Towards the end of the twenty-first century, casks of radioactive material were being recovered from the salt mines. After all, people had learned something new (and besides, rock salt had become rare)! At that time, “final disposal” was in huge cave systems with titanium-uridium steel walls lying kilometers deep in the earth (Fig. 1). These systems were protected against thieving, megalomaniac dictators with the most sophisticated security computers. But over the next few years it turned out that atomic radiation had destroyed the molecular composition of the wall alloy and that the entire cave system was in danger of collapsing. The containers were now thrown into the sun, never to be seen again (really?). The salvage work went quickly forward. But from one day to the next, the security robots could no longer be switched off. Good advice was expensive, and scientists began to develop a high-tech manned probe. Now, after several failed missions, the united nuclear federation has chosen you to salvage the last garbage barrels. In order not to contaminate yourself, you steer a robotic vehicle through the contaminated maze; a highly developed construction with special protective shields, of course. And since there is no filling station deep inside the earth, the energy required for this is drawn from the container that has just been picked up. You should therefore keep an eye on the display of your energy supply at the bottom left of the screen. The mission is not without danger because there are mobile and rigid safety precautions. If you collide with a \"patrol\", your vehicle is instantly destroyed. The jets from the permanently installed fuses take fuel away from you and can therefore be overcome as long as you have enough energy available. Since even the most nerve-wracking mission needs some variety, you can choose between sound effects and music during the game.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Jørgen Østergaard Jørgensen", "publishers": "Markt & Technik", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134637-underground-markt-technik\n"}