{"altername_name": [], "name": "UWOL: Quest for Money", "overview": "\"Uwol didn’t have enough after earning about the 90% of all the income which resulted of selling retrovideogames in Spain and getting himself rich. Now he wants to experience the adventures of his good old idols while he keeps engrossing his bank account, ‘cause that’s the very matter of his existence. After gathering precious prizes following the steps of his favourite classic videogame heroes (this is, the fire which doesn’t burn -which looks great in the hall of his house-, the proton pistol with the proton charger, three knickers from Gremla, the book of bills of Miner Willy, Wally’s pajamas, the Sword of Power (just a copy, ‘cause the real one is in use), heaps of Saimaza coffee…), he learns that a mysterious and excentric millionaire, formerly a thief, hides quite a big fortune in gold coins in a very old manor next to Canutos Forest -the so-called Storm Palace. So he decides to emulate his idol Goodie and steal them! The problem is that it won’t be very easy… The cellar of Storm Palace are quite deep and are full of nooks and crannies. Besides, the intrincate disposition of rooms makes it very easy to get lost and go back to the starting point. That’s what happened to Uwol: his greed made him to get deeper and deeper into the manor so he got lost and trapped in the lowest labyrinth, inhabited by Vampy, Franky, Fanty and Wolfy, who will try by all means to make Uwol fail in his task.\" That's the story behind \"Uwol, Quest For Money\", an original speccy game by the spanish group \"The Mojon Twins\" already ported to several other systems. Now it's the turn for an MSX2 version made by Imanok.", "platform": "Commodore 64", "release_date": "2010", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "RGCD", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=vp73Ls-Ovxw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113967-uwol-quest-for-money\n"}