{"altername_name": [], "name": "Valdez", "overview": "Valdez programmed in BASIC is a supertanker simulation. The goal objective of Valdez is to navigate the helm of a supertanker from the North Pacific into the port of Valdez Alaska. The journey is around 62 miles (100 km) from start to finish. Many characteristics regarding the simulation are presented which makes the simulation a very difficult challenge. A successful crossing of Prince William Sound to Valdez which narrows down to .5 miles (900 m) and ends by docking the ship with the floating unloading station at Prudhoe Bay oilfields. The supertanker dimensions are length 980 ft (300 m) and a width or beam of 167 ft (51 m). As captain of the roughly 300,000 ton supertanker you must calculate and avoid many things. Obstacles are other sailing vessels, supertankers downstream, running aground, tides and icebergs that originate from the Columbia Glacier that could be lurking in the water as well. The simulation was released circa 1979 and in some eerie way foretells of an actual real world environmental disaster. That disaster would be the Exxon Valdez supertanker that ran aground in Prince William Sound on March 24, 1989 ten years later. Player controls are entered by command text prompts that effect the rudder and two engines with navigation by instruments only using the Collision Avoidance System (CAS) radar. The radar has several resolutions to aid in fine grain control to avoid obstacles. The game has two modes open seas navigation or full simulation. Open seas navigation allows navigation practice with no coastline or islands but will still overlay vessels and icebergs. The other is full simulation with all of the aforementioned challenges in place. The radar map 256x256 is loaded into memory and can be recalled during as each turn event unfolds while plotting your course.", "platform": "Commodore 64", "release_date": "", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Dynacomp", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134747-valdez\n"}