{"altername_name": [], "name": "Valentino", "overview": "Valentino is a miscellaneous arcade/action game for the Commodore 64. It was developed by Francesco Chiola and published in Commodore 64 Club #04 [Italian Release] in 1988. You will impersonate Valentino, the famous Italian Latin lover and you will have to conquer three beautiful women one after the other. Mary Fitzgerald: romantic English lady, Katy McConnery: sporty young American and Olga Von Stauffel: intellectual Austrian librarian, are the names and related characters of the three girls to conquer. Depending on the latter, you will need to bring the appropriate money and gifts to each. There are many enemies you will meet along the way: ghosts, boomerangs, worms, cannonballs, angry dogs, sudden and random flames, mice, etc. These enemies upon contact cause a decrease in the time limit available to you. In addition to the enemies listed above, you will also find objects of various types, ladders to climb, doors with colored knobs (to be opened with a key of the same color), entrance doors (one for each girl), green bells, balloons (which prevent fall), elevators, a \"magic\" chicken (which makes you immortal for the duration of permanence in the painting itself) and many others. Some of these have a very specific function and are indispensable for conquering girls. The candle is indispensable for lighting the two turrets. Without it the picture will appear dark to us. In these conditions, death is certain even if you have the antidotes against the enemies in question (bone for the dog and oil can for the armor). We have seen that the main aim of the game is to conquer all three girls, bringing them gifts compatible with each one's character, a little heart and a variable sum of money. A wrong choice of gifts (eg a tennis racket for Olga the intellectual) will mean a sharp refusal by the woman to be conquered, alas it will be necessary to do it all over again. There are three gifts for each girl, namely: • Mary (romantic): glass of champagne, jewel, red rose, $300,000 money. Katy (sport): tennis racket, glass of beer, black sunglasses, money $400.000. Olga (intellectual): book, yellow rose, brown eyeglasses, money $200,000. The F1 key allows you to start over.", "platform": "Commodore 64", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Francesco Chiola", "publishers": "Systems Editoriale", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167440-valentino\n"}