{"altername_name": [], "name": "Vault of Terror", "overview": "A 3-Dimensional adventure game published Ahoy! 1986/10 (Issue #34). Sarnoth was once a happy, prosperous land, a country of mirth and joy where the sun shone year-round. When the new king inherited the throne, he hoped his rule would be as easy and peaceful as his father's reign before him. In the two hundredth year since the fall of Lemuria, the bad omens began. Dogs began speaking in tongues right in the royal court. The full moon seemed to burn ashen red for weeks. Babies slept fitfully, and the kingdom was plagued by oversized serpents which surfaced from out of nowhere and made off with whole cattle. One day, while the king was arguing with his counselors in court over the source of the blight that was upon the land, there arose a massive black cloud front that moved over the kingdom and seemed to fix itself over the castle. The people trembled with terror and many locked themselves inside their houses. In the midst of the shifting darkness over the Castle Sarnoth, slithering shapes moved up the royal road, over the moat and into the castle. Guards rushed into the courtyard to battle with the shadowy figures, seeking to protect the king, and their screams were the only indicator that they survived for even a moment. As the sun was eclipsed, there appeared four sets of glowing eyes in the darkness before the king. The counselors fell to their knees with horror, and the court jester began cackling madly. The largest form moved closer. \"We are the Naga'an ancient race of serpents from a land you have never seen. We seek a place of refuge here in Samoth. I claim your crown and your castle, in return for your life.\" The king was the only one who survived the massacre. He was found the next morning, ragged and filthy, wandering the countryside. The castle is devoid of human life, and there are none brave enough to venture within and see just what form of creature lives there. The purpose of your quest, adventurer, is to journey into the dungeons beneath the castle, destroy the Naga, and return the crown and kingdom of Sarnoth to their proper owner. You will need courage, luck, and wit to succeed in the Vault of Terror.", "platform": "Commodore 64", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Cleveland M. Blakemore", "publishers": "Ion International, Inc.", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=FkZtsnYsoE8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95178-vault-of-terror\n"}