{"altername_name": [], "name": "Werewolf Wars", "overview": "A text adventure game published as a type-in game in the book \"Castles & Kingdoms\". OH SING A TALE OF WEREWOLVES OF NAUTICAL SCHAGRINNED THOUGH EACH ONE CRAVES THE OCEAN NOW THEY ALL ONCE WERE MEN THE RING, SHE IS SO PRETTY ALL SILVERY AND JADE AND YOU ONLY KNOW BY WEARING IT THAT THE THING IS WEREWOLF MADE YOU SLIP IT ON YOUR FINGER AND OH SO VERY SOON YOU'RE HEFTING SAILS FOR CAPTAIN RED AND BARKING AT THE MOON. SO HOIST AWAY YE NAUTICALS SET THE TOPSAIL AND THE MAIN YE ARE THE WEREWOLF SAILORS AND THIS IS YOUR REFRAIN KISS THE SEA BREEZE, MATIES AND SING A SAILING TUNE YOU'RE CUTTIN' THE WAVES FOR CAPTAIN RED UNDER A WEREWOLF MOON FROM SONG OF THE RINGSNARED SAILOR (FREEROVER THE BARD ) The pilgrim entered the waterfront tavern with some trepidation. He'd never seen a Nautical before, only heard about them in the way most youths absorb the history of the Kingdom. The waterfront was dangerous in its own right, populated as it was with a mixture of Humans, Graylocks and Not men. Only the Nauticals were a pure species and they alone held the power of the sea. The pilgrim shuddered a little as he made his way to the bar. The casual observer who did not know about Nauticals would have been horror-stricken. The pilgrim's face was gaunt and stretched, ears pointed and blackening at the tips. The beginnings of lupine whiskers were forming on his cheeks, his teeth and nails had already lengthened. The pilgrim was becoming a werewolf. Surrounded by Nauticals, the pilgrim/werewolf nervously sipped his drink. Amid the chattering, growling and occasional howling of the Nauticals around him, his thoughts drifted back three months, to the polymorph's silver ring and a magic - all too rare in these enlightened times - which had transforming powers. Then reality crept in again and the pilgrim quaffed his drink. He ordered another. Captain Red watched the pilgrim at the bar with interest. He was not dressed like the ragtags he'd seen ringsnared in the past. This pilgrim was obviously a noble or the son of a noble. Captain Red was intrigued. Here was money to be made. The erstwhile Captain was well known amongst the Nauticals as a rogue. But he was also known for his temper ashore. The pilgrim had also heard of Captain Red. Lt was for that reason he'd chosen this particular tavern. He'd been told that Red, above all other Nautical officers, was the most competent seafarer there was, a rumor that he meant to test. \"I be Captain Red.\" growled a voice at the bar. \"Be ye lookin' for me?\" 105 It has been said that the extrasensory perception of a ringsnared being are multiplied tenfold. It has also been said that Captain Red had, in his pre-lupine existence, been a telepath of great talent. The meeting that followed was both inevitable and productive. Midnight found the pilgrim at the harbor dockside, as arranged in the tavern. Captain Red had agreed to provide ship, crew and protection for the pilgrim and a safe passage to a certain Isle of Known across the Boiling Sea -an area of storminess with which Red was familiar. The pilgrim, now much lighter of purse, had chartered the ship for three months. What the pilgrim didn't know was that Captain Red had no ship of his own, having been recently relieved of it in a fight that turned sour. The chartered vessel that they were now boarding in the dead of night was the property of the Rex Company, a prosperous and reputable shipping firm. The pilgrim had paid the Captain 300 ducats (nearly two pounds of gold) to charter a stolen ship and feed a shanghaied crew. It is doubtful whether knowledge of Red's situation would have made much difference to one so determined as this pilgrim. The sea-fever burned within him; moreover, he had a plan. There existed, somewhere on the Isle of Known, a potion that would enable him to retrieve the charm that could release him from the spell of the polymorph's ring which had turned him into a werewolf. He knew that there had been a shipwreck, but not where. Perhaps the fabled Graveyard of Ships, which lay off Known , would be a clue to his salvation. He wasn't sure. But he did know that he had three months to complete his mission. After that the polymorph would have erased all trace of his former existence. He would be Nautical for the remainder of his life. Now, as luck would have it, Captain Red had other plans. The ship was sturdy and capable of effective raiding. Though grudgingly deciding to honor his promises, Red's first love was piracy. Ah yes, the pirate and the pilgrim. What material for a ballad, what color for a tale. These at least were the thoughts of an old Human who had sneaked aboard in the confusion. There was always a welcome for a strummer of lutes, so Freerover had little to fear from stowing away aboard this vessel. He'd been to Known, though not to the Graveyard of Ships. There would be songs to sing on this voyage; and indeed this voyage would surely produce its own song. Freerover was as happy as Captain Red to see the deck of this ship tonight. Alight breeze rippled the water as the command to set sail passed amongst the crew. The rustle of unfurling canvas, the creaking of ropes, the slap of the waves on the planking, all these sounds indicated a stealthy departure. In the bow the pilgrim dreamed of salvation. The Captain dreamed of booty at the wheel. The first and second mate, with three able-bodied seadogs, worked anchor and line. Below deck three dozen press-ganged drunks slept. And the old lute-strummer chuckled in undisguised glee at the adventure he knew was ahead. As the lights of Oceania slipped into the fog, the sea waited with open arms.", "platform": "Commodore 64", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Dan Caggiani", "publishers": "Virgin Books", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126569-werewolf-wars\n"}