{"altername_name": [], "name": "Wild Streets", "overview": "New-York, Year 1998. The once most prestigious city in the world, has now become a fighting zone. Half of the city is left in ruins, and it is in that part of town that the marginals and gangs are living, hunted by every law enforcement agencies. The other half of the city consists of fancy mansions, in some of which the most important drug barons reside. Unfortunately, they are the ones who run the city using the enormous profits they make from dealing drugs and weapons. They now have succeeded in endangering the country's economy. The U.S. government, wanting to avoid a terrible crisis, called the CIA to run several types of operations in order to get rid of this bad substitute of government. The C.I.A., headed up by \"The Boss\", has to clean up the city of its crooks. One plan is to reorganize the city by placing security check-points at strategic positions. The operation was set up for April 4, and quickly proved to be an unprecedented success. The badly organized, smaller street gangs, were greatly outnumbered and couldn't match the extremely well armed law enforcement troops. On May 7, during a successful raid, the state police special branch, took possession of a huge arsenal of weapons and ammunition, worth more than two million dollars. This raid was an important stage in the whole operation. Realizing the sticky situation they were in, the heads of the crime organizations now started making plans for themselves: They needed to regain their control over the city and above all, secure their territories. On May 15, they kidnapped \"The Boss\" in order to get from him the names of his operatives involved in the C.I.A. fight against organized crime. This way, they were convinced they could stay in control of the situation and become even more powerful. Your mission is to liberate \"The Boss\" and to bring him back safely.", "platform": "Commodore 64", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Titus France SA", "publishers": "Titus Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "0.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=0-57PO-GDxM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110116-wild-streets\n"}