{"altername_name": [], "name": "Woody the Worm", "overview": "Released as part of Golden Disk 64 1993/04. Life's tough being a small worm, especially if your name's Woody. The player must help our wiggly chum navigate a series of mazes, collecting treasures for bonus points whilst on the way to the exit. The catch here is that Woody must not touch any part of the scenery, nor touch any of the patrolling enemies that inhabit each level; think of this game like one of those puzzles where you must avoid touching the metal wire without setting off a buzzer. This is not an easy game by any means. The first set of levels encountered feature some really tight spaces to squeeze through and many contain enemies on fast, looping patrols that you must observe and memorise in order to bypass them correctly. Woody is equipped with a limited number of shields that allow him to pass through enemies for a brief period of time, but colliding with the scenery will still kill him, so you still need to be cautious. Scattered around each of these levels are flashing objects that can be collected for bonus points. Naturally, attempting to collect these makes things a lot more difficult as you're constantly putting Woody in harms way, but those wanting the maximum score will need to collect them all. Should you be adept enough to beat the first set of levels, the game places you inside a hen-house, replete with murderous, egg-pooping chickens and weird jack-in-the-box things. Here, the objective is to collect a series of keys and use these to remove the locks on the hen-house door, without getting eaten by the patrolling rooster. The shields from the earlier section are replaced with a turbo feature, which doubles Woody's movement speed as long as the fire button is held down. Although the turbo is limited, it can be replenished by removing the door locks and you'll certainly need to as the time limit in this section is quite strict. Overall, I found the hen-house to be easier than the earlier maze levels that precede it, largely because there are less pixel-perfect alleys to navigate and no fast-moving critters to avoid.", "platform": "Commodore 64", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Thorsten Grosch", "publishers": "CP Verlag", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Ba_38XR0jPo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76171-woody-the-worm\n"}