{"altername_name": [], "name": "Xama", "overview": "Xama is a side-scrolling shooter developed by Ronald Mayer (Copter Duel, Diamond Fever, Hyper Snake, Joe, etc.) and published by CP Verlag in Magic Disk 64 1989/02. The space game \"Xama\" is a very special kind of game of skill, in which anyone who is not yet perfect at the joystick can learn how to use the most important invention of mankind since the toaster. In an underground labyrinth you have to shoot the energy blocks with your glider (75 per level!). The energy that you use up a) by moving and b) by shooting can be replenished by firing energy blocks. Energy barriers can only be destroyed at their ends (above and below). The energy barrier then disappears immediately and you can pass unhindered. The space glider is controlled in port # 2, as usual. Do not handle your joystick movements too \"expansively\", because the space for maneuvering is very tight. There are one or more bases in each level. If you landed on this and your glider \"crashes\" at some point later, you no longer have to start from the very beginning, but start from this base with your new glider. Since \"Xama\" has a storable hi-score list, it is certainly important for you to know exactly how the points are distributed: Stone 3 points Stone block 1 point Energy barrier 20 points Energy block E 10 points For every level you pass you get 300 points and the remaining energy * 5. 7 space gliders are available for you to successfully complete your mission. XAMA and its creator Ronald Mayer was the winner of a Magic Disk competition which included a cash prize and publication of the game.", "platform": "Commodore 64", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Ronald Mayer", "publishers": "CP Verlag", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=K_AGsIfCavs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137338-xama\n"}