{"altername_name": [], "name": "Xiphoids", "overview": "A multi-scrolling shooter published in Magic Disk 64 1992/03. Welcome to the realm of evil, friends! You imagined this inhospitable place to be very different, right? Well, the idea of a large kettle in which the poor sinners have to stew is long out of date and must finally disappear from your heads. 1992 AD the horned devil with horseshoe has long since retired - whoever it catches now, he is lowered into the depths of madness with a cabin glider and has to assert himself there. . . A labyrinth of unknown proportions awaits you to search through. With the small cabin glider you can move relatively comfortably in the cave passages, but the part is poorly armed against rays in general and skulls in particular. In order to raise the energy bar again, the energy symbols (marked with an \"e\") must be collected (\"slide on and button!\"). You can refuel properly on the icon with the two arrows. If you fly onto the field, hold down the fire button and pull the joystick to the right, the one-man ship is charged. However, if you hold down to the left, the energy supply is discharged and the devil has one more soul again. The confusion is completed by the teleport fields scattered over the whole labyrinth, with the help of which the player can be taken to another, completely unknown location. The energy barriers that guide life-consuming screw beams and only ever clear the way for a few seconds are insidious. Usually there are also magnetic fields in their vicinity that push the cabin attendant into the danger zone. There are so many different things to discover in XIPHOIDS that it would be mean to reveal everything here in the instructions. Plug in your joystick and go on a journey of discovery yourself. One thing is guaranteed: even inexperienced players can dare to take on the underground adventure without any problems. That you can only open a locked gate with a hidden key, is understandable. It is the same with all the other secrets. INDIANA JONES did not have a travel guide when he entered the TEMPLE OF DOOM. However, he did not have to do without an exciting adventure (precisely because of that?!). May it be the same for you here.", "platform": "Commodore 64", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Dynafield Systems International", "publishers": "CP Verlag", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=G05Lg9JVsmU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118922-xiphoids\n"}