{
  "name": "The Kiwi's Tale",
  "shortName": "kiwis-tale",
  "description": "<i>The Kiwi's Tale</i> is a sequel/remake of <a href=\"https://www.mobygames.com/game/new-zealand-story\">The New Zealand Story</a>. Developed for the The Retro Remakes 2008 competition, it tells the story of Nik, a kiwi whose friends were abducted by an alien sheep, envious of the kiwi being the icon of New Zealand. So Nik must travel through New Zealand to rescue them.<br><br>The game has many similarities with its predecessor, but has also new features. Instead of travelling from north to south, this time the kiwi has to travel from south to north, from Stewart Island to the Sky Tower, and then to the UFO. There are fifteen stages in total, including the already mentioned plus Dunedin, Queenstown, Mount Cook, Punakaiki, Kaikoura, Taniwha, Cook Strait, Taranaki, Taupo, Mount Ruapehu, Waimoto Caves and Tokoroa. At each stage, Nik has to search for his abducted friends in a platform perspective, with the help of a minimap this time. They are caged and Nik has to find them, while using a crossbow and arrows to defeat creatures such as snails, pukekos, hedgehogs, sheep, bats, kiwifruit monsters, sharks and stingrays. Some creatures ride flying vehicles, and as in the previous game, Nik can fly them if killing the enemies without destroying the vehicle. The vehicles available are the balloon, the airplane (faster horizontally, used by pukekos) and the helicopter (faster vertically, used by sheep). Sheep also drop SPNKR (Sheep Powered Nuclear Killer Rocket) Rocket Launchers, which can be equipped by Nik, lasting until the end of the stage.<br><br>After defeated, the creatures drop characteristic New Zealand items such as greenstones, buzzy bees, L&amp;P bottles, rugby balls, tomato sauce bottles, jandals and Lord of the Rings Oscars. Collecting 50 of those grant the player an extra life. Also scattered along the stages are letters. Spelling AOTEAROA (New Zealand's Maori name) grants an extra life and a short period of invincibility. The game also has more New Zealand references, as Tui Billboards and AA Road Signs.<br><br>Some levels are bonus ones, in which Kit has to try to stay alive for 60 seconds while creatures keep coming at him at a fast pace. Kit starts with 3 lives and an auto save feature allows the player to continue playing from the last stage reached.",
  "publishedBy": "",
  "developedBy": "",
  "released": "Dec 24, 2018",
  "alsoFor": "Amiga, Browser, Macintosh, Windows | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/amiga-cd32/kiwis-tale",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Amiga CD32",
      "releases": []
    }
  ],
  "shot": [],
  "cover": []
}