{"altername_name": [], "name": "Overthrown", "overview": "Perhaps you've clung to power for too long. With protests in the street and the army on the hand of the opposition it is time to grab the money and go! Escape on foot, by car and plane to your tropical island to retire peacefully, if you can get there alive! Expect fierce resistance in this VIC-20 action game where you play the bad guy! This game is a work of fiction; any similarity to autocrats living or dead is purely coincidental Gameplay The game starts at the presidential palace where you have to collect cash for the journey and retirement. Good that it is flying out of the windows. Meanwhile, armed vigilantes try to kill you while the roads to the airport are being blocked. It is good that you brought a hand gun in case things get tense, or maybe it already is. This section ends when you enter the armored car and drive away or when the palace is set on fire. The next section is a race to the airport. Crash through barricades, avoid land-mines and air strikes until your armored car breaks down or runs out of fuel. If you have the cash ($1000) you can get a replacement on the spot otherwise you'll need to walk. At the airport your fighter jet is ready for take off. In the air you'll cross the sea in search for the tropical island with your retirement villa. However the air force and navy are trying to stop you. Avoid helicopters, fighter jets and surface to air missiles. Don't forget to refuel in time at the towers! Aircraft fuel isn't cheap too ($100 a unit). With luck and skill you will reach your retirement villa with plenty of cash to enjoy! Or not...", "platform": "Commodore VIC-20", "release_date": "December 1, 2020", "game_type": "Homebrew", "esrb": "", "developers": "Erik J. Hooijmeijer", "publishers": "Erik J. Hooijmeijer", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369515-overthrown\n"}