{"altername_name": [], "name": "Realms of Quest III", "overview": "Realms of Quest III is an RPG for the VIC-20. It has been a thousand years since the great bards had written the epic poem telling the legend of a hero who had slain the demon wizard, Nikaedor. The hero, though mortally wounded, shouted a final cry of victory: “Hark! The Evil Wizard and his Eternal Orb no longer hold dominion over this land”. And now, bandits, orcs, highwaymen and all sorts of vile creatures have gotten bolder. Where they roamed before as mere nuisance, they now dare more often, and even well armed escorts are no longer safe from their attacks. They wander from their wilderness and abandoned ruins of the Land of Rivar to threaten cities within its borders. Sanctuary can no longer be guaranteed. Even dragons have begun to appear, reducing whole villages to ash. The King sent forth his finest on a scouting mission to the old ruins of Nikaedor's lair; warriors of unyielding strength and magic wielders of cunning sorcery. After the passing of several moons, their bodies floated in the moat of his great castle. A journal was retrieved from their watery grave. The final entry petrified those with ears to hear it, “Nikaedor has returned. Death to those who fail to pay tribute on this day and forever. Hail Nikaedor!” The player creates a party of 6 characters in the village surrounding the King's castle. Each character randomly roles 6 attributes: strength, dexterity, intelligence, constitution, wisdom, and charisma, and can pick from 8 races, which allows the character to choose a class. Items and armour can be purchased at the local weapon shop, injured characters healed at the inn, and deceased characters resurrected at the temple. The player can then explore the overland by foot or purchase a boat to sail the seas. As the party explores the land they also encounter enemy parties. The party can choose to fight, run from, or greet the enemies they meet, and if engaged in combat, each character chooses to fight or cast spells. Enemies are graphically displayed on the screen. When entering dungeons, game play changes to a first person perspective, where the player must exploring twisting passageways and doors to gather treasure and items.", "platform": "Commodore VIC-20", "release_date": "2009", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "System Four", "publishers": "Psytronik Software", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168747-realms-of-quest-iii\n"}