{"altername_name": [], "name": "Realms of Quest IV", "overview": "Realms of Quest IV is a role playing game for the VIC-20. From the northern mountains came forth a sorcerer, a magician of such evil power as to tame all manners of men and beast. He bore the name Nikaedor, and no longer did men call out to the gods. For they now called out to only one master; the dark sorcerer of the high mountain, dwelling within his castle Rivaria. But many men were not content, and they gathered their strength and overturned their master, and all those who were under his will in turn were imprisoned in endless dungeons. Time passed, and Nikaedor attempted many a times to rise, but was once again put to rest. The reign of the fairer creatures above the earth are endlessly threatened, and thus your quest is to battle the labyrinth below our feet, and ensure for yet another generation they can live in peace. In the dungeon, lay riches, glory, and the immortality of your name! The player creates a party of 8 characters in the starting town. Each character randomly rolls 6 attributes: strength, dexterity, intelligence, constitution, wisdom, and charisma, and can pick from 10 races, which allows the character to choose a class. Items and armour can be purchased at the local weapon shop, injured characters healed at the inn, and deceased characters resurrected at the temple. When entering the dungeons, game play changes to a first person perspective, where the player must exploring twisting passageways and doors to gather treasure and items. As the party explores the crypts they also encounter enemy parties. The party can choose to fight, run from, or greet the enemies they meet, and if engaged in combat, each character chooses to fight or cast spells. Enemies are graphically displayed on the screen.", "platform": "Commodore VIC-20", "release_date": "2013", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Ghislain de Blois", "publishers": "Psytronik Software", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://youtu.be/gTv_q8S3dig", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125517-realms-of-quest-iv\n"}