{"altername_name": ["Realms of Quest Trilogy"], "name": "Realms of Quest", "overview": "Enter Realms of Quest III, the computer game that offers you the chance to assemble a party of six adventurers who undertake heroic acts in a vast world of deep dunjons to explore, fantastic creatures to fight you, and treasures to be won. The adventure is not for the faint of heart, it is a challenging but rewarding experience. You are invited to discover for yourself the following features that await you in this grand computer role playing game for the Commodore VIC-20*: • 12,000+ lines of assembly language, compiled into a fast and responsive game-playing experience. • An easy to understand, intuitive, user-friendly menu system and interface. • Multi-color graphics along with a 3D first person perspective when you explore the underground dunjons. • Over 70 monsters, where each of them is represented with it’s own portrait during combat. • 40 magic spells, 8 races, 8 classes and many different weapons, armor, potions and special items. • In-context game music, a \"surface\" world map, along with joystick support (32K version). • The double-sided disk includes the complete Realms of Quest Trilogy along with several other games by the author: Dunjon II, Ringside Boxing, Break-Fast, Napoleon Simulator, plus many more. 20 games in all! • A detailed and illustrated 36 page instruction manual with several tables and charts for easy reference. * - Realms of Quest III requires 32K memory expansion. Realms of Quest III: Dunjon Crawler requires 16K. The rest of the games in this package (including Realms of Quest I + II) can be run on the unexpanded VIC-20.", "platform": "Commodore VIC-20", "release_date": "2009", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Ghislain de Blois", "publishers": "Psytronik Software", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.43", "wikipedia": "", "video_link": "https://youtu.be/1DMBlCaDlD8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125273-realms-of-quest\n"}