{"altername_name": [], "name": "Serpentine", "overview": "In Serpentine you control a multi-segmented snake in a maze; your goal is to survive and earn as many points as possible. At the beginning of each level, three enemy snakes will also enter the maze. To complete the level, you need to eat all of the enemy snakes. If an enemy snake has more segments than your snake, you can only eat segments that form the tail of the snake; a collision with the head is lethal! Each time you eat a segment, the enemy snake will become smaller until eventually you can devour it completely. For enemy snakes that have fewer segments than you, you can eat the tail segments or the head segment. From time to time, a frog will appear in the maze; eating this will cause your snake to grow. Both your snake and enemy snakes will leave eggs behind occasionally; left alone, these will hatch (your eggs earn you an extra life, enemy eggs will hatch another snake). Eggs can also be eaten to remove them from the playfield, so it's usually a good idea to eat enemy eggs before a new snake hatches! The maze changes for each level, and the enemy snakes progressively become larger and tougher to catch. Unlike the other releases of this game, which were developed by Broderbund (who were also the publisher of the other versions), the VIC-20 version was ported by Antirom Software and published by Creative Software). The VIC version was also the second to be released, just after the original Apple II version. The rest of the conversions were released in 1983.", "platform": "Commodore VIC-20", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Antirom Software", "publishers": "Creative Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Serpentine_(video_game)", "video_link": "https://www.youtube.com/watch?v=liJvLNdugYM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156705-serpentine\n"}