{"altername_name": [], "name": "SkyHawk", "overview": "Reach for The Sky Bandits at ten o' clock. With a glance at your radar you push forward on the joystick and your jump jet leaps up. Hard left and the townscape rushes beneath you as you race to engage the marauders, lining up the targets on radar. The enemy bombers flash into view. This is Skyhawk from Quicksilva, and you are in the hot seat. Objectives You must defend the town from the attacking fighter bombers, amassing points for kills. You start with three lives, with a fourth as a bonus for reaching 3,000 points. Believe me, you'll have earned it. The enemy starts in formations of two, rising to three at 400 points, and four at 1,500. Just to make things interesting, you have to refuel and rearm periodically, presenting yourself as a sitting target for what seems an eternity. First Impressions The cassette artwork is up to Quicksilva's usual high standards, with a double-fold cassette inlay containing LOADing instructions and a (perhaps excessive) story outline. Playing instructions come on a printed sheet. One side of the tape contains the 6.5K version of the game, while the other plays on the 8K expanded Vic. The game loads in two stages. Press the fire button and it's straight into the action. In Play The graphics in Skyhawk are superb - an excellent example of the use of multicolour mode graphics and manipulation of the Video Interface Chip to give full screen action. The game is set above a town represented in effective 3D, and features excellent scrolling to left and right. Everything moves quickly and smoothly, with up to five jets, bombs, missiles and blazing wreckage zipping about simultaneously. The sound effects are good. The scoring system has been well thought out to encourage aggressive play. You begin with 900 fuel units and 100 rounds of ammunition which must be replenished by landing on a service pad, of which there are five. However, the enemy are out to bomb these so you may have a problem finding one.", "platform": "Commodore VIC-20", "release_date": "May 13, 1983", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Quicksilva", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369474-skyhawk\n"}