{"altername_name": [], "name": "Space Escort", "overview": "In Space Escort you are from a doomed planet and your job as a space fighter pilot is to escort the 26 space liners carrying the people of your planet to the newly conquered world of Sistoria. Each space liner has seven shields, plus any shields left over from the safe passage of the previous liner. The color of the space liner will show the number of shields remaining: white equal no shields, purple equals one shield remaining, green equals two shields, blue equals three shields and red equals four or more shields remaining. A shield is lost any time a large object collides with a space liner (bullets do not affect the space liners). You start with nine fighters, and are awarded four extra fighters each time you successfully escort a space liner to the newly conquered world, but are limited to a total of nine fighters at any one time. You will face four main waves of attack, and for a limited time during each of the attack wave the enemy fighters will receive full reinforcements if you destroy all the ships of that attack wave. Any laser bolts still on screen when you wipe out an attacking wave will turn into space mines, but the mines will only remain for a limited time. Points are awarded as follows: 40 points for destroying each of the Space Files. 50 points for destroying each of the Spheroids. 60 points for destroying each of the Xethus Spirals. 70 points for destroying each of the Giga Kamikaz. 90 points for destroying each of the Laser Kamikaz. 500 points for destroying each Asteroid. 1000 points for destroying each of the Mother Ships. 8000 points for successfully escorting each Space Liner to the newly conquered planet.", "platform": "Commodore VIC-20", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Darren Hall", "publishers": "Atlantis Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=1Yi47CKYp8o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127191-space-escort\n"}