{"altername_name": [], "name": "Submarine Commander", "overview": "Thorn EMI present here perhaps one of the most complex games produced for the VIC-20. You'll need a 16K RAM expansion to play this one but it really is worth it. The game puts you in charge of a submarine stocked up with torpedoes and let loose in the Mediterranean to sink various convoys of ships. The convoys typically comprise a selection of three types of ships. The tanker, the destroyer and the patrol boat with tankers providing you with the most points once sunk. This game is nearly on a par with Elite in terms of the number of controls you have at your disposal, the displays you have and the realtime nature of life in the unknown depths. For instance, if you're damaged by depth charges you may want to take refuge in unpatrolled waters for a while to let your repairs commence. You will literally have to sit around for a while for repairs to happen (as per your energy cells recharging in Elite). Naturally, your repairs are taken care of much quicker on the surface of the water but you are much more visible to the convoys this way so you have to weigh up the merits of the actions at your command. To add to your worries there are various components of your submarine that can be damaged by the ships. Your engines, hull, instruments or controls can be damaged (indicators shown in the right-hand side of the screen). For instance, you could be damaged so badly that you can't move at all and are stuck at the bottom of the ocean. In cases like this you are able to blow your ballast tanks by pressing 'B' and surface quickly. This is also useful if you are running out of air. Your main viewpoint will be your map which is brought up onto the screen with the 'M' key. Here you can clearly see the land to avoid and the convoys moving around in the sea which are represented by black dots. You are represented on the map by the flashing dot. But there is much more to engage you here than simply a map. You also have at your disposal a sonar screen brought up by pressing the 'S' key where you can move until ships are above your cross-hairs and then surface to take them out. There is a hydrophone graph where ships appear as peaks in the graph and again you can line directly up with a ship on this display to take it out. Finally of course you have your 'real life' perspective of the periscope view brought up by pressing the 'P' key. Along with these displays you are given a compass with which to guide your submarine and an array of controls and instruments with which to help plan your attacks. You may set your engine speed using the keys '1' to '9' however at greater depths your engines are less capable of achieving high speeds making the effect of the number keys variable depending how close to the surface you are. Naturally on the surface you can travel very fast. Things can suddenly hot up if a convoy approaches near to your location and you will be warned by a bell sound if their proximity is within your range. All of a sudden you'll be frantically hitting keys to slow yourself down while adjusting your attitude and depth, switching to the periscope view, lining up your hydrophone instrument before wasting ships with your torpedoes. It's hard to give the full impression in review form but I urge anyone who enjoys strategic and shoot'em-up games to seek this out. Certainly if you're a VIC-20 fan. There is so much detail in the game considering the hardware involved. Amongst your instruments, for instance, you have a depth-below-keel display which, while you're travelling along, shows in realtime any rocks or seabed formations that lie beneath you and trust me when I say you don't want to make contact with any rock as it'll bring your submarine to a shuddering stop, the screen wobbling all over the place and crunching sounds coming from the VIC's sound chip. Further to this when you have your periscope display up and you're at the right depth to be able to see the surface of the water you will not only see ships scrolling into view at varying distances if any are around but also clouds moving past. There has been a lot of thought put into this game that's for certain. The sounds are well catered for. The sonar screen makes a very realistic beeping sound. Torpedoes fire off with a whoosh. Depth charges sound like they're tumbling through the depths to get you. With a variety of skill levels to play this on the longevity is increased tenfold and you will be coming back to this game again and again. What other VIC-20 game has such engaging realism?", "platform": "Commodore VIC-20", "release_date": "1983", "game_type": "Released", "esrb": "", "developers": "Gary York", "publishers": "Thorn EMI Computer Software", "genres": "Vehicle Simulation", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369482-submarine-commander\n"}