{"altername_name": [], "name": "Xeno II", "overview": "Xeno II is a game that consists of four different single screen games with three being shooters and you have to complete each screen to move to the next with three lives. The first game has you sat at the top of the screen in a spacecraft viewed from the side and you have to land on a pad at the bottom of the screen while contending with gravity and rocks. You can move your craft left or right, and stop for a couple of seconds but when you stop this uses energy. As you fall you will speed up and if you hit the pad too fast then you lose a life. Moving across the screen are rocks and these have to be avoided or you will also lose a life. The second screen is viewed from above and sees you control another craft and you must move around the screen avoiding and shooting aliens and if you touch an alien then you lose a life. The third screen is based on the arcade game Space Invaders where you control a craft on the bottom of the screen viewed from the side, moving left or right, and you have to destroy all the aliens moving across the screen in formation and each time they hit the side of the screen they move one place down. Between you and the aliens are shields which protect you from their bombs but when hit decrease in size. If you are hit by an alien's bomb or allow them to land then you lose a life. A Mothership moves across the screen at the top and if hit gives you bonus points. The final screen is viewed from the side and you once again control a craft at the bottom of the screen, moving left or right trying to destroy a big alien at the top of the screen. Between you and the alien are various waves of aliens and you must destroy a barrier before trying to hit the big alien. Bombs fall from the top of the screen and if you are hit by a bomb or an alien then you lose a life.", "platform": "Commodore VIC-20", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Jeff Gamon", "publishers": "Anirog Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.1", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=vpb5gfD7AA8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114152-xeno-ii\n"}