{
  "name": "Advanced Destroyer Simulator",
  "shortName": "advanced-destroyer-simulator",
  "description": "<i>Advanced Destroyer Simulator</i> (<i>ADS</i>) is a naval combat simulation set in World War 2. It was the first naval simulation to use real-time filled 3D graphics. Its style and mechanics are reminiscent of Epyx's <a href=\"https://www.mobygames.com/game/apple2/destroyer\">Destroyer</a> (1986).<br><br><i>ADS</i> simulates the H.M.S. Onslaught, a British destroyer of the O-class fitted with three cannon turrets, four torpedo tubes on port and starboard respectively, and a sonar to detect and track submarines. In <i>ADS</i>, the Onslaught is not part of a flotilla.<br><br>There's no campaign, gameplay is mission-based and set in three scenarios (two in the CPC version) with five mission each: The Mediterranean around Sicily, the English Channel between UK and France, and the North Sea coast of Norway. Objectives include seek-and-destroy assignments, patrols, convoy escorts, submarine hunts and blockade runs. Each scenario also offers an open “Delta” option where you cruise and hunt without specific objectives.<br><br>You navigate the destroyer manually, in real-time and from a first person perspective, though with the help of a scenario map. <i>ADS</i> simulates ship combat as a close-quarter exchange of torpedoes and cannon fire. In proximity to enemy land bases, Stuka fighters can attack and must be shot down with the cannons. Submarines are tracked with the sonar and can only be attacked once they surface. Enemy vessels include freighters, tankers, torpedo boats, destroyers and cruisers. Most missions are time critical; in the course of the mission, it may be necessary to dock in allied ports for repairs, to refuel and restock on ammunition.",
  "publishedBy": "Futura",
  "developedBy": "Futura",
  "released": "1990",
  "alsoFor": "Amiga, Atari ST, DOS | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/advanced-destroyer-simulator",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Futura",
          "developer": "Futura",
          "ported": "",
          "country": " France, United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/196460-advanced-destroyer-simulator-amstrad-cpc-screenshot-title.png",
      "caption": "Title screen."
    }
  ],
  "cover": []
}