{
  "name": "Alien",
  "shortName": "alien_____",
  "description": "&quot;In space no-one can hear you scream.&quot;\nThat tagline from the movie is apt for this strategy adaptation that follows the plotline of the first movie in the franchise. The action starts after the chestburster scene which unleashes an alien organism into their enclosed spaceship.  The remaining crew members must attempt to destroy it while the traitorous android tries to protect the alien.  <br><br>There are 3 decks to search with 35 different rooms which are connected by ducts which the alien can use to sneak up on people.  You can herd the alien into an airlock to blast it out into space, or set the auto-destruct on the ship and flee in the shuttle with all remaining live crew members plus Jones the cat who must be found and put in a box.<br><br>The screen shows you a plan of the deck you are on, and the ducts in the immediate area.  There are ‘trackers’ and sensors which can be used to pinpoint movement in other areas.  In ordering each crew member, you are given possible movements or other actions such as picking up weapons, entering the ducts or catching the cat. In certain situations, special options will appear such as starting the self-destruct system when in the command centre. The responses to orders are also affected by the personality of the crew member, and how much they have had to suffer. <br><br>The screen also displays reports on the condition of the crew member you’ve selected, whether there is any damage to the room you’re in and whether the duct grills are open (meaning the Alien has been through there). You also get the occasional message from the ship's computer ‘Mother’ like when a crew member dies.  Sound effects create suspense. At times you hear the alien move around or doors and grills being opened as well as the blip from the tracker.",
  "publishedBy": "Amsoft",
  "developedBy": "Concept Software Ltd.",
  "released": "Aug, 1985",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/alien_____",
  "visual": "",
  "gamePlay": "Real-time strategy",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Amsoft",
          "developer": "Concept Software Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Aug, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/379909-alien-amstrad-cpc-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/379910-alien-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/379911-alien-amstrad-cpc-screenshot-main-menu-and-the-crew.png",
      "caption": "Main menu and the crew."
    },
    {
      "link": "/images/shots/l/379912-alien-amstrad-cpc-screenshot-you-start-on-the-middle-deck.png",
      "caption": "You start on the middle deck."
    },
    {
      "link": "/images/shots/l/379913-alien-amstrad-cpc-screenshot-the-map-of-the-upper-deck.png",
      "caption": "The map of the upper deck."
    },
    {
      "link": "/images/shots/l/379914-alien-amstrad-cpc-screenshot-looking-at-ripley.png",
      "caption": "Looking at Ripley."
    },
    {
      "link": "/images/shots/l/379915-alien-amstrad-cpc-screenshot-setting-the-destruct-sequence.png",
      "caption": "Setting the destruct sequence."
    }
  ],
  "cover": []
}