{
  "name": "The Ancient Art of War",
  "shortName": "ancient-art-of-war",
  "description": "<i>The Ancient Art of War</i> is a real-time strategy game based on the very basic elements of war: unit types, formation, and strength. The game is set in ancient battle-style times before the use of gun powder, consisting of the three basic unit types of that period: the light armored but fast 'barbarians', the heavily armored but slow 'knights', and the ranged 'archers'. A fourth non-combatant unit type is also available: 'spies', which is only available under certain campaign rule settings.  <br><br>The game consists of different scenarios to choose from, each with a different geographical setting, difficulty setting, visibility setting, and victory condition setting. Some settings may be subject to change by the player.<br><br>Gameplay is represented in two major areas:\n<ul><li>The first is the tactical/political map, which visualizes geographical and terrain elements from a top-down perspective. Here the player can coordinate, position, reinforce troops, and also command them to attack, defend or ambush enemy troops in a real-time setting. Time may be set to pause, faster or slower to make battle plans easier.<br><br><li>The second is the combat screen where one group of soldiers fight another group of the enemy. A squad consisting a maximum of 14 soldiers will fight according to their set battle formation and will act only on the player's real-time battle commands (e.g. attack, forward, retreat, etc.).</ul>\nThe difficulty levels are represented by eight opponents, which include the Greek goddess of war Athena, a stereotypical Russian-Soviet commander named Crazy Ivan, as well as the historical characters Alexander the Great, Julius Caesar, Genghis Khan, Napoleon, Geronimo, and <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,18956/\">Sun Tzu</a> as the hardest opponent. Each opponent has a different fighting style of combat and strategy.<br><br>The game also comes with a construction set which allows the player to create own campaigns: From the story, rules to the map editor. In this game editor, the player can also tweak troops to the player's liking, such as default troop formations.",
  "publishedBy": "Br&oslash;derbund Software, Inc.",
  "developedBy": "Evryware",
  "released": "1990",
  "alsoFor": "Amiga, Apple II, Atari ST, DOS, Macintosh, PC-88, PC-98 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/ancient-art-of-war",
  "visual": "",
  "gamePlay": "Real-time strategy, Wargame",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Br&oslash;derbund Software, Inc.",
          "developer": "Evryware",
          "ported": "Micro&iuml;ds",
          "country": " France",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/502245-the-ancient-art-of-war-amstrad-cpc-screenshot-french-version.png",
      "caption": "French version title screen"
    },
    {
      "link": "/images/shots/l/502246-the-ancient-art-of-war-amstrad-cpc-screenshot-choose-your.png",
      "caption": "Choose your character?"
    },
    {
      "link": "/images/shots/l/502247-the-ancient-art-of-war-amstrad-cpc-screenshot-let-s-fight.png",
      "caption": "Let's Fight !"
    },
    {
      "link": "/images/shots/l/502248-the-ancient-art-of-war-amstrad-cpc-screenshot-the-cpc-version.png",
      "caption": "The CPC version looks like the PC Dos CGA version."
    }
  ],
  "cover": []
}