{
  "name": "BeTiled!",
  "shortName": "betiled",
  "description": "<i>BeTiled!</i> is a puzzle game inspired by <a href=\"https://www.mobygames.com/search/quick?game=Bejeweled\">Bejeweled</a>. The game also has a sci-fi story introducing the title. A mad scientist called Dr. Cirilus has discovered a way of extracting energy from the essential crystals of videogames. Players have to help him joining the crystals before time runs out or a devastating blast will occur.<br><br>The game is played on a single screen containing an 8x8 field filled with crystals of seven different colours. The player moves a marker across the field and can swap the position of two crystals horizontally or vertically. If a swap creates a horizontal or vertical line of three or more crystals of an identical colour, a match is created, points are scored and the crystals disappear. New crystals drop from the top filling the gaps. Chain combos are also possible.<br><br>The game consists of multiple levels played in succession. To move on to a new level a set number of crystals for each of the seven colours needs to be obtained. Every five levels the graphics of the crystals change and different types of power-ups are introduced as well. There is a time limit counting down from 80 and with each match some additional time is provided.",
  "publishedBy": "Computer Emuzone Silver Games Studio",
  "developedBy": "Computer Emuzone Games Studio",
  "released": "2009",
  "alsoFor": "MSX, ZX Spectrum | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/betiled",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Computer Emuzone Silver Games Studio",
          "developer": "Computer Emuzone Games Studio",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2009",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}