{
  "name": "Brainstorm",
  "shortName": "brainstorm_",
  "description": "<i>Brainstorm</i> is a game where the aim is to get a high enough score on a screen that beats the score you received on the last screen you played when a timer reaches zero. The screen consists of a large square shown on the whole screen full of different coloured shapes with a ball bouncing around. You have to draw lines to bounce the ball into any red shapes while avoiding magenta ones which increases or decreases your score when the ball is inside the shape. Green shapes make the ball appear elsewhere on the screen and blue and black ones don't have any effect.<br><br>Beside the main playing area there is a box with your score, last score, the timer and three coloured lines. The line colours are cyan, yellow and white and you select one to start drawing your lines. Press the fire button on the playing area and a line will appear from a small line matching the colour and draw itself to where you pressed the fire button. The ball will bounce off the line you have just drawn hopefully hitting red shapes. You can also make a line change direction but the line can only be a certain length before the start of the line disappears. <br><br>Once the timer reaches zero and you beat the last screens score you move to the next screen but it is game over if the score is less. There are three skill levels to choose from which allows you to draw more than one line on screen and even have two balls to contend with. You are also able to choose to start from every 6th screen out of 26 screens. The joystick or keyboard can be selected.",
  "publishedBy": "Firebird Software",
  "developedBy": "",
  "released": "1988",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/brainstorm_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/723401-brainstorm-amstrad-cpc-screenshot-loading-screen.png",
      "caption": "Loading Screen"
    },
    {
      "link": "/images/shots/l/723402-brainstorm-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/723403-brainstorm-amstrad-cpc-screenshot-options.png",
      "caption": "Options"
    },
    {
      "link": "/images/shots/l/723404-brainstorm-amstrad-cpc-screenshot-lets-get-the-points.png",
      "caption": "Lets get the points"
    },
    {
      "link": "/images/shots/l/723405-brainstorm-amstrad-cpc-screenshot-drawing-a-line.png",
      "caption": "Drawing a line"
    },
    {
      "link": "/images/shots/l/723406-brainstorm-amstrad-cpc-screenshot-next-level.png",
      "caption": "Next level"
    }
  ],
  "cover": []
}