{
  "name": "Captain Blood",
  "shortName": "captain-blood",
  "description": "Bob Morlock is a game designer who has just developed a new sci-fi video game set in outer space and alien worlds. While testing the product Morlock inexplicably finds himself in the spaceship within the game. A hyperspace accident clones him thirty times. Each of the clones departs, taking with him a portion of a vital fluid that sustains Morlock's life. Assuming the persona of the brave Captain Blood, the programmer tracked down and disintegrated twenty-five clones, spending 800 years to achieve that goal. However, five clones still remain, hidden somewhere in the depths of the galaxy. Captain Blood must find these clones and destroy them before he loses his own life.<br><br><i>Captain Blood</i> is an open-ended first-person adventure game. Much of the game consists of traveling to various planets and communicating with the aliens there to gather clues concerning the clones' whereabouts. The player commands a biological ship called Ark, and must launch probes onto planet surfaces, successfully navigating them through the landscape to locate an alien. The Ark can also scan planets and sometimes teleport aliens to different locations.<br><br>Conversations with the aliens are conducted via the so-called UPCOM interface. Over 150 icons are available to represent different concepts. Since each alien speaks their own language, the player must input various combinations of the icons to be able to understand the alien and communicate with them. Successfully concluding conversations may offer clues or unlock other planets. The protagonist's health deteriorates over the time, which affects the game's interface by making it more difficult to control. These symptoms may be reverted by disintegrating a clone.",
  "publishedBy": "Exxos",
  "developedBy": "ERE Informatique",
  "released": "1988",
  "alsoFor": "Amiga, Apple IIgs, Atari ST, Commodore 64, DOS, Macintosh, Thomson MO, Thomson TO, ZX Spectrum | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/captain-blood",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Exxos",
          "developer": "ERE Informatique",
          "ported": "",
          "country": " France",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/360098-captain-blood-amstrad-cpc-screenshot-the-main-control-panel.gif",
      "caption": "The main control panel of the Ark"
    },
    {
      "link": "/images/shots/l/360099-captain-blood-amstrad-cpc-screenshot-yoko-the-friendly-izwal.gif",
      "caption": "Yoko, the friendly Izwal"
    }
  ],
  "cover": []
}