{
  "name": "Carrier Command",
  "shortName": "carrier-command",
  "description": "Carrier Command was one of the first real-time strategy games.<br><br>You control an advanced cybernetic aircraft carrier complete with fighters, amphibious assault vehicles, laser defenses and a fleet of decoy drones.  Your mission is to build a series of resource, factory, and defensive bases spanning an island chain.  The only problem?  At the other end of the chain is an even more advanced carrier under control of a terrorist organization with the same mission.<br><br>As you move around the islands you must decide what facilities to build and where they will best support your advance.  Resource islands provide materials that factory islands can use to build weapons and vehicles to replace your combat losses but both will be quickly overrun if the enemy attacks them while you are not present.  You also have to ensure that your stockpiles of equipment are stored safely until you can find time to launch a resupply drone to bring them to your carrier.<br><br>From your carrier, you can take first person control of your attack aircraft and amphibious tanks and use them to assault enemy islands or even the enemy carrier itself if you're lucky enough to find it.  The weapon payloads on your vehicles are completely configurable based on your needs.  An island invasion may require launching a virus bomb that will take over the enemy command systems or just blasting the base with a wire guided surface to surface missile.<br><br>Ultimately, you have to find and destroy the enemy carrier but, doing so will require a solid supply infrastructure and a strategy for depriving your opponent of his. ",
  "publishedBy": "Rainbird Software",
  "developedBy": "Realtime Games Software Ltd.",
  "released": "1989",
  "alsoFor": "Amiga, Atari ST, Commodore 64, DOS, Macintosh, ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/carrier-command",
  "visual": "",
  "gamePlay": "Real-time strategy",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Rainbird Software",
          "developer": "Realtime Games Software Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/456541-carrier-command-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen\n"
    },
    {
      "link": "/images/shots/l/456542-carrier-command-amstrad-cpc-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/456543-carrier-command-amstrad-cpc-screenshot-the-game-begins.png",
      "caption": "The game begins"
    },
    {
      "link": "/images/shots/l/456544-carrier-command-amstrad-cpc-screenshot-selecting-destination.png",
      "caption": "Selecting destination"
    },
    {
      "link": "/images/shots/l/456545-carrier-command-amstrad-cpc-screenshot-information.png",
      "caption": "Information"
    },
    {
      "link": "/images/shots/l/456546-carrier-command-amstrad-cpc-screenshot-weapons.png",
      "caption": "Weapons"
    }
  ],
  "cover": []
}