{
  "name": "Cheril in the Bosque en otro Bosque",
  "shortName": "cheril-in-the-bosque-en-otro-bosque",
  "description": "<i>Cheril in the Bosque en otro Bosque</i> is a game in Spanish and the follow-up to the 2010 <a href=\"https://www.mobygames.com/game/cheril-of-the-bosque\">Cheril of the Bosque</a> for the same platforms. After the events of the previous game Cheril thought she would reach the big city after crossing the edge of the forest. But it turns out there is just another forest and she already ate all her food. She is tasked by a character called Johnny Límite to talk to various characters in the new forest in a specific order. These are all characters from other Mojon Twins games such as Lala (<a href=\"https://www.mobygames.com/game/lala-the-magical\">Lala the Magical</a>), Ninjajar (<a href=\"https://www.mobygames.com/game/ninjajar\">Ninjajar!</a>), Ramiro (<a href=\"https://www.mobygames.com/game/ramiro-el-vampiro\">Ramiro el Vampiro</a>) and Yun (<a href=\"https://www.mobygames.com/game/yun\">Yun</a>).<br><br>The gameplay is largely identical. Cheril needs to be guided through a level that consists of several single-screen rooms connected both horizontally and vertically using the flip-screen mechanic offering an mount of freedom to explore. She has no means of attack, so she has to avoid enemies and hazards. She needs to collect objects and find a way to reach the characters in the correct order. This often involves a lot of exploration and puzzle elements with key that open barriers and the ability to create passages by pushing blocks. When leaving the screen and returning the original position of the boxes is restored, so it is not possible to become stuck. Instead of the large energy meter that is drained when in contact with enemies or hazards, a lives system is used.",
  "publishedBy": "Mojon Twins, The",
  "developedBy": "Mojon Twins, The",
  "released": "Mar 17, 2020",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/cheril-in-the-bosque-en-otro-bosque",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Mojon Twins, The",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Mar 17, 2020",
          "ean13": "",
          "comments": "The Mojon Twins download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/653719-cheril-in-the-bosque-en-otro-bosque-amstrad-cpc-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC and ZX Spectrum"
    }
  ]
}