{
  "name": "Contamination",
  "shortName": "contamination",
  "description": "<i>Contamination</i> is a world health simulation game, where the earth is invaded by unknown viruses from outer space.<br><br>The player takes on the role of the World Health Center tasked with identifying the virus, creating an antidote and taking other measures to stop the virus from spreading. At the same time the player must not wear down morale of the world population, or risk a up-rising by the local population. When the population is out of control, it becomes impossible to order measures like a sanitary belt.<br><br>The player must first take a sample of an infected region, then create an anti-virus by grabbing all the virus parts in a certain order. Next is the experimentation phase, to determine the probable effect of treatment but also the secondary observed effects. An antidote can have side effects such as dehydration, liquidation of the eyes, cancer of the lungs etc. When you treat the population with a highly toxic anti-virus with severe side effects the population reacts negatively.<br><br>Other measures include a stop icon to put a sanitary belt in place, a fire icon to perform a terre brulee or scorched earth. The ultimate measure is to simply drop a nuclear explosion on a region, which results in an instant game over.",
  "publishedBy": "ERE Informatique",
  "developedBy": "Personal Software Services",
  "released": "Apr, 1986",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/contamination",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Life / social simulation",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "ERE Informatique",
          "developer": "Personal Software Services",
          "ported": "",
          "country": " France, United Kingdom",
          "releaseDate": "Apr, 1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}