{
  "name": "Doctor Who and the Mines of Terror",
  "shortName": "doctor-who-and-the-mines-of-terror",
  "description": "This side-scrolling platformer features the sixth Doctor (who was played by Colin Baker) from the long running sci-fi British television series.  The Time Lords have become aware of an evil force called The Master on the second moon of the planet Rijar taking over a mining base of the heatonite mineral to build a TIRU (Time Instant Reply Unit).  A memory capsule on how to build a TIRU must be recovered and The Doctor must succeed as The Master plans to modify it by using The Doctor's brain to control both the past and future.  The Doctor can jump, climb ladders, push buttons, and throw or use items.<br><br>He is accompanied by a robotic female cat named Splinx (who may remind you of the more famous K9 robot dog).  The Doctor can only carry four items in his pockets, so Splinx is a valuable ally for fetching and carrying additional items.  Even large items can fit in her dimensionally transcendental hyperspace load module.   Splinx can also avoid proximity sensors and other creatures along with any items she carries.  Occasionally, her energizer cells have to be recharged at external power points and the Doctor can place location markers to which she can find her way back to.   Along the way, you will meet local peaceful Rijans who can be asked to perform simple tasks, and Cryostan plants which are used to make super-coolant fluid.  There are also dangerous creatures called Madrags, as well as cyber guards to beware of.",
  "publishedBy": "Micro Power Ltd",
  "developedBy": "",
  "released": "May, 1986",
  "alsoFor": "BBC Micro, Commodore 64 | Combined View",
  "genre": "Adventure",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/doctor-who-and-the-mines-of-terror",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Micro Power Ltd",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "May, 1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/575280-doctor-who-and-the-mines-of-terror-amstrad-cpc-screenshot.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/575281-doctor-who-and-the-mines-of-terror-amstrad-cpc-screenshot.png",
      "caption": "Starting location. Doctor Who and Splinx arrived."
    },
    {
      "link": "/images/shots/l/575282-doctor-who-and-the-mines-of-terror-amstrad-cpc-screenshot.png",
      "caption": "Reaching the guard post"
    },
    {
      "link": "/images/shots/l/575283-doctor-who-and-the-mines-of-terror-amstrad-cpc-screenshot.png",
      "caption": "Character's inventory is active"
    },
    {
      "link": "/images/shots/l/575284-doctor-who-and-the-mines-of-terror-amstrad-cpc-screenshot.png",
      "caption": "Splinx control is active"
    },
    {
      "link": "/images/shots/l/575285-doctor-who-and-the-mines-of-terror-amstrad-cpc-screenshot.png",
      "caption": "Life was lost after falling on spikes"
    }
  ],
  "cover": []
}