{
  "name": "Dragon's Lair Part II: Escape from Singe's Castle",
  "shortName": "dragons-lair-part-ii-escape-from-singes-castle",
  "description": "Following the <a href=\"https://www.mobygames.com/game/colecoadam/dragons-lair_____\">first adaptation</a> of the laserdisc-based arcade classic <i>Dragon's Lair</i>, <a href=\"https://www.mobygames.com/search/quick?company=Software+Projects+Ltd%2e\">Software Projects</a> followed it up with <i>Escape from Singe's Castle</i>, again loosely adapting scenes from the original game for the capabilities of contemporary 8-bit machines.<br><br>After defeating the dragon Singe and rescuing Princess Daphne, Dirk the Daring still yearns for adventure. He ventures into the domain of the Lizard King, where according to legend a large pot of gold awaits bold adventurers. The player controls Dirk through eight distinct scenes:<ul><li>Ye River Caves: Dirk must go down a wild river in his boat, avoiding rocks by steering in the direction indicated by arrows as well as avoiding deadly whirlpools.</li><br>\n<li>Boulder Alley: Channeling Indiana Jones, Dirk must escape a giant boulder rolling towards him, leaping over holes in the ground and avoiding other obstacles in the way.</li><br>\n<li>Throne Room: Deadly magical traps await in the Lizard King's throne room. Dirk can only survive by using the correct sequence of sidesteps and sword slashes.</li><br>\n<li>Dungeons of the Lizard King: Dirk is very close to his goal, but the Lizard King has laid a trap: he stole Dirk's sword, put it near the pot of gold, and now is close on the hero's tail. Dirk must navigate a maze of rooms to find the sword, avoiding the Lizard King who is in hot pursuit. Once found, the sword must be used to strike down the King.</li><br>\n<li>Magical Flying Horse: Riding on a flying horse, Dirk must evade rocks of ice (which sap his strength) and solid walls (which end his journey instantly when hit).</li><br>\n<li>Doom Dungeon: Traps and evil creatures abound in a dungeon room. Again, only the correct sequence of attacks and steps will allow Dirk to survive.</li><br>\n<li>Mystic Mosaic: Dirk must cross a room to get to one of two possible exits (only one of which leads to safety), but there's a catch: the floor consists of a magical mosaic, which constantly changes shape in a repeating pattern. Standing in the wrong place at the wrong time means certain death. A giant bat that inhabits the mosaic room can be vanquished with a sword blow.</li><br>\n<li>Mud Monsters: The key to final escape is a magic bottle, a long way from the place where Dirk starts this scene. He must find a way across a gap in the canyon and jump across a huge mud-spewing geyser, all while avoiding the mud monsters.</li></ul>",
  "publishedBy": "Software Projects Ltd.",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/dragons-lair-part-ii-escape-from-singes-castle",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Software Projects Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Encore",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": "Budget re-release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/547055-dragon-s-lair-part-ii-escape-from-singe-s-castle-amstrad-cpc.png",
      "caption": "Title screen and credits"
    },
    {
      "link": "/images/shots/l/547056-dragon-s-lair-part-ii-escape-from-singe-s-castle-amstrad-cpc.png",
      "caption": "Your adventure awaits..."
    },
    {
      "link": "/images/shots/l/547057-dragon-s-lair-part-ii-escape-from-singe-s-castle-amstrad-cpc.png",
      "caption": "Make your way cross the room, safely."
    },
    {
      "link": "/images/shots/l/547058-dragon-s-lair-part-ii-escape-from-singe-s-castle-amstrad-cpc.png",
      "caption": "Going down!"
    },
    {
      "link": "/images/shots/l/547059-dragon-s-lair-part-ii-escape-from-singe-s-castle-amstrad-cpc.png",
      "caption": "Dirk swinging his sword."
    },
    {
      "link": "/images/shots/l/547060-dragon-s-lair-part-ii-escape-from-singe-s-castle-amstrad-cpc.png",
      "caption": "You lost all your lives. Game over."
    }
  ],
  "cover": []
}