{
  "name": "The Goonies",
  "shortName": "goonies_",
  "description": "<i>The Goonies</i> is based on the Steven Spielberg film of the same name, in which a motley crew of suburban kids in Astoria, Oregon, must save their homes from being foreclosed upon and find their salvation in a treasure map leading to an old pirate ship in a cavern.  However, they must maneuver around an eccentric family of Italian criminals -- the Fratellis -- on the lam, who are also on the trail of the treasure.<br><br>The game is divided into a series of eight screens based on scenes from the film, each of which contains puzzles that must be solved by coordinating the activities of two of the kids from the Goonies (and in the last screen, the elephant-man-like Sloth) without getting killed by deadly bats, homicidal Fratellis, flying demon-skull thingies, or other environmental hazards.  For example, in one screen one player must wind up and hold a winch that lifts a large stone so that the other player can pass it, run backward on a ball floating in deadly water, bypass a series of three water buckets going up and down that kill you if you do not time your passage underneath correctly, jump to the top of a rail, and slide across to grab the key to the door below -- and all this without getting hit by a wandering bat.<br><br>The game keeps a score and a high score, and you have a certain number of lives, which would be replenished at certain points or at certain score totals, and there is no save feature.  In other words, the game had to be played all in one sitting, near-perfectly, to see the ending. <i>The Goonies</i> can be played single-player, with the joystick button used to switch between the two characters on-screen, or cooperatively, with each player controlling one of the characters.",
  "publishedBy": "U.S. Gold Ltd.",
  "developedBy": "Datasoft, Inc.",
  "released": "1986",
  "alsoFor": "Apple II, Atari 8-bit, Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/goonies_",
  "visual": "",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "U.S. Gold Ltd.",
          "developer": "Datasoft, Inc.",
          "ported": "Paragon Programming Ltd",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "5 013442 531907",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/227393-the-goonies-amstrad-cpc-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/227394-the-goonies-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/227395-the-goonies-amstrad-cpc-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/227396-the-goonies-amstrad-cpc-screenshot-level-1-we-need-to-distract.png",
      "caption": "Level 1. We need to distract Mama Fratelli so we can put out the fire in the fireplace and escape."
    },
    {
      "link": "/images/shots/l/227397-the-goonies-amstrad-cpc-screenshot-fire-s-out-now-to-get-below.png",
      "caption": "Fire's out. Now to get below ground."
    },
    {
      "link": "/images/shots/l/227398-the-goonies-amstrad-cpc-screenshot-level-2.png",
      "caption": "Level 2"
    }
  ],
  "cover": []
}