{
  "name": "Gothik",
  "shortName": "gothik",
  "description": "The lands far north of Belorn are \nruled by an evil lord with an iron fist .\nOnly the powers of the druid Hasrinaxx would be able to harm the lord, but missing any support by his people, Hasrinaxx has been imprisoned. To ensure he can never be freed, the lord cast a spell on Hasrinaxx, splitting his body into six parts and hiding them in the four towers of the lord's huge castle, each part guarded by a powerful demon.<br><br>In <i>Gothik</i>, the player takes control of a young warrior whose task is to collect all six body parts and reunite them with the druid's robe in order to finally defeat the evil lord. <br><br>The game itself is inspired heavily by the arcade classic <a href=\"https://www.mobygames.com/game/c64/gauntlet\">Gauntlet</a>. Two different characters are available: Olga can take less damage than Olaf, but her magic powers are greater. Seen from above, the player moves through the castle and must vanquish the lord's minions within the four towers, each consisting of seven levels.<br><br>To defeat the sixteen different types of monster, Olga or Olaf can use arrows (which require ammunition) or magical lightning bolts (which bounce from one enemy to the next) and fireballs (which can destroy barriers and walls in addition to enemies), both requiring magical energy. Health, ammunition and energy can be refilled by picking up food, quivers and magic chalices, respectively.<br><br>Other pick-ups include gold, extra lives, and 32 different types of potions, which may have positive or negative effects. Also available are magic relics, which can make the player invisible, mimic a certain type of monster, as well as temporarily freeze or even kill enemies nearby. All of the relics must be specifically activated, drawing magical energy when in use.",
  "publishedBy": "Firebird Software",
  "developedBy": "",
  "released": "1988",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/gothik",
  "visual": "2D scrolling",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/579199-gothik-amstrad-cpc-screenshot-loading-screen.png",
      "caption": "Loading screen."
    },
    {
      "link": "/images/shots/l/579200-gothik-amstrad-cpc-screenshot-choose-your-warrior.png",
      "caption": "Choose your warrior."
    },
    {
      "link": "/images/shots/l/579201-gothik-amstrad-cpc-screenshot-let-s-go.png",
      "caption": "Let's go."
    },
    {
      "link": "/images/shots/l/579202-gothik-amstrad-cpc-screenshot-kill-the-baddies.png",
      "caption": "Kill the baddies."
    },
    {
      "link": "/images/shots/l/579203-gothik-amstrad-cpc-screenshot-your-status-and-potions.png",
      "caption": "Your status and potions."
    }
  ],
  "cover": []
}