{
  "name": "Greyfell: Legend of Norman",
  "shortName": "greyfell-legend-of-norman",
  "description": "Greyfell, a land of humanoid animals, has fallen into despair: the evil magician Mauron has stolen the Orb of Life and makes life a misery. But now the cat Norman is fed up with it and decides to do something about it. The player takes his role and accompanies Norman on his way to the castle.<br><br><i>Greyfell: Legend of Norman</i> is an isometric action game with puzzle elements. Norman has to wander through various non-scrolling, connected screens to find items he can use at another place to proceed further. A few friendly animals, e.g. a drunken rabbits, give hints how to proceed when encountered.\nUnfortunately a lot of enemies want to kill Norman and he either has to avoid or fight them by using one of three spells or punches. If he is not successful in his efforts to fight enemies effectively, his life energy gets reduced. It can be filled up by collecting flowers in the game world.<br><br>The interface is icon driven: the player has to assign the wanted command to the action button. The game can be saved at any time.",
  "publishedBy": "Ariolasoft UK",
  "developedBy": "Starlight Software",
  "released": "1987",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/greyfell-legend-of-norman",
  "visual": "Isometric",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Ariolasoft UK",
          "developer": "Starlight Software",
          "ported": "",
          "country": " France, Germany, The Netherlands, United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}