{
  "name": "Hacker II: The Doomsday Papers",
  "shortName": "hacker-ii-the-doomsday-papers",
  "description": "<i>Hacker II: The Doomsday Papers</i> is a real-time strategy game.\nIt is the sequel to <a href=\"https://www.mobygames.com/search/quick?game=Hacker\">Hacker</a>.<br><br>Once again you hack into a computer system, just to end up saving the world. <i>Hacker II: The Doomsday Papers</i> opens with the console to the &quot;Actisource&quot; computer hotline system (a nice self-ironic pun - although nobody knows why a serious hacker might want to crack a help service for computer games...). However, your quiet little hack is soon disturbed: The government wants you for a secret mission. It, again,  involves a robot drone and you're the one at the remote control. Although this time, it's not the whole globe that's your playground, but a high security facility in Russia, where the plans for global domination are hidden.<br><br>In fact, all you've got to do is to guide your drone to the vault on a 2D map of the building. However, there are two major obstacles: Patrolling guards and security cameras. To avoid detection, you've got to trick the observers. By tapping the surveillance system you can see what cameras are currently active and which rooms they monitor. Your task is to bypass the video signal of the right cameras with a taped recording of an empty room, so that your drone is hidden from the view. You control four monitors, which you may freely switch to show the security monitor, the radar map, VCR output or one of the 38 cameras -- thus keeping an eye on guard movement while simultaneously controlling your drone and synchronizing recordings to cameras. Whew, sounds like a lot of work? It is.",
  "publishedBy": "Activision, Inc.",
  "developedBy": "Activision, Inc.",
  "released": "1987",
  "alsoFor": "Amiga, Apple II, Apple IIgs, Atari ST, Commodore 64, Macintosh, PC Booter, ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/hacker-ii-the-doomsday-papers",
  "visual": "",
  "gamePlay": "Real-time strategy",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Activision, Inc.",
          "developer": "Activision, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}