{
  "name": "HMS Cobra: Convois pour Mourmansk",
  "shortName": "hms-cobra-convois-pour-mourmansk",
  "description": "<i>HMS Cobra: Convois pour Mourmansk</i>, as its name implies, is about one of the 78 arctic convoys of World War II.<br><br>The date is February 1943. Place is Reykjavik. It's winter, and you will have to sail from Iceland to Murmansk in order to deliver vital supplies to the Soviet Union. Your ship is the HMS Cobra, a Royal Navy destroyer and you will have to escort 20 merchant ships.<br><br>To sum up things, the player will face three problems. The Arctic ocean first. Remember, it's winter and days are short. Next problem, the enemies. German surface forces can fire at you from the occupied Norway, and you will also have to pay attention to German aircraft, surface ships and submarines (U-boats). Last problem can be the difficulty to choose the best route. As with many Cobra Soft releases the box of the game is filled with useful tools. With the manual you will find a book (in French) about Arctic convoys of World War II (1941-1945), a map, a plotter desk (transparent overlay) and a compass.<br><br><i>HMS Cobra: Convois pour Mourmansk</i> also contains a stand-alone program, which is an action game, quite similar to <a href=\"https://www.mobygames.com/game/beach-head\">Beach-Head</a>.",
  "publishedBy": "Cobra Soft",
  "developedBy": "Hitech Productions",
  "released": "1986",
  "alsoFor": "Atari ST, Thomson MO | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/hms-cobra-convois-pour-mourmansk",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Cobra Soft",
          "developer": "Hitech Productions",
          "ported": "",
          "country": " France",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}