{
  "name": "Journey to the Centre of the Earth: Extended Version",
  "shortName": "journey-to-the-centre-of-the-earth-extended-version",
  "description": "<i>Journey to the Centre of the Earth: Extended Version</i> is based on the book <i>Journey to the Centre of the Earth</i> by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,61309/\">Jules Verne</a>. The game was originally released for Amiga, Atari ST and DOS as <i>Viaje al centro de la tierra</i> in 1989. It is listed separately from the <a href=\"https://www.mobygames.com/search/quick?platform=MSX\">8-bit version</a> released in the same year because it consists of five parts where for the 8-bit version two parts were removed due to time constraints. Almost 20 years after the release however new versions for Amstrad CPC (2012), MSX (2017) and ZX Spectrum (2007) were released with support from the original developers to restore the two missing parts for the 8-bit versions. These releases are listed here. In 2018 there was another 2.0 release for the ZX Spectrum celebrating the 10-year reworking of the game with further technical fixes and versions for the languages English, Spanish and Portuguese.<br><br>This version of the game consists of five parts:<ul>\n<li>In the first part you have to solve a jigsaw puzzle with a map from a first-person perspective by putting the parts in the correct order. There is a time limit.</li><br>\n<li>In the second part you can switch between three characters each controlled separately in a platform environment using a side view. Each character carries its own objects and attributes, while they enter the volcano on their way to the centre of the Earth. They have to pass water cascades, geysers and eventually a lake with a monster.</li><br>\n<li>In the third part again played from a side view you have to choose one of the three ways to get to the surface of the Earth. Each route is different and has its own dangers like tigers, carnivorous plants and quicksand.</li><br>\n<li>In the fourth part you control one of the three characters who has to navigate a vertically oriented beach filled with giant turtles to reach a raft. The player has to patiently wait for the turtles to move and open up a passage to then pass them quickly.</li><br>\n<li>In the fifth part the three characters are riding the raft on a rising mass of lava from the centre of the Earth back up to the surface. Shown from a side view and scrolling vertically the player needs to move the raft left or right to prevent it from colliding with the rock walls.</li></ul>",
  "publishedBy": "Topo Siglo XXI",
  "developedBy": "Topo Siglo XXI, Topo Soft",
  "released": "2012",
  "alsoFor": "Amiga, Atari ST, DOS, MSX, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/journey-to-the-centre-of-the-earth-extended-version",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Topo Siglo XXI",
          "developer": "Topo Siglo XXI",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2012",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}