{
  "name": "La crypte des maudits",
  "shortName": "la-crypte-des-maudits",
  "description": "<i>La crypte des maudits</i> (The Cursed Crypt) is a French first-person adventure game and the follow-up to the 1990 CPC title <a href=\"https://www.mobygames.com/search/quick?game=La+secte+noire\">La secte noire</a>. In the first game a dwarf stranger managed to dismantle the demonic organization <i>La secte noire</i> who terrorized Issegeac, a quiet little village in the Périgord Noir in France. In this sequel survivors of the sect have returned and they are now gathered in the castle of Golin the gnome. The terrified villagers go looking for the kind stranger again and they find him in a forest. He returns to the castle to deal with the sect.<br><br>As in the first game it consists of several single-screen rooms. The environment takes up the largest portion of the screen in the top left part, a character is on the right, the text parser where all commands are entered is at the bottom and a compass is in the bottom right. Basic commands are entered for moving around, picking up items and performing actions. Below the parser portion sentences appear to provide descriptions or feedback on the player's actions.<br><br>The game supports saving and loading, but not in the third and final part.",
  "publishedBy": "Lankhor",
  "developedBy": "",
  "released": "1991",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/la-crypte-des-maudits",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Graphic adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Lankhor",
          "developer": "",
          "ported": "",
          "country": " France",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}