{
  "name": "Le Labyrinthe de la Reine des Ombres",
  "shortName": "le-labyrinthe-de-la-reine-des-ombres",
  "description": "<i>Le Labyrinthe de la Reine des Ombres</i> is a French educational game in <i>Le Labyrinthe</i> series intended for children of 6 to 8 years of age who have just learned to read.<br><br>The story is about a little boy who has discovered in his garden a mysterious door - and after opening it by solving its riddle has found himself in a fairy-tale Kingdom of Shadows. The local Queen is quite fond of playing word games with children who visit her castle, but she hates to lose - and as a result she imposes a curse on all the land. Of course, it becomes out task to lift it, by traveling around the world, meeting its inhabitants and helping them with their needs. <br><br>The process consists in solving different puzzles and riddles aimed at checking the French kids' ability to read and understand short line of texts; the answers are given by choosing the correct reply among the several options presented by the game. There are exercises like hidden word search, solving simple cryptograms etc. There are also three mini-games: a maze where we have to find our way from one corner into the opposite one while not running into enemies; a simple memory game for locating pairs of medallions; and a sea arcade where we have to maneuver out little boat in order to evade arrows falling from the above.",
  "publishedBy": "Retz",
  "developedBy": "Nathan Logiciels",
  "released": "1991",
  "alsoFor": "Amiga, Atari ST, DOS | Combined View",
  "genre": "Educational",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/le-labyrinthe-de-la-reine-des-ombres",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Retz",
          "developer": "Nathan Logiciels",
          "ported": "",
          "country": " France",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1054457-le-labyrinthe-de-la-reine-des-ombres-amstrad-cpc-screenshot.png",
      "caption": "The title screen"
    },
    {
      "link": "/images/shots/l/1054458-le-labyrinthe-de-la-reine-des-ombres-amstrad-cpc-screenshot.png",
      "caption": "Discovering the mysterious door"
    },
    {
      "link": "/images/shots/l/1054459-le-labyrinthe-de-la-reine-des-ombres-amstrad-cpc-screenshot.png",
      "caption": "The first riddle"
    }
  ],
  "cover": []
}