{
  "name": "Little Computer People",
  "shortName": "little-computer-people",
  "description": "<i>Little Computer People</i> can be described as the &quot;mother&quot; of <a href=\"https://www.mobygames.com/search/quick?gamegroup=sims\">The Sims</a>. When you load the game for the first time and personalise it with your name you'll see a house with several rooms like a kitchen, living room, bed room, etc. After some time of waiting a little person will appear and check out the house with all its rooms to see if he likes it. If he likes it, he will move in shortly and bring his dog along with him. <br><br>That's where the real &quot;game&quot; starts and that's what it will be like every time you'll load the game from then. You see the house and the little person living in it, doing all kinds of stuff people do in their daily routine. He'll cook, eat, feed his dog, read newspapers, watch TV and from time to time he will write you a letter to let you know what he feels or what things he misses. To keep it more game-like, you can &quot;talk&quot; to him in form of typing commands like &quot;feed dog&quot;. You can also play cards with him and send him food or a present. There is no aim in this game other than to interact with your LCP.",
  "publishedBy": "Activision, Inc.",
  "developedBy": "Activision, Inc.",
  "released": "1987",
  "alsoFor": "Amiga, Apple II, Atari ST, Commodore 64, PC-88, PC-98, ZX Spectrum | Combined View",
  "genre": "Simulation",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/little-computer-people",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Life / social simulation",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Activision, Inc.",
          "developer": "Activision, Inc.",
          "ported": "Dalali Software Ltd.",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}