{
  "name": "Mokowe",
  "shortName": "mokowe",
  "description": "<i>Mokowe</i> is a French first-person adventure game taking place in Kenya's Mokowé settlement in May 1975. The player is a brave adventurer contacted by professor Wilson part of a group to protect elephants. Mokowé's local police contacted the professor about a network of poachers killing elephants systematically. The main character jumps on a plane to assist with the operation right away.<br><br>The game uses mechanics similar to the author's previous title <a href=\"https://www.mobygames.com/search/quick?game=La+secte+noire\">La secte noire</a>. The game consists of several single-screen locations with exploration, picking up and using objects to solve puzzle and conversations with characters. The environment takes up the largest portion of the screen in the centre with a permanent background behind it. The top left corner shows possible movement options based on compass points. The top also holds boxes for the current date and time. The text parser where all commands are entered is at the bottom. Basic commands are entered for moving around, picking up items and performing actions. A separate key is used to display the inventory. Below the parser portion sentences appear to provide descriptions or feedback on the player's actions.<br><br>A distinctive game element is the role of the time of day. Certain actions can be only be performed during the day or at night. One of the possible actions is &quot;attendre&quot; (wait) to make time pass. The game can be saved on a separate disk.",
  "publishedBy": "Lankhor",
  "developedBy": "",
  "released": "1990",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/mokowe",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Graphic adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Lankhor",
          "developer": "",
          "ported": "",
          "country": " France",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}