{
  "name": "Phantomas 2.0",
  "shortName": "phantomas-20",
  "description": "<i>Phantomas 2.0</i> is an unofficial remake of the 1986 game <a href=\"https://www.mobygames.com/game/vampire\">Vampire</a>, which was the sequel to the 1986 ZX Spectrum game released in the same year: <a href=\"https://www.mobygames.com/game/phantomas\">Phantomas</a>. Unlike the UK version of the 1986 game which introduced the character Brok the Brave, the remake stars the original protagonist from the Spanish version: Phantomas. He is an android thief and was captured during his last mission on the Earth-Gamma planet in the first game where he stole treasure from a millionaire's mansion. This time he has a mission on Earth as he ventures into the castle of Count Dracula to defeat him and bring back order and peace to the region. This remake closely mirrors the original game with the original challenges, design, enemies and level lay-out. The largest changes are in the entirely new visual design and art, tweaked elements, new music and improved responsiveness.<br><br>The player controls Phantomas through different rooms of the castle. Those are all single screens linked together both horizontally and vertically offering an amount of freedom to explore freely. Phantomas has no means to attack and he needs to complete platforming sections avoiding enemies, traps and hazards. He starts with one life and can earn additional ones by picking up pieces of chicken. Several sections are locked and first require a key. To confront Count Dracula himself three weapons need to be gathered first: a cross, a hammer and a stake. There are also six shutters that need to be opened so the sunlight is brought in to weaken Dracula. The castle consists of different environment with regular rooms, a roof section and catacombs. Several additional items and gameplay mechanics are revealed while playing.",
  "publishedBy": "Pakete Soft",
  "developedBy": "Pakete Soft",
  "released": "Jan 31, 2019",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/phantomas-20",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Pakete Soft",
          "developer": "Pakete Soft",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 31, 2019",
          "ean13": "",
          "comments": "cassette version (mail order release)"
        },
        {
          "publisher": "Pakete Soft",
          "developer": "Pakete Soft",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 31, 2019",
          "ean13": "",
          "comments": "cassette version (mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/583200-phantomas-2-0-amstrad-cpc-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC"
    }
  ]
}