{
  "name": "Pouvoir",
  "shortName": "pouvoir",
  "description": "Last day of the election campaign in a climate of extreme political tension. The police apparatus in charge of the protection of the deputy is particularly reinforced. At the same time, four groups of protesters are heading towards the main square of the city ... <br><br>Choose your side ... for the urban guerilla !!!<br><br>A daring political game about turbulent events of France's 1986 elections. Pouvoir is an urban guerilla sim between police backing CRS on one side and protesters in red shirts on the other!<br><br>If you play with a friend, one of you controls the CRS, and the other the protesters. In case of solitary pleasure (but without a stick of joy, all done on the keyboard), you play the police. Your goal will be to protect the Town Hall Square until 9 pm, because the speech of a Member must take place there. The game starts at 3 pm, and each round lasts 15 minutes in game time. A complete game is likely to spread over 24 rounds. And during all this time, dozens of protesters will lead you hard while trying to infiltrate the streets of Paris. Yes, Pouvoir is actually a turn-based strategy game, punctuated by mini-games when the two opposing groups face each other.<br><br>The CRS appear in blue on the map, and the demonstrators in red (it's a finesse, ah ah ah!). When one of the small characters (a relatively ugly sprite) is white, it means you control it during the turn. There are then several phases of play during which it will be possible for the CRS, to move, to pose barriers in strategic places (six maximum), to hold his place (do not move) or unlike launch Offensive - for this, your CRS sprite must be on a square adjacent to a box with a protester. A small action sequence then launches at the bottom of the screen, and you must run to apprehend the protester while avoiding his projectiles - tomatoes, cobblestones or Molotov cocktails.<br><br>When the AI (or a friend who plays with you) takes control of the demonstrators, they are likely to move (and they will, with the place of the town hall in sight) and of course, they will not back down not facing adversity. If a street is blocked by a barrier, during an arcade phase the protester will have to run and jump over it with the right timing - otherwise ,he takes damage, and if he takes too much, he disappears (dies). he really?!). He can also decide to load the CRS, the latter can throw him a baton horizontally - it looks like a laser, but let's move on. It will be time again quthe estion of timing: running and jumping over the baton to fight with the CRS hand-to-hand - in this case, the victory automatically returns to the protester (we did not say breaker yet) , at the time?).<br><br>In short, the CRS will have to hold until 21 hours or to make disappear all the demonstrators by then - unlikely, as they are numerous. The latter win the game if they reach the place of the town hall before the fateful hour or if they eliminate all the CRS. ",
  "publishedBy": "Loriciels",
  "developedBy": "Loriciels",
  "released": "1986",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/pouvoir",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Loriciels",
          "developer": "Loriciels",
          "ported": "",
          "country": " France, Spain",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}