{
  "name": "Prince of Persia",
  "shortName": "prince-of-persia",
  "description": "While the Sultan of Persia is fighting a war in a foreign country, his Grand Vizier Jaffar orchestrates a coup d'état. His way to the throne lies through the Sultan's lovely daughter. Jaffar kidnaps her and threatens to kill her if she refuses to marry him. Meanwhile, the man the Princess loves is thrown into the dungeon. He has only one hour to escape from his prison, defeat the guards on his way, and stop Jaffar before the terrible marriage takes place.<br><br><i>Prince of Persia</i> is a 2D platformer that is commonly regarded as a progenitor of the cinematic platformer genre. Rather than following the more common jump-and-run mechanics, it focuses on careful advancement through fairly complex levels, emphasizing the protagonist's vulnerability and survival aspect. Rotoscoping technique is used to give more realism to the animation of the characters' movements.<br><br>The protagonist must avoid deadly traps, solve some simple jumping and environmental puzzles (such as stepping on pressure plates to raise portcullis), and engage in sword fights with the guards. The player character has an infinite amount of lives, but has to restart at the beginning of a level each time he dies, and must complete the game within an hour. The hero starts with three units of health, which can be replenished with small health potions or permanently increased with large jars.<br><br>The Game Boy Color and SNES versions of the game feature additional levels and new enemies. The Genesis version has a new intro, an altered set of graphics and four new levels.",
  "publishedBy": "Br&oslash;derbund Software, Inc.",
  "developedBy": "",
  "released": "1990",
  "alsoFor": "Amiga, Apple II, Atari ST, DOS, FM Towns, Game Boy, Game Boy Color, Game Gear, Genesis, iPad, iPhone, Macintosh, NES, Nintendo 3DS, PC-98, SAM Coupé, SEGA CD, SEGA Master System, Sharp X68000, SNES, TurboGrafx CD, Wii | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Regional differences",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/prince-of-persia",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Br&oslash;derbund Software, Inc.",
          "developer": "",
          "ported": "Micro&iuml;ds",
          "country": " France",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/442146-prince-of-persia-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/442147-prince-of-persia-amstrad-cpc-screenshot-title-screen-french.png",
      "caption": "Title screen (French version)"
    },
    {
      "link": "/images/shots/l/442148-prince-of-persia-amstrad-cpc-screenshot-opening-story.png",
      "caption": "Opening story"
    },
    {
      "link": "/images/shots/l/175152-prince-of-persia-amstrad-cpc-screenshot-intro.png",
      "caption": "Intro"
    },
    {
      "link": "/images/shots/l/175151-prince-of-persia-amstrad-cpc-screenshot-first-level.png",
      "caption": "First level"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/59484-prince-of-persia-amstrad-cpc-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "France",
      "platforms": "Amstrad CPC"
    }
  ]
}