{
  "name": "R-Type",
  "shortName": "r-type",
  "description": "<i>R-Type</i> is a side scrolling shoot 'em up best known for its extremely tough and strategic gameplay.  You control the R-9 spaceship as it launches a last-ditch effort to repel the evil Bydo empire.<br><br>The R-9 comes equipped as standard with a small gun which can only take down the smallest of enemies without firing several shots. By holding down the fire button, it can be loaded up so as to release a large burst of energy, eliminating all but the strongest enemies in its path. From time to time, pods will come flying in your direction. Upon being shot, they release an upgrade. The first one will invariably be the one called &quot;The Force&quot;, which is a weapons pod that clings either to the front or the back of your ship, absorbing any enemy bullets or acting as a bumper with which you can fly head-on into them. You can also use it as an offensive weapon by firing it and pulling it back in. Mastering the Force is vital to surviving in <i>R-Type</i>, since it must be used both as protection against bullet clusters, as a remote controlled cannon, and in order to clear the screen from obstacles. Other upgrades give you target-seeking missiles or a bigger main gun. Different gun types, differentiated by their colour, serve different purposes. The blue one sends laser beams bouncing across the screen (good for tunnels), the red one fires straight ahead, and the yellow one follows any walls it may encounter (good for artillery emplacements).<br><br>The stages of <i>R-Type</i> are made in an organic style, certainly inspired by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,861/\">H. R. Giger's</a> artwork for the Alien movies. When it came out, it was considered trend-setting since it broke off from the stereotypical sci-fi mould of other shoot'em'ups. In part, the levels themselves are your enemy, which is exemplified by the fourth, where spider-like creatures weave webs that cover the screen and block your path, or levels with intricate tunnel systems. Still, the levels are best handled with a combination of strategy and reflexes, without the memorisation that is required of R-Type's contemporary rival, <a href=\"https://www.mobygames.com/game/gradius\">Gradius</a>.",
  "publishedBy": "Electric Dreams Software",
  "developedBy": "Irem Corp.",
  "released": "1989",
  "alsoFor": "Amiga, Android, Arcade, Atari ST, Commodore 64, Game Boy, iPad, iPhone, J2ME, MSX, Nintendo 3DS, Ouya, PC-88, SEGA Master System, Sharp X68000, TurboGrafx-16, TurboGrafx CD, Wii, Wii U, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/r-type",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Electric Dreams Software",
          "developer": "Irem Corp.",
          "ported": "Software Studios",
          "country": " United Kingdom",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Hit Squad, The",
          "developer": "Irem Corp.",
          "ported": "Software Studios",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": "Budget re-release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/135999-r-type-amstrad-cpc-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/136000-r-type-amstrad-cpc-screenshot-r9-tech-specs.png",
      "caption": "R9 tech specs"
    },
    {
      "link": "/images/shots/l/136001-r-type-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/136002-r-type-amstrad-cpc-screenshot-you-can-see-that-this-is-a-spectrum.png",
      "caption": "You can see that this is a Spectrum conversion."
    },
    {
      "link": "/images/shots/l/136003-r-type-amstrad-cpc-screenshot-if-you-ve-come-this-far-you.png",
      "caption": "If you've come this far, you get to restart here"
    },
    {
      "link": "/images/shots/l/136004-r-type-amstrad-cpc-screenshot-here-comes-a-little-heper.png",
      "caption": "Here comes a little heper"
    },
    {
      "link": "/images/shots/l/136005-r-type-amstrad-cpc-screenshot-high-score-list.png",
      "caption": "High score list"
    },
    {
      "link": "/images/shots/l/136006-r-type-amstrad-cpc-screenshot-continue.png",
      "caption": "Continue?"
    }
  ],
  "cover": []
}