{
  "name": "RoboCop 2",
  "shortName": "robocop-2_____",
  "description": "<i>RoboCop 2</i> for Amstrad machines follows the same template as the other versions of the game released by Ocean Software in that it combines platforming action, a puzzle mode and a shooting gallery, but with different level designs and gameplay mechanics.<br><br>In the three platform levels, RoboCop must find the goal point of the level before time and energy (which decreases continually) run out. The levels are full of hazards like electricity, rolling boulders, falling spikes, stomping machinery and more. Compared to other versions of the game, enemies are relatively rare and no gun power-ups are available. Robo can collect extra lives, energy and short-time invincibility power-ups, though. Optionally, he can collect Nuke drug canisters and arrest suspects, both of which give bonus points at the end of the level. Suspects should not be shot, however, because doing so drains the energy substantially. Every level contains several one-screen bonus rooms: entering these presents RoboCop with both more hazards but also more items to collect. Entering a room also activates a reset point so the level doesn't have to be started over again when a life is lost. The last level concludes with a boss battle against Cain aka &quot;RoboCop 2&quot;.<br><br>After every platform level, a puzzle level follows. To regain Robo's lost memories, a cursor must be moved over a circuit board with the goal of hitting all black chips while avoiding all red ones. Moving the cursor leaves a trail of burnt circuitry which must not be crossed again. It is possible to re-arrange the board by shifting the current row left or right or the current column up or down. Four boards must be completed successfully within three minutes to gain the maximum number of points.<br><br>In the shooting gallery, targets appear in windows and on the street, and a crosshair must be moved to hit them. Both criminals and innocents are among the targets: naturally, the civilians should be spared to achieve the best possible score.",
  "publishedBy": "Ocean Software Ltd.",
  "developedBy": "Ocean Software Ltd.",
  "released": "1990",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/robocop-2_____",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Ocean Software Ltd.",
          "developer": "Ocean Software Ltd.",
          "ported": "",
          "country": " France, Germany, Italy, Spain, United Kingdom",
          "releaseDate": "1990",
          "ean13": "5 013156 112935",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/445250-robocop-2-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/445251-robocop-2-amstrad-cpc-screenshot-level-1-info.png",
      "caption": "Level 1 info"
    },
    {
      "link": "/images/shots/l/445252-robocop-2-amstrad-cpc-screenshot-level-1.png",
      "caption": "Level 1"
    }
  ],
  "cover": []
}