{
  "name": "Runestone",
  "shortName": "runestone",
  "description": "<i>Runestone</i> takes the panoramic views and multiple characters of <a href=\"https://www.mobygames.com/game/lords-of-midnight\">Lords of Midnight</a> and allies them to adventure-style features. There are NPCs who have specific roles in the storyline, move in real-time, and can be given instructions. You have the ability to directly enter buildings, and a changing score is constantly kept.<br><br>The land of Belorm consists of Warriors, Wizards and Elves. The Great Wizards ensured centuries of peace, before legions of orcs attacked from the Northern Wastes. A series of sneak attacks weakened Belorm, the last of them killing Elwin. However, the Great Book leads Greymarel the Wizard to believe that Kordomir is the mythical Dark One, and the greatest threat. Now Belorm and can only be saved if Greymarel, Eliador (the last of the Elves), and Morval the Warrior can find the <i>Runestone</i>, a sacred device sculpted by Zaphir the Great Wizard.<br><br>Commands are input from the keyboard. You can move in a direction by typing (for example) GO or MOVE E, or alternatively can LOOK E and then GO – only N/S/E/W movement is offered, so moving northeast requires 2 moves. Instructions for other characters are issued using TELL or ASK. When issuing combat instructions, you can specify the target orc and the weapon to be used. Chain commands are accepted.<br><br>Greymarel has little spell-casting ability as the game starts, but can gain many as they are discovered. He also has many strange relics, which may prove to be of use. Key NPCs include Chronos the Wise, Quester the Hermit and Brunor the Bold. The Great Waters separate the north from the south; they must be crossed via boats.",
  "publishedBy": "Firebird Software",
  "developedBy": "",
  "released": "Feb, 1986",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Adventure, Role-Playing (RPG)",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/runestone",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Feb, 1986",
          "ean13": "5 012439 002369",
          "comments": "Hot Label"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}