{
  "name": "The Sentry",
  "shortName": "sentry_",
  "description": "A surreal and very original game by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,6244/\">Geoff Crammond</a>.<br><br>The game plays out on a 3D landscape with hills and valleys made up of several levels. At the highest vantage point stands The Sentinel,  a statue-like being with an energy draining stare,  you begin at the lowest.  &quot;Energy&quot; plays an important role,  there's a constant amount in the game world and each object is worth a certain number of units - including you.<br><br>The object of each level is to absorb The Sentinel and Hyperspace to the next from his vantage point. <br><br>The Sentinel scans further round the landscape every few seconds - if you're caught in his gaze,  or rather the square you are standing on can be seen,  you'll have about 5 seconds to teleport to another location (or hit a key to teleport to a random location - which will never be higher,  and may be lower than your current level) before the Sentinel begins absorbing your energy,  when it reaches zero you will be destroyed. To travel a &quot;robot hull&quot; must be created on a visible square then teleported to,  making sure you absorb your old hull to avoid losing energy. Boulders and trees can also be created,  trees to block The Sentinels view and boulders can be stacked to gain higher ground. <br><br>There are a few other elements to the game - on later levels there will be other Sentries positioned around the landscape. If only part of you can be seen i.e. not the square you are standing on, a nearby tree can be changed into a &quot;Meanie&quot;  which will ultimately force you to teleport. There are 9999 levels in the game but the next level number is based on the current level + how much energy you have remaining.<br><br><a href=\"https://www.mobygames.com/game/sentinel-returns\">Sentinel Returns</a> is a remake very true to the original.\n",
  "publishedBy": "Firebird Software",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "Amiga, Atari ST, BBC Micro, Commodore 64, DOS, ZX Spectrum | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/sentry_",
  "visual": "",
  "gamePlay": "Stealth",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "5 012439 002109",
          "comments": "Floppy Disk release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/122022-the-sentry-amstrad-cpc-screenshot-splash-screen.png",
      "caption": "Splash screen."
    },
    {
      "link": "/images/shots/l/122023-the-sentry-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/122024-the-sentry-amstrad-cpc-screenshot-level-preview-screen.png",
      "caption": "Level preview screen."
    },
    {
      "link": "/images/shots/l/122025-the-sentry-amstrad-cpc-screenshot-first-person-view.png",
      "caption": "First-person view."
    }
  ],
  "cover": []
}