{
  "name": "Shadowfire",
  "shortName": "shadowfire",
  "description": "General Zoff is holding Ambassador Kryxix captive in his spaceship. Plans for a new type of spaceship are hidden in a micro-disc embedded in the Ambassador's spine. If Zoff had the plans, the empire would be in great danger, and it is only a matter of time until his inquisitors will discover them. The Emperor has assembled the so-called &quot;enigma team&quot;, a group of six reckless mercenaries, to take care of the situation.<br><br>Players take control of all six mercenaries and have one hour and forty minutes to rescue Ambassador Kryxix and capture General Zoff. All six characters have different abilities. Syylk is an insectoid and a strong fighter, Zark Montor, the team leader, is an expert in unarmed combat and the only translator of the group, Servina Maris is the only character who can pick locks, Torik is an avian with thorough knowledge of explosives, Maul is a slow combat droid and Manto is a weak droid, but the only team member that can operate the transporter that is vital for the mission's success.<br><br>Controls are completely icon based and the screen is divided into six sections. The upper screen section is called the mission command screen and displays which character is active, the active character's location and the status of all characters: whether they are moving, engaged in combat, weak or dying or performing certain action such as picking locks. The lower half of the screen changes depending on the situation and shows additional information and all selectable actions.<br><br>From the main game screen (enigma team screen) players can choose one of the six characters and access four sub-screens:<br><br><b>Character status screen</b>:\nShows a character's speed, strength, stamina (health) and carried weight.<br><br><b>Object screen</b>:\nShows all objects present at a location as well as all objects carried by the selected character. It can be used to drop or pick up items, equip weapons and items or use special items.<br><br><b>Movement screen</b>:\nHere, the active character can be moved by clicking on arrows that show possible directions for a character to move.<br><br><b>Battle screen</b>:\nDuring battles, characters can scan the location to count and identify their enemies, move, attack with their equipped weapon, defend or retreat.",
  "publishedBy": "Beyond",
  "developedBy": "Denton Designs",
  "released": "May, 1986",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Adventure, Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/shadowfire",
  "visual": "2D scrolling",
  "gamePlay": "Tactical RPG",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Beyond",
          "developer": "Denton Designs",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "May, 1986",
          "ean13": "",
          "comments": "Tape release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/394452-shadowfire-amstrad-cpc-screenshot-main-menu.png",
      "caption": "Main menu"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/741914-shadowfire-amstrad-cpc-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Plastic Case",
      "country": "United Kingdom",
      "platforms": "Amstrad CPC"
    },
    {
      "link": "/images/covers/l/741915-shadowfire-amstrad-cpc-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Plastic Case",
      "country": "United Kingdom",
      "platforms": "Amstrad CPC"
    },
    {
      "link": "/images/covers/l/741916-shadowfire-amstrad-cpc-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "Plastic Case",
      "country": "United Kingdom",
      "platforms": "Amstrad CPC"
    },
    {
      "link": "/images/covers/l/741918-shadowfire-amstrad-cpc-media.jpg",
      "scanOf": "Media",
      "packaging": "Plastic Case",
      "country": "United Kingdom",
      "platforms": "Amstrad CPC"
    },
    {
      "link": "/images/covers/l/741917-shadowfire-amstrad-cpc-manual.jpg",
      "scanOf": "Manual",
      "packaging": "Plastic Case",
      "country": "United Kingdom",
      "platforms": "Amstrad CPC"
    }
  ]
}