{
  "name": "Snodgits",
  "shortName": "snodgits",
  "description": "Items have been disappearing from Mystery Mansion, home of the Snodger family and also a group of strange creatures called snodgits. Famous detectives from all over the world have been summoned to investigate the thefts. You play Benton, the bumbling butler who wants to try to solve the case before anyone else, while at the same time providing timely butlering services.<br><br>Benton may start the game in one of five house layouts. The houses are populated by walls, furniture of various sorts, collectable objects, and moving inhabitants (such as the Snodgers, their pets the Snodgits, and famous detectives such as Padlock Holmes and Hercules Parrot). The view of the house is isometric, and the view can be rotated by 90 degrees by pressing the fire button, which is sometimes necessary to see obscured objects. There is also a plan view of the current floor at the bottom of the screen.<br><br>Benton's main job, screamed at him by one of the snodgits, will be to collect an object from around the house and give it to a particular Snodger family member. Benton's current position, and the position of the object to be retrieved are marked on the plan view. Stairways between floors are also marked on the plan view by a very small dot next to one of the walls. Benton's currently held object is displayed at the bottom left, and he can swap this for another object by walking into it. Passing by a Snodger allows Benton to swap his item with whatever they are carrying. Once the required object is collected, the receiver of the object also becomes highlighted on the plan view. Successful delivery of the item will allow Benton to collect a clue to the mystery.<br><br>The clue is in the form of a vaguely Mastermind like &quot;clue table&quot;. The left side of the table shows three rows. Each row contains four people. Each person is associated with an object, and those objects are displayed on the right hand side, but not in order. Benton's task is then to determine which person is associated with a particular named object within the time limit. If he guesses correctly, that person is added to the &quot;guilty&quot; box at the bottom right of the screen. You then have to tell your information to a detective. Providing information on three criminals is enough to solve the level, and you immediately start again in a new larger house.<br><br>Complicating matters is that Benton has a limited number of snodges and bodges. A snodge is lost every time Benton bumps into a Snodger or a snodgit. A bodge is lost every time Benton bumps into a wall or a piece of furniture. These numbers are represented by meters at the bottom of the screen, and are not renewed when a level is completed. Losing all your bodges or snodges ends the game.",
  "publishedBy": "Sparklers",
  "developedBy": "",
  "released": "Jun, 1986",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/snodgits",
  "visual": "Isometric",
  "gamePlay": "Puzzle elements, Stealth",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Sparklers",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Jun, 1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/868520-snodgits-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/868521-snodgits-amstrad-cpc-screenshot-looking-for-the-piggy-bank.png",
      "caption": "Looking for the piggy bank."
    },
    {
      "link": "/images/shots/l/868523-snodgits-amstrad-cpc-screenshot-butlers-see-things-like-this.png",
      "caption": "Butlers see things like this all the time."
    },
    {
      "link": "/images/shots/l/868524-snodgits-amstrad-cpc-screenshot-now-looking-for-lord-snodger.png",
      "caption": "Now looking for Lord Snodger."
    },
    {
      "link": "/images/shots/l/868525-snodgits-amstrad-cpc-screenshot-climbing-to-the-top-of-the.png",
      "caption": "Climbing to the top of the inside walls."
    },
    {
      "link": "/images/shots/l/868526-snodgits-amstrad-cpc-screenshot-clue-screen-daphne-stole-the.png",
      "caption": "Clue screen. Daphne stole the flowers!"
    },
    {
      "link": "/images/shots/l/868527-snodgits-amstrad-cpc-screenshot-daphne-is-guilty-now-to-tell.png",
      "caption": "Daphne is guilty! Now to tell a detective."
    },
    {
      "link": "/images/shots/l/868528-snodgits-amstrad-cpc-screenshot-looking-for-daphne.png",
      "caption": "Looking for Daphne."
    },
    {
      "link": "/images/shots/l/868529-snodgits-amstrad-cpc-screenshot-fourth-floor-of-the-mansion.png",
      "caption": "Fourth floor of the mansion."
    },
    {
      "link": "/images/shots/l/868530-snodgits-amstrad-cpc-screenshot-the-end-after-running-into.png",
      "caption": "The end, after running into Miss Marble."
    }
  ],
  "cover": []
}