{
  "name": "SRAM 2",
  "shortName": "sram-2",
  "description": "<i>SRAM 2</i> is a single player, French, text adventure with pictures. <br><br>In the previous game <a href=\"https://www.mobygames.com/game/sram\">SRAM</a> the player rescued the royal family after they had been imprisoned by the high priest. It seems that the time in the dungeons affected Ergres the king and, under the mind controlling influence of the aforementioned high priest, he's become a tyrant. Time for another hero/heroine to arise and dispose of him. However the game is clear, his family know nothing of his actions so Egres is the only one to be killed. The game starts in a crypt which holds four tombs and no apparent way in or out.<br><br>The screen is divided into sections of which the largest part is the picture. Above the picture is the title of the scene so the player knows where they are, To the right of the title is a compass showing which directions the player can move and to the left of the title is the game clock, the game's introductory screens do say that time is important - just not how and why.\nOn the far right is an inventory panel and along the bottom of the screen are the command and response panels. <br><br>The game uses the arrow keys for movement. Movement commands can be used but, unlike the previous game, these can no longer be abbreviated - for example while the game recognises Nord as an instruction to move northwards it does not recognise N as an abbreviation for the same command.\n",
  "publishedBy": "ERE Informatique",
  "developedBy": "ERE Informatique",
  "released": "1987",
  "alsoFor": "DOS | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/sram-2",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "ERE Informatique",
          "developer": "ERE Informatique",
          "ported": "",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}