{
  "name": "Stir Crazy featuring BoBo",
  "shortName": "stir-crazy-featuring-bobo",
  "description": "<i>BoBo</i> is a cartoon style arcade game. The main character is Bobo, an inmate who has been sentenced for seventeen years. He must do many chores, such as peeling potatoes, ladling soup to his fellow prisoners, helping his fellow prisoners to escape, jumping electric wires and singing lullabies to his snoring cell mates. It is possible to play through the events in a sequence or one at a time. Up to six players (alternating, not simultaneously) can play this game.\n  \nEach event can be played with joystick or keyboard. The specific moves you have to make vary from event to event but it come basically down to moving the joystick or keyboard keys fast from left to right. It is also possible to pick things up and toss them.<br><br>The game includes the following events:\n<ul><li>Bobo has a job in the prisons canteen. He must serve soup to the other inmates and keep their soup plates full. To do this Bobo must move around the tables. When his supply of soup is empty he must refill it at the top of the screen where a new supply of soup is available. If his fellow inmates demand more soup they start banging and hammering on the tables. The score of this event is based on how many plates of soup he hands out.\n<li>Peeling potatoes is not Bobo's favorite chore but he has to do it. He has to pick up a potato, then peeling it and when that's done tossing it away. Bobo scores points based on the number of potatoes he has peeled. If a potato is not fully peeled it will be tossed back.\n<li>In the next event Bobo must help his inmates to escape prison. The inmates are jumping out of their cell windows and it is Bobo's task to get them over the prison wall by moving a trampoline around. \nThe score is based on how many inmates actually can escape. Bobo must be sure to catch the inmates under the right angle with his trampoline because if he fails the inmates will crash into the prison wall.\n<li>Finally, Bobo found an way to escape prison. He must jump from wire to wire and as the wires are electrified he must take care not to be electrocuted. The score in this event based on how long Bobo can prevent being electrocuted. Bonus points can be earned by picking up the green objects that appear occasionally on the wires.\n<li>In the last event Bobo has been captured by the police and returned to his cell. He can't sleep because his cell mates are snoring and to stop it he has to sing lullabies to them. He has to climb the beds and not wake his cell mates by stumbling around his cell. When all cell mates fall asleep Bobo himself must go to bed to get some rest himself. The score in this event is based on the time Bobo is actually able to sleep himself.</li></ul>",
  "publishedBy": "Infogrames Europe SA",
  "developedBy": "Infogrames Europe SA",
  "released": "1988",
  "alsoFor": "Amiga, Atari ST, Commodore 64, DOS, Thomson TO, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/stir-crazy-featuring-bobo",
  "visual": "",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Infogrames Europe SA",
          "developer": "Infogrames Europe SA",
          "ported": "",
          "country": " France",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/135977-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/135978-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-credit-screen.png",
      "caption": "Credit screen"
    },
    {
      "link": "/images/shots/l/135979-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-a-police.png",
      "caption": "A police officer chasing Bobo"
    },
    {
      "link": "/images/shots/l/135980-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-pass-out.png",
      "caption": "Pass out soup to your fellow prisoners"
    },
    {
      "link": "/images/shots/l/135981-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-your-prison.png",
      "caption": "Your prison inmates are mad because they have no soup"
    },
    {
      "link": "/images/shots/l/135983-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-potatoes.png",
      "caption": "Potatoes come down the tube."
    },
    {
      "link": "/images/shots/l/135984-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-peel-the.png",
      "caption": "Peel the potatoes and toss them over your shoulder through the door"
    },
    {
      "link": "/images/shots/l/135985-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-you-really.png",
      "caption": "You really need to peel the potatoes faster, next time"
    },
    {
      "link": "/images/shots/l/135986-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-your-prison.png",
      "caption": "Your prison mates jump out of their cell windows"
    },
    {
      "link": "/images/shots/l/135987-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-catch-your.png",
      "caption": "Catch your cell mates with the trampoline to get them over the prison walls"
    },
    {
      "link": "/images/shots/l/135988-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-to-escape.png",
      "caption": "To escape prison you have to jump from wire to wire "
    },
    {
      "link": "/images/shots/l/135989-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-your-cell.png",
      "caption": "Your cell mates are snoring"
    },
    {
      "link": "/images/shots/l/135990-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-sing-a-lullabies.png",
      "caption": "Sing a lullabies to your fellow cell mates"
    },
    {
      "link": "/images/shots/l/135991-stir-crazy-featuring-bobo-amstrad-cpc-screenshot-you-had-to.png",
      "caption": "You had to jump over the bowl"
    }
  ],
  "cover": []
}