{
  "name": "Swords &amp; Sorcery",
  "shortName": "swords-sorcery",
  "description": "The catacombs of Zob are believed to contain untold wealth and fortune, and this is enough to tempt you. That means entering an imposing dungeon filled with strange foes - Mages, Servants of Set, Revenent Guardians and many more. After taking 14 days of training to build up your skills, or taking the default combinations, your magic and swordplay must face the challenge.<br><br><i>Swords and Sorcery</i> is a dungeon-crawler that uses the proprietary MIDAS system to present a first-person visual representation of your position, in a manner similar to <a href=\"https://www.mobygames.com/search/quick?game=Bard+Tale\">Bard's Tale</a>. This is on the left of the screen, with a map of your surroundings on the right, and text messages detailing your current situation below.<br><br>Below even that are the menus, which are activated by moving a highlight bar left and right before selecting the correct option. Enemies you meet can be threatened, bribed or grovelled to. You can activate any spells you collect, including un-poison, weaken enemy, and freeze enemy.<br><br>Watch out for magical barriers and traps, and use the transporters to your advantage. When you encounter magic would will have to test it to determine its use or detriment.<br><br>The Armour of Zob is split into several pieces, which would will hopefully find on your quest. There are also extra swords and shields to collect, plus some treasure as a reward.",
  "publishedBy": "Personal Software Services",
  "developedBy": "",
  "released": "Mar, 1986",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/swords-sorcery",
  "visual": "",
  "gamePlay": "Puzzle elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Personal Software Services",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Mar, 1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}