{
  "name": "The Sydney Affair",
  "shortName": "sydney-affair",
  "description": "Promoted to a rank of Senior Sergeant of Investigations Brigade in Saint-Etienne (Loire), you've already proved yourself in <a href=\"https://www.mobygames.com/game/vera-cruz\">L'affaire Vera Cruz</a> (<i>The Vera Cruz Affair</i>). Your chiefs rest all their hopes upon your abilities and commit a new case to you, <b>L'affaire Sydney</b> (<i>The Sydney Affair</i>).<br><br>Mr. James Sydney has just been shot in the head. The assassin, who fired from the opposite building, should know the habits of the victim, because (s)he spent all the day at the same place there... So you go with your team to the crime scene to collect the clues and follow the possible traces.<br><br>The game as its predecessor flows in two parts: <i>crime scene investigation</i> to collect the evidence, and <i>work with telex machine</i> to gain information about possible suspects.<br><br>The crime scene now includes two screens (street with Sydney's body and assassin's apartment). You should collect all possible evidence moving the marker on the screen and examining the objects scattered at the scenes as well as the body itself.<br><br>With telex machine you should perform investigation according to the police procedures. Different actions are possible here such as sending messages within Diamond Network to receive the replies, printing the notes, contacting other Police services to gain the new information, comparing the evidences, carrying out examinations such as autopsy, interviewing/checking the alibis of suspects, and arresting finally. To specify the subject for each action you should type it.",
  "publishedBy": "Infogrames Multimedia SA",
  "developedBy": "Infogrames Multimedia SA",
  "released": "1986",
  "alsoFor": "Commodore 64, DOS, MSX, Thomson MO, Thomson TO, ZX Spectrum | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/sydney-affair",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Infogrames Multimedia SA",
          "developer": "Infogrames Multimedia SA",
          "ported": "",
          "country": " France",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/331162-the-sydney-affair-amstrad-cpc-screenshot-title-screen-with.png",
      "caption": "Title Screen with alive Sydney..."
    },
    {
      "link": "/images/shots/l/331163-the-sydney-affair-amstrad-cpc-screenshot-sydney-was-shot.png",
      "caption": "Sydney was shot..."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/124809-the-sydney-affair-amstrad-cpc-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cassette Case",
      "country": "France",
      "platforms": "Amstrad CPC"
    },
    {
      "link": "/images/covers/l/124810-the-sydney-affair-amstrad-cpc-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cassette Case",
      "country": "France",
      "platforms": "Amstrad CPC"
    }
  ]
}