{
  "name": "They $tole a Million",
  "shortName": "they-tole-a-million",
  "description": "In <i>They $tole a Million</i> you are The Boss, a would-be criminal mastermind out to seek his fortune the dishonest way. To do this you will have to hire a team of criminals, with skills ranging from explosives to driving - these will each seek an upfront payment and a percentage cut of the eventual profits. You will have to buy information and plans on potential targets - an art gallery and bank for example. Menu options reveal pop-up windows of information and sub-menus.<br><br>Planning the raid itself is your next task. An overhead view of the site is prevented, with your information on doors and storage locations all readily available. You move each member around the map to give them orders, using a displayed clock to ensure that the action timings overlap correctly. Many options bring up sub-menus of icons.<br><br>During the actual crime, you wait outside, with a walkie-talkie to issue orders. Keep an eye out for police cars, as their presence may for you to freeze, or run off with what you have so far. You can enter the site to help out, but this leaves you defenceless if the police arrive.",
  "publishedBy": "39 Steps",
  "developedBy": "Tigress Marketing",
  "released": "1986",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/they-tole-a-million",
  "visual": "",
  "gamePlay": "Puzzle elements, Stealth",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "39 Steps",
          "developer": "Tigress Marketing",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}