{
  "name": "Think!",
  "shortName": "think",
  "description": "<i>Think!</i> is a strategic puzzle game similar to the board game <a href=\"https://www.mobygames.com/search/quick?gamegroup=Genre%3a+Board+game+-+Connect+Four+\">Connect 4</a>. It's played by two player (player vs. player or player vs. computer) on a 6x6 board. The players take turns in putting out counters on the board and the goal is to get four in a row. The counters can't be placed anywhere, they have to be pushed onto the board from the bottom or the right edge. As a counter is added everything in that row or column will move along. Counters that reach the opposite sides of the board can be pushed off and will then be lost. Winning lines can be horizontal, vertical or diagonal. <br><br>In addition to the normal mode described above there are a few additional variations of it. These are Speed Think! where each player has a limited amount of time to make each move and Blitz Think! where the player have a total time limit for all moves. There's a tutorial mode where the computer gives feedback on how good each move is. At the end the player gets a percentage score. There are also six preset problems with a few counters already on the board. The player can also create his own problems. ",
  "publishedBy": "Ariolasoft UK",
  "developedBy": "RamJam Corporation, The, Tigress Marketing",
  "released": "Jan, 1986",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/think",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Board game",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Ariolasoft UK",
          "developer": "RamJam Corporation, The",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Jan, 1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}