{
  "name": "Time Scanner",
  "shortName": "time-scanner",
  "description": "<i>Time Scanner</i> is a pinball game. As usual, the goal is to keep the ball in the game by bouncing it back with the paddles. Hitting bumpers and other obstacles rewards points and completing a table requires mastering certain objectives which depend on the table on hand. Every table is divided into twp parts with their own paddles: the game only scrolls if the ball goes down. The four tables are:\n<ul><li>Volcano: The winning condition is to spell the table's name by using the associated volcano lanes.</li>\n<li>Ruins: In the middle of the table there is a &quot;collect ball&quot; hole. If all targets were hit and two balls were collected in the hole, a special fire ball is set loose. The stage is won when bringing this ball into the hole.</li>\n<li>Saqqarah: This pyramid themed table also required spelling a name by knocking down targets and hitting a special hole.</li>\n<li>The last table introduces <a href=\"https://www.mobygames.com/search/quick?game=Breakout\">Breakout</a> elements: the player needs to hit blocks to vaporize them.</li></ul>\nThe first three tables can be freely selected and the last one is unlocked by beating the other three.",
  "publishedBy": "Activision, Inc.",
  "developedBy": "SEGA Enterprises Ltd.",
  "released": "1989",
  "alsoFor": "Amiga, Arcade, Atari ST, Commodore 64, MSX, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/time-scanner",
  "visual": "",
  "gamePlay": "Pinball",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Activision, Inc.",
          "developer": "SEGA Enterprises Ltd.",
          "ported": "Spidersoft",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/715865-time-scanner-amstrad-cpc-media.jpg",
      "scanOf": "Media",
      "packaging": "Plastic Case",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Amstrad CPC"
    }
  ]
}