{
  "name": "Times of Lore",
  "shortName": "times-of-lore",
  "description": "The Kingdom of Albereth was under attack of barbarian forces. King Valwyn drove the barbarians away, but was wounded in battles. Searching for a place where he could rest and restore his strength, he left the city - but never returned. Now, a new hero must rise and defend his homeland.<br><br><i>Times of Lore</i> is an action game with light role-playing elements, which follows the adventures of a young warrior (strong barbarian, armored knight, or quick valkyrie) to assist a weakened kingdom from various threats, and to recover special Artifacts that once made the kingdom strong.<br><br>Gameplay consists of moving the protagonist in real-time (day and night) through various terrains, like forests, towns, and dungeons. The player character gathers basic items, like health and magic potions, and increasingly powerful weapons as he completes tasks and advances the plot. Conversations are handled through key phrases. Battles involve a few types of creatures (skeletons, orcs, rogues) of which there can be various flavors.",
  "publishedBy": "MicroProse Ltd.",
  "developedBy": "ORIGIN Systems, Inc.",
  "released": "1990",
  "alsoFor": "Amiga, Apple II, Atari ST, Commodore 64, DOS, NES, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/times-of-lore",
  "visual": "2D scrolling",
  "gamePlay": "Puzzle elements, RPG elements",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "MicroProse Ltd.",
          "developer": "ORIGIN Systems, Inc.",
          "ported": "Imagitec Design Inc.",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/578314-times-of-lore-amstrad-cpc-screenshot-loading-screen.png",
      "caption": "Loading screen."
    },
    {
      "link": "/images/shots/l/578315-times-of-lore-amstrad-cpc-screenshot-the-story.png",
      "caption": "The story."
    }
  ],
  "cover": []
}