{
  "name": "Titan",
  "shortName": "titan",
  "description": "<i>Titan</i> is a 2D arcade game / puzzle game hybrid.<br><br>For some reason, mad professors of the future tend to invent strange entertainment games in which every participant dies. Professor Hybrys’ variant is called <i>Titan</i> and involves a ball, a control unit and 80 labyrinths. Your objective is either to destroy all destructible blocks in each level by hitting them with the sphere, or to pilot it to the exit. The black ball is beyond your control; it will bounce straight or diagonally through the labyrinth with constant speed. You move the control unit, a small box, with you are to position in a way that the ball bounces off it in the desired direction. You can also catch the sphere by quickly moving over it, and then release it in a direction of your choice.<br><br>The labyrinths not only contain harmless, destructible blocks, but also increasingly difficult hazards. If the sphere or your control unit hit a skull symbol, one of your nine lives is lost. Teleporters exchange the position of you and the ball, wall pieces can be pushed around or destroyed by your unit, floor tiles will grow into walls when you pass over them too often. The high game speed can be slowed down by holding the space key – a very useful option in tricky situations.<br><br><i>Titan</i> mixes an arcade game foundation (requiring quick reflexes and good nerves) with puzzle game elements (requiring logical thinking to beat the complex levels). The challenge is to control the sphere accurately, yet indirectly.",
  "publishedBy": "Titus France SA",
  "developedBy": "Titus France SA",
  "released": "1988",
  "alsoFor": "Amiga, Atari ST, Commodore 64, DOS, FM Towns, Macintosh, NES, TurboGrafx-16, Windows, ZX Spectrum | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/titan",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Titus France SA",
          "developer": "Titus France SA",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/326479-titan-amstrad-cpc-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/326480-titan-amstrad-cpc-screenshot-start-stage-1.png",
      "caption": "Start stage 1"
    },
    {
      "link": "/images/shots/l/326481-titan-amstrad-cpc-screenshot-stage-1-s-starting-area.png",
      "caption": "Stage 1's starting area."
    },
    {
      "link": "/images/shots/l/326482-titan-amstrad-cpc-screenshot-after-you-bust-though-the-wall.png",
      "caption": "After you bust though the wall, you have blocks to hit."
    },
    {
      "link": "/images/shots/l/326483-titan-amstrad-cpc-screenshot-beginning-stage-2-watch-the-skulls.png",
      "caption": "Beginning stage 2. Watch the skulls, they will kill you."
    },
    {
      "link": "/images/shots/l/326484-titan-amstrad-cpc-screenshot-the-red-blocks-need-to-be-hit.png",
      "caption": "The red blocks need to be hit several times to remove them."
    },
    {
      "link": "/images/shots/l/326485-titan-amstrad-cpc-screenshot-starting-stage-3.png",
      "caption": "Starting stage 3."
    }
  ],
  "cover": []
}