{
  "name": "Transmuter",
  "shortName": "transmuter",
  "description": "In <i>Transmuter</i> humanity had to leave earth's surface and retract into the underground because the sun transformed into a red giant. To make matters worse, deadly machines want to destroy the humans. Finally the survivors were able to leave the planet and find a new one to live. Now, years later, the player takes the role of Overlord Tenz to go back to earth and kill the machines.<br><br>This game is a side-scrolling shooter in which the player's space ship moves from left to right while shooting everything in sight. In some sections it is necessary to carefully navigate the environment - touching walls is just as unhealthy as getting hit by an enemy. Ship upgrades are gained by racking up points from kills: After reaching a certain amount of points, the first upgrade, speed, lights up. By pressing a button it gets applied to the ship - but if the player is more interested in one of the other four upgrades (the most expensive being protective shields), he needs to wait until he has enough points to afford it.",
  "publishedBy": "Codemasters Software Company Limited, The",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "Atari 8-bit, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/transmuter",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Codemasters Software Company Limited, The",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/694692-transmuter-amstrad-cpc-media.jpg",
      "scanOf": "Media",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "Amstrad CPC"
    }
  ]
}