{
  "name": "Triaxos",
  "shortName": "triaxos",
  "description": "A mind-probe has been sent to the maximum security prison <i>Triaxos</i> to retrieve information from a prisoner who is the only man who can activate the most powerful weapon in the galaxy. You have landed in the prison 10 minutes before the probe to find and get the man back to your ship within 30 minutes. You must search the prison blasting the robot guards and exploring each room. <br><br>Each room's floor is anti-gravity so can be stood upon to use other exits on any wall. To move to another wall you must use Face-Lifts, a disc in the middle of the room which allows you to transfer to another wall. Some exits are hidden but your map of each room shows the location of the exit. Dropping a DHE-IV Charge on the floor makes it appear. These are limited but more can be collected on the way. A Jet-Pack has to be found for the prisoner, a Defence Key to control the prisons defences and a weapon to destroy the mind-probe.  The Comms room is needed to be located to call in your ship and a cloning room is helpful to clone yourself but at the cost of energy.<br><br><i>Triaxos</i> is a flick-screen arcade adventure with an isometric view. As well as the main playing area you can also see your energy bars, amount of charges, score and a timer ticking down to zero. There are also two maps, one of the whole prison and one of the room your in showing any hidden exits and objects on any wall.",
  "publishedBy": "39 Steps",
  "developedBy": "Pennsoft",
  "released": "1987",
  "alsoFor": "Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action, Adventure",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/triaxos",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "39 Steps",
          "developer": "Pennsoft",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}