{
  "name": "Uwol 2: Quest for Money",
  "shortName": "uwol-2-quest-for-money",
  "description": "<i>Uwol 2: Quest for Money</i> is the sequel to the 2009 title <a href=\"https://www.mobygames.com/game/uwol-quest-for-money\">Uwol: Quest for Money</a>. While some elements are familiar, it has different gameplay compared to the original game. After the events of the first game Uwol exits the Storm Palace with his fortune, when he is hit by surprise by a Fanty guardian and falls down a long slope, ending up in the Phantomas' Electric Garden and losing all his coins. He decides to head home anyway until he discovers there are pipes in the garden similar to those in <a href=\"https://www.mobygames.com/search/quick?game=Super+Mario+Bros\">Super Mario Bros</a>, leading to caves full of coins. The choice is now up to the player: just try to exit the garden or go for the extra risk by collecting coins as well.<br><br>Just like in the first title the game consists of a large amount of single-screen rooms, but they are now linked together into a large, single level that can be explored freely. Uwol needs to explore and pick up several keys to open up gates eventually leading to the exit. Optionally there are also tennis balls to collect often in difficult places. The rooms in the garden use the familiar gameplay with enemies on platforms that need to be avoided as Uwol has no means to attack. After a single hit he still loses his clothes and then needs to pick up the shirt that appears in the room to regain the protection. When hit without clothes one of the nine lives provided at the start is lost.<br><br>Coins can only be found in the underground caves accessed through pipes. There is no longer a time limit per room, but the caves have the Fanties that would appear when time runs out in the first game, chasing Uwol. He needs to lure them in certain directions, get past them by jumps and quickly gather all coins before exiting again. Other game elements are spikes and moving platforms. There is a difference in the colour and music for the rooms above and under the ground.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Jan 06, 2011",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/uwol-2-quest-for-money",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 06, 2011",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/579704-uwol-2-quest-for-money-amstrad-cpc-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Amstrad CPC"
    }
  ]
}