{
  "name": "Yarkon Blues II: Space Station Zebra",
  "shortName": "yarkon-blues-ii-space-station-zebra",
  "description": "After his escape from the planet Yarkon in the game <a href=\"https://www.mobygames.com/game/yarkon-blues\">Yarkon Blues</a>, Rick McQuick is now moving through space in Gecko class scout-ship exhausted after his ordeal on the planet left behind. Due to his exhaustion, Rick is asleep, unaware that the ship belonged to deceased galactic villain, Fastbender Gloop and had a course programmed for an out of the way station called Space Station Zebra. During the zero-g football season on a Sunday, Mr Gloop used the station to get his privacy from all the eager young space-police constables trying to arrest him. If Rick wasn't asleep when he approached the station then he would of seen the warning signs that things weren't right with the station, desperate radio contact, ships leaving in a hurry, and blast marks on the outside. Now awake and docked, what dangers await poor Rick once more?<br><br><i>Yarkon Blues II: Space Station Zebra</i> is a graphic text adventure where the screen has a picture showing you what you can see with text describing each location. You type in commands with the keyboard to interact with your surroundings.<br><br>\n",
  "publishedBy": "WoW Software",
  "developedBy": "",
  "released": "1992",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/cpc/yarkon-blues-ii-space-station-zebra",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Amstrad CPC",
      "releases": [
        {
          "publisher": "WoW Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Cronosoft",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}