{
  "name": "Archon: The Light and the Dark",
  "shortName": "archon-the-light-and-the-dark",
  "description": "<i>Archon: The Light and the Dark</i> is a strategic board game with some similarities to chess. Two sides, a light one and a dark one, consisting of 18 pieces each compete on a board divided into (9 by 9) squares. You win the game by having one of your units on each of the five powerpoint squares, by removing all opposing pieces from the board or by imprisoning the last remaining creature of the opposing side.<br><br>However, you can't just remove a piece from the board by landing on it. When two pieces clash, the outcome is decided in the battle arena during one-on-one real-time combat. If the real-time combat takes place on a dark square, the dark monster gets a health bonus (longer life bar). On a light square the light side gains an advantage. There are also some squares whose color changes over time (from afternoon, to dusk, to night, to dawn etc.), which adds an extra layer of strategy to the game.<br><br>Unlike chess the two sides are not identical. Both sides consist of mythological creatures. For example the light side has among others unicorns, valkyries and a djinni while the dark side features basilisks, banshees and manticores. The differences are not just cosmetic. Two special pieces are the light wizard &amp; the dark sorceress, they can both cast magical spells like: imprison a unit on the board, shift the flow of time (change day/night cycle to your advantage), bring one unit back from the dead etc.<br><br>The different pieces have their own movement restrictions regarding the number of squares they're allowed to travel on the board and whether or not they can jump over other units (like the knight in chess). Units also behave different in combat; some units are faster than others, some use melee attacks while others fire projectiles.<br><br><i>Archon</i> can be played with either one or two players.\nThe NES version, which was released a few years after the other versions, has improved graphics for the real-time combat part. Each type of square has it's own colored background and the unit sprites are larger.",
  "publishedBy": "Activision, Inc.",
  "developedBy": "Free Fall Associates",
  "released": "Dec, 1989",
  "alsoFor": "Amiga, Amstrad CPC, Apple II, Atari 8-bit, Commodore 64, FM-7, iPad, iPhone, Macintosh, Palm OS, PC-88, PC Booter, Sharp X1, ZX Spectrum | Combined View",
  "genre": "Action, Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/archon-the-light-and-the-dark",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Activision, Inc.",
          "developer": "Free Fall Associates",
          "ported": "Bullet-Proof Software, Inc.",
          "country": " United States",
          "releaseDate": "Dec, 1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/68536-archon-the-light-and-the-dark-nes-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/68538-archon-the-light-and-the-dark-nes-screenshot-the-board.png",
      "caption": "The board"
    },
    {
      "link": "/images/shots/l/68540-archon-the-light-and-the-dark-nes-screenshot-doing-battle.png",
      "caption": "Doing battle"
    },
    {
      "link": "/images/shots/l/111511-archon-the-light-and-the-dark-nes-screenshot-the-wizard-summons.png",
      "caption": "The wizard summons a fire elemental, use it to attack one of the monsters of the dark side"
    },
    {
      "link": "/images/shots/l/111512-archon-the-light-and-the-dark-nes-screenshot-combat-between.png",
      "caption": "Combat between light wizard and dark dragon on a light square. The light side gets a health bonus on these squares"
    },
    {
      "link": "/images/shots/l/111513-archon-the-light-and-the-dark-nes-screenshot-combat-between.png",
      "caption": "Combat between light phoenix and dark manticore one a dark square. The dark side gets a health bonus on dark squares "
    },
    {
      "link": "/images/shots/l/111514-archon-the-light-and-the-dark-nes-screenshot-combat-between.png",
      "caption": "Combat between light archer and dark square on a square of &quot;neutral color&quot;; neither side gets a health bonus on such a square"
    },
    {
      "link": "/images/shots/l/111515-archon-the-light-and-the-dark-nes-screenshot-the-wizard-revives.png",
      "caption": "The wizard revives one of his creatures which had been killed in combat. You can cast the revive spell only once per game"
    },
    {
      "link": "/images/shots/l/111516-archon-the-light-and-the-dark-nes-screenshot-dark-side-controls.png",
      "caption": "Dark side controls all five powerpoints and thus wins the game"
    },
    {
      "link": "/images/shots/l/111517-archon-the-light-and-the-dark-nes-screenshot-the-nes-port.png",
      "caption": "The NES port has a new gameplay rule that encourages combat. If no battle has been fought for quite a while the game ends in a stalemate "
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/194153-archon-the-light-and-the-dark-nes-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "NES"
    },
    {
      "link": "/images/covers/l/194154-archon-the-light-and-the-dark-nes-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "NES"
    },
    {
      "link": "/images/covers/l/185204-archon-the-light-and-the-dark-nes-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "NES"
    }
  ]
}