{
  "name": "Cocona World",
  "shortName": "cocona-world",
  "description": "A witch named Cocona lives in a forest kingdom among animals. From her house inside a carved out hole in a tree trunk, she dreams of becoming a princess. However she needs a jewel to help her achieve her dream. So now it's up to the player to help her fulfill her dreams.<br><br>In <i>Cocona World</i>, players take control of a witch named Cocona. The game revolves around maintaining three different meters for Cocona.  A magic meter that drains when she attacks with her magic wand and can be refilled by locating a fairy.  A mood meter which can be filled by completing Cocona's requests (play bingo, swim in the hot springs, fish, etc...) in a timely manner.  Her mood will drain if her requests are ignored or if she is made to attack non-hostile animals. A strength meter which slowly drains naturally over time and can get drained from getting attacked by a hostile animal. It can get refilled by eating, sleeping, and using the hot springs. If either her mood or strength meter are totally empty the game will end.<br><br>The game has a clock which tells what time of the day it is. Besides having to do Cocona's requests within a time limit, players have to be wary of the time since certain items can disappear over time and Cocona can only go to sleep at her house after a certain time which will bring her to the next day in game. For every day that passes, Cocona's meters can be filled to a higher level to a maximum of ten points which can be achieved on the sixth day.<br><br>The game also has shops where Cocona can spend her treasure she found at a treasure cave or received from defeated animals. Shops carry food and other items to buy.",
  "publishedBy": "SOFEL Co., Ltd.",
  "developedBy": "SOFEL Co., Ltd.",
  "released": "Apr 10, 1987",
  "alsoFor": "",
  "genre": "Action, Simulation",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/cocona-world",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "SOFEL Co., Ltd.",
          "developer": "SOFEL Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 10, 1987",
          "ean13": "4 988623 300010",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}