{
  "name": "Eskimo Bob: Starring Alfonzo",
  "shortName": "eskimo-bob-starring-alfonzo",
  "description": "<i>Eskimo Bob: Starring Alfonzo</i> is a side-scrolling adventure puzzle platformer based on the early 2000s Flash cartoon of the same name. You control either Eskimo Bob or Alfonzo as they try to find their friend Seal, who has gone missing, across a total of 64 levels.<br><br>Eskimo Bob or Alfonzo must collect every fish on the stage to proceed to the next area. Both of them have different abilities: Eskimo Bob can punch the ground to destroy blocks or attack the boss, while Alfonzo can use his stick to poke enemies and destroy blocks in front of him. They are helped by Walrus (who can help them reach higher areas after you poke him) and Fish In A Spaceship (who carries them across long distances.) You can switch between them in some levels where their abilities are required in different situations to get past specific obstacles.<br><br>Every stage is filled with various antagonists from the series, including Maurice The Pigeon, Yeti, Sams, Penguin, Flying Nose, and Yuck. They have to be avoided or defeated using each character's specific attacks. Each level has its own environmental hazards, including slippery ice sheets, breakable blocks, and bottomless pits. You'll also face a boss every 16 levels.",
  "publishedBy": "Spoony Bard Productions",
  "developedBy": "Spoony Bard Productions",
  "released": "Sep, 2017",
  "alsoFor": "Windows | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/eskimo-bob-starring-alfonzo",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Spoony Bard Productions",
          "developer": "Spoony Bard Productions",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Sep, 2017",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}