{
  "name": "Log Jammers",
  "shortName": "log-jammers",
  "description": "<i>Log Jammers</i> is a homebrew arcade sports game. It is similar to the <a href=\"https://www.mobygames.com/game/log-jammers\">PC and console versions</a> of the same name and by the same developer. Those versions are not identical and described as an &quot;upmake&quot; of the NES version. The game borrows elements from <a href=\"https://www.mobygames.com/game/windjammers\">Windjammers</a>, which served as an inspiration.<br><br>Players select one of six characters from a cast with names such as Rad Carlton, Bruiser Bogardus, Hot Foot Francis, Sparerib Boneapart, Mayo Monsoon or Ollie Oilsack. There are also multiple environments and different game modes. The characters are described as lumberjacks. Matches take place on a fixed screen view shown from an elevated position. Characters are standing on rolling logs and throw an axe that acts like a ball.<br><br>In a typical tournament different opponents need to be defeated one after the other. Points are scored by throwing the axe into the goal area behind the opponent. This zone is different for each environment. Sometimes there is only a single, large goal area, while another environment has three zones for five, two and five points respectively. In some levels like North Pool the middle part is entirely open, while in others like Mount Olympus the axe can only be thrown through a few open passages.<br><br>The opponent guards these areas and attempts to catch or bounce back the axe to try the same on the other side. A set is won when someone reaches twelve points. The best of three sets wins a match. Special items appear during matches such as stars (use a signature throw different for each character), magnets (increase catching range for five seconds), ice cubes (decrease the opponent's movement speed for a short amount of time) and oil (the axe cannot be caught for five seconds and will bounce back instead, and at a reduced speed). There are counters for some power-ups. For instance, when the signature throw is caught by the opponent, their signature throw becomes active right away.<br><br>The game supports competitive multiplayer against another opponent on the same screen. The game comes in a box with a green cartridge and a full colour manual.\n",
  "publishedBy": "Mega Cat Studios",
  "developedBy": "Mega Cat Studios",
  "released": "Nov 23, 2018",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/log-jammers",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Mega Cat Studios",
          "developer": "Mega Cat Studios",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Nov 23, 2018",
          "ean13": "",
          "comments": "cartridge version (Kickstarter mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}