{
  "name": "Mario's Time Machine",
  "shortName": "marios-time-machine_",
  "description": "Bowser and his minions have traveled through time and have stolen historical artifacts to add to Bowser's museum. While Yoshi was checking out this museum, he was captured by Bowser. Now it's up to Mario to rescue Yoshi and return the stolen objects back to their rightful place. <br><br>The game consists of Mario defeating enemies in a <a href=\"https://www.mobygames.com/game/mario-bros\">Mario Bros</a> style game. Once all the enemies are defeated, they drop a stolen item which Mario needs to pick up. Mario then enters into a Timulator (a time traveling machine) and warps to the player's selected time period. The selected time period is basically a small side-scrolling area where Mario has to find the correct location to drop the current item he is holding. If Mario drops the item in the wrong location or the wrong time period, it will be taken away and Mario will have to restart the item collection process all over again. This side-scrolling section also holds the educational aspect of the game as Mario can jump into message blocks and learn factoids about the time and location he is currently in.<br><br>The game will have Mario returning fourteen items (one for each time period) before he will be made to take a history exam about the knowledge he has gained from all this item gathering. Once that's finished Mario will finally be able to confront Bowser and rescue Yoshi.",
  "publishedBy": "Software Toolworks, Inc., The",
  "developedBy": "Radical Entertainment Inc.",
  "released": "Jun, 1994",
  "alsoFor": "",
  "genre": "Educational",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/marios-time-machine_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Software Toolworks, Inc., The",
          "developer": "Radical Entertainment Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jun, 1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/64302-mario-s-time-machine-nes-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/64301-mario-s-time-machine-nes-screenshot-inside-bowser-s-museum.png",
      "caption": "Inside Bowser's museum."
    },
    {
      "link": "/images/shots/l/64304-mario-s-time-machine-nes-screenshot-play-the-arcade-classic.png",
      "caption": "Play the arcade classic to access the different ages."
    },
    {
      "link": "/images/shots/l/64305-mario-s-time-machine-nes-screenshot-hitting-blocks-gives-you.png",
      "caption": "Hitting blocks gives you information about the current period."
    },
    {
      "link": "/images/shots/l/64303-mario-s-time-machine-nes-screenshot-landmarks-may-not-be-to.png",
      "caption": "Landmarks may not be to exact scale."
    }
  ],
  "cover": []
}