{
  "name": "Mario is Missing!",
  "shortName": "mario-is-missing",
  "description": "Bowser, the token bad guy from the Mario Bros. series, is up to no good again in this educational game designed to teach children geography. This time he's set up his headquarters in Antarctica and created portals to 25 famous cities around the world, so that his Koopas can wreak havoc in our own world. He's also kidnapped Mario, hence the title of this game. You play as Luigi who must foil Bowser's plans by entering through each of the portals, tracking down the Koopas who have stolen famous artifacts, and looking for clues about your location. Once you've set everything right and determined where you are, you call Yoshi on your Globulator so he can track you down. You need Yoshi's help to eat the Pokey (a cactus-like creature) that's guarding the return portal, and when Luigi returns he can close the portal forever.<br><br>By exploring these 25 cities, children can familiarize themselves with the landmarks and artifacts that each city has. When Luigi returns the stolen artifacts to the proper places he can even take photographs of them. There is also an add-on disk you can purchase that adds ten additional cities to the game.",
  "publishedBy": "Software Toolworks, Inc., The",
  "developedBy": "Radical Entertainment Inc.",
  "released": "1993",
  "alsoFor": "DOS, Macintosh, SNES | Combined View",
  "genre": "Educational",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/mario-is-missing",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Software Toolworks, Inc., The",
          "developer": "Radical Entertainment Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/50841-mario-is-missing-nes-screenshot-well-if-mario-is-missing-i.png",
      "caption": "Well... if Mario is Missing, I guess it's all up to Luigi then..."
    },
    {
      "link": "/images/shots/l/50842-mario-is-missing-nes-screenshot-this-is-what-gameplay-looks.png",
      "caption": "This is what gameplay looks like... a lone plumber on a city street. If you know where you are, you can call Yoshi to give you a ride for faster speeds!"
    },
    {
      "link": "/images/shots/l/50847-mario-is-missing-nes-screenshot-one-way-to-find-out-where-you.png",
      "caption": "One way to find out where you are is to ask people about it"
    },
    {
      "link": "/images/shots/l/50848-mario-is-missing-nes-screenshot-this-is-what-the-world-looks.png",
      "caption": "This is what the world looks like. There's only so many locations you'll end up."
    },
    {
      "link": "/images/shots/l/50846-mario-is-missing-nes-screenshot-each-of-these-cities-has-had.png",
      "caption": "Each of these cities has had their tourist attractions gone missing! Naturally you'll have to find them..."
    },
    {
      "link": "/images/shots/l/50844-mario-is-missing-nes-screenshot-a-suspicious-looking-koopa.png",
      "caption": "A suspicious looking koopa nearby. And he was just jaywalking. Better jump on his head!"
    },
    {
      "link": "/images/shots/l/50845-mario-is-missing-nes-screenshot-a-map-of-each-city-will-help.png",
      "caption": "A map of each city will help you get your bearings and find koopas as well as tourist attractions"
    },
    {
      "link": "/images/shots/l/50866-mario-is-missing-nes-screenshot-this-is-your-inventory-where.png",
      "caption": "This is your inventory where you collect art, valuables and entire buildings. Basically whatever was stolen from the cities."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/246802-mario-is-missing-nes-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "NES"
    }
  ]
}