{
  "name": "Nintendo Campus Challenge 1991",
  "shortName": "nintendo-campus-challenge-1991",
  "description": "The <i>Nintendo Campus Challenge 1991</i> was held at 58 college campuses or spring break locations, and also at the 1991 Consumer Electronics Show. Competitors could play NES and Game Boy games throughout the day to achieve the highest score. The players with the highest scores were then flown to Disney World in Orlando, Florida, USA over the New Year's weekend to compete further.<br><br>At this competition, players played a special cartridge made just for this event. The cartridge consisted of three games. Player must first gather 25 coins in <a href=\"https://www.mobygames.com/game/nes/super-mario-bros-3\">Super Mario Bros. 3</a>. Next, they must get 100,000 points in <a href=\"https://www.mobygames.com/game/pin-bot\">Pin*Bot</a>. Lastly, players play <a href=\"https://www.mobygames.com/game/nes/dr-mario\">Dr. Mario</a> to get what score they can in the remaining time.<br><br>The scores are then tallied up with the following formula: The <i>Super Mario Bros. 3</i> score is multiplied by 10, then it gets added to the <i>Pin*Bot</i> score,  then the <i>Dr. Mario</i> score is multiplied by 100 and gets added together with the other scores which results in the final score. The top six players then played a second round, then the top two players of the previous round played a head-to-head final battle.",
  "publishedBy": "Nintendo of America Inc.",
  "developedBy": "",
  "released": "1991",
  "alsoFor": "",
  "genre": "Compilation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/nintendo-campus-challenge-1991",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Nintendo of America Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/609799-nintendo-campus-challenge-1991-nes-screenshot-title-screen.png",
      "caption": "Title Screen"
    }
  ],
  "cover": []
}