{
  "name": "Pictionary: The Game of Video Quick Draw",
  "shortName": "pictionary-the-game-of-video-quick-draw",
  "description": "Based on the board game, the object is to guess either a word or phrase based on a drawing. Each team starts on the same square on the board and the first team attempts to draw a picture based on a clue.  If his team correctly guesses the clue, then this team gets to roll the dice and advance along the board.  If the team fails to guess correctly, then the other team gets a chance to draw and guess. The game plays much in this way until a team reaches the final square on the board and successfully guesses the clue to win the game.<br><br>This game contains three different modes; regular game, alternative game, and drawing practice. It also allows for up to four teams which can be made comprising of any number of players per each team. <br><br>In the regular game, a team will be given a turn to start revealing pieces of one of the 500+ drawings that are hidden in the game. Each drawing is a 6x8 size and has 48 pieces to it. To reveal the pieces, the player is made to play one of four timed minigames which are chosen depending on the color of the square the player landed on the board. The minigames consist of Attack of the Paint Zombies, The WareHouse Shuffle, Leapin' Energy Capsules!, and Four Alarm Rescue. In Attack of the Paint Zombies the player fires downwards at the aliens and the more aliens that are hit the more pieces that are revealed of the drawing. If the aliens hit the player, the player loses time off the clock. In The WareHouse Shuffle, the player goes all the way to the left side and then stacks as many boxes on top of each other that they can bring over all the way to the right side. While transporting the boxes, their are two enemies who can hit into your boxes thus subtracting them from the haul and also taking time away. Each box brought over reduces a piece of the hidden drawing. In  Leapin' Energy Capsules!, the player is an astronaut and is moving and jumping to collect blue spheres. While collecting the spheres the player must try to avoid hitting any enemies which will reduce time. Each sphere collected clears up another piece of the drawing. In Four Alarm Rescue, the player controls a pair of firemen on the ground with a net who are moving back and forth catching the jumping people above on the net. Each person rescued leads a revealed piece of the drawing while each person not rescued leads to reduced time.<br><br>The alternative game allows the player to draw the picture for other players to guess, so their are no minigames in this mode. Other than that, it is the same as the regular mode.<br><br>Drawing practice lets the player practice their drawing technique without the pressure of a timer.",
  "publishedBy": "LJN Toys, Ltd.",
  "developedBy": "Software Creations Ltd.",
  "released": "Jul, 1990",
  "alsoFor": "",
  "genre": "Action, Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/pictionary-the-game-of-video-quick-draw",
  "visual": "Isometric",
  "gamePlay": "Board game, Mini-games, Party game, Shooter",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "LJN Toys, Ltd.",
          "developer": "Software Creations Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jul, 1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/306067-pictionary-the-game-of-video-quick-draw-nes-screenshot-title.gif",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/306068-pictionary-the-game-of-video-quick-draw-nes-screenshot-main.gif",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/306069-pictionary-the-game-of-video-quick-draw-nes-screenshot-select.gif",
      "caption": "Select # of teams"
    },
    {
      "link": "/images/shots/l/306070-pictionary-the-game-of-video-quick-draw-nes-screenshot-of.gif",
      "caption": "# of players per team, either one or more"
    },
    {
      "link": "/images/shots/l/306071-pictionary-the-game-of-video-quick-draw-nes-screenshot-entering.gif",
      "caption": "Entering team names"
    },
    {
      "link": "/images/shots/l/306072-pictionary-the-game-of-video-quick-draw-nes-screenshot-announcing.gif",
      "caption": "Announcing whose turn it is"
    },
    {
      "link": "/images/shots/l/306073-pictionary-the-game-of-video-quick-draw-nes-screenshot-kick.gif",
      "caption": "Kick the blue balls to reveal pieces of the puzzle"
    },
    {
      "link": "/images/shots/l/306074-pictionary-the-game-of-video-quick-draw-nes-screenshot-bring.gif",
      "caption": "Bring as many crates as possible to the right side to reveal pieces of the puzzle"
    },
    {
      "link": "/images/shots/l/306075-pictionary-the-game-of-video-quick-draw-nes-screenshot-catch.gif",
      "caption": "Catch as many people as possible to reveal pieces of the puzzle"
    },
    {
      "link": "/images/shots/l/306076-pictionary-the-game-of-video-quick-draw-nes-screenshot-moby.gif",
      "caption": "Space Invaders turned upside down"
    },
    {
      "link": "/images/shots/l/306077-pictionary-the-game-of-video-quick-draw-nes-screenshot-the.gif",
      "caption": "The player has a limited amount to figure out what the drawing is"
    },
    {
      "link": "/images/shots/l/306078-pictionary-the-game-of-video-quick-draw-nes-screenshot-giving.gif",
      "caption": "Giving the correct answer"
    },
    {
      "link": "/images/shots/l/306079-pictionary-the-game-of-video-quick-draw-nes-screenshot-the.gif",
      "caption": "The game gives instructions on how to roll the dice"
    },
    {
      "link": "/images/shots/l/306080-pictionary-the-game-of-video-quick-draw-nes-screenshot-the.gif",
      "caption": "The dice has been rolled"
    },
    {
      "link": "/images/shots/l/306081-pictionary-the-game-of-video-quick-draw-nes-screenshot-moving.gif",
      "caption": "Moving spaces on the board"
    },
    {
      "link": "/images/shots/l/306082-pictionary-the-game-of-video-quick-draw-nes-screenshot-the.gif",
      "caption": "The player draws their own picture in the alternative game mode"
    }
  ],
  "cover": []
}