{
  "name": "Space Shuttle Project ",
  "shortName": "space-shuttle-project-",
  "description": "The Launch Director has assigned a Commander to take control of several NASA Space Launches to do some necessary jobs in space. It is the commander’s job to do all the pre-launch activities like fuelling the space ship and making sure all the crew are on safely and making sure all the post-launch activities are carried out like the rocket and fuel tank separation as well as the successful landing of the shuttle. The commander is also responsible for the extravehicular activities in space such as launching a satellite and building a space station.<br><br><i>Space Shuttle Project</i> simulates a Space Shuttle mission from pre-launch to landing. After writing in a name, the player is presented with a mini game that requires the player to memorise numbers and a space shuttle name to get pass security. After security the space shuttle project is split into four different stages each with there own challenges as follows:<ul>\n<li><b>Stage 1 - Fuel and Board Shuttle:</b> This stage requires the commander to use the lift to turn the oxygen and hydrogen switches on and open the shuttle doors. Then the commander must move down and up the lift picking up the crew needed for the mission (increases as the levels get harder) while avoiding sliders that cross in lift’s path. This task has to be done within the time limit.</li><br>\n<li><b>Stage 2 - Space Shuttle Launch:</b> This stage requires the commander to control the space shuttle into orbit while disconnecting the rocket boasters (SRB) and the external tank (ET). All this is controlled by playing two mini-games that require the player to ether stop the power bar at the correct point or by moving the bottom arrow left and right to match the movements of the top arrow. A third mini-game is added later that requires the player to memorize the correct combination</li><br>\n<li><b>Stage 3 - Extravehicular Activities:</b> The activities that are competed in space vary depending on the mission. Mission 1 requires the commander to release a satellite into space navigating it to avoid all the other moving satellites that are littered though space. Missions 2, 4, and 6 requires the commander to build a part of a space station by grabbing a block from the shuttle and moving it into the correct part of the space station while avoiding satellites and making sure the oxygen levels don’t run out. Mission 3 requires to move and from a damaged satellite avoiding space rocks and repair it. Mission 5 is like mission 3 but to rescue a stranded Soviet cosmonaut.</li><br>\n<li><b>Stage 4 - Reenter Atmosphere and Land:</b>This stage requires the commander to control the ship into reentry and land the space shuttle on a landing strip. The mini-games are the same as the space shuttle launch expect the D-pad is used for stopping the power bar.</li></ul>There are 6 different missions with each mission a being more difficult than the last and only five fails allowed before the whole mission fails. Password save is available by adding the supplied password numbers and space shuttle name instead of the memorized numbers at the security check. ",
  "publishedBy": "Absolute Entertainment, Inc.",
  "developedBy": "Imagineering Inc.",
  "released": "Oct, 1991",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/space-shuttle-project-",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Absolute Entertainment, Inc.",
          "developer": "Imagineering Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct, 1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/300335-space-shuttle-project-nes-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/300336-space-shuttle-project-nes-screenshot-remembering-the-numbers.png",
      "caption": "Remembering the numbers it gave me earlier. This doubles as a password screen."
    },
    {
      "link": "/images/shots/l/300337-space-shuttle-project-nes-screenshot-stage-1-checklist-all.png",
      "caption": "Stage 1 checklist. All that has to be done in 40 seconds."
    },
    {
      "link": "/images/shots/l/300339-space-shuttle-project-nes-screenshot-oxygen-on-check-hydrogen.png",
      "caption": "Oxygen On &hellip; check, Hydrogen On &hellip; check, Opening door &hellip; on it now."
    },
    {
      "link": "/images/shots/l/300340-space-shuttle-project-nes-screenshot-stage-2-checklist-good.png",
      "caption": "Stage 2 checklist. Good thing you don&rsquo;t need to understand it."
    },
    {
      "link": "/images/shots/l/300341-space-shuttle-project-nes-screenshot-inside-the-cockpit-ready.png",
      "caption": "Inside the cockpit ready for launch 10&hellip;9&hellip;"
    },
    {
      "link": "/images/shots/l/300342-space-shuttle-project-nes-screenshot-3-2-1-launch.png",
      "caption": "3&hellip;2&hellip;1&hellip;Launch"
    },
    {
      "link": "/images/shots/l/300344-space-shuttle-project-nes-screenshot-have-to-keep-the-bottom.png",
      "caption": "Have to keep the bottom arrow (players) as close to the top arrow (computer) as possible."
    },
    {
      "link": "/images/shots/l/300343-space-shuttle-project-nes-screenshot-stopping-the-bar-on-the.png",
      "caption": "Stopping the bar on the top at the right spot to separate the rockets."
    },
    {
      "link": "/images/shots/l/300345-space-shuttle-project-nes-screenshot-don-t-worry-it-s-meant.png",
      "caption": "Don&rsquo;t worry, it&rsquo;s meant to be upside down, better view of the earth that way."
    },
    {
      "link": "/images/shots/l/300346-space-shuttle-project-nes-screenshot-now-that-we-are-in-space.png",
      "caption": "Now that we are in space ready for Stage 3."
    },
    {
      "link": "/images/shots/l/300347-space-shuttle-project-nes-screenshot-all-those-many-little.png",
      "caption": "All those many little satellites to avoid as I move this big satellite around space."
    },
    {
      "link": "/images/shots/l/300348-space-shuttle-project-nes-screenshot-now-that-is-done-ready.png",
      "caption": "Now that is done ready to come back. Stage 4."
    },
    {
      "link": "/images/shots/l/300349-space-shuttle-project-nes-screenshot-playing-the-mini-game.png",
      "caption": "Playing the mini-game like before to move the space shuttle into position for re-entry."
    },
    {
      "link": "/images/shots/l/300350-space-shuttle-project-nes-screenshot-coming-down-the-screen.png",
      "caption": "Coming down. The screen flashes madly at this point."
    },
    {
      "link": "/images/shots/l/300351-space-shuttle-project-nes-screenshot-and-land-safely-on-the.png",
      "caption": "And land safely on the ground with a mini-game like before to stop."
    },
    {
      "link": "/images/shots/l/300352-space-shuttle-project-nes-screenshot-it-even-gets-a-mention.png",
      "caption": "It even gets a mention in the local newspaper, &ldquo;The Nintendo Times&rdquo;"
    },
    {
      "link": "/images/shots/l/300353-space-shuttle-project-nes-screenshot-mission-2-starts-at-night.png",
      "caption": "Mission 2 starts at night."
    },
    {
      "link": "/images/shots/l/300354-space-shuttle-project-nes-screenshot-mission-2-building-the.png",
      "caption": "Mission 2 building the space station. Need to miss the satellites while putting the blocks in the right place."
    },
    {
      "link": "/images/shots/l/300355-space-shuttle-project-nes-screenshot-not-such-a-good-landing.png",
      "caption": "Not such a good landing, at least the crew is safe. "
    }
  ],
  "cover": []
}