{
  "name": "Super Maruo",
  "shortName": "super-maruo",
  "description": "Despite the title, <i>Super Maruo</i> has absolutely nothing to do with Nintendo's mascot Mario. This game is believed to be the first unlicensed cartridge for the Nintendo Famicom, and also the first adult title for the system. In the game, you control a short man similar in stature to Mario. You are chasing a woman, who is apparently playing &quot;hard to get.&quot; Your goal is impeded by a dog, who runs around, following your movement, trying to block your way. When &quot;Maruo&quot; finally catches the woman, an animation of her stripping is played. The game then resumes, only now neither the woman nor &quot;Maruo&quot; are wearing any clothes. When he catches her again, a looping animation of the two having sex plays (a very simple animation of the woman being penetrated by a disembodied penis). When you press a button, gameplay starts again. The next strip scene is always the same, but there are four different sex scenes (including the first). After the last sex scene, the entire game is repeated until the player turns off the system.",
  "publishedBy": "",
  "developedBy": "",
  "released": "Dec, 1986",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/super-maruo",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/734093-super-maruo-nes-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/734094-super-maruo-nes-screenshot-chasing-the-girl.png",
      "caption": "Chasing the girl."
    },
    {
      "link": "/images/shots/l/974105-super-maruo-nes-screenshot-caught-her.png",
      "caption": "Caught her"
    },
    {
      "link": "/images/shots/l/974106-super-maruo-nes-screenshot-running-around-in-the-buff.png",
      "caption": "Running around in the buff"
    }
  ],
  "cover": []
}