{
  "name": "Yun",
  "shortName": "yun",
  "description": "<i>Yun</i> is a 2D platform game starring the eponymous character. She is a demon who, in a rare occurrence, hatched out of an egg of the rare Romani Heron in the boggy marsh near of the shores of Lake Potoña in the Province of Badajoz. As a newborn and in the dark as she was born at dusk, she ate the first things she found in her surroundings, which happened to include a tube of toothpaste carelessly thrown away. This provided her with the ability to blow bubbles from her mouth, which she developed to capture animals inside. Just a few months later she founded her own Japanese restaurant near the marsh. One night she was about to capture a big and shiny orange fugu fish, but falls in love with it. Unfortunately the fish knew about her profession and escaped. A dejected Yun decides to change her ways: instead of serving raw fish to customers, she will serve customers to raw fish.<br><br>The game contains three levels that consist of single-screen rooms connected both horizontally and vertically using the flip-screen mechanic offering freedom to explore in any direction. To complete a level Yun needs to capture all creatures she can find to fill her restaurant's pantry. The three environments are the marsh woods, an abandoned factory and finally a desert. Yun can blow up to three bubbles one after another. After they are launched they rise automatically, either disappearing from the screen or hovering below an obstacle until they disappear. Yun can use her own bubbles as a platform to reach higher places. The creatures need to be captured that way as well: once trapped Yun can simply touch them to make them disappear. The game shows how many creatures are left to be found.<br><br>Yun has a limited amount of lives and any collision with a creature, a hazard such as spikes, or an invincible ghost that chases her around the screen, costs a life. Extra lives are provided through giant red hearts. Certain passages are locked and first require a key to progress. Once all creatures has been captured the level ends right away. A lot of sections require careful platforming.<br><br>The game was started as a NES port of <a href=\"https://www.mobygames.com/game/cheril-perils\">Cheril Perils</a>, but was turned into a separate game during development.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Jul 08, 2016",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nes/yun",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "NES",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jul 08, 2016",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/981456-yun-nes-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/981457-yun-nes-screenshot-a-short-instruction-before-starting-the.png",
      "caption": "A short instruction before starting the game"
    },
    {
      "link": "/images/shots/l/981458-yun-nes-screenshot-the-first-of-three-levels.png",
      "caption": "The first of three levels"
    },
    {
      "link": "/images/shots/l/981459-yun-nes-screenshot-a-monkey-appears-from-the-background-to.png",
      "caption": "A monkey appears from the background to attack Yun."
    },
    {
      "link": "/images/shots/l/981460-yun-nes-screenshot-dangerous-spikes-and-a-moving-platform.png",
      "caption": "Dangerous spikes and a moving platform"
    },
    {
      "link": "/images/shots/l/981461-yun-nes-screenshot-here-is-a-heart-for-an-extra-life.png",
      "caption": "Here is a heart for an extra life."
    },
    {
      "link": "/images/shots/l/981462-yun-nes-screenshot-the-invincible-ghost-guarding-a-key.png",
      "caption": "The invincible ghost guarding a key."
    },
    {
      "link": "/images/shots/l/981463-yun-nes-screenshot-you-cannot-get-through-here-find-a-way.png",
      "caption": "You cannot get through here, find a way around."
    },
    {
      "link": "/images/shots/l/981464-yun-nes-screenshot-yun-uses-one-of-her-own-bubbles-to-rise.png",
      "caption": "Yun uses one of her own bubbles to rise to the top of the screen."
    },
    {
      "link": "/images/shots/l/981465-yun-nes-screenshot-game-over.png",
      "caption": "Game Over"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/584161-yun-nes-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "NES"
    }
  ]
}