{"altername_name": [], "name": "Los Amores de Brunilda", "overview": "The official launching of Los amores de Brunilda game by Retroworks, in cooperation with bitvision (Fernando Manuel García), is already a reality. Technically, this new production excels in every aspect, and it is not surprising taking into account the staff involved. Right now you can download the game for free at Retroworks' site, but the team is already working on a physical format, and they will share more details next week. Some game features: *The original ZX game had a great scripting engine which has been adapted and upgraded for this version. *Screen 5, 8 by 8 scroll tiles, based on 16×16 tile set. The speed comes from double buffer & cache to refrain from constantly redraw the whole screen. It uses software sprites and some background animations (fire, water, etc). *Combat stages use hardware sprites. *Two 16 color palettes during game play. Upper half and lower half, respectively. *The menu screen has two different graphic modes, SC5 & SC3 with multiple screens-splits, dynamic palette and vertical scroll hardware use. *Several different languages included into the game. Nelo & Quqo language changes the main characters and they way of speaking. *If certain Retroworks games are found in other cartridge slot, certain Easter eggs will be activated... *The game has a password system to continue your game, just like the original ZX version, but now you’re able to save the game into the original game-cartridge and the default selected language. Music has been rewritten in order to be played on SCC + PSG, resulting in richer music. *The music replayer is not standard. A new, specific one has been developed in order to have really optimized all the CPU time spent on playing the background music. *High resolution opening 512x424x16. *Very improved and colorful MSX2 graphics. *Game VDP interrupts go for 60Hz, 50Hz during game menu. Would you like to embark on an adventure and feel the experience of the old RPG games again? Now is your chance!", "platform": "Microsoft MSX2", "release_date": "2019", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "retroworks", "publishers": "Retroworks", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163422-los-amores-de-brunilda\n"}