{"altername_name": [], "name": "Puyo Puyo", "overview": "The main game of Puyo Puyo is played against at least one opponent, computer or human. The game itself has three modes, Single Puyo Puyo, Double Puyo Puyo, and Endless Puyo Puyo. In Single mode, the player takes on the role of Arle Nadja, a 16-year-old female spellcaster that has the pleasure of foiling Satan's plans. Satan wishes to take over the world, and Arle stands in his way. Arle must first however battle her way through 12 opponents before facing Satan, and unlike Dr Robotnik's Mean Bean Machine, with the exception of Rulue, they are not under Satan's control, nor were they created by him (for Rulue, she fell in love with him). Once Arle has beaten Satan, the world is saved, so she can return home. As in all main Puyo games, the story mode consists of playing Puyo matches against a fixed sequence of characters in one of three courses. In Double mode, two players play against each other. In exactly the same fashion as before, by out-chaining one another, the player tries to fill up their opponent's grid. Since the rules of sending so many garbage blocks made games short-lived, no matter how many chains are sent, Compile added the rule of Sousai in Puyo Puyo TSU and onwards. This lets players counter opponents' attacks with chains of their own, sending any garbage blocks back to them as a result of overflow. In endless mode, the player must continually match puyos to get the highest score they can. In Mission mode, the player must complete 52 missions requiring the Puyos on the field to be eliminated by using limited pieces", "platform": "Microsoft MSX2", "release_date": "October 25, 1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Compile", "publishers": "Tokuma Shoten Intermedia", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Puyo_Puyo_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33449-puyo-puyo\n"}