{"altername_name": [], "name": "Shiryou Sensen 2: War of the Dead Part 2", "overview": "It's set some years after the incident in the first game (where Lila managed to avert a portal into hell consuming the whole world), and terrorists have targeted the industrial city of Sun Dorado. The recently completed Keel Nuclear Power Plant has been taken over, and S-SWAT are tasked with handling the situation. Except as Lila (now promoted to Lieutenant) points out in the intro, why send in the Supernatural SWAT squad to deal with common terrorists? As the Chief reveals, they've found strange creatures in sewers - creatures not of this world, but from Hades (the other dimension in the first game), meaning whoever was behind the previous crisis is behind this one. What survivors remain are barricading themselves indoors. The city has been cordoned off and Lila is the prime candidate for the mission. So off she sets, with four fellow S-SWAT members, to regain control. This sequel has undergone radical changes from the original, with all of the RPG trappings stripped out. There's no longer any kind of stats, menu system to navigate, day/night cycle, overworld map, or weapon recovery items. In fact the only items are drugs, which restore health to maximum and only one can be carried at a time, and key items with further the story. The biggest (and arguably best) change is the combat: there are no longer any random battles. Taking place on a series of massively sprawling maps, as opposed to shrunken JRPG-style maps which warp you to new maps when entering buildings, all enemies can be seen immediately. Furthermore you never fight more than a single enemy at a time. If there's something hostile in a new area, you can see his health bar at the bottom. In a lot of ways it closely resembles the original Metal Gear, except more sedate and with greater emphasis on NPC dialogue.", "platform": "Microsoft MSX2", "release_date": "January 1, 1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Victor Interactive Software", "publishers": "Victor Interactive Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33522-shiryou-sensen-2-war-of-the-dead-part-2\n"}