{"altername_name": [], "name": "Shiryou Sensen: War of The Dead", "overview": "Due to mysterious circumstances, a flourishing city called Chinese Hill was cut off the rest of the world. Investigators found out that most of the buildings were destroyed, horrifying creatures are roaming the wilderness, and the few survivors have no means of escaping. The SSWAT (Supernatural Special Weapon Attack Team) sends an agent named Laila to the city. The young woman has powerful psychic abilities, which can enhance her firearms, helping her deal with the monsters. She must rescue the survivors and escort them to safety, at any cost... Shiryo Sensen - War of the Dead is an action game with slight RPG elements. The player navigates Laila over the top-down \"world map\": the ruined city has basically turned into large wilderness areas with a few buildings that are represented by icons on the map and can be explored. Enemies attack randomly. The battles take place on separate side-scrolling screens, and are fully action-based. Laila can jump, duck, and attack with melee or weapons or firearms (which require ammunition). Typically there are several enemies on the screen; Laila escapes the battle if she reaches the end of the short side-scrolling area. The goal of the game is to find and rescue the few survivors trapped in the buildings infested by enemies. Laila has to bring these survivors back to the church. Even though the map is almost completely open to the player (especially after Laila acquires a boat, which makes the world fully explorable), the rescuing must be completed in a linear fashion, by talking to characters in different buildings and receiving clues. The game has a day/night cycle; Laila can sleep at any time, which will restore a portion of her health.", "platform": "Microsoft MSX2", "release_date": "1987", "game_type": "", "esrb": "Not Rated", "developers": "Fun Project", "publishers": "Victor Musical Industries", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=CtaKjYvuueQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33523-shiryou-sensen-war-of-the-dead\n"}