{"altername_name": [], "name": "Xak II: Rising of the Red Moon", "overview": "Xak II: Rising of the Redmoon is a fantasy role-playing video game developed and published by the Japanese software developer MicroCabin. It is a direct sequel to Xak: The Art of Visual Stage (Xak I). The game was released in Japan only, but due to an MSX scene that arose in Europe (predominately in the Netherlands region) some of the MSX versions of Xak received fan translations. An enhanced remake was later released for the NEC PC-Engine, together with the first game in the series Xak as Xak I & II by Telenet Japan's development team Riot. Xak II, being a direct sequel to the first game in the series, it features the same high fantasy setting as Xak. The gods' division of the world into Xak, the world of men, Oceanity, the world faeries, and Xexis, the world of demons, as referenced in Xak, is depicted in this game's introduction. In this adventure, the main hero of the Xak series, Latok Kart is exploring a vast region situated around a single central village of Banuwa. In Xak, the protagonist Latok Kart fought and defeated the demon Zemu Badu. One of Badu's minions escaped, a black-robed man known only as Necromancer. Three years later, Necromancer is able to contact one of his allies from the demon world of Xexis: a fearsome demon called Zamu Gospel. Following a prophecy foretold by an ancient and extremely powerful sorcerer by the name of Amadok, the Necromancer and three other demons (referred to as Demonlords) are attempting to complete a dark ritual which will revive Zamu Gospel into the world of Xak. The player once again controls Latok, now nineteen years of age. A rumour about the whereabouts of Latok's father Dork has surfaced around the village of Banuwa. Latok and his faerie companion Pixie travel to the village to investigate, but soon run into Gospel's minions. (Wikipedia)", "platform": "Microsoft MSX2", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Microcabin", "publishers": "Microcabin", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/101926-xak-ii-rising-of-the-red-moon\n"}