{"altername_name": [], "name": "Xak: The Art of Visual Stage", "overview": "Xak: The Art of Visual Stage (サーク) is the first game in the fantasy role-playing video game series Xak developed and published by Micro Cabin. An English translation of Xak: The Art of Visual Stage was also released in 2007 on the now-defunct retro gaming service WOOMB.net, and is now to become available on Project EGG. Xak: The Art of Visual Stage features a typical high fantasy setting. According to the game world's legends, a great war was fought between the benevolent but weakening ancient gods and a demon race, which led to the collapse and eventual mortality of the gods. After this 'War of Sealing', the gods divided the world into three parts: Xak, the world of humans, Oceanity, the world of faeries, and Xexis, the world of demons. The demon world of Xexis was tightly sealed from the other two worlds as to prevent reentry of the warmongering demon race. Some demons were left behind in Xak, however, and others managed to discover a separate means to enter Xak from Xexis anyway. This ancient history is displayed in the introduction of Xak II. One of them, Badu, was a very powerful demon, able to use coercive magic to make humans do his bidding. Duel, the god of war, managed to defeat Badu and seal him away in a mountain of ice for 250 years. The god later settled in a village known as Fearless to live out the rest of his mortal life. At the beginning of the game, Badu's prison is broken. Demons overrun parts of Xak once again. In order to stop the ravaging of his lands, the King of Wavis sends a messenger faerie to Dork Kart, a famous warrior living in the village of Fearless. Dork, however, has gone missing. The player takes on the role of Latok Kart, Dork's 16-year-old son, as he meets the messenger faerie, Pixie. Latok embarks on the King's quest to slay Badu, hoping to find his father along the way. In his travels, Latok is guided by Duel's spirit. Over the course of the game, it turns out that Dork and thus Latok is a descendant of Duel.", "platform": "Microsoft MSX2", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Microcabin", "publishers": "Microcabin", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102001-xak-the-art-of-visual-stage\n"}