{
  "name": "Abyss",
  "shortName": "abyss____",
  "description": "<i>Abyss</i> is a trading strategy game, created for the &quot;NOMAM Basic Ten-Liners 2014&quot; competition. The entire code, written in the Turbo Basic XL language, is 10 lines long. <br><br>The end of the universe is coming. Of course, as a space trader, you are concerned solely with earning as much money as possible before the Armageddon arrives on day 1000. You can fly your ship around the galaxy, with 10 colonized planets, plenty of uninhabited planets, and black holes which keep appearing. <br><br>You begin the game with 150$ and with your cargo hold empty, except for fuel. Money can be earned by buying and selling various wares on the planets (but you can only sell wares to planets where there is demand), as well as by completing missions - get to a specified planet before a specified day to receive a cash reward. One of the wares - ore - can be also acquired by landing on uninhabited planets. <br><br>The ship's cargo hold has a limited capacity, but can be expanded for a hefty price. Flying around space consumes fuel; being low on fuel prevents you from mining ore, and running out of fuel causes a game over. Black holes are also dangerous, as they destroy parts of the cargo hold, and escaping them consumes a lot of fuel. ",
  "publishedBy": "",
  "developedBy": "",
  "released": "Mar 07, 2014",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/abyss____",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "https://www.mobygames.com/images/shots/l/698165-abyss-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/698166-abyss-atari-8-bit-screenshot-space-letters-are-civilized-planets.png",
      "caption": "Space. Letters are civilized planets, dots are uninhabited planets. Fuel counter, day counter, and the description of an available mission are displayed. "
    },
    {
      "link": "/images/shots/l/698168-abyss-atari-8-bit-screenshot-low-on-fuel.png",
      "caption": "Low on fuel"
    },
    {
      "link": "/images/shots/l/698169-abyss-atari-8-bit-screenshot-trading.png",
      "caption": "Trading"
    }
  ],
  "cover": []
}