{
  "name": "Bug Attack",
  "shortName": "bug-attack",
  "description": "<i>Bug Attack</i> is a colorful shoot-em-up where you are assaulted by dagger-throwing millipedes, ants, and med flies. The game looks similar to the arcade game Centipede, but plays quite differently. <br><br>In the first waves, you are a spider in a desert surround by cacti. First the ants come at you, wandering back and forth randomly between the cacti and chucking daggers at you if you get under them. If you dispatch the ants, you get to fight the millipede, which advances row by row, not stopping for anything including the plants (or your spider). It also throws daggers from time to time as it advances. The third wave pits you against the deadly med flies, which dance in a line around the screen. If you don't shoot them fast enough, they start to break off from the group, dancing wildly and raining daggers down upon you. Finish this last wave and you get bonus points for the amount of fuel you have left and get treated to a small interlude where a chorus of bugs sings to you as a med fly pollinates a flower.<br><br>The second and third levels are similar to the first, except that they are tougher. The second wave takes place in a clover patch and the third wave puts you in the flower garden. The second and third waves also have tough bonus levels at the end. Once you finish the flower garden you begin all over again back in the desert, but the enemy is much more numerous and difficult this time around. ",
  "publishedBy": "Cavalier Computer",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "Apple II, FM-7, PC-88 | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/bug-attack",
  "visual": "",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Cavalier Computer",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/629435-bug-attack-atari-8-bit-screenshot-title-demo.png",
      "caption": "Title demo"
    },
    {
      "link": "/images/shots/l/629433-bug-attack-atari-8-bit-screenshot-stage-1.png",
      "caption": "Stage 1"
    },
    {
      "link": "/images/shots/l/629432-bug-attack-atari-8-bit-screenshot-stage-2.png",
      "caption": "Stage 2"
    },
    {
      "link": "/images/shots/l/629434-bug-attack-atari-8-bit-screenshot-the-player-explodes.png",
      "caption": "The player explodes"
    }
  ],
  "cover": []
}