{
  "name": "Deathworld",
  "shortName": "deathworld",
  "description": "<i>Deathworld</i> is the ninth of Softside Magazine's Adventures of the Month for multiple systems.<br><br>You have been in space for 2 months travelling at a hundred times the speed of light.  Earth has long ago diminished into the vast darkness of the universe and now your journey is about to end.  Your destination is Alpha Beta II, a small planet at the fringe of The Milky Way.  Your compatriots Brent, Reeves, and Jackson ventured to this planet on a mining expedition.  Shortly afterwards, signals and communication ceased.  You have been sent on a solo rescue mission to discover what happened to your lost compatriots.  <br><br>Landing on the alien planet, the player finds the power crystal for their ship damaged.  They must explore the alien landscape, looking for their companions, only to find they have been killed by some alien menace.  During their adventure, they must rescue a friendly blue aliens from captivity, who will follow the player and help them with their quest.  Ultimately, the player must confront the squid-like alien entity that killed the player's companions, and using an electric fence zap the creature into oblivion.  On the voyage back to Earth, the player discovers the cephalopod had made a nest in their spaceship, and is prepared to spread its infestation to another planet.  <br><br>All commands are via 2-word VERB NOUN entries, and game play contains several object puzzles. There is no save and restore feature.",
  "publishedBy": "SoftSide Magazine",
  "developedBy": "",
  "released": "Jan, 1984",
  "alsoFor": "Apple II, DOS, TRS-80 | Combined View",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/deathworld",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "SoftSide Magazine",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jan, 1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/998835-deathworld-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/998836-deathworld-atari-8-bit-screenshot-prologue.png",
      "caption": "Prologue"
    },
    {
      "link": "/images/shots/l/998837-deathworld-atari-8-bit-screenshot-beginning-my-adventure.png",
      "caption": "Beginning my Adventure"
    }
  ],
  "cover": []
}