{
  "name": "Electrician",
  "shortName": "electrician",
  "description": "A colossal earthquake has struck the United States of America, causing blackouts in several buildings across the country. Now it's up to the electrician, Mr. Light, to restore power to several of these buildings.<br><br>The game is broken down into two parts. The first part involves climbing up and down the sides of a building looking for breaks in an electric circuit. Once one is found between floors, the player jumps off the ladder and unspools some wire, making connections for the electric current to go through. Doing this will light up the rooms of the building. Occasionally, this will cause a thief to appear. Capturing this thief will reward the player an item, the most valuable being a bell which will grant the player an extra life. After lighting up all the rooms in the building, the player is free to leave at the exit door at the bottom of the building. <br><br>Being an electrician is a hazardous job though. The player has to be careful not to get bit by any of the insects and animals that also occupy the building. These pests can also chew through wire undoing the players hard work (however, if they bite any live wires they will get zapped). Players also have to be careful not get electrocuted by any of the electric sparks roaming around on the wires. Also, falling from great heights can cost the player a life.<br><br>The second part of the game involves exploring an animal infested underground sewer area in order to find an entrance to the next building. Mr. Light is armed with only a flashlight and his jumping and ducking ability.",
  "publishedBy": "Synapse Software Corporation",
  "developedBy": "Synapse Software Corporation",
  "released": "1984",
  "alsoFor": "NES | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/electrician",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Synapse Software Corporation",
          "developer": "Synapse Software Corporation",
          "ported": "",
          "country": " United States",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1020089-electrician-atari-8-bit-screenshot-introduction.png",
      "caption": "Introduction"
    },
    {
      "link": "/images/shots/l/1020090-electrician-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1020091-electrician-atari-8-bit-screenshot-entering-a-building.png",
      "caption": "Entering a Building"
    },
    {
      "link": "/images/shots/l/1020092-electrician-atari-8-bit-screenshot-avoiding-dangers.png",
      "caption": "Avoiding Dangers"
    },
    {
      "link": "/images/shots/l/1020093-electrician-atari-8-bit-screenshot-i-laid-out-wire-to-a-building.png",
      "caption": "I Laid Out Wire to a Building"
    },
    {
      "link": "/images/shots/l/1020094-electrician-atari-8-bit-screenshot-travelling-in-the-basement.png",
      "caption": "Travelling in the Basement"
    }
  ],
  "cover": []
}