{
  "name": "Embargo",
  "shortName": "embargo_",
  "description": "The citizens of Zorel 6 are under embargo by the Galactic Council.  All trade goods created by the people of Zorel 6 must pass inspection by the Orelian Guards, and only those goods deemed necessary for galactic security are allowed to pass outside the planet.  All other items are dispersed to the Council's burgeoning warehouse. \n To enforce this action, a massive interstellar fleet has positioned itself over Zorel 6, closely monitoring the movement of all goods.  You play as a smuggler, who must sneak between the patrolling Galactic fleet, evade a patrolling robot ship, and attach yourself to cargo before it reached the Council warehouse.  You must then deliver the cargo to an awaiting Vorox transport ship high above the blockade.<br><br>The player must complete progressively more difficult levels featuring more advanced enemy patrols.  Players are awarded points based upon which cargo they recover, and gain an additional ship for every 5000 points gained.  Stage 1 requires recovery of 8 pieces of cargo, and each progressive stage requires 2 more pieces. The player must recover all pieces before they run out of fuel, or they crash. The player will lose a shuttle if they strike any enemy vessel, a building, or are shot.   ",
  "publishedBy": "Gebelli Software, Inc.",
  "developedBy": "Solitare Group",
  "released": "1982",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/embargo_",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Gebelli Software, Inc.",
          "developer": "Solitare Group",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/953197-embargo-atari-8-bit-screenshot-title-screen-with-developer.png",
      "caption": " Title Screen With Developer"
    },
    {
      "link": "/images/shots/l/953198-embargo-atari-8-bit-screenshot-title-screen-with-publisher.png",
      "caption": "Title Screen With Publisher"
    },
    {
      "link": "/images/shots/l/953199-embargo-atari-8-bit-screenshot-gathering-cargo.png",
      "caption": "Gathering Cargo"
    },
    {
      "link": "/images/shots/l/953200-embargo-atari-8-bit-screenshot-starting-stage-3.png",
      "caption": "Starting Stage 3"
    }
  ],
  "cover": []
}