{
  "name": "Ghostbusters",
  "shortName": "ghostbusters",
  "description": "Based on the 1984 film of the same name, the Ghostbusters are the ones to call to &quot;bust&quot; any ghost hauntings. They do this through the use of nuclear-accelerated &quot;proton packs&quot; and &quot;ghost traps&quot;, whereby the ghosts can be captured and transferred to a secure storage facility at their Headquarters. However New York City has suddenly become a very haunted place, and the number of ghosts has suddenly and dramatically increased. The Ghostbusters must reduce the paranormal psychokinetic energy, the &quot;PK level&quot; in the city, which represents ghost power, before the Temple of Zuul awakens and resurrects an evil goddess called Gozer.<br><br><i>Ghostbusters</i> is an action game that features an overhead-view and a side-view. From Ghostbusters HQ, the player must monitor a map of midtown Manhattan for &quot;ghost alarms&quot;, as well as for casual, roaming spirits, and plot a route to the alarmed area. Once the route is plotted, the player then controls the purchased Ghostmobile as it drives through traffic. Here, the player is able to capture casual ghosts on the way if they are en route. When the haunted location is reached, the game switches to a side-view. Two of the Ghostbusters will take position, activate their proton beams, and toss a trap to the ground. The player must then use the two Ghostbusters to attempt to lead the ghost(s) over the placed trap. Once activated, the trap springs to capture any ghosts directly above it. A successful capture will earn the player money, which can then be used to purchase new Ghostbusters vehicles and new modifications for it. An unsuccessful capture will see the ghost fly away (after nastily sliming one of the Ghostbusters).<br><br>As the game progresses, the PK energy in the city increases. The Ghostbusters must keep it under critical levels by being constantly successful at busting ghosts. Eventually the Temple of Zuul will activate, and if the PK levels are still manageable, the Ghostbusters can venture there for a final showdown with Gozer.",
  "publishedBy": "Activision, Inc.",
  "developedBy": "Activision, Inc.",
  "released": "Jan, 1985",
  "alsoFor": "Amstrad CPC, Apple II, Atari 2600, Commodore 64, MSX, NES, PC Booter, SEGA Master System, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/ghostbusters",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Activision, Inc.",
          "developer": "Activision, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jan, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/151056-ghostbusters-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/151057-ghostbusters-atari-8-bit-screenshot-if-you-have-the-ghost.png",
      "caption": "If you have the ghost vacuum, you can vacuum up ghosts you encounter on the driving screen"
    },
    {
      "link": "/images/shots/l/151058-ghostbusters-atari-8-bit-screenshot-buying-a-car-and-outfitting.png",
      "caption": "Buying a car and outfitting it"
    },
    {
      "link": "/images/shots/l/151059-ghostbusters-atari-8-bit-screenshot-city-grid-display-buildings.png",
      "caption": "City grid display, buildings flash when they have a ghost problem"
    },
    {
      "link": "/images/shots/l/151060-ghostbusters-atari-8-bit-screenshot-remember-don-t-cross-the.png",
      "caption": "Remember, don't cross the beams!"
    },
    {
      "link": "/images/shots/l/151061-ghostbusters-atari-8-bit-screenshot-a-slimer-narrowly-escapes.png",
      "caption": "A Slimer narrowly escapes the trap"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/218517-ghostbusters-atari-8-bit-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Atari 8-bit"
    }
  ]
}