{
  "name": "Hotel Alien",
  "shortName": "hotel-alien",
  "description": "<i>Hotel Alien</i> is a science-fiction themed adventure game.<br><br>It happened one starry evening not too long ago.  There was a flying saucer sighting that most people paid little attention to.  Over a period of several weeks, many strange new guests were seen checking in at the Hotel Alien, run by a sweet little old lady who everyone called Grandma.  As time went by, the regular guests checked out of the Hotel and told of strange goings-on inside.  Grandma grew increasingly frightened at the mysterious changes that were taking place, and one night she simply disappeared.  <br><br>The player must explore the 6 floors and basement of the Hotel Alien.  Movement occurs by menu commands, or by moving in the mini-map in the top left of the screen.  The player must explore the rooms of the hotel.  About half of the rooms contain clues to a cryptogram left by Grandma, while the remainder include alien encounters and other interesting rooms.  The player must learn the alien language to communicate with some of the hotel's denizens.  There are also arcade mini-games.  The player can save by visiting their hotel room in room 201.  The goal is to find and rescue Grandma from the aliens.",
  "publishedBy": "Artworx Software Company, Inc.",
  "developedBy": "",
  "released": "1985",
  "alsoFor": "Commodore 64 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/hotel-alien",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Graphic adventure",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Artworx Software Company, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1018599-hotel-alien-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1018601-hotel-alien-atari-8-bit-screenshot-introduction.png",
      "caption": "Introduction"
    },
    {
      "link": "/images/shots/l/1018602-hotel-alien-atari-8-bit-screenshot-visiting-the-lobby.png",
      "caption": "Visiting the Lobby"
    }
  ],
  "cover": []
}