{
  "name": "Jungle Quest",
  "shortName": "jungle-quest",
  "description": "You are code-named Orion, an adolescent agent of ACT (the Adventure Connection Team), summoned straight out of the hallways of your high school by Max Huntington to participate in a mission taking you to the darkest jungles of Africa, to locate and defuse the limitless energies stored in an alien artifact there before sinister competing agents of BRUTE (the Bureau of Random Unlawful Terror and Evil) beat you to it!<br><br>Other members of your team include an archaeologist (&quot;Digger&quot;), an environmental scientist (&quot;Erda&quot;), a nuclear engineer (&quot;Celeste&quot;) and Olano, your guide.  You, of course, are the computer expert, and your skills will be put to the test, typing in included BASIC programs to decrypt secret messages, weigh tolerances, plot courses through labyrinths and calculate necessary angles of deflection.  The abilities of the whole team will be called for to overcome natural obstacles, untrusting natives, the sapping effects of the Devorim Force, BRUTE agents, a traitor in your midst, the perils and traps of the golden lost city containing the artifact, and the deadly artifact itself!<br><br>Though the story shares the dynamic 2nd-person perspective (&quot;You try to talk, but you cannot make a sound&quot;) of Choose-Your-Own-Adventures, the text (like most books) is a non-interactive fixed-rail trip of zero interactivity -- however, some of the type-in programs included offer numerous outcomes, moving into the &quot;game&quot; field what might otherwise be best categorized as an elaborate set-up for low-impact programming exercises.<br><br>An appendix is included describing how to modify the BASIC program listings for greatest compatibility with 10 of the most popular home microcomputer BASICs, as well as describing what each program does and how it works.  Hey!  You got your education in my adventure!",
  "publishedBy": "Scholastic, Inc.",
  "developedBy": "Parachute Press",
  "released": "1984",
  "alsoFor": "Apple II, Commodore 64, DOS, TI-99/4A, TRS-80, TRS-80 CoCo, VIC-20 | Combined View",
  "genre": "Adventure, Educational",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/jungle-quest",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Scholastic, Inc.",
          "developer": "Parachute Press",
          "ported": "",
          "country": " United States",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/68156-jungle-quest-apple-ii-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Book",
      "country": "United States",
      "platforms": "Apple II, Atari 8-bit, Commodore 64, DOS, TI-99/4A, TRS-80, TRS-80 CoCo and VIC-20"
    },
    {
      "link": "/images/covers/l/68157-jungle-quest-apple-ii-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Book",
      "country": "United States",
      "platforms": "Apple II, Atari 8-bit, Commodore 64, DOS, TI-99/4A, TRS-80, TRS-80 CoCo and VIC-20"
    }
  ]
}