{
  "name": "K-razy Kritters",
  "shortName": "k-razy-kritters",
  "description": "Alien kritters are attacking your planet, and only a small number of command ships are available to defend your star-base. Most of the aliens are in stasis. Left to themselves, they will slowly but randomly materialize from one of the eight transportation beams that terminate just above the planet's surface. Once they arrive, these spacecraft will make a kamikaze dive at your command ship. The alien kritters from these transport beams are impervious to your normal weapons, and must be avoided. Instead of waiting for the ships to arrive, you can activate them at a more convenient time by firing on them. Kritters from higher up in each beam are able to maneuver more quickly, and are much more likely to crash into you.<br><br>In addition to the menace from the transporter beams, there are free falling kritters. These slowly fall straight down from the top of the screen, and may be shot. They will destroy you if they run into you, and if they slip past your defences will cause you to lose points from your score. Both free falling and transported kritters are worth more points if shot higher up the screen.<br><br>You start the game with three command ships. Up to five extra command ships may be awarded by killing alien patrol kritters which occasionally move from right to left across the very top of the screen. Removing all aliens from the screen takes you to the next skill level (which ranges from zero to nine). Each level increases the number and speed of the free falling kritters but also provides you with an extra super-missile. Activating super-missiles allow you to destroy one of the normally invulnerable aliens from the transport beams. \n",
  "publishedBy": "CBS Software",
  "developedBy": "K-Byte",
  "released": "1982",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/k-razy-kritters",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "CBS Software",
          "developer": "K-Byte",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1024038-k-razy-kritters-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/1024039-k-razy-kritters-atari-8-bit-screenshot-start-of-level-1.png",
      "caption": "Start of level 1."
    },
    {
      "link": "/images/shots/l/1024040-k-razy-kritters-atari-8-bit-screenshot-only-a-few-kritters.png",
      "caption": "Only a few kritters left in the transporter beams."
    },
    {
      "link": "/images/shots/l/1024041-k-razy-kritters-atari-8-bit-screenshot-between-level-cut.png",
      "caption": "Between level cut-scene."
    },
    {
      "link": "/images/shots/l/1024042-k-razy-kritters-atari-8-bit-screenshot-a-bull-dozer-sweeps.png",
      "caption": "A bull-dozer sweeps away the mess after dying on level 9."
    }
  ],
  "cover": []
}