{
  "name": "Mar Tesoro",
  "shortName": "mar-tesoro",
  "description": "Mar Tesoro (which is Spanish for Sea Treasure) is a game which simulates the search for sunken treasure. You start with $10,000 with which you must hire a boat, crew and equipment of various sorts from the main port of &quot;The Island&quot;. Then you can explore and bring back any treasure that you find.<br><br>In port, you can hire a boat and select the type of equipment to use (scuba, diving rig or a diving bell). These allow you to reach treasure at increasing depths. You can also hire a historian who can estimate the worth of a treasure by a sample retrieved by the diver, without having to recover the entire treasure. Additional crew can be hired to assist in salvage operations. Once the daily hire charge and time has been determined, you can set out on your expedition.<br><br>On leaving port, you may choose to look at the chart which shows the randomly generated island, the surrounding sea, and previously dropped buoys. You can move the ship, represented by an asterisk, from square to square in four directions. Movement uses time, which is shown below the chart. If you exceed the agreed upon rental time you will be nabbed by the coast guard. Other randomly occurring incidents such as bad weather and engine trouble may also use time.<br><br>Once you have decided upon a spot to search, you may dive. This brings up a side view of the scene. You control the diver, who must visit the ocean floor and return a sample of any possible treasure. Treasure, which ranges from a shipwreck to an oyster bed with pearls, usually appears a different colour from the rest of the sea floor. It may also be guarded by a giant squid, which must be avoided, or you will lose a worker or perhaps your own life. Having brought the sample back to the boat, you have the option of retrieving the treasure. The historian (if you have one) will offer an opinion on the likelihood of a good treasure. The time it takes to retrieve a treasure depends on the depth. If you don't have enough time, you can mark the site with a buoy and continue elsewhere.<br><br>After returning to port, you are offered money for all of your recovered treasures. Then you may either leave the game (and get you final rating), or continue the game to look for even greater fortune.",
  "publishedBy": "Syncro, Inc.",
  "developedBy": "",
  "released": "1981",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/mar-tesoro",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Syncro, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1981",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/908748-mar-tesoro-atari-8-bit-screenshot-loading-screen.png",
      "caption": "Loading screen."
    },
    {
      "link": "/images/shots/l/908749-mar-tesoro-atari-8-bit-screenshot-hiring-boating-equipment.png",
      "caption": "Hiring boating equipment."
    },
    {
      "link": "/images/shots/l/908750-mar-tesoro-atari-8-bit-screenshot-offering-incentives-to-the.png",
      "caption": "Offering incentives to the crew."
    },
    {
      "link": "/images/shots/l/908751-mar-tesoro-atari-8-bit-screenshot-just-left-the-port.png",
      "caption": "Just left the port."
    },
    {
      "link": "/images/shots/l/908752-mar-tesoro-atari-8-bit-screenshot-map-of-the-island-zero-days.png",
      "caption": "Map of &quot;The Island&quot;. Zero days elapsed so far."
    },
    {
      "link": "/images/shots/l/908753-mar-tesoro-atari-8-bit-screenshot-some-treasure-slightly-differently.png",
      "caption": "Some treasure (slightly differently coloured) is on the sea floor to the left."
    },
    {
      "link": "/images/shots/l/908754-mar-tesoro-atari-8-bit-screenshot-found-the-coral-now-to-retrieve.png",
      "caption": "Found the coral. Now to retrieve it."
    },
    {
      "link": "/images/shots/l/908755-mar-tesoro-atari-8-bit-screenshot-treasure-found-this-trip.png",
      "caption": "Treasure found this trip."
    },
    {
      "link": "/images/shots/l/908756-mar-tesoro-atari-8-bit-screenshot-deeper-water-a-giant-squid.png",
      "caption": "Deeper water. A giant squid lies in wait on the sea floor."
    }
  ],
  "cover": []
}