{
  "name": "Paperboy",
  "shortName": "paperboy___",
  "description": "<i>Paperboy</i> is a 1-player arcade game for multiple systems.<br><br>In the Apple II version, the player controls a paperboy armed with 20 papers who can move horizontally at the bottom of the screen, and throw papers vertically forwards.  The player must avoid dogs who occasionally lunge forwards and horizontally at the player.  If the player hits a dog with a paper, the dog is temporarily stunned.  The player must tag all 11 houses before running out of papers.  If the player is touched by a dog, an ambulance arrives to cart off the player, and they lose a life, and must restart the level.  If the player runs out of papers, they lose a life, and must restart the level.  After successfully delivering papers to all 11 houses, the player progresses to a more difficult challenge.  The player has 3 lives, and it's game over when all are lost.  <br><br>In the Atari version, the player can move in the cardinal directions, and is armed with 90 papers, and attempts to deliver a paper to numerous houses on the screen.  A number of dogs chase the player, but only the closest dog remains active, while the others sit idle by, waiting for the player to get closer.  The player can throw papers in the cardinal directions, but can only deliver a paper from the south.  Dogs are temporarily stunned if hit by a paper.  If the paperboy delivers a paper to each location, they move on to a more difficult level.  Once again the player has 3 lives, and if all are lost, it's game over.   ",
  "publishedBy": "Dynacomp, Inc.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "Apple II | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/paperboy___",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Dynacomp, Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/992160-paperboy-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/992161-paperboy-atari-8-bit-screenshot-chased-by-dogs.png",
      "caption": "Chased by Dogs"
    },
    {
      "link": "/images/shots/l/992162-paperboy-atari-8-bit-screenshot-game-over.png",
      "caption": "Game Over"
    }
  ],
  "cover": []
}