{
  "name": "The Pharaoh's Curse",
  "shortName": "pharaohs-curse",
  "description": "In the centuries since the sealing of the Pharaoh's Tomb, even the dim memories of the fabulous treasure contained in the pyramid, have become infrequent whispers on the lips of mad adventurers.<br><br>For three thousand years, the tomb has been a mystery and deathtrap. It is rumored that the chambers contain dark and terrible dangers for those that would make the pharaoh's treasure their own. And even more ghastly, the pharaoh and the guardian mummy are said to walk the chambers for all eternity, destroying all trespassers in the tomb.<br><br>You've heard it all before and lived to tell about it and this is a chance of a lifetime. You've spent months finding these ruins and finally you're here at the fabled tomb. Still... what if the legends are true? As you descend into the first chamber, you hear footsteps...<br><br>Somewhere in the swirling sands of the Sahara stands an enigma. A secret tomb that has for 43 centuries stood undisturbed... untouched... unknown and unentered. The ancient pharaoh who lies buried within the vast twisting underground chambers was the 16th and last of a vast dynasty. His treasure, the gold, the art, the jewel encrusted sacred scarabs, all lie with him in the untouched chambers of the crypt. Unimaginable wealth for any but an emperor has lured you here and now you must descend...<br><br>Before his death, the pharaoh vowed that he himself and his hideous minions of the underworld must protect his treasure from all who dare defile his timeless tomb.<br><br>And so you must slip past his sentries and deathtraps that riddle the passages and shafts of his monument, and steal the treasures before you perish.<br><br>As an adventurer, you must explore the pyramid in search of these treasures, while on the lookout for both the mummy and the pharaoh, who will shoot at you if you are caught. You will be awarded an extra life for each treasure you get. There is also the winged avenger. This creature does not harm you, but if you are caught in his grasp, he will take you elsewhere in the pyramid. <br><br>There are keys that can be collected, and can open locked doors so that you can visit new chambers in the pyramid. You lose keys when you get carried away by the winged avatar or lose one of your lives. There are three levels. The higher the level, the more treasures you have to get and there are also new chambers. Higher levels require a password, which is revealed after playing the previous level.",
  "publishedBy": "Synapse Software Corporation",
  "developedBy": "Synapse Software Corporation",
  "released": "1983",
  "alsoFor": "Commodore 64, VIC-20 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/pharaohs-curse",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Synapse Software Corporation",
          "developer": "Synapse Software Corporation",
          "ported": "",
          "country": " United States",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/271750-the-pharaoh-s-curse-atari-8-bit-screenshot-title.png",
      "caption": "Title"
    },
    {
      "link": "/images/shots/l/271751-the-pharaoh-s-curse-atari-8-bit-screenshot-you-begin-at-the.png",
      "caption": "You begin at the top of the pyramid"
    },
    {
      "link": "/images/shots/l/271752-the-pharaoh-s-curse-atari-8-bit-screenshot-the-mummy-is-about.png",
      "caption": "The mummy is about to kill you"
    },
    {
      "link": "/images/shots/l/271753-the-pharaoh-s-curse-atari-8-bit-screenshot-navigating-a-ladder.png",
      "caption": "Navigating a ladder to get to the treasure"
    },
    {
      "link": "/images/shots/l/271754-the-pharaoh-s-curse-atari-8-bit-screenshot-the-pharaoh-appears.png",
      "caption": "The pharaoh appears"
    },
    {
      "link": "/images/shots/l/271755-the-pharaoh-s-curse-atari-8-bit-screenshot-carried-away-by.png",
      "caption": "Carried away by a winged avatar"
    },
    {
      "link": "/images/shots/l/271756-the-pharaoh-s-curse-atari-8-bit-screenshot-a-treasure-and.png",
      "caption": "A treasure and a key are here"
    },
    {
      "link": "/images/shots/l/271757-the-pharaoh-s-curse-atari-8-bit-screenshot-door-opens.png",
      "caption": "Door opens"
    },
    {
      "link": "/images/shots/l/271758-the-pharaoh-s-curse-atari-8-bit-screenshot-standing-next-to.png",
      "caption": "Standing next to a one-way door"
    },
    {
      "link": "/images/shots/l/271759-the-pharaoh-s-curse-atari-8-bit-screenshot-falling-down.png",
      "caption": "Falling down"
    },
    {
      "link": "/images/shots/l/271760-the-pharaoh-s-curse-atari-8-bit-screenshot-this-looks-like.png",
      "caption": "This looks like a complicated screen"
    },
    {
      "link": "/images/shots/l/271761-the-pharaoh-s-curse-atari-8-bit-screenshot-lost-a-life.png",
      "caption": "Lost a life"
    }
  ],
  "cover": []
}