{
  "name": "Phobos",
  "shortName": "phobos_",
  "description": "<i>Phobos</i> is a sequel to <a href=\"https://www.mobygames.com/game/caverns-of-mars\">Caverns of Mars</a>, and has similar game-play. In the previous game, you had defeated the Martians on their home planet, but a group of renegades has escaped, and set up headquarters on the moon Phobos. Your new task is to descend into a heavily defended cavern on this tiny moon, and neutralize the control center at the bottom.<br><br>The cavern that you are infiltrating is marked by a number of stages, given in alphabetical order by the letters A to P. The game can be played at four difficulty levels, corresponding to the depth of the cavern. The Novice player is only required to reach stage F, while the Commander needs to complete all of the stages down to P. Each of the stages has a themed obstacle such as flashing barriers, moving walls or bricked up areas that must be shot through.<br><br>You control a space-ship, which may move around the screen in any direction. For the first four stages of each level, you are pulled by gravity towards the centre of Phobos and have limited vertical mobility. However this effect disappears as you get closer towards the centre. You also have the ability to shoot downward to destroy enemy infrastructure. But don't be too close to the TNT if you shoot it, or it will explode taking you with it and losing one of your lives.<br><br>In addition to dodging lethal obstacles, you are also in constant danger of running out of fuel. Fuel may be replenished by destroying certain bases that appear regularly throughout the cavern. Once you have reached the bottom of the cavern, the control centre, which is defended by a concrete bunker, must be destroyed. This ends the level, and your mission restarts at a higher level. Higher levels seem identical to earlier ones, except you are awarded with an extra flag which appears at the bottom right of the screen. Finishing eight of these levels ends the game.",
  "publishedBy": "APX",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/phobos_",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "APX",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1029746-phobos-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/1029747-phobos-atari-8-bit-screenshot-the-first-stage-has-lots-of.png",
      "caption": "The first stage has lots of fuel available."
    },
    {
      "link": "/images/shots/l/1029748-phobos-atari-8-bit-screenshot-the-second-stage-has-these.png",
      "caption": "The second stage has these stationary rockets."
    },
    {
      "link": "/images/shots/l/1029749-phobos-atari-8-bit-screenshot-strobing-force-fields-block.png",
      "caption": "Strobing force fields block your path."
    },
    {
      "link": "/images/shots/l/1029751-phobos-atari-8-bit-screenshot-shooting-through-to-the-central.png",
      "caption": "Shooting through to the central computer on Novice level."
    },
    {
      "link": "/images/shots/l/1029750-phobos-atari-8-bit-screenshot-now-let-s-do-it-again.png",
      "caption": "Now let's do it again."
    },
    {
      "link": "/images/shots/l/1029753-phobos-atari-8-bit-screenshot-higher-difficulty-levels-have.png",
      "caption": "Higher difficulty levels have double moving walls."
    },
    {
      "link": "/images/shots/l/1029752-phobos-atari-8-bit-screenshot-after-completing-the-8th-level.png",
      "caption": "After completing the 8th level, the game will end."
    }
  ],
  "cover": []
}