{
  "name": "Quarxon",
  "shortName": "quarxon",
  "description": "You have just discovered friendly droids on Quarxon, in a galaxy far away, when you have suddenly come under attack by other less friendly droids who want to take over the universe. Your task is to defend the friendly droids, currently protected by layers of bunker, from the attackers. <br><br>You control a single ship which can move horizontally, and to a limited extent vertically. You can only shoot vertically. Quarxon's atmosphere has several characteristics important for your battle. First, there is a boundary line that is impenetrable to blaster fire. Shooting at this will cause the blast to reflect back to your own position. Naturally occurring holes will frequently appear in this layer, allowing you to shoot the enemy on the other side. Second, shooting twice from the same location will cause a patch to appear, which allows your opponent to shoot through the boundary, even when there are no holes. Thirdly, getting hit by an opponent's shot will activate a crushing atmospheric disturbance which slowly moves inwards, and will destroy you unless you can maneuver between holes in the layer.<br><br>There are a number of configurable options for game-play, such as the difficulty (or speed), the number of starting droids, and the number of layers of bunker defending each side's droids and whether you play against another human or the computer. The game concludes when one side has shot all of the other's droids.",
  "publishedBy": "APX",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/quarxon",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "APX",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1037884-quarxon-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/1037885-quarxon-atari-8-bit-screenshot-starting-a-level-with-8-droids.png",
      "caption": "Starting a level with 8 droids each, and one layer of bunker."
    },
    {
      "link": "/images/shots/l/1037886-quarxon-atari-8-bit-screenshot-the-crushing-layer-has-been.png",
      "caption": "The crushing layer has been activated on the bottom player."
    },
    {
      "link": "/images/shots/l/1037887-quarxon-atari-8-bit-screenshot-victory-for-the-top-player.png",
      "caption": "Victory for the top player. All droids destroyed."
    }
  ],
  "cover": []
}