{
  "name": "Sands of Mars",
  "shortName": "sands-of-mars",
  "description": "<i>Sands of Mars</i> is a science fiction themed game of exploration.<br><br>You are Captain of the Starship Herman, and your mission is to pilot your spaceship to Mars, and recover the archaeologist Dr. Grady and other crew members, whom were lost in the Martian underground during the previous Explorer II mission.  Mars was once inhabited by two races, the reptilian Meshim and the insectoid Zanti, and Dr. Grady holds the key to understanding what happened to these two races<br><br>Your mission begins with outfitting your spaceship for the long voyage.  You must ensure you have enough fuel, food, and oxygen for the long trip, as well as other supplies you'll need on the Red Planet.  You must also choose your crew members, as each has special skills which are essential for survival on the harsh Martian climate.<br><br>After stocking supplies, the player must configure their navigation system and blast off from Earth.  Ship navigation is from a 1st-person perspective, and they player must navigate to Mars using their Solar map, and successfully land on the planet.  Along the way, the player encounters hostile alien ships to battle in combat, asteroid swarms, and friendly merchants to trade with.  <br><br>Upon arriving on Mars, gameplay turns to a top-down perspective, and the player must explore the Martian surface as well as the Meshim labyrinths and the Zantian city Lemuria deep below the Martian surface.  The player is armed with a Laar, which can be used to fire in a 360 degree arc to defeat alien dangers on the planet. After locating Dr. Grady and other survivors on Mars, the player must uncover the secrets of the Red Planet to save the Zanti race, and return to Earth.<br><br>On the return trip, the player once again faces a 1st person perspective, and must survive all the dangers of space for the second time.  <br><br>\n",
  "publishedBy": "Crystalware",
  "developedBy": "",
  "released": "1981",
  "alsoFor": "Apple II, TRS-80 | Combined View",
  "genre": "Adventure, Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/sands-of-mars",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Graphic adventure, RPG elements",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Crystalware",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1981",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/965882-sands-of-mars-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/965883-sands-of-mars-atari-8-bit-screenshot-shopping.png",
      "caption": "Shopping"
    },
    {
      "link": "/images/shots/l/965884-sands-of-mars-atari-8-bit-screenshot-dead-on-the-martian-surface.png",
      "caption": "Dead on the Martian Surface"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/707546-sands-of-mars-atari-8-bit-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Plastic Folder",
      "country": "United States",
      "platforms": "Atari 8-bit"
    },
    {
      "link": "/images/covers/l/707547-sands-of-mars-atari-8-bit-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Plastic Folder",
      "country": "United States",
      "platforms": "Atari 8-bit"
    },
    {
      "link": "/images/covers/l/707548-sands-of-mars-atari-8-bit-media.jpg",
      "scanOf": "Media",
      "packaging": "Plastic Folder",
      "country": "United States",
      "platforms": "Atari 8-bit"
    }
  ]
}