{
  "name": "Schreckenstein",
  "shortName": "schreckenstein",
  "description": "The castle of Schreckenstein has been taken over by black sorcerers and creatures of the underworld. The magical eyes of the Necropolis ward off visitors to the castle, but it might just be possible for one or two brave souls to enter the castle dungeons. And with the help of the white sorcerers, perhaps they can restore peace to the castle.<br><br>Schreckenstein is a platform maze game designed to be played by two players, with each player's surroundings shown in either the top or bottom half of the screen. If a single player is selected, the computer operates the second player. In each level, the players must traverse the maze collecting health elixirs and level specific objects while avoiding spooks, bats, spiders and miscellaneous traps. Each player can throw a weapon to dispatch their enemies.<br><br>On each level, the collected objects are either used to activate sites or give them to a white sorcerer for use. When enough have been collected, a key appears somewhere, and once collected this allows the door to the next level to be opened. For the first level, the players collect torches and use them to activate giant skulls. On the second level, gems are collected for the white sorcerer, who appears randomly and infrequently as a ghostly apparition. On the third level, tokens must be deposited into magical wells. On the fourth level, the player must again collect crystals but they are enchanted, and cannot be picked up unless the player is first given the ability by a white sorcerer. In the final level, the players must find magic eyes for the white sorcerer.<br><br>Each player has a health meter, which trickles down with time or drops after contact with a monster. Once the energy reaches zero, the player dies. If this happens to the computer or in two player mode, the first player to die eventually re-animates as an undead creature who pursues the other player. If the living player completes a level, their companion is given extra energy and returned to life with a small amount of energy for the next level.",
  "publishedBy": "ariolasoft GmbH",
  "developedBy": "Axis Komputerkunst",
  "released": "1985",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/schreckenstein",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "ariolasoft GmbH",
          "developer": "Axis Komputerkunst",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/985654-schreckenstein-atari-8-bit-screenshot-loading-screen.png",
      "caption": "Loading screen."
    },
    {
      "link": "/images/shots/l/985655-schreckenstein-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/985656-schreckenstein-atari-8-bit-screenshot-start-of-level-1-at.png",
      "caption": "Start of level 1 at the top of the castle."
    },
    {
      "link": "/images/shots/l/985657-schreckenstein-atari-8-bit-screenshot-further-within-the-castle.png",
      "caption": "Further within the castle."
    },
    {
      "link": "/images/shots/l/985658-schreckenstein-atari-8-bit-screenshot-player-1-has-the-key.png",
      "caption": "Player 1 has the key and is about to leave the level."
    },
    {
      "link": "/images/shots/l/985659-schreckenstein-atari-8-bit-screenshot-level-2.png",
      "caption": "Level 2."
    },
    {
      "link": "/images/shots/l/985660-schreckenstein-atari-8-bit-screenshot-level-3-has-an-undead.png",
      "caption": "Level 3 has an undead theme."
    },
    {
      "link": "/images/shots/l/985661-schreckenstein-atari-8-bit-screenshot-start-of-level-4.png",
      "caption": "Start of level 4."
    },
    {
      "link": "/images/shots/l/985662-schreckenstein-atari-8-bit-screenshot-player-1-has-found-a.png",
      "caption": "Player 1 has found a white sorceror."
    },
    {
      "link": "/images/shots/l/985663-schreckenstein-atari-8-bit-screenshot-the-final-level.png",
      "caption": "The final level."
    }
  ],
  "cover": []
}