{
  "name": "Slice",
  "shortName": "slice",
  "description": "<i>Slice</i> is an action game created for the &quot;NOMAM Basic Ten-Liners 2014&quot; competition. The entire code, written in the Turbo Basic XL language, is 10 lines long. <br><br>The player controls a blue block moving around the screen, using a touch tablet (or paddle controllers.) Yellow squares appear at the bottom and fly up, and the goal is to catch the squares before they reach the top of the screen. Two bars at the top show the number of successfully caught yellow blocks, and the number of blocks which you failed to catch in time; when either bar reaches its maximum length (40), the game is over, and the score is tallied. A point is earned for catching a block, and lost for missing a block. Catching or missing 40 blocks results in a bonus or penalty of 100 points. <br><br>As the player catches the yellow squares, the background changes in color, and the rate at which the blocks appear increases. ",
  "publishedBy": "",
  "developedBy": "",
  "released": "Feb 16, 2014",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/slice",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/688149-slice-atari-8-bit-screenshot-beginning-of-the-game-we-control.png",
      "caption": "Beginning of the game. We control the blue square. We've already accumulated a couple of penalties (green bar.)"
    },
    {
      "link": "/images/shots/l/688150-slice-atari-8-bit-screenshot-some-time-later-the-background.png",
      "caption": "Some time later. The background has changed, and we managed to score some points as well (blue bar.)"
    },
    {
      "link": "/images/shots/l/688151-slice-atari-8-bit-screenshot-we-ve-managed-to-catch-40-squares.png",
      "caption": "We've managed to catch 40 squares. The game ends, the score is tallied. "
    }
  ],
  "cover": []
}