{
  "name": "Slime",
  "shortName": "slime_",
  "description": "The Omega Peace Accords have been violated by the Plexarian Invincibles.  Their bio-Transporters have warped into Earth's atmosphere, with the plan of dripping ooze from high up in the atmosphere into the Earth's seas.  This ooze will raise the levels of the oceans, drowning out all life, so the Plexarians can overtake the planet.  The Terran alliance has hastily created Gamma-Tube Absorbers in the Sargosso Sea, which can nullify the invading slime.  You must use the Earth's Electro-Wedge Deflector warships to reroute the slime into the Absorbers to protect the world's seas.<br><br>In <i>Slime</i>, the player controls a small warship, which moves horizontally on the bottom of the screen.  It is surrounded by an Absorber on either side of the bottom of the screen.  Alien vessels will drop slimes from the heavens, and the player must shoot out wedge-shaped barricades, with the hope of directing slimes into the Absorbers, or at least preventing them from reaching the sea.  While doing this, alien spaceships will intermittently plug your Absorbers, or shoot down your wedges.  As slimes reach the ocean, the sea level will rise, and when the seas reach the top of the screen, it's game over.  ",
  "publishedBy": "Synapse Software Corporation",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/slime_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Synapse Software Corporation",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}