{
  "name": "Starbase Hyperion",
  "shortName": "starbase-hyperion",
  "description": "<i>Starbase Hyperion</i> is a single player tactical space combat simulation for the Atari 400/800.<br><br>By the 37th century, human expansion had reached far across the galaxy.  Security of the frontiers of these worlds was the responsibility of Colonial Star Command.  During the latter years of the 37th century, first contact was made with probes of the non-human Empire.  To prevent Empire penetration of inner worlds, a number of Colonial Starbases were established to create buffer zones, designed to hold enemy fleets for several days, until large Colonial reinforcements could arrive.  This tactic worked well for some time, until 716 CD, when a large fleet of Empire vessels were spotted in Sector Hyperion.  The armada has already captured 18 frontier worlds, and <i>Starbase Hyperion</i> is the remaining defensive position preventing invasion of inner worlds.  As captain of the Starbase, you must hold out superior numbers until Colonial reinforcements arrive, to drive back the invading forces.  <br><br>The player must defend <i>Starbase Hyperion</i> for a total of 15 turns until reinforcements arrive. A separate winning conditions is destroying all enemy vessels.  The player starbase is located in the center of a 360 degree field.  During each turn, the player controls their base's energy output to power ships, probes, strengthen defenses, or strengthen shields.  The player can also produce power banks, which create future energy reserves.  Excess energy can also be stockpiled for future turns.  <br><br>Ships can be deployed, and if they come within range of enemy vessels, automatic combat will occur.  The amount of energy devoted to ship creation determines the quality of vessel produced.  Ships can be returned to the starbase for full repairs.  Probes are capable of detecting displaying the location and strength of distant enemy vessels, and must also be moved into position.  Probes can also be detonated to create an energy field which may slow or destroying incoming enemy vessels.  <br><br>There are total of 6 difficulty levels, and the player chooses the difficulty level and number of enemy ships at the beginning of each scenario.  Difficulty level effects the strength of alien vessels from small fighter squadron to dreadnaughts.  The player receives a final score based upon their efficiency at the end of each battle.  ",
  "publishedBy": "Quality Software",
  "developedBy": "",
  "released": "1981",
  "alsoFor": "Exidy Sorcerer | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/starbase-hyperion",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Wargame",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Quality Software",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1981",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/965348-starbase-hyperion-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/965349-starbase-hyperion-atari-8-bit-screenshot-enemy-units-approaching.png",
      "caption": "Enemy Units Approaching"
    },
    {
      "link": "/images/shots/l/965350-starbase-hyperion-atari-8-bit-screenshot-distributing-energy.png",
      "caption": "Distributing Energy"
    },
    {
      "link": "/images/shots/l/965351-starbase-hyperion-atari-8-bit-screenshot-moving-my-ships.png",
      "caption": "Moving my Ships"
    },
    {
      "link": "/images/shots/l/965352-starbase-hyperion-atari-8-bit-screenshot-engaging-in-battle.png",
      "caption": "Engaging in Battle"
    }
  ],
  "cover": []
}