{
  "name": "Timeslip",
  "shortName": "timeslip",
  "description": "On a distant planet, 36 Time Orbs have been placed in three zones and in 24 hours time the planet will be destroyed unless all the Orbs are destroyed. You have been sent to the planet to save it by controlling three different vehicles and crafts in the three zones and they are the planets surface, underground caverns and underwater. The game is a side view horizontal scrolling shooter where the screen is split into three parts showing all three vehicles and crafts and they are a spacefighter for the surface, jet-pack for the underground caverns and a mini-sub for underwater. As the game starts you select which one to control and you move from right to left destroying all aliens, vehicles, weapons and the orbs as the main clock counts to zero.<br><br>As you play and you press the letter S then, when the clock for the zone you are playing reaches the next hour, then you can select another zone to play in. If you touch any part of the zone, aliens, vehicles or weapons then you lose time on the main clock and you can select another vehicle to play, but five collisions though loses time in all three zones. Once a zone has been completed then that zone is locked and you then concentrate on the other zones but the game is over once the main clock has reached zero. Before you start the game, there are three difficulty levels to select and they are Novice, Normal and Expert.",
  "publishedBy": "English Software Company, The",
  "developedBy": "",
  "released": "1986",
  "alsoFor": "Commodore 16, Plus/4 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/timeslip",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "English Software Company, The",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Byte Back",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "5 018854 100628",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1022351-timeslip-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1022352-timeslip-atari-8-bit-screenshot-instructions.png",
      "caption": "Instructions"
    },
    {
      "link": "/images/shots/l/1022353-timeslip-atari-8-bit-screenshot-starting-gameplay.png",
      "caption": "Starting Gameplay"
    }
  ],
  "cover": []
}