{
  "name": "Universe",
  "shortName": "universe_",
  "description": "<i>Universe</i> is a complex space exploration game, reminiscent of the original <i>Traveller</i> hard science fiction pen-and-paper role-playing game. It is based in the same fictional universe as <i>Omnitrend's</i> later <a href=\"https://www.mobygames.com/search/quick?gamegroup=Breach+series\">Breach</a> and <a href=\"https://www.mobygames.com/search/quick?gamegroup=Rules+of+Engagement+series\">Rules of Engagement</a> series. Running in the same vein as games like <a href=\"https://www.mobygames.com/search/quick?game=Elite\">Elite</a>, <a href=\"https://www.mobygames.com/game/starflight\">Starflight</a>, and <a href=\"https://www.mobygames.com/game/sundog-frozen-legacy\">SunDog: Frozen Legacy</a>, its gameplay involves freelance space exploration, trading, space combat, planetary mining, and other economic activities.<br><br>In <i>Universe</i>, you are a new independent starship captain in the Local Group, a cluster of stars colonized by Earth in the relatively near future. Mankind has had the hyperdrive for almost four hundred years, but hyperdrives have ship size and range limitations that effectively prevented exploration and colonization beyond a 40-light-year radius. However, in distant orbit around Tau Ceti, an exploration ship found an enormous alien artifact called the hyperspace booster, which allowed one-way travel at a distance of thousands, rather than tens, of light years. The discovery of the hyperspace booster allowed a great Second Interstellar Expansion, and Axia, a star system specially noted in the hyperspace booster's starmaps, was colonized. The Local Group is the cluster of stars surrounding Axia.<br><br>For over two hundred years, Axia has received regular packages from Earth via the hyperspace booster, but the packages mysteriously ceased arriving four months ago. The Local Group, considerably behind Earth technologically, is dependent upon the packages and has its own political and economic problems, so this is a grave problem. Panic is spreading as rumors fly about what happened to Earth.<br><br>Recently, Axian Central Educational Institute announced that there is evidence of a second hyperspace booster in the Local Group. You, with your new ship and your enormous new debt, are one of those who hope to find the hyperspace booster and collect on the large reward for it. However, operating a starship is expensive, and you will receive no funding. Thus, you must make your own way however you see fit.<br><br>When you begin the game, you must choose the terms of your 300,000-credit mortgage and select a starship hull from various models that differ in size, layout, visibility to other ships (and therefore the likelihood of receiving undesirable attention) and sturdiness. Then, after a copious bit of disk-swapping, you proceed to drydock, where you can equip your ship and place all your ship's parts (hyperdrive, bridge, crew quarters, weapons, shuttles, cryogenic storage, et cetera) in its different sections (each of which has differing capacity and visibility -- this matters when a hostile starship hits you and the game must determine where you got hit and what got damaged).<br><br>From there, the Local Group is wide open. Trading, passenger transport, ore mining, smuggling, contract cargo transport, and even piracy (or pirate-hunting) are all lucrative options. The game's complexity shows in the example of mining: you must first equip your ship with ore processors, and, if you want to mine low-tech populated planets, assault capsules. You must also hire sufficient crew to run them all. Then, you must find a planet rich in resources and go into a low orbit around it (plotting an efficient orbit by hand can save energy resources); start the computer's Resource and Amphib Assault software packages (which may necessitate turning off Hyper Navigation or Sub-C Navigation to make space); convert Ore IV to energy to charge up the assault capsules; and launch them. When you have done this, an abstract isometric grid representing the landscape is displayed, with each assault capsule shown with a vertical line extending from it to the landscape representing its altitude. Here, you give them orders as they go down to the planetary surface to secure the area, being careful to scan the landing surface repeatedly to ensure it will support the ore processors (the scanners aren't 100% accurate, and you don't want your landers to sink into a swamp, fall into a thermal vent or tip over on jagged landscape).<br><br>Combat is conducted abstractly, in a manner vaguely similar to a strategic board game. If you win this fight and secure the landing sites, you then charge up, crew and launch the ore processors. Once they land (assuming they landed safely), choose which type of ore each one mines, and then let them rip until they run low on energy or until they are too damaged to continue, at which time you launch them and they return to the ship with their valuable cargo. If you've done well, you've got a substantial load of precious ore you can sell at the next starport.",
  "publishedBy": "Omnitrend Software, Inc.",
  "developedBy": "Omnitrend Software, Inc.",
  "released": "1983",
  "alsoFor": "Apple II, DOS | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/universe_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Omnitrend Software, Inc.",
          "developer": "Omnitrend Software, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/240469-universe-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/240470-universe-atari-8-bit-screenshot-logos-credits.png",
      "caption": "Logos / credits"
    },
    {
      "link": "/images/shots/l/240471-universe-atari-8-bit-screenshot-some-loan-information.png",
      "caption": "Some loan information"
    },
    {
      "link": "/images/shots/l/240472-universe-atari-8-bit-screenshot-i-ll-need-a-loan-to-get-started.png",
      "caption": "I'll need a loan to get started; how's this one?"
    },
    {
      "link": "/images/shots/l/240473-universe-atari-8-bit-screenshot-some-useful-information.png",
      "caption": "Some useful information..."
    },
    {
      "link": "/images/shots/l/240474-universe-atari-8-bit-screenshot-here-s-the-ships-i-can-buy.png",
      "caption": "Here's the ships I can buy"
    },
    {
      "link": "/images/shots/l/240475-universe-atari-8-bit-screenshot-ship-specifications.png",
      "caption": "Ship specifications"
    },
    {
      "link": "/images/shots/l/240476-universe-atari-8-bit-screenshot-ship-overview.png",
      "caption": "Ship overview"
    },
    {
      "link": "/images/shots/l/240477-universe-atari-8-bit-screenshot-the-flight-menu.png",
      "caption": "The flight menu"
    },
    {
      "link": "/images/shots/l/240478-universe-atari-8-bit-screenshot-docking-sequence.png",
      "caption": "Docking sequence..."
    },
    {
      "link": "/images/shots/l/240479-universe-atari-8-bit-screenshot-the-drydock-menu.png",
      "caption": "The drydock menu..."
    },
    {
      "link": "/images/shots/l/240480-universe-atari-8-bit-screenshot-purchase-some-items.png",
      "caption": "Purchase some items?"
    },
    {
      "link": "/images/shots/l/240481-universe-atari-8-bit-screenshot-the-mining-systems-menu.png",
      "caption": "The mining systems menu"
    },
    {
      "link": "/images/shots/l/240482-universe-atari-8-bit-screenshot-uh-oh-that-sounds-like-game.png",
      "caption": "Uh oh, that sounds like game over..."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/637346-universe-atari-8-bit-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Book",
      "country": "United States",
      "platforms": "Atari 8-bit"
    },
    {
      "link": "/images/covers/l/637347-universe-atari-8-bit-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Book",
      "country": "United States",
      "platforms": "Atari 8-bit"
    },
    {
      "link": "/images/covers/l/637348-universe-atari-8-bit-media.jpg",
      "scanOf": "Media",
      "packaging": "Book",
      "country": "United States",
      "platforms": "Atari 8-bit"
    }
  ]
}