{
  "name": "World War III",
  "shortName": "world-war-iii",
  "description": "<i>World War III</i> is a 2-player strategy wargame of world conquest.<br><br>Based upon the Iraq-Iran war, each player starts in control of either Iraqi or Iranian forces.  Gameplay is divided into 3 distinct segments.  The first segment is played from an overhead perspective on a large map of the two nations, players forces are displayed as small tiles on the screen. In the Atari version, the player has a large smoothly scrolling map, while the Apple II version breaks the map into 16 individual segments, which can be viewed separately.  Character movement and commands are placed via text, and each player takes turns inputting 5 commands for their forces, followed by their opponent.  Players control air, naval, infantry, and armored forces, and forces must be carefully supplied and managed.  Commands are affected by troop morale, supplies, and terrain conditions.  <br><br>The second segment involves political maneuvering.  The player is in control of military movements, but also taxes and oil supplies. The player must protect oil supplies, and attempt to gain enemy land.  The allocated resources are then used to purchase newer and more advances weapons and supplies from one of 24 foreign nations.  Only allied nations will trade with players, and players can win over allies by supporting their diplomatic efforts, trade, and careful use of nuclear weaponry. More importantly, neutral nations must be won over to the player's cause for the final conflict.<br><br>Inevitably, this regional conflict will explode into global nuclear war between nations, based upon their allied status.  Played upon a larger scale map of the eastern and western hemisphere, the player controls submarines, carriers, and air forces.  The player can use nuclear and non-nuclear arms, and nuclear fallout is fatal to forces.  If players use nuclear forces prodigiously, the world's level of radioactivity will rise to a point where both players lose.  The ultimate goal is to subdue all hostile nations, and win World War III.<br><br>",
  "publishedBy": "Crystalware",
  "developedBy": "",
  "released": "1982",
  "alsoFor": "Apple II | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/world-war-iii",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "Wargame",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Crystalware",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/966114-world-war-iii-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/966115-world-war-iii-atari-8-bit-screenshot-creating-characters.png",
      "caption": "Creating Characters"
    },
    {
      "link": "/images/shots/l/966117-world-war-iii-atari-8-bit-screenshot-viewing-the-battlefield.png",
      "caption": "Viewing the Battlefield"
    },
    {
      "link": "/images/shots/l/966118-world-war-iii-atari-8-bit-screenshot-country-status.png",
      "caption": "Country Status"
    }
  ],
  "cover": []
}