{
  "name": "The Wylde",
  "shortName": "wylde",
  "description": "<i>The Wylde</i> is the third part of the </i>Warriors of Ras</i> series of RPGs for multiple systems.<br><br>As told during the previous game </i><a href=\"https://www.mobygames.com/game/kaiv\">Kaiv</a></i>, Grimsweord the Warrior has returned from his adventure in the Kaiv ragged and lame.  It is the hope of Lord Doserror that he might recover with the Wizard's magical help, but this has not come to pass.  The only thing that might cure him is a healing item located deep within the Wylde.  A young apprentice sorceress named Cwenellen has been chosen to seek out the healing unguent, and has been awarded 2000 pieces of gold and a map of the area to aid in this task.  <br><br>Played largely from a fixed overhead map, the player starts in the castle in the southwest of the map, and attempts to recover a healing item located to the northeast.  All commands including movement are via text commands.  The town contains a store to purchase supplies, as well as allows the player to store gold.  The player can only revisit the main town 5 times, or they are turned into a wild animal by the livid Wizard.  The player can collect bounties on randomly chosen enemies for 100 gold if they return after slaying the creature.  In the countryside, the player must contend with environmental damage, and the constant threat of hunger.  There are 2 outposts, which allow the player to restock resources.  The player must sleep every evening, and can get attacked in their sleep.<br><br>Combat occurs on a separate map, where the player encounters multiple opponents.  The player and enemies takes turns moving and attacking, and the player has a total of 13 different locations they can attack on enemies and 9 separate body locations to defend, but if vitals locations are lost, the player perishes.  The player can aim their attacks, or flail randomly.  They can also choose more forceful attacks.  The player can gain valuable items and weapons after combat, and will progressively level up and become stronger with successful combats.  Magical items can be found in combat to give the player an edge.  <br><br>Ultimately, the goal is to reach the location in the northeast, and defeat the guardian creatures.  The player must then return to the town in the southwest to claim victory.\n",
  "publishedBy": "Screenplay",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "Apple II, Commodore 64, TRS-80 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/wylde",
  "visual": "",
  "gamePlay": "RPG elements",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Screenplay",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/992852-the-wylde-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/992853-the-wylde-atari-8-bit-screenshot-main-menu.png",
      "caption": "Main Menu"
    },
    {
      "link": "/images/shots/l/992854-the-wylde-atari-8-bit-screenshot-shopping.png",
      "caption": "Shopping"
    },
    {
      "link": "/images/shots/l/992855-the-wylde-atari-8-bit-screenshot-exploring-the-wilderness.png",
      "caption": "Exploring the Wilderness"
    },
    {
      "link": "/images/shots/l/992856-the-wylde-atari-8-bit-screenshot-encounter-with-bears.png",
      "caption": "Encounter with Bears"
    },
    {
      "link": "/images/shots/l/992857-the-wylde-atari-8-bit-screenshot-i-have-fled.png",
      "caption": "I have Fled"
    },
    {
      "link": "/images/shots/l/992858-the-wylde-atari-8-bit-screenshot-it-s-raining.png",
      "caption": "It's Raining"
    },
    {
      "link": "/images/shots/l/992859-the-wylde-atari-8-bit-screenshot-data-sheet.png",
      "caption": "Data Sheet"
    },
    {
      "link": "/images/shots/l/992860-the-wylde-atari-8-bit-screenshot-inventory.png",
      "caption": "Inventory"
    },
    {
      "link": "/images/shots/l/992861-the-wylde-atari-8-bit-screenshot-fact-sheet.png",
      "caption": "Fact Sheet"
    },
    {
      "link": "/images/shots/l/992862-the-wylde-atari-8-bit-screenshot-encounter-with-2-fighters.png",
      "caption": "Encounter with 2 Fighters"
    }
  ],
  "cover": []
}