{
  "name": "Zeppelin",
  "shortName": "zeppelin",
  "description": "After escaping the Timelords you begin a fight for survival on the cave world of Zarkifir. This is where the Timelords have established their base from which they intend to dominate this planetary system. You must navigate the caves and undermine their forces!<br><br>In this game the player controls a zeppelin traveling through a cave system. The goal is to survive the cave defenses, acquire a TNT bomb, and unlock access to the chamber where the bomb can be detonated. The zeppelin is capable of firing in all directions. The player has limited ability to control the advancement through the caves, as the screen constantly scrolls with directions shifting according to the cave layout.<br><br>The caves have many defenses, from laser walls to falling rocks. Most of these can be disabled by shooting switches on the cave walls. In order to access the room where the bomb can be detonated, the player has to find a hamburger and use it to bribe the hamburger creature that blocks the entrance. <br><br>The two-player mode has one player controlling the zeppelin movement, while the second player controls the guns.",
  "publishedBy": "Synapse Software Corporation",
  "developedBy": "Synapse Software Corporation",
  "released": "Aug, 1983",
  "alsoFor": "Commodore 64 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-8-bit/zeppelin",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 8-bit",
      "releases": [
        {
          "publisher": "Synapse Software Corporation",
          "developer": "Synapse Software Corporation",
          "ported": "",
          "country": " United States",
          "releaseDate": "Aug, 1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/511589-zeppelin-atari-8-bit-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/511609-zeppelin-atari-8-bit-screenshot-a-relatively-open-area-which.png",
      "caption": "A relatively open area, which makes it easy to maneuver "
    },
    {
      "link": "/images/shots/l/511591-zeppelin-atari-8-bit-screenshot-barrier-ahead.png",
      "caption": "Barrier ahead"
    }
  ],
  "cover": []
}