{"altername_name": [], "name": "Daikon Set", "overview": "Battle boss enemies, dodge through obstacles, and protect the one you love in ultra intense arcade action! Daikon Set is a collection of 3 mini games influenced by first generation, home-dedicated video game consoles and the retro coin-operated arcade era. Chroma Star In a time when space itself is at risk of falling into a dimensional war, Chroma Federation pilot Ami Bright is on a special mission to protect the mothership barrier. She boards her gunship and fights her way through waves of enemies to protect the mothership barrier. The success of this mission could affect the fate of the universe! Pink Mite The Mites lived peacefully until an evil force was unleashed, sinking their civilization to the bottom of the sea. Decades have passed and the Mites' existence has faded away. One day a mysterious earthquake shakes continents and shifts deep down into the planet's core! The shock from the quake was devastating enough to tear through dimensions and awaken Pink Mite, a legendary hero of the Mite civilization. After spending decades trapped in an underwater prison, Pink Mite is freed and ascends to the surface to find the truth about her revival. The Queen The ability to craft stronger weapons and reinforced armor have taken the place of magic in the Kingdom of Blake. Lord Valshtine has used his power and influence to gather an army to kill all remaining magic users. The King and Queen are the last survivors of his crusade. Lord Valshtine has set his sights on them and his forces now have closed in on their castle! The King, armed with the finest shield forged must defend and protect the Queen while she charges a powerful magic enchantment that could end Lord Valshtine's crusade!", "platform": "Nintendo Wii U", "release_date": "June 22, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "Butterfly", "publishers": "Batafurai", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/147542-daikon-set\n"}