{"altername_name": ["Disney Infinity 3.0: Play Without Limits"], "name": "Disney Infinity: 3.0 Edition", "overview": "Disney Infinity 3.0 Edition now welcomes Star Wars™ to the ever-growing collection of Marvel, Disney and Disney•Pixar characters, stories and worlds. Together new heroes can join forces with characters from previous editions and embark on adventures as big as your imagination in the 3.0 Toy Box! Disney Infinity encourages you to play your way, whether you explore open-world creation in the Toy Box or story-driven gameplay inside Play Sets! Venture into the 3.0 Toy Box, where you can create your own universe and mix, match and mash up all Disney Infinity characters in one place. You can also jump into Play Sets where you can play inside the worlds of your favorite characters and relive distinct experiences, varied gameplay, environments and characters. ONE GAME. TWO WAYS TO PLAY. Play Sets Play Sets allow you to play inside the worlds of your favorite Disney Infinity characters and offer distinct experiences, with varied gameplay, environments and characters. Unlock new adventures from all-new Disney Infinity 3.0 Edition Play Sets featuring Star Wars™, Marvel, Disney and Disney•Pixar. Toy Box 3.0 Enter the new Toy Box 3.0, a wide-open world of possibilities where you create your own stories, worlds or games with all of your favorite Disney Infinity characters! Mix, match and mash-up Disney, Disney•Pixar, Marvel and Star Wars™ characters together in one place!", "platform": "Nintendo Wii U", "release_date": "August 30, 2015", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Avalanche Software", "publishers": "Disney Interactive Studios", "genres": "Sandbox", "max_players": "4", "cooperative": "No", "rating": "2.3", "wikipedia": "https://en.wikipedia.org/wiki/Disney_Infinity_3.0", "video_link": "https://www.youtube.com/watch?v=N1zuub3Z2kU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33894-disney-infinity-30-edition\n"}