{"altername_name": ["Project Zero: Maiden of Black Water"], "name": "Fatal Frame: Maiden of Black Water", "overview": "Feel the fingers of fear on the nape of your neck in Project Zero: Maiden of Black Water. Explore dank, dark locations, exorcise malevolent apparitions with a strange camera, and tread deep into a mystery that spans this world and the next. Yuri, Miu and Ren are three souls about to experience an inexorable collision of fates. Drawn to the mysterious Mount Hikami, where a dark force resides, it’s a terrible certainty none will escape. Through the intertwining storylines of all three characters, explore abandoned apartments, twisting forest paths and spooky shrines, where dread is your constant companion, and shadows lick your heels… Like all good ghost stories, you’re not alone in this bleak world – spirits of the departed haunt the mountain; tortured souls unable to rest in peace. They do not take kindly to intrusions, and will round on you if you disturb them, the only defence being your Camera Obscura, a photographic portal into the supernatural realm. Raise the Wii U GamePad to activate the viewfinder, line up the perfect frame, then release the shutter to damage your target, giving off Spirit Fragments. Capture as many as possible in the next shot to increase your hit power, eventually exorcising the phantom, banishing it for ever. As you progress, you’ll access various upgrades: different film rolls offer faster reloads or greater stopping power, while new lenses can slow spirits down, or deal more damage, forcing them back. Water plays a major part, from the long rain of Mt. Hikami, to the sodden spectre of the Maiden herself. The more soaked you become, the more ghouls you’ll face, but your Camera Obscura’s spirit power will also rise. Fortunately, there are ways of drying off, but they’re small comfort as you attempt to unravel the mystery, and survive the numinous horrors of the foreboding mountain.", "platform": "Nintendo Wii U", "release_date": "October 22, 2015", "game_type": "Released", "esrb": "M - Mature", "developers": "Koei Tecmo", "publishers": "Nintendo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.37", "wikipedia": "https://en.wikipedia.org/wiki/Fatal_Frame:_Maiden_of_Black_Water", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33808-fatal-frame-maiden-of-black-water\n"}