{"altername_name": [], "name": "Finding Teddy II: Definitive Edition", "overview": "A little girl enters a portal to a world of fantasy called Exidus attempting to save her favorite plush friend… In Exidus, King Tarant rules over his kingdom with the love of his subjects. But this harmony creates envy and hatred among the most malicious subjects. Anguis the Magician decides to usurp the throne and takes control of the land. To prevent all creatures from escaping Exidus, Anguis the Magician seals the gates, and hides the four crystal eggs spreading them all over the kingdom. The little girl is trapped in Exidus, but can’t accept her faith. She embarks on a quest to save the Kingdom from all evil. Help King Tarant escape from his prison, and return the crystals to their rightful places where their common energy enables to open up the gate and defeat Anguis. Finding Teddy 2, is the new 2D nightmare adventure / action game with a pixel art retro twist. In this side scrolling platform adventure, you will need to upgrade your equipment and fight the evil forces of Anguis the Magician. Your mission will be complete when you’ll find your way out of this nightmare. Features: – Great Design and Pixel Art render. – Many riddles and mysteries to be solved. – Dozens of enemies to defeat. – Superb soundtrack to accompany your quest. – More than 20 hours of pure gaming adventure. – The perfect mixture of RPG, adventure and platform fun. (Please update your system if you want to play this game properly)", "platform": "Nintendo Wii U", "release_date": "January 1, 2020", "game_type": "Released", "esrb": "Not Rated", "developers": "Storybird", "publishers": "PixelHeart", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Chronicles_of_Teddy:_Harmony_of_Exidus", "video_link": "https://www.youtube.com/watch?v=vG6vxrUlWcE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153491-finding-teddy-ii-definitive-edition\n"}