{"altername_name": [], "name": "Ghost Blade HD", "overview": "Extreme bullet hell. Take up the challenge to save the Solar System. Ghost Blade HD is an intense bullet-hell shoot 'em up game, with satisfying and addictive score-based gameplay, with its tradition going back to the shooting games of the 1990s era. Designed with a modern graphic style and special effects, Ghost Blade also features an awesome 2-player mode! Ghost Blade HD Is easy to learn, yet hard to master. The Soundtrack based on the heydays of Japanese shmups and arcade sounds: Composer Rafael Dyll has already scored several console games (Söldner X-2. Rainbow Moon) and returns to his signature sound with the music featured in The Ghost Blade. Fusing J-Pop influences and typical 90s synths and with modern production values, Rafael provides an action-packed soundtrack with catchy leads and electronic beats. Story: 10,000 years ago an Artificial Intelligence known as Shira was built to protect the residents of Mars. As time passed the AI became corrupted and Shira started to attack the Mars colonies. With no way to defend itself against \"Evil Shira\" Mars calls for help. The Earth Defense Force fleet fights its way to Evil Shira and uses powerful lasers to destroy it. However, 'Evil Shira' secretly had a backup that flees into space and takes over an abandoned space station at the outskirts of the solar system. When the EDF notices the escape they send their bravest fighter after Evil Shira. You are this pilot, and your mission is to destroy Evil Shira before it can complete its new attack force and threaten the existence of the entire universe Features: - Beautiful, detailed HD Graphics - 5 Stages with HUGE Boss Enemies - 3 Player battle ships with different gun types - Instant Respawn - Practice Mode - Score Attack - Re-balanced difficulty - 3 difficulty modes: Easy, Normal and Hard - 60 FPS - Arcade Gameplay and Addictive Scoring System - Auto-bomb enabled Easy mode for beginners - Time released continues - 2-player local co-op mode for addictive fun - Incredible Soundtrack composed by Rafael Dyll (Söldner-X2 and Rainbow skies) - Online leaderboards - 37 Achievements", "platform": "Nintendo Wii U", "release_date": "February 28, 2017", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Hucast Games", "publishers": "2Dream", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.67", "wikipedia": "https://wiki.cemu.info/wiki/Ghost_Blade_HD", "video_link": "https://www.youtube.com/watch?v=diWykmWv38M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81663-ghost-blade-hd\n"}