{"altername_name": [], "name": "Jotun: Valhalla Edition", "overview": "Explore vast and varied regions of Norse purgatory, do battle with colossal beasts called jotun and impress the Gods in Jotun: Valhalla Edition, a hand-drawn action-exploration game for Wii U.Wander the path of Thora, a Viking warrior who suffered an inglorious fate and must now prove herself to the Gods in order to enter the sacred hall of Valhalla. Scour nine levels across five punishing realms in search of hidden runes, then awaken and slay the mighty jotun using only your trusty axe and the blessings of the old deities of Asgard. Brave brutal snowstorms, cross caverns of fire and tackle waves of enemies on your journey to uncover the long-hidden lairs of the jotun.Each battle against the formidable jotun is an epic struggle against the odds, putting your nerves, reflexes and courage to the test. These hulking elementals possess unimaginable brute strength and powerful abilities, but their gigantic size and sluggishness makes them vulnerable to the nimble feet of Thora. Evade their devastating blows and magical spells with desperate dodges, then smite them where they stand with strikes of your two-handed axe.Along your journey, head off the beaten track to seek out Shrines and receive almighty God Powers. Strike fear into the heart of your enemies with thunderous hammers and razor-sharp spears, shield yourself with the spirit of Heimdall or replenish your health with Frigg’s gift of healing. Increase your health bar by consuming life-giving apples that hang only from legendary trees, and visit the rejuvenating Mimir wells when you grow weary of battling. You can use the Wii U GamePad touch screen to quickly and accurately activate God Powers in the heat of battle, making those split-second decisions more manageable. Adventurers can also glance down at the map without having to pause the game, allowing for seamless exploration.Delve into a rich and fantastical world, inspired by the ancient texts of Norse mythology. Learn of the holy world tree that connects all the realms of the land, and of Ginnungagap, the primordial void of creation said to be older than time itself. Brace yourself for lands of blistering heat, callous cold and everything in between, and encounter a number of legendary mythical creatures throughout your perilous journey. A marriage of gorgeous hand-drawn art, traditional animation and expert sound design bring the mystifying world of Jotun: Valhalla Edition to life with stunning clarity. Hear an authentic Icelandic voiceover as the story unfolds, while subtle ambient sound effects complement a rousing orchestral soundtrack, specifically composed for every gameplay moment.If you really want to prove your worth, take on even mightier versions of the gigantic jotun in the super-challenging Valhalla Mode. This intense boss rush mode adds a timer and measures key aspects of your performance, including how much damage you take, how many God Powers you use and the number of times you fall in battle, allowing you to easily compare your scores with others. Do not fail to impress – the Gods will be watching!", "platform": "Nintendo Wii U", "release_date": "September 8, 2016", "game_type": "Released", "esrb": "T - Teen", "developers": "Thunder Lotus Games", "publishers": "Thunder Lotus Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Jotun_(video_game)", "video_link": "https://www.youtube.com/watch?v=4ZKdD-Vlepo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84315-jotun-valhalla-edition\n"}