{"altername_name": ["LEGO Star Wars: El Despertar de la Fuerza", "LEGO Star Wars: Das Erwachen der Macht"], "name": "LEGO Star Wars: The Force Awakens", "overview": "LEGO Star Wars: The Force Awakens is a Lego-themed action-adventure video game developed by TT Fusion, based on the film Star Wars: The Force Awakens. It is the fifth entry in TT Games' Lego Star Wars series. Under license from Lucasfilm, the game was released by Warner Bros. Interactive Entertainment for iOS, Microsoft Windows, PlayStation 3, PlayStation 4, Xbox 360, Xbox One, Nintendo 3DS, PlayStation Vita, and Wii U, on 28 June 2016, and for Android on 27 July 2016. The game was ported and released by Feral Interactive for OS X on 30 June 2016. In addition to adapting the film, the game includes content which covers the period between Return of the Jedi and The Force Awakens. The gameplay of Lego Star Wars: The Force Awakens is similar to previous Lego video games. New systems were introduced including Multi-Builds which grant players access to various building options. These options can be destroyed and rebuilt in certain brick-building sections of the game, allowing for new path to be opened within the game's world. Players can also hide behind cover and engage in \"Blaster Battles\" with enemies throughout the game. The game features over 200 playable characters, including Rey, Finn, Captain Phasma, Poe Dameron, Han Solo, Kylo Ren and droids, including C-3PO and BB-8, and locations, including Jakku and Starkiller Base. In addition to adapting the film, the game also bridged the gap between Return of the Jedi and The Force Awakens, with Lucasfilm allowing for creative freedom in the additional content that will explore the characters' backstories.", "platform": "Nintendo Wii U", "release_date": "June 28, 2016", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "TT Games", "publishers": "Warner Bros. Interactive Entertainment", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/Lego_Star_Wars:_The_Force_Awakens", "video_link": "https://www.youtube.com/watch?v=VNVjJvViTIA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72566-lego-star-wars-the-force-awakens\n"}