{"altername_name": ["Minecraft Wii U"], "name": "Minecraft: Wii U Edition", "overview": "Minecraft is a sandbox video game originally created by Swedish programmer Markus \"Notch\" Persson and later developed and published by Mojang. The creative and building aspects of Minecraft enable players to build constructions out of textured cubes in a 3D procedurally generated world. Other activities in the game include exploration, resource gathering, crafting, and combat. Multiple gameplay modes are available, including survival mode where the player must acquire resources to build the world and maintain health, a creative mode where players have unlimited resources to build with and the ability to fly, an adventure mode where players play custom maps created by other players and a spectator mode. The PC version of the game is renowned for its third-party mods, which add various new items, characters, and quests to the game. The alpha version was publicly released for PC on May 17, 2009, and after gradual updates, the full version was released on November 18, 2011. A version for Android was released a month earlier on October 7, and an iOS version was released on November 17, 2011. The game was released on the Xbox 360 as an Xbox Live Arcade game on May 9, 2012; on the PlayStation 3 on December 17, 2013; on the PlayStation 4 on September 4, 2014; on the Xbox One the next day; on the PlayStation Vita on October 14, 2014; and is scheduled for release on the Wii U on December 17, 2015. On December 10, 2014, a Windows Phone version was released. All versions of Minecraft receive periodic updates, with the console editions being co-developed by 4J Studios. Minecraft received five awards during the 2011 Game Developers Conference. Of the Game Developers Choice Awards, it won the Innovation Award, Best Downloadable Game Award, and Best Debut Game Award; from the Independent Games Festival, it won the Audience Award and the Seumas McNally Grand Prize. In 2012, Minecraft was awarded a Golden Joystick Award in the category Best Downloadable Game. As of June 2015, over 70 million copies had been sold, including 20 million between the Xbox 360 and Xbox One and 20 million on PC, making it the best-selling PC game to date and the third best-selling video game of all time. On September 15, 2014, Microsoft announced a deal to buy Mojang and the ownership of the Minecraft intellectual property for US$2.5 billion; the acquisition was completed on November 6, 2014.", "platform": "Nintendo Wii U", "release_date": "December 17, 2015", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "4J Studios", "publishers": "Mojang", "genres": "Action", "max_players": "8", "cooperative": "Yes", "rating": "3.73", "wikipedia": "https://en.wikipedia.org/wiki/Minecraft#Console_editions", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33298-minecraft-wii-u-edition\n"}