{"altername_name": [], "name": "Monkey Pirates", "overview": "Say ‘Ahoy!’ to the banana-loving Monkey Pirates, as they set sail on a multiplayer battle royale, available to download from Nintendo eShop for Wii U. Taking command of one of four Captain Monkeys, aim your cannons at up to three of your friends, while racing against the clock to collect as many bananas as possible. A free-for-all, four-way frenzy is busy enough but when a fifth player joins the fray as the Sea king, it adds an interesting twist: using the Wii U GamePad, they have a set of ‘Deeds’ to achieve – get a certain player into the lead, for instance – and can unleash bonuses and events to make it happen. You should expect the unexpected, and can bank on multiplayer mayhem! Although cannons do enough damage on their own, it’s the range of bonuses that’ll really get you ahead. Across nine arenas, you can choose which items to bash your friends with, from broadsides to mines to battering rams. But it’s not all offensive stuff – some bonuses will mean pop-up environmental hazards, forcing everyone to dodge events such as maelstroms, volcanoes and icebergs. There’s no such thing as a calm ocean in Monkey Pirates! Then there’s the weather. You’ll need to be an accomplished captain, as there are some strong winds to navigate. Keep your aim true, brake in the face of danger, and even skid across the waves. Shrewd manoeuvres are definitely the key to survival. Zip between criss-crossing cannonballs, then line up a fellow swashbuckler for a direct hit, sinking them down to Davy Jones’ locker! Life on the ocean waves has never been this entertaining! Up to five buccaneers can play in a frenzy of crazy multiplayer monkey action! A fifth player can use the Wii U GamePad to complete Deeds and affect battle as the Sea King Boatloads of bonuses to bolster your big guns and boost your booty!", "platform": "Nintendo Wii U", "release_date": "June 26, 2014", "game_type": "Released", "esrb": "E - Everyone", "developers": "Henchmen Studio", "publishers": "Henchmen Studio", "genres": "Action", "max_players": "5", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=1kIfcdKovQk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113974-monkey-pirates\n"}