{"altername_name": [], "name": "Puddle", "overview": "Make a splash in Puddle, available from Nintendo eShop for Wii U! Guide each puddle to its destination in this physics-based puzzle game – just try not to lose too much liquid on the way! Use the motion controls of the Wii U GamePad to tilt the environment to the left and right and move the fluid carefully towards your goal. Each type of fluid will be different and have its own, unique properties so make sure you understand each one in order to avoid the hazards that lie ahead. Move ahead cautiously and deliver your liquid lot safely past obstacles like fires, electric currents and carnivorous plants in 49 levels that have been specially remastered for Wii U. Try to take into account how each type of fluid might react in each situation: things like temperature and gravity will affect water, oil or molten lava, so make sure you judge wisely! Tilting too quickly can see some droplets left behind, but move the controller too slowly and you might not be able to make certain jumps with your goo. Compare your scores in a worldwide Leaderboard, or enter the world competition and try to win as many Medals and Challenges as you can. Will you beat the best players from the Puddle Community? Dive into Puddle now and protect your petite pool whilst enjoying the smooth motion controls of the Wii U GamePad. Liquid leisure awaits you on Wii U! *Tilt the GamePad and guide your puddle to safety in 49 fiendish levels. *Get to know your liquid and do your best to avoid hazards such as burning passageways, electric currents and carnivorous plants. *Try to win as many Medals and Challenges as you can in the Puddle Community.", "platform": "Nintendo Wii U", "release_date": "January 31, 2013", "game_type": "Released", "esrb": "T - Teen", "developers": "Neko Entertainment", "publishers": "Neko Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Puddle_(video_game)", "video_link": "https://www.youtube.com/watch?v=UuU2Hh1p_xQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84390-puddle\n"}