{"altername_name": ["Pullblox World", "Hikuosu World"], "name": "Pushmo World", "overview": "Experience the fist-pumping joy of push-pull puzzle solving in the latest entry of the critically acclaimed Pushmo series! Block-based puzzles, charming characters, and a built-in community make the Pushmo World game endless fun for puzzle solvers of all ages. When a kindly old inventor creates a wondrous park filled with puzzling playgrounds called Pushmo, a little trickster traps Mallo’s friends inside! Now it's up to our hero, Mallo, to push, pull, and climb his way through 250 mind-bending Pushmo playgrounds to save his friends. But the fun doesn’t stop there! World Pushmo Fair, a robust built-in community feature, makes it easier than ever to create, share, and play a near-limitless amount of custom puzzles created by players around the world! * Guide Mallo through his first brain-teasing adventure on the Wii U console * Take on 250 fun puzzles, including colorful mural stages * Visit Pushmo World Fair to play and rate custom Pushmo puzzles from around the world * Create custom puzzles in Pushmo Studio with a robust selection of tools Share your puzzles seamlessly via the World Pushmo Fair feature or QR Code patterns * Earn Stamps for your Miiverse posts * Puzzles shaped like real-world objects, animals, and Nintendo characters will impress your eyes and challenge your brain * Unlock special Mysterious Pushmo with new twists on gameplay, such as yin-yang blocks and timed blocks * Supports Off-TV Play using the Wii U GamePad controller", "platform": "Nintendo Wii U", "release_date": "June 19, 2014", "game_type": "Released", "esrb": "E - Everyone", "developers": "Intelligent Systems", "publishers": "Nintendo", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/Pushmo_World", "video_link": "https://www.youtube.com/watch?v=0noVqmZKYAY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84310-pushmo-world\n"}