{"altername_name": [], "name": "Race the Sun", "overview": "In Race the Sun, the player controls a solar-powered spacecraft as it races through a minimalist landscape with abstract shapes and various obstacles. Levels are pseudo-procedurally-generated and separated into distinct regions, each region having different sets of challenges. The ship's speed remains constant as long as the ship remains in direct sunlight, but if the ship falls into shadow or clips objects, the ship's speed will drop. Direct collision with an object will cause the ship to be destroyed and end the run. Further, if the player's ship remains in shadow too long — such as when the sun finally sets — the ship will stall and the run will be over. The player continually earns points as long as the ship is moving. Throughout each region are various collectable objects. The most common are blue pyramids that, if five are collected without any collisions, will boost the player's scoring multiplier by one. Others give the player's ship a short speed boost, a single-time jump to clear obstacles, and a single-time use shield to prevent the ship's destruction on a direct collision. There is also a larger meta-game feature that requires the player to complete various missions, three presented at any time, to earn experience points to build an experience level. Missions include scoring metrics, avoiding collisions during multiple regions, or colliding a number of times; some of which can be completed over multiple race attempts. Gaining a level grants a reward that helps in future races, such as starting with a higher scoring multiplier, gaining a booster for the ship to help collect powerups or store multiple jump boost, and the like. There are three levels included as part of the core game: a standard level, an \"apocalypse\" level in which the player moves faster through more difficult obstacles, and a maze-style obstacle course played from a top-down perspective. These regions and levels change on a daily basis for all players, and online scoreboards allow users to compare their performance to others. The game also includes Steam Workshop integration, through which players can play levels created by other players.", "platform": "Nintendo Wii U", "release_date": "August 19, 2013", "game_type": "Released", "esrb": "E - Everyone", "developers": "FlippFly", "publishers": "Flippfly", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Race_the_Sun_(video_game)", "video_link": "https://www.youtube.com/watch?v=IpAg29_ZH9s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114515-race-the-sun\n"}