{"altername_name": [], "name": "Severed", "overview": "Cut free from a nightmarish dimension in Severed, a first-person dungeon crawler with unique touch controls for Nintendo eShop on Wii U. Wield the immense power of a living sword and slice through enemies in tactical battles to save your family from a grim fate. One night, you awaken in a strange place, dazed and confused. You come across a house that looks suspiciously like your own and decide to investigate. Inside, you glimpse a mirror – your reflection stares back at you, but something is horribly wrong. Your arm has been severed from your body, and visions of your family being dragged into a strange realm by unknown forces scream through your head. A grotesque creature appears behind you, grants you a sword and tells you that, though this house may seem like your home, it is not. You’ve been transported into a strange void along with your family, but they’re nowhere to be seen. Now, you must embark on a perilous journey to find them and return home. Navigate creative, maze-like dungeons – some of which are huge, living creatures – filled with unnerving beasts, treacherous traps and perplexing puzzles. Move around in a first-person perspective and closely survey your surroundings for clues as you journey into the unknown. Throughout your eerie adventure, you’ll be confronted by all sorts of terrifying and monstrous creatures. By swiping on the Wii U GamePad touch screen, you can swing your sword in different directions – slash away at the ghoulish monsters to inflict damage, or parry their attacks in defence. Use long swiping motions to deal more damage, and strike at precise angles to devastate weak spots in enemy armour. When you’re surrounded by enemies, battles become a frantic and frenzied mix of careful observation and furious sword swinging. Each type of enemy has its own attack pattern that you’ll need to study and memorise. Keep an eye out for any enemies that are about to attack, then quickly turn to face them and unleash a flurry of melee attacks to keep the beast at bay. Juggling multiple enemies is a trying test of your time management, dexterity and reflexes. Chain together combos to build your Focus meter. When your Focus is maxed, activate the finishing Sever Mode for a chance to detach enemy limbs, then use them to upgrade a number of skills. If you successfully Sever a boss, you’ll be able to create sturdy armour from the spoils, granting you powerful new abilities. Incapacitate foes with the Blind ability, go into a fiery Rage to deal more damage, or Devour magical enemy buffs to use them as your own and dominate the opposition. Revisit areas with new powers to get a fresh perspective and find hidden secrets. Once you unlock the Charge Slash, you’ll be able to deliver more powerful strikes in combat and smash through obstructions that once blocked your path, opening up new areas. Experience a unique touch adventure that’s a cut above in Severed, an otherworldly dungeon-crawler for Nintendo eShop on Wii U.", "platform": "Nintendo Wii U", "release_date": "September 22, 2016", "game_type": "Released", "esrb": "T - Teen", "developers": "Drinkbox Studios", "publishers": "Drinkbox Studios", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "https://en.wikipedia.org/wiki/Severed_(video_game)", "video_link": "https://www.youtube.com/watch?v=imeyt0c3Ovc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84344-severed\n"}