{"altername_name": [], "name": "Skylanders Giants", "overview": "Skylanders Giants is the second game in the Skylanders series and the direct sequel to Spyro's Adventure. Kaos, previously defeated by the Skylanders, finds himself in a toy store on Earth. He finds a portal and goes back to an era where Arkeyans, an evil robot race, ruled the Skylands. Like the previous game, it uses figures which through an accessory called 'Portal' allow to play as the character in the game. The original figures are compatible with the game, but new series of stronger characters are introduced. One of the new characters are the eponymous Giants. These are larger than Skylanders, up to twice as big, and have different in-game abilities such as picking-up large objects and throw them to clear a pathway. The character can be changed at any time by switching the figure standing on the portal. The levels consist of platform maps containing puzzles, enemies, breakable objects that yield money and various treasures. Each level has different goals that must be met to achieve a three-star rating. Once the first level is cleared, the player gains access to a hub from which the levels can be replayed to master it and reach every goal. Some treasures will reward the player with equipment items that change the character's looks and improve their abilities. Those changes are encrypted in the figure and will be effective in other games if the same figure is used; the figures can be reset from the game menu. A new Battle mode with new areas and alter-ego Skylanders is introduced for multiplayer versus play. The Starter Pack includes the Skylanders Giants game and the following: A Portal of Power Jet-Vac figure Cynder figure Tree Rex figure Three character sticker Sheets with secret codes Three trading cards A poster Only Tree Rex is included in the Portal Owners Pack. A legendary version of Jet-Vac is also available as part of a exclusive legendary triple pack, and a glow-in-the-dark version of Cynder is included in the Wal-Mart exclusive versions of the Starter Pack.", "platform": "Nintendo Wii U", "release_date": "November 18, 2012", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Toys for Bob", "publishers": "Activision", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14140-skylanders-giants\n"}