{"altername_name": [], "name": "Skylanders: SWAP Force", "overview": "When the Volcano of Cloudbreak Islands erupts, elementals perform a magic ritual. It is during a battle against the forces of evil who attacked during this ritual that sixteen Skylanders acquired a new power: they are now able to swap their top and lower halves with each other. These new Skylanders now have joined Flynn and the others in the task of protecting Cloudbreak Islands from Kaos, under the request from Woodburrow's villagers. The game starts when a girl from Woodburrow lands on Flynn's ship to request the Skylander's help. The player must first protect the ship from waves of enemies (the ship crashes anyway), then reach Woodburrow, which will act as the game hub from this point onward. The levels are made of branching paths with some puzzles and enemies, in which the Skylander figure placed on the Portal of Power, who now have the ability to jump, explores and gain gold, experience and finds the many treasures needed to get all of each level's three stars. Some of the paths can only be accessed by Skylanders of a specific element, and the new Swap Skylanders can access paths for which two different elements are needed. The Swap Skylanders have specific abilities on both their top and bottom halves; the top has attack abilities while the bottom has movement and defensive abilities. The bottom also has a Swap Zone power, which is needed to access special challenges that will then be available to play again from Woodburrow. Each completed level can also be replayed to find more hidden treasures when new Skylanders are available. Each Skylander progresses by gaining experience and by upgrading their skills in special pods found in Woodburrow or in the levels themselves. The character progress data is then stored in the character figure. The Starter Pack includes: Skylanders: Swap Force game and Portal of Power Wash Buckler Blast Zone Ninja Stealth Elf Three character trading cards Three character sticker sheets A Skylanders: Swap Force collector's poster Some releases of the WiiU bundle had an exclusive green and gold color shift Wash Buckler.", "platform": "Nintendo Wii U", "release_date": "October 13, 2013", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Vicarious Visions", "publishers": "Activision Publishing", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Skylanders:_Swap_Force", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/19164-skylanders-swap-force\n"}