{"altername_name": [], "name": "Skylanders: Imaginators", "overview": "Unleash the power of your imagination in Skylanders Imaginators for Wii U! Create your very own Skylanders – or use existing ones – and battle in the ultimate adventure alongside the almighty Senseis to save Skylands. Imagine that! Skylands is in danger – Kaos has discovered the ancient power of Mind Magic, and he’s using it to unleash an unstoppable army of Doomlanders. Our only hope is you, Portal Master! Join Skylands’ most mystical and powerful warriors, the Senseis, and stop Kaos with the help of a newly-discovered superpower – your imagination! Use the mysterious Imaginite Creation Crystals to create and customise your very own Skylanders, known as Imaginators. Skylanders Imaginators provides immense customisation possibilities – including appearance, powers, abilities, name, catchphrase, musical theme and much more – so you can make the wildest Skylanders imaginable! Skylanders Imaginators also supports all Skylanders toys from previous games*. Introducing Skylanders Senseis – all-new heroes who represent 10 powerful Battle Classes such as Knight, Sorcerer, Bowslinger, Brawler and more. Skylanders Senseis help train created Imaginators by offering a range of benefits, such as unlocking super-cool Imaginator weapons, providing access to special areas in the game, and bestowing Secret Techniques across the Battle Classes. Senseis also have their own unique benefits including the extraordinary ability to unleash Sky-Chi – the ultimate Battle Class super move. There are a total of 31 Senseis, which include some fan-favourite villains who have been reformed and now fight for good! Dream up your ultimate Skylanders and put them to work against the evil Kaos in Skylanders Imaginators for Wii U. *Some in-game functionality may vary.", "platform": "Nintendo Wii U", "release_date": "October 16, 2016", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Toys for Bob", "publishers": "Activision", "genres": "", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119056-skylanders-imaginators\n"}