{"altername_name": ["Marvel Avengers: Kampf um die Erde"], "name": "The Avengers: Battle for Earth", "overview": "The Avengers: Battle for Earth is a versus fighting game designed around motion controls. It is based on the 2008 Marvel comics storyline Secret Invasion, in which the Skrulls, shapeshifting aliens, have taken the place of many of the Marvel universe's superheroes, with the remaining genuine heroes having to team up to defeat the menace. The game features five different arenas and 20 Marvel characters, both heroes and villains, from the world of the Avengers, the X-Men, the Fantastic Four, and Spider-Man. Game modes include a training mode which has sparring fights, general training which teaches basic attacks and moves, hero-specific training that focuses on a hero's unique special moves, and trial challenges, which set certain restrictions on how to win a fight. The game's main single-player mode is the campaign, which consists of 40 fights in total, with eight fights per arena. Playing through the campaign is necessary to unlock all 20 characters. In this mode, the player always controls the real heroes and fights Skrull doppelgangers. Between the fights, cutscenes consisting of panels from the original comics illustrate the storyline. Another single-player mode is arcade mode, which consists of ladder matches against all characters. Only the Xbox 360 version allows co-op play in the single player modes. Dedicated multiplayer modes on both consoles include two-player versus and a three-or four-player tournament mode which features elimination brackets.", "platform": "Nintendo Wii U", "release_date": "December 4, 2012", "game_type": "Released", "esrb": "T - Teen", "developers": "Ubisoft", "publishers": "Ubisoft", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Marvel_Avengers:_Battle_for_Earth", "video_link": "https://www.youtube.com/watch?v=lnphf4KJY8o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11315-the-avengers-battle-for-earth\n"}