{"altername_name": [], "name": "The Book of Unwritten Tales 2", "overview": "The Tale Legend foretold it. Prophecies predicted it. Chosen ones chose to believe in it. Now the adventure saga continues. A sequel is coming. Join Wilbur, Ivo, Nate and Critter in another classic point-and-click adventure in the wicked world of Aventasia. Help them fulfill their destiny. A destiny as yet unwritten. A few years have passed since our heroes heroically defeated the arch-witch Mortroga. And their lives, like the lives of most people in Aventasia, are still in turmoil. The War of the Two Towers is over, but the wounds it left upon the land are still bleeding. The gnome Wilbur Weathervane is struggling with his new job as a teacher at the reopened School for Wizardry and Witchcraft. His magic wand is having a mind of its own and an assassination plot against the arch-mage overshadows the first democratic elections in Sea stone. Faced with political intrigues that threaten the delicate balance of peace, Wilbur is in dire need of his old friends. But the elf princess Ivo and the adventurer Nate have, after a brief romantic interlude, gone their separate ways. Ivo has returned to her gilded cage in the elf kingdom, overprotected by her controlling mother. Nate along with his trusty companion Critter has been taken prisoner on the flying island of his arch-enemy the Red Pirate. But fate does not rest. A darkness has fallen upon the land, or rather, a pinkness. A magic force is turning mighty beasts into fluffy plush puppies and towering castles into oversized dollhouses. Every world needs its heroes. However unlikely they may seem.", "platform": "Nintendo Wii U", "release_date": "2016", "game_type": "Released", "esrb": "T - Teen", "developers": "King Art Games", "publishers": "Nordic Games", "genres": "", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "https://en.wikipedia.org/wiki/The_Book_of_Unwritten_Tales_2", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/48670-the-book-of-unwritten-tales-2\n"}