{"altername_name": [], "name": "Thomas Was Alone", "overview": "Thomas Was Alone is an indie puzzle platformer video game created by Mike Bithell, originally released as a Flash-based browser game in October 2010. The game was expanded and released to Microsoft Windows and OS X systems in July 2012. PlayStation 3 and PlayStation Vita versions with new content were released in April 2013, while a Linux version was released as part of the game's inclusion in The Humble Indie Bundle 8 in May 2013. The game was released for iPad devices in May 2014, and for other iOS devices and Android devices in July 2014. The game was also released on Xbox One, PlayStation 4 and Wii U in November 2014. In the game, the player controls one or more simple rectangles representing several out-of-control artificial intelligence entities, working with the shapes to get each to their individual end points on each level. Each shape is characterized with a unique name and personality, including the eponymous Thomas, which are conveyed to the player through the use of a narrator, voiced by Danny Wallace and whose performance earned the game a BAFTA Games Award. Thomas Was Alone takes place within a computer mainframe, where some unspecified \"Event\" has caused several artificial intelligence routines to run out of control and gain personalities. Each entity is represented by a simple coloured shape; the game's eponymous character is a simple red rectangle. Each shape has unique abilities; while all shapes can move left or right across platforms and perform jumps, the height of these jumps may be limited by the shape, or may have other abilities such as being able to float on water. When the player has access to two or more of these shapes, they can freely switch between them, controlling one shape at a time. Though the shapes themselves cannot be heard, the narrator describes the personalities and thoughts of each shape as the game progresses. The goal on each level within the game is to direct the shapes to exit points specifically tied to each shape, so that they all simultaneously occupy this exit. This most often requires using the shape abilities together to manoeuvre them appropriately. A shape that cannot jump very high can be helped by creating a staircase from other shapes so that the shape can reach a higher platform, or the shape that can float can ferry the other shapes across water. A shape can be lost to several hazards, but it will reappear at the start of the level, or at a checkpoint if the shape has passed such a point. There are ten sets of levels, each introducing a new character, with ten levels within each set.", "platform": "Nintendo Wii U", "release_date": "November 25, 2014", "game_type": "Released", "esrb": "E - Everyone", "developers": "Carbon Games", "publishers": "Curve Digital Publishing", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Thomas_Was_Alone", "video_link": "https://www.youtube.com/watch?v=S_4C0UEv4Nk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114535-thomas-was-alone\n"}