{"altername_name": [], "name": "Toto Temple Deluxe", "overview": "Toto Temple Deluxe is a fast-paced, local-multiplayer king-of-the-hill style game in which players must steal an egg-laying goat from their friends and try to keep it on their own head for as long as possible. You know, normal stuff. Dashing Gameplay Infinitely dash in any direction to swiftly move around and powerfully headbutt the goat carrier to steal its four-legged booty. Escape your jealous opponents and protect the goat by blocking their attacks with a well-timed shield pop! You’ll \"get their goat\", guaranteed. Classic Mode Prove you’re the ultimate shepherd in Classic mode: Gather 3k points first by holding on to the goat, collecting coins hatched from goat eggs (yeah… don’t ask) and harnessing the power of powerful power-ups! Play as teams or in free-for-all. Bomb Mode Blast everyone’s face off in Bomb mode: Be the first to grab the explosive goat (we know, stop interrupting us) and keep it long enough for it to detonate near your soon-to-be-dead rivals. Lose the goat and the timer resets! Play as teams or in free-for-all. Temples Each temple offers a unique, exploitable mechanic for you to discover. Use them wisely and outsmart your opponents like they don’t even... what?… how did you..? Bots Bots will play with you whenever you want and for as long as you want. They never complain. They also never open up your fridge and ask if they can eat that pizza slice you got left from last night. Bots are awesome. Oh, and you can change their difficulty level too, because they will probably kick your ass-tonishing little bottom.", "platform": "Nintendo Wii U", "release_date": "October 1, 2015", "game_type": "Released", "esrb": "E - Everyone", "developers": "Juicy Beast Studio", "publishers": "Juicy Beast Studio", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=BapLTz7wfiI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165732-toto-temple-deluxe\n"}