{"altername_name": [], "name": "Trine: Enchanted Edition", "overview": "The player controls and switches between three different characters (a thief, a knight, and a wizard) to try to complete levels. There is also a cooperative play feature, whereby multiple players can join in at any time to control different characters simultaneously. Each character has their own health and energy meter. Energy is used for certain weapons and abilities, and is replenished by blue-colored bottles found throughout levels. Health is replenished by collecting heart-shaped containers, which result from destroying certain enemies. The player also has a single experience rating that is shared among all characters, and is incremented by acquiring green-colored bottles found throughout levels. Every 50 experience points, each character is given one point towards the purchase of upgrades to their abilities. Treasure chests are also spread throughout levels, each containing a charm that offers the bearing character new or upgraded abilities. The player can transfer these objects between characters, though some will only have an effect on certain characters. Checkpoints are spread throughout levels, in the form of silver orbs on pedestals. Upon crossing a checkpoint, any deceased characters are brought back to life, and any characters below a certain amount of health and energy are replenished up to that amount. The amount of energy and health replenished is dependent upon the difficulty setting chosen by the player. When a character dies, the player must choose another living character to continue playing the level. If all three characters die, the player is sent back to the last checkpoint crossed, and all three characters are resurrected. Enemies primarily include walking skeletons, spiders, and bats, along with boss characters, like giant skeletons and other large creatures. Some skeletons are armed with swords, others with bows and arrows, some spit fire, and some have shields. Skeletons are capable of scaling walls. Other dangers include lava, fireballs, giant sharp pendulums, and various other booby traps.", "platform": "Nintendo Wii U", "release_date": "March 12, 2015", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Frozenbyte", "publishers": "Nobilis", "genres": "Adventure", "max_players": "3", "cooperative": "Yes", "rating": "3.1", "wikipedia": "https://en.wikipedia.org/wiki/Trine_(video_game)", "video_link": "https://www.youtube.com/watch?v=-SgAgKsm5sA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114516-trine-enchanted-edition\n"}