{"altername_name": [], "name": "UnEpic", "overview": "Unepic is a role-playing platformer and Metroidvania game, and includes a number of RPG elements, such as levels, skill points, and equipment. It has non-linear gameplay, and was inspired by the MSX game Maze of Galious. Players can utilize a number of melee and ranged weapons and armors as determined by their level and skill points assigned to an applicable type of equipment. Simple crafting for potions is also available in limited locations, and merchants are present throughout the game, believing the player is a possessed monster. Also included are UNepic Points which are awarded for completion of long and difficult challenges, and allow the purchase of powerful and comical equipment, such as laser guns, flamethrowers, and rocket launchers. Plot: Daniel was just an average guy. He was a great videogame player, a big fan of sci-fi movies, and a novice RPG player. In the midst of an RPG, he was teleported to a castle. At first, Daniel believed that he was having a massive hallucination. Eager to keep playing within the RPG to create his own adventure, he decides to go along for the ride until his delirium comes to an end. Once inside the castle, Daniel is inhabited by a mysterious shadow. This dark spirit can communicate with Daniel, but not control him. The shadow has a simple goal: to escape from the prison of Daniel's body. There's a catch, though the dark spirit can only escape if Daniel perishes. Struggling against enemies in the castle, with the dark spirit attempting to murder him at every turn. Daniel finally discovers his goal: to kill Harnakon, the master of the castle, and free the Pure-Spirits who are trapped within. While the stage seems set for a typical role-playing adventure, Daniel will soon discover that everything is not what it seems.", "platform": "Nintendo Wii U", "release_date": "January 16, 2014", "game_type": "Released", "esrb": "T - Teen", "developers": "Francisco Téllez de Meneses", "publishers": "Ninagamers", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "https://en.wikipedia.org/wiki/Unepic", "video_link": "https://www.youtube.com/watch?v=DQrVNPPjtuE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114517-unepic\n"}