{"altername_name": [], "name": "Ziggurat", "overview": "Ziggurat is a first-person shooter similar to Tower of Guns that borrows many elements from the roguelike games. Game elements include permadeath, randomized environments and enemies, random pick-ups, weapons, items and skills. The game has a fantasy theme and the protagonist is an apprentice of the Greyborn citadel, established by the Daedalon brothers wizards, where aspiring wizards are trained. Their final test is the Ziggurat where novices go to die or survive and become part of the citadel's inner circle. The tower-like Ziggurat consists of several floors that need to be completed with a single life. The game has permadeath but it is possible to save progress after completing a floor to continue another time. The game emphasizes fast-paced movement including sprinting, jumping and using platforms in the environment, fighting against large hordes in small rooms, but optionally auto-aiming can be enabled. Each floor is generated with a random pattern and it consists of several floors linked together by corridors. To complete a level a guardian boss needs to be defeated, but it can only be summoned when a portal key has first been located elsewhere. A typical room spawns a large amount of minions that need to be defeated before the doors open again. There is a chance of a random effect when entering a room, for instance creating larger enemies, doing more damage, making them invisible etc. Other types of rooms that can be part of a floor are a treasure room with a powerful item, a hazard room where an environmental hazard needs to be avoided, a shrine where health or mana can be offered to the gods in exchange for an additional effect or modifier, and a lore room where an ancient scroll can be found, providing knowledge. Each floor also has a secret room hidden behind a cracked wall. Inside one of two skills can be chosen and it also shows information about one of the developer's earlier games. At the start the player chooses one of several characters with different statistics and modifiers, presented as different classes, but only one is available in the beginning as the others are unlocked gradually. The default weapons is a magic wand that shoots projectiles. It has unlimited ammo, but requires some time for ammo to be refilled entirely. Three additional types of weapons can be picked up, tied to three limited mana sources. Each mana source offers several weapons per type, but only one per type can be carried at all times, so a maximum of four weapons in total. At the start of a floor a new weapon is always offered to optionally pick up or exchange. Each weapon has a regular attack, and a powerful attack that consumes more. Weapons include staffs, grenades, homing projectiles, charges that freeze opponents etc. They all use ranged attacks so the character needs to keep a distance, but still needs to move in to collect the items left behind by defeated enemies before they vanish. Unlike many roguelike games the game emphasizes combat skills to survive instead of relying on the randomness of provided items. By defeating enemies and for instance locating lore, experience is gained to level up. The character becomes stronger, but with each new level a selection between two random skills is offered so the player has a choice what skills or perks to use. Examples of skills are improved health or mana, reduced consumption rates, additional health for entering a new room or breaking objects, more or less loot drops, amulets to receive health or mana at a specific moment etc. Defeated enemies also leave behind health, mana and other types of objects. After each game session additional weapons, items, characters, skills, game modes and difficulty levels are unlocked gradually, to use in a next one.", "platform": "Nintendo Wii U", "release_date": "August 18, 2016", "game_type": "Released", "esrb": "T - Teen", "developers": "Milkstone Studios", "publishers": "Milkstone Studios", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Ziggurat_(2014_video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118081-ziggurat\n"}