{"altername_name": ["'98 Koushien: Koukou Yakyuu Simulation"], "name": "'98 Koshien", "overview": "Baseball is one of the most popular sports in Japan. It was introduced to Japan in 1872 by Horace Wilson, who taught at the Kaisei School in Tokyo. The first baseball team was called the Shimbashi Athletic Club and was established in 1878. Baseball has been a popular sport ever since. It is called yakyu in Japanese, combining the characters for fielding and ball. In Japan, high school baseball generally refers to the 2 annual baseball tournaments played by high schools nationwide culminating at a final showdown at Hanshin Koshien Stadium in Nishinomiya, Japan. They are organized by the Japan High School Baseball Federation in association with Mainichi Shimbun for the National High School Baseball Invitational Tournament in the spring (also known as \"Spring Koshien\") and Asahi Shimbun for the National High School Baseball Championship in the summer (also known as \"Summer Koshien\"). These nationwide tournaments enjoy widespread popularity, arguably equal to or greater than professional baseball. Qualifying tournaments are often televised locally and each game of the final stage at Koshien is televised nationally on NHK. The tournaments have become a national tradition, and large numbers of frenzied students and parents travel from hometowns to cheer for their local team. It is a common sight to see players walking off the field in tears after being eliminated from the tournament by a loss. '98 Koshien is a 3D baseball game with different game modes that includes vs and story mode. The game focus in the high school baseball tournaments and got data of more than 4129 japanese high schools. The game features different baseball strategies and tactics.The game allows the player to train his players and their teamwork. The goal of the game is to win the '98 Koshien Baseball championship. The game also allows the player to edit the team logo, school hymn or the team uniforms.", "platform": "Sony Playstation", "release_date": "June 18, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Magical Company", "publishers": "Magical Company", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/K%C5%8Dshien_(series)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73584-98-koshien\n"}