{"altername_name": [], "name": "3x3 Eyes: Tenrinougenmu", "overview": "Tenrin Ō Genmu is one of the games based on the manga and anime series 3x3 Eyes. It tells the story of Yakumo, a normal Japanese teenager who studies and works as a waiter, and Pai, a girl who belongs to the race of sanzhiyan, the immortal three-eyed people. After having discovered the secret of eternal youth and immortality many hundred years ago, the sanzhiyan could not remain human, and became cruel demons capable of possessing people and turning them into \"wu\" (Chinese for \"nothing\") - immortal, powerful, and obedient servants. Pai, who looks like a young girl, but is nevertheless three hundred years old, was terrified by what the sanzhiyan have become, and swore she will find a way to become human again. She meets Yakumo, whose late father was a scientist who helped Pai on her quest. Accidentally, Pai uses the powers of her third eye on Yakumo, and he becomes her Wu! Trying to regain their lost humanity, Yakumo and Pai are confronted by the evil Benares, the Wu of the sanzhiyan ruler Kaiyanwang. In pursuit of Benares and his henchmen, Yakumo and Pai travel to India, the Easter Island, and many other countries. Will they be able to stop Benares and become human again? The game is a puzzle-less adventure in Japanese fashion, which plays like an interactive anime. The game contains many animated cutscenes, and the locations of the game are still shots in anime style. Unlike most Japanese adventures, the player interacts with the game world not by choosing commands from a menu, but by moving a cursor on the screen. Once the cursor is placed on an object possible to interact with, it is highlighted with an additional command, such as \"look\", \"talk\", etc.", "platform": "Sony Playstation", "release_date": "December 31, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Nippon Create", "publishers": "King Records", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/58704-3x3-eyes-tenrinougenmu\n"}