{"altername_name": ["Advanced Variable Geo", "SuperLite 1500 Series: Advanced V.G."], "name": "Advanced V.G.", "overview": "An updated version of the original Variable Geo game for the NEC PC9800 which adds three new playable characters, a storyline which features Yuka as the main character (who has a clone), and includes a pair of \"True\" bosses, the genetically engineered \"Hybrid\" warriors K-1 and K-2. This game was originally released for the NEC Turbo-CD later updated for Sega Saturn and Sony PlayStation with updated graphics and sound. The only major difference between the Saturn and PlayStation versions is that the Saturn version retains the \"Graphic Mode\" setting which allows the viewing of the hentai scenes, not available in the PlayStation version. Variable Geo, also known as V.G., is a Japanese 2D fighting game series developed and published by Giga for home computers. It was also developed and published by Technical Group Labroratory (TGL) for home game consoles. It focuses on an all-female martial arts competition where participants are required to promote various family restaurants by acting as waitresses when not fighting. STORY: Set in a near-future version of Japan, the games tell the story of a martial arts tournament created to determine the country's strongest woman. The tournaments are sponsored by a number of family restaurants, who in exchange for their sponsorship, are given promotion in the form of having a tournament entry work as a waitress. As a result of the popularity of the tournaments, the restaurants experience a boom in patronage. The winner of the tournament is awarded the title \"Virgin Goddess\", as well as a large cash prize of ten billion yen, and a house erected anywhere on the planet they should choose. However, when a given waitress is defeated, they are required to publicly strip themselves of their clothing (self-fondling and public masturbation may be forced upon the loser, and in the most extreme cases, the loser is raped/gang-raped, either in private or in front of an audience), in order to teach the so-called \"true\" shame of defeat. In spite of such humiliation, the tournaments often draw many competitors, each placing their pride and their dreams on the line as they battle for the top.", "platform": "Sony Playstation", "release_date": "March 19, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "TGL", "publishers": "TGL", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.96", "wikipedia": "https://en.wikipedia.org/wiki/Variable_Geo", "video_link": "https://www.youtube.com/watch?v=GTcMWjLv9Q0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24369-advanced-vg\n"}