{"altername_name": ["Aitakute... - Your Smiles in My Heart - Oroshitate no Diary - Introduction Disc"], "name": "Aitakute... Your Smiles in My Heart", "overview": "You're in tenth grade, your parents are out of the country for a year, and your new private school has affairs of the heart as a major elective. If that isn't reason enough to get chummy with the opposite sex, you're also a teenage male, and your father has decided that he'll find you a \"really nice\" girlfriend if you can't do it yourself. Throw in the fact that the only person you know at this new school is a Casanova who turned down a top-ten prep school because it wasn't coed, and one has the ingredients for a good old-fashioned romance sim. As Shinya Ichinose, the player examines a variety of sloe-eyed high school girls through his daily interactions with them in the school environment. Once their characters, dispositions, and interest (or lack thereof) in the player become more clear through their own statements and interactive events, the pursuit phase begins. The first goal--one that is traditionally laid out as the be-all and the end-all in romance sims--is to make yourself agreeable to the girl and eventually ask her out on a date. The tedious details of daily life can be taken care of selecting \"Everyday Goals\" in the auto-play configuration. Personality parameters can be adjusted either to the player's tastes or some chosen girl's preferences. For the more important things, manual play mode will allow the player to arrange the hot date by phoning to ask a girl out, reserving concert tickets, and buying presents. The player can also stake out a nice romantic spot or find a part-time job to pay for all this extravagance. Unlike most romance sims, Aitakute's game play extends beyond the actual asking out. The player can take his (or her) new girlfriend to a cafe, karaoke bar, or a pretty hillside and do most of the things that typically happen on a date, whether it be talking or kissing. One wrong comment or an inappropriate choice of venue could sour the event, however, and the player is left to attempt damage control. The major hallmark of success in this game is something quite unlikely: nicknames. The player selects a nickname to be given to Shinya by one of the girls on the first day of school, and as Shinya builds a more intimate relationship with whomever the woman of his choice may be, she will start to refer to him by that name. Conversely, the woman will also allow Shinya the privilege of calling her by a pet name.", "platform": "Sony Playstation", "release_date": "March 16, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Visual Novel", "max_players": "1", "cooperative": "No", "rating": "3.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106167-aitakute-your-smiles-in-my-heart\n"}