{"altername_name": [], "name": "Alice in Cyberland", "overview": "Tokyo, the 21st century. The internet has grown to be an enormously important part of life, and a digital world called \"Cyberland\" has come into existence. This digital world is divided into eight levels, with more important and confidential information being granted higher levels of priority, with the highest levels being inaccessible to anyone other than those with the highest government security clearance. A young junior-high student named Alice Minazuki is the daughter of one of the developers of this system. He left her with a very special \"dive system,\" which allows the user to enter the deepest parts of Cyberland. Together with her friends Rena Ohtori and Juri Yagami, they are ALICE-3, a team tasked with maintaining peace and order in Cyberland. Alice in Cyberland is a traditional Japanese-style adventure game divided into chapters. Each chapter begins with Alice and her friends in Tokyo, and you can move about the city talking to people to find out more about what's happening. Eventually, she'll need to \"dive\" into Cyberland, which is also represented by a city. Your team will be able to move around, investigating different systems and looking for information, and eventually running into enemy \"guard programs\" which must be fought. The battle system is simple, allowing for either attack, defense, and character change. Defeating a guard system will continue the story. While exploring Tokyo, you can also visit an arcade and play a game, or go to a Karaoke club and watch the girls sing. The game's scenario was written by Chiaki Konaka, better known for his work on serial experiments lain, The Big O, and Ultraman.", "platform": "Sony Playstation", "release_date": "December 20, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Glams", "publishers": "Glams", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/85493-alice-in-cyberland\n"}