{"altername_name": [], "name": "Alone in the Dark: The New Nightmare", "overview": "Edward Carnby, private eye of the paranormal, is back. Carnby's best friend, Charles Fiske, has been found dead near Shadow Island, a mysterious island near Maine. It is your duty to take up the investigation and find out the secrets of Shadow Island. But you're not going alone... your companion will be a redhead by the name of Aline Cedrac who has her own reasons for tagging along. Aside from being a woman and inexperienced in the world of danger, she is the only one with the knowledge for translating the ancient Abkhani tabloids which may hold the secrets behind Carnby's friend's death and the disappearance of Aline's father. Upon arriving on the island, your plane has been shot down by the things unknown, and the heroes have no other choice but to jump with a parachute, thus separating them on the island. Now you choose the character to play with, either as Edward Carnby or Aline Cedrac, as they explore the mysterious and gloomy island with all its secrets and parallel stories that contain different locations and tasks for different characters, thus adding the level of replayability in a different experience - Carnby's story is more action oriented while Cedrac has more puzzles to solve. Just like in the predecessors you move your characters through pre-rendered backgrounds while the camera perspective switches around. You collect various items and books which are used to solve puzzles. Many situations can only be solved with violence which means you'll have to use guns to get rid of your foes. Aiming is manual and especially when playing Cedrac ammo is scarce. Saving a game uses up a save medallion which can be found during the game.", "platform": "Sony Playstation", "release_date": "June 18, 2001", "game_type": "Released", "esrb": "M - Mature", "developers": "Darkworks", "publishers": "Infogrames", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.03", "wikipedia": "https://en.wikipedia.org/wiki/Alone_in_the_Dark:_The_New_Nightmare", "video_link": "https://www.youtube.com/watch?v=dxLVq6xvgWc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/472-alone-in-the-dark-the-new-nightmare\n"}