{"altername_name": [], "name": "Andretti Racing", "overview": "Strap yourself in and crank up the engine, Andretti Racing brings the thrills and spills of stock car and Formula-1 racing to the PlayStation! Depending on personal preference, players now have the opportunity to drive around circular tracks in a NASCAR fashion or race at breakneck speeds in an Indy car circuit. Andretti Racing comes with a variety of options including the Exhibition Race, Career, Versus, and Racing School gameplay modes. The Exhibition Race is simply a single race using either racing type. It is designed to not only save players the hassle of starting an actual Career mode, but to get them accustomed to the various racing controls. In addition to this practice of sorts, new players interested in mastering or learning the sport should check out the Racing School. Featuring the help of Mario Andretti, Michael Andretti, and Jeff Andretti, the Racing School is a series of instructional videos that outlines the sport and gives inside information on how individual Formula-1 and stock cars are put together. When you're ready to tackle a full season of racing, the Career mode throws you into the mix of either racing circuit. After registering your name and selecting your vehicle of choice, you'll enter a ten-week season of fierce competition. Not only is the competition designed and taken from real-life racecar drivers, each opponent features realistic AI. These guys are at the top of their game...are you? The season will take players through realistically modeled locations including the Calder Park Thunderdome, Vallejo Speedway, Grand Rapids Motorsports Complex, and the Oceanside International Raceway; track schedules and locations differ between racing types. Each track differs in its own unique way (distances, laps) requiring practice and skill to learn and memorize. If you're being lapped and coming in last place, it's time to adjust the dynamics of your vehicle! Andretti Racing allows players to customize car transmissions, select from a variety of tires including soft and slicks, adjust the front/rear wing and downforce velocities, and change gear ratios. By customizing your vehicle to optimum performance, you'll have better control and consequently finish higher up in the leader board. Additionally, Andretti Racing features the first ever PlayStation split-screen mode with a link cable compatibility; up to four players can play via two consoles! It also comes with a variety of damage, control, and in-game camera options.", "platform": "Sony Playstation", "release_date": "November 30, 1996", "game_type": "Released", "esrb": "E - Everyone", "developers": "Stormfront Studios", "publishers": "EA Sports", "genres": "Racing", "max_players": "4", "cooperative": "No", "rating": "2.75", "wikipedia": "https://en.wikipedia.org/wiki/Andretti_Racing", "video_link": "https://www.youtube.com/watch?v=e3SMGjb5B5I", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9036-andretti-racing\n"}