{"altername_name": [], "name": "Angelique Duet", "overview": "The universe is ruled by a queen, all planets are in their balance... but now, the power of the queen is weakening, and the universe is under the danger of destruction... a new queen is needed... One day, Angelique Limoges, saw something in the sky... someone riding on a horse in the sky. None of her friends saw it... she is the only one who saw it, the chosen one--- the candidate of the Queen. Another candidate was Rosalia-De-Catargena. Both of them come to the Holy Land, where the Queen lives... Angelique is a series of \"neo-romance\" games by Koei from Ruby Party with character designs by shoujo manga artist Yura Kairi and music by Kuzuu Chinatsu. The gimmick is that it the games are by women for women. You play a teenage girl named Angelique who has been chosen by Queen Angelique (all the Queens seem to be named Angelique) and her aide Dia as one of two candidates from the Royal Smorny Girls Academy to become the next Queen. You are transported to the Flying City to begin your final examination. Each of you is given a land to populate. Whoever finishes populating their land first wins and becomes the next Queen. You do this with the help of nine Guardians who use their powers to make your people happy, or to devastate your rivals. Along the way, you become friends with the Guardians and can fall in love. If you choose love, you forfeit your chance to become Queen, but you live happily ever after. Angelique Duet allows the player to choose the usual heroine, Angelique Limoges, or her rival Rosalia de Catargena, as the main character.", "platform": "Sony Playstation", "release_date": "July 30, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106930-angelique-duet\n"}