{"altername_name": ["Animetic Story Game - Card Captor Sakura", "Animetic Story Game 1: Card Captor Sakura"], "name": "Animetic Story Game 1: CardCaptor Sakura", "overview": "Cardcaptor Sakura, also known as Cardcaptors and abbreviated as CCS, is a Japanese manga series written and illustrated by CLAMP. Cardcaptor Sakura is published in Japan by Kodansha and was serialized in Nakayoshi. The series consists of twelve volumes. The manga is well-known for its emphasis on the shojo genre of the series; nearly every page has detailed flowers, bubbles, or sparkles around the main characters. It won the noted Seiun Award for best manga in 2001. Ten-year-old fourth grader Sakura Kinomoto opens a mysterious book in her father's study and accidentally releases the magical Clow Cards. Created by the half-English half-Chinese sorcerer Clow Reed, the Clow Cards were sealed within the Clow Book upon his death and represent a combination of magic from Clow's mixed heritage. Each card has its own personality and characteristics and can assume alternate forms when activated. This is the first ever game ever made for Cardcaptor Sakura released on japan, the popular Mahou no Shoujo (Magical Girl) anime about a girl named Kinomoto Sakura who're given a power to seek and seal the Magic Card, namely Clow Card. However, this game is the first anime related games from Arika. The gameplay consist of 3 Different parts: - A. Non Interactive Scene During this part, the cutscenes, Conversation,and Anime FMV's occured you're only able to skip the conversation, by pressing Circle Button and Stop the FMV by pressing Start Button - B. Interactive Scene: On this part, you may control Sakura or other character. This one happened if the Joystick symbol Appeared on the middle of screen. During this part, Sakura able to interact with other people or environment. If the circle icon appeared when Sakura stand very close to other person or environment, means that's interactable. - C. Minigame Scene: Simple, just playing minigames by obeying the rules to complete a stage, once you beat the game, you may replay all of minigames. There are 14 episodes. The game also features the following extras: Voice Gallery, Movie Gallery & Design Gallery.", "platform": "Sony Playstation", "release_date": "1999", "game_type": "Released", "esrb": "", "developers": "Arika", "publishers": "Arika", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/105051-animetic-story-game-1-cardcaptor-sakura\n"}