{"altername_name": [], "name": "Army Men: Sarge's Heroes", "overview": "Army Men: Sarge's Heroes lets you play the role of Sergeant Hawk as he takes on the Tan Army in a series of 16 missions with over 40 different objectives, which range from simple seek-and-destroy to involved reconnaissance operations. The game is played from a third-person perspective so to familiarize yourself with the controls, you can enroll in Boot Camp to run through an obstacle course, practice firing weapons, and work on combat skills. To begin the single-player campaign, you'll receive objectives from General Grimm after which your character will appear in a combat zone. Use the map in the corner of the screen to help find your way to the current objective, carefully noting the type of terrain so you can plan your route of attack. But members of the Tan Army will try to thwart your progress every step of the way, so keep an eye on your health meter to know when to stop fighting and search for a Medkit. Also available on levels are Ammo Boxes (to replenish your standard-issue M-16), bazookas, flamethrowers, and sniper rifles. Since you can't replenish the ammo for the extra weapons, you'll have to take your shots carefully. The environments you'll battle in include real-world outdoor settings and indoor \"alternate world\" locales that include a giant bathroom, garden, sandbox, kitchen, and living room. Besides firing at everything that moves, Sarge can crawl on his belly, kneel, roll on the ground and climb ladders. Every hit makes Sarge move a bit slower so it's important to avoid gunfire at all costs!", "platform": "Sony Playstation", "release_date": "January 31, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "3DO", "publishers": "3DO", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.95", "wikipedia": "https://en.wikipedia.org/wiki/Army_Men:_Sarge%27s_Heroes", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11658-army-men-sarges-heroes\n"}