{"altername_name": ["Other Life Azure Dreams"], "name": "Azure Dreams", "overview": "The huge Monster Tower stands near the village Monsbaiya. It is populated by vicious monsters, and few dare enter it. But the monsters in the tower lay eggs, and whoever takes possession of such an egg, can tame a monster which will come out of it, and those monsters, called \"familiars\", will help their tamers in times of danger. Some brave adventurers dared to enter the tower and to take the eggs. One of them was called Guy. He was killed in the monster tower. Now his son Koh is fifteen, and he is allowed to try his luck in the tower. The player controls Koh and his party of \"familiars\" in this dungeon crawling/monster taming RPG. Each floor of the tower is randomly generated when entered, including the layout, items, and traps within it, although the enemy monsters that appear are based on the current floor number. Movement and combat in the game is turn-based; first Koh moves, then allied familiars, then enemy monsters, but outside of combat enemy turns happen instantly. Because Koh's level is reset to 1 every time he enters the tower he has to depend on equipment, a sword and a buckler, and familiars. A familiar's MP will slowly deplete as it follows Koh, however, and they must be periodically fed with appropriate food or they will become unresponsive. As in most Mysterious Dungeon type games Koh will lose all items, even carefully upgraded equipment, if he is defeated in the tower, so fleeing the tower is always a valid strategy. Once back in town the player can hatch any found monster eggs into permanent familiars and sell off loot from the tower. This money can then be reinvested in the town to add new buildings, decorate Koh's house, unlock minigames, and to show up Koh's rival Ghosh, a rich pretty-boy who never lifted a finger to help Monsbaiya. As Koh restores the town he also meets new female love interests, who over the course of several dungeon trips can be befriended and eventually become close confidants. Koh's familiars retain levels earned in the dungeon, and by carefully merging familiars they can be upgraded with skills they otherwise could never acquire.", "platform": "Sony Playstation", "release_date": "June 30, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "Konami", "publishers": "Konami", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.78", "wikipedia": "https://en.wikipedia.org/wiki/Azure_Dreams", "video_link": "http://www.youtube.com/watch?v=o4hsPZ1LkFY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10276-azure-dreams\n"}