{"altername_name": ["The Last Blade"], "name": "Bakumatsu Roman: Gekka no Kenshi", "overview": "The Last Blade (Bakumatsu Roman - Gekka no Kenshin), is a fighting game series created by SNK for the Neo Geo system. The Korean version of the game is known as \"The Last Soldier\". The Last Blade and its sequel are widely considered to be two of the most accomplished games available for the Neo Geo system, with fan opinion divided as to which is the better installment. The game takes place during the late Tokugawa shogunate era in Japan, and incorporates various elements of Japanese mythology (with a heavy emphasis on the symbology of the Four Symbols). As such, the background music generally incorporates synthesized instruments simulating a sound appropriate to the 19th century setting, in a Western classical, pseudo-Romantic style (unusual for a fighting game). STORY: Long before humanity existed, in a far off time of myth, death was an unknown, equally distant concept, but when death first came to the world, the \"Messenger from Afar\" was born. With time, the Sealing Rite was held in order to seal Death behind Hell's Gate. At that time, two worlds, one near and one far, were born. Thus the history of life and death began. Half a year has passed since Suzaku's madness, and the underworld is still linked by a great portal. Kagami's great sin is still heard as if ringing from the heavens. Our world has been called upon. Legends of long ago told of the sealing of the boundary between the two worlds. The Sealing Rite would be necessary to hold back the spirits of that far away world. However, the Sealing Rite brings together the power of the Four Gods and Sealing Maiden, for the first time properly completing the ritual.", "platform": "Sony Playstation", "release_date": "February 25, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "SNK", "publishers": "SNK", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.15", "wikipedia": "https://en.wikipedia.org/wiki/The_Last_Blade", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/88987-bakumatsu-roman-gekka-no-kenshi\n"}