{"altername_name": ["Ballerburg"], "name": "Ballerburg: Castle Chaos", "overview": "Ballerburg: Castle Chaos is a real-time artillery strategy game influenced by an earlier game with the same name. The goal is to destroy the opponent's castle (or something else, as described in the mission briefing). To accomplish your mission, you have no armies to command - your only weapons are ballistic: cannons, catapults and the like. It is also possible to use a bomber airship and some magic effects. Everything takes place in a 3D environment. You can build your own castle and its surroundings, such as peasant huts and smithies, where weapons can be placed. These things cost gold, and you get gold by collecting taxes from the peasants. To destroy the opponent's castle, you use your guns and catapults. It is impossible to see in advance where the shot will land, so you need to shoot the target more than once to be more precise. You can have multiple guns and switch between them to bombard your enemy with heavy stones, cannonballs, etc. You can upgrade these weapons to become even more deadly. However, these weapons cannot be fired all the time - they need time to reload, and every shot needs to be paid for. Meanwhile, the opponent shoots at your settlement, trying to cut you short of peasants, so you cannot buy anything. To hinder him, you can use wizards, which are able to summon sandstorms and rain, obstructing the opponent's sight and targeting. This game supports games with two human players using the Hot Seat mode, but there is no co-op campaign.", "platform": "Sony Playstation", "release_date": "December 1, 2003", "game_type": "Released", "esrb": "T - Teen", "developers": "Ascaron Entertainment", "publishers": "Mud Duck Productions", "genres": "Construction and Management Simulation", "max_players": "2", "cooperative": "No", "rating": "3.64", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32690-ballerburg-castle-chaos\n"}