{"altername_name": ["Toshinden 3"], "name": "Battle Arena Toshinden 3", "overview": "The third installment in the classic series of 3D fighting games for the Playstation, Battle Arena Toshinden 3 adds new characters, new special moves, and new play modes to the formula. One or two players can go head to head in a series of one-on-one fights, using regular, special, and super moves to knock the competitor's energy bar down to zero. Characters possess a wide variety of weaponry, and players will be dueling with swords, scythes, spears, pistols, and stranger arms in addition to engaging in hand-to-hand combat. Twenty-eight characters are playable in total, fourteen of which are available at the beginning. The other fourteen are unlocked when players win the game in single player mode by defeating a series of competitors with each of the original characters. Fights are fast and furious, with plenty of 3D effects and pyrotechnics going on, and combos and special moves aplenty are available. The ability to smash your opponent into the walls or ceiling of the arena in which you play adds to the fun as well. Story: Unknown to the participants, while the previous \"tournament\" was occurring they were being watched by another sinister group known as the Organization. The Organization intended to summon the Toshin (the god of fighting) itself to earth in order to conquer it. In order to do this they needed a pure hearted boy to use as a vessel and the blood of strong fighters. For the former they had been secretly raising a boy called David through an orphanage. For the later, they choose the Toshinden fighters. The Organization trained several assassins in the Toshinden fighters fighting styles. Led by Vermillion they went out to try to capture the Toshinden fighters... Characters: - Eiji Shinjo - Kayin Amoh - Sofia - Rungo Iron - Bayou (new) - Mondo - Duke B. Rambert - Ellis - Gaia - Chaos - Tracy - David (new) - Shizuku (new) - Nagisa (new) Unlockable Characters: - Leon - Ten Count - Zola - Adam - Cuiling - Toujin - Balga - Atahua - Tau - Schultz - Rachael - Judgement - Miss Til - Vermillion Manufacturer's description: The Toshinden: the timeless battle tournament where only the best are invited, and only the strongest survive. Now, this third installment takes the fighting action to a level never seen before! You're caged like an animal in newly designed and closed-in arenas. Battle to the exhausting finish against over 30 sexy, bloodthirsty and deadly characters, each with their own weaponary, style and moves. Plus fast fresh graphics, unbelievably smooth gameplay and responsive controls makes this tournament the ultimate force to be reckoned with. - 10 all new and closed-in arenas. Riccochet off walls and ceilings and attack and retreat! - Over 30 characters, 12 never before seen - Dozens of new killer moves, strategies and multi-hit combination attacks - 2 player mode for head-to-head action - Battle in 30 frames or even faster 60 frames per second - Practice, Survival or Team Battle Mode not found in the Japanese version. Features: Third person perspective 3D graphics Cartoon graphics", "platform": "Sony Playstation", "release_date": "December 27, 1996", "game_type": "Released", "esrb": "T - Teen", "developers": "Tamsoft", "publishers": "Playmates Interactive Entertainment", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.27", "wikipedia": "https://en.wikipedia.org/wiki/Battle_Arena_Toshinden_3", "video_link": "https://www.youtube.com/watch?v=af4K13fjCwk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11105-battle-arena-toshinden-3\n"}