{"altername_name": [], "name": "Big Air", "overview": "Accolade and Pitbull Syndicate have teamed up for Big Air, another take on the snowboarding genre that has you participating on thirty courses throughout six different countries including France, Japan, Scotland, Switzerland, the United States, and Germany. There are quite a few game play options in addition to the typical snowboarding fare including the World Tour, Training, One-Player and Two-Player modes. Training mode is there for new players to get used to the various game play options and controls whereas the One-Player mode allows you to compete against another contestant in a series of competitions. Among the different game types include the Freeride Race, Freeride Trick, Half Pipe, Big Air, and Boardercross. The Freeride Race has you racing against an opponent for the best possible time; no points are awarded for performing tricks. Points are awarded, however, for tricks in the Freeride Trick mode. You're also graded on the race time remaining at the end of the competition. While on the U-shaped Half Pipe, players are ranked on their ability to perform tricks and style. You'll want to keep momentum while performing tricks on this course as you'll earn points in regard to how difficult certain maneuvers are to pull off. The Big Air mode gives out points based on successful aerial tricks; the more impressive and difficult your moves are, the more points you'll earn! Boardercross is a race against multiple riders through courses that have everything from jumps and fierce turns to hazardous obstacles. Combining all these different game types together is the World Tour mode. Spanning three difficulty brackets (easy, medium, and hard), your objective is to earn a number of points by winning competitions and meeting that division's boss character. On the Easy mode, you'll need a thousand points to elevate yourself to the next season; you'll be tested on random trickery events such as the Big Air and Half Pipe. By finishing each season, you'll not only move on to bigger and better (and harder) things, but also unlock various courses! Finally, the Two-Player mode is a no-frills option for you and a fellow snowboarding enthusiast. You'll compete across a variety of courses and events for the ultimate title of Snowboarding King. Although you can perform tricks in any of the said events, points are only calculated on trick-based competitions. You can execute a multitude of flips, grabs, the impressive 180, and other dangerous maneuvers; let's see your friend try and out maneuver you! Big Air also features over eighty realistically modeled snowboards and apparel from actual manufacturers including Palmer Snowboards, Ride Snowboards, Morrow Snowboards, Inc., Joyride Snowboards, Arbor Snowboards, Maui and Sons International, Burton Snowboards, Sessions, and Westbeach Apparel. The developers also included a blistering punk-filled sound track including Blink 182, Limp, Snuff, Diesel Boy, Leatherface, and The Odd Numbers. It also supports a Dual Shock Analog Controller for both analog controls and the vibration function as well as a memory card for saving game data.", "platform": "Sony Playstation", "release_date": "February 28, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Pitbull Syndicate", "publishers": "Accolade", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.88", "wikipedia": "https://en.wikipedia.org/wiki/Big_Air", "video_link": "https://www.youtube.com/watch?v=Wu3wuqiBWOM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/481-big-air\n"}