{"altername_name": [], "name": "Black Matrix 00", "overview": "Drawing on a magnificent scale simulation scenarios Popular huge RPG \"Black\"series. And redesigned characters, of full voice. Mysterious power hidden items \"pane Ring\" also features a variety of new systems were used. Depict a more vivid, three races in the world of human lives devil angel, which has spun a new story. Each installment in the series combines standard tactical RPG gameplay with a pastiche of Judeo-Christian religious themes, particularly concerning the nature of good and evil and the interplay between Heaven, Hell, and Earth and the denizens thereof. One title was considered for North American release in 1999, and it is believed that it was eventually passed over due to its disturbing religion-derived themes. In a world where angels, devils, and humanity are locked in battle, Black Matrix 00 focuses on a young man who is searching for his kidnapped childhood friend. Black Matrix 00 begins with a mute man being adopted by a woman who nurses him back to health from some traumatic experience. This differs from a Harlequin romance in several ways. There is the matter of the man having white wings and the woman having black wings: in this world black winged people are dominant. The black winged people also pay more than lip service to Satan. As expected in a world where Satan is omnipresent, love is a Bad Thing and once the woman admits to having feelings for the man, they are forcibly separated and the man meets up with allies in prison. Then a number of Biblical allusions are run through in the course of a battle against the oppressive forces of Satan (though figuring them out from the Japanese may take some effort).", "platform": "Sony Playstation", "release_date": "May 13, 2004", "game_type": "Released", "esrb": "Not Rated", "developers": "Flight-Plan", "publishers": "NEC Interchannel", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91682-black-matrix-00\n"}