{"altername_name": ["Black Matrix Cross", "ブラックマトリクスクロス"], "name": "Black/Matrix +", "overview": "PSX version of the popular simulation RPG \"black\" and the remake of the DC \"Black Matrix Advanced\" fusion! \"Human love, friendship underdog free Tadashi Tadashi equality \" and the mortal world, the protagonist of Abel White Wings \"love\" to find the kidnapped husband had committed to begin the fight. Black Matrix is a series of tactical role-playing games developed by Flight Plan and published by Interchannel. All titles in the series are Japan-exclusive. Each installment in the series combines standard tactical RPG gameplay with a pastiche of Judeo-Christian religious themes, particularly concerning the nature of good and evil and the interplay between Heaven, Hell, and Earth and the denizens thereof. One title was considered for North American release in 1999, and it is believed that it was eventually passed over due to its disturbing religion-derived themes. The world of Black Matrix is fictional and fantasy-based, and in it the forces of Hell won a decisive war against the forces of Heaven. The victorious devils rewrote history and redesigned society to suit their purposes, reversing the concepts of good and evil. The descendants of the devils, known as black-wings because of the bat-like wings that grow from their backs, rule over the white-wing descendants of the angels, whom they treat as sub-human slaves. In their society love is considered the worst of crimes, and any one found guilty of love or kindness is hunted and punished.", "platform": "Sony Playstation", "release_date": "December 14, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Flight-Plan", "publishers": "NEC Interchannel", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91681-blackmatrix\n"}