{"altername_name": ["Imadoki no Vampire: Bloody Bride"], "name": "Bloody Bride: Imodoki no Vampire", "overview": "The game features a young vampire who reaches (vampire's) adulthood. But in order to become mature he must suck the blood of a girl with a \"platinum aura\", this task is harder than it may look, once the girl must willingly let him suck her blood. The young vampire is sent to the human world in order to find a girl with that aura, having 3 years to complete that task. As a vampire, the boy must wander at night in order to find common girl and suck their blood, although he will usually find monsters with whom he'll fight in order to help him reach his adulthood. The game is very stat-intensive. In between scheduling dates, you will have to manage your stats and try to increase them. Stats serve both to make you more effective in combat like all RPGs, as well as to make you a more ideal mate. In order to drink a girl's blood with her consent, you're going to have to win her heart first. This involves doing any number of things you would do in any other dating simulation, all of which are given their own unexpected twists, thanks to the fact that you must keep your identity as a vampire a secret at all times. It's easy to forget your own weaknesses, so careful planning must be made in order to avoid potential problems. At an amusement park, for example, taking your girl to the house of mirrors would lead to a small disaster. A roller coaster ride would be a much safer option. While making these decisions, you must also maintain good hygiene, keep careful tabs on other potential victims, and find enough time to stalk the streets at night. Yes, being a vampire is more than about sucking blood -- it's also about effective time management. There is a full English translation patch available for Bloody Bride, making the game playable from beginning to end for non-Japanese speakers. There are 5 different game endings.", "platform": "Sony Playstation", "release_date": "December 27, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Astrovision", "publishers": "Atlus", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3.54", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108046-bloody-bride-imodoki-no-vampire\n"}