{"altername_name": ["Blue Breaker: Egao no Yakusoku"], "name": "Blue Breaker: Egao No Yakushoku", "overview": "Blue Breaker Egao no Yakushou is a \"love RPG\" - a sort of hybrid between an RPG and a dating game like Tokimeki Memorial. While you are playing the game, you will have to pay close attention to the level of how much the female characters like the main character, The world that Blue Breaker takes place in is called \"kokuu no michi\", or \"the path in the middle of empty sky\". It's a floating word, made up of islands connected by land bridges. It consists of countries and the intermediate zones that come between those countries. Kain is given a mission by his father. Seems a nefarious Dark Lord is threatening peace across the land, and Kain gets to go stop him. Ah, but only beating the Dark Lord isn't enough: Kain must also woo a bride while traveling the land. His childhood friend Asha, who just happens to be female, joins his quest at its beginning. While moving around the land Kain meets more women, while the minions of the Dark Lord want him dead. The narrative is held together by events that occur in an unpredictable fashion, but the central theme is obvious enough even through the language barrier. Blue Breaker proceeds in a nonlinear fashion, with Kain wandering from place to place seeing if anything happens. Almost every area in the game is accessible from the beginning; the only requirement is that Kain must move between wherever he currently is and however many locations are in the way. Each location is joined to another by means of a flat field. While moving through these flat fields Kain will experience enemies popping up randomly in front of him, eager to slay him if possible. Kain and companions will automatically battle the enemies. Kain's goal is not only to defeat the Dark Lord, but also to woo a bride. This is by far the more complicated aspect to Blue Breaker, with little being obvious in the game itself. There are certain guidelines however, If a woman interjects herself into Kain's party, forcing her out (which is possible) will negatively affect her feelings for Kain. Fighting is necessary, but fighting too much in one day will again negatively impress the ladies.", "platform": "Sony Playstation", "release_date": "December 27, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Human Club", "publishers": "Human", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108047-blue-breaker-egao-no-yakushoku\n"}