{"altername_name": ["Ao no Rokugo: Antarctica", "Ao no Rokugou: Antarctica", "Ao no 6-gou: Antarctica"], "name": "Blue Submarine No. 6: Antarctica", "overview": "Based on the Blue Submarine No. 6 OVA series, Antarctica features cinematic strategy and simulation in a futuristic \"Waterworld\" with neat characters such as Mutio, Hayami, and Mayumi. Blue Submarine No. 6 (Ao no Rokugou) is the name of a manga series by Satoru Ozawa, which was subsequently developed into a four episode OVA series by GONZO. The story begins in the near future, when the Earth's oceans have risen and flooded most of the sea-lying land on Earth. Due to the efforts of the rogue scientist Zorndyke the flooding killed billions; most of humanity's remaining cities have been destroyed or attacked by Zorndyke's army of Hybrids. The remaining humans begin to wage war against Zorndyke's sea-going creations for simple survival. Humanity's best hope for a resolution to the conflict lies with its submarine forces, among which is the focus of the story, Blue Submarine #6. It is revealed that Zorndyke is attempting to decisively end the conflict in the favor of his hybrid children by artificially inducing a polar switch using geothermal energy at the South Pole. The gameplay portion of the graphics is a cinematic simulation, with 40 minutes of soild new video. Adventure mode using \"emotion input system\" and \"thinking\". Progress is made by communicting with your companions. Depending on your actions the story will fork, deciding the ending. Real time combat simulation including \"blue\" and \"zondike\" warships.", "platform": "Sony Playstation", "release_date": "September 28, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106935-blue-submarine-no-6-antarctica\n"}