{"altername_name": [], "name": "Bounty Sword First", "overview": "Bounty Sword is a tactical strategy role-playing game set in a fictional futuristic world with a power struggle looming between Europea and the Kingdom of Rheinmetall. The game puts heavy focus on battle mode and offers a detailed tutorial one can go through before starting the story mode. During the battle your character can use close-combat weapons such as sword, initiate special devastating attacks, or use magic and items either to combat or as a remedy. While traversing the world map you will encounter various cities which will let you visit stores to buy and sell items, or check the local inn to hear the gossips or save your game progress. While you start the game as a lone bounty hunter, you can have other characters join your party which in turn will participate in combat during the battle mode. The battle mode, however, does not let you control the characters directly. Instead, you can create trajectory paths which the characters will follow, and decide how they should act when encountering enemy combatants. Special attacks and magic spells can be initiated at any time, assuming you can perform them. The game offers a variety of character classes, each with their pros and cons. Some of the character classes include bounty hunters, knights, ninjas, samurais, amazons, clerics, priests, sorcerers, wizards, snipers, and more. Each of your party characters has its own level and can level up by gathering experience points in combat. In town shops you can buy swords, bows and arrows, and other weapons, as well as protective armor and special items to equip your part characters with and increase their winning chance in combat.", "platform": "Sony Playstation", "release_date": "June 6, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Pioneer", "publishers": "Pioneer", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108051-bounty-sword-first\n"}