{"altername_name": ["ブリガンダイン グランドエディション"], "name": "Brigandine: Grand Edition", "overview": "Located in the central plains of Forsena, Almekia finally brough peace of the land by finally defeating the country of Norgard, in 214. The long war was finally over...However, in the second month of 215, Admiral Zemeckis assasinated King Henguist of Almekia. Almekia collapsed and Zemeckis proclaimed himself emperor and established the Esgares. He was possessed by the desire to conquer the world and began his assault on neighboring countries...You will become one of the Knights of the Rune and participate in the war for the continent. Your mission: Bring peace back to Forsena... GRAND EDITION VERSION: The remake of the game released in 2000 had many significant changes, including: - Multiplayer game mode: allowing up to 6 players, each controlling a nation. - The Esgares Empire became a fully playable nation, and gained plot cut scenes. - Changes on battle mode gameplay: Like on the Fire Emblem series, elements became based on the Rock, Paper, Scissors rule: red is effective against green, green is effective against blue, and blue is effective against red. White and black still oppose each other. - If, after 13 turns of battle, the attacking side has a unit over the defending side's castle, the attacking side now wins. - Monsters became able to equip items. - The player is redirected to a final boss, when the continent is successfully conquered. - The original 3D opening was replaced by an anime opening. - Many dialog-only cut scenes where replaced by anime cut scenes. - 3D battle animations replaced by simpler and faster 2D animations. - Major changes on soundtrack. - New rune knights, character classes, items and monsters. - Voice acting is present with Japanese Seiyu, including the voice talents of Soichiro Hoshi, Mitsuaki Madono and Yuri Shiratori to name a few.", "platform": "Sony Playstation", "release_date": "May 18, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Hearty Robin", "publishers": "Atlus", "genres": "Role-Playing", "max_players": "6", "cooperative": "Yes", "rating": "4.42", "wikipedia": "https://en.wikipedia.org/wiki/Brigandine_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91690-brigandine-grand-edition\n"}