{"altername_name": ["Baphomets Fluch 2: Die Spiegel der Finsternis", "Boucliers de Quetzalcoatl, Les: Les Chevaliers de Baphomet II", "Broken Sword II: La Profezia dei Maya", "Broken Sword II: Las Fuerzas del Mal", "Broken Sword 2: The Smoking Mirror"], "name": "Broken Sword II: The Smoking Mirror", "overview": "When we last met George Stobbart he was tending to his ailing father in America. Now he's back in Paris for a reunion until things go awry once again when his French investigative reporter girlfriend, Nico, leads them both into another dangerous situation -- involvement with a drug smuggling Central American crime syndicate. Even worse, they accidentally stumble upon a mysterious obsidian stone containing secret powers of an ancient Mayan civilization! And these smugglers are taking it personally. Brought to you by Revolution Software and Crave Entertainment, Broken Sword II: The Smoking Mirror is the sequel to the original Broken Sword with the same familiar interface. The 2D animated adventure game uses a point-and-click system with a mouse, yet with some button functions for your controller (represented by several icons). The game is also compatible with the Dual Shock controller for analog and vibration effects. The sinister tragedy is caused by a visit to the home of Professor Oubier where our lovebirds hope to learn more about this strange artifact. But when the pair is greeted by a character who claims to be the professor, he suddenly attacks them and kidnaps Nico in the process. The room is then lit with fire and our hero George is tied to a chair, as he becomes potential prey to a nasty tarantula! As you travel around the globe you'll come upon a cast of characters who could help or hinder you, depending on your actions. When new areas are discovered, you'll be presented with the option to visit these new and exotic locations (which are visually selectable near the bottom of the screen), as well as older locations. This affects the puzzles and traps in the game as well, where you can skip actions that can set the course of the game in a different path. There are a bunch of items below the main game screen that displays the inventory. Sometimes it will display different items based on the circumstance. For example, if you're speaking with someone you could talk about a new item that becomes available onscreen. Other settings allow you to change the centering and brightness of the screen, the volume, and also digital and normal cursor movement speed. And with just one block of memory required for saving, it's a race against time from the destruction of mankind.", "platform": "Sony Playstation", "release_date": "November 30, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Revolution Software", "publishers": "THQ", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.43", "wikipedia": "https://en.wikipedia.org/wiki/Broken_Sword_II:_The_Smoking_Mirror", "video_link": "https://www.youtube.com/watch?v=Xn4EVX-mFvc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11103-broken-sword-ii-the-smoking-mirror\n"}