{"altername_name": ["Bubble Bobble Part 2"], "name": "Bubble Bobble 2", "overview": "Bubble Symphony (also known as Bubble Bobble 2) is an arcade video game in the Bubble Bobble series. While being a new Bubble Bobble for a new generation, in actuality it takes place after Parasol Stars. For this adventure, Bubblun and Bobblun, the typical green and blue dinosaurs, are joined by girls Kululun (an orange dragon) and Cororon (a magenta dragon). These are stated as the four children of the starring characters from Bubble Bobble. According to the intro, the four characters (as humans) are reading books when they inadvertently unleash Hyper Drunk, the final boss, from one of the books. He transforms the four into bubble dragons and banishes them to a new world. Although a sequel to Bubble Bobble, the game inaugurates few changes to the gameplay formula of that title. The small changes that have been made are that a boss is now encountered every five to ten levels, giving those scenes a similar prominence to Rainbow Islands, and the player takes a branching route through the levels by selecting one of two doors after every boss. The players can now charge the bubble shot; if released when the dragon's horns or bow is glowing, he/she will breathe three bubbles at once, with the specific formation dependent on the character chosen. The players must collect certain square cards with music notes inside, in order to get the 4 keys that lead to the final world or face an early false ending. Also, the characters have to collect a rod to turn their characters from their dragon to human forms during the course of the game. Bubble Bobble II is a beta/prototype game developed for the PlayStation by East Point Software. The game was never released on the PlayStation but did appear on the Sega Saturn in retail. Bubble Bobble 2 on the PlayStation is more colorful than the Saturn version.", "platform": "Sony Playstation", "release_date": "", "game_type": "Unreleased", "esrb": "", "developers": "EastPoint", "publishers": "Virgin Interactive Entertainment", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "4.21", "wikipedia": "https://en.wikipedia.org/wiki/Bubble_Symphony", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/17330-bubble-bobble-2\n"}