{"altername_name": ["Bugs Bunny & Taz: Im Wettlauf gegen die Zeit", "Bugs Bunny & Taz: La Espiral del Tiempo"], "name": "Bugs Bunny & Taz: Time Busters", "overview": "Daffy Duck has somehow managing to break Granny's time regulator, causing himself and the Time Gem that acts as the heart of the regulator to be pitched back into the shrouded annals of history. Well, if there are two people you know to call when it comes to times of crisis they would be Bugs Bunny and ... Taz? Well, regardless of the intelligence of the decision, Bugs and Taz will have to work together on this mission, traveling through four different eras in a quest to find Daffy, recover the Time Gem and set things back to the way they ought to be. Take control of the two famous Warner Bros. characters in Bugs Bunny & Taz: Time Busters for the PlayStation. You will alternate between the wise-cracking rabbit and the Tasmanian eating machine in an attempt to rescue the Time Crystal and Daffy. To do so, they'll have to use the Time Regulator themselves, blasting back through four different eras to complete their quest. These time periods are The Aztec Era, The Viking Era, The Arabian Era and Transylvanian Era. Each character has his own set of moves, from Bugs' quickness to Taz's spinning fury. You can play each of the characters at any point, calling your friend to your location and switching between them, occasionally using them at nearly the same time to get past a given obstacle. If you don't want to play the game alone, you can even bring in a second friend to play the other character.", "platform": "Sony Playstation", "release_date": "November 24, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Artificial Mind & Movement", "publishers": "Infogrames", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "4.38", "wikipedia": "https://en.wikipedia.org/wiki/Bugs_Bunny_%26_Taz:_Time_Busters", "video_link": "https://www.youtube.com/watch?v=g98-hsXpHV4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11780-bugs-bunny-taz-time-busters\n"}