{"altername_name": ["Family Card Game Fun Pack", "Trump Shiyouyo!"], "name": "Card Shark", "overview": "Card Shark is a collection of card games, most of which are single player games, in which the player competes against three AI opponents in any of ten games. The games that can be played in this product are: Seven In A Row: For four players. All cards are dealt and players take turns playing a card, the first player to play all their cards wins. Cards are played sequentially by suit and each suit starts with the seven and builds both up to the king and down to the ace. The game is played in levels, to progress to the next level the player must finish either first of second on a five round match. To complete level four the player must finish first. The Rich Man: Players take it in turn to play a card, the card they play must be higher than the card played by the previous player. The first player to play all their cards wins. At the end of the first round the winning player is termed 'The Millionaire', the second player is 'Rich', the third player is 'Poor' and the fourth player is 'Destitute'. 'Destitute' must give their two best cards to 'The Millionaire', 'Poor' must give their best card to 'Rich'. Millionaire and 'Rich' must give cards to Destitute' and 'Poor' but they can give any cards they wish. Under certain conditions card strength is reversed which affects the game dramatically. Players start with twenty points and gain or lose points depending on how well they do, and they complete a level by finishing first in a ten round match. Splash: Players play card(s) to match the value of the card on the table, the first player to play all their cards wins. They win instantly (i.e. The 'Splash') if the total value of their hand matches the table card. The game is a variation on 'Crazy Eights' as it has similar special cards. Eight's change the suit of the next player's discard, Jack's cause the next player to miss a turn, Ten's reverse the order of play and Two's make the next player pick up two additional cards from the deck. To clear a level the player must finish in the top two of a ten round match. Page One: is another Crazy Eight variant. Players play card(s) to match the value of the card on the table, the first player to play all their cards wins. The special cards in this game are Eight's which change the suit of the next player's discard, Jack's which cause the next player to miss a turn, Queen's which reverse the order of play and Two's which make the next player pick up two additional cards from the deck. A further twist is that when a player holds just one card they must press triangle, if they don't they are required to pick an additional five cards from the deck. To clear a level the player must finish in the top two of a ten round match. Seven Bridges: Players are dealt cards and take turns exchanging one card from their hand with a card from the deck. When they have three cards of the same value or three cards of the same suit they can place them on the 'table'. Cards can also be added to sets and sequences laid by other players. The first person to dispose of all their cards wins. Players start with points and lose points for every card remaining their hand when a round is over. To clear a level the player must finish in the top two after a ten round match. To complete level four they must finish top. Old Maid/Old Man: These are two variations on the same game. Old Maid is played with a fifty two card deck and one joker. Cards are discarded in pairs and the first person to dispose of all their cards wins. Old Man is played the same way but one card is removed from the fifty two card deck. In both games playing a Jack's causes the next player to miss a turn while Queen's reverse the order of play. Speed: This game supports one or two players. It is not turn based, players play cards that are sequential to the table card as fast as they can. The first player to dispose of all their cards wins. Poker: This is Five Card Draw poker. Players start with credit and aim to win as much as possible, it plays like a video poker game of 'Jacks High'. This product does not use a memory card to store a player's progress but in Poker the player can press the SELECT button and the game will generate a password which they can use in future games to restore their credit. Pressing the START button swaps the player into the Blackjack game. Blackjack: This is a standard Blackjack game in which the player can generate passwords or swap into the Poker game as described above. The player's winnings are multiplied if they have special card combinations, for example 'Blackjack' - having the cards add up to twenty-one - multiplies the stake by five while a six card sequence adding up to twenty-one multiplies the stake by fifty. In both Poker and Blackjack when the player wins a hand they can choose to play a 'double or nothing' game such as 'Red or Black', Hi-Card select', Hi-Lo' etc Concentration: This is a game for one to four players. Forty cards are dealt face down and players take turns revealing a pair of cards looking for a matching pair. Each game has customisable rules, and adjustable AI strength.", "platform": "Sony Playstation", "release_date": "February 16, 2001", "game_type": "Released", "esrb": "", "developers": "Bottom Up", "publishers": "Midas Interactive", "genres": "Casino", "max_players": "2", "cooperative": "No", "rating": "3.93", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78929-card-shark\n"}