{"altername_name": [], "name": "Carom Shot", "overview": "Carom billiards, sometimes called carambole billiards or simply carambole (and in some cases used as a synonym for the game of straight rail from which many carom games derive), is the overarching title of a family of billiards games generally played on cloth-covered, 5 by 10 feet (approximately 1.5 × 3 m) pocketless tables, which often feature heated slate beds. In its simplest form, the object of the game is to score points or \"counts\" by caroming one's own cue ball off both the opponent's cue ball and the object ball(s) on a single shot. The invention as well as the exact date of origin of carom billiards is somewhat obscure but is thought to be traceable to 18th-century France. There is a large array of carom billiards disciplines. Some of the more prevalent today and historically are (chronologically by apparent date of development): straight rail, cushion caroms, balkline, three-cushion billiards and artistic billiards. There are many other carom billiards games, predominantly intermediary or offshoot games combining elements of those already listed, such as the champion's game, an intermediary game between straight rail and balkline, as well as games which are hybrids of carom billiards and pocket billiards, such as English billiards played on a snooker table and its descendant games, American four-ball billiards, and cowboy pool. Carom Shot is one of the most unique and full fledged pool simulations for Playstation. The game got a sequel that was also released in the United States (as Backstreet Billiards), but this game is a japanese only release.", "platform": "Sony Playstation", "release_date": "April 25, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Argent", "publishers": "Argent", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92019-carom-shot\n"}