{"altername_name": ["チャルメラ"], "name": "Charumera", "overview": "Draw a walk simulation game stalls stalls become Charumera uncle. As can be several tens of thousand ramen with pork, salt, soy sauce, miso! You can explore the city and the event, to obtain food items sauce, soup, noodles, and other tools, I can make a good combination of pride ramen. Set in the town, will become Japan's top ramen noodles in town! In this Playstation game the player takes the role of a wandering ramen yatai wheeling your cart of yummy ramen dishes around a quaint little city, hoping to strike upon that combination of taste, customers and timing which will make your fortune while trying to avoid being hassled by The Man or little children. Or something like that. Basically you wheel around the lovely little locations that change with time of day (your selling hours are from 3pm to 12am), blowing your charumera flute when you think you've found a good spot based on the neighborhood and bystanders. A crowd, large or small, gathers, and you can see what they think of your dish in little icons above their heads. You can have a dozen or so recipes on tap at a time and you'll find that even though a new recipe may be a hit at first, soon people will get sick of it and start complaining, and business will suffer. Every now and then you meet someone who strikes up a conversation and takes a more critical approach to the ramen tasting. I'm not really sure what these signify, though once a fat businessman seemed really happy with my recipe (he slurped a lot) and took me to another guy in a suit and I could read the word \"sponsor\" in katakana, uh and then they left and I dunno what difference it made. I don't know what to do with the money I earn yet. At the right time of day you'll find shops selling particular ingredients, though they don't actually seem to charge you money for unlocking the ingredient in your cookbook.", "platform": "Sony Playstation", "release_date": "November 25, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Victor Interactive Software", "publishers": "Pack-In-Soft", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92025-charumera\n"}