{"altername_name": [], "name": "Cheesy", "overview": "It has mine carts rattling past experimental monster lunatics on chilli fire-breathing chilli peppers stepping on dangerous blobs of... er... Danger with power hungry evil no holds barred super intense dangerous blobs oh done that and scientist, one, very nasty. And Cheesy. A mouse. Right in the middle. The game Cheesy stars a mouse that has been captured by a mad scientist and locked in a cage. Being denied his freedom he waits for his oportunity to escape. One day a minature alien UFO comes flying along and bumps into the cage, hence knocking it over and allowing Cheesy to escape. That is where you come in. You control Cheesy the mouse, who must gather all the ingredients of a teleportation spell to escape the castle. Along the way Cheesy aquires a gun and can blast his enemies Contra style, as well as stomping them on the noggin. He must jump over flaming bunsen burners, spilled chemicals, avoid nasties like spiders, flying creatures and giant rolling eyeballs (science experiments gone wrong). The levels include action platforming, a mine cart ride, being chased by a UFO in the library, a flying dragon; leaf surfing in the sewer, being squashed in the kitchen, escaping the creatures in the lab, riding on top of the UFO while dodging objects(way cool!), to climbing up a fiery furnace. Some boses include a giant spider, a steaming tea pot (tea time anyone?), a fire breathing dragon, to Mr. Chem the mad scientist himself. This is not just your cute typical mascot game, it is a very challenging game with a variety of levels, perspectives, good graphics, movie like story between levels, old school gameplay, excellent music, and of course good control. Give Cheesy a chance, help him collect the cheese and escape the castle, to reaveal a shocking ending, does Cheesy really escape or does he get caught in a mousetrap? Find out get the game!!!", "platform": "Sony Playstation", "release_date": "November 15, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "CTA Developments", "publishers": "Jaleco", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.04", "wikipedia": "https://en.wikipedia.org/wiki/Cheesy_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92027-cheesy\n"}