{"altername_name": [], "name": "Chiisana Kyojin Microman", "overview": "Microman that appeared more than 20! Faithfully reproduced toy at the time, a figure set up personality. Use different weapons and a variety of Microman, defend your base from acro Year, is dramatic action game movie adopt cutwork system. Possible simultaneous play 2P! By collecting items during the game, you are able to collection of movies and illustrations of the time and Microman CM. One spring day, a small package is delivered to Kohei Kuji, a school boy. When he open the box he found five small action-figures inside. To his surprise, they begin to move around and start to talk to him. They introduce themselves as \"Microman\", coming from Micro-earth which locate at the far end of the universe. They start to explain about their mission, telling him that earth is now in danger. There is an evil power, call Acroyer, conspired to conquer the universe. The five Magne Power Microman are send to Kohei to save earth by the mysterious man name Professor K. In the Playstation game that game takes place in a near future when a robot alien invasion takes place in Earth, the game is divided into different missions: There are 3 different missions for each mission level, that have to be played with a different microman. The gameplay is similar to the arcade machine Smash TV 'cause you have to destroy all the enemies in a room to advance to the next level the major difference is that you have to protect a reactor that the enemies try to destroy. The game features movie, CG & other galleries modes that can be unlockables playing the game.", "platform": "Sony Playstation", "release_date": "November 3, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Takara", "publishers": "Takara", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92029-chiisana-kyojin-microman\n"}