{"altername_name": [], "name": "Chinmoku no Kantai: The Silent Service", "overview": "STORY: During the cold war, the Japan Maritime Self-Defense Force jointly developed a nuclear submarine with the United States Navy. On its maiden voyage, the captain of the submarine declares the submarine to be an independent state, \"Yamato.\" Things don't start off so well. A Japanese submarine collides with a Russian sub, sinks, and implodes. All hands are apparently lost. Investigations are launched and it is quickly discovered that the destroyed sub had no one aboard. Meanwhile, the U.S. and Japan have collaborated to build a state-of-the-art nuclear submarine, the Seabat. It will be part of the U.S. Navy's Seventh Fleet but will have a Japanese crew. But on its maiden voyage, Captain Kaieda and his crew go rogue! This of course sends the rest of the world scrambling. The U.S. wants the sub recovered, so does Japan. In the meantime, neither country wants their exact connection to this project to be revealed. Things get even more complicated when Captain Kaieda declares the sub an independent nation. Captain Kaieda has a counterpart in the Japanese Self Defense Force, Captain Fukumachi. Fukumachi is more reckless than Kaieda, so he got passed over for command of the new sub, and he's just a little bit bitter. As a result, he's on a somewhat personal mission to return the Seabat to Japanese control. The idea of a captain of an atomic submarine declaring independent sovereignty is not completely original. For example, a British man named Paddy Roy Bates declared a nation called Sealand in 1967 after occupying an abandoned navy fortification off the British coast. The Silent Service is generally regarded as one of the rare Japanese comics that covered the unparalleled scale of realistic international geopolitics with a commercial success. Chinmoku no Kanita - The Silent Service is a mix between a simulation & a strategy game. The game features 4 game modes: - Practice - Dramatic - Complete - Situation The game features also a galley mode that can be unlocked playing the different game modes. In this game, Captain Kaeda's amazing maneuvering ability is fully implemented along with sinking submarines used to destroy (sunken) ships. There is also the \"Passive Sonar System,\" which operates by detecting noise. Enjoy creating your original \"Yamato\" and making it grow with points that you gain. There are 70 actual types of ships, and 300 ships that appear in the game. The battle scenes are speedy, and they develop at a quick pace. The tactics are based around wire-guided torpedoes and harpoon missles. Positions are tracked by sonar. Manufacturer's description: Yamaguchi popular cartoon maritime fleet of silence. The simulation faithfully reproduces the world of strategy. Fully equipped and can experience a simulation of the hit rate Sairentosonashisutemu affect detection of noise can boost the performance of the Yamato the story progresses. Nuclear submarine, \"Yamato\", operate the fight against the world. Features: - First person perspective. - 3D graphics - Cartoon graphics - Cold War & Anime themes.", "platform": "Sony Playstation", "release_date": "September 28, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Kodansha", "publishers": "Kodansha", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135498-chinmoku-no-kantai-the-silent-service\n"}