{"altername_name": ["Choro Q 3"], "name": "Choro Q3", "overview": "With Choro Q 3 Takara and Tamsoft finally managed to reach the zenith of their Choro Q license. This racing game is, without a doubt, the best one in the Choro Q series. The gameplay is where Choro Q3 shines. The Choro Q cars have very short wheelbases, so they have different physics than cars in other racing games. In order to succeed here, you have to re-learn how to drive. The parts the player starts with are supposed to be inferior to some of the ones you will get later on. As you win more races, you'll gain enough money to soup up your tiny car to be quick and agile. Buying new parts for your car is part of the fun. There are more parts in this game than any other Choro Q game on the Playstaton. There are many different types of tires, like Racing, Semi-Racing, Off-Road, Water, Snow, and Big Tires (think Monster Trucks). There are lots of engines, transmissions and brakes, too. You can get spoilers, new chassises, and even horns and speedometers. There is a high degree of customization here. If choosing your parts isn't good enough, there are lots of car bodies to choose from. The bodies are purely cosmetic, but they add to the customization attribute of the game. You can get over a hundred different car bodies, ranging from simple fiats to supercars. There are also whimsical cars, like Ramen stands, garbage trucks and dump trucks. Once you get a car body, you can paint it whatever colors you want. There are 2 paint shops. One has the basic Choro Q colors, and the second one (found later in the game) gives you the ability to use hundreds of different colors on your car. You can also get decals, like stripes, numbers and logos, for your vehicle. Your mean machine can look however you want it to. To get all these features, you have to find them in Choro Q City. There is a large city you get to drive around in. You can go to stores, run races, and even sink a boat here! You will need to go here often, since new courses and shops are constantly opening up. In the city, there are 100 ''events'' to find. These range from the simple (reading a sign) to more complex ones. If all 100 events are found, something special happens... When it comes time to race, the selection of courses is very, very good. There are regular speedways, castles, hotels, sewers, and even a haunted house for your driving pleasure. There are more courses here than in any other Choro Q game to date. The courses are very detailed, too. There are jumps, tunnels, secret passages and other hidden things. The amount of detail in these courses is astounding. The difficulty level is average. If you master the controls and get lots of upgrades for your car, most of the game should be a breeze. There are some tough parts, especially if your car isn't upgraded much. Some courses are very well hidden in Choro Q City, and can take a while to find.", "platform": "Sony Playstation", "release_date": "February 19, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Tamsoft", "publishers": "Takara", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.95", "wikipedia": "https://en.wikipedia.org/wiki/Choro_Q_video_games", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73308-choro-q3\n"}