{"altername_name": ["Cho-Nazo-Oh", "Chou Nazo-ou"], "name": "Chou Nazoou", "overview": "Cho-Nazo-Oh is another quiz game and is the sequel to Nazo-Oh, this time the player takes the role of a young boy that lives in the future where a computer governs the land from a tower, the people of the land tried a lot of times to send people there to defeat the computer but noone that had entered the tower had exit alive...So the commander of the forces that are trying to destroy the computer got now only one assassin left, that is the player's character. So now is the player's turn to enter inside and try to defeat all the dangers that will come across to reach the evil enemy and try to defeat it. All the trials are different quiz games in which the player has to answer well some questions to advance to the next level. This is the main game mode (sort of a story mode) that the game call terrorist mode. The difficulty of the game again is high since to pass some of the trials the player will have to answer in a right way a lot of questions. During the game the player in the story mode goes around a maze and to defeat the enemies he got to answer questions, he will got the help of different cards to make the enemies defeat easier, since using a green card for example will make him answer less questions. The game features too a vs mode in which 2 human player can compete to know which of them can answer more questions in a right way. Manufacturer's description: Quiz game was very difficult at the national quiz mania groan mystery puzzle king, has evolved more] came back to the PS. Take the terrorist turned 3D dungeon mode \"terrorists\" and challenging questions that included 4000 \"quiz cell mode\" form of the game to enjoy the two fastest finger first \"battle mode\"thinking is carried. Features: - Third & First person perspectives. - 3D graphics - Cartoon graphics - SCI-FI & Futurist themes.", "platform": "Sony Playstation", "release_date": "January 27, 2000", "game_type": "Released", "esrb": "", "developers": "Bandai Visual", "publishers": "Bandai Visual", "genres": "Quiz", "max_players": "", "cooperative": "No", "rating": "2.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135499-chou-nazoou\n"}