{"altername_name": ["Chou Majin Eiyuuden Wataru Another Step", "超魔神英雄传瓦塔诺 另一界层", "超魔神英雄传"], "name": "Chou Mashin Eiyuuden Wataru Another Step", "overview": "Chou Mashin Eiyuuden Watary Another Step is a 2D RPG game based on the TV series of the same title. The playstation game features 2D Cartoon Graphics, and the sense of humour of the TV series. Mashin Hero Wataru is a comedy/adventure Super Robot 45 episode anime series created by Sunrise first aired on April 15, 1988. Sunrise credited \"Hajime Yatate\" for the storyline and Shuji Iuchi directed the series. The story is about a 9-year old boy named Wataru Ikusabe who is magically transported to a magical realm of the gods called Sokaizan which he is supposed to save. The series incorporated many elements of RPG games including dungeon levels and quests for mystical objects. Soukaizan itself is represented as a series of tiered platforms each floating above the one beneath it in a rough pyramid shape. In order to progress to the next tier, the show's heroes must complete some task on the one beneath where he will meet the series' ultimate villain. In his quest to save the realm, he manages to transform a clay sculpture into a somewhat autonomous (small) Super Robot. He also befriends many of the Soukaizan natives, and forms some very strong friendship bonds. The term Sou-kai-zan can be broken down to its 3 parts. Sou meaning creation. Kai meaning realm, space, world, or universe. Zan meaning hill or mountain. which is repersented by the pyramid shape of the world's level.", "platform": "Sony Playstation", "release_date": "April 23, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Aspect", "publishers": "Banpresto", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109299-chou-mashin-eiyuuden-wataru-another-step\n"}