{"altername_name": [], "name": "Chrono Cross", "overview": "\"What was the start of all this? When did the cogs of fate begin to turn? Perhaps it is impossible to grasp that answer now, From deep within the flow of time... But, for a certainty, back then, We loved so many, yet hated so much, We hurt others and were hurt ourselves... Yet even then we ran like the wind, Whilst our laughter echoed, Under cerulean skies...\" The story of Chrono Cross focuses on a teenage boy named Serge and a theme of parallel worlds. Faced with an alternate reality in which he died as a child, Serge endeavors to discover the truth of the two worlds' divergence. The flashy thief Kid and forty-three other characters assist him in his travels around the tropical archipelago El Nido. Struggling to uncover his past and find the mysterious Frozen Flame, Serge is chiefly challenged by Lynx, a shadowy antagonist working to apprehend him. Chrono Cross was designed primarily by scenarist and director Masato Kato, who helped write the story for Xenogears. Other key members were designers who also worked on Chrono Trigger, including art director Yasuyuki Honne and composer Yasunori Mitsuda. Nobuteru Yūki designed the characters of the game. Chrono Cross features standard RPG gameplay with some unique aspects. Players advance the game by controlling the protagonist Serge through the game's world, primarily by foot and boat. Navigation between areas is conducted via an overworld map, much like Chrono Trigger's, depicting the landscape from a scaled down overhead view. Locations such as cities and forests are represented by more realistically scaled field maps, in which players can converse with locals to procure items and services, solve puzzles and challenges, or encounter enemies. Like Chrono Trigger, the game features no random encounters; enemies are openly visible on field maps or lie in wait to ambush the party. With over 40 party members to meet, people and dimensions will intertwine in this epic drama. Follow Serge and his companions in a timeless adventure, and prepare for a grand scale battle that will break the bonds of space and time...", "platform": "Sony Playstation", "release_date": "August 15, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "Squaresoft", "publishers": "Squaresoft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.48", "wikipedia": "https://en.wikipedia.org/wiki/Chrono_Cross", "video_link": "https://www.youtube.com/watch?v=bDQ0HYnKcV8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/975-chrono-cross\n"}