{"altername_name": ["Kenshou Akou Jiken - Chuushingura - Rekishi Adventure"], "name": "Chushingura", "overview": "Chushingura is the name for fictionalized accounts of the historical revenge by the Forty-seven Ronin of the death of their master, Asano Naganori. Including the early Kanadehon Chushingura, the story has been told in kabuki, bunraku, stage plays, films, novels, television shows and other media. With ten different television productions in the years 1997-2007 alone, the Chushingura ranks among the most familiar of all stories in Japan. The historical basis for the narrative begins in 1701. The ruling shogun Tokugawa Tsunayoshi placed Asano Takumi-no-kami Naganori, the daimyo of Ako, in charge of a reception of envoys from the Imperial Court in Kyoto. He also appointed the protocol official (koke) Kira Kozuke-no-suke Yoshinaka to instruct Asano in the ceremonies. On the day of the reception, at Edo Castle, Asano drew his short sword and attempted to kill Kira. His reasons are not known, but many purport that insult was involved. For this, he was sentenced to commit seppuku, but Kira went without punishment. The shogunate confiscated Asano's lands (the Ako Domain) and dismissed the samurai who had served him, making them ronin. Nearly two years later, Oishi Kuranosuke Yoshio, who had been a high-ranking samurai in the service of Asano, led a group of forty-six/forty-seven of the ronin (some discount the membership of one for various reasons.) They broke into Kira's mansion in Edo, captured and executed Kira, and laid his head at the grave of Asano. Then they turned themselves in to the authorities, and were sentenced to commit seppuku, which they all did on the same day that year. Oishi is the protagonist in most retellings of the fictionalized form of what became known as the Ako incident, or, in its fictionalized form, the Treasury of Loyal Retainers (Chushingura). In 1822, the earliest known account of the Ako incident in the West was published in Isaac Titsingh's posthumous book, Illustrations of Japan. Chushingura is a first person perspective adventure game released for the Playstation One console. The gameplay is about talking to different characters in each screen to advance into next areas.", "platform": "Sony Playstation", "release_date": "January 29, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Toei Animation", "publishers": "Toei Animation", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110421-chushingura\n"}