{"altername_name": ["Cinema Eikaiwa Series Dai-1-dan: Tengoku ni Ikenai Papa", "Cinema Eikaiwa: Interceptor"], "name": "Cinema Eikaiwa Series Dai-2-dan: Interceptor", "overview": "Interceptor is a rare movie from 1992 by director Michael Cohn, that stars Jürgen Prochnow, Andrew Divoff, Elizabeth Morehead. that is about a U.S. Air Force officer tries to stop a murderous group of terrorists whom are trying to steal two top secret F-117A Stealth Fighters from the cargo hold of a gigantic C-5 Galaxy Transport flying at 30,000 feet over the Atlantic Ocean. While test flying a stealth-fighter with a new Virtual-Reality control circuit somewhere over Turkey, Capt. Christopher Winfield encounters problems and must eject from the plane, that subsequently crashes. Capt. Winfield must follow the two remaining stealth-fighters home to the US in the cargo-bay of a transport-plane flown by Maj. Janet Morgan for a court martial. A group of terrorists led by a man called Phillips are very interested in the planes and try to high-jack one in mid-air, thus forcing Capt. Winfield to go into action. Cinema Eikaiwa - Interceptor allows the player to watch the film with english & japanese subtitles (the movie is the original with English voice acting), and the player can also during the film watching change the subtitles languages and use the dictionary to see the explanation of each word. The game got also other modes like the program lesson in which the player can select the scenes of the film that he wants to watch and practice english, and there is also the sound only mode, in which the player can see the different dialogues and listen to the pronuntiations.", "platform": "Sony Playstation", "release_date": "February 18, 1999", "game_type": "Released", "esrb": "", "developers": "Success", "publishers": "Success", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135255-cinema-eikaiwa-series-dai-2-dan-interceptor\n"}