{"altername_name": ["Cinema Eikaiwa: This Boy's Life"], "name": "Cinema Eikaiwa Series Dai-4-dan: Boy's Life", "overview": "A single mother and her difficult son find family life isn't necessarily all it's cracked up to be in this drama adapted from writer and professor Tobias Wolff's 1989 memoir of the same name. Nomadic, flaky Caroline (Ellen Barkin) just wants to settle down in one place, find a decent guy, and provide a better home for her handful of a son, Toby (Leonardo DiCaprio). When she moves to Seattle and meets the respectful, respectable Dwight Hansen (Robert DeNiro), she thinks she's got it made. Toby, however, feels differently after spending a few months with Dwight and his children and away from Caroline. The boy's stepfather-to-be seems to want to mold Toby into a better person, but to do so he emotionally, verbally, and physically abuses the kid. The marriage proceeds, and soon Caroline, too, recognizes Dwight's need to dominate everyone around him. She sticks with it, though, convinced it's the best thing for her son, and several years of dysfunction ensue. During this time, Tobias befriends another misfit, the possibly homosexual young Jonah (Arthur Gayle), while continuing to chafe under the yoke of his repressive stepfather. This Boy's Life provided the first lead role for future superstar DiCaprio. The film was written by Robert Getchell, who also penned such mother/son fare as Alice Doesn't Live Here Anymore and The Client. Cinema Eikaiwa - This Boy's Life allows the player to watch the film with english & japanese subtitles (the movie is the original with English voice acting), and the player can also during the film watching change the subtitles languages and use the dictionary to see the explanation of each word. The game got also other modes like the program lesson in which the player can select the scenes of the film that he wants to watch and practice english, and there is also the sound only mode, in which the player can see the different dialogues and listen to the pronuntiations.", "platform": "Sony Playstation", "release_date": "April 22, 1999", "game_type": "Released", "esrb": "", "developers": "Success", "publishers": "Success", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135258-cinema-eikaiwa-series-dai-4-dan-boys-life\n"}