{"altername_name": [], "name": "Cinema Eikaiwa Series Dai-5-dan: Zombie", "overview": "The United States is devastated by a mysterious phenomenon which reanimates recently deceased unburied human beings as flesh-eating zombies. Despite the best efforts by the U.S. government and local authorities to control the situation, society is beginning to collapse and the remaining survivors are given to chaos. Some rural communities and the military have been effective in fighting the zombies in open country, but cities are helpless and largely overrun. Confusion reigns at the WGON television studio in Philadelphia by the phenomenon's third week, where staff members Stephen Andrews and Francine Parker are planning to steal the station's traffic helicopter to escape the zombies. Meanwhile, police SWAT officer Roger DiMarco and his team raid a housing project where the residents are defying the martial law of delivering their dead to National Guardsmen. Some residents fight back with handguns and rifles, and are killed by both the overzealous SWAT team and their own reanimated dead. Cinema Eikaiwa - Zombie allows the player to watch the film with english & japanese subtitles (the movie is the original with English voice acting), and the player can also during the film watching change the subtitles languages and use the dictionary to see the explanation of each word. The game got also other modes like the program lesson in which the player can select the scenes of the film that he wants to watch and practice english, and there is also the sound only mode, in which the player can see the different dialogues and listen to the pronuntiations.", "platform": "Sony Playstation", "release_date": "May 27, 1999", "game_type": "Released", "esrb": "", "developers": "Success", "publishers": "Success", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135259-cinema-eikaiwa-series-dai-5-dan-zombie\n"}