{"altername_name": [], "name": "Civizard: Majutsu no Keifu", "overview": "Civizard - Majutsu No Keifu is the Playstation version (only released in Japan) of a PC game called Master of Magic. Master of Magic is a single-player, fantasy turn-based strategy computer game created by Simtex and published by Microprose in 1993. The player controls a wizard attempting to rule two worlds. From a small settlement, the player must grow an empire and banish all the other wizards by military might or casting the Spell of Mastery. To do this, the player must manage resources, build cities and armies, and research spells. Master of Magic's early versions had many bugs, and was heavily criticized by reviewers. The game Master of Magic takes place across two worlds of existence, Arcanus and Myrror. Arcanus is a land much like our Earth, with arctic poles, and terrain consisting of forests, oceans, grasslands, and deserts. Myrror is a parallel world to Arcanus, with a heavier magical atmosphere, fantastic flora and fauna not found on Arcanus. The two worlds are physically linked to each other by special Towers of Wizardry, allowing units to travel between them. The concept is akin to two floors of a building linked by stairwells. In line with the theme of magic in the game, magic nodes - which are sources of magical power - are scattered throughout the two worlds. Likewise, the worlds are populated by fantasy races, such as the magical elves, the gregarious halflings, the despised and productive klackons, and the noble high men. Fantastic creatures like the burrowing great wyrm, undead skeletons, and dragons also abide in ruins and lairs, guarding treasures. Occasionally they stalk the land, and can be summoned and pressed into the services of wizards. The Playstation game features a new intro fmv sequence and the same gameplay of the pc version.", "platform": "Sony Playstation", "release_date": "January 17, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Opera House", "publishers": "Asmik Ace Entertainment", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108083-civizard-majutsu-no-keifu\n"}