{"altername_name": [], "name": "Click Medic", "overview": "Medicine is the applied science or practice of the diagnosis, treatment, and prevention of disease. It encompasses a variety of health care practices evolved to maintain and restore health by the prevention and treatment of illness in human beings. Medic is a general term for a person involved in medicine; a physician, medical student or military medical corpsman. In the UK, the term \"medic\" amongst doctors indicates that someone has followed a \"medical\" career path accredited by the MRCP such as cardiology or endocrinology. This is in contrast to a surgical branch of specialisation in postgraduate professional training. Click Medic is a Playstation game in which tiny creatures are the cause of pain and suffering in the bodies of men. As a video game medic, the player task is to diagnose, analyze and treat these maladies to rid them from his patient. The game begins in the year 2010, with a prologue when you see the doctor as a young boy, and after that the game jumps 6 years in the future to 2016 when the new doctor arrives at a clinic. The gameplay is divided into different parts: 1 - Examination room: The patient arrives at the clinic and the player can talk to his nurse to know about the patient illness and condition. After that he can talk to the patient and decide if he is going to treat her. If he decides to threat her 2 - Treatment room: Here the player will use a machine (with the help of the control room girl) to navigate inside the patient and try to cure her or him, The gameplay in this part is to choose where to go inside. Manufacturer's description: Hypertext adventure to defeat the virus \"Bakurusu\" unknown enter the human body, explore, experiment, reasoning has to become one. Aiming to affected area riding VB machine players are becoming a doctor, to deduce the whereabouts of Bakurusu listen carefully to the story of the patient, which is reduced to the size of the cellular level, he will win fight Bakurusu. Features: First person perspective. 2D graphics Cartoon graphics SCI-FI, Futuristic & Medicine themes.", "platform": "Sony Playstation", "release_date": "January 28, 1999", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Sony Music Entertainment", "genres": "Music", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135238-click-medic\n"}