{"altername_name": [], "name": "Click Manga: Opera-za no Kaijin", "overview": "Click Manga - Opera Za no Kaijin is another interactive comic game based on the The Phantom of the Opera novel in which the player can make advance the comic story clicking in it. The gameplay is that the player has to solve some puzzles or click with the pointer in a comic book scene to advance to the next scene. Le Fantôme de l'Opéra (English: The Phantom of the Opera) is a novel by French writer Gaston Leroux. It was first published as a serialisation in \"Le Gaulois\" from September 23, 1909 to January 8, 1910. Initially, the story sold very poorly upon publication in book form and was even out of print several times during the twentieth century; it is overshadowed by the success of its various film and stage adaptations. The most notable of these were the 1925 film depiction and Andrew Lloyd Webber's 1986 musical. Originally produced for the West End, The Phantom of the Opera musical became the longest running Broadway show in history, after beating prior record holder \"Cats\" in January 9, 2006 The novel opens with a prologue in which Gaston Leroux claims that Erik, the \"Phantom of the Opera\", was a real person. We are then introduced to Christine Daaé. She and her father, a famous fiddler, traveled all over Sweden playing folk and religious music. Her father was known to be the best wedding fiddler in the land. When Christine is six, her mother dies and her father is brought to rural France by a patron, Professor Valerius. During Christine's childhood, which is described retrospectively in the early chapters of the book, her father tells her many stories featuring an 'Angel of Music', who, like a muse, is the personification of musical inspiration. Christine meets and befriends the young Raoul, Viscount of Chagny, who also enjoys her father's many stories. One of Christine and Raoul's favourite stories is one of Little Lotte, a girl with golden hair and blue eyes who is visited by the Angel of Music and possesses a heavenly voice. On his deathbed, Christine's father tells her that from Heaven, he will send the Angel of Music to her. Christine now lives with Mamma Valerius, the elderly widow of her father's benefactor. Christine is eventually given a position in the chorus at the Paris Opera House (Opera Populaire). Not long after she arrives there, she begins hearing a beautiful, unearthly voice which sings to her and speaks to her. She believes this must be the Angel of Music and asks him if he is. The Voice agrees and offers to teach her \"a little bit of heaven's music.\" The Voice, however, belongs to Erik, a disfigured genius who was one of the contractors who built the opera and who secretly built into the cellars a home for himself. He is the Opera ghost (\"Fantôme\" in French can be translated as both \"ghost\" and \"phantom\") who has been extorting money from the Opera's management for many years. Unknown to Christine, at least at first, he falls in love with her. With the help of the Voice, Christine triumphs at the gala on the night of the old managers' retirement. Her old childhood friend Raoul hears her and remembers his love for her. A time after the gala, the Paris Opera performs Faust, with the prima donna Carlotta playing the lead. In response to a refused surrender of Box Five to the Opera Ghost, Carlotta loses her voice and the chandelier overhead plummets into the audience. After the chandelier crashes, Erik kidnaps Christine to his home in the cellars and reveals his true identity. He plans to keep her there only a few days, hoping she will come to love him, and Christine begins to find herself attracted to her abductor. But she causes Erik to change his plans when she unmasks him and, to the horror of both, beholds his face. Furious, he lets her know of his despair and love. Fearing that she will leave him, he decides to keep her with him forever, but after two weeks, when Christine requests release, he agrees, on condition that she would wear his ring and be faithful to him.", "platform": "Sony Playstation", "release_date": "September 30, 1999", "game_type": "Released", "esrb": "", "developers": "Tokuma Shoten Intermedia", "publishers": "Tokuma Shoten Intermedia", "genres": "", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135533-click-manga-opera-za-no-kaijin\n"}