{"altername_name": [], "name": "CosmoWarrior Zero", "overview": "Cosmowarrior Rei Zero is a 3d action game based on the Cosmo Warrior Zero science fiction OVA series. Plot: It's the end of the 30th century. Humanity is reaching as far as Andromeda, but the mechanized beings that humanity created become rogue and conquer their creators, enslaving humanity. Those who don't want to suffer their control have fled Earth. Zero is one of these men. He is a commander of the independent Fleet, what remains of the armed forces of Earth. The war against humanoids left him without family and now his only motivation is to fight the mechanical men, but he receives an order from the supreme commander: to hunt a space pirate called Captain Harlock, who is said to be allied with the mechanical men. Zero faces a difficult situation, as Harlock was the one who trained him and he only assaults the ships of the mechanical men. Determined to find the truth, Zero accepts the mission. After having his wife and child disappear in the battle between the humans and Machine men, Zero has no choice but to serve Earth's government as Captain of second rate ships. After picking up a SOS signal, Zero soon meets Harlock who blows up several cargo ship and destroys Zero's own. After coming back to Earth, Zero is given a new task of hunting down the space pirate Harlock with his new crew of machine men and humans in his old ship, the Karyu. Zero is often faced with problems between the machine men and the humans on his ship who always seem to fight, often causing problems. After meeting Harlock, Zero has more of an appreciation towards him and stills believes in him even after he sees him attack civilians. Later on in the series, Zero and his first officer Marina Oki grow feelings for each other and end up falling in love. The game features 2 game modes & a gallery mode: Story mode: The main \"Cosmo Warrior Zero\" mode. Enjoy the original story created and supervised by Reiji Matsumoto. The story mode is organized into 3 different elements. * Element 1 - A story demo with beautiful visuals, sound effects, and back ground music, and voiced by Toshiyuki Morikawa and Kouichi Yamadera. * Element 2 - Battle characters from Matsumoto's comics like the machiners, and metanoids. Fight rivals characters while aiming at a place of destination, \"opening stages\". * Element 3 - Fight one-on-one characters head on \"main battle\". Duel Mode: Compete with all 8 characters in a timed battle mode. At the end the results of all 8 characters are tallied. Extras mode: You can see images made specifically for the game and view the story from story mode.", "platform": "Sony Playstation", "release_date": "May 18, 2000", "game_type": "Released", "esrb": "", "developers": "Taito", "publishers": "Taito", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.44", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32243-cosmowarrior-zero\n"}