{"altername_name": ["Crash Bandicoot 2: Cortex ataca de nuevo", "Crash Bandicoot 2: Cortex no Gyakushuu!"], "name": "Crash Bandicoot 2: Cortex Strikes Back", "overview": "The evil Dr. Neo Cortex is back with a vengeance .. this time ... to save the world? And he's asking for helo from his arch-nemesis, Crash Bandicoot? Or is it just some conniving plan to lure Crash into a deadly trap for his own evil bidding? Find out as Crash takes on a whole new adventure that's out of this world! Taking place on a fictional group of islands near Australia, Crash Bandicoot 2 follows the adventures of the anthropomorphic bandicoot Crash. Crash is abducted by series villain Doctor Neo Cortex, who has seemingly turned over a new leaf and wants to save the world. Crash is thrust into several parts of N. Sanity Island in order to gather Crystals that will allow Cortex to contain the power of an upcoming planetary alignment and keep the planet from being destroyed. Crash is joined by his sister Coco, who is suspicious of Cortex's true intentions, and by Doctor Nitrus Brio, who tries to persuade Crash to gather Gems instead of Crystals. Crash Bandicoot 2: Cortex Strikes Back received generally positive reviews from critics and was considered to be superior to its predecessor. Much of the praise went to the game's graphics, control and music, with major criticisms varying between the trial-and-error gameplay, lack of level variety, easy boss levels and lack of innovation. The game went on to become one of the best-selling PlayStation video games of all time and replaced its predecessor as the highest-selling Western title in Japan at the time, selling more than 800,000 units in the country by April 1998. A remastered version was included in the Crash Bandicoot N. Sane Trilogy collection, released on the PlayStation 4 in June 2017.", "platform": "Sony Playstation", "release_date": "October 31, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Naughty Dog", "publishers": "Sony Computer Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.49", "wikipedia": "https://en.wikipedia.org/wiki/Crash_Bandicoot_2:_Cortex_Strikes_Back", "video_link": "https://www.youtube.com/watch?v=r_TTrB0c3tc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5420-crash-bandicoot-2-cortex-strikes-back\n"}