{"altername_name": [], "name": "Creature Shock", "overview": "Get ready for the fright of your life Your heart is pounding. Your pulse rate is rising. Your mind is racing. You can taste the sweat from your brow. You have no idea what lurks around the next corner. But you know it won't be pleasant. In the 22nd Century, the Earth is experiencing overpopulation and environmental desctruction on a critical scale. Three ships are launched to search the solar system for a suitable second home. Four years later, as the UNS Amazon nears Saturn, all contact is lost, save for the faint signal of an emergency distress beacon. There's something out there. Something very large, very alien and evidently very unfriendly... Find out what fate befell the crew of the UNS Amazon in a vast alien environment inhabited by hundreds of the most disturbing life-forms ever seen. Immerse yourself in over one gigabyte of exploration and extermination, stunning rendered imagery, and exceptional cinematography that has to be experienced to be believed. Creature Shock is a first-person shooter with Full Motion Video and arcade-like elements. Aliens of all sizes and types will try to destroy the team, but each one has a weak point that can be exploited. The fighting takes place on the surface of asteroids and within mazes of passageways underground. The majority of the game is an FMV based shooter. These sections are basically a maze in which you will encounter various different aliens. Each alien has a weak point which you have to shoot. There are also two 3D sections where the player gets to pilot the ship.", "platform": "Sony Playstation", "release_date": "August 23, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Argonaut Games", "publishers": "Data East", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.33", "wikipedia": "https://en.wikipedia.org/wiki/Creature_Shock", "video_link": "https://www.youtube.com/watch?v=wRqHtT82TkU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92046-creature-shock\n"}