{"altername_name": [], "name": "Crime Crackers 2", "overview": "Team Guppy are a group of what are known as \"Crackers\" -- skilled bounty hunters who make a living fighting against space pirates under contract from the Galactic Police. Team Guppy haven't been around long, and aren't particularly famous, so they don't get a whole lot of work. One day, they get a request from the Galactic Police to respond to a pirate attack on Jack Station, and they jump at the chance. Crime Crackers 2 is the sequel to Crime Crackers, and is again a first-person action game in a similar style. It takes place two years after the original, following a team of Crackers who got into the business after being inspired by Team Pink Dolphin, the heroes of the first game. Just like the previous title, the player must explore each area, defeating enemies and collecting items until they find and defeat the boss. There are several changes to the system since the first title. The most significant is the elimination of action mode: The player can now always attack forward, giving the game a faster pace than its predecessor, but still more deliberate than, say, Doom. The team size has increased to four, and again each member has their own specific abilities, as well as their own life and weapon energy meters. The game is otherwise quite similar to the first game. The story is driven through communication from the support team during missions, as well as in animated cutscenes between them. There is also the option to buy and sell items between missions. The game also features a branching storyline with numerous endings, and will even keep track of which branches the player has played through.", "platform": "Sony Playstation", "release_date": "November 27, 1997", "game_type": "Released", "esrb": "", "developers": "Media.Vision Entertainment", "publishers": "Sony Computer Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.08", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128970-crime-crackers-2\n"}