{"altername_name": [], "name": "Critical Blow", "overview": "A legend exists among the fighters and martial artists of this world, of a mysterious scarab badge that only the most elite warriors will earn. This badge, sent out by the mysterious Merkuar, is in fact an invitation to a dangerous tournament held in England, where the contestants fight for money, power, and glory. Now, a poor young fighter from Hong Kong named Rickey Leon has just received one of these badges. Critical Blow is a 1-on-1 fighting game, and the sequel to Shadow Struggle. Though the game features a full-3D view, gameplay takes place in a traditional 2D plane. In addition to a standard life meter, each character has a Special Guage, which increases as the battle proceeds and allows the characters to use special moves of varying power, called Assault Blows, Super Blows, and the titular Critical Blows. Several game modes also allow the player to earn, apply, and wager a number of types of Cards, which provide different benefits to the character such as extra moves, stronger attacks, or elemental affinities. The game boasts four different game modes: Tournament, Trading, Theater, and Versus. Tournament is a standard arcade mode where the player can select any available character and fight the others in sequence. Trading mode allows the player to fight computer opponents to earn additional cards. Theater mode is the main story mode, featuring fully-animated cutscenes following the main character, Rickey Leon. Finally, Versus mode is a 2-player free battle mode. It is possible to optionally use and wager cards in Versus mode. There are ten characters initially available, with several more unlocked as specific conditions are met.", "platform": "Sony Playstation", "release_date": "April 12, 1997", "game_type": "Released", "esrb": "", "developers": "Racdym", "publishers": "Banpresto", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.09", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24404-critical-blow\n"}