{"altername_name": [], "name": "Crusader: No Remorse", "overview": "As No Remorse opens, a trio of Silencers—enigmatic super-soldiers—are returning from a botched mission in which they disobeyed an order to fire upon civilians who were (mistakenly) believed to be rebels. They are ambushed by a WEC mech, and two of the Silencers are killed. The remaining one, a nameless captain, (whom the player plays as), joins the Resistance, where, as a significant symbol of the WEC's military power and political philosophy, he meets with resentment, distrust and outright hatred. However, he uncomplainingly undertakes dangerous missions, often with substandard equipment, and his continued success gradually earns the respect of his fellow Resistance members. The Captain eventually uncovers secret plans for a WEC space station, the Vigilance Platform, which can attack any location on Earth from space, meaning cities with a known Resistance presence can simply be annihilated at the leisure of the WEC. All such cities are threatened with orbital bombardment unless they surrender. Concurrently, the player's Resistance cell is betrayed from within, and almost all the non-player characters are killed. Despite these setbacks, the Captain infiltrates the Vigilance Platform and destroys it. The traitor is also on the station, guarding the lifepods, and challenges the Silencer to a duel over the access card for the last pod. As the Vigilance Platform is exploding, the Captain is contacted by Chairman Draygan, who swears vengeance against the Silencer.", "platform": "Sony Playstation", "release_date": "December 31, 1996", "game_type": "Released", "esrb": "M - Mature", "developers": "Realtime Associates", "publishers": "Origin Systems", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.94", "wikipedia": "https://en.wikipedia.org/wiki/Crusader:_No_Remorse", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/494-crusader-no-remorse\n"}