{"altername_name": ["Cyberwar"], "name": "Cyber War", "overview": "Cyberwar is a game based on the Lawnmower Man movies that were loosely based on a Stephen King short story, and stars Pierce Brosnan as Dr. Lawrence Angelo. Dr. Lawrence Angelo is a scientist working for Virtual Space Industries (VSI) in \"Project 5\", a secret research facility that attempts to increase the intelligence of primates using psychotropic drugs and virtual reality (VR) training. Dr. Angelo is reluctant to use the research for military purposes, and after one of the chimps escapes and shoots a guard, Dr. Angelo is given a forced vacation. While taking notes on the need for experiment with a human subject, he discovers Jobe Smith (Jeff Fahey), a simpleton who makes his living by doing odd jobs such as mowing the grass (hence the title of the movie). Angelo takes in Jobe, subjecting him to VR treatment. The first experiments quickly increase Jobe's intelligence, but after an accident, Dr. Angelo stops the experiments. The Shop, a secret agency overseeing Project 5, reinserts the drugs responsible for Jobe's violent behavior into the program and speeds up the treatment. As Jobe develops telekinetic powers, he starts to take revenge on those who abused him before he began the treatments, and plots to take over all of the computers in the world. In late 1995, SCi released a sequel for MS-DOS, Macintosh computers & Playstation consoles known as CyberWar. Copies of the sequel are quite rare, as it had a limited release by Interplay instead of the publisher of the first game, Time Warner Interactive. CyberWar splits from the story of the second movie, Lawnmower Man 2: Beyond Cyberspace, and has its own story. Cyberwar is a streaming action-adventure that relies on you pressing left or right at the appropriate second.", "platform": "Sony Playstation", "release_date": "July 21, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "SCi Games", "publishers": "Coconuts Japan Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.43", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92049-cyber-war\n"}