{"altername_name": [], "name": "Daikoukai Jidai IV: Porto Estado", "overview": "Uncharted Waters is a popular Japanese video game series produced by Koei as part of its rekoeition games. In East Asia, the series has a large cult following, but has not received much recognition outside East Asia. The series has been compared to Sid Meier's Pirates! in gameplay and theme. It is a simulation and CRPG series dealing with sailing and trading. In the games, the player takes up the role of a captain (also called commodore in some translations) and manages a seagoing fleet to participate in trades, privateering, treasure hunting, exploration, and plain piracy. Even though the series is largely open-ended, there is still a loose plot which requires the player to follow certain paths, and deviating from these paths may stall the progress of the story The fourth game in the series was released for both PlayStation and PC under Windows 2000 and XP. This game returns to the previous formula, although its open-endedness has decreased and the engine has been updated. This title is plot-wise unrelated to the series that ended in Gaiden. Porto Estado is known for its fine art and high-quality illustrations. The story evolves on the search of the seven Proof of the Conqueror, which are seven ancient artifacts, in seven areas around the world (Northern Europe, Mediterranean, Africa, New World, Indian Ocean, South Asia and East Asia). It is said that having these proofs proves that the sailor is the champion of all sailors. Four sailors (plus another three in expansion) unwittingly involved in the struggle of the quest of the search of the Proof of the Conqueror. It is interesting that not all sailors are from Europe: two of the seven characters are from Asia (one from East Asia and another from southeast Asia), one from Caribbean and another one from Middle East. There are many significant changes in this game. For example, the game no longer has the concept of year and the result is that characters in this game will not age. Also, player can set up regional fleets and these regional fleets are valuable financial resources. In combat, naval battle is now fought in real time. The country boundaries have disappeared. Each character is only represented by their own guild and their home country is not important in gameplay. Ports in this game also have a market share rating in a percentage scale. Players can trade in a port only when his guild has some market share in that port, which can be gained by signing a contract with the local governor.", "platform": "Sony Playstation", "release_date": "December 2, 1999", "game_type": "Released", "esrb": "", "developers": "Koei", "publishers": "Koei", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93820-daikoukai-jidai-iv-porto-estado\n"}