{"altername_name": ["Dance Dance Revolution: USA Mix", "ダンス ダンス レボリューション"], "name": "Dance Dance Revolution", "overview": "One of the world's most influential games makes its way out of Japan for a home-based dance experience like no other. Using a big dance mat (sold separately), you'll step to the beat of the song playing, executing a specific set of moves to a tee. Your cues will come from the screen in the form of four columns of instructions that scroll upwards. Score points by nailing the timing of each step and getting the order of moves correct. The action will get faster and more furious as the game progresses, instructing you to pull off trickier combos in more limited time periods. As in the Japanese release of the game, a Diet mode shows you how many calories you're burning. To account for the steep learning curve, DANCE DANCE REVOLUTION even includes a Training mode to get you started. Packed with remixes of old songs and brand-new gems, the soundtrack boasts 27 danceable tunes. Though it's possible to play without the dance mat, working up a sweat is half the fun of this inventive game. This is the first international release of the game, featuring a song list similar to the arcade title Dance Dance Revolution USA Mix, and should not be confused with the 1999 Japanese-only PlayStation release of the same name (a port of the very first Dance Dance Revolution arcade release).", "platform": "Sony Playstation", "release_date": "March 6, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "4.18", "wikipedia": "https://en.wikipedia.org/wiki/Dance_Dance_Revolution_(2001_video_game)", "video_link": "https://www.youtube.com/watch?v=_sabPIEL8Q0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/15651-dance-dance-revolution\n"}