{"altername_name": ["Dance Europe", "All Music Dance!"], "name": "Dance: UK", "overview": "Dance Europe takes the standard 'bemani' formula - arrows appear rhythmically on screen and the player must hit the corresponding button (on either a dance mat peripheral or the standard PS/PS2 controller) in time with these arrows and the music. Points are awarded for accuracy with extras for making certain 'combos' (mini-routines within a song which are deemed especially difficult or long). The game has tracks by artists including Sugababes, Room 5, Sophie Ellis Bextor, Alizee or DJ Sammy. There are initially three difficulty levels, and the player can either practise one song at a time (in Jukebox mode) or enter the Dance Europe Championship, winning which will unlock a 'Dance Recorder' mode in which players can record their own dance routines. In multiplayer up to 8 players can compete in succession or 2 players can compete head-to-head. A karaoke mode is also provided for use with a wireless microphone (sold separately) whilst 'Aerobic' Mode calculates the number of calories you've burnt during play. Competitive head-to-head modes allow players to compete against each other. Two players can battle against each other in a dance-off. Extra points are awarded for accuracy and score multipliers applied for performing certain combinations. An innovative handicap system allows players with two left feet to compete against seasoned groovers. And for the ultimate party experience Dance: UK can be set to a consecutive multiplayer mode in which up to eight players can dance using one or two mats. As well as the competitive modes, Dance Europe also includes an aerobics mode that allows players to see how much energy they're burning and a Juke Box mode in which any difficulty level and any track can be chosen and practised. With the Dance Europe Wireless Karaoke Microphone, players can sing along with the songs and hear their own voices over the game soundtrack via the TV or separate speakers.", "platform": "Sony Playstation", "release_date": "November 13, 2003", "game_type": "Released", "esrb": "", "developers": "Broadsword Interactive", "publishers": "Big Ben Interactive", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84109-dance-uk\n"}