{"altername_name": [], "name": "Dancing Stage Fever", "overview": "Dancing Stage Fever is a home video game in the Dancing Stage series, the European counterpart to Dance Dance Revolution. It was released in Europe and part of Asia in October 2003 by Konami, as part of its family-oriented 'Bemani' series. It was released in both a PlayStation 2 and a PlayStation version at the same time. The latest addition to the popular series of dancing games, Dancing Stage Fever not only offers another welcome opportunity to get your dance mat hooked up to your PlayStation, but also throws in some new goodies to keep your feet moving that bit longer. The crux of the game is the same as always. In time with the directions on screen, you need to make sure your foot hits the appropriate symbol at the right time. The more accurate you are, the better you will do. You can still play the game with a standard control pad, incidentally, but it's a fruitless exercise, especially when you consider just how cheap a dance mat is. New this time round (although when you're in the midst of a dance it's harder to appreciate it) is the inclusion of officially licensed music videos (PS2 version only). It's a nice addition, but of more interest is the roster of new songs, including tracks from the Spice Girls, Madness and numerous 80s artists. There are plenty of songs to dance to, which is what it's all about. Anyone who has enjoyed a Dancing Stage game to date is going to find few faults here. It hardly changes the formula of the genre, but then it doesn't need to. It provides a fresh dose of high-entertainment dancing fun, even if your feet will hurt by the time you've finished.", "platform": "Sony Playstation", "release_date": "October 24, 2003", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93343-dancing-stage-fever\n"}