{"altername_name": [], "name": "Dark Hunter: Jou Ijigen Gakuen", "overview": "Dark Hunter (Jou) Ijigen Gakuen is the first game in the Dark Hunter series. In the game you can select one of the three main characters (Mariko Kayano, Ran Mashimo & Cher Mulligan). The PSX game is fully voice acted. 2 language interaction (Japanese or English), perfect speech dubbing free conversation. It's possible to select speech choice. Dark Hunter is an adventure game that is the second entry of Shibusawa Kou's \"English Dream\" series -following the three-part entry, Emit. The purpose behind both projects is to teach Japanese people the English language with the help of a thrilling narrative. Each game has English consultants with a dual language and subtitle option for players. While the English Dream series has been largely forgotten, both titles appeared on Koei's 2003 Winter Thanks Rare Campaign with cheap and forgiving prices. This game was released as two separate parts, the first part being Strange Dimension School and Demon Forest is the second. Character designs were made by Atsushi Kamijo with Naoyuki Onda for line cleanup. A strange set of violent crimes hit Tokyo streets. The young perpetrators state feeling no remorse for their ruthlessness and the cases pile up at an alarming rate. Within the city streets, Mariko experiences a chain of vivid hallucinations after her father's remarriage. Her new mother sends her away to attend Jigen High School, the exile for \"special youths\" ostracized in society. During one of her daily commutes, she meets two mysterious people: a stoic young man and a beautiful woman. Mariko's encounter with them is tied to her adventures of the academy's true colors. The adventure begins when Ran Mashimo (the main character of the game) arrives to the town of Kimen (that means Face to the demon) when he enters the school (Jigen Academy which headmaster is Shogen Kuji) where he thinks that is the demon's headquarters. Cher Mulligan (another demon hunter) arrives there too in her car and almost got involved in an accident with 2 students (Yuichi & Mariko Kayano). Cher & Ran appears there as students of the academy. As soon as they arrive Ran notice that Mariko Kayano is the only student not dominated by the demons.", "platform": "Sony Playstation", "release_date": "April 11, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108097-dark-hunter-jou-ijigen-gakuen\n"}