{"altername_name": [], "name": "Dark Tales: From the Lost Soul", "overview": "Dark Tales from the Lost Soul is a obscure Japanese horror game, Dark Tales allows the player to experience three separate stories. It's an interesting little Choose Your Own Adventure title in which you go through three distinct stories, selecting different choices when prompted, and surviving the attempts of evil beings on your life. The game is divided into \"DECIDE\" moments (make a selection), \"DECIDE/Dodge\" (in which you must dodge attacks), \"DECIDE/Shoot\" (attempt to shoot at the enemy), as well as an additional series of dodging events and two 'mini-games'. There are also quick reflex events, in which you must press the indicated button quickly. Naturally, there are multiple endings to be found depending on the decisions you make. There seem to be 'End Points' associated with the endings, but I don't know what significance these have, if any. All of the game is within first-person perspective, and what is most interesting is that no people are ever pictured on screen. You can tell that there are people there, based on the sounds they make and their voices, but you cannot see them. Very odd. The graphics are actually reminescent of the original Alone in the Dark... the rendering seems dead similar, and is just as pixely/edgy/whatnot. There is also a noted lack of 'detail' - the developers likely had to cut certain graphical details to keep the game running smoothly on the PlayStation. It seems to work with the lack of actual visible people in giving the title a sort of surreal edge. There are FMVs: all of them feature a faceless audience with a wide variety of items on their tables... and a single host, the only human face we see throughout the entire title. A creepy, gaunt man, he introduces each of the tales and gives off some possibly cheesy yet very entertaining dialogue.", "platform": "Sony Playstation", "release_date": "October 28, 1999", "game_type": "Released", "esrb": "", "developers": "Vertex Zero", "publishers": "Sammy Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108150-dark-tales-from-the-lost-soul\n"}