{"altername_name": [], "name": "Death Mask", "overview": "What if you awoke with someone's else identity? What if that person is your arch enemy? Death Mask is a first person perspective adventure game. The game starts when the player's character, Jake Hard (a member of the Paradise City police department) is pursuing master criminal Angel Devoid and he suffer an accident in a tunnel, when he wakes up in a hospital he finds the nurse take a fit when she identifies that he's Angle (a bit of a bad guy). After exiting the hospital through a window and going down a ladder he find one of his police department fellows that believe his story and provide him with a weapon. From here he must escape the law, seek advice in the underground world and basically solve problems to keep himself alive. In the game the player must unravel this tangled web while cruising Angel Devoid's old haunts in the sexiest and sinning areas of Paradise City, keeping one step ahead of those who want to kill him while piecing together the whereabouts of the real Angel Devoid and trying to get his life back. Often he runs into conversations with people and robots instead of shooting them directly; then the player doesn't choose the exact answer but only the mood (aggressive, passive or normal) Jack answers in. The wrong approach may result in death. The protagonist can't walk freely through the city; the game consists of several single screens which have to be left by clicking on an exit, followed by a walking animation. There are quite a few places to visit, e.g. bars or a museum, but choosing the wrong path or hot spot generally leads to an instant death. There are also a few basic inventory-based puzzles to solve. Death Mask takes place is a darkly neo-Gothic world strongly reminiscent of cyberpunk, Blade Runner, or certain Japanese animation movies. With a wide range of actions and reactions, plus full-motion video, players can do just about anything in this fast, action-packed game. The game was released as Angel Devoid: Face of the Enemy for PC.", "platform": "Sony Playstation", "release_date": "February 9, 1996", "game_type": "Released", "esrb": "", "developers": "Electric Dreams", "publishers": "Vantan International", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109306-death-mask\n"}