{"altername_name": [], "name": "Dezaemon Plus", "overview": "Dezaemon Plus is a Playstation One shooter creator allows you to create (almost) any kind of 2D you can imagine. The game is more of an update to the SNES iteration, rather than a full blown sequel. Several of the competition games bundled with Dezaemon appear to have actually been made using the SNES original. Although not as advanced as the later Saturn sequel (Dezaemon 2), this PS1 release is still pretty versatile, and a lot of fun. If you’ve ever used Mario Paint, all the tools will seem familiar. Released by Monkey Paw Games in its original Japanese form. TOOLS: The real flaw to Dezaemon is that it doesn’t support horizontal shmup creation by default, only vertical. Upon hearing this I immediately decided: I’m going to make a hori shmup using this vertical shmup creator! And I did, or at least the illusion of one. The game allows for designing the graphics for all backgrounds, bullets, explosions, enemies, main craft, and power-ups. Basically everything. You can set where enemies appear, how they appear, the movement pattern they use (from 20), what kind of bullet patterns they fire (again, 20), the speed at which they move and fire, what they fire, and there’s also a neat special effect option where you can have them rotating, shrinking or expanding at different speeds. This is great if you want a tiny ship to balloon in size. Ships can be on the ground (background) or in the air (foreground), invincible or harmless, whatever you choose. You can also compose all the music. The clever thing is, you can also make enemies spawn other enemies, which if you use a little ingenuity with, you can create ever more elaborate attack patters – hell, you could probably rig up a crude danmaku shooter if you wanted. You can even make your spawning enemies invisible and harmless, thereby making enemies spawn from them in creative places. Success lies in your imagination and using the tools in inventive ways, which is how I made a hori shooter. You get out what you put in, and while there are 10 pre-made shooters on the disc, the most fun will be found in creation. GAMEPLAY: Dezaemon Plus! is divided in two main areas. Gameplay offers a nice selection of levels designed by people back in the day, so in theory, you’re not playing only one game. These custom-made designs are very interesting to play and look at, but they’re essentially the same game. The other half of the game, Edit, includes a fairly vast editor (that was used in all the Gameplay scenarios) which lets you create your own levels either from scratch or using the game’s own assets, in areas such as graphics, level architecture and even music. As stated before, Dezaemon Plus! is, at its core, a vertical shooter. You start a level with your basic shooting mechanics and as you progress through the level you get some power-ups to help you beat the boss, in order to get to the next level. As simple as gameplay is, it becomes a little hard because your ship is usually too slow and the increasing amount of enemy fire makes it difficult to handle, let alone getting the power-ups that make the game significantly easier. This, however, loses relevance as every time right before a boss, there are a couple of enemies carrying some important items; one of them, a green orb that will grant you the most over-powered laser ever created by a developer. Not only the difficulty significantly decreases after getting such orb, but you get to keep the power-up even if you die. It should be noted, however, that even with its shortcomings, there’s good fun to be had within the various designs offered in the Gameplay area, and the fact the art between those is so vastly different does leaves you wondering what’s coming next, which is good. The other half of the game is probably the most interesting and innovative one. It’s a level creator with a plethora of options for you to build your own levels. Considering this is a 1996 game, this is a pretty ambitious and novel concept to incorporate in a game like this. The Graphical Editor will let you edit existing assets, or draw new ones in order to create ships, enemies, explosions and so on. On the other hand, the Construction Editor will let you customize how the actual level will perform. Lastly, the music editor acts like a Mario Paint of sorts. Unfortunately, given the complicated and badly designed interface, there’s really no fun to be had. Some of the icons are unintelligible, while others are simply bad; the movement is extremely erratic, which leads to an overly frustrating experience when it comes to drawing. I know it is possible to actually create something with this tools, but they are so poorly executed, you will probably want to avoid this section altogether.", "platform": "Sony Playstation", "release_date": "May 24, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Athena", "publishers": "Athena", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "3.96", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95797-dezaemon-plus\n"}