{"altername_name": [], "name": "Digital Ehon Vol. 5: Imadoki no Urashima Tarou", "overview": "Digital Ehon is a site that turns the folktales of various countries into a picture book and translates them into various languages in order to offer them to the children of the world. Their sincere hope that children may come to gain a greater mutual understanding of people and cultures thorough this site. With that end in mind we shall do our best to offer a wide variety of folktales that children will enjoy. Urashima Taro is a Urashima Taro is a Japanese legend about a fisherman who rescues a turtle and is rewarded for this with a visit to Ryugu-jo, the palace of Ryujin, the Dragon God, under the sea. He stays there for three days and, upon his return to his village, finds himself 300 years in the future. STORY: One day a young fisherman named Urashima Taro is fishing when he notices a group of children torturing a small turtle. Taro saves it and lets it to go back to the sea. The next day, a huge turtle approaches him and tells him that the small turtle he had saved is the daughter of the Emperor of the Sea, Ryujin, who wants to see him to thank him. The turtle magically gives Taro gills and brings him to the bottom of the sea, to the Palace of the Dragon God. There he meets the Emperor and the small turtle, who was now a lovely princess, Otohime. Taro stays there with her for a few days, but soon wants to go back to his village and see his aging mother, so he requests Otohime's permission to leave. The princess says she is sorry to see him go, but wishes him well and gives him a mysterious box called tamatebako which will protect him from harm but which she tells him never to open. Taro grabs the box, jumps on the back of the same turtle that had brought him there, and soon is at the seashore. When he goes home, everything has changed. His home is gone, his mother has vanished, and the people he knew are nowhere to be seen. He asks if anybody knows a man called Urashima Taro. They answer that they had heard someone of that name had vanished at sea long ago. He discovers that 300 years have passed since the day he left for the bottom of the sea. Struck by grief, he absent-mindedly opens the box the princess had given him, from which bursts forth a cloud of white smoke. He is suddenly aged, his beard long and white, and his back bent. From the sea comes the sad, sweet voice of the princess: \"I told you not to open that box. In it was your old age ...\" GAME: Digital Ehon Vol. 5 - Imadoki no Urashima Taro is based on the japanese fairy tale of the same name (this time Taro is a surfer instead of a fisherman). The gameplay is like the usual in an interactive book since in the first game mode the player can interact with each image using the pointer to see different objects or characters moving, and in the second game mode is just to watch the story without any kind of interaction. The game features full japanese voice acting. Manufacturer's description: Revolution of the picture book! Everyone modern twist on an old tale that knows, ordinary can not be expressed in a picture book animation and games, narration, is software that stir the imagination of children in such sound effects appeared! 5th is recorded \"Urashima Taro\"! Gimmick is as full of \"Oasobi mode\", equipped with a \"story mode\" of Storytelling in the narration. Features: •First person perspective. •2D graphics •Cartoon graphics •Fantasy & Fairy Tales themes.", "platform": "Sony Playstation", "release_date": "September 12, 2002", "game_type": "Released", "esrb": "", "developers": "Smilesoft", "publishers": "Smilesoft", "genres": "", "max_players": "", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135158-digital-ehon-vol-5-imadoki-no-urashima-tarou\n"}