{"altername_name": ["デジモンワールド デジタルカードバトル"], "name": "Digimon World: Digital Card Battle", "overview": "Similar to Digimon World, the plot is centered around the Player, who is called to File Island and given a Digivice by Babamon. The island is in trouble because a dangerous card known as the Bug Card was excavated from the Ancient Dino Region, which is able to cause bugs within the Digital World, from minor bugs to major errors. Soon after the excavation, Ancient Dino Region's Card Leader Brachimon contacted Babamon in order to keep the card safe, but before Babamon was able to reach Brachiomon, someone had stolen the Bug Card. As the Bug Card continues to go missing, its effects start to show slowly to Digimon around the island. Babamon is one such Digimon, now incapable of leaving the Village of Beginnings in its current form. This is the reason why the player is summoned to save the Digital World. The player's goal is to meet the seven Card Leaders around File Island and take from them the \"7s\" cards, which are required to reach Infinity Mountain, where all the data of the Digital World is processed, as well as to find the one who stole the Bug Card and bring it to the mountain, in order to revert the damage it caused and to prevent it from causing any further damage. The gameplay is heavily based on Digital Monster Card Game, except there is Hit Points system implemented on each Digimon Card. There are 159 cards of total in this game, which can be classified into three categories: Digimon Card, Option Card, and Evolution Card. Digimon Cards can be divided into five specialties: Fire, Ice, Nature, Darkness, and Rarity. These cards can be bought or sold at Card Shop. There are also 7 rare \"7s\" cards, each of them having a powerful effect.", "platform": "Sony Playstation", "release_date": "December 22, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Digimon_video_games#Spin-offs", "video_link": "https://youtu.be/evczY5J655U", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369887-digimon-world-digital-card-battle\n"}