{"altername_name": ["デジモンワールド　デジタルカードアリーナ", "Digital Card Battle", "DigimonWorld: Digital Card Arena"], "name": "Digimon: Digital Card Battle", "overview": "The gameplay is similar to its predecessor Digimon World: Digital Card Battle. Some Digimon card artworks, specialties, stat points, and support effects are changed. In addition, there are 6 Partner cards with an EXP based system, which allows increases in HP or attack points when leveling up at certain levels up to 99. Partner cards also have Digi-Parts, which can be useful to change their support effect. The player can only have 3 Partner cards in his/her deck. Partner cards can evolve into a new Armor level by using Digimental that can be received from certain characters. Normally, the Armor cards have lower stats than Level IV cards and cannot be obtained by any means. Unlike its previous game, the cards cannot be bought. The player obtains three cards after defeating each opponent. The player can also create decks based on the opponent's decks if there are enough cards needed. A new feature, the Fusion Shop, allows two cards to be combined into a single new card, or simply exchange unneeded cards to increase a Partner card's EXP. There are 301 cards of total, ranging from 000-300. The player now can have a maximum of 7 identical card in his/her collection. There are seven powerful \"7s\" cards, as well as the rare-yet-useless 12 Digi-Jewel cards.", "platform": "Sony Playstation", "release_date": "December 21, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "BEC", "publishers": "Bandai", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "4.07", "wikipedia": "https://en.wikipedia.org/wiki/Digimon_Digital_Card_Battle", "video_link": "https://www.youtube.com/watch?v=pbtOME7kvF4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/85329-digimon-digital-card-battle\n"}