{"altername_name": ["Disney's Animated Storybook: Mulan", "Disneys Interaktive Abenteuer: Mulan", "Disney's Mulan: Story Studio", "Disney's Aventura Interactiva: Mulan", "Mulan - Disney's Story Studio", "Disney Fais Ton Histoire! Mulan"], "name": "Disney's Story Studio: Mulan", "overview": "You are invited to join the characters Mulan and Mushu on the journey of their lives. Videogame publisher NewKidCo and Disney Interactive extend the magic of Disney's hit animated film Mulan to the PlayStation game console in Disney's Story Studio: Mulan. This action-adventure game leads girls on a daring quest in search of the elusive magic scrolls containing the legend of Mulan. Based on the Chinese legend chronicling the adventures of a young woman determined to spare her father's life by taking his place in the Chinese Army, the game begins when Mushu is startled by Cri-Kee, and drops the scrolls containing the legend of Mulan, causing them to lose their magic. Players can either assume the role of Mulan on her quest to recover the missing scrolls, or simply play any one of five full games or mini-activities within the title. Discovering the magical scrolls will earn the player the title of Imperial Storymaker, but succeeding will require imagination and creativity. Players will have the opportunity to participate in a variety of fun-filled activities at Tung Shao Pass, the Imperial City, The Temple, Mulan's house and other interesting locales. Attack the Huns with a snowball fight; sing along karaoke-style to three songs from the movie; play a new twist on the ancient Chinese game of Mahjongg; and journey through a maze and logic puzzle to help Mushu recover all the supplies without creating a catastrophic avalanche. Players can also dress Mulan and Mushu in various outfits in the Dressmaker's Shop, challenge their memory skills as they try to remember the correct pattern that will keep Mulan's ancestors awake, and use their creativity to develop their very own adventure story! Features: * Games and stories based on the Disney movie * Play dress-up with Mulan and Mushu * Create your own stories * Perform Karaoke to original songs from the movie", "platform": "Sony Playstation", "release_date": "December 15, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Revolution Software", "publishers": "NewKidCo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.8", "wikipedia": "https://en.wikipedia.org/wiki/Disney's_Animated_Storybook:_Mulan", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72958-disneys-story-studio-mulan\n"}