{"altername_name": ["Toy Story Racer", "Toy Story Racer", "Disney-Pixar Toy Story Racer"], "name": "Disney-Pixar's Toy Story Racer", "overview": "The toy room has been abuzz with a new contest: Andy has obtained a plethora of radio-controlled vehicles; Buzz Lightyear, Woody and the rest of the gang have found these little cars to be perfect for racing! These fearless animated characters have ignored potential danger and taken to their own environment, even venturing to a hazardous street and the perilous Pizza Planet in a heated competition to find out which toy is the best driver. Released for the PlayStation, Disney/Pixar's Toy Story Racer is a go-kart racing title that endeavors to bring the action and environments from the animated classic to said console. Natural for the genre, the various vehicles, characters and power-ups are not realistic nor attempt to be; instead, these things are arcade-like in nature and used in the tradition of Mario Kart. Armchair kart fans will race through 18 courses and have access to various modes. Completion of these modes will unlock a plethora of secrets. There are four different characters from which to choose at the onset including the aforementioned duo, RC and Bo Peep. Once a number of tokens have been amassed, other characters will be available such as Rex, Mr. Potato Head and Slinky Dog. Tokens are earned when certain challenge objectives have been completed. Each character has various skills and challenges to learn and overcome; whereas some characters specialize in speed and acceleration, other vehicles have better handling. Completing character challenges will also unlock other goodies such as new tracks. Aiding in this quest is a number of power-ups that increase the vehicle's speed and blow the competition away. Some power-ups are dangerous, however, and will thwart the character. Modes include Standard Racing, Knockout Racing, Lap Trial, Endurance, Collection, Countdown and Survival. While the Standard Racing mode comes with challenges galore, the Knockout mode is a tournament-based competition where the last person on each lap is thrown out of the race. The mission in Lap Trial is to overcome the best lap times. As the name implies, the Endurance mode will have go-karters finishing a certain number of laps before the time expires. Whereas Collection involves hunting down laughing Weebles, the Countdown is a time-based competition in which all courses must be finished. Whenever a rival competitor is hit via weapon fire in the Survival mode, he or she is out! Disney/Pixar's Toy Story Racer also features various tournaments and a multi-player mode for two people. In the latter option, you and a friend can duke it out in split-screen, head-to-head action. With a reverse feature, courses can also be raced backwards. The play options are the core of the game, and they are quite extensive. The ways you can play Toy Story Racer are slowly revealed to you as you acquire green army men tokens. The game unlocks regular and reverse modes as well as new characters. The modes themselves brim with variety, although they all basically control the same. Each mode offers different experiences, such as the Survival modes where it's a one-hit-and-you're-out affair or the Collection mode, where you're racing around trying to collect as many weebles as you can. The pace in which these challenges are unlocked is solid as well, perfect for both the young and old alike.", "platform": "Sony Playstation", "release_date": "February 28, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Traveller's Tales", "publishers": "Activision", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.93", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=4QS2wJb0jqc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24259-disney-pixars-toy-story-racer\n"}