{"altername_name": ["Disney's Kuma no Pooh-San - Mori no Daikyousou!", "Disney's Party Time with Winnie the Pooh", "Disney's Party mit Winnie Puuh", "Disney Ven a la Fiesta! con Winnie the Pooh", "Pooh-san no Minna de Mori no Daikyousou!"], "name": "Disney's Pooh's Party Game: In Search of the Treasure", "overview": "Geared toward young children, Disney's Pooh's Party Game: In Search of the Treasure is a board game adventure similar to Mario Party. As Pooh, Tigger, Rabbit, Piglet, Owl, or Roo, players must make their way around three increasingly difficult board games in an attempt to finish first. One to four players can participate in the adventure, or simply compete against each other in the mini-games. Adventure mode has players moving around the different squares of the board and challenging the other characters in one of five mini-games. The outcome of the mini-game determines the number of squares each player can move on the next turn. First place earns six squares, second place earns four squares, third place earns two, and last place earns one. Collectible honey pots along the way boost a character's moving potential, and there can be positive or negative effects when landing on a particular square. For instance, players may have to move back a certain number of spaces, lose honey pots, or receive an extra move. Players will also encounter Gopher, as well as bees, Heffalumps, and Woozles in their journey around the board. Five mini-games include Owl's Fruit 'n' Hoot, Pooh's Pinball Party, Tigger's Thunder & Frightening, Rabbit's Roller Races, and Piglet's Pumpkin Hunt. While only two mini-games are available for quick play in the beginning, the others become unlocked after playing the adventure mode. Difficulty levels for the mini-games can be adjusted to Easy, Normal, or Hard.", "platform": "Sony Playstation", "release_date": "November 21, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Doki Denki", "publishers": "Electronic Arts", "genres": "Party", "max_players": "4", "cooperative": "No", "rating": "3.19", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31895-disneys-poohs-party-game-in-search-of-the-treasure\n"}