{"altername_name": ["Lilo & Stitch - Zoff auf Hawaii", "Lilo & Stitch", "Disneys Lilo & Stitch: Zoff auf Hawaii", "Disney's Lilo & Stitch: Trouble in Paradise", "Disney's Lilo & Stitch: Ballade på Hawaii!", "Disney Lilo & Stitch en Problemas en el Paraiso", "Disney Lilo & Stitch: Ouragan sur Hawai"], "name": "Disney's Lilo & Stitch", "overview": "Lilo, a young Hawaiian girl, and Stitch, a multi-limbed alien, are the stars of the aptly titled Lilo & Stitch -- a platform romp based upon the Disney movie of the same name. Following much the same formula as other 3D platformers, the game puts the two unlikely protagonists through a series of levels in and around the island of Hawaii. Together they will discover the true meaning of \"Ohana\" (Hawaiian for family). The gameplay, patterned closely upon the system's other platform star, Crash Bandicoot, sees players taking control of one of the two characters at a time as they navigate 2D side scrolling levels as well as linear 3D portions of the world. Regardless of the currently active character, the objectives remain much the same, as the two pint-sized heroes break the pots and crates in their path and collect coffee mugs, flowers, leaves, and other such objects littered about the island. Aside from being able to jump, each character possesses a unique attack, allowing them to defend themselves from the throngs of indigenous bugs, lizards, and porcupines that inhabit the island. A handful of mini-games, such as a timed race against an opponent, are interspersed between the platform-jumping portions of the game. Throughout the quest, players will encounter familiar characters from the movie, including Jumba Jookiba, Pleakley, and Captain Gantu. As an added bonus, hidden photos and movie clips can be uncovered during play.", "platform": "Sony Playstation", "release_date": "June 14, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Blitz Games", "publishers": "Sony Computer Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Lilo_%26_Stitch:_Trouble_in_Paradise", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18130-disneys-lilo-stitch\n"}