{"altername_name": [], "name": "Doraemon 3: Makai no Dungeon", "overview": "Doraemon is a Japanese manga series created by Fujiko F. Fujio (the pen name of Hiroshi Fujimoto) which later became an anime series and Asian franchise. The series is about a robotic cat named Doraemon, who travels back in time from the 22nd century to aid a schoolboy, Nobita Nobi Doraemon is sent back in time by Nobita Nobi's great-great grandson Sewashi to improve Nobita's circumstances so that his descendants may enjoy a better future. In the original timeline, Nobita experienced nothing but misery and misfortune throughout his life. As a result of this, Nobita's failures in school and subsequently, his career, have left his family line beset with financial problems. In order to alter history and better the Nobi family's fortunes, Sewashi sent a robot called Doraemon. Doraemon has a large pocket from which he produces many gadgets from the future. The pocket is called yojigen-pocket, or 4 dimension pocket. In this third Playstation game Nobita and Doraemon sometimes creates holes in the world but this time they discover a huge cave in the basament of a vacant land near the house. When they explore the cave they found an altar and when Doraemon tried to open the altar using his magic monsters start to appear in the cave transform in it into a dungeon. A new little strange creature appears too and Nobita and Doraemon became friends with it. With his help they have to destroy all the monsters in the dungeon. The gameplay is similar to games like Chocobo Dungeon or Torneko: Action rpg and a lot of floors to explore and enemies to destroy.", "platform": "Sony Playstation", "release_date": "December 14, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Epoch", "publishers": "Epoch", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95806-doraemon-3-makai-no-dungeon\n"}