{"altername_name": [], "name": "Dr. Rin ni Kiite Mite! Koi no Happy Four Seasons", "overview": "Dr. Rin ni Kiitemite is an eight volume manga series by Kiyoko Arai about a young girl named Meilin Kanzaki who is endowed with Feng shui powers which allow her to read people's fortunes and give advice on how to receive good luck. She does this on a website under the pseudonym of \"Dr. Rin.\" She loves her friend Asuka Yuuki, who is a star on the school soccer team. However, she constantly bothers him with her Feng shui advice when he doesn't believe in any of that. Ask Dr. Rin! was serialized in Ciao and later adapted into a 51 episode anime series by Nippon Animation, directed by Shin Misawa and with music by Takanori Arisawa. It was broadcasted by TV Tokyo from 5 April 2001 to 25 February 2002. Meirin Kanzaki is a 7th grade girl with the ability to use feng-shui divination. Secretly working under the pseudonym of Dr. Rin, she tries to help people in her school and elsewhere to solve their romance problems. She tries to keep this a secret from her father, since \"Dr. Rin\" is getting so popular that she's stealing some of his customers. She also tries to use her powers to help out Asuka, a boy who is her childhood friend and whom she has a crush on. Unfortunately for her, Asuka doesn't believe in fortune telling and tends to become disturbed when she tries to help him. With the help of the hakke crystal, Meirin drives the dark forces away from Tokiwa, Banri, and Eddy - some of her friends - each of who turn out to be the reincarnations of three of the four celestial guardians (Byakko, Genbu, and Suzaku respectively. The other is Seiryuu). All but Asuka awaken from the sleep of their past lives. The Dark Witch uses this to her advantage by forcing him to awaken, but to the dark side. The Dark Witch then slowly steals the Crystals (2 for each Guardian) that Meirin obtained when the Guardians awoke. They boosted her powers and allowed her to use strong feng-shui, but if she doesn't have enough crystals, it would tire her out easily. Asuka easily defeats the other 3 Guardians, sometimes 1 on 1, and several times all together. He renounces his feelings for Meirin, and torments her by flirting with the Dark Witch. After the score being brought to three Crystals versus five Crystals, Meirin could not purify Asuka with so few crystals. So instead, they confront and she cures him. Then, with all 4 Guardians, the Dark Force chooses to set it's plan in motion. The Dark Force creates a giant dark tower, and everyone except the magical people have memory of it not being there. Meirin convinces a few family members with a photo, stuck inside a journal with a hakke as a bookmark. They go up the tower, each fighting a dark guardian. As they rise to the top, it is revealed that the true mastermind was Meirin's brother, Kyoumi. He then shoves aside the Dark Witch, saying he preferred Meirin all along. This traumatizes the Dark Witch, and while everyone comes up injured, Meirin's sister wishes she could help, and she is awakened as the Light Witch's aid. She heals everyone, and the Dark and Light witch unite their powers to defeat the Dark Force. They end up in a desert, and Meirin searches for Asuka and vice versa. When they unite, they see their past lives and they explain the reason Asuka hated occult things and couldn't awaken. In the past, Asuka the dragon loved Meirin the Light Witch, but it was forbidden, so instead of breaking his heart in a quick jolt, she sealed his memory and powers away. And instead of confronting his past life, Asuka had an inner reason he could not do it, because his love for Meirin was the seal, and his powers would only draw upon the Light Witch's power, which would be distorted from love. And when they united in the sand storm, they brought inner peace and proved they could be united. Then everything returns to normal, and Kyoumi apologizes to the family for shoving himself into their memories and leaves with the Dark Witch. Meirin then wakes up, and realized it was all a dream. Asuka then says \"Maybe not. ..\" The Playstation game Dr. Rin ni Kiitemite! - Koi no happy Four Season is an adventure game with mini games in which the player have to choose between differente answers to advance in the game, depending of those answers the relations between Meirin and the boys will be better or worse. Different events will happens depending of the player choices and sometimes that will leave to a mini game to increase of decrease the affinity with that character. Some of the mini games are a hide and seek game in which the player have to find the pairs, a continuous split-plate in which the player have to move the bell light horizontally and vertically, to help you practice the Great split plate. There are different endings depending of the choices and relations with the 4 boys.", "platform": "Sony Playstation", "release_date": "November 28, 2002", "game_type": "", "esrb": "", "developers": "Hudson", "publishers": "Hudson", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135716-dr-rin-ni-kiite-mite-koi-no-happy-four-seasons\n"}