{"altername_name": ["Dragon Quest Monsters 1 & 2: Hoshifuri no Yuusha to Bokujou no Nakama-tachi", "ドラゴンクエストモンスターズ1・2 星降りの勇者と牧場の仲間たち", "勇者斗恶龙怪兽篇1+2：星降的勇者和牧场的伙伴们", "Dragon Quest Monsters 1·2: The Stars-descended Hero and the Ranch Companions"], "name": "Dragon Quest Monsters 1・2: Hoshifuri no Yuusha to Bokujou no Nakamatachi", "overview": "Dragon Quest Monsters 1 & 2 is a remix of the first two games in the popular Dragon Quest Monsters series for Playstation. The game featured updated graphics and a new interface. In Dragon Quest Monsters 1 you are a young boy named Terry who is looking for his sister Milayou, who was taken away by a creature called Warabou. You end up taking up the life of a monster tamer along the way, with the goal being to win a tournament between the kingdoms of the world; I won't spoil anything, but even for a simple story line this one does throw a curve or two at you. In Dragon Quest Monsters 2, you take on the role of one of two siblings; a boy named Ruka, or his younger sister Iru (who affectionately refers to Ruka as Anichan). When a simple task from your mother to pick up a cake goes terribly wrong thanks to a prince named Kameha and the previously mentioned Warabou, disaster looms over the entire kingdom, and you must find an item in the other worlds that can prevent it. Dragon Quest Monsters 2 does receive a number of story alterations from the original Gameboy game.", "platform": "Sony Playstation", "release_date": "May 30, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "TOSE", "publishers": "Enix", "genres": "Adventure", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=XH3HC2ocFVE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/105521-dragon-quest-monsters-12-hoshifuri-no-yuusha-to-bokujou-no-nakamatachi\n"}