{"altername_name": ["Dragon Ball Z: The Legend"], "name": "Dragon Ball Z: Idainaru Dragon Ball Densetsu", "overview": "Dragon Ball Z - Idainaru Dragon ball Densetsu, better know as Dragon ball Z - Legends, is the second installment of Bandai's series of Dragon Ball Z games. The game starts with the events of the Saiyan Saga and the fight with Vegeta and Nappa. In this game up to 6 people can be on screen at one time!. In story mode, it takes you from the battle with Nappa and Vegeta on Earth to the battle with Buu. just like the Tv show. At the beginning of each fight you are given a total of 4 fighters (up to 6 later) from which you have to choose the 3 that you would like to participate in the battle that follows. Each fighter has 2 bars. a green and a yellow one. The green represents the life force and the yellow the power force which is depleted with every attack you do. At the bottom of the screen there is a blue bar and a red one that form a gauge called Power Balance. The reason for this gauge to be there is because your attacks don’t affect the enemies’ life bar directly. By continuously attacking the enemy the bar that represents your power (blue bar) increases while that of the enemy (red bar) decreases. When the blue bar covers all the gauge a random attack sequence, from the current character you’re controlling, is initiated and that’s how you can actually injure your opponents. The same can happen to you though if the enemy’s red bar covers all the gauge. GAME MODES: - Special Mode: Opened when you beat Story Mode. Battles that you can't choose your warriors and some of these remember something about the story. - VS Mode: 1P vs 2P, 1P vs CPU or CPU vs CPU. You can choose from 1 to 3 warriors for each side and you have only avaiable the characters you had already seen on Story Mode. - Story Mode: The story mode is like the real Z story, which is divided in 8 episodes: 1-Sayajins Attack 2-Ginyou Command 3-Freeza 4-Cyborgs 5-Perfect Cell 6-Darbura/Majin Boo 7-Majin Boo/Super Boo 8-Super Boo/Kid Boo Manufacturer's description: Action game that you can experience the fierce battle of numerous unfolds in the world of \"Dragon Ball Z\" appeared. Vs3 3 people up to realize \"3D multiplayer battle\" militant possible. Skill realistic explodes in full polygon amazing. Super battle he was finally realized. Regardless ground and formidable enemy to match the power and character of the fellow. Features: Third person perspective 2D graphics Cartoon graphics SCI-FI, Fantasy & Anime themes.", "platform": "Sony Playstation", "release_date": "May 31, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Bandai", "publishers": "Bandai", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.79", "wikipedia": "https://en.wikipedia.org/wiki/Dragon_Ball_Z:_Idainaru_Dragon_Ball_Densetsu", "video_link": "https://www.youtube.com/watch?v=1ITeQ1LW4OU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18593-dragon-ball-z-idainaru-dragon-ball-densetsu\n"}