{"altername_name": [], "name": "Eagle One: Harrier Attack", "overview": "The unthinkable has happened yet again: the Hawaiian Islands are under siege! A group of well-armed and fanatic terrorists are responsible, and the U.S.S. Armstrong has been dispatched to the region to neutralize the insurgents. As commander of Eagle One, you must lead the mission to reclaim the \"Jewels of the Pacific\" and annihilate the terrorist threat. Get ready to strap yourself into six of the world's most powerful and sophisticated attack aircraft, including the Harrier Jump Jet, F-15 Eagle, A-10 Warthog bomber and the elusive \"Raven\" stealth fighter (after you steal it from the bad guys). You will embark on 25 objective-based single-player missions (divided among five islands) utilizing a variety of weapons in air-to-air, air-to-ground and air-to-sea battles. The story is told through CNN-style full motion video (FMV) clips and is advanced with additional news footage that sets the stage for the missions that follow. Eagle One: Harrier Attack's features include both day and night-time combat, three levels of difficulty, bonus targets, rewards for taking risks, on the fly first- and third-person perspectives, player rankings, visual replay of missions as well as two modes of play: Arcade and a more detailed Flight mode (for you simulation fans). By completing your objectives in a timely and effective manner, you will be able to earn medals in honor of your performance. The game's single-player campaign is augmented by multi-player options, including a two-player head-to-head mode (engage in aerial dogfights) and a two-player cooperative mode (get together with a friend and go toe-to-toe with the terrorists as a team). The number of missions you can embark on are reduced in the multi-player mode, however. Although you'll spend an estimated 80% of the game in the Harrier, that shouldn't be a letdown: this baby can hover! You can switch between jet and hover modes at will, which adds a new element to combat missions and strategy. Now instead of flying straight across the landscape and then turning around again, you can immediately have the jet hover in mid-air to quickly target the enemy. Other challenges include carrier landings, refueling in the air and replenishing your ordinance by landing in designated areas.", "platform": "Sony Playstation", "release_date": "March 10, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Glass Ghost", "publishers": "Infogrames", "genres": "Flight Simulator", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Eagle_One:_Harrier_Attack", "video_link": "https://youtube.com/watch?v=F1GwHN_SQ0s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12494-eagle-one-harrier-attack\n"}