{"altername_name": [], "name": "East End x Yuri: Eexy Life", "overview": "East End X Yuri was a short lived collaboration between the Japanese hip hop group East End and the singer Yuri. East End members are Gaku the MC, ROCK-Tee a DJ and Yoggy, another DJ. Gaku and Yoggy were friends in high school, often entering rap contests when they could. Because they were interested in the same thing, they were acquainted with ROCK-Tee. Later, when entering college, Gaku ran into Rock-Tee. As a group, East End's first live performance was an event called \"Peace Ball\" (in 1990) many acts that are still famous in Japan today were in attendance, including DJ Honda, DJ Krush, Boy-Ken, DJ Yas, and others. East End continued to be strong as an independent act, but with little mainstream attention. Finally in 1994 the group broke strong into the mainstream with their pop-rap single da.yo.ne. (with guest artist YURI, thus \"x\" meaning \"with\" in the name East End x Yuri). Sales were slow at first, but in early 1995 East End x Yuri single broke the million sold record, the first in Japanese Hip Hop history. Essentially a mainstream one hit wonder the group continued to release singles trying to recapture the limelight, but were unable to do so. In 2003, after a short break, they released a full album with many \"fore fathers\" of Japanese hip hop and got some media attention, but failed to break into the mainstream once again. East End x Yuri / Eexy Life is a Playstation game based on the group that allows the player to listen to their songs, watch videos and live footage, and the game features also a digital interactive comic.", "platform": "Sony Playstation", "release_date": "October 25, 1996", "game_type": "Released", "esrb": "", "developers": "Sony Music Entertainment", "publishers": "Sony Music Entertainment", "genres": "Visual Novel", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108119-east-end-x-yuri-eexy-life\n"}