{"altername_name": [], "name": "Eberouge", "overview": "Eberouge is a Japanese dating sim which is similar to Konami's Tokimeki Memorial. In a world called Worland where magic exists, players will spend a total of 5 years (2 years of primary school and 3 years at high school) as students who entered a magical school. The core gameplay involves planning a weekly schedule, which includes school-related and free-time activities. Players have to arrange their daily classes and have a variety of things to study or practice including martial arts, science, literature, art, different kinds of magic, as well as go for extracurricular activities. All these classes influence the protagonist's statistics, making him attractive or vice versa to the various girls that he meets during his studies. The protagonist can also rest and travel to different places in the city. In addition to the daily courses that can be arranged, the players must also go on dates with the girls, solve daily problems and compete with their classmates while having to cope with their exams. After clearing primary school, the story branches out by letting players choose their future career. This choice will impact the amount of girls the protagonist meets and can go for in the next 3 years. The game ends with a graduation ceremony. A week before the graduation ceremony, a group of girls who have an affection for the player will want him to make up his mind about them. Once the player chooses his girl, the graduation ceremony will officially begin, and the ending and the protagonist's future will be determined by his chosen lover. The game has a lot of unexpected events, the story will change with the player's actions, resulting in a variety of different results.", "platform": "Sony Playstation", "release_date": "May 30, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Japan Media Programming", "publishers": "Takara", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "https://en.wikipedia.org/wiki/Eberouge", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108128-eberouge\n"}