{"altername_name": ["エアガイツ"], "name": "Ehrgeiz: God Bless the Ring", "overview": "An ancient weapon of unknown origin was found in a German castle some fifty years ago. Since it was obviously something of value, it was decided that it would be awarded to the best fighter in the world. After all, who would appreciate a weapon more than an experienced fighter? Eleven of the world's finest combatants (including Cloud Strife, Tifa Lockhart and Vincent Valentine) have set out to claim this prize. The mysterious artifact came to be known as Ehrgeiz, and the tournament that was built around it took on the very same name. Now rumors suggest that the door to a long-forgotten land can be unlocked with this weapon; a land that could reveal the secret of immortality. The tournament has taken on a whole new meaning! Ehrgeiz is a 3D fighting game that takes place within elevated environments. As in most fighting titles, players seek to wear down their opponent's life meter before time runs out, all while protecting their own character from harm. A series of ten fights comprise the tournament, with each fight requiring two victories in order to progress. Moves consist of high, mid and low attacks, guarding by standing in front of the opponent, special attacks in the form of projectiles, and interrupts, which counter incoming special attacks. Characters can also run, crouch, jump, roll on the ground, perform throws and evade attacks by spinning their bodies. Three modes of play include Arcade (fight all of the characters in succession until you defeat the final boss character), Versus (choose the stage, set the handicap and challenge a friend) and Practice (characters have unlimited time and health). Yet the game also includes several extras to separate it from other fighting titles. These include the following four mini-games: Infinity Battle, Battle Runner, Battle Beach and Battle Panel. Infinity Battle is similar to a survival mode in that you must defeat as many computer opponents as you can before your life meter runs out. Battle Runner is a racing game that has players running around trying to finish a course before their opponent. Of course, combat is encouraged and successful attacks will help characters run faster! Battle Beach consists of three events to test your button-tapping reflexes. All involve trying to cross the finish line before your opponent. Battle Panel is structured like the classic strategy game Othello: two teams try to occupy an 8 x 8 grid with as many panels of their respective colors as possible. Besides the mini games, Ehrgeiz also features a Quest mode entitled \"The Forsaken Dungeon.\" Choose from two archaeologists, Koji Masuda and Clair Andrews, as you attempt to find the spring of eternal life. The game offers role-playing elements such as using Materia (the magical stones found in Final Fantasy VII), collecting items and equipping various weapons and armor. While players must battle monsters in each room forming the dungeon, they have the opportunity to visit a village to replenish health or repair damaged equipment. Options include setting the skill level of computer opponents to one of five settings, choosing the number of matches comprising each fight (from one to four), selecting the length of time for each match (from twenty seconds to infinity), toggling boxes within arenas (which hold weapons or items) and adjusting the strength for each fighter. Ehrgeiz also supports both the memory card and Dual Shock Analog Controller. Manufacturer's description: BEYOND FIGHTING The world's most brutal tournament has its trophy the legendary weapon 'EHRGEIZ'. Now, fighters from around the world assemble to claim this prize and its mysterious power. 3 INTENSE PLAYING MODES: Arcade Fighting Action * Over ten playable characters, a cast of hidden characters, and favorites from Final Fantasy VII. * Complete 360 degree range of motion: battle hand-to-hand, with weapons, or with devastating combos and special moves. * Multiple-level, fully interactive arenas. Challenging Mini-Games * Compete in tests of speed, skill, and dexterity in any of four unique mini-games. Full-featured RPG Adventure * Descend into ever-changing random dungeon layouts in search of treasure, ever-stronger weapons, and answers. Features: Third person perspective. 3D graphics Cartoon graphics Fighting & Medieval Fantasy themes.", "platform": "Sony Playstation", "release_date": "January 5, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Dream Factory", "publishers": "Squaresoft", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.84", "wikipedia": "https://en.wikipedia.org/wiki/Ehrgeiz", "video_link": "https://www.youtube.com/watch?v=esDszRtUdTQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11013-ehrgeiz-god-bless-the-ring\n"}