{"altername_name": [], "name": "Eithea", "overview": "Eithéa describes the world to which a group of high school students and their teacher is whisked away. The player takes the role of Shou, age 17, and the lone male in this motley party. Among the various females who surround Shou every waking moment are close friend Yuka, quiet transfer student Hikaru, and English teacher Akiho. The story begins as the hero, Shou Nimi, and his friends say goodbye to a classmate who's about to change schools. Suddenly, the world turns upside down and five students and their teacher find that they're now stuck in another world, Eithéa. Supported by the power of its sacred trees, Eithéa's history is one of conflict, as the nature-loving Moonlight clan butts heads with the technologically gifted Fire Dragon clan. A third clan, the Night Dreamers, stays hidden in the deep forests. Soon after arriving in the strange world, they meet the huntress Ruu, and they immediately run about in search of a way home, all the while performing the obligatory mini-story arcs. With all of these female characters surrounding the male protagonist, Eithea makes the relationships built between Shou and his female companions an important factor in the game's battle system. Responding with the correct dialogue choices raises the character's Latent Ability Voltage (LAV), making her more capable in battle and contributing to the defense of the party. For those with little knowledge of Japanese, be prepared to save and reset often if you want to raise LAV as high as possible. The other pillar of the battle system is TIP. These strange silver or gold balls are dropped by enemies and are absolutely necessary for battle. Projectile weapons need them to operate, and as said before five out of seven playable characters shoot enemies from a distance. The game's magical artifacts, the Artia, require TIP in order to create usable magic spells.", "platform": "Sony Playstation", "release_date": "February 22, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "TamTam", "publishers": "Atlus", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.12", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108210-eithea\n"}