{"altername_name": [], "name": "Eliminator", "overview": "The Elimination event was the ultimate in televised arena combat. The participants were prisoners, of course, since no one sane enough would take up the gauntlet without some sort of incentive. Since those who survived the Elimination were granted reprieve and released back into society with both fame and wealth, the incentive was clear! All this came to an end during the Civil War. Instead of being televised, the Elimination served as a testing ground for weapons to be used in future battles. And the participants? They were prisoners of war, forced to compete solely for the amusement of the government. Now you happen to be next in line for the Elimination, and you're going to have to use all of your survival instincts to make it through alive. Eliminator lets you select one of four different crafts, each rated in shield power, weapons and top speed: the Redeemer, Freedom, Liberty and Survivor. The Elimination event is comprised of eight arenas filled with robotic creatures and futuristic defenses. You'll begin play in the Penitentiary, and then navigate through the Maze, Asylum, Cage, Chasm, Monastary, Tomb and Fortress. While the goal of surviving each arena may sound straightforward enough, there are a few things any budding pilot should be aware of before strapping in. First, your ship has a bomb attached to it! If you don't complete the arena within the time limit, the bomb will detonate. Another thing to worry about is the boss character after each level, so make sure you collect as many of the twelve assorted weapons as you can within the arenas. Progress will be saved after each level for those with a memory card, and two players can duke it out in three special duel zones: the Pit, the Dome and the Labyrinth. The object in the multi-player game is to simply destroy your opponent's base while protecting your own. Yet in order to destroy a base, you must first find the three Warp Bombs hidden somewhere within the arena!", "platform": "Sony Playstation", "release_date": "February 28, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Magenta Software", "publishers": "Psygnosis", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.64", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73326-eliminator\n"}