{"altername_name": [], "name": "Emit Value Pack", "overview": "Originally available for the Super Famicom along with an audio CD, EMIT is what's best described as an English tutorial software. Now before you start thinking boring and stop reading, remember that the Japanese education games are actually more interesting than the so called Multimedia education we have in the west. Emit is an adventure game that is the first entry of Shibusawa Kou's \"English Dream\" series -followed by the two-part entry, Dark Hunter. The purpose behind both projects is to teach Japanese people the English language with the help of a thrilling narrative. Each game has English consultants with a dual language and subtitle option for players. While the English Dream series has been largely forgotten, both titles appeared on Koei's 2003 Winter Thanks Rare Campaign with cheaper prices. This game was released as three separate parts. The first part is Lost Child of Time, the second is Life-Risking Journey, and the final is Farewell to Me. For consumers who wanted to hear the game's spoken dialogue in the SNES version, Koei developed a secondary hardware named Voicer-kun. Emit and Voicer-kun were released on the same day, and an option to buy both products as a companion pack was made available. Voicer-kun was likely planned to be applied for other products, but the only other title made compatible with it was Angelique Voice Fantasy. The scenario was composed by Jiro Akagawa and the character designs were made by Mutsumi Inomata. Koei also released a CD compilation of her original illustrations soon after Emit was released. Emit won the 1994 Yomiuri Shimbun Prize in the 1995 Japan Software Grand Prix. As a side note, the game's namesake is the backwards spelling of \"time\" and not the actual word \"emit\". CHARACTERS: - Yuri Tanaka: Voiced by: Megumi Hayashibara (Japanese), Danni Wheeler (English) The game's protagonist, Yuri is a mild-mannered and caring teenager who loves to read books. She lives at her home with her parents and her younger brother. Although she didn't want to believe her odd encounter, she is excited of her knowledge of a secret parallel world. However, her actual visit in the other world has her appreciate her home in spite of her early interest. She wants to restore everyone to their proper places and bring happiness to the other her. - Ken: Voiced by: Yoshito Yasuhara (Japanese; older and young adult), Takeyuki (Japanese; younger); James A Taylor (English; older and young adult), Robin Bufanda (English; younger) Unnamed in the first volume, Ken introduces himself by the second. Thankful to Yuri for helping him, Ken tries to support his friend in anyway he can. Yuri eventually thinks fondly of him and her ties to his mother, at one pointing calling him \"my boy\". - Yoko Ozawa: Voiced by: Etsuko Ishikawa (Japanese), Thyra Metz (English) One of Yuri's friends from school. She is a smart student and likes to chat with Yuri on the phone. Yoko thinks the other world is nonsensical but is fascinated by her friend's story of it. - Ichiro Ota: Voiced by: Sho Hayami (Japanese) Yuri's friend from junior high school. He is well aware of Yuri's personality and is surprised to see her act completely different from before. Clueless of the other Yuri's feelings for him, Ichiro helps his friend catch her. - Julia: Voiced by: Megumi Hayashibara (Japanese) In spite of her being a mirror image of Yuri, Julia is Ken's mother. She heard the wonders of the other world from her son and wanted to visit it personally. Falling instantly in love with Ichiro, she wants to replace Yuri with herself. Tired of being old in her own world, she likes Yuri's world more than her own. STORY: The game starts with a 17 years old girl (Yuri) that one day when she was going to high school she meets an old man who ask her about a watchmaker and what's today's date (the game begins in october 1994). During the game It turns out that this man gets younger instead of older and that he's from another world. GAMEPLAY: Emit is a fully voice and text driven digital novel with the added bonus of being fully bilingual. By this I mean you can choose from any combination of Japanese / English text and audio. You may have figured out already that Emit is in fact Time spelt backwards. The game is actually an interactive movie since the player can only watch how the story advances through the different game scenes. At the end of each scene the player can do different exercises or continue watching the story. The only gameplay is in the educational part of the software that is actually very good. You have exercises, English vocabulary tests and a Japanese to English dictionary. The game can also be used to teach English speakers Japanese. Of course you can't use most of the exercises but at least you can use the dictionary and play the game in English.", "platform": "Sony Playstation", "release_date": "September 29, 1995", "game_type": "Released", "esrb": "", "developers": "Koei", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135492-emit-value-pack\n"}