{"altername_name": [], "name": "Enigma", "overview": "There is also a new sense of adventure elements 3D fighting action hero of three people fight for the future of humanity over a mysterious secret stone. Will arrive at (Enigma) great mystery surrounding the holy mystery scattered all over the world while engaged in a thrilling battle monsters to choose from one of three \"Akira\" \"Catherine\" \"Thomas\", wandering. Enigma is an action adventure game in wich you have to choose between 3 different characters: Akira, Catherine & Thomas. The story will change depending of the character that the player choose. CHARACTERS: - Akira: A master of Ju Jitsu, his father teached him all his secrets to create his own fighting style, unfortunately he hasn't seen him for over eight years and now when he is 21 years old he has began his search. His investigations has lead him to a lost temple in a recondite part of China. As a martial arts master he usually fights with his own body. - Thomas: He is part of a rich family of United States. He starts his adventure in the pyramids of Egypt. Thomas begins his adventure with only a knife but later he will use a gun. - Catherine: She lives in Great Britain, and even when she looks like a delicate lady he loves dangerous situations. His adventures will leave her from her victorian mansion in Great Britain when she watch a murder to Greece and even to a hindu temple. Catherine in the game fights with a sword. To advance in the game the player will have to face different kind of enemies and solve different kind of puzzles. If you choose Catherine story the game starts at her father's mansion when he is killed she will have to starts her adventure. Akira's story begins when he returns home and prepare again for a new journey. Thomas' story begins when his boss in New York send him to an Egypt pyramid to explore it search for old artifacts.", "platform": "Sony Playstation", "release_date": "April 2, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Enigma_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97893-enigma\n"}