{"altername_name": [], "name": "Evergreen Avenue", "overview": "And there has been little magic and spirits, however, age is just another story about yet .... The spirit king that govern the spirit world is worried about renew their relations with the human world, that was broken since the diplomatic relations ceased. So he decided to conduct an inspection of the human world. He choose as the location to visit, Meruderubia Garden, that is a small town in the northern region of the continent. The spirits were send and they will receive the visit of the spirit king after six months, so the spirits are from two people who meet by chance and decided to learn the common sense of the human world. One, (Catan) a boy born with magical powers and his puppet work with humans. And the other (Ira) is a girl that has an indomitable fighting spirit. The player can choose at the beginning about which character he wants to play with. The game features japanese voice acting for most of the characters and the gameplay is the usual in most adventure games the player just have to choose an answer to advance in the game, and during the week he decides with which he wants to study and learn each day, he can also choose on sundays to walk around the town, etc. The game features also a character gallery. Manufacturer's description: \"joie de vivre\" theme, the development of simulation to connect the fairy-tale story with a human spirit. Select either the character of the hero Ira girl boy vowed to shed tears and tears Catan, you do not select characters who liven up the game I emerged as a rival. Features: First person perspective. 2D graphics Cartoon graphics Fantasy & Anime themes.", "platform": "Sony Playstation", "release_date": "September 13, 2001", "game_type": "Released", "esrb": "", "developers": "Vridge", "publishers": "Datam Polystar", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://psxdatacenter.com/games/J/E/SLPS-03278.html", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370526-evergreen-avenue\n"}