{"altername_name": ["Fuujin Ryouiki Eretzvaju", "封神領域エルツヴァーユ"], "name": "Evil Zone", "overview": "Even after the evil creature known as Ihadurca had been trapped and confined within the Evil Zone, the people of Kumi Island were in grave danger. Knowing all too well that the foul monster will escape in due time, the Kumi citizens organized a tournament to find out who the strongest warrior is. Because of the imminent escape of Ihadurca, the strongest must step forward to win the tournament and ultimately face the inter-dimensional demon. Only one will survive the tournament, but whether or not that fighter can survive the power of Ihadurca is up to you. Evil Zone is a 3D, arena-based fighting game featuring over ten Japanese Manga inspired characters. Each one has his or her own unique reason for entering the tournament as well as special moves and combo attacks. You have the ability to execute long range projectile attacks as well as close quarters throws, kicks and punches. Characters also earn crystals (via a secondary power meter) that can be used to pull off very damaging maneuvers. There are five different gameplay options including survival, training, versus and story. The story mode is different for every character and features story screens in between battles. Completing the different stories unlocks hidden things, such as art galleries and a musical jukebox in which you can sample the game's music. The training mode helps you get used to the fighting system and the versus feature lets you fight it out with a friend. Features: * Over ten Japanese Manga inspired characters. * Special moves and combo attacks * Execute long range projectile attacks as well as close quarters throws, kicks and punches. * Earn crystals that can be used to pull off very damaging maneuvers. * Five different gameplay options including survival, training, versus and story. * Unlocks hidden things, such as art galleries and a musical jukebox to sample music. Manufacturer's description: FIGHTING FOR A REASON! Thadurca needs to be destroyed. But first you must defeat the 8 other warriors and your own clone. Only then can you face Thadurca. Some are fighting for revenge, some for peace and others for power. But right now, let the battle begin. Features: Third person perspective. 3D graphics Cartoon graphics Anime, Fantasy & Fighting themes.", "platform": "Sony Playstation", "release_date": "January 18, 1999", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Yuke's Future Media Creations", "publishers": "Titus Software", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.70", "wikipedia": "https://en.wikipedia.org/wiki/Evil_Zone", "video_link": "https://www.youtube.com/watch?v=z2TrXOEUv7o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/501-evil-zone\n"}