{"altername_name": [], "name": "Fire Woman Matoigumi", "overview": "In Fire Woman Matoigumi the players starts the game as a transfer student who has just arrived at his new highschool, \"Shirosagi Gakuen\". The player can enter a name for his character, his birthday, and his blood type (it is a dating game after all) and he also get to choose which year of highschool he is in: 1st, 2nd, or 3rd year, which doesn't have a huge effect on the outcome of the game. Arriving at his new school, he very quickly runs into trouble with some ruffians. Outnumbered and outmatched by them, there seems little hope, when suddenly, three beautiful girls calling themselves the \"Matoigumi\" come to his rescue. They are: Sakai Ryouko (played by Hayashibara Megumi), a lone wolf \"tough girl\" who doesn't take any crap from any boy who can't defeat her in unarmed combat; Seta HIromi (played by Amano Yuri), a very sweet and charming, somewhat shy girl, but still not to be taken lightly; and Katsuragi Sayaka (played by Mitsuishi Kotono), who seems somewhat childish at times, but still studies hard for her exams. After the three girls defeat out of those nasty hooligans, they decide that he has potential and ask him to join the Matoigumi. It doesn't matter if he says no, they'll force him to join anyway. From then on it will be his job to take care of any sort of ruckus that may arise on the campus of Shirosagi Gakuen while still participating in after school clubs and finding romance with one or many of 11 possible girls there. The game begins each day after school. Everything that occurs in the game happens in the after school hours, none of the game actually takes place during school. The player moves his character about the school grounds and observe the many happenings around campus. As he begins the game you will meet many more characters, including a whole lot more girls whom he can potentially date, a few rival guys, and also the school principal and doctor. He will also meet Otaku Joe, who has all the stats on all the girls at the school and can tell you how much they currently like you as of the beginning of the current month. All of the major female characters can be located on the GPS (\"Gal Positioning System\"!), which will show you their locations on a map of the school. It will also show sweat pouring from their faces on the map if they are currently in trouble and need you to come to the rescue. In a basic day, he will check around the school to see if there are any new scenarios happening anywhere, and he will eventually ends the day by either participating in a club or asking a girl to walk home with you. (Occasionally the girls will ask you.) The dating part of the game is extremely simplistic and is very cut-and-dry. He has very few tools to make the girls like you. The main tool he has is asking them to walk home with him. His secondary tool is rescuing them when they're in trouble. Another tool is giving them presents on their birthdays, but this, of course, only happens once a year. There are other things that will help with certain girls, like participating in certain clubs (sometimes together with them), and other things like beating Ryouko in combat, for instance, will make her like you more. Basically, if he wants a girl, he just need to walk them home enough times. There are also dates, but they are just one picture of his character with the girl at a dating spot, and they are very infrequent. The girls will ask him on dates once in a blue moon when he walks them home. He cannot ask the girls on dates himself. He can have as many girlfriends as he wants in this game, they will not get jealous of each other. He will, however, face tradeoffs as he can't walk them all home in one day. At the end of the game he will have to choose one of the girls he has won, and he will see that character's FMV ending. He can save the game before he choose and load to see the endings of all the girls he has won. The player character begins the game with very low status attributes. He raises those attributes by participating in different clubs, like sports, martial arts, chemistry, and even arts and cooking. Various attributes will be raised depending on what club he participates in. The player will receive a rank for every club he participate in. The more he participates in a club, the higher his rank will be. Be careful though, sometimes participating in a club will lower his rank in another club. Also, in most clubs, every time you participate, your HP will go down due to physical and mental strains of participating. Don't overdue it, you need that HP for fights! And if your HP gets too low, you will become sick and need to spend a day resting at home. At the beginning of each month, all the members of Matoigumi will gather and have a showdown to see who's the strongest. Defeat another Matoigumi member and they will teach you how to do their special move, so you will want to do well in this competition. And as I said before, most of the problems that arise in this game are solved by fighting, so it's very beneficial to have a strong character. There are, of course, many other smaller events that happen every week at Shirosagi Gakuen. To see them, you will need to go to the right place on the right day. Many of the occurrences of the events can be found just by looking at the Gal Positioning System and seeing who's in trouble and observing characters who are absent from their usual locations. Basically, the entire game takes place within a relatively small area. There are no scenes outside of the school grounds.", "platform": "Sony Playstation", "release_date": "March 26, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "HuneX", "publishers": "Tokuma Shoten", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110375-fire-woman-matoigumi\n"}