{"altername_name": ["Fishing Freaks: Bass Rise Plus", "BassRise Plus"], "name": "Fishing Freaks: BassRise Plus", "overview": "In Bass Rise you can catch three kinds of fish: largemouth bass, smallmouth bass, and bluegill. Aside from catching fish, the motivation to continue playing comes from collecting more lures (hundreds in all) and finding new fishing locations: lakes, canals, docksides, etc. Tying the game together are story sequences featuring other anglers who offer advice and challenges, such as catching a set number of fish in five casts. In addition, the game sports a multiplayer contest mode that supports up to four players - but they don't compete at the same time, which deadens the appeal a bit. Instead, each player gets a fixed number of chances to cast and haul in a fish - and the largest catch wins. A fishing game with both a single and multiplayer VS. mode. In the single player game, players choose to play as either a man or a woman, choose the color of their clothes, and then choose an area they want to fish in. There are two lakes to choose from at the start of the game, but more can be unlocked by completing challenges. An example of a challenge would be trying to catch a set number of fish in five casts. These challenges are given to the player by fellow anglers, who also offer advice and tips to the player. Also, completing challenges may also earn the player new lures to use. The VS. mode lets from 2 to 4 players take turns fishing against each other. Players can choose how many casts are allowed (from 1 to 5 casts), how many games the competition will last (from 1 to 5 rounds), and what event to compete in (length, most weight, or number of fish caught). After choosing a lake, you rotate around a fixed position to find different areas to cast. After making the cast, the camera switches underwater to the bait's point of view. Using bait twitches and reel speeds to attract fish, your fisherman uses the rod to hook a fish when it bites. This triggers the \"battle\" process, in which you attempt to reel the fish in without snapping the line. In a few cases, the computer will instruct you to move the rod in a certain direction. Depending on the size of the fish, such battles can last between one and five minutes; novices should be able to catch their first fish within ten minutes of play, and the lakes are well stocked in places, so there's no problem with waiting for fish to show up.", "platform": "Sony Playstation", "release_date": "March 25, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135592-fishing-freaks-bassrise-plus\n"}