{"altername_name": [], "name": "Forget Me Not: Pallete", "overview": "Palette is a Japanese language freeware adventure game that was made with RPG Tsukuru 95 by Nishida Yoshitaka. The game was highly acclaimed in the Fourth ASCII Entertainment Software Contest, awarded a Grand Prix of 10,000,000 yen, which resulted in remaking the game for PlayStation by Enterbrain. That version, entitled Forget me not -Palette-, saw the release on April 26, 2001 exclusively in Japan. In Palette, players would help a girl, referred to as B.D., whom apparently turned amnesiac by an accident, restore her memory as a well-known psychiatrist, Dr. Shian. Players essentially control B.D. in the scenery of her memory, which constitutes a maze with rooms and passages. When B.D. examines a specific object in the said mode, the game switches to the other mode. In that mode, in which maps are tinted with sepia-toned colors, while not allowed to change scenes, players can restore B.D.'s \"missing\" memories by examining objects framed in a white line. When a specific thing is checked, a range of exploration would be expanded with a new passage lifted. If players check on the object that switched the gameplay mode once again, the gameplay mode would be changed back to the one mentioned before. Continuing the game, players would discover a \"piece of memory\", which not only would increase scales of the said gauge by one, but also might be a clue to find her further memory. When all of B.D. memory is restored the gauge valo is equal to twenty. The story begins when Shianosu B. Shian writes about memory for the Central News newspaper in his office. At midnight, when he decides to leave his office, he is visited by a woman. He first declines her, yet when he is threatened with a gun, he reluctantly agrees and answers a phone call from the amnesiac girl, B.D. After that everytime that he use the phone he switches to the other world and there he will have to investigate murderers using the body of a girl. Forget Me Not plays similarly to an adventure game with the emphasis on cognitive detective work and suspense. The view of the game pans on the action from an overhead perspective and illustrative flick screens narrate the tale during key moments. When you progress to a milestone in the girl's re-development, you'll witness the change in her attitude as well as her ability to communicate better. In the beginning of your association, she calls you, the psychiatrist, and emotes insecurity and confusion but her condition improves as you help her recover from trauma.", "platform": "Sony Playstation", "release_date": "April 26, 2001", "game_type": "Released", "esrb": "", "developers": "Enterbrain", "publishers": "Enterbrain", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93827-forget-me-not-pallete\n"}