{"altername_name": ["Furontomisshon Sekando", "フロントミッション セカンド"], "name": "Front Mission 2", "overview": "Front Mission 2 is a tactical role-playing game for the Sony PlayStation developed and published by Square and released in Japan. It is the second game in the main Front Mission storyline. According to the series' public relations manager Koichiro Sakamoto, the game was never released outside of Japan due to the presence of situations and vocabulary which would be considered faux pas in North America. Front Mission 2's gameplay has many similarities with Front Mission. This is likely because the game retains the core foundation seen in Front Mission. This does not mean the game is an exact copy of Front Mission. Numerous changes are noticeable in Front Mission 2. First, more weapons now have range as opposed to being limited to merely missile and grenade launchers. Second, terrain (known as Geo) affects conditions such as Accuracy and the ability to successfully counterattack. Another noticeable change is how all weapons now have ammunition, with the exception being Fight-class weapons. The most noticeable changes are the Action Point(AP) and Honor system. Set in O.C.U. Alordesh (modern-day Bangladesh) during June 2102, Front Mission 2 is the story of Oceania Cooperative Union (O.C.U.) soldier Ash Faruk and officer Lisa Stanley. During one night, Ash and his outfit, the Muddy Otters, are caught off-guard when the Alordesh Army revolts against the O.C.U. Barely escaping the assault at the Rimian Naval Base, the Muddy Otters are forced to escape from the coup d'etat forces. As the Muddy Otters link up with surviving O.C.U. outfits, the O.C.U. sends in an expeditionary force to help reclaim control of the nation. Around this time, the O.C.U. Intelligence Agency sends in Lisa Stanley and her unit to analyze the Alordesh Army's movements to help the regular army in their efforts.", "platform": "Sony Playstation", "release_date": "September 25, 1997", "game_type": "Released", "esrb": "", "developers": "Squaresoft", "publishers": "Squaresoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.9", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32247-front-mission-2\n"}