{"altername_name": [], "name": "Front Mission 1st", "overview": "Originally released in 1995 on the Super Famicom, Square revisits their 16-bit heyday and updates Front Mission for a new legion of fans. Played on isometric grids, various mecha from your Canyon Crow attack squad are arrayed against opposing armies. Move, encounter and fight are the generics of the game but weapon and armor upgrades also factor in the game where your crew gets upgraded to higher levels of performance. The menus, stats, and weapon upgrades in the game are entirely in English which makes Front Mission very easy to get into for importers. The storyline and conversations are in Japanese but the scrolling account after the first battle tells of the new conflict between the OCU (Southern Asia Oceana Community Union) and the USN (United States of New Continent). STORY: Set in 2090, the story of Front Mission takes place on Huffman Island, a fictional Pacific Ocean island roughly the size of Oahu, created by volcanic activity south of Mexico's west coast in 1995. In 2002, the land mass was classified as an island, and was ceded to United Nations control. However, in 2020, the United States of the New Continent (USN), a unification of North American and South American countries, made a bid for control of the island after withdrawing from the United Nations. The Oceania Cooperative Union (OCU), an alliance of Oriental Asian nations and Australia that was created in 2025, dispute this claim when the two superpowers colonized the island in 2065. The tensions heat up and eventually lead to the 1st Huffman Conflict in 2070, with Huffman Island being divided into two halves at the end of the war. An uneasy peace is maintained until the Huffman Crisis in 2086, when a series of skirmishes across the island causes chaos. Tensions flare up and end in war when the OCU is blamed for inciting the Larcus Incident on June 3, 2090. The plot of Front Mission revolves around OCU captain Royd Clive. An OCU reconnaissance platoon led by Royd is assigned to investigate a USN munitions plant in the Larcus District, located on eastern Huffman Island. Upon reaching the premises, the platoon is ambushed by USN wanzers led by an officer named Driscoll.", "platform": "Sony Playstation", "release_date": "October 23, 2003", "game_type": "Released", "esrb": "Not Rated", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32245-front-mission-1st\n"}