{"altername_name": ["GateKeepers"], "name": "Gate Keepers", "overview": "Unlike many anime and manga-based games, Gate Keepers is a turn-based strategy role-playing game which spanned manga and anime TV series not long after its release. The game uses visual novel elements with static background and 2D anime-style characters during dialogues and switches to isometric bird's eye perspective during turn-based combat. The battlefield camera can be rotated by 90 degrees full circle, and while action camera occasionally kicks in there is no ability to zoom in/out of adjust camera angle which can result in some units being more difficult to see in urban warfare with tall buildings. The player characters can attack using their weapons or tap into powerful energy locked in dimensional gates to use special attacks. The story takes place on Earth, a couple of decades after the end of World War II. Aliens are sending their agents to wreak havoc and turn people into soulless robotic creatures. In order to fight the alien menace that human population is oblivious to, and prevent the world from being taken over by the aliens who are commonly referred to as Invaders, the government set up and funded secret military organization designated A.E.G.I.S (Alien Extermination Global Intercept System). While the organizations spans across the globe, the game focuses on far east branch of the organization which is located beneath Tategami High School in Japan, which is where Shun, the protagonist, and others in his team were recruited from. Shun is one of a few who has the ability to tap onto energy from dimensional gates, the ability he inherited from his father.", "platform": "Sony Playstation", "release_date": "December 16, 1999", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Kadokawa Shoten", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128973-gate-keepers\n"}