{"altername_name": ["GeGeGe no Kitarou: Gyakushuu! Youma Daikessen"], "name": "Gegege no Kitarou: Gyakushuu! Youkai Daikessen", "overview": "Gegege no Kitaro is a comedy horror manga by Shigeru Mizuki, which was subsequently adapted into an eponymous anime series. CHARACTERS: - Kitaro: Born in a cemetery, Kitaro is dedicated to helping people, and trying to make humans and goblins live together in peace. Mostly his actions involve rescuing folk from goblins and demons. Kitaro has many incredible powers, and a magic sweater that he can control with his mind. - Daddy Eyeball: Kitaro's father died before Kitaro was born. Determined to look after his child, his eyeball took on a life of its own and left the corpse. Daddy Eyeball lives in Kitaro's empty left eye socket, which is covered up by his hair. - Ratman: Kitaro's friend. Part demon and part human, Ratman is not averse to betraying his friend and doing bad things if there's money involved. Kitaro always foils his plans, however. - Catchick: Kitaro's girlfriend. She becomes cat-like when angry. Kitaro is a yokai boy born in a cemetery, and aside from his mostly-decayed father, the last living member of the Ghost Tribe . He is missing his left eye, but his hair usually covers the empty socket. He fights for peace between humans and yokai, which generally involves protecting the former from the wiles of the latter. When questioned in the 2007 movie, Kitaro responds that he is three hundred and fifty years old. Kitaro has an assortment of strange weapons at his disposal, including: * remote-controlled geta sandals * a detachable hand, also remote-controlled * a magic chanchanko vest which can protect its wearer from danger; it occasionally seems to act of its own accord, wrapping around enemies or aiding friends, even when Kitaro is not available to command it * spiny hairs which can be shot like arrows * another hair which can serve as an antenna for detecting spirit activity * a magical ocarina (usually used for calling Ittan Momen), which contains a baton, a whip and occasionally music which has the power to damage certain ghosts. * the power of electrocution, usually employed when an enemy has pinned or restrained him and he can no longer kick or use other weapons The PSX game is based on the anime and is a 2D Platform game. The story is that Kitaro receives different missions to destroy some spirits that are disturbing different places and he got to defeat them.", "platform": "Sony Playstation", "release_date": "December 11, 2003", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.08", "wikipedia": "https://en.wikipedia.org/wiki/GeGeGe_no_Kitar%C5%8D#Video_games", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23611-gegege-no-kitarou-gyakushuu-youkai-daikessen\n"}