{"altername_name": [], "name": "Gekitotsu Toma L'Arc: Tomarunner Vs L'Arc En Ciel", "overview": "Tomarunner is a foot-racing game where your opponents include a robot, a kappa, an angel, a masked roller-skater, and a boy with Big Boy hair. You run around a variety of tracks including mines, buddhist temples, busy streets, hotels, beaches, and castles, busily shoving your enemies out of the way while bouncing off the walls and flinging yourself around with vertical and horizontal bars and flying through people's living rooms all in the name of finding a shortcut. Weapons include heat seaking missiles, mines, and super-bouncy balls. Various items on the track include speed boosts, lightning (to smite thine enemy), bombs, and protective baby chicks. It's really fast, it's really fun, and it will deeply disturb your friends. This game is a fun and humorous character racing game which involves the original cast of TomaRunner and all four members of the band, L'Arc~en~Ciel (Hyde-vocals, Tetsu-bass, Ken-guitar, and Yukihiro-drums). Tomal'Arc falls into the racing category, but like its predecessor, it is not the standard car-racing kind. Instead, the racers run about the track on foot (and sometimes on face), avoiding obstacles, swinging on poles, bouncing off walls, and flinging fruit! * Sounds fun already, doesn't it? The gameplay has a bit of a learning curve, especially for impulsive types who don't bother to read the manual beforehand, but after a little practice, it's quite easy to play. Instead of just steering and accelarating, characters will run automatically while the player in charge controls weapons, dashing, and the all-important hands. It's pretty different from any other racing game I've played. There are various items to pick up, so it's not simply about seeing who makes it to the finish line first. Game modes: - The normal match involves picking up crystals which determine how many people will attend the concert at the end of the game. - A more challenging version removes the crystals and also limits the number of stat-boosting items available, so the racers must compete on pure ability. - A third mode involves simply cheering on the band member of your choice as he races alone. Each member lent his own voice to his character, so we fans have the pleasure of hearing them speak as we play!", "platform": "Sony Playstation", "release_date": "July 19, 2000", "game_type": "Released", "esrb": "", "developers": "Sony Computer Entertainment", "publishers": "Sony Computer Entertainment", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "2.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28510-gekitotsu-toma-larc-tomarunner-vs-larc-en-ciel\n"}