{"altername_name": [], "name": "Genghis Khan: Aoki Ookami to Shiroki Mejika IV", "overview": "Genghis Khan: Aoki Ookami to Shiroki Mejika IV (チンギスハーン・蒼き狼と白き牝鹿IV) is a 1998 video game developed by Koei. It is part of Koei's Historical Simulation Series of games, and is the sequel to Genghis Khan II: Clan of the Gray Wolf (which is actually the third game in the series). Unlike the previous games, IV was developed for very few platforms: Microsoft Windows and PlayStation. Gameplay: The player is given the option to conquer either the country of Mongolia as Genghis Khan himself, or to play as a world leader and take over the known world of the time. The game is turn-based, and very similar to the Romance of the Three Kingdoms series in that everything is done with generals, and managing them is an important part of the game. Unlike Genghis Khan II, in this game the player has absolute control over everything; for example, previously, unless the king was in a given territory, he could not directly control it. The game also includes a turn-based battle sequence, allowing specific control to the player or delegated to a general. Unlike the previous Series, players can use any countries. Scenario: Scenario 1 AD1189 \"The Gray Wolf Riding in Prairie.\" Main Characters(Which countries controlled by player have default plots at the game start) - Objective Mongol with Genghis Khan - Defeat Jadaran and Keraites France with Philip II - Defeat England Kamakura Regime (will change to Kamakura Shogunate after conquest Hiraizumi Regime) with Minamoto no Yoritomo - Defeat Hiraizumi Regime Byzantine Empire with Isaac II - Defeat Republic of Venice Scenario 2 AD1271 \"The Descendants of Gray Wolf.\" Main Characters Yuan dynasty with Kublai Khan - Defeat Southern Song dynasty Southern Song dynasty with Duzong - Defeat Yuan dynasty Kamakura Shogunate with Hōjō Tokimune - Capture 1 of any Eurasia cities England with Henry III - Defeat France Scenario 3 AD1229 \"The Roaring of the Wolves\" (Added in PUK Version) Main Characters Mongol Empire with Ögedei Khan - Defeat Jin dynasty Jin dynasty with Aizong - Defeat Mongol Empire France with Louis IX - Capture any cities Holy Roman Empire with Frederick II - Capture any Islamic cities ***Any Countries which near and bad relationship with Mongol Empire will have a Plot that Mingburnu want to join you to revenge the Mongols. Scenario 4 AD1370 \"The Wolf Appear in Western Regions\" (Added in PUK Version) Main Characters Timurid Empire with Timur - Defeat Kipchak Khanate Ming dynasty with Zhu Yuanzhang - Defeat Yuan dynasty Byzantine Empire with John V - Defeat Ottoman Turks France with Charles V - Defeat England ***England will have a plot and get Garter Knights (Unique units which Stronger than Knight) after the few turns. (Even controlled by Player or Computer)", "platform": "Sony Playstation", "release_date": "1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Strategy", "max_players": "8", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Genghis_Khan:_Aoki_Ookami_to_Shiroki_Mejika_IV", "video_link": "https://www.youtube.com/watch?v=BExrzewrJME", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124465-genghis-khan-aoki-ookami-to-shiroki-mejika-iv\n"}