{"altername_name": ["Gensou Maden Saiyuuki - Haruka naru Nishi e"], "name": "Gensomaden Saiyuki: Harukanaru Nishi He", "overview": "Gensomaden Saiyuki, commonly known as Saiyuki, is a popular manga series created by Kazuya Minekura. The story is loosely based on the famous Chinese novel Journey to the West (Xi-yóu Jì). In 1999 the Saiyuki OVA by Tokyo Kids was released. A year later it was adapted into an anime series by Studio Pierrot, which won the Animage Anime Grand Prix prize in 2000. Saiyuki is the story of four reluctant - and irreverent - anti-heroes: the monk Genjyo Sanzo (or \"Genjyo\"), the monkey-youkai Son Goku, the half-youkai Sha Gojyo, and the man turned youkai Cho Hakkai, dispatched by the Sanbutsushin (the Three Aspects of Buddha, who relay the orders of heaven) to India to stop the possible resurrection of the Bull-Demon-King, Gyumaoh. Along the way they are beset by (inept) assassins, bad weather, and their tragic personal pasts. Meanwhile, the villains, two unlikely confidants, Gyokumen Koushou (Gyumaoh's concubine, a youkai) and a mad scientist, Dr. Ni Jenyi (a human), continue their attempts to restore the long-dead king. These experiements, a forbidden mixture of science and magic, spawn the \"Minus Wave\", infecting all youkai in Shangri-La with madness, shattering the fragile peace that once existed between human and youkai. The Playstation game is an adventure game based on six stories from the first half of the anime series, and also includes an original mini-drama. In some levels the player has to solve puzzles to advance in the game and in others he will control the character and has to defeat an opponent.", "platform": "Sony Playstation", "release_date": "December 26, 2002", "game_type": "Released", "esrb": "", "developers": "J-Wing", "publishers": "J-Wing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108254-gensomaden-saiyuki-harukanaru-nishi-he\n"}