{"altername_name": [], "name": "Gokuu Densetsu: Magic Beast Warriors", "overview": "A rare find but an absolute treat for the 2D fight fan: manna from heaven for the Monkey fight fan. Featuring some excellent, cheesey FMV complete with suspicious special effects and costumes introducing the nine characters and also awarded for victory in the versus mode. In story mode you start off playing as Son Goku (Monkey) with additional defeated characters available for selection on your quest to rescue the priestess and prod around the evil multi limbed demon kidnapper. Gameplay is made more enjoyable down to the simple specials which are more suited to the Playstation controller. And aurally its very enjoyable with some appropriate rock riffs and over the top special effects. Japanese title: ‘Goku Densetsu.' The game start with a full motion video of each of the 9 characters, all ranging from personalities from Asian mythology to a 6 armed, mechanized, she-devil of a boss nasty. Game modes: There are 2 modes: Story and Versus. You get 99 seconds per round, only 3 round matches and no handicaps. This is the fighting game children of Pong can relate to, yet may not hold the attention of the next generation. Versus: Intense, white knuckle combat. The survivor is awarded a short FMV of their character. Nuff said. Story: You are the mystical monkey hero Songoku, on a quest to save Princess Rice Cake from the evil clutches of Natataishi, the 6 armed she devil(who is playable in versus). Along the way, challengers who fall to you in battle join your crusade and become selectable in the case you grow tired of just using Songoku. (Heaven forbid!)", "platform": "Sony Playstation", "release_date": "May 26, 1996", "game_type": "Released", "esrb": "", "developers": "Alyume System", "publishers": "Alyume System", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96537-gokuu-densetsu-magic-beast-warriors\n"}