{"altername_name": ["Golgo 13: 2: Mienai Guntai"], "name": "Golgo 13 Vol2: Mienai Guntai", "overview": "Golgo 13 - Mienai Guntai (Also known as Golgo 13 Kenenai Guntai) is the second Playstation one game based on the manga series written and illustrated by Takao Saito, published in Shogakukan's Big Comic magazine since 1969. In 1976, the manga won the 21st Shogakukan Manga Award for general manga. The series follows the titular character, a professional assassin for hire. The manga is one of the longest running adult manga in Japan and has sold over 200 million copies in various formats, including compilation books. It has been adapted into two live-action feature films, two animated films, a television series and seven video games. Golgo 13, also known by the pseudonym Duke Togo, is a professional assassin. His age and birthplace are unknown and there is no consensus in the worldwide intelligence community as to his true identity. Most of his jobs are completed through the use of a customized, scoped M16 rifle. The origin of Golgo 13 is left in complete mystery, his age and birthplace both completely unknown. Japanese, Japanese-American, Japanese-British, a man who has origin around Lake Baikal, mixed Japanese and Russian, mixed Japanese and German, mixed Japanese and Jewish, or of other mixed Asian. Various episodes throughout the Golgo 13 series have tried answering this mystery, but all of the origin episodes end with a note of uncertainty that never make sense if the story's theory was definitely true. The Playstation game is an interactive movie in which the player can choose between english or japanese voices & texts and to do that he have to go to the bottom option in the options menu. The game is divided in 12 chapters that can be played in any order. This second game starts in the Sequoia National Park (California) when after a Stealth fighter crashed there, a group of mercenaries is killed by others to recover a piece of the plane. Then the game goes to Los Angeles when Joe Montana hired Duke's to use his sniper abilities to kill whoever is after the Stealth fragment.", "platform": "Sony Playstation", "release_date": "November 26, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Daiki", "publishers": "Daiki", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128974-golgo-13-vol2-mienai-guntai\n"}