{"altername_name": [], "name": "Gourmet Action Game: Manpuku!! Nabe Kazoku", "overview": "Gourmet Action Game - Manpuku!! Nabe Kazoku is another cooking game from Media Entertainment, like Yakiniku Bugyou. This one's a good deal simpler than even that simple game, as you don't have to worry yourself over placing the food, flipping it halfway, or judging when it's done: you just wait for the food to drop into the broiling bowl, then wait for \"OK\" to appear over it, then you click on it to dish it into your character's mouth. Munch! So where's the game, you ask? Well it's really a quick reaction game now, without a whole ton of strategy. To be sure, certain items are worth more points in certain stages, and sometimes you can grab a \"flash fry\" (my phrase) icon that instantly cooks everything to perfection, then go on a serving spree, and I suppose if you were really good you could time bumping your opponent's (or the CPU's) chopsticks so that they accidentally serve up a half-cooked morsel to their character, but by and large it's about being the first one to the \"OK\" food. So, it doesn't quite have the depth of Bugyou (which is saying a lot). Still as a quick action game, particularly two-player, it's a good deal of goofy fun, and if you really get obsessed you can play through all the single-player stages in which a family goes through various cook-offs as they struggle to give oral pleasure to themselves and their oddball neighbors. The back of the case claims to support a save game but I have yet to find such a thing, and single-player looks to be entirely linear, unlike Bugyou where you can at least pick from a handful of stages. Now, come to think of it, when you get really down and competitive, you're going to be risking it and going for food that may not be \"OK,\" because the OK indicator doesn't *always* appear immediately over well-cooked food. So that's a bit of depth. There's another facet as well, but an annoying one: if you serve undercooked food your chopsticks freeze up until you've banged on the X button enough times. Not only that, but sometimes serving up food reveals a power icon which, once grabbed, freezes your opponent's sticks in similar fashion, and the CPU doesn't hesitate to use this on you. Very irritating to get stuck banging on the button for seconds on end while your opponent is briskly clearing away all the tasty food.", "platform": "Sony Playstation", "release_date": "January 31, 2002", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135307-gourmet-action-game-manpuku-nabe-kazoku\n"}