{"altername_name": [], "name": "Grande Fratello: Il Gioco", "overview": "Big Brother is a reality game show franchise created by John de Mol. The premise of the show is that there is a group of people that are housemates or houseguests living together in a large, usually specially constructed house. During their time in the house they are isolated from the outside world and are not commonly aware of outside events. Contestants are continuously monitored by in-house television cameras as well as personal audio microphones during their stay. Each series lasts for about three months, with 10-20 contestants entering the house. To win the final cash prize, a contestant must survive periodic (usually weekly) evictions and be the last housemate or houseguest remaining in the compound by the series' conclusion. Grande Fratello, the Italian version of reality television franchise Big Brother, began in September 2000, and has gone on to become a cultural phenomenon in Italy. There have been twelve completed seasons as of 2013. Based on the Original Dutch Version created by Endemol, the show sees a number of different Housemates, divided by gender, social backgrounds and geographical locations locked up together in a House, where the viewing Public can watch them twenty-four hours a day, and vote them out of the House as they choose to. The Housemates can visit the \"Confessional\" at any time during the day, either to talk to psychologists if they need to, talk to Big Brother, or to Nominate. Grande Fratello - Il Gioco is the Playstation version of the TV Show released only in Italy and is a simulation game. The official video game of Big Brother Trecision, the leading Italian videogames development, has created the first interactive simulation of Big Brother, licensed by Endemol Italy SpA, for PC and Sony PlayStation . The PC version of the game is distributed by March 21, 2003 by Cidiverte and Deadis in all stores, newsstands and shopping centers, while the PlayStation version will be published by Sony Computer Entertainment Europe in April. Just like in the popular TV show, the aim of the game is to leave the last of the famous \"home\" after 100 days of stay. To do that you need to better manage their relationships with the other contestants and be acceptable to the public. Strategies able to do so may be different and it will be just the player to decide what works best for him. Be friends with everyone or public danger number one? Appoint Phaedrus, flirting with Tati or speak ill of Taricone? You can set your tactics thanks to more than 50 different actions : You can eat, wash, sleep, dive into the pool but also make jokes, stealing, telling secrets, kiss, love relationships or take ... a nice two of spades colossal. Nothing is missing: the weekly rehearsals , the confessional , the nomination , the unexpected. So this is a social game where loves, jealousies, resentments and betrayals are on the agenda. In the game, in addition to the characters of the third edition, there are also those of the other two, all made with a colorful cartoon style. See then under the same roof Taricone , Mascia and Pasquale is now no longer just a dream or a nightmare for some but for others grim reality. Playing Big Brother also supports multiplayer : Up ten players can play simultaneously.", "platform": "Sony Playstation", "release_date": "September 10, 2010", "game_type": "Released", "esrb": "", "developers": "Trecsision", "publishers": "Sony", "genres": "Life Simulation", "max_players": "", "cooperative": "No", "rating": "3.67", "wikipedia": "https://psxdatacenter.com/games/P/G/SCES-04090.html", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127143-grande-fratello-il-gioco\n"}