{"altername_name": [], "name": "Groove Adventure Rave: Yuukyuu no Kizuna", "overview": "Rave Master (known as Groove Adventure RAVE in Japan), is a manga series written and illustrated by Hiro Mashima. The manga was serialized in Shonen Magazine from July 1999 through July 2005, and published in thirty-five tankobon by Kodansha. The manga series was licensed for an English release in North America by Tokyopop until Kodansha allowed their contract to expire. Del Rey Manga announced on September 26, 2009, at their New York Anime Festival panel, that it had acquired the rights to Rave Master with a release date in September 2010. In 0015, fifty years before the story's start, the world was being corrupted by Dark Bring, evil stones that bestowed incredible powers to their owners. The Dark Bring were used by the Raregroove Kingdom, and the Symphonia Kingdom fought against them with their Holy Bring. Shiba, the first RAVE Master, attempted to destroy Sinclaire, the \"mother\" of the Dark Bring, with his Decaforce Sword. The aftermath caused the massive explosion known as \"Overdrive\" that destroyed one-tenth of the known world. Shiba, protected from the disaster by Plue, a special guardian \"dog\" who shielded him from the blast, held onto the RAVE required to power his sword. Plue and the remaining pieces of RAVE, however, scattered around the world. Fifty years later Haru Glory, a teenager living on the peaceful Garage Island, fishes Plue up by accident. Several events soon follow, including Shiba's arrival and his desire to reclaim Plue, as well as the appearance of a mysterious organization known as Demon Card, whose members possess Dark Bring and aim to rule the world. After Haru battles one of its members, Shiba discovers he is the second RAVE Master, and entrusts his RAVE, Plue, and the Decaforce Sword to Haru. Haru embarks upon an adventure to find the other pieces of Rave and to save the world. An action RPG based on the television anime from the most popular manga Weekly Shonen Magazine. An original story with a new character created by the original author Mashima-sensei. Featuring RPD system. Your companions trust changes based on the aciton you make. Everyone must cooperate to finish the game. This action rpg places the Rave crew on a tropical island. Roaming and battles take place in realtime as the Rave party explore and interact with characters in the game.", "platform": "Sony Playstation", "release_date": "January 31, 2002", "game_type": "Released", "esrb": "", "developers": "Konami", "publishers": "Konami", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97587-groove-adventure-rave-yuukyuu-no-kizuna\n"}