{"altername_name": ["Gunnm: Martian Memory", "銃夢 火星の記憶"], "name": "Gunnm: Kasei no Kioku", "overview": "Gunnm Kasei no Kioku (Martian Memory) is the complete version of the story containing additional materials not found in the manga. The player assumes the role of Gally and begins a journey that takes her from the streets of Scrap Iron Town and the desert outlands, to the city of Jeru and her birthplace on the planet Mars. The game is set in 3D with the camera at ¾ perspective above and behind Gally, though at times the camera is a little too distant from her. This lets you take in a lot of the scenery but makes Gally look like a blue speck with legs. In each level there are story and boss rounds that have to be played to advance the game. At anytime however, Gally can leave the story via the world map and enter areas where she can fight opponents, for which she earns bounty chips to purchase weapons and items. Stay on a level for 40 minutes or 4 hours, the choice is yours to decide how fast you want to play through it, and how you would like to equip Gally. Combat in minor confrontations is initiated by pressing the \"Select\" button to switch into battle mode. This gives the option of avoiding opponents by running past them, or breaking off from a fight with no penalty if Gally is low on health. Bad camera angles, which are common in many games, rarely occur here. Gally is always at screen center and by default targets the opponent closest to her. Combat controls are intuitive and easy to master. Pressing a single button multiple times yields a combo; holding R1 adds momentum and changes the attack. Gunnm Kasei no Kioku also packs a variety of options for you to decide how Gally will fight: barehanded, bladed weapons, missiles, bombs, TUNED Gun and plasma attacks (if her body is capable). If this sounds a little like overkill, well, it will all come into play. Battles of 2-5 opponents are common and Gally will face a wide assortment of tough guys, each with a particular strength and requiring a different strategy to beat. Some will throw knives or lace her with plasma, while others are tough as nails fighters that will surround Gally and pummel her if you are not careful. In addition, one level involves Motorball and requires a different set of skills to defeat opponents while racing at speeds of 300 km/h. If that is not enough, the boss rounds can be endurance slugfests, such as against Jashugan; or a shooter with Gally firing a gun loaded with collapser bullets into her nemesis Zapan. There is never a lack of things to do and the fighting never seems gratuitous or repetitive, but are integrated into the story and fitting for what Gally does best. The presentation is so unique it seems it was made to complete the story Kishiro never had the chance to tell in his manga, due to an untimely illness.", "platform": "Sony Playstation", "release_date": "August 27, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Ea Inc.", "publishers": "Banpresto", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Gunnm:_Martian_Memory", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108273-gunnm-kasei-no-kioku\n"}