{"altername_name": [], "name": "Guy Roux Football Manager: Saison 97/98", "overview": "Guy Roux (born October 18, 1938 in Colmar) is a former French football player and manager known for being in charge of French side AJ Auxerre for the remarkable period of more than forty years and for leading the once humble amateur team to national and worldwide prominence. Championship Manager starts a successful series of football management games, which means that you don't actually control your players during matches, but you're in charge of choosing the starting lineup and tactics. Matches are played out through a running commentary, with the chance to interrupt it to make substitutions or tactical changes. Each player's performance is rated out of 10, and these are among the many statistics stored throughout the game. In 1993, Intelek and UbiSoft used the Collyers' game code to produce a version for the French market, known as Guy Roux Manager (named after the legendary AJ Auxerre manager). It was fully localised for France and included the French first and second divisions as playable leagues, and all text and commentary in French. The Guy Roux Manager franchise has since become a very popular and long running franchise in France with games on many platforms. Guy Roux Football Manager Saison 97/98 is a soccer manager game released only for the french market that features 3 difficulty levels (very easy, easy & normal). The game allows the player to choose the team that he wants to train from the 4 french divisions, and the season when he wants to compete. Between matches you can purchase or sell your players and trim your squad to suit your needs.", "platform": "Sony Playstation", "release_date": "May 22, 1998", "game_type": "Released", "esrb": "", "developers": "Ubisoft", "publishers": "Ubisoft", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "3.62", "wikipedia": "https://psxdatacenter.com/games/P/G/SLES-01360.html", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127103-guy-roux-football-manager-saison-9798\n"}