{"altername_name": [], "name": "Hana to Ryuu", "overview": "Hana to Ryuu is a yaoi manga series created by Kazuma Kodaka in 1993. Designed as a doujinshi, Hana to Ryu follows Ryuji Kazama, the son of a dead yakuza boss, as he struggles to maintain a peaceful existence while dealing with harmful forces all around him. Hana to Ryu takes place in the universe of another Kodaka series Kizuna, taking place 10-15 years before Kizuna. PLOT: The Kazama syndicate had been one of the most powerful and respected yakuza syndicates in Japan. But one day, the leader of the syndicate is brutally murdered and the syndicate is brought down as members of the organization are forced to scatter. Among these are Kazama's young children, including his oldest son Ryuji. They take refuge with their aunt and in time forget the tragedy that befell their family. Years later, when Ryuji has grown into a teenager, he comes home to find his aunt being gang-raped by apparently random thugs. The violence then escalates out of control and leaves everyone in the room dead, except for Ryuji who is covered in blood. Though it's unclear what exactly transpired in the room, Ryuji's arrested for all the murders, tried, and sentenced to life in prison. Ryuji spends only four years in prison, but it's not an easy time for him. Brutally beaten and gang-raped constantly, he becomes bitter at the world and wishes for death. But it's in prison that he meets former allies of his father's organization and he truly learns what he is. He even gains the strength to stand up to his tormentors, although his actions will later come back to haunt him. Upon his release Ryuji meets up with an older man named Hitoshi Araki, who comes to his aid when a thug tries to mug him. But Hitoshi isn't some stranger; he too was part of the Kazama syndicate—more so, one of Ryuji's father's most trusted allies and Ryuji's protector when Ryuji was younger. It's through Hitoshi that Ryuji begins to get a sense of his humility and innocence back and the two men form a deep, unbreakable bond that gradually grows to love. Unfortunately for these two, being in with the yakuza won't give them an easy life of peace. And though Ryuji had already suffered so much in his young life, it's only inevitable that it gets worse for him. HANAFUDA: Hanafuda are playing cards of Japanese origin, used to play a number of games. The name literally translates as 'flower cards'. There are twelve suits, representing months. Each is designated a flower, and each suit has four cards. Typically, there are two 'normal' cards worth one point, one poetry ribbon card worth five points, and a final special card worth ten or twenty points. The point values could be considered unnecessary and arbitrary, as the most popular games only concern themselves with certain combinations of taken cards. Some groups, when gambling, will require the player whose score was multiplied to pay a proportionately larger amount of the winnings (i.e. a player who continued play twice would pay twice as much as the other player, since his score would have been doubled). MAHJONG: Mahjong is a game for four players that originated in China. It was called, meaning sparrow in ancient China, which is still the name most commonly used in some southern Chinese dialects such as Cantonese and Minnan, as well as in Japanese. However, most Mandarin-speaking Chinese now call the game má jiàng. Hana to Ryuu is a mahjong & hanafuda game based on the anime that features a free mode in which the player can choose a character and play a mahjong or a hanafuda game and a story mode in which the player start in the city and can go to different gambling places to play hanafuda or mahjong games and increase his money.", "platform": "Sony Playstation", "release_date": "August 13, 1998", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135523-hana-to-ryuu\n"}