{"altername_name": [], "name": "Hard Rock Cab", "overview": "Like today's Detroit, KEMO city was known for the manufacture of hovercars, meeting the country's demands for transportation until 2022. Over time, however, KEMO's crime rate had risen so far that the economy collapsed and the city descended into disorder. Criminals roamed the streets in armored hovercars, terrorizing the citizens of KEMO without fear of retribution. In 2029, OmniCorp promised city officials that it could clean up KEMO and return it to normal. The offer was accepted, and the corporation began the construction of a massive wall around the city under the guise of a \"defensive measure\". The wall was completed three years later, and the only exit sealed shut, turning KEMO into a massive prison city for all inside, criminal or otherwise. The outraged population reacted violently, and the city degenerated. Ten years later, in 2043, OmniCorp decided to test the behavior altering chemical Hydergine 344 on KEMO. This chemical was supposed to pacify the citizens of KEMO, and was distributed through the city's water supply. Unfortunately, OmniCorp failed to predict the chemical's reaction to the stagnant water, resulting in massive brain damage and insanity in the many of KEMO's citizens. More than half the population became crazed killers overnight. Drake Edgewater, a 21st-century cab driver and one of the lucky few unaffected by the spreading virus, is desperate to escape the city alive. Driving his '52 Checker \"hovercab\" armed with an assortment of headlight-mounted weaponry, he delivers passengers and packages for what money he can make to upgrade his vehicle and escape.", "platform": "Sony Playstation", "release_date": "February 16, 1996", "game_type": "Released", "esrb": "M - Mature", "developers": "Imagexcel", "publishers": "GameTek", "genres": "Fighting", "max_players": "1", "cooperative": "No", "rating": "3.12", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28881-hard-rock-cab\n"}