{"altername_name": [], "name": "Harlem Beat: You're the One", "overview": "Harlem Beat is a Japanese manga series created by Yuriko Nishiyama. It is published by Tokyopop in the United States. Harlem Beat details the struggles of young Naruse Tohru to go from a benchwarmer to a street-ball player. The story's scope expands as he makes friends and eventually becomes a member of his high school basketball team. Naruse Tohru is the main character of Harlem Beat. Naruse goes by his nickname Naruchiyo and is often associated with a monkey, serving as a mascot to the team. Nate is a perennial benchwarmer. Lacking in both coolness and talent, he is the most unlikely basketball player you'll ever find. But through persistence and support from his friends, Nate slowly teaches himself the art of basketball. Harlem Beat: You're the One is the Playstation adaptation of the manga focusing on Naruse Toru himself, or an anonymous male & female manager of your choice that's exclusively created by the author for the game. The game itself in general have two objectives that you have to accomplish in order to see the (standard) ending: -Reaching national tournament. -Scoring a girl. In addition to the girls from the manga (at least 3 possible), the author also created 3 extra girls exclusively for the game, which mean there're 6 (or maybe more) girls of your choice for scoring throughout the game, while reaching the national tournament as the primary objective. The gameplay is divided in 3 parts: -Simulation part: Where the player interact with other characters to build trust, develop relationship and try score a girl that you're aiming for. -Training part: Where the player got to build the team members , to increases their basketball abilities, such as speed, shooting, jump, stamina, etc. -Match part: Where the player have matches with other rival schools, to move on the story, you have to win the match until national, losing a match beforehand resulting in game over. The game story is based off from manga volume 6 – 21 of Harlem Beat, where Naruse managed to get 2nd place on street basket tournament, his struggle to stay in the high school main team, and eventually leading to the national tournament. The game uses a 3D graphics engine for the basketball match part and 2D cartoon graphics for the adventure and simulation parts.", "platform": "Sony Playstation", "release_date": "October 28, 1999", "game_type": "Released", "esrb": "", "developers": "Konami", "publishers": "Konami", "genres": "", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135633-harlem-beat-youre-the-one\n"}