{"altername_name": [], "name": "Harukanaru Toki no naka de", "overview": "Harukanaru Toki no Naka de is an otome adventure game developed by Ruby Party and published by Koei. It is a part of Ruby Party's Neoromance label. Because of Harukanaru Toki no Naka de's success, the game has give rise to a franchise including several sequels, numerous drama and music CDs, a manga series, two OAVs, a movie, and an anime TV series, and a live-action theatrical. STORY: On the first day of a new school term, high school student Akane Motomiya, her classmate Tenma Morimura, and their underclass friend Shimon Nagareyama are sucked into a mysterious old well. When they awake, they are in Kyo, another world that resembles Kyoto during the Heian Period. According to the young scion of the Star Clan, Fujihime, Akane is the Ryujin no Miko who has come to save Kyo from the ambitions of the Oni Clan. In this task, the Akane has the help of eight men known as the Hachiyo, and her friends Tenma and Shimon number among them. Initially, Akane is bewildered by her new circumstances, but she gradually comes to face up to her own destiny and understand the world of Kyo. GAMEPLAY: Harukanaru Toki no Naka de places the player in the role of a girl who is surrounded by attractive young men, and gives her the option of trying to win the heart of one and live happily ever after. The heroine must also fight evil with the help of the attractive young men. The result is a hybrid game with an visual novel-like interaction mode, a simple CRPG battle mode, and a board game-like map. Haruka is made up of ten chapters, eight of which involve the core gameplay. These chapters take place over a 2 week period and involve traveling around the Kyo map, searching for various key items. Kyo is made up of roughly 20 areas and it is possible to visit three in one day. However, most areas are possessed by onryo that must be dispelled before you can enter, and fighting them consumes one of the three visit chances. Haruka's battle system is limited in comparison to most CRPGs of its day. The maximum party size is 3 characters, but only Akane is under the direct control of the player. Though Akane can attack and defend, her other abilities - the use of healing items and spells, and the ability to encourage her comrades, are more useful. There is no magic point system as such. Casting spells is based on the morale of the Hachiyo members and the number of elemental fuda cards Akane has. Furthermore, there is no experience system and the character's hit points are refilled automatically between fights. The main reward for fighting, besides gaining entrance to a given area, is the chance to gain the trust of Hachiyo. The greater a Hachiyo member's rapport with Akane, the more effective he will be in battle. Harukanaru Toki no Naka de is the first game created for the Haruka series. In the game, the player is set as Ryuujin no Miko, returned to the ancient world, the Heian Era with two of her best friends, Morimura Tenma and Nagayama Shimon. Together with eight warriors known as the Hachiyo, you will fight against the race of Oni, led by Akuram. During this time together, you can develop further relationships with the Hachiyo, find out their individual stories and backgrounds. Fighting in the game is involved but not impossible to do. There are also a few mini games you need to play in order to retrieve items and increase intimacy and trust from your Hachiyo. Characters that you can conquer: Minamoto no Yorihisa, Moriyama Tenma, Inori, Nagayama Shimon, Tachibana no Tomomasa, Fujiwara no Takamichi, Eisen, Abe no Yasuaki, Moriyama Ran, Fuji Hime.", "platform": "Sony Playstation", "release_date": "April 6, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109333-harukanaru-toki-no-naka-de\n"}