{"altername_name": ["Heiwa Parlor! Pro: Lupin Sansei Special"], "name": "Heiwa Parlor! PRO Lupin the Third Special", "overview": "Heiwa Parlor! PRO Lupin the Third Special is a pachinko game that features 2 different pachinko machines and different levels of zoom. Pachinko is a Japanese gaming device used for amusement and prizes. Although pachinko machines were originally strictly mechanical, modern pachinko machines are a cross between a pinball machine and a video slot machine. The machines are widespread in establishments called \"pachinko parlors\", which also often feature a number of slot machines. Pachinko parlors share the reputation of slot machine dens and casinos the world over garish decoration; over-the-top architecture; a low-hanging haze of cigarette smoke; the constant din of the machines, music, and announcements; and flashing lights. Modern pachinko machines are highly customizable, keeping enthusiasts continuously entertained. There are many types of pachinko machines and parlor regulations, but most of them conform to a similar style of play. Players can buy metal balls by inserting either cash, a pre-paid card, or their member's card directly into the machine they want to use. For 1000 yen, 250 balls can be bought (4 yen per ball). These balls are then shot into the machine from a ball tray with the purpose of attempting to win more balls. The pachinko machine has a digital slot machine on a large screen in the center of its layout, and the objective here is to get 3 numbers or symbols in a row for a jackpot. Payout mode: During the spinning of the slot machine, when the first 2 numbers or letters of the spin match up the digital program will almost always enter into \"reach mode\" where many animations and movies are then shown before the final outcome is known just to give the player a boost of added excitement. If the player does manage to get 3 numbers or symbols in a row to obtain a jackpot (average odds of this happening are around 1 in 330), the machine will enter into \"payout mode.\" Lupin III, also known as Lupin the 3rd, is a Japanese manga series written and illustrated by Kazuhiko Kato under the pen name of Monkey Punch. The story follows the adventures of a gang of thieves led by Arsène Lupin III, the grandson of Arsène Lupin, the gentleman thief of Maurice Leblanc's series of novels. Lupin and his gang travel throughout the world to steal treasures and escape from the law. The game features 2 different pachinko machines and different animations based on the Lupin the third characters.", "platform": "Sony Playstation", "release_date": "January 13, 2000", "game_type": "Released", "esrb": "", "developers": "Telenet Japan", "publishers": "Nippon Telenet", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "2.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128616-heiwa-parlor-pro-lupin-the-third-special\n"}