{"altername_name": [], "name": "Honoo no Ryourinin: Cooking Fighter Hao", "overview": "The star of the game is Hao, a Chinese guy who wears a flowing red cape and wields a deadly ladel. At the beginning, he walks into a restaurant, and impressed everyone with his cool demeanor. He asks the head chef if he's seen a white haired girl. Suspecting that the young stranger is a minion of the evil Ajimaou (Flavor Demon King), he attacks Hao with a ladel, who effortlessly catches it with his chopsticks. Stories: - Mother's foe, Satan taste Pao-step journey continues even today. Lucifer's taste is the key to know the whereabouts of a mysterious disease affected \"the white-haired woman.\" Happen while traveling in a white haired woman, but find Pao, Lucifer's cooking taste flow path discourage people! - The second story, this dish is too spicy... Satan's disciples beauty taste claiming to cook \"anise\". Her cooking has found serious shortcomings Pao said her words were. Enraged anise killer's technique is to strike??Pao! ! ! ! ! - The third story, told him the name of Eagle Disease-ridden journey in the middle of a white-haired woman, The daughter \"cumin\" to meet Pao. Suffer from the disease in her mother's image vanished see Pao. Her elbow for drugs to conceive a dish, but Suddenly, a mysterious appearance cook! ! ! Cooking Fighter involves running around a 2D, top-view screen, smacking everything you see with your knife. There are numerous characters to choose from. Some are faster than others, some have better reach or a stronger attack, but the differences are minimal and it mostly comes down to whether you feel more like being a fat bald guy with a cleaver or a little girl with a ladle. There are a total of eleven chefs throughout the game. The Story Mode only lets you play as Hao, but the Free Battle lets you pick between all of the characters", "platform": "Sony Playstation", "release_date": "May 21, 1998", "game_type": "Released", "esrb": "", "developers": "Nippon Ichi Software", "publishers": "Nippon Ichi Software", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97603-honoo-no-ryourinin-cooking-fighter-hao\n"}