{"altername_name": [], "name": "Hoshi de Hakken!! Tamagotchi", "overview": "Hoshi de Hakken!! Tamagotchi is a Tamagotchi game for the Sony PlayStation. It was released by Bandai Japan in 1998. The game was never translated into English for sale outside of Japan. The main objective of the game is to collect all of the Tamagotchi that roam around the area. There are 94 Tamagotchi in total. You play as Mikachu, assistant to Professor Banzo, and your UFO has just crash-landed on a strange planet. As a scientist, you have to wander around the area trying to find different breed of Tamagotchi. There are two areas; a smaller Eastern area and a larger Western area. The majority of the Tamagotchi can be found in the larger Western area. There are also three times of day; Morning, Sundown and Night. Different Tamagotchi come out at different points in the day, so always be on the look for for different Tamagotchi! When you find a Tamagotchi, you will be instructed to chose one for four commands; Triangle, Square, Circle and X. Each different command will allow Mikachu to try a different persuasive dance, song, chant or trick respectively in hopes of alluring the Tamagotchi. Each Tamagotchi is allured by a certain command. Once you have a Tamagotchi, you can take it back to your UFO and take a picture of it to put in your record book. You will keep information on all of the Tamagotchi you find in the record book, if you take a picture of them. You can house a maximum of four Tamagotchi at once in your UFO, but you can say \"Bye Bye\" to them to get new ones. Once you have two Tamagotchi, a male and a female, you can try to breed them. If they breed successfully, you will be given an egg. You can hatch this egg and it will grow in your UFO just like a regular Tamagotchi. In your record book, you will see that some Tamagotchi are connected. This is because there are distinct Growth Charts in this game, too. Aiming for new characters that you haven't achieved yet by breeding is another great way to do this, and possibly the only way for some characters. The game is essentially over once all characters are collected, but you can continue to play by raising a certain character (or four!) in your UFO, playing games, meeting new characters and such. There are plenty of Tamagotchi characters in this version that do not appear on any other Tamagotchi releases to date.", "platform": "Sony Playstation", "release_date": "February 19, 1998", "game_type": "Released", "esrb": "", "developers": "Bandai", "publishers": "Bandai", "genres": "Strategy", "max_players": "2", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93831-hoshi-de-hakken-tamagotchi\n"}