{"altername_name": [], "name": "Hyper Value 2800: Hanafuda", "overview": "Hanafuda are playing cards of Japanese origin (karuta cards), used to play a number of games. The name literally translates as 'flower cards'. There are twelve suits, representing months. Each is designated a flower, and each suit has four cards. Typically, there are two 'normal' cards worth one point, one poetry ribbon card worth five points, and a final special card worth ten or twenty points. The point values could be considered unnecessary and arbitrary, as the most popular games only concern themselves with certain combinations of taken cards. For some purposes, the flowers are used as numerals, with pine having a value of 1, plum having a value of 2, and so forth. This enables the deck to be used for games such as Oicho-Kabu. RULES: - Object of Play: Accumulate more points than your opponent. Either a set number of rounds is played, a point goal is set to determine the winner, or players try to get so many more points than their opponent. - Rules of Play: Cards are shuffled and placed into a pile (called the stock). Eight cards are placed face up between the players, and then eight cards are dealt face-up to each player. If there are more than two players, then the hand size is decreased. - The Play: Play starts with the dealer. The player takes a card that was dealt to him and matches suit with a card that is on the table. If there isn't a matching card, the player discards a card to the center of the table. Then, the top stock card is turned face up, and if there is a matching suit on the playing field, the player takes the cards, otherwise the stock card is added to the playing field.[3] Play ends when either the stock is exhausted or either player's hand is empty. If a player is dealt four pairs or two complete suits, that player automatically wins the round. Scoring for this instance varies, but can be the value of the cards in the playing field. - Hiki: If there are a number of cards on the playing field of one suit, and a player has the rest of the suit in hand, this is a hiki. The player may take the entire suit of cards on his turn instead of playing a card from his hand. Trying to take a card from a hiki with the storm card is an illegal move. If the cards are dealt so that all four of one suit are on the playing field, the cards are shuffled and redealt. If three cards are on the table, they are stacked together and the remaining card takes all three. - Scoring: At the end of the round, each player adds the value of all cards he has taken. In some variations, 'winner takes all', meaning the winner of the match gets all the points the opponent has accumulated in that round. See the page 'Hanafuda Rules' for card sets and scoring. - Oya Gachi: In case of a tie, dealer wins. If the dealer isn't involved with the tie, the player closest to the dealer's left wins. Hyper Value 2800 Hanafuda is a hanafuda game with truck driving theme since the player controls a truck driver that going to different places playing hanafuda games with different", "platform": "Sony Playstation", "release_date": "January 13, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Board Game", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135754-hyper-value-2800-hanafuda\n"}