{"altername_name": [], "name": "Hyper Formation Soccer", "overview": "Super Soccer (Super Formation Soccer in Japan) is a soccer video game developed by Human Entertainment for the Super NES. Human published the game by themselves in Japan whereas Nintendo did it overseas. It was released in Japan in 1991 and in the United States on May 1992. The game consists of exhibition games and tournament games. In exhibition, one can choose to play either a game or a shootout. In tournament mode, one plays until one beats all other teams. At the end of the tournament, the player must play one final team, Nintendo. When the tournament has been won, the player receives a code to play the game in a more advanced mode. Originally, Formation Soccer was a PC Engine native game, that was released around the time of the 1990 FIFA World Cup. The series was then carried over to Super Nintendo and, ultimately, to Nintendo 64. The game is innovative because of its viewing perspective, to this day unique in soccer video games: the field is shown plainly on a vertical view, and the opposite goal can be seen from anywhere in the field, making use of the Mode 7 chip. This feature, however, is exclusive of the Super Nintendo games in the series. At the opening screen, players can choose to compete in penalty kicks without playing an actual game. Extremely responsive controls for both the goal-keeper and the kicker produced a penalty simulation which some argue is still the best version available on any game system. After the releases of the SNES & N64 games Hyper Formation Soccer is a very rare release since is one of the first soccer games released for Playstation, and the only one in the series for the PS1 console. In this game, the player can even select the size of the field, the game features differents stadiums, weather conditions and 32 national teams. Game modes: - Exhibition - World Cup - Human Cup - All star", "platform": "Sony Playstation", "release_date": "October 13, 1995", "game_type": "Released", "esrb": "", "developers": "Human Entertainment", "publishers": "Human Entertainment", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110386-hyper-formation-soccer\n"}