{"altername_name": [], "name": "Iceman: Digital PlayStage", "overview": "Iceman was a three-man Japanese electronica/pop rock group, consisting of Daisuke Asakura (keyboards), Kenichi Ito (guitar), and Michihiro Kuroda (lead vocals). They officially came together on June 5, 1996, when a press conference was held in Tokyo to announce the two musicians who would accompany Daisuke Asakura in his next musical venture after the breakup of access. Between 1996 and 1999, they released six albums, a multitude of PV and live videos, and even a video game. They had a unique and varied sound; sometimes hard electronic rock (Shining Collection), sometimes soft pop (Edge of the season), and even techno sounds (Caution). Iceman is probably most well known for \"Shining Collection\", a song used in the anime OVA Gravitation: Lyrics of Love by Asakura during his time as music director and composer for the series. The song has enjoyed a small spike in popularity outside of Japan thanks to its use in the anime, as well as a cult flash cartoon hosted on Newgrounds called \"A Sticky Night of Love\". The majority of the music was written by Daisuke Asakura, with several exceptions by Kenichi Ito. And though Michihiro Kuroda was the lead singer, Kenichi Ito and Daisuke Asakura had their hand at performing many of the songs. Iceman Digital Playstage is an interactive game that features: - Movie Player: Play video clips - Multi Angle: in which the player can choose which point of view he wants for each part of the song selecting each member of the group, - Stage Effect: in which the player can apply effect to a live stage show. - Photo Album: A gallery of the members of the group.", "platform": "Sony Playstation", "release_date": "March 26, 1998", "game_type": "Released", "esrb": "", "developers": "Sony Music Entertainment", "publishers": "Sony Music Entertainment", "genres": "Music", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110388-iceman-digital-playstage\n"}