{"altername_name": [], "name": "Idol Janshi Suchie-Pai II Limited", "overview": "Idol Janshi Suchie-Pai is a series of mahjong video games that have been released on a variety of systems including arcade, PC, and video game consoles. The first game in the series was on the Super Famicom in 1993 as Bishoujo Janshi Suchie-Pai and was renamed Idol Janshi Suchi-Pai for its subsequent releases. This game is notable for Kenichi Sonoda doing the character designs. There is also an anime OVA that is based on the game. Once every century, the legendary mahjong dials called the \"Legendary Pai\" show themselves to the world, and if you collect them all it will grant you any wish. They show up in the form of evil monsters and you must defeat all 10 to obtain this chance. So, a Bunny Alien, A Maid-Dominatrix, A Cyborg, A girl form the world of magic and a transforming super hero all must fight these monsters along with themselves to grant the wish that they want to come true. Idol Janshi Suchie-Pai II Limited is the sequel to Idol Janshi Suchie Pai and is also a conversion of an arcade machine (this time of the year 1994) and is a *Mahjong game with censored art (many are replaced with just swimsuit shots). The main characters that can be choose in the story mode are 4. This was the second Suchie-Pai game to appear on the Playstation. It was supposed to come out at the same time as the uncensored Saturn version but came out several months later. For a \"family\" machine, it still had the stripping scenes as scene on the Saturn version. However, the scenes did not show any nudity. Most of the scenes were the same with minor changes except for Yuki. In the Saturn version, her scene took place in the classroom. But in this version, it took place in the gym. This time there is an autoplay feature. Suchie-Pai series' best feature Hisatsu Suchie Stick!! When in tenpai situation (just 1 more correct tile to win), You can use special attack (requires 1 Suchie Stick item) to win instantly. The tile you need just pops up and you win. Instead of the story mode the game also featured the Free taisen (VS) mode character selection; In this mode the player can select/fight character unavailable from scenario mode and starts with 1 of each special attack items. The CD2 features the vs mode, an unlockable mode and interview with one of the voice actress. The CD3 features 2 interviews with other 2 voice actress and the CG Gallery that can be view playing the story mode in CD1 and saving in a memory card. There is also a \"special pack\" of this game (same catalogue number) which comes in a cardboard slipcase and includes a 1997 calendar.", "platform": "Sony Playstation", "release_date": "September 20, 1996", "game_type": "Released", "esrb": "", "developers": "Jaleco", "publishers": "Jaleco", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97607-idol-janshi-suchie-pai-ii-limited\n"}