{"altername_name": [], "name": "International Cricket Captain 2002", "overview": "International Cricket Captain, often known as ICC for short, is a series of cricket management video games by Empire Interactive, and then by Childish Things since International Cricket Captain 2009, before which Empire went into administration. It rose to popularity in 1998 following the release of the first PC-based game in the series. The most recent version of the game is International Cricket Captain 2011. The concept for International Cricket Captain was the brainchild of Chris Child, who programmed the original game engine as a university project. The player takes control of an English County Cricket squad with the aim of leading them to success in the domestic competition and ultimately being asked to take up the position of England manager. There is also an added option in later games in the ICC series to take control of one of the other Test playing nations. Taking inspiration from the hugely successful Championship Manager series of games, most aspects of a management sim are present in ICC, with the ability to coach players on their individual skills, scout opposition and buy and sell players at the end of each season. There are also comprehensive statistics available in the form of career stats pages for each player and team. Graphs and charts help the gamer to select the strongest team possible against particular opposition. Although mainly a PC based series, there have been console cross-overs, most notably for ICC 2001 which appeared on the PlayStation. However the PS version was limited in features compared to its PC cousin and as a result was not very successful. Aside from the lack of on-line play capability, gamers noted that the transition to the console meant for longer loading periods and a slightly more tedious controller-based interface International Cricket Captain 2002 is the third and latest game in the series for the Playstation One console. Game Modes: - Full Game: Take control of a first club county team and earn the right to captain the national side. - County & England: Captain both the first class county team of your choice as well as England. - International only: Test your chosen test side to compete in test series and competitions around the world. - 2003 World Cup: Mission impossible - Captain your chosen country to World Cup triumph in South Africa. - 2002 Ashes: The 2002 Ashes tour in Australia.", "platform": "Sony Playstation", "release_date": "May 24, 2002", "game_type": "Released", "esrb": "", "developers": "Empire Interactive", "publishers": "Empire Interactive", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97608-international-cricket-captain-2002\n"}