{"altername_name": [], "name": "Irem Arcade Classics", "overview": "A very hard-to-find collection of retro arcade titles, Irem Arcade Classics brings three cult coin-op favorites to the PlayStation (also released in Sega Saturn): - 10-YARD FIGHT: 10-Yard Fight is a 1983 American football arcade game that was developed and published in Japan by Irem and published in the United States by Taito and in Europe by Electrocoin. It is the first slightly realistic American football video game ever developed and released. Gameplay: The game is viewed in a top-down perspective and is vertical scrolling. The player does not select plays for either offense or defense. On offense, the player simply receives the ball upon the snap and either attempt to run with the quarterback, toss the ball to one of two running backs, or throw the ball to the one long distance receiver - basically the option offense. On defense, the player chooses one of two players to control, and the computer manipulates the others. The ball can also be punted or a field goal can be attempted. 10-Yard Fight has four levels of difficulty; from easiest to most difficult: high school, college, professional, playoff and Super Bowl. If the player wins both halves of an \"accelerated real time\" 30-minute half at an easier level, the player advanced to the next level of difficulty. - ZIPPY RACE (better known to U.S. gamers as the motorbike racing game Motorace USA)MotoRace USA (also known as Traverse USA, in Japan as Zippy Race and in Spain as Mototour) is an arcade game released by Irem in 1983. Gameplay: The game's main character is a racer who must travel on his motorbike from Los Angeles to New York while avoiding many cars who try to crash into the rider. Interestingly, every level has two parts: * The first part is an overhead game with the aforementioned gameplay. Cars overtaken during this part of the level cause the player's rank to increment by 1 per car. The current rank is shown in the bottom right hand corner of the game screen during each stage. * The second part has the player watching the biker from behind his back. The player must try not to crash into the opposite cars while a background relative to the city he's travelling to is shown (i.e.: if the player is reaching Las Vegas, then a few casinos can be seen in the background). Oncoming cars passed do not increase the player's rank. - KUNG-FU MASTER (also known as Spartan X): a martial-arts fighting game. Kung-Fu Master is a 1984 arcade game developed by the Japanese company Irem Corporation. It was manufactured under license in the United States by Data East. It was released in Japan as Spartan X and credited \"Paragon Films Ltd., Towa Promotion\", who made the movie starring Jackie Chan called Spartan X (Wheels on Meals) upon which it was based. The game contains elements of Bruce Lee's Game of Death. Story: The player takes the role of Keiji Thomas, a man in a Keikogi and slippers. Thomas's girlfriend, Sylvia, has been kidnapped by \"Mr. X\", and Thomas must fight through five side-scrolling floors full of enemies to rescue her. Brutally summarized as \"rescue girlfriend – hit people\", the US and UK version opened with the clumsy phrase \"Thomas and Sylvia were attacked by several unknown guys....\" In addition to a simple menu for picking which game to play, Irem Arcade Classics also features customization options for each game, ranging from background music (original or \"arrangement\"), scoring and difficulty levels, and whether or not a \"continue\" option is switched on for each game. (The only hitch is that Irem Arcade Classics has no memory card functionality, so there's no way for players to save their custom settings; worse yet, once one of the three games has been \"booted,\" the PlayStation must be reset to get back to the main game menu.) It's an exceedingly rare import collection, even more scarce than Nichibutsu Arcade Classics or Namco Museum Encore, so video game collectors seeking Irem Arcade Classics better be ready to pony up serious cash to fuel their classic arcade jones.", "platform": "Sony Playstation", "release_date": "April 26, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Irem", "publishers": "I'Max", "genres": "Beat 'em Up", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109756-irem-arcade-classics\n"}