{"altername_name": [], "name": "Ishin no Arashi: Bakumatsu Shishiden", "overview": "Ishin no Arashi (literally: Storm of Reformation) is a part of Koei's Rekoeition series, a set of simulation titles which incorporate role-playing game elements. It was first released by Koei in 1988 for the PC-9801. So far the games remain in Japan and have not been localized. Ishin no Arashi's setting is the Bakumatsu. The series's namesake alludes to the Meiji Restoration - sometimes abbreviated as \"The Restoration\" in Japanese, a chain of events to completely remove the shogunate and samurai society erected during the Warring States period and to restore the Emperor's influence. These events happen after the series's setting. Players predominately follow the Anti-Shogunate, Pro-Shogunate, or the proponents for opening the country throughout the tremulous time period; the depths of their perspectives vary on the title. It becomes progressively narrow by the third title. Ishin no Arashi Bakumatsu Shishiden is the second game based in the NES Ishin no Arashi game, for the Playstation console The game takes place in Bakumatsu times, that are the final years of the Edo period when the Tokugawa shogunate came to an end. It is characterized by major events occurring between 1853 and 1867 during which Japan ended its isolationist foreign policy known as sakoku and transitioned from a feudal shogunate to the Meiji government. The major ideological/political divide during this period was between the pro-imperialist ishin shishi (nationalist patriots) and the shogunate forces, including the elite Shinsengumi (newly selected corps) swordsmen. Although these two groups were the most visible powers, many other factions attempted to use the chaos of Bakumatsu to seize personal power. Furthermore there were two other main driving forces for dissent: first, growing resentment on the part of the tozama daimyo (or outside lords), and second, growing anti-western sentiment following the arrival of Matthew C. Perry. The first related to those lords who had fought against Tokugawa forces at the Battle of Sekigahara (in 1600) and had from that point on been excluded permanently from all powerful positions within the shogunate. The second was to be expressed in the phrase sonno joi, or \"revere the Emperor, expel the barbarians\". The turning point of the Bakumatsu was during the Boshin War and the Battle of Toba-Fushimi when pro-shogunate forces were defeated. In the game the player has to go around the town talking to different people to prepare the town defenses and also he will have to make trades, training, rest, go to the temples to pray, buy things, etc. The game is really heavy in japanese text and difficult to play.", "platform": "Sony Playstation", "release_date": "February 4, 1999", "game_type": "Released", "esrb": "", "developers": "Koei", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109757-ishin-no-arashi-bakumatsu-shishiden\n"}