{"altername_name": [], "name": "Iwatobi Penguin Rocky x Hopper 2: Tantei Monogatari", "overview": "Rocky X Hopper 2 is just like it's prequel, a party game. Consisting of 12 mini games. The stars of the game are two penguins, Rocky and Hopper who run a detective agency. One day they get hired by Pinky the penguin to search for her lost cat. Seeing a possibility to earn a quick buck, Brownie joins in the search. During their adventure, the cat is kidnapped by an evil scientist, which happens to be a poodle. These story segments are all presented in FMV and add lots of humor to the game. Adding to the craziness of it all are FMV commercials that can be unlocked by completing the story mode. In these you can see Rocky and Hopper star in Japanese spots for a product called \"Super Hard\" hair mousse. But what the game really is about. is the minigames. These are fun when played alone, but when played with 2-4 people the craziness of this game really starts to shine through. 4 players can play using a multitap, but also by sharing just 2 controllers and selecting the strangely called \"Love Mode\". Minigames range from memory games, where one must flip 2 cards at a time and try to match animal sounds to score points, up to a little shooting gallery where you have to avoid shooting the kitty and must try to shoot the evil poodle before someone else does. Another game has you dialing a phone number as quick as possible. All numbers on the phone are presented by buttons on the Playstation pad. Now the tricky part is that these symbols are written on individual cards which spin, twist and turn at different rates, so that you can never see the whole 8 symbol combination at once. Making this a game of quick reflexes. The popcorn game: You are stuck in a square room with a popcorn machine in the middle. The object is to collect as much popcorn as possible. The machine spits out popcorn in all directions, and once the popcorn touches the floor, it's gone. When catching popcorn in mid-air by jumping towards it you get more points then by just waiting for it to drop into your beak. Sometimes there is also different colored popcorn that is shot out, which accounts for more points. And one last thing, at certain times the popcorn machine starts spinning around. When you then touch it, you also start to spin for several seconds. That wouldn't be a problem if it wasn't for the fact that when you're spinning, you can't jump. Hereby adding a new tactic of trying to push you opponents against the spinning popcorn machine, while you will be able to jump over their heads gobbling up as much popcorn as possible. Another game has you popping balloons of different colors, which are floating at various heights. These all have different point values. The longer you hold down the jump button, the higher you will be able to jump. But then again, jump too high and you will get stuck in the ceiling for a few seconds. When jumping on top of another penguins head, you also get bounced of higher, adding to the danger of getting stuck in the ceiling. At the start of each game you are being shown which buttons on the controller must be used. The only minigame which could be confusing without a little explanation is a memory game where the 4 penguins all stand next to each other, facing the camera. You can start by pressing any button you like. The 2nd played must repeat your command and add one of his own. The 3rd one must repeat both of these and also add one himself. This is repeated until someone can't remember all the commands or simply make a mistake. All in all, this is a very fun little game, which becomes extremely enjoyable and hilarious when playing with multiple people.", "platform": "Sony Playstation", "release_date": "February 26, 1998", "game_type": "Released", "esrb": "", "developers": "Culture Publishers", "publishers": "Culture Publishers", "genres": "Party", "max_players": "4", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97627-iwatobi-penguin-rocky-x-hopper-2-tantei-monogatari\n"}