{"altername_name": ["ISS Pro 98", "J. League Jikkyou Winning Eleven 3"], "name": "J.League Jikkyou Winning Eleven 3", "overview": "International Superstar Soccer Pro '98 or ISS Pro '98 is a football video game which is a continuation of International Superstar Soccer Pro. Originally released in May, 1998 by Konami Computer Entertainment Tokyo, Inc. Although it still lacked FIFPro licence it featured on its Playstation version cover Italian player Fabrizio Ravanelli along with Andreas Koepke from Germany on German relase and Paul Ince on British. The Nintendo 64 version cover featured Colombian player Carlos Valderrama, and the game featured license from Reebok to use their logos in adboards and the Chilean kits. The Japanese release, Winning Eleven 3 has been re-released in 1999 as Winning Eleven 3 Final ver. with some slight improvements. The commentary for the game is provided by Tony Gubba. The Nintendo 64 version was called International Superstar Soccer 98 and was developed by KCEO, rather than KCET. Most significant improvements: * The list of teams has been extendend to 54 (52 in the Nintendo 64 version). * The number of players in each team has been extended to 18 (20 in the Nintendo 64 version; the same number of International Superstar Soccer Deluxe). * Slide bar allowing to adjust game speed has been introduced (absent from the N64 version) * Formation mode can be entered in any time during the match * New games mode - All Star Match (exclusive to PSX) and Training * Player Name Editor has been implemented in Game Options * The choice of difficulty and game length allowed in other game modes than Exhibition Mode (only in PSX) * Five new stadiums (three in N64) and five difficulty levels GAME MODES: International Superstar Soccer Pro '98 featured 6 different game modes. Modes existing in previous version have been developed and the two new have been added. * Exhibition Mode: a friendly match game against computer or another player with a choice of difficulty, stadium, weather and match length and time of a match. It was also possible to play with another player or with computer against computer. Computer versus computer option was available as well. * League Mode: 16 international teams participate in league playing either half or full season with a free choice of teams. * Cup Mode: mainly focused on emulation of FIFA World Cup with the real group draw as in FIFA World Cup 1998. This mode also included local cups like European Cup, Asian Cup, African Cup, North American Cup and South American Cup, each based on knockout-stage conditions. Konami Cup was the one with the more adjustable settings like the number of teams and tournament basis. * All Star Match: a friendly match game between the World Stars Players and European Stars Players. * Penalty Kick Mode: two teams take a five penalty kicks to select the winner. In case of a draw, they undergo sudden death round. * Training: practice of shooting free kicks and corner kicks with a selected team.", "platform": "Sony Playstation", "release_date": "December 11, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97769-jleague-jikkyou-winning-eleven-3\n"}