{"altername_name": [], "name": "Jaleco Collection Vol.1", "overview": "Jaleco Collection vol.1 is a compilation of these NES games: Argus, City Connection, Exerion, Field Combat, Formation Z, Ninja Jajamaru Kun & RodLand. ARGUS: Argus is a standard vertical shooting game like Raptor or Tyrian; this game bears a strong resemblance to Terra Cresta, an arcade game. There is no story, this game is a straight arcade-action shooter. The game scrolls upward as waves of enemies attempt to impede your progress, shooting slow and fast moving bullets at your ship. Armed with air-to-air and air-to-ground missiles, blast your way forward while looking for bonuses. Crudely drawn buildings must be shot or avoided since it is possible to crash into them. While moving forward the game allows your ship to move as far left or right as necessary. Finally, at the end of each level you will have to destroy a large enemy. CITY CONNECTION: Based on the arcade hit, you must drive along on roads, painting them a different color. When you have all the roads painted, you go on to the next level. Cops are frequent along the roads, but oil cans will quickly stop them in their tracks. Avoid cats and spikes, and collect balloons to warp to further levels. EXERION: This is a shoot-em-up game with parallax effects in the background. It does have a simulation of inertia in the control of the ship. There are dozens of enemies and two types of shooting: slow and fast. Two weapon systems: one slow double-shot cannon and one fast single-shot cannon. With each enemy hit by the slow cannon you get one shot added to the fast cannon ammunition supply. A challenge stage follows each stage in which you can build up your fast-shot bullet supply. FIELD COMBAT: Players are assigned the role as the field commander of the blue colored forces who are in a battle against the red colored forces. Players take control of the Genesis, a flying saucer shaped craft, that can fire missiles, capture enemy units with a tractor beam, and deploy allied units onto the field. The game's battlefield is viewed from a top down perspective. The Genesis has a target reticle that is always placed a certain distance in front of the craft. Players have to maneuver this cross-hair over any target they want to shoot or capture. The Genesis can also deploy up to six allied units at any one time to help out on the battlefield. Deployable units include soldiers, Hel-99A (tanks), FL-880 (mobile cannons), Kieths (mechanized infantry), and Louis (copters). The enemy's forces also consist of the same units, and both the Genesis and the enemy's Flying Crane craft can abduct enemy forces and add them to their side. At the end of each battlefield is an exit that is defended by enemy turrets which most be destroyed in order to leave the battlefield. The game contains six distinct battlefields that loop back to the beginning when conquered, however the enemies will be more numerous and aggressive on the second time around. FORMATION Z: The player competes in a marathon continuous scrolling horizontal shoot-em-up game across land, sea, air and outer space. You can hold down the fire button for a burst of Charged fire, which is especially essential to defeat the bosses. The player can hold down the Jump button to transform back and forth between a Mobile Robot or an Aero Fighter. Some sections have confrontations on both ground and air; others insist on aerial battling. Your time in the Aero Fighter is limited by its fuel requirement. NINJA JAJAMARU KUN: In a realm of feudal Japanese folklore the eponymous Ninja Jajamaru-kun must rescue his beloved Princess Sakura from the clutches of a fiendish catfish-faced pirate. Jajamaru-kun begins on the bottom of a three tiered horizontal field. On each level of this field there are two enemies on each tier. The tiers have weak brick ceilings that Jajamaru-kun can break by jumping into them. Once a passage is made Jajamaru-kun can move through them as can enemies. To clear a level all enemies must be defeated, most enemies can be killed by having a shuriken thrown at them, the only weapon available without a power-up, some need to be stunned either by falling through a hole in a tier or by being jumped on. Enemy projectiles can also be canceled out by the shuriken. Being touched by an enemy projectile, or in a few cases an enemies body, will instantly kill Jajamaru-kun. After an enemy has been killed its spirit will ascend, you can grab this for extra points. RODLAND: Taking a rather literal view of the term 'slap-stick humour', Rodland features two fairies called Tam and Rit, whose mission is to rescue their mum who's been captured and taken to a castle. There are 40 screens to clear, all full of baddies, who are disposed of by grabbing them with a stick, and flipping them from side to side to inflict damage. The hits needn't all be inflicted at the same time, as it's possible to release them to move them out of the way.", "platform": "Sony Playstation", "release_date": "October 23, 2003", "game_type": "Released", "esrb": "", "developers": "Pacific Century Cyber Works Japan", "publishers": "Pacific Century Cyber Works", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98100-jaleco-collection-vol1\n"}