{"altername_name": [], "name": "Jan Jan Koi Shimasho: Lovely Pop 2 in 1", "overview": "Jang Jang Koi Shimashow - Lovely Pop 2 in 1 is a mahjong & and a hanafuda game in which the player takes the role of young student in a high school that will have to play different hanafuda games to win the heart of four girls of his school (Natsumi, Yukari, Rikako & Mika). The game features 2 main game modes: - Remix mode: This one is a mahjong game - Special Mode: This one is a hanafuda game The game features also a omake mode (showing the voice actress of the game). In each main game mode the game features a complete tutorial. In each mode (Remix & Special) the game got 2 game modes: - In the story mode the game features a complete story in which to advance in the game the player has to defeat each girl by order. - Free mode: Play against any of the girls. Characters in Remix mode: Nana, Kanako, Hina & Kotono. - Jang Jang Koi Shimashow - Separate 1 - Jang Jang Shimashow is a mahjong game in which the player takes the role of a young man that one days starts working in a manager office and his boss (a woman) will let him meet some of the stars so he can try to date her after winning some mahjong matchs. The game features 2 game modes: Story mode and Free Play Mode. There is also a mahjong tutorial in japanese and also an omake mode with unlockable characters galleries. - Jang Jang Koi Shimashow - Separate 2 - Koi Koi Shimashow is a hanafuda game in which the player takes the role of young student in a high school that will have to play different hanafuda games to win the heart of four girls of his school (Natsumi, Yukari, Rikako & Mika). The game features 2 game modes: Story mode and Free Play Mode. There is also a hanafuda tutorial in japanese and also an omake mode with unlockable characters galleries. Hanafuda are playing cards of Japanese origin (karuta cards), used to play a number of games. The name literally translates as \"flower cards\". Cards: There are twelve suits, representing months. Each is designated a flower, and each suit has four cards. Typically, there are two 'normal' cards worth one point, one poetry ribbon card worth five points, and a final special card worth ten or twenty points. The point values could be considered unnecessary and arbitrary, as the most popular games only concern themselves with certain combinations of taken cards. For some purposes, the flowers are used as numerals, with pine having a value of 1, plum having a value of 2, and so forth. This enables the deck to be used for games such as Oicho-Kabu.", "platform": "Sony Playstation", "release_date": "February 26, 1998", "game_type": "Released", "esrb": "", "developers": "Visco", "publishers": "Visco", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135931-jan-jan-koi-shimasho-lovely-pop-2-in-1\n"}