{"altername_name": [], "name": "Jang Jang Koi Shimashow Separate 1: Jang Jang Shimashow", "overview": "Jang Jang Koi Shimashow - Separate 1 - Jang Jang Shimashow is a mahjong game in which the player takes the role of a young man that one days starts working in a manager office and his boss (a woman) will let him meet some of the stars so he can try to date her after winning some mahjong matchs. The game features 2 game modes: Story mode and Free Play Mode. There is also a mahjong tutorial in japanese and also an omake mode with unlockable characters galleries. Characters in Remix mode: Nana, Kanako, Hina & Kotono. Mahjong is a game for four players that originated in China. It was called, meaning sparrow in ancient China, which is still the name most commonly used in some southern Chinese dialects such as Cantonese and Minnan, as well as in Japanese. However, most Mandarin-speaking Chinese now call the game má jiàng. Mahjong involves skill, strategy, and calculation, as well as a certain degree of luck (depending on the variation played, luck can be anything from a minor to a dominant factor in winning). In Asia, mahjong is also popularly played as a gambling game. In the game, each player is dealt either thirteen or sixteen tiles in a hand, depending on the variation being played. On their turn, players draw a tile and discard one, with the goal of making four or five melds (also depending on the variation) and one pair, or \"head\". Winning comes \"on the draw\" by drawing a new or discarded tile that completes the hand. Thus, a winning hand actually contains fourteen (or seventeen) tiles.", "platform": "Sony Playstation", "release_date": "February 26, 1998", "game_type": "Released", "esrb": "", "developers": "Visco", "publishers": "Visco", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135932-jang-jang-koi-shimashow-separate-1-jang-jang-shimashow\n"}