{"altername_name": [], "name": "Jet de Go! Let's Go by Airliner", "overview": "The story of Jet de Go! is, you are a beginner pilot of JAL, Japan Air Lines, which is the official airline of the game. You came with zero miles experience, yet you're very determined to try. You will have to choose some flight that is available--all inbetween places and cities in Japan. You could also play as much and fly as far as possible to gain more and more mileage credits (or whatever it is called), which store the total of miles you have flight away with your plane. The more miles you have, you might unlock some secrets, specials, or at the very least--you will become way much more experienced of a pilot. The gameplay, can be separated into three different phase. Take-off, cruising, and landing your plane. TAKE OFF MODE: In take-off mode, you will have to control your plane and interact with the control tower and your passengers until the plane could get hang itself on air. First, you have to report to the control tower about your departure, and tell your passengers about that too. Then, you will have to max up your plane's speed. Eventually, you will reach the ''pull-off line''; the place where you have enough speed and space to pull-off your plane and taking your way off. Once you're on air, you will have to maintain your flying angle so that you don't fly too high or nose your plane too low. In the end, you are ready to fly, and you will have to get in your plane's landing wheel. You will have to remind your passengers about their seatbelt, as well. Now, after you're on air, it's cruising time. You will be given your route map, and you will be shown to where you have to go next. You will see a green square somewhat in front of you. It represents your temporary destination or checkpoints. It could be an airport or a city, but you don't have to land on it. You just have to go through the green square, and then move to the next destination. Once in a while, you will be able to inform your passengers about some beautiful scenery down below, and thus giving them some time to take a picture or two. Finally, you will reach your destination airport. Lower your speed, maintain your plane angle, bring out your landing wheel, and control your height until you touchdown the landing way. Do it all right, and you will finish your job safely--just a little breath-catching before your next job awaits. FREE MODE: In free mode, you may choose the flight options. The options may vary between take-off, cruising or landing, but there may never be two kind of mode in one flight. In the end of a flight, you will get your report and your points. There are a lot of things decide your points, like your landing-smoothness, your take-off angle or such, and they are all in Japanese you might not give much damn about it. Now, in order to beat the game you will have to do three succesful flight in a row. You will get an ending movie or other bonuses once you win the free mode. CRUISE MODE: In cruise mode, however, you have to do all-in-one, from taking-off, cruising and landing. CAREER MODE: And there are another mode where you could save your name and such. In here you could do some infinite amount of cruise to collect mile points. I believe that the more points you get, you could get some special prizes. By collecting points, I believe, you could exchange it with some bonus pictures or movies or such. As an addition, you could fly in variable condition. It could be night, noon or morning, and it could be a sunny or rainy or maybe other weather condition. Different time might brings different difficulty, like flying at night, where obviously, is harder than at morning due to the lack of light guidance at that time. The player can unlock pictures, movies, etc.", "platform": "Sony Playstation", "release_date": "February 3, 2000", "game_type": "Released", "esrb": "", "developers": "Racdym", "publishers": "Taito", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109760-jet-de-go-lets-go-by-airliner\n"}