{"altername_name": ["Jikkyou Powerful Pro Yakyuu '99: Ketteiban"], "name": "Jikkyou Powerful Pro Yakyu '99: Ketteiban", "overview": "Jikkyou Pawafuru Puroyakyu '99 is the fourth game in the long running baseball series development by Konami that had sold more than 14 millions of copies. The series are known for the looks of the characters that are totally cartoon done and without legs.The game features different game modes such us vs mode, practice, tournament and season. The Success Mode: The Success Mode is the game's most compelling feature[citation needed], combining role-playing game and life simulation games elements with the baseball sport. The basic objective is to train a generic Pawapurokun to become a professional baseball player. The Pawapurokun starts out with low stats, but often ends up being far better than any of the real professional players included in the game. Generally, Pawapurokun begins as an amateur player (ranging from high school, college or company player) who must become a professional in a certain period (usually three years). The Success Mode takes only about 2 hours to complete, but creating a good player requires an extraordinary amount of skill and luck, giving the game almost infinite replay value.[citation needed] Various random events will affect the growth of your player, for example, getting a girlfriend will allow you to regain motivation easily and receive presents (which drastically improve your player's stats) on your birthday. Mylife mode: Due to the great success of success mode, Konami have someway extended to another game mode called Mylife since Pawapuro 10, which can use created player (or using an NPB player, even creating a player at place) to play in the NPB, with another series of events, through there are no more characters from success mode appears in it. The difficulty will change according to your performance in the game. The known mode in Mylife mode are: * Loan player: Playing as a loan player from other team, maximum playtime is one year. * Playing Manager: Playing as a playing manager, maximum playtime is one year. Whenever the team lose the possibility claiming the League Champion (or playoff in Pacific League). Currently available in 13. * Pro players: Choosing one current NPB players, maximum playtime is 20 years. The difference between Kaimakuban & Ketteiban are just new players & teams stats updated for the new season.", "platform": "Sony Playstation", "release_date": "December 25, 1999", "game_type": "Released", "esrb": "", "developers": "Diamond Head", "publishers": "Konami", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "2.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110426-jikkyou-powerful-pro-yakyu-99-ketteiban\n"}