{"altername_name": [], "name": "Jissen Pachi-Slot Hisshouhou! Single: Epsilon R", "overview": "The pachinko machines are japanese slot gambling machines used for amusement and prizes. Although pachinko machines were originally strictly mechanical, modern pachinko machines are a cross between a pinball machine and a video slot machine. There are many types of pachinko machines and parlor regulations, but most of them conform to a similar style of play. Players can buy metal balls by either inserting either cash, a pre-paid card, or their member's card directly into the machine they want to use. At 4 yen per ball that's 250 balls for every 1000 yen. These balls are then shot into the machine from a ball tray with the purpose of attempting to win more balls. The pachinko machine has a digital slot machine on a large screen in the center of its layout, and the objective here is to get 3 numbers or symbols in a row for a jackpot. Kamen Rider V3 is a Japanese tokusatsu television series. It is the second installment in the popular Kamen Rider Series, and the direct sequel to the original Kamen Rider. It was a joint collaboration between Ishimori Productions and Toei, and was shown on NET from February 17, 1973, to February 9, 1974, with a total of 52 episodes. Every episode of Kamen Rider V3 begins with a statement: \"Kamen Rider V3, Shiro Kazami, is an altered human. Mortally wounded by Destron, he is rebuilt by Kamen Riders 1 and 2, reborn as Kamen Rider V3\" Jissen Pachi-Slot Hisshousou! Single - Epsilon R features the Epsilon R pachinko machine with different levels of zoom and all the technical specs and stats of the machine. Manufacturer's description: The 4 reel pachislot \"Seamaster X\" that made a shocking debut, \"Epsilon R\" full of the capture elements, and the famous machine \"Wild Panther 2\". There are plenty of pocket stations such as the probability table of the table, set values, pita push seamaster of the mini game! Features: - First person perspective. - 2D graphics - Cartoon graphics - SCIFI & Gambling theme.", "platform": "Sony Playstation", "release_date": "October 28, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Maxbet", "publishers": "Maxbet", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136288-jissen-pachi-slot-hisshouhou-single-epsilon-r\n"}