{"altername_name": [], "name": "Junclassic C.C. & Rope Club", "overview": "Rope Club is a sister course of Jun Classic Country Club and was designed by Tadashi Sasaki under the supervision of Gene Sarazen. A parkland course with long and spacious fairways. Varied bunkers,many of them are beach bunkers are placed here and there. Junclassic C.C. & Rope Club is a golf game released for the Sega Saturn & the Playstation One consoles. The game features 2 different courses each of them with 3 different routes. The game features also these game modes: - J & R Tournament Mode: The main mode of the game, 1-4 Players mode. Try to win the tournament. - Handicap Mode: 2-4 Players mode. The one that complete the course with less handicap wins. - 1 Day Tournament: 1-4 Players mode. Play one of the courses in a 1 day tournament. - Skins Game Mode: 1-4 Players mode. A skins game is a variation on match play where each hole has an amount of money (the \"skin\") attached. This may be prize money at the professional level (the most famous event to use these rules was the \"LG Skins Game\", played at Indian Wells Golf Resort in California until 2008), or an amount wagered for each hole among amateur players. The player with the lowest score on the hole wins the skin for that hole; if two or more players tie for the lowest score, the skin carries over to the next hole. This continues until a player wins a hole outright, which may (and often does) result in a player receiving money for a previous hole that they hadn't tied for. If players tie the 18th hole, either all players or only the tying players repeat the 18th hole until an outright winner is decided for that hole (and all undecided skins). - Free Golf: 1-4 Players mode. Play one of the courses of the game. - Practice: 1-4 Players mode. Practice any hole in any of the 2 courses.", "platform": "Sony Playstation", "release_date": "April 23, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "T&E Soft", "publishers": "T&E Soft", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98114-junclassic-cc-rope-club\n"}