{"altername_name": [], "name": "Kagayaku Kisetsu e", "overview": "Kagayaku Kisetsu he is a Japanese adult visual novel, developed by Tactics, a brand of the joint company Nexton, and released on May 26, 1998 playable on the PC for Windows 95. Much of the staff that created the game later became the founding members of the visual novel company Key. The game was later ported to the PlayStation, and re-released as a full-voice version for the PC. A sequel loosely based on the original One visual novel entitled One2: Eien no Yakusoku was produced by BaseSon, another brand under Nexton, and was first released in April 2002. Two original video animation (OVA) series were created loosely based on the game. The first, which had the same title as the original game, was an all-ages OVA published by KSS between 2001 and 2002 with four episodes. The second series, by the title of One: True Stories, was adult in nature, and published by Cherry Lips between 2003 and 2004 with three episodes. One: True Stories was later licensed for English language distribution by Media Blasters. Other adaptations include four novels, drama CDs, and manga anthologies. GAMEPLAY: The gameplay requires little interaction from the player as most of the game is spent on reading the text that appears on the game screen, which represents either dialogue between the various characters, or the inner thoughts of the protagonist. Every so often, the player will come to a \"decision point\" where he or she is given the chance to choose from options displayed on the screen, typically two to three at a time. The time between these decision points is variable and can occur anywhere from a minute to much longer. During these times, gameplay pauses until a choice is made that furthers the plot in a specific direction, depending on which choice the player makes. There are six main plot lines that the player will have the chance to experience, one for each of the heroines in the story. Each plot line can be achieved through multiple replays. STORY: The story revolves around Kohei Orihara, the main protagonist, who suspects that at some point his current life will change while living a peaceful daily routine. His parents died when he was very young, and after his younger sister dies, he begins to seclude himself in the Eternal World, a world within his mind. The game's main recurring motif is a focus on the Eternal World, a mystical alternate space which is never clearly explained, and the details of which are unknown. Shun Hikami's remarks in the original game are possible clues about the Eternal World. The Eternal World is a place similar to the afterlife accessible to anyone, though returning to the real world is difficult. The person's \"other self\" awaits in that world. If a bond is found in the real world, a person in the Eternal World can be returned after approximately one year. The area is a common territory where anyone in the Eternal World can meet each other. Once inside, it might be necessary to take a girl as a guide by forming a pledge where a grace period can be granted. The guide to the Eternal World's avatar exists in the real world, but one's memories surrounding the pledge become hazy. This world is only accessible once one has lost his or her grounding in the real world, and nothing can prevent someone from going to the Eternal World. A person about to leave to the Eternal World starts to be forgotten approximately one week before going. However, he or she is remembered the moment that person returns. The amount of time before someone forgets differs based on how much someone thinks about the person leaving. Kohei is living a normal life in high school with his childhood friend Mizuka Nagamori, and gets to know five other girls throughout the story whom he tries to help with their various personal problems. While Kohei likes to joke and tease the girls he knows, deep down he is nice to girls and genuinely wants to help them. In the story, Kohei is able to form intimate relationships with the six main heroines who include: Mizuka Nagamori, Rumi Nanase, Misaki Kawana, Mio Kouzuki, Mayu Shiina, and Akane Satomura. While a given relationship will start out well, before long those around him start to forget him as he begins to retreat further into the Eternal World within his mind. This process continues until even the girl he loves forgets him, at which point he falls into the Eternal World completely, making it seem as if he never existed in the real world. Kohei's only hope of returning is to form a strong bond in the real world prior to leaving, and being able to follow his guide in the Eternal World back to the real world. MAIN CHARACTERS: - Kohei Orihara - Mizuka Nagamori - Rumi Nanase - Misaki Kawana - Mio Kouzuki - Mayu Shiina - Akane Satomura", "platform": "Sony Playstation", "release_date": "April 1, 1999", "game_type": "Released", "esrb": "", "developers": "Kid", "publishers": "KID", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135784-kagayaku-kisetsu-e\n"}