{"altername_name": [], "name": "Kaikan Phrase: Datenshi Kourin", "overview": "Based on the boy band, bishonen anime with the real voice actors, plus an abundance of footage and an introduction from the series, Kaikan Phrase pits the player on stage needing to successfully hit the beats to progress. Initially only the anime’s intro song is available, but loads more are available to be unlocked. Each band member varies in difficulty regarding the speed and frequency of beats with the drummer being a particularly tough nut to crack. A Tour Mode keeps interest in a very stylish title. Kaikan Phrase is a music simulation game, much like the Beat Mania series. The story goes around a music band called Aucifer in their road to stardom. To accomplish their goal they have to sing in some places and you have to help them. If you like music simulators, j-pop music and, of course, anime, you'll like this game. When you play the 2 players mode, the player and the supporter shares the same music counter, and the results are based on the performance of the 2 players. - Game Modes: SCENARIO - The main game mode. In this mode, it will be composed of \"scenarios\" that you will choose where the band goes to tour. More details on the HOW TO PLAY section. 2 PLAYERS - Basically, is a 2 players scenario mode. EXTRA - This mode allows playing a different style of game. The objective of the Extra mode is very simple, the band is making a concert and you must satisfy your fans. But the fans are very hard to please and every single mistake you made on the game, thus on the song, one fan will leave the concert. If every fan leaves the show the game is over. - OPTIONS - The options only had a ranking mode and a secret file mode. Ranking - If you select the ranking, there are two choices: Score or record. On the score screen you could see the game mode (scenario or 2 players), total of points received on the 4 scenarios, and the instruments used on each scenario. The record screen shows each song, the best EX percent of each character and the max EX of each character. Secret file - The secret file gives you a sound test, a movie test and a voice test. But first you have to earn them.", "platform": "Sony Playstation", "release_date": "February 24, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Enix", "publishers": "Enix", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98395-kaikan-phrase-datenshi-kourin\n"}