{"altername_name": ["The Rapid Angel"], "name": "Kaisoku Tenshi: The Rapid Angel", "overview": "The Rapid Angel (aka Kaisoku Tenshi - The Rapid Angel) comes from the same platformer fold that classics such as Valis, Makeruna Makendo and Ninja Warriors sproted from. Like those earlier offerings, the goal is to move across the screen and attack enemies and obstacles alike. The biggest difference with other beatem up games is the 2 player mode in which the 2nd player takes the role of the angel and can help the first player character during the game. CHARACTERS: 3 heroines to choose from: Natsumi, Ayane and Haruna. Each of these girls fights in her own personal style. The way they fight and defend themselves vary immensely and give the game 3 completely different ways to be played. 1 - Natsumi fights with her fists and feet. Rapidly pushing the attack button links punches and kicks together to create combos. You can also do a downwards kick while jumping by pressing down+attack in the air. She can block hits by defending with her steel plated arm protectors. While running, she can also perform a jumping kick. 2 - Ayane uses a sword to fight and defend herself. Most of her moves are similar to Natsumi's except she has a spinning sword attack when attacking in the air. 3 - Haruna. When playing with her for the first time, she may appear to be the weakest character. Perhaps to a point where one may think she is useless. But first impressions couldn't be further from the truth. She is the most versatile character in the game. Haruna doesn't use close combat moves, instead she throws pins at her adversaries. Which don't inflict a great deal of damage. For her second attack you need to hold down, then press attack, she will throw a card that shoots forwards along the floor and explodes when it makes contact with an enemy. This attack can be charged up to do more damage. Her defensive move is a magic shield which hurts enemies when they touch it, but takes a second to charge up. Her dash attack ends with her tumbling and falling face first in the dirt. Told you she wasn't good in physical attacks. She also can take 3 different stances, from which very powerful attacks are possible. But using these stances in the heat of battle might be a bit tricky, so practice will be necessary to get the most out of them. The first stance is done by holding the L2 button. While doing this you must rapidly tap the attack button 4 times. Haruna will then shoot a little magic bomb which will stun enemies. Leaving them open to your attacks. Her 2nd stance is with R1. Keep this pressed and she will hold up a scroll. Now rapidly tap the attack button 8 times to summon a female warrior who will deliver 3 devastating blows. Her last stance uses the R2 button. Hold this down and rapidly tap the attack button 6 times. With this she sets the ground on fire just before her feet.", "platform": "Sony Playstation", "release_date": "August 13, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Techno Soleil", "publishers": "Techno Soleil", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.71", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98396-kaisoku-tenshi-the-rapid-angel\n"}