{"altername_name": ["Legend of Kartia", "Rebus"], "name": "Kartia: The Word of Fate", "overview": "A turn-based, strategy RPG, Kartia presents players with two disparate, yet intersecting storylines: one as the shrine warrior, Lacryma Christi; the other as Toxa Classico, an arrogant knight. Having selected a character, players embark on a journey spanning 18 chapters, each of which is preceded by pertinent dialogue and FMV scenes, the former accompanied by character portraits from Yoshitaka Amano (best known for his work on the Final Fantasy series). The titular Kartia represents the lifeblood of the world of Rebus, as it is from this that almost anything can be created. Prior to and during each skirmish, Kartia can be used to fashion spells, equipment, and phantoms by assembling the various elements each entity requires. Everything created in the game comprises three elements: the necessary text, proper grammar and the Kartia on which to write it (three forms of Kartia exist, namely, Silk, Mithril, and WorldTree, each more powerful than the last), and it is these elements that are most sought after throughout the game. Phantom creatures, the foot soldiers of the piece, are aligned according to Common, Doll, and Shadow types, and analogous to the simple Rock-Paper-Scissors game, each fares better or worse against a one of the others. Although expendable in battle, phantoms will, like their human counterparts, gain in experience over time and increase in power and ability. The battlefields on which players engage the enemy are susceptible to damage, and excessive spell use will scorch the land, burn trees to the ground, freeze bodies of water and deform the terrain. Additionally, players can trade items with a friend or compete in two-player versus competition using their save data from the single-player adventure. Features: * Customize your party by creating spells, equipment, and phantom warriors with Kartia elements * Compete against a second player in versus competition or trade items via memory card * Features character designs by famed Final Fantasy artist, Yoshitaka Amano", "platform": "Sony Playstation", "release_date": "August 10, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "Atlus", "publishers": "Atlus", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.69", "wikipedia": "https://en.wikipedia.org/wiki/Kartia:_The_Word_of_Fate", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/532-kartia-the-word-of-fate\n"}