{"altername_name": [], "name": "Kaze no Notam: Notam of Wind", "overview": "Kaze no NOTAM - NOTAM of Wind is a hot air balloon simulator in a fantasy setting. As a hot air balloon operator you'll be left mostly to the mercy of the winds having no control over your balloons movements on the X or Y axis. Only the Z is open to you by letting off your burner and ascending or releasing hot air and lowering yourself to earth. The wind changes at different altitudes, you'll be aware of the way it's blowing at every height thanks to a wind compass on the right side of the screen, so you'll have to make shrewd use of it to get where you're going. You have green markers that can be used for a variety of things. The game enters a first-person gondola view whenever you prepare to throw a marker. The game allows you to select the weather conditions and time of your outing as well as the locations. The three locations are: - Drafty Valley, a valley peppered with castles and other memories of a bygone time. - Windy City, a modern metropolis with airports, stadiums and office buildings. - Breezy Earth A mysterious presentation of the Earth's and mankind's future. All of these areas are peppered with strange things to see and explore, such as unusual dirigibles, mad auroras, sand drawings, and ancient ruins, to name a few. The game has several \"Try Tasks\" which the player can set records on and then try to beat, or ignore and drift lazy as a cloud. The tasks are: * Fly In: in this task you'll have the skillfully use the winds to get your craft to hover over a terrestrial target. Once their you'll try to throw a marker at it. The goal is to be as accurate as possible, a difficult thing as your balloon moves with the wind, and you can't stop the forces of nature. * Try Delta: a competition of flight distance. You'll have three markers, which once dropped will measure the area of the triangle they form. This shows the surface area covered in your journey, assuming you wisely used your markers, the larger it is the better your score. * Wolf Hunt: this is a timed task in which you'll be hunting down whimsically shaped balloons, e.g. chickens, and marking them. The faster you can hunt down all six the better. These wolf balloons will appear in bright yellow on your map to help you hunt them. The game also features a \"Round Mode\" in which you have to try to beat nine specific goals or \"rounds\".", "platform": "Sony Playstation", "release_date": "September 11, 1997", "game_type": "Released", "esrb": "", "developers": "ArtDink", "publishers": "ArtDink", "genres": "Vehicle Simulation", "max_players": "2", "cooperative": "No", "rating": "3.29", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109784-kaze-no-notam-notam-of-wind\n"}