{"altername_name": [], "name": "Kero Kero King", "overview": "Kero Kero King if sports game that is a sort of a golf game but using a frog instead of a ball. The Kero Kero King is the champion of that Kero sports. The game is about guiding the frog named Kero across obstacle-laden courses by gauging wind velocity, tweaking direction and adjusting height and jump. Although it's not exactly golf, many principles from that sport of choice are found in this game. The ‘Kero Kero’ of the title comes from the onomatopoeia for the sound a frog makes. But no wonder the frog is squawking as it gets hammered around the course in a game of croquet with frogs instead of balls. Various conditions to consider too like in golf such as the wind direction or the fact that the ball is a frog and will jump off spiders webs or launch at passing flies. Allows players to enjoy their own characters in versus mode too. You can buy items off of the players you beat like their frogs, hammers, and clothes. There are 10 courses and 3 opponents per level, and 10 rounds per opponent, the one with the highest score at the end wins. Once you beat all 3 oppenents on the level you move to a new level to face 3 more with 10 new courses. You can buy frog power boosters and antidotes, but you can only have 4 items per opponent, so if your frog gets posioned you can cure him without missing a turn or give him a quick power boost for a long shot. The game got a sequel in the Playstation 2 console (called Kero Kero King Super DX or Ribbit King in Europe & in the United States), and other games of this serie were released for the Nintendo DS or Gamecube consoles (Kero Kero King DX).", "platform": "Sony Playstation", "release_date": "December 10, 2000", "game_type": "Released", "esrb": "", "developers": "Amedio", "publishers": "Media Factory", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "2.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98397-kero-kero-king\n"}