{"altername_name": ["Kid Clown no Crazy Chase 2: Love Love Honey Soudatsusen"], "name": "Kid Clown in Crazy Chase 2", "overview": "An arcade class platform action game that puts you in the shoes of Kid, who has to run, scoot, dash and duck his evil and persistent pursuer. Series story: Kid Klown in Night Mayor World, known in Japan as Mickey Mouse III: Yume Fuusen 3, is a platform game for the Nintendo Entertainment System released in April, 1993. It was developed and published by Kemco. It is the first game in the Kid Klown series Kid Klown was originally a Mickey Mouse game in Japan. Released as part of the mostly Game Boy Mickey Mouse series, Mickey Mouse III: Dream Balloon was released in September 1992 by Kemco in Japan for the Famicom. Due to copyright issues, it was changed to Kid Klown in Night Mayor World for its US release. Other games in the Kid Klown series include Kid Klown in Crazy Chase for the Super NES (also released for Game Boy Advance simply as Crazy Chase, the Japan-exclusive Kid Klown in Crazy Chase 2: Love Love Hani Soudatsusen for Sony PlayStation, Soreike! Kid: Go! Go! Kid for the Game Boy Color (later re-released as Bugs Bunny in Crazy Castle 3) and The Bombing Islands for the PlayStation. Kid Klown, the main character in Kid Klown in Crazy Chase, is the klutziest clown on Clown Planet, a world inhabited by clowns. Kid Klown must rescue the kidnapped Princess Honey from the evil pirate Blackjack. Kid Klown catches up to Blackjack in his spaceship, but instead of firing on his enemy, he accidentally hits the Panic Button, blowing his ship up. Now you must help Kid Klown make his way through different levels avoiding traps and enemies, while doing so before the bombs that Blackjack sets go off. In addition, you will periodically face Blackjack himself throughout the levels. To successfully finish each level, you'll need to beat the fuse. What is the fuse? At the start of each level, there is a bomb fuse at the same location as you are, you must get to the end of the level faster than it does in order to prevent the big bomb from going off. In addition, you'll also need to find all 4 card symbols before you can finish. If you don't, you'll get to go to the beginning of the level and have another try.", "platform": "Sony Playstation", "release_date": "December 6, 1996", "game_type": "Released", "esrb": "", "developers": "Kotobuki System", "publishers": "Kemco", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82129-kid-clown-in-crazy-chase-2\n"}