{"altername_name": ["Mobile Suit Gundam: Char's Counterattack", "機動戦士ガンダム 逆襲のシャア"], "name": "Kidou Senshi Gundam: Gyakushuu no Char", "overview": "Mobile Suit Gundam , also known as First Gundam, Gundam 0079 or simply Gundam 79) is a televised anime series, created by Sunrise. Created and directed by Yoshiyuki Tomino, it premiered in Japan on Nagoya Broadcasting Network between April 7, 1979, and lasted until January 26, 1980, spanning 43 episodes. It was the very first Gundam series, which has subsequently been adapted into numerous sequels and spin-offs. Mobile Suit Gundam: Char's Counterattack is a 1988 anime film set in the primary Universal Century timeline of Gundam, taking place in U.C. 0093. Making its theatrical debut on March 12, 1988, Char's Counterattack is the final culmination of the original saga begun in Mobile Suit Gundam and continued through Mobile Suit Zeta Gundam and Mobile Suit Gundam Double Zeta, marking the final conflict of the fourteen-year rivalry between Char Aznable and Amuro Ray, and the end of the EF/Zeon conflicts. The movie is based on the novel by Yoshiyuki Tomino. In addition to being the first original Gundam theatrical release, Char's Counterattack was also the first Gundam production to make use of computer graphics during a five-second shot of a colony rotating serenely in space. Char's Counterattack made its American debut on January 4, 2003 at 11 p.m. on Cartoon Network's Adult Swim. The year is 0092. Advances in human technology have transformed the world. Mankind has built colonies in which they reside. But with peace comes-Doubt, disbelief, and eventually war. A group of colonies (similar to Axis) Have named them Zion. Fearing Zion, they have built \" Mobile Suits\", giant Robots capable of destroying anything in their path. Fortunately, they were used for good. The first Mobile Suits were called GMs. They stood for general machines. But plans for Mobile Suits leaked into the Zionists. They created Zakus; one-eyed Mobile Suits carrying beam machine guns. They say, \"If you look at the eye, you were dead.\" So the Earth defense forces experimented with a new type of Mobile Suit. A beam rifle here, a Vulcan there, and maybe a beam saber or two. Thus, they Created the!K(drum roll please) GUNDAM!!! (Overture1824 would be so appropriate) Code named RX-78-2, the Gundam was the ultimate Mobile Suit. Or so they thought. Only you can find out. Will you defend your planet or destroy it? Gundam or Zaku? The year is Universal Century 0093. Five years have passed since the first Neo Zeon movement. The Federation has recovered from its defeat and has created a new anti-colonial special forces unit to deal with rebel forces: Londo Bell. Elsewhere in space Char Aznable re-appears out of self imposed hiding with a declaration that he now commands his own Neo Zeon movement. Unlike movements of the past, Char intends to force the emigration of Earth's inhabitants to space by bringing about an apocalypse. Faced with a renewed space war the Earth Federation tasks Londo Bell to suppress Char’s uprising before it can gain momentum. When Neo Zeon forces agree to surrender in exchange for the abandoned mining colony Axis the Federation believes that the crisis has been averted; however Londo Bell forces think otherwise, and when the asteroid unexpectedly begins moving toward earth Londo Bell’s worst fears are realised. With Neo Zeon forces poised to win, and the Federation unable to reinforce Londo Bell the fate of Earth once more rests with Amuro Ray and his RX-93 Nu Gundam.", "platform": "Sony Playstation", "release_date": "December 17, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "BEC", "publishers": "Bandai", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98399-kidou-senshi-gundam-gyakushuu-no-char\n"}