{"altername_name": ["KKND2: Krossfire"], "name": "KKND Krossfire", "overview": "One hundred years ago, a great nuclear war ravaged the entire planet . . . survivors were few. Those that rose from the ashes of the nuclear wastelands were split into two factions, the Survivor Army, who had the common sense to disappear underground during the worst of the nuclear winds. The Evolved, on the other hand, were not about to scurry, rat-like, into the depths of the subterranean haven. They decided to brave the harsh conditions of the once fertile planet. However, the nuclear toxins changed this once proud people into half-crazed mutants that scavenged the land for over half a century . . . Forty years ago, long after the planet started to cleanse itself of the poisonous radioactive winds, the Survivor Army emerged from the darkness . . . their goal? To wrestle control of the surface from the clutches of the chaotic mutants. A bloody war ensued which would be known as the 'Great Surface War'. It ended almost as suddenly has it had started, with the remnants of the Survivor Army disappearing back into their underground world. The Evolved, of course, claimed total victory. The Survivor Army claimed that the world was not yet ready for the taking. The outcome? Unresolved . . . until now! The 'New Survivors' have once again emerged to take on the crazed hordes of 'The Further Evolved' for total domination of the planet. This time, a new adversary has entered the fray, The Series 9 robot army! These once peaceful automated agricultural slaves, whose lives were turned upside down by the destruction of their crops, have decided to wreak vengeance on their human aggressors! Finally, a formidable computer opponent to challenge the smartest cagey old vet. Battle an artificial intelligence that probes your defenses, retreats, sets ambushes, and even attacks on multiple fronts improving their damage potential and accuracy. Eventually even the ability to heal themselves all in an immersive 3D rendered landscape where you can drive under bridges for cover or up onto mesas for higher ground.", "platform": "Sony Playstation", "release_date": "April 10, 1999", "game_type": "Released", "esrb": "", "developers": "Beam Software", "publishers": "Infogrames", "genres": "Strategy", "max_players": "2", "cooperative": "No", "rating": "3.31", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/89948-kknd-krossfire\n"}