{"altername_name": ["KoroKoro Post nin"], "name": "Korokoro Postnin", "overview": "In Korokoro Post Nin the player controls Akane, a newspaper delivery girl, and she has to deliver a paper to each mailbox on the stage before she can use the exit. Since her newspaper delivery route covers a crazy topsy-turvy neighborhood with no fixed up or down, it's a good thing that the player can rotate the world around herself at will, so that no matter which way the player wants to go it's always downhill as far as he's concerned. Of course, the player has got to watch out that he don't rotate something nasty like spikes, carnivorous plants, or vending machines in his way, and he certainly want to collect all the spare change and lucky cat statues lying around. Oh, and deliver papers to all the houses within the time limit so that he can continue on to the next neighborhood, of course. Rotating the entire screen around your character at will is a slick and impressive effect apparently handled effortlessly by the ol' PS1 and while it takes some getting used to, it quickly becomes near second nature. Akane will run faster if she's touching the wall than if she's in free fall - meaning you spend a lot of time hugging the walls rather than drifting across open spaces to your goal. There's a small radar showing the un-delivered mailboxes in the corner, which comes in very handy in later levels. Every time she delivers a paper she shouts \"Shinbun!\" Shinbun is, of course, Japanese for \"newspaper\". There are occasionally enemies in your path, and the only way to kill them is to tilt the platform so steeply Akane runs through them. She makes a happy sound and a 'motion trail' follows her when she reaches this speed. There are also barriers that need to be smashed this way later on.", "platform": "Sony Playstation", "release_date": "October 17, 2002", "game_type": "Released", "esrb": "", "developers": "Media Entertainment", "publishers": "Media Entertainment", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81991-korokoro-postnin\n"}