{"altername_name": [], "name": "Kosodate Quiz Motto My Angel", "overview": "Kosodate Quiz Motto My Angel is the sequel to the Playstation conversion of an Arcade machine (released by Namco on Seta 2nd Generation coin-op hardware) of the same title featuring a new intro movie sequence that wasn't on the original arcade game. The game it’s a multiple-choice trivia game that places you in the role of a proud new parent raising a child in 1990s Japan. Depending on what kinds of questions you answer correctly, the personality of your child will change. She might turn out to be a pretty girl, a pretty girl with short hair, a pretty nerd, or a pretty girl with a mischievous streak. The possibilities are endless. After each round, you can participate in a relaxing and character-building activity with your child, like buying them a picture book, going for a walk, or strolling through the zoo. According to the game progress screen the player can raise his daughter until she’s 60 or 70 years old if he's good enough. Kosodate Quiz Motto My Angel features different game modes since with the classic Kosodate mode of raising a child the game have a dating quiz mode in which the player can take the role of a 10 years old girl or boy that will have her (or his) first love. In this mode the love between these boys will grow if the player select the proper answers. The player can take the role of the boy or the role of the girl. The classic Kosodate quiz mode of raising a young girl features a lot of different events and different ways of see the young girl raise. The game features also japanese voice acting.", "platform": "Sony Playstation", "release_date": "March 25, 1999", "game_type": "Released", "esrb": "", "developers": "Namco", "publishers": "Namco", "genres": "Quiz", "max_players": "", "cooperative": "No", "rating": "1.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134950-kosodate-quiz-motto-my-angel\n"}