{"altername_name": ["Koukidou Gensou Gunparade March"], "name": "Koukidou Gensou GPM: Gunparade March", "overview": "Koukidou Gensou GPM - Gunparade March is a Japanese video game that was later turned into a 3 volume manga and a 12 episode anime. The video game, Koukidou Gensou Gun Parade March was released on September 28 of 2000, for the PlayStation video game console. It was developed by Alfa System and published by Sony Computer Entertainment. Due to its creativity and attention to detail, it won the prestigious Seiun Award in 2001. The manga by Hiroyuki Sanadura was serialized in the magazine Dengeki Daioh. The three volumes published by MediaWorks between 2001 and 2003 were translated by ADV Manga between 2004 and 2005. The anime, Gunparade March: The New March,which was produced by J.C.Staff was broadcast on MBS from February 6, 2003 to April 23, 2003. It is licensed for distribution in the United States by Media Blasters as simply \"Gunparade March\". In 1945, World War II was abruptly ended when an alien race appeared on Earth and began to slaughter the human population. This alien force, known as the \"Phantom Beasts\" (or Genjyu in Japanese) had effectively taken over more than half of the Earth. The year is 1999 – 54 years later, mankind is still fighting to survive against the alien forces. Earth forces now use advanced mecha called Humanoid Walking Tanks (HWTs) to combat the invaders, but throughout the ordeal, far too many pilots have been killed in action. To ensure the future of the human race, the Japanese government enforced a student draft which recruited high school students to become HWT pilots. Gunparade March follows the lives of the 5121st Platoon, which consists mainly of drafted high school students and their struggle to defeat the Phantom Beasts and at the same time, lead a normal social life. They are young people such as Atsushi Hayami and his high school class, also known as Unit 5121. This new generation fearlessly struggles on with the aid of the HWT humanoid combat machines and the devastating PBE bomb. - Atsushi Hayami: One of the main protagonists in the story and an HWT pilot. When he meets Mai, he develops an interest for her and gradually becomes infatuated with her. However, his timidity prevents him from admitting his true feelings and publicly, he considers her as a \"good partner on the job\". As an HWT pilot, his attributes are quite balanced and this caused him to be teamed with Mai for piloting the two-seater \"Tandem\" HWT. However, Hayami tends to be nervous during battles and has the habit of messing up. - Mai Shibamura: Another main protagonist in the story and an HWT pilot. Mai was a transfer pilot to the 5121st Platoon. Her skills as an HWT pilot are at near perfection. However, her teamwork is as relatively poor as her communication skills. Later on, Mai reveals that is the daughter of the head of Shibamura Industries. The game and anime take place in the Kyushu province of Japan, where many (if not all) sites are modeled after their real-life counterparts. For example, the Kumamoto Castle, where one defensive mission takes place (game only), is a famous landmark of Kyushu. Others, like 'Ajinoren', a local restaurant, and 'Shoukei' Highschool, the protagonists' main base of operations, are both actual locations.", "platform": "Sony Playstation", "release_date": "September 28, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "AlfaSystem", "publishers": "Sony Computer Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109816-koukidou-gensou-gpm-gunparade-march\n"}