{"altername_name": [], "name": "Kyoufu Shinbun", "overview": "Kyoufu Shinbun is the Playstation One game is based on a manga series about a mysterious newspaper that reports on deaths and calamities that will occur in the future. Unfortunately, reading the newspaper also shortens one's life to 100 days. The game was created based on input from the original mangas author. In Kyoufu Shinbun you play the game as a character who has begun to receive a subscription, well its thrown through the glass of your window, to a mysterious newspaper. This daily publication \"Horror Newspaper\" predicts disasters and deaths. A strange violent poltergeist, represented by an oddly elongated spectral face, follows you and seems to have a connection with the paper. You'll interact with a number of people mentioned in the paper and try to safely navigate the games story while trying to unravel the mystery of this \"Horror Newspaper\" The game features different stories for the player to watch and decide the ending depending of his choices during each adventure. The manga also got a Playstation 2 game by Konami called Kyoufu Shimbun Heiseiban Kaiki! Shinrei File. Manufacturer's description: Jiro is one of the popular cartoon ?horror adventure horror of newspapers faithfully reproduced. A taste of horror immersive 3D sound. Be delivered every day, 100 days shrink every time they read newspapers \"fear\" to stop, Iki witnessed a variety of psychic phenomena, and utilizing the wisdom and courage, spirit exorcism prior to end of its life. Features: •First & third person perspectives. •2D & 3D graphics •Cartoon graphics •Detective, Horror, Mystery & Anime themes.", "platform": "Sony Playstation", "release_date": "January 24, 1997", "game_type": "Released", "esrb": "", "developers": "Yutaka", "publishers": "", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134313-kyoufu-shinbun\n"}