{"altername_name": [], "name": "LEGO Racers", "overview": "As the first LEGO product for the PlayStation game console, LEGO Racers combines the creativity and imagination of virtual LEGO brick construction with a high-speed racing game. Published by LEGO Media International Inc. and developed by High Voltage Software Inc., the game is the first LEGO Media software title to be available on the PlayStation, Nintendo 64 and the PC. Players can customize their own LEGO race cars using authentic, virtual LEGO bricks from the LEGO Garage. Once the car is built, players can challenge another player or up to five other popular LEGO characters on 12 tracks based on the following LEGO toy play themes: Space, Pirates, Adventurers and Castle. A unique system of power-ups provides players with numerous ways to gain the upper hand, as do hidden shortcuts and secret pathways on each track. Once players have mastered the game, they go head-to-head against the Rocket Racer, the all-time LEGO world racing champion. Other familiar LEGO characters include Alpha Dragonis, Sam Grant, Rob 'n' Hood and Captain Redbeard. Each of these LEGO Racers champions have their own personality and racing style that players need to become familiar with in order to defeat them on their home turf. Racing tracks in the game include Dark Forest Dash, Magma Moon Marathon, Tribal Island Trail and the Desert Adventure Dragway. Track hazards and tight corners present other obstacles that players need to master. Each track has its own set of unique hazards that need to be overcome in order to be a winner. For example, there are LEGO barrels that can be shot away to reveal a short cut, or lava geysers to avoid in Magma Moon Marathon. LEGO Racers for the PlayStation game console can support two players in head-to-head action and the Dual Shock analog controller. The PC CD-ROM and Nintendo 64 versions of LEGO Racers were released in September 1999 and October 1999 respectively. These games had already received the following awards when the PlayStation game launched in December 1999: the Oppenheim Toy Portfolio Platinum Software Award, the CBS Toy Test, Top Five Computer Games and the Kids Domain Gold Award.", "platform": "Sony Playstation", "release_date": "December 17, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "High Voltage Software", "publishers": "Lego Media", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.34", "wikipedia": "https://en.wikipedia.org/wiki/Lego_Racers_(video_game)", "video_link": "https://www.youtube.com/watch?v=syu_TwsGOpw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9078-lego-racers\n"}