{"altername_name": ["LEGO Insel 2: Der Steinbrecher kehrt zurück", "LEGO Eiland 2: De Wraak van Dondersteen", "LEGO Isola 2: La Rivincita del Briccone", "L'ile LEGO 2: La Revanche de Cassbrik"], "name": "LEGO Island 2: The Brickster's Revenge", "overview": "As a follow-up to the first LEGO Island PC title, LEGO Island 2: The Brickster's Revenge features Pepper Roni, a pizza delivery boy that players control, trying to save LEGO Island from the evil Brickster. The Brickster has dismantled the Infomaniac's building instruction book, known as the Constructopedia, and only Pepper can find the pages. Meanwhile, as if The Brickster and the havoc he wreaks aren't bad enough, Pepper has to keep his day job delivering pizzas. While exploring LEGO Island, clues and information must be obtained from the inhabitants. Playing as Pepper, gamers skateboard, walk, or otherwise transport themselves around the island, talking to people, solving puzzles, and playing a variety of sub-games. Bull fighting, jousting, driving, and flying are just some of the activities included in the sub-games. After winning enough mini-games and successfully navigating all areas, Pepper will be faced with the challenge to defeat The Brickster in one last game. If Pepper can avoid the falling bricks while clearing a path to The Brickster, he can throw pizzas that will splat the villain into submission. Other features and areas of the game include an inventory screen, Pepper's house (built with bricks he acquires during play), and additional pickup items for later use. Constructopedia pages must be collected in their entirety; gems and goblets increase scores, and medals can be earned based upon performances in sub-games.", "platform": "Sony Playstation", "release_date": "March 26, 2001", "game_type": "Released", "esrb": "", "developers": "Silicon Dreams", "publishers": "Lego Media", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/20614-lego-island-2-the-bricksters-revenge\n"}