{"altername_name": ["Lifescape 2: Body Bionics: Kyoui no Shouuchuu Jintai"], "name": "Lifescape 2: Bodybionics", "overview": "In the future, there is a cyber space created through advanced computer technology, and in this space exists a model of the human body meant as a simulator for medical experiments. However, after an accident the model body has gone out of control, and a cyber diver has been sent inside to and find and fix the source of the problem. Lifescape 2: Bodybionics is a 3D action game loosely based on the 1989 documentary series Kyōi no Shōuchū: Jintai (\"The Amazing Microcosm: Human Body\") produced by NHK. It is a sequel to Lifescape: Seimei 40-okunen Harukana Tabi, but rather than the history of life on Earth, it focuses on the inner workings of the human body. It is a third-person shooting game where each stage is set in a different body part, such as the stomach, lungs, or brain. In each stage, the player can walk or hover around, shoot enemies and obstacles, and collect various items — some will restore the player's oxygen, some are needed to unlock certain gates, and some simply give the player educational information about the human body. Each stage has one or more gates leading to different body parts and different routes through the game. The goal of the game is to explore each stage to collect all the DNA, and ultimately reach the brain to defeat the source of the problem. In addition to the main game, there is also a data mode where the player can review all the information tidbits picked up in the main game to learn more about the human body.", "platform": "Sony Playstation", "release_date": "August 7, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "NTT Learning Systems", "publishers": "MediaQuest", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82128-lifescape-2-bodybionics\n"}