{"altername_name": ["Linda^3 Again", "Linda 3 Cube Again"], "name": "Linda Cube Again", "overview": "Linda Cubed is an esoteric horror RPG released for the Playstation in Japan. It is based around the adventures of a man and woman who attempt to capture creatures while an asteroid hurdles towards Earth. Linda Cubed Again is an esoteric RPG from the past that combines horror with monster collection in a new and unique way. Neo Kenya is the name of a world that is endanger of being completely annihilated by an asteroid. The armies of Neo Kenya have searched for every conceivably way to prevent the coming catastrophe. When the inhabitants of the world turn to a dark god, their prayers and nightmares come true. Linda Cubed Again is a game which combines monster collection and traditional role playing. Originally realeased for the PC-Engine back in 1995 under the title of Linda Cubed, this game attempted to mix two genres. You start the game off with two characters, Linda and Ken. Ken is an army soldier tasked with the job of catching monsters; and his girlfriend Linda, who is used by the military as a surrogate for the god's plans The inhabitants of the Neo Kenya called upon a god by the name of Anubis (obvious reference to lord of the underworld) in order to protect them from imminent destruction. Apparently answering their calls, the dark god sent an Ark similar to Noah's Ark. He demanded that a man and a woman gather two of every animal on the planet. The army nominated Ken and Linda in order to achieve this task. over the course of the game you run into a number of odd characters such as a twin who has a fondness for Linda and there are many other crazy characters. After a brief introduction to the plot, you set out to capture monsters. Capturing monsters is the deviced used to advanced the plot, as you're given a set number of missions that you're supposed to complete. Voice actress Minami Takayama supplies the voice of the heroine Linda. Minami also provides the voice for the half-pint sleuth Conan Edogawa, Pit in Dairantou Smash Bros, Mitos in Tales of Symphonia, and many other roles in assorted anime and video games. » To view the in-game bestiary, press the R1-Trigger. » When fighting animals, the goal isn't to kill them but to subdue them. » Once an animal is subdued, it may be sold for cash. » Animals may also be used to make weapons, armor, or turned into food. » Food is used in the world of Linda³ to heal characters", "platform": "Sony Playstation", "release_date": "September 25, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "AlfaSystem", "publishers": "Sony Computer Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93835-linda-cube-again\n"}