{"altername_name": [], "name": "Little Lovers: She So Game", "overview": "Little Lovers - She So Game first came out for Windows 95 by NTT on February 21, 1997, as life simulation (not love simulation) with only three characters, Sayuri, Aya and Kurumi. I believe it is a little sister simulation game. Little Lovers 2nd ~Yui just came out last year. GAME SYSTEM: The game lasts three years (more specifically, the game actually ends after the second school term of the third year). In the beginning of the game, you choose a girl out of six girls (3 girls on each disc), where the four of you are going to compete for her heart. Then, you choose how many human players and how many computer players. There can only be four players with at least one human player. Then, you enter your name, age, blood type, face and starting stats. After that, you ask if you like the current order of the turns. If not, they win randomly reorder you once. After that, the table game starts. A roulette, where you can determine what to do next, increase your parameters, go to club, gamble, buy cards or rest. Well, it's a table game, after all. Well, this is a four-players game. Unless you have a multi-tap and four controllers, you will probably playing against computer players. Each computer players have their own personality and advantages, as they begin the game. For example, Kobayashi-kun, one of the weaker computer player, begins the game with high Manly Parameter, is a Kendo club member and is a computer player who will never do anything to harm another players. Tanaka-kun, on the other hand, is a Literature club member and a computer player that will DO anything to harm the other players. Harm other players, I mean, spreading rumours, using random cards when another player is set to go on a date, etc. PARAMETERS: There are five personal parameters that you have to look out for, Knowledge Parameter, Athletic Parameter, Artist Parameter, Morality Parameter and Sensitivity Parameter. Of course, each girl has their own parameter requirements for each school term before you can go out on a date with them or meet the girl. If you did not meet the girl, somebody will come out and tell you what you are lacking. In addition to that, having high Athletic Parameter will help you win the Sports' Day Event and Swimming Event. Other than that, if you have the highest Artist Parameter among the four of you, Aya-chan will ask you for your opinion about her painting in the second year Bunkasai or Cultural Festival. There are two other parameters and it is recorded as ranking. They are the Manly Parameter and Popularity Parameter. They depend on your five personal parameters, how well you do in tests, how well you do in events and how well you do in club activities. Girls don't date guys who are unpopular and not manly. I find the best way to increase these two parameters is to win Inter-High (IH) for the sports' club and the non-sports have their own event. The time when these events take place is listed in your schedule. CARDS: The cards are very important elements in the game. You have to get card to ask a girl out for a date. You also can use card to spread bad rumors about your opponents or prank calls to the girl as if it is from your opponents. Doing this kind of this will reduce your Manly Parameter and your Morality Parameter. There are also cards that prevent you from getting sick and lose a turn. Of course, there are cards that increase your parameters. Of course, there are more and this makes the game somewhat interesting. However, you can hold up to five cards and up to six cards during the term (You have a special spot for the Confession Card during the last term). EXAMS: When I first played the game, I concluded that this game is crazy. Especially, the test questions. They give 2 or 3 seconds to read the LONG questions and about 10 seconds to answer the multiple questions. 10 seconds part is not the worst part yet. You have to answer the question very quickly, if you want to get high score. Basically, the faster you answer, the higher is your score, helped a little bit by your knowledge parameter. After about 6 seconds or so, the game will give you the answers that the other players choose. Playing against smart computer players, it is tough. However, choose the weak opponents like Kobayashi-kun, it is easy to win him. Not only that. Some of them are really tough. The questions are from different subjects, including Math, Japanese Literature, Japanese Language, English, Chemistry, Girls' Information and History of the Game (For e.g., when did the game first released and for what platform?). Question like ''Given this Kanji, how many strokes are there?''. That is a question is still okay, but the time is the problem. It is tough. Especially when you go after Yukie-chan, where if you got Rank B (Rank more than 200 out of 400), you get a penalty. CLUBS: There is a lot of clubs that you can join and different clubs increase different parameters. Of course, all the sport's Clubs increase the Athletic Parameter. How much you increase depends on the round roulette and once in a while, there are competitions or practice matches, where you have multiple roulette that you have to clear (missing one roulette means failure). Once you get used to the round roulette, it is easy. There are several different speeds that the roulette can be. So, if there are several round fast roulettes, it is easy to make mistakes, especially in IH, where there is a time limit. FEMALE CHARACTERS: As with any dating games, depending on whether the heroines can capture the players' heart or not will determine how the players enjoy the game. In my opinion, the heroines are a bit stereotypical, but yet, they got the abilities to steal your heart away. - Shindou Yurika-chan, the girl on the cover of the game, the reason I bought the game. :D She is the outgoing, smart and cute. She is a model. She transferred from a very popular school to not-so-popular Midorigaoka Highschool. Why? That's for you to find out. Her popularity is clouded with bad rumors... She fooled me in her ending... It's a very nice romantic ending. IMO, she has probably the most romantic dates in the game. Even her bad date spot are pretty nice... I enjoy the dates with her the most. Hyuga Sayuri-chan is a bit like Shiori-chan (from TokiMemo) in term of abilities, but she is also kind of big sister type of girl. She likes guy that doesn't lie. She has a big burden on her shoulder and sacrificed a lot for it... When she is in blushing state, she is just too cute :D Her ending is pretty cute too, especially when she ask to hold your hand and you said you are too embarassed. Haha... And also about the ring at the end... :P I like her second year Christmas event too... Oh, her second year sports' Day event is cute too. - Sakurai Yukie-chan is the manager for the Baseball Team. Her story is pretty much like any ''seishun'' drama, aim for Koshien, the place where the best high school baseball team of each region of Japan competes for the National Title. You have to win 12 straight matches to win Koshien. Her school trip event is pretty cool. I like one of her small event, when the player is not batting well and she gave him ''Genki no Omajinai''. ''Genki no Omajinai'' is pretty common in dating games, I know, but what the player (in the game) said after that is just too funny. She is probably the easiest to win, as you can meet her easily. - Tougetsu Aya-chan has a dark past... Her story is pretty touching. She lost everything on the night of her graduation in middle school. Anyway, you four have to do your best to cheer her up. I like the school trip part, the way the four of you try to cheer her up. It's a nice event. I believe, she is one of the two girls that really gave me a homemade chocolate in person. - Ogiwara Nana-chan's story is probably the weirdest of all. She is in a band and has a boyfriend from the beginning. She likes professional guy. It is hard to tell whether she enjoys a date or not because the clue she hardly shows too much emotion. She is the type of girl who is not honest about her feelings. I am still shocked about her ending. It's just too sudden. Or am I missing something? I still have that question mark on head. :P - Matsuura Kurumi-chan is probably the best female athletic in Midorigaoka (Green Hill) High School and winners of MVP for the Sports' Day. Okay story. You need 15,000 Yen for Ski Trip, as with Aya-chan and Sayuri-chan. And for Sayuri-chan, you need at least two players in the game that have more than 15,000 Yen. DATES: Of course, next, the most important subject comes... Dates... This is a Dating Game, after all. There are two types of cards that are used for dates. First, you ask the girl out for a date using the phone card and you can choose one of the five places that you can go to for that school term. You cannot choose places that you or the other players already choose. She will accept you, if you meet certain conditions (right requirement parameters for that school term, popularity parameter, manly parameter and how much she likes you. ''How much she likes you?'' can be determined by looking at how she treated you. You can date most girls, when they start treating you as friends, but it also depends on the situation as well. For example, Yukie-chan is in love with the Yamazaki guy, so until that guy is gone from her life, you cannot date her. You need to be a ''Regular'', in order to date Yukie-chan. At the beginning of your dates, you will be ask to choose a card that you want to use to set the mood for the date. Some of the choices available are feel dangerous, cool, gentle, funny, etc. If you don't have any of these types of cards, you will skip this part and go straight to the date. Then, the date itself. If you choose a date that the girl doesn't like, you pretty much in trouble. However, some bad dates have the CGs that you need to complete the album, so don't give up halfway :D During the dates, you will be asked several questions. This helps the date to go on. I personally, not exactly sure how to determine whether the girls like your answer or not. I think, it has something to do with the smiley face on the right hand side. In addition to that, depending on how much the girl likes you and what kind of clothings she is wearing, you will get different dates or maybe extra scenes. Most of the CGs comes from dates, where the girl is in love with you. At the end of the date, she will tell you how much she likes the date. Usually, if she ask you to go out sometime again, that is a pretty good indication that she likes the date. And when she said she is tired, it pretty much indicate how boring or lousy the dates is. Then, before you parted with her, you can choose to use a card to show what kind of expression you want to show or what do you want to do before she left. The expression that you can show are smiling face or face that show that you don't want to parted with her. The things that you can do are stare straight at her, hold her hand and hug her. Hugging her is the toughest, but you can get a CG that is not for the album. I believe, it is impossible to hug a girl at the beginning. Most of the girls will just get angry. In order to hug the girl, you have to make sure that she enjoys the date a lot and she is in love with you. There are multiple endings for each girl. I am not exactly sure how the differences come about. I assume that it is caused by how much the girl like you. Oh, the differences between the endings are very minor. Well, at least for the ones I saw. There are bad ending, good ending and best ending. I got only one bad ending and that is for Nana-chan. Of course, there are the worst endings, where no players win at all or the computer players win.", "platform": "Sony Playstation", "release_date": "September 2, 1999", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135321-little-lovers-she-so-game\n"}