{"altername_name": ["Blood Factory"], "name": "Loaded", "overview": "Set against the backdrop of an inter-galactic penal colony, Loaded sees players, as one of six psychotic inmates, attempting to navigate fifteen enemy-laden levels en route to their ultimate goal; the killing of the sadistic warden -- known as FUB (Fat Ugly Boy) -- of said penal colony. The characters, with names such as Butch, FWANK, Cap N Hands, Mamma, Bounca, and Vox run the gamut from cross-dressing freaks and cyborg pirates to demented clowns and female cyber-criminals. All are rated in a handful of categories; each possessing differing speed, vitality and damage potential attributes. Armed with their character's weapon of choice, up to two players can blast their way through stages populated by fellow inmates, guards, straight-jacket laden mental patients, rats, and more. While objectives are present, the basic formula amounts to scouring each level in search of color-coded keys that will allow you to advance further into the level, while blasting hostiles and collecting ammunition and health power-ups to replenish your reserves. A small on-screen map allows you to find your way through the maze-like stages. Each character is also capable of performing a strafe maneuver to avoid enemy attacks. In addition to the rudimentary health and ammunition boxes, power-ups can be obtained that increase the power of your weapon, temporarily freeze enemies, make you invisible for a brief period of time, imbue your character with limited invulnerability, or make you faster, with unlimited ammo for a set time. Should the overwhelming tide of enemies prove too much, each character is also capable of unleashing a set number of smart bomb-esque weapons that will clear all on-screen enemies. The action is viewed from a top-down perspective, and can be zoomed in or out as desired. Coins can be collected throughout each level and at the end of each stage, you'll be given a Greed rating based upon the amount you gathered. Features: Choose from six hardened criminals, from lithe females to brutish bouncers Blast your way through fifteen maze-like levels Acquire power-ups and weapon upgrades to help keep the tides of enemies at bay", "platform": "Sony Playstation", "release_date": "December 12, 1995", "game_type": "Released", "esrb": "M - Mature", "developers": "Gremlin Interactive", "publishers": "Gremlin Interactive", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.56", "wikipedia": "https://en.wikipedia.org/wiki/Loaded_(video_game)", "video_link": "https://www.youtube.com/watch?v=E2wKbELWCSg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11113-loaded\n"}