{"altername_name": [], "name": "Lode Runner Extra", "overview": "Lode Runner for the PlayStation is two games on one disc. First, there is Lode Runner: The Legend Returns, a graphically enhanced remake of the computer classic. Secondly, there is Lode Runner Extra, a sequel of sorts that continues where the former game left off. In The Legend Returns, the once green and fertile Earth is now a cesspool of filth, made this way by centuries of pollution. What remains of humanity resides deep within caverns, searching for gold, a substance still considered valuable. With enough gold, a person can buy safe passage from the planet. Chief among these Lode Runners is Jake Peril, a man who spends most of his time climbing ladders and ropes, walking across platforms, falling off platforms, digging holes and, of course, scooping up piles of gold. As you guide Jake around the underworld, grabbing all the gold so you can progress to the next level, a subterranean cult of gold worshippers will follow you around and make your task difficult. You can dig holes to momentarily trap these Mad Monks, but you should be careful not to trap yourself or touch a monk. As you go from level to level, the gold will be harder and harder to gather as you are basically forced to figure out puzzles that will enable you to dig your way to, fall on, or otherwise come in contact with the gold. Lode Runner Extra is similar to The Legend Returns, but with the addition of bombs, goo, teleporters and other tools for use in outwitting the Mad Monks and rival Lode Runners. In this game, the monks have abducted Jake (right after he found enough gold to escape the planet) and banished him to their deepest, deadliest caverns. Once again, Jake must gather enough treasure to escape the planet.", "platform": "Sony Playstation", "release_date": "January 10, 1997", "game_type": "Released", "esrb": "", "developers": "Patra", "publishers": "Patra", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "1.9", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96541-lode-runner-extra\n"}