{"altername_name": [], "name": "Logic Pro Adventure", "overview": "Nonograms or Paint by Numbers are picture logic puzzles in which cells in a grid have to be colored or left blank according to numbers given at the side of the grid to reveal a hidden picture. In this puzzle type, the numbers measure how many unbroken lines of filled-in squares there are in any given row or column. For example, a clue of \"4 8 3\" would mean there are sets of four, eight, and three filled squares, in that order, with at least one blank square between successive groups. These puzzles are often black and white but can also have some colors. If they are colored, the number clues will also be colored in order to indicate the color of the squares. Two differently colored numbers may or may not have a space in between them. For example, a black four followed by a red two could mean four black spaces, some empty spaces, and two red spaces, or it could simply mean four black spaces followed immediately by two red ones. There are no theoretical limits on the size of a nonogram, and they are also not restricted to square layouts. As picross is traditionally played, to solve a puzzle the player must mark a box in a window of varying sizes to create the resulting picture. The numbers on the top and left side of the window guide the correct boxes to mark (for example, if the window is 10×10, and one of the numbers at the top is a \"10\", that means all ten boxes in the column below it are part of the solution to the puzzle. If the numbers \"5\" and \"4\" are at the left of the window, that means that all but one of the boxes in the row next to them are correct, with five consecutive boxes, followed by four more consecutive boxes, separated by one space). Logic Pro Adventure is a conversion of an arcade machine by Amuse World Corp released in 1999. The game features more than 1000 different puzzles, 3 different character to play with and 2 player cooperative mode.", "platform": "Sony Playstation", "release_date": "January 3, 2001", "game_type": "Released", "esrb": "", "developers": "Deniam", "publishers": "Aqua Rouge", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96540-logic-pro-adventure\n"}