{"altername_name": [], "name": "LuLu: Un Conte Interactif de Romain Victor-Pujebet", "overview": "Lulu is an interactive story \"game\" released in PC, Mac, Playstation & Saturn and is based upon Romain Victor-Pujebet The book of Lulu. Lulu was released on many formats including DVD all over the world, however this Saturn version was released in Japan only. The ideas that went in to Lulu are indeed strange. In one area you'll find a woman dressed in turn of the century clothing sitting in a desert garden accompanied by a record player and a few records. It's possible to play the records on the player which in turn sends the woman in to a dancing fit from anything from classic waltz to drum & bass! The Book of Lulu has sold hundreds of thousands of copies in Europe and Japan and won dozens of awards. Send your child on an amazing interactive journey. Characters come alive in beautiful lithographic backgrounds throughout the pages of this wonderful story that follows Princess Lulu. Haunting music accompanies Lulu's adventures as she travels with a lonely space robot through deserts, jungles, ice, and even gets lost in the very plot of the book. This unique and modern classic is the winner of a dozen awards. The Book of Lulu does not offer multiple endings or mysteries or hidden treasure as motivation for the reader to finish or to revisit it. It relies, as a good children’s book should, on an engaging plot, appealing characters, and beautiful graphics to inspire multiple readings. That said, children are not likely to return to it as they would a book, they still see it as a game, and a game you can’t win is not a good game. Manufacturer's description: By clicking various places in the book, the story Kurikkubukkugemu to proceed as if it were a movie, start to make a beautiful illustration. Lulu and tomboyish princess living in the palace, \"warmth,\" an adventure together, get a robot looking for Nemo. Click on the player's mind in this place, going to move the journey of two people. Features: •First person perspective. •2D graphics •Cartoon graphics •Fantasy theme.", "platform": "Sony Playstation", "release_date": "November 1, 1996", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135189-lulu-un-conte-interactif-de-romain-victor-pujebet\n"}