{"altername_name": ["Lupin Sansei", "Rupan Sansei", "Lupin 3sei"], "name": "Lupin the Third", "overview": "Lupin III, also known as Lupin the 3rd, is a Japanese manga series written and illustrated by Kazuhiko Kato under the pen name of Monkey Punch. The story follows the adventures of a gang of thieves led by Arsène Lupin III, the grandson of Arsène Lupin, the gentleman thief of Maurice Leblanc's series of novels. Lupin and his gang travel throughout the world to steal treasures and escape from the law. Plot: Arsène Lupin III, the grandson of the fictional gentleman thief, Arsène Lupin, is considered the world's greatest thief, known for announcing his intentions to steal valuable objects by sending a calling card to the owners of his desired items. His right-hand man and closest ally is Daisuke Jigen, an expert marksman who can accurately shoot a target in 0.3 seconds. Although Lupin and Jigen frequently work as a two-man team, they are often joined by Goemon Ishikawa XIII, a master swordsman whose sword can cut anything, or Fujiko Mine, a femme fatale and Lupin's love interest. Although Fujiko usually works together with the others, she occasionally exploits Lupin's interest in her to steal a treasure for herself. Lupin and his gang are constantly chased by Inspector Koichi Zenigata (Pops) of the ICPO, who has made it his life's work to arrest them, chasing Lupin across the globe. On the rare occasions he catches Lupin, Zenigata secretly hopes Lupin will escape so he can continue to chase him. Regardless of whether Lupin and his followers succeed or fail, they are always looking for the next heist. Lupin the Third is a Playstation game that features 4 interactive comics of the popular Monkey Punch's character.", "platform": "Sony Playstation", "release_date": "November 26, 1998", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Daiki", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Lupin_III_video_games", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128618-lupin-the-third\n"}