{"altername_name": ["Punch the Monkey! Game Edition"], "name": "Lupin the 3rd: Punch the Monkey! Game Edition", "overview": "PUNCH THE MONKEY! is a rhythm action game following the mold of Parappa the Rapper. The main game screen is broken up into three main areas. The first area contains two progress bars; the top bar consists of five colored areas. From left to right, they are red, orange, yellow, green, and blue. The second bar is an level progress indicator. The second area contains the music video of the level with an open area on the left and right side of it. The third area contains a bar with a crosshair in the middle. As the music video plays, targets will scroll left to right across the crosshair bar. Each target will have a circle, square, triangle, or X indicating what button you must press to shoot down this target. You must press the appropriate button when the target is within the crosshair. At certain points in the level, the crosshair bar will expand to two crosshairs. Targets will then fly from both the left and the right of the screen. The target sequence for a level remains the same each time you play. You get a rating for each target: Great, Good, Bad, or Poor. A \"Great\" rating is given when you hit the target while it is dead center within the crosshair. A \"Good\" rating is given is the target is hit anywhere else on the crosshair. \"Bad\" and \"Poor\" are given if you hit the target outside of the crosshair or press the wrong button. If you manage to get three \"Great\" ratings in a row, a card will will appear to the right or left of the music video. Each card is worth bonus points in your final score; shoot them down before they leave the screen. As the video progresses, you will see a bar move from left to right on the progress indicator. There are also marks indicating a level checkpoint. At each checkpoint, you must be in the yellow area of the top progress bar. The only exception to this is the final checkpoint. To successfully clear a level, you must be in the green or blue section when you clear the final checkpoint. You can also unlock two addtional modes to play. Swap mode reverses the targets you must press. Random mode is exactly what it sounds like; the target sequence for the level is now random. The bonus games allow you to build up coins. These coins can be used to purchase movies.", "platform": "Sony Playstation", "release_date": "June 22, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Music", "max_players": "1", "cooperative": "No", "rating": "4.3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96368-lupin-the-3rd-punch-the-monkey-game-edition\n"}