{"altername_name": [], "name": "Mad Panic Coaster", "overview": "In Mad Panic Coaster, you control a boy and a girl (perhaps a brother and sister?) as they sit in a roller coaster car and go through 15 hellish roller coasters. How these roller coasters even got past safety testing is unknown, as they don't have any rails or barriers of any sort. It's up to you to steer the roller coaster car using the d-pad to make sure it stays on the track. The roller coasters also have various monsters, traps, and jumps to avoid. To do this, you use X to jump. Hitting Square will make the girl throw some sort of yellow ball projectile that explodes at a long range, while hitting Circle will make the boy throw that same type of projectile at a shorter range. Falling off the track or getting hit by something will cost you health, and once you run out, you must start the level all over again. Once you make three laps around the track, a rainbow with the words \"lucky\" form around you as they come to a stop, and you move on to the next level. Every three roller coasters, a boss will be fought after completing the third lap. This boss is similar to the regular enemies, except that they take many more hits to kill. To defeat them, you has to either throw enough projectiles at them or survive another three laps. The levels take you through a plethora of locations, ranging from scary castles to the ocean to Wonderland to the inner cities. Each roller coaster has its own unique enemies, and while the game may move too fast for you to see these enemies in close detail, pausing can show that a lot of work went into these details. Most of the game is constructed out of polygons, but the boy and girl are sprites, allowing them to appear more expressive than PS1-era polygonal characters would typically allow. The music, while slightly limited in terms of variety, is fitting for what goes on in the game, consisting mainly of instrumental thrash metal and hardcore punk tracks.", "platform": "Sony Playstation", "release_date": "November 20, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Hakuhodo", "publishers": "Hakuhodo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.72", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=0fiBER2rgJQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40346-mad-panic-coaster\n"}