{"altername_name": [], "name": "Magical Drop", "overview": "Magical Drop is a series of puzzle games, primarily for the Neo-Geo and Super Famicom, developed by Data East. In 1995, Data East released a coin operated version of this game, called Chain Reaction. The latest major game in the series, Magical Drop III, was released in 1997. The games are notable for being extremely fast-paced. Magical Drop is played in a Tetris-style box; a \"stack\" of random colored bubbles descend from the top, and a player is defeated when a bubble hits the bottom. Bubbles can be picked up and dropped by the player's \"clown\" at the bottom, and are destroyed when three or more of the same color are put together on a single column. \"Chains\" are formed either when a single drop caused a chain reaction, or when more than one group of bubbles is destroyed in quick succession. The game is normally played with two players (one may be a computer opponent), and chains cause the opponent's stack to descend faster. There are 24 characters, all but the Black Pierrot being named after a tarot card (with the Strength card covering two characters). Different characters have different attack patterns. The columns of the opponent's stack will descend at different rates relative to each other depending on the character chosen. This causes a disjunction of colors that may make it more difficult for the other player to clear their stack. For example, with the character Devil, all the columns will descend at the same rate, whereas with Sun, the middle columns will descend faster than the others. The last game in the series released in the United States was Magical Drop Pocket for the Neo Geo Pocket Color in 1999. While Data East declared bankruptcy in 2003, other publishers have re-released the PlayStation titles Magical Drop 3 + Wonderful and Magical Drop F. Magical Drop III is also available on the subscription service GameTap. There are different game modes: Arcade, VS, Challenge & Endless modes. The arcade is play against different computer oppents until reach the final boss. The vs is just a game vs the computer or another human player. Challenge is solve the puzzle in a limited number of movements. Endless mode is make combinations and the game count the number of balls erased and lines and the time that you survive.", "platform": "Sony Playstation", "release_date": "January 13, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Data East", "publishers": "Data East", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.44", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24992-magical-drop\n"}