{"altername_name": ["Magical Drop F: Daibouken mo Rakujanai!"], "name": "Magical Drop F: Daibouken Mo Rakujyanai!", "overview": "Magical Drop is a series of puzzle games, primarily for the Neo Geo and Super Famicom, developed by Data East. In 1995, Data East released a coin operated version of this game, called Chain Reaction (known in Japan as Magical Drop). Despite using the English title of the game, Data East USA gave the official English names of its successors the same names as their Japanese counterparts. The games are notable for being extremely fast-paced. After Data East filed for bankruptcy and became defunct in 2003, G-mode bought and currently owns the intellectual rights to the Magical Drop franchise along with several other Data East franchises and titles. Magical Drop is played in a style and gameplay similar to Compile's (now Sega's) Puyo Puyo and Taito's Puzzle Bobble franchises; a \"stack\" of random colored bubbles descend from the top, and a player is defeated when a bubble hits the bottom. Bubbles can be picked up and dropped by the player's \"clown\" at the bottom, and are destroyed when three or more of the same color are put together on a single column. \"Chains\" are formed either when a single drop caused a chain reaction, or when more than one group of bubbles is destroyed in quick succession. The game is normally played with two players (one may be a computer opponent), and chains cause the opponent's stack to descend faster. The upward-dropping color-matching madcap Vs puzzle action is back, this time with somewhat richer colors, a more mature character art style, more playable characters, and a pseudo-RPG mode where you wander around a small world screen-by-screen in order to find and beat punks in magical drop battles, thus winning big drops with which to take over the world. Magical Drop F released in 1999, is the semi-sequel to the Neo Geo (and PS, Saturn, and NGPC) puzzle game Magical Drop III. While Magical Drop III has only seen US release via the Neo Geo arcade unit and on the Neo Geo Pocket Color (handheld), the game has garnered quite a cult following. Magical Drop F contains the standard modes from previous versions: Story Mode, Versus Mode, CPU Mode, VS Human, and Survival mode The other gameplay modes are: - Endless mode - Vs (Battle) mode", "platform": "Sony Playstation", "release_date": "October 21, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Sakata SAS", "publishers": "Data East", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4.29", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24993-magical-drop-f-daibouken-mo-rakujyanai\n"}