{"altername_name": [], "name": "Magic Carpet", "overview": "First released on PC way back in 1994, and then remade for the original PlayStation, Magic Carpet is in essence a free-movement FPS. Taking on the role of a magician on a magic carpet, you’ll run through around 50 levels, killing stuff with magic and then collecting its “mana.” Collect enough mana and the next level is opened up. The stuff being killed is not defenceless though – far from it. Enemies range from relatively harmless vultures, right through to swarms of undead, firespitting dragons and titanic wyverns. There’s also other mages to contend with – in some levels as many as seven - and that’s where the toughest challenges are at. Each mage possesses a castle. As long as the castle exists, the mage has a spawning point should he/ she die. The castle is upgradable provided the mage has collected enough mana, so levels quickly fall into a rhythm that is split evenly between fighting the wildlife to collect mana, protecting your own castle, and then attacking your “human” opponents. So far it probably all sounds pretty standard, but Magic Carpet has a host of ideas that work so well, the game still remains relevant today. The maps are reasonably small (by today’s standards), but they really are open – each map is filled with secrets and dangers to find and avoid. The levels are also morphable – it is possible to destroy environments as it was possible to create volcanoes and gaping chasms. There is also a huge range of spells to collect and use – 24 in total – ranging from standard shield and health regeneration, through to more aggressive fireballs and the awesome destructive might of meteors.", "platform": "Sony Playstation", "release_date": "March 15, 1996", "game_type": "Released", "esrb": "", "developers": "Krisalis Software", "publishers": "Electronic Arts", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "2.83", "wikipedia": "https://en.wikipedia.org/wiki/Magic_Carpet_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/19572-magic-carpet\n"}