{"altername_name": [], "name": "Martian Gothic: Unification", "overview": "The events begin in 11,000 BC when a meteorite from Mars strikes the Antarctic ice. It isn't until 1984 that it is discovered by mankind and labeled ALH 84001. A dozen years later, NASA's analysis is complete and the existence of alien microfossils confirmed. In 2009, a manned mission to Mars to investigate bacterial life is launched with the establishment of the Vita 1 base the result. And now, in 2018, all communication with the base has been terminated. Vita 1's last message is the enigmatic: \"If you send a manned craft, warn the crew to stay alone, stay alive.\" Nearly a year later, a team sent to investigate survives a crash on the Martian surface and arrives at the derelict base. Following the advice of the last message from Vita 1, each member enters the base through a separate airlock. In Martian Gothic: Unification, a survival-horror adventure, you play as all three team members, guiding each on his or her path of exploration to solve the mysteries of Vita 1 and Mars itself. The team must work together, yet remain apart, to discover the cause of the infection plaguing them at the base and eventually uncover the ancient secret buried deep below the Martian surface. In a script written by science fiction author Stephen Marley, you'll guide the actions of the three members from a third-person perspective, reminiscent of Resident Evil. Each member carries an inventory, health and poison indicator and a weapon. The action unfolds as the members explore the environment and discover objects, computers, storage bins, bodies and vacuum tubes used to transport items around the base to each other. Game saves are accomplished through access of the Vita 1 base computer system. It contains unrestricted, restricted and local information about the base as well as a videogame called Martian Mayhem II, generally considered the \"worst game in the history of videogaming\" (the game's development began in 1998 and finally hit store shelves in December 2017). The number of saves available at each computer station is limited, thus requiring the eventual use of more than one. Explore the Red Planet through the eyes of Matlock, Kenzo and Karne as you discover a secret older than humanity itself in Martian Gothic: Unification.", "platform": "Sony Playstation", "release_date": "November 4, 2001", "game_type": "Released", "esrb": "M - Mature", "developers": "Coyote Developments", "publishers": "Take-Two Interactive Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=scy_fhNZGek", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30824-martian-gothic-unification\n"}