{"altername_name": [], "name": "Martial Beat", "overview": "Martial Beat was a game created by Konami for the arcade and PlayStation in Japan in 2002. This game tests skill in martial arts, and it is not really considered part of Konami's Bemani series, even though it contains music from the series. This game was shipped in a modified Dance Dance Revolution cabinet, with the sensors and the game's art on it. Even though there is the presence of two sets of selection buttons (as Dance Dance Revolution supported two players), this game is one player only. To play the game, one needs to follow the on-screen instructor, and when a red light turns on located on top of the screen, the player must perform the move by repeating the instructor. The specialized controller consists of a base station, which is plugged into the playstation, and four sensors, one for each hand and foot. The base station should be plugged in to the player one slot. The round part should be pointed at thearea you are planning to play in. The controller works via IR so you should make sure that there isn't anything obstructing the base station from the sensors. Each hand and foot sensor is marked on the back with Kanji (Japanese pictorial symbols embossed in the plastic) with which appendage they should go on. They also have arrows below the characters indicating left and right. Players can practice or move on to fitness and attack exercises. The game features real life instructors that will prompt the player to perform tasks. The game features different game modes: - Practice: This mode lets you select songs individually so that you can learn the routines. - Mirror Mode: Dub-I-Dub, once unlocked, will always be played in mirror mode, meaning that when you would normally punch or kick with your left, you should punch with your right. Your right hand should be used when the instructor uses their right hand. - Fitness: This mode will give you a menu of assembled routines composed of the songs seen in practice. Once again it gives you a diagram of the muscle groups it thinks you will work with each routine. It will give you a good impression of how kick- or punch-heavy the routine is. - Edit: Here you can combine songs together to form your own custom routines. - Diary: If you have been entering the dates correctly, then this will display your totals for each day you have played. - Basic: This is a collection of instructional videos that show you how to properly do the kicks and punches that make up each routine. - Attack: If you follow the routines correctly, you will survive against the lame cartoon foe; if not, the little guy with the punching gloves will take your health and you will fail. Your gauge is reset at the start of every song. After each song is completed you will get a grading screen which includes how many of your enemies you defeated out of the total number possible.", "platform": "Sony Playstation", "release_date": "February 7, 2002", "game_type": "Released", "esrb": "", "developers": "Konami", "publishers": "Konami", "genres": "Music", "max_players": "1", "cooperative": "No", "rating": "1.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96221-martial-beat\n"}