{"altername_name": [], "name": "Marvel Super Heroes", "overview": "Capcom aren't strangers in the 2D fighting realm; their Street Fighter series has dominated the market since its inception. Originally released in the Arcade, they're looking to dominate some more with Marvel Super Heroes. In the tradition of Street Fighter II, Marvel Super Heroes incorporates 2D fighting environments with characters from the Marvel Comics world. There are several additions to the gameplay including Infinity Gems; these gems increase certain attributes such as Power, Time, Space, Mind, Soul and Reality. While each gem does something different, enhancements are initiated towards defensive maneuvers, health meters and new attacks. Additionally, this brawler features all kinds of combination attacks and counters. Fighters include Captain America, Spider-Man, Blackheart, The Incredible Hulk, Iron Man, Juggernaut, Magneto, Psylocke, Shuma-Gorath and the claw-toting Wolverine. Not only does each character feature his or her own specific combination attacks, they come with destructive Infinity maneuvers; regulated by the Infinity meter, these special moves significantly damage your opponent. Marvel Super Heroes features an Arcade and Versus mode. After selecting the Arcade mode and the character of choice, you'll fight through eight computer-controlled opponents on quests for redemption, revenge and victory; each brawler has his or her own reason for entering the tournament. Once you've honed your skills, try beating up on your friends in the two-player Versus mode. There's also an Options menu allowing you to alter difficulty settings, initiate shortcuts to the character select screen and adjust round times, speed, sound settings and button configurations. You can utilize a Memory Card to save these options and any goodies you may have earned within the game.", "platform": "Sony Playstation", "release_date": "September 25, 1997", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Marvel_Super_Heroes_(video_game)", "video_link": "https://www.youtube.com/watch?v=nXdm3pGRWO4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/539-marvel-super-heroes\n"}