{"altername_name": ["Marvel Super Heroes vs. Street Fighter"], "name": "Marvel Super Heroes vs. Street Fighter: EX Edition", "overview": "Marvel Super Heroes Vs. Street Fighter is a 2D fighting game and the first to combine characters from Capcom's Street Fighter series with those of the Marvel comic universe. It is also the first in Capcom's games to introduce a tag team style of combat where the player can call for another character during a fight. Matches consists of two-on-two battles where the player can only control one character at a time. The other character can be called in regularly or while doing an attack. The off-screen one also regains some health while waiting. Both opposing characters need to be defeated to win the match, and when one dies the other is called in automatically. The tag team options introduces Variable Attack, Variable Counter and Variable Combination where the two characters team up to attack, counter of perform a special move. Most of the X-Men characters were already present in X-Men: Children of the Atom and Marvel Super Heroes: Cyclops, Storm, Juggernaut, Magneto and Wolverine, with the addition of Rogue, Gambit and Sabretooth. The Street Fighter characters are gathered from Street Fighter Alpha 2: Ryu, Ken, Cammy/Chun-Li, Charlie, Zangief, Dhalsim, M. Bison and Akuma. The final boss of the game is Apocalypse. The PlayStation version does not include the tag team feature and relies on the more traditional best-two-of-three round setup. The Japanese versions have an exclusive playable character named Norimaro who was created exclusively for the game and has no direct connection to the two franchises He is a nerdy school-boy guy and was created by the Japanese comedian Noritaro Kinashi.", "platform": "Sony Playstation", "release_date": "February 25, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.65", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107308-marvel-super-heroes-vs-street-fighter-ex-edition\n"}