{"altername_name": ["Marvel vs Capcom: Clash of Super Heroes: EX Edition", "マーヴル VS.カプコン クラッシュ オブ スーパーヒーローズ EXエディション"], "name": "Marvel vs. Capcom: Clash of Super Heroes", "overview": "It's the best of both worlds as the greatest superheroes of the Marvel Universe square off against the experienced warriors of Capcom's fighting and adventure games in this PlayStation adaptation of the Arcade hit. Fifteen characters are initially selectable. On the Marvel side, there's Captain America, Spider-Man, Hulk, Venom, Wolverine, Gambit and War Machine. Representing Capcom are Captain Commando, Mega Man, Strider Hiryu, Morrigan, Ryu, Chun-Li and Zangief. In addition, six secret characters can also be unlocked. These are Shadow-Lady, Orange Hulk, Mega-War Machine, Lilith, Hyper-Venom and Roll. Marvel vs. Capcom features five game modes from which to choose. Battle mode pits the player against a series of CPU opponents in preparation for the final boss, Onslaught. A second player can join in as an opponent at any time. Versus mode allows two players to select the handicap level and location of their battle. Cross Over mode has a player facing off against a tag-team of identical opponents. Each combatant chooses one member of the team. Training mode gives the player a chance to practice special moves and fighting techniques against a non-attacking CPU opponent. The Gallery contains artwork and ending sequences for those characters that have successfully finished the game. In addition to the normal arsenal of punches and kicks, each character has special moves that can be performed by executing certain controller and button combinations. When a character attacks an opponent, the level of his or her Hyper Combo Gauge increases. When it reaches specific levels, the character is able to perform extra powerful special moves called Hyper Combos. In the Battle and Versus modes, players have the option of selecting either a \"partner hero\" or a \"special hero.\" Partner heroes are members of the regular lineup who can be called on to attack the enemy when the Hyper Combo Gauge is at a specific level. Special heroes are guest characters that act in a similar manner as partners but perform different moves. The Cross Over mode automatically selects a special hero. The 20 guest characters are Unknown Solider, Arthur, Lou, Saki, Toon-Pooh, Devilot, Anita, Pure & Fur, Michelle Heart, Shadow, Thor, Cyclops, Magneto, Storm, Jubilee, Rogue, Psylocke, Colossus, Iceman, Juggernaut, U.S. Agent and Sentinel.", "platform": "Sony Playstation", "release_date": "January 31, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.18", "wikipedia": "https://en.wikipedia.org/wiki/Marvel_vs._Capcom:_Clash_of_Super_Heroes", "video_link": "https://www.youtube.com/watch?v=hp0Hyav8SN8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8999-marvel-vs-capcom-clash-of-super-heroes\n"}