{"altername_name": [], "name": "Mary-Kate and Ashley: Magical Mystery Mall", "overview": "Mary-Kate and Ashley's first PlayStation game takes them through a mall that is under the influence of a magical spell, which causes each of the stores to become a portal to another world. To right this terrible wrong, the twins must embark on an five-level adventure that involves choreographing music videos, modeling clothes, slinging burgers, taking pictures of boys, and even shredding the slopes on a snowboard. Each of the games are found within the mall under store names Fash, Music Nation, Just Say Snow, Catch A Wave, and Lizzie's Lunch. Fash involves choosing which outfits Mary-Kate and Ashley will wear on the catwalk as they strut their stuff for photo opportunities. Once the outfits are selected, players earn points by snapping pictures of the pair, with bonuses awarded for poses, close-up views, and shots being centered in the frame. Music Nation lets players pick a girl, setting, and the dance moves to create a memorable sequence to impress video producers. Players can set the dancing to any of the included music tracks or a song from their own CD library by swapping discs and scanning in the selected song. Just Say Snow involves racing an opponent down the slope in a series of three mountain courses, while Catch A Wave has players once again behind the lens of a camera, trying to snap pictures of boys at the beach. The final level, Lizzie's Lunch, is a timed game where players serve impatient customers their orders as quickly as possible by skating over to the corresponding service area and then dropping the food off at the counter. To complete the game, a total of five shifts must be fulfilled while meeting sales quotas (each completed order earns players cash and possible tips for speedy service). As players advance through the game, they'll receive up to nine tokens to unlock bonus features for each of the five levels.", "platform": "Sony Playstation", "release_date": "September 15, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "N-Space", "publishers": "Acclaim Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.05", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Mary-Kate_and_Ashley_video_games", "video_link": "https://www.youtube.com/watch?v=Mt87XXjavco", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/77223-mary-kate-and-ashley-magical-mystery-mall\n"}