{"altername_name": [], "name": "Mass Destruction", "overview": "With little in the way of story elements, Mass Destruction's title alone tells you exactly what this game is about. Played throughout a scorched Earth, you'll shoot anything and everything in your path as you control one of three available tanks. Each tank has different armor and speed statistics: the Cheetah is a speedy tank built for hit and run operations; the Cobra lacks maneuverability but has highly destructive capabilities; and the Viper is an able firehouse without the armor capabilities of the Cobra. Regardless of which tank you've chosen, they all begin with a 100mm Cannon and a chain gun. Among the various weapons you'll encounter are hi-explosive shells that explode on contact, mines, mortars, Torus Bombs that surround the tank with an explosion ring, flamethrowers and guided missiles. Played from an overhead 3D third-person perspective, the game is divided into four areas. Areas consist of a variety of mission objectives that must be completed; in addition to primary missions, some include secondary objectives. While primary objectives (24 in all) must be completed in order to claim victory for the overall mission, secondary objectives act as additional bonus points. There are also bonus and hidden objectives that award the player with bonus points. By completing hidden objectives, you'll be rewarded with new missions! Mass Destruction requires one memory card block for saving game data and supports analog controls. So get in there and destroy anything that moves! Features: * Blast through 24 combat missions * Hit your enemies with flame throwers, guided missiles, vortex bombs, and more * Choose from three tank classes", "platform": "Sony Playstation", "release_date": "September 30, 1997", "game_type": "Released", "esrb": "T - Teen", "developers": "NMS Software", "publishers": "American Softworks", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.04", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/540-mass-destruction\n"}