{"altername_name": ["Master of Monsters: Akatsuki no Kenja Tachi"], "name": "Master of Monsters: Disciples of Gaia", "overview": "Restricted by the laws of heaven, the gods had no choice but to sit back and watch the humans of Earthland destroy each other, their wars never seeming to cease. One day, however, the powerful Gaia had had enough. Along with six disciples, Gaia exited heaven in an attempt to set things straight on Earthland -- or so he led his disciples to believe. Upon his dissension, Gaia became greedy for power, summoning an army of monsters to parade with him throughout the entire world and locking his disciples into one of the many new magical towers he had constructed. After his home, friends and parents were destroyed by Gaia's army, a 15-year-old human boy named Iros felt helpless. \"If only I had more power!\" he exclaimed in frustration. As though hearing his cries from heaven, a globe of light presented itself before the boy, bearing with it a magical pendant with the power to free one of Gaia's disciples. At last Iros had a chance to avenge his losses and free the rest of the world from the oppression of Gaia. In Master of Monsters, it's up to you to assume Iros' role in choosing which disciple to free and lead an army of summoned monsters against the forces of Gaia. Among your choices are Necromancer, Summoner, Justice, Warlock, Fortuner, and Shadowmaster, each with his or her own strengths and weaknesses, usually relating to fighting ability or magical powers. Once your leader is chosen, your quest to destroy Gaia begins. On a hexagon-based battlefield, you have control over the monsters summoned (e.g., soldiers, magicians, neophytes, unicorns, rocs, elves, trolls, fairies, etc.) and their movement across the battlefield. The higher a leader's ruling power, the more monsters can be summoned. Positioning a warrior onto one of the many unoccupied or enemy-ruled magical towers can increase ruling power. After the leader of the opposing army has been defeated, you have won the battle and are one step closer to defeating Gaia. As your warriors battle across the game's 13 types of terrain, they will gain experience points, leading to advancement in experience levels. After certain levels are achieved, the warrior can also graduate in class (e.g., a soldier becomes a knight). When at a monastery, two monsters can even fuse together to become another entity. However, this is not always a favorable action as the results can yield anything from a powerful dragon knight to a useless slime. Defeat Gaia and free Earthland. Only then will you be a true Master of Monsters. Features: Collect and summon over 85 creatures in battle to defeat your foe Explore 40 different maps as you battle enemies using magic, melee, and ranged attacks Select your character from six disciples and then lead them through a variety of environments to defeat Gaia Buy and sell more than 200 weapons, objects, and magic items", "platform": "Sony Playstation", "release_date": "January 1, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "SystemSoft", "publishers": "Ascii Entertainment", "genres": "Strategy", "max_players": "4", "cooperative": "No", "rating": "3.93", "wikipedia": "https://en.wikipedia.org/wiki/Master_of_Monsters", "video_link": "https://www.youtube.com/watch?v=2HANww5sv1Y", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9067-master-of-monsters-disciples-of-gaia\n"}