{"altername_name": [], "name": "Matsumoto Reiji 999: Story of Galaxy Express 999", "overview": "Galaxy Express 999 is the name of a train which travels through space, beginning at Megalopolis Station on one end of the galaxy and terminating at Andromeda on the other. But the Galaxy Express is more than just a train—it’s also a metaphor for life itself, with passengers constantly boarding, debarking, and dreaming along the way. The game is an action adventure where the player, as Tetsuo, must clear a series of events. The works, \"Galaxy Express 999\" \"Space Pirate Captain Harlock\" \"Queen Emeraldas\" \"Super-dimentional Warship Mahoroba\" \"Drifting Line 000\" and so forth.... However the origin of Reiji Matsumoto's supervision, comes to 20 minutes of original animation!! From a synthesis of 2D character animation and 3D mechanical animation, a work with a great feeling of presence is created. A twelve year-old street urchin named Tetsuro Hoshino desperately wants an indestructible machine body, giving him the ability to live forever and have the freedom that the unmechanized don't have. While machine bodies are impossibly expensive, they are supposedly given away for free in the Andromeda galaxy, the end of the line for the Galaxy Express 999, a space train that only comes to Earth once a year. The series begins with Tetsuro and his mother making their way to Megalopolis where they hope to get jobs to pay for passes for the 999. Along the way however, Count Mecha and a gang of \"human hunters\" kill Tetsuro's mother. Before she dies, she tells him to continue the journey they started, and to get a machine body to live the eternal life she couldn't. Intent on killing Count Mecha to avenge his mother, Tetsuro meets up with a beautiful woman, Maetel, who is the spitting image of his dead mother. Maetel offers him an unlimited use pass for the 999 if he will be her travelling companion to which Tetsuro agrees. Along the way, Tetsuro has many adventures on many different and exotic planets and meets many kinds of people, both human and alien, living and machine. Increasingly, Tetsuro realizes that a machine body won't fix all of his problems. In fact, most of the machine people he meets regret the decision to give up their humanity. Eventually, Tetsuro and Maetel reach the Planet Prometheum, the final stop for the 999, but Tetsuro learns that it is ruled by the Queen of the Mechanization Empire, also named Prometheum. She is Maetel's mother, and controls the planet by entirely mechanized human components. Maetel's mission was to bring young humans for that purpose. Queen Prometheum plans on transferring Tetsuro's consciousness to a bolt for the heart of the planet. Tetsuro doesn't understand why he has been betrayed by Maetel, but Maetel has plans of her own, and seeks to destroy the mechanized civilization. With the help of her father, Dr. Ban (who was only named in the movie), whose consciousness resides in a pendant she carries over her neck, Maetel destroys her mother and the planet. Afterwards, Maetel and Tetsuro return to the Planet of Bats where Tetsuro tells Maetel his intention to return to Earth and lead it toward a new future. Maetel, proud of Tetsuro for his decision tells him she has something to take care of and should board first. However, Tetsuro finds a letter from Maetel telling him that it was time for them to part ways. Maetel had secretly boarded the 777 (three-seven), a nearby train, with the intention of \"leading another boy to his future\". However, it is unclear as to whether or not this means that the Mechanization Empire still exists elsewhere, or if Maetel will lead the boy to some other \"future\". The series ends as the trains both depart the Bat Planet.", "platform": "Sony Playstation", "release_date": "June 28, 2001", "game_type": "Released", "esrb": "", "developers": "Polygon Magic", "publishers": "Banpresto", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110228-matsumoto-reiji-999-story-of-galaxy-express-999\n"}