{"altername_name": [], "name": "Medal of Honor", "overview": "The year is 1944. On the eve of what will be known ever after as the D-day invasion, the Air Transport Corps initiated the largest drop of troops yet seen by the Allied Forces. The plan couldn't have gone any worse: planes flew past their targets, those that came close were quickly shot down, and the inclement weather made it difficult to see where the pilots were heading. Yet in the midst of this colossal failure, a glimmer of hope emerged. A 24-year-old Lieutenant by the name of Jimmy Patterson persevered through the chaos and made sure that his regiment reached its scheduled drop zone. At least until his C-47 transport plane was cut to shreds by enemy fire. Faced with a group of injured men and harrowing odds, Patterson took it upon himself to fend off repeated attacks from German patrols until help arrived. When all was said and done, the young Lieutenant killed six men and was nominated for the Congressional Medal of Honor for his bravery. He was a hero. Patterson was then sent to an infirmary where he could heal his wounds suffered from protecting his crew. In a few days, Germany would be left behind, for a well-deserved return home to the States. While the soldier was scheduled to receive a War Bonds tour upon his arrival, it would apparently have to wait. The infirmary bed would be empty by the time the nurse made her rounds, and the story that follows is one of epic proportions. It is one that you create. Medal of Honor is the story of Jimmy Patterson, a soldier recruited to work for the OSS (Office of Strategic Services). Inspired by acclaimed film director Steven Spielberg, the game is a first-person shooter that takes place amidst the events surrounding World War II. Spanning seven different missions and 24 levels, Medal of Honor features search and rescue assignments, commando raids, and espionage. You will be able to find and use 11 historically authentic weapons to fight 20 different types of German troops, from the Wermacht Light Infantry to the Elite Heavy Shock Troops. As you progress through the castles, twisting city streets, mountain strongholds, and other locales making up the game, you'll be able to take out the Nazis with the following armaments: Colt45, German Walther P38, Thompson SMG, Bazooka, Mark II Frag Grenade, Sniper Gewehr 41, Shotgun, M1 Garand, MP40 SMG, Browning Automatic Rifle, and Stielhandgranate (a.k.a. Potato Masher). In a departure from traditional first-person shooters on console systems, time was spent on Medal of Honor to make the enemy AI behave as realistically as possible. Guards will duck to avoid fire, visibly react to specific hits to their bodies, throw back grenades, sound alarms, and even ask you for your papers. Papers? Yes, some missions will require the use of a Nazi uniform to disguise yourself from your enemies! Just make sure you have the right documentation when asked, or the situation may turn deadly. Before donning your combat boots and starting your tour of duty, you'll be able to adjust gameplay options, view records on completed missions, witness authentic background footage on the events surrounding WWII, and receive briefings on the upcoming missions from the animated War Room. Players can also elect to challenge a friend in the head-to-head multiplayer mode. The multiplayer mode lets players select their character and up to seven types of uniforms (more can be earned as you unlock hidden features while playing through the single-player game). There are two types of games to play in your choice of seven theaters (or levels): Timed Match or Wins Match. The length of Timed Matches can be further customized to 2, 5, 10, 21, or unlimited time, while Wins Matches can consist of 3, 10 or 21 wins. No matter which mode you choose, the object is the same: take out your opponent before he or she takes out you! In an attempt to create a realistic atmosphere, the developers sought the advice of Capt. Dale Dye, USMC (ret.), who previously served as a consultant for Platoon, Born on the Fourth of July, and Saving Private Ryan. Other notable features include an original score composed by Michael Giacchino, both analog control and vibration function support, and the option to save up to 15 games to a single memory card. As the title suggests, you will be able to receive up to seven medals based on your performance during each mission. Win all seven to receive a secret code and special movie!", "platform": "Sony Playstation", "release_date": "October 31, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Dreamworks Interactive", "publishers": "Electronic Arts", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.28", "wikipedia": "https://en.wikipedia.org/wiki/Medal_of_Honor_(1999_video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10418-medal-of-honor\n"}