{"altername_name": [], "name": "Medal of Honor & Underground Double Pack", "overview": "Medal Of Honor is the first game to bring gritty WWII action to the PlayStation convincingly. The date is June 5, 1944, just one day before D-Day, and the mission is to go behind enemy lines on a series of search and rescue operations, commando raids, and all-out battles. The twenty-four levels have been designed to authentically recreate real period environments, while the twelve weapon types continue the realistic feel. Using such classics as the Tommy gun and bazooka you must take on twenty different types of enemy, from the Wehrmacht light infantry to the Nazi shock troops, fighting it in some inspired locations--from a U-Boat to a V2 rocket plant. A split-screen option facilitates the two-player mode, really bringing the shoot-'em-up element to the fore. And if all that isn't enough to convince you of Medal Of Honor's pedigree, bear in mind that it comes from the Dreamworks stable, home of a certain Mr Spielberg. Medal of Honor Underground is a prequel to Medal of Honor in which you play as Manon, a young French girl recruited by the French Resistance, fighting in the OSS against the coming German onslaught. The Nazis will use suppressive firing squad tactics, tanks, half-tracks, and motorcycles to try to stop you. The game features 22 levels spread throughout 7 missions, with 12 authentic weapons, including the pistol crossbow and the Panzerfaust. A new disguise mode allows Manon access to the Third Reich's most evil secrets. Artificial Intelligence-controlled fellow agents will assist by battling the Gestapo, cracking safes, and driving vehicles. After fighting the Nazis across Europe and North Africa, try battling your friends in Medal of Honor Underground's split-screen multiplayer arenas. .", "platform": "Sony Playstation", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Electronic Arts", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.21", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/34829-medal-of-honor-underground-double-pack\n"}