{"altername_name": [], "name": "MediEvil", "overview": "MediEvil tells the tale of Sir Daniel Fortesque, a man with a gift for storytelling. Though he never actually performed any of the wondrous deeds he so often boasted about, the king knighted him and appointed him as the head of the Royal Battalion. You see, the king liked stories, and truthful or not, Sir Daniel's stories were the best. Besides, Gallowmere hadn't seen a war in centuries... After years in exile, the evil magician Zarok returned to the land of Gallowmere with an unholy army in tow. In desperation, the king ordered Sir Daniel to lead his army against that of Zarok's. However, Sir Daniel's battle is short-lived, as the first arrow fired in battle fatally wounds him. The king's army manages to drive back the demon hordes, and to save face, the king declares that Sir Daniel Fortesque died an honorable death only moments after killing Zarok. One-hundred years later, Zarok returns, casting an evil spell over the land that turns all the villagers into beasts of unimaginable evil. In doing so, he also unwittingly raises Sir Daniel from the dead, who must now atone for his ignoble death and defeat the sorcerer. As you traipse across the now cursed land of Gallowmere, you'll need to pick up life bottles and energy vials. The former acts as an extra life of sorts (refilling your energy bar when it is depleted), while the latter tops up your energy. To ensure that you don't lose too much of that vital energy, you'll acquire an arsenal of weapons including a crossbow, broadsword, axe and throwing daggers. Supplies for your weapons can be purchased from Merchant Gargoyles using treasure found on your travels. Sir Daniel's task is a simple one, as he must navigate through each level and destroy any enemies and boss characters that get in his way. By collecting rune stones, locked areas can be accessed, allowing our hero to forge ahead towards his ultimate destiny. As enemies are dispatched, the Chalice of Souls will be filled up. When it's full, Sir Daniel will be able to collect it. In doing so, he is granted access to the Hall of Heroes, where true heroes from a bygone era reward the player with new items and the like. Levels vary in both design and theme, running the gamut from possessed pumpkin patches to malevolent town squares.", "platform": "Sony Playstation", "release_date": "October 21, 1998", "game_type": "Released", "esrb": "T - Teen", "developers": "SCE Cambridge Studio", "publishers": "Sony Computer Entertainment Europe", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.30", "wikipedia": "https://en.wikipedia.org/wiki/MediEvil", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9638-medievil\n"}