{"altername_name": [], "name": "Melty Lancer: The 3rd Planet", "overview": "Melty lancer - The Third Planet is the sequel to Melty Lancer - Re-Inforce and the third and latest one released for the Playstation One console. The game again is a mix between an simulation adventure game in which the player sometimes can talk to the girls and depending of the answers the game will go in a way or another and a tactical rpg in the fights since during them the player can pause them and select what he wants his character to do. The game features unlockables CG, Movie & Sound Room Galleries. This game just like the other 2 games in the series is a futuristic city based adventure with our heroine, Sylvie working with the GPO to keep law and order. The game takes place in the year 2091 and begins when the player character's (Fujita) is wake up in his bedroom to go with his team (Reika, Kyouma & Shinya) to defeat a group of enemies that is attacking the city. The battle this time are a little different since the player can only stop the fights to give orders (change formation, etc). Based on the Playstation game series there was an anime OVA six episode series known as Melty Lancer: The Animation. The eponymous Melty Lancer is actually a six-woman team of detectives from the Galaxy Police Organization, a name that apparently wasn't trademarked by Tenchi Muyo. Though the unit was once disbanded, the GPO directors inexplicably see fit to recruit a prisoner named Collins and give him command of the newly re-conscripted Melty Lancer. Former group leader Melvina MacGarlen is an dignified, pseudo-aristocratic fencer who wears a concerned frown ninety percent of the time; the brash tomboy Jun Kamishiro fights in a suit of combat armor, hates math, and kind of likes Collins; the blond, methodical investigator Sylvia Nimrod has a family history with the GPO; the soft-spoken and optimistic Sakuya Lansaihe is a priestess from the Church of St. Archanest; the staff-wielding, furry-eared Angela is a genetically engineered girl soldier; and the bratty Nana is a magician from a parallel dimension. Collins, assigns Melty Lancer to trivial tasks at first, but the unit eventually notices a number of crimes leading back to the name \"Iyonesco.\" Whatever Iyonesco is, it's able to direct an efficient terrorist cell known as Defiant as well as a group of goofball criminals who dub themselves the Vanessars in honor of their highly annoying boss, Vanessa. While facing off against Defiant, the women of Melty Lancer also run across a cute gerbil-fox named Mou Mou, a slimy bubble-creature, and a lot of perplexing clues about Iyonesco.", "platform": "Sony Playstation", "release_date": "June 17, 1999", "game_type": "Released", "esrb": "", "developers": "Tenki", "publishers": "Konami", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129588-melty-lancer-the-3rd-planet\n"}