{"altername_name": [], "name": "Memories Off 2nd", "overview": "Memories Off 2nd is a Japanese romance visual novel developed by KID for the Dreamcast and PlayStation consoles. It is the second game in the Memories Off series. The game was released for the PlayStation Portable on May 29, 2008. Memories Off 2nd has been adapted into an anime OVA series split into three episodes. The first of three DVDs went on sale on January 22, 2003. Later, a special Memories Off 2nd Special Edition ~Nocturne~ DVD was released on March 24, 2004. This DVD release is sixty minutes long and follows the same storyline as the original OVA but with a stronger focus and new footage of Hotaru Shirakawa. CHARACTERS: - Ken Inami: The protagonist of Memories Off 2nd. - Hotaru Shirakawa: The primary heroine of Memories Off 2nd, Hotaru is in her third year at Hamasaki High School. She often acts childish and immature, and is sometimes an airhead. Her favourite hobby is the piano. She confessed her love to Ken at Christmas, and in the OVA they're in a relationship, but she worries about Ken's feelings towards her. She appears in both of the Memories Off 3.5 OVA stories, and is a secondary character in Memories Off ~Sorekara~ who helps with Inori's feelings towards Isshu. - Tomoe Tobise: Hotaru's best friend, Tomoe is also in her third year at Hamasaki High School. She works part-time at a local restaurant and is a member of the theatre club. She has an open-hearted and cheerful personality. In the OVA, Ken overhears her reciting lines from her upcoming play, but mistakes them as a confession of love at first. She fears she may steal Ken from Hotaru. Her hairstyle slightly resembles Yue Imasaka's from the original Memories Off game. - Takano Suzuna: A third year student at Hamasaki High School, Takano is a member of the swimming club and a classmate of Kens. She was born in Russia and has a kind and affectionate nature. She is especially popular to underclassmen. - Shizuru Shirakawa: The older sister of Hotaru, Shizuru is in her third year of University. She is especially good at making deserts which Hotaru loves to eat. She has an interest in and is good at professional wrestling. She also has a habit of spoiling and caring about Hotaru, helping her out with her troubles with Ken. She is a kind-hearted person in nature. She also appears in the Memories Off 3.5 OVA stories with Hotaru, and is a secondary character in Memories Off ~Sorekara~, working as the deputy manager at the same restaurant as Isshu. - Megumi Souma: A second year student at Hamasaki High School, Megumi is a member of the art club and works part-time with Ken and Shin at the Ressac restaurant. She tries to keep herself busy there but her clumsy nature makes it difficult as she accidentally breaks plates on a common basis. Despite this, she tries to keep cheerful even though she's a manic-depressive. - Shota Nakamori: Best friend of Ken, he is in his third year at Hamasaki High School and is the captain of the soccer club. Starting from Memories Off 2nd, all main series games offer the possibility of multiple endings for each of the heroines. Hence, in order to experience the game and all of the main plotlines in their entirety, the player will have to replay the game multiple times and make difference choices to further the plot in alternative directions.", "platform": "Sony Playstation", "release_date": "September 27, 2001", "game_type": "Released", "esrb": "", "developers": "Electronic Arts", "publishers": "Electronic Arts", "genres": "", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136203-memories-off-2nd\n"}