{"altername_name": ["Memorial Series: Sunsoft Vol. 6", "Sunsoft Classics Vol.6"], "name": "Memorial Star Series: Sunsoft Vol. 6", "overview": "Memorial STAR Series-Sunsoft Vol.6 - Battle formula & Gimmick! features 2 conversions of old NES games: BATTLE FORMULA: Super Spy Hunter is a vehicular combat video game developed and published by Sunsoft for the Nintendo Entertainment System. It was originally released in Japan on September 27, 1991 as Battle Formula , which means that this game originally was not a sequel of Spy Hunter. Sunsoft would later obtain the license from Bally Midway to market the game as such in 1992 As you blast your way through the next millenium, you'll be fighting for your life. Aerial bombs, machine guns, and flying warriors will be on the attack. But that's just for starters. You'll be piloting the next generation of pursuit craft, including a super-charged racer, aqua blaster water craft and turbo copter. Assuming you can manuever through twists and turns at maximum turbo force, you'll need to blast a menacing Boss at the end of each stage. To survive you better have reflexes, guts and a sixth sense to avoid disaster. With the speed and G-force-inflicting action of a super chase into worlds you've never imagined, Super Spy Hunter is light years beyond the original. And with multi-dimensional graphics and sound effects that bombard your senses, it'll take everything you've got. Super Spy Hunter. It's a manhunt at the speed of light. GIMMICK! Gimmick! , known in Europe as Mr. Gimmick, is a 1992 platform game created for the Nintendo Entertainment System by Sunsoft. The game featured bright, child-like graphics which disguised the game's notoriously steep difficulty level. In the introduction animation, a young girl receives a gimmick doll named Yumetaro for a birthday present. She quickly favors the new doll over her previous toys who, jealous over abandonment, kidnap her and hold her captive in an alternate dimension inhabited only by toys. Yumetaro, as the protagonist, must track down his new owner and retrieve her from the toy world. Gimmick!'s gameplay revolves around a platformer engine in which the action figure must make his way through each of the obstacle course like levels before reaching a boss. Gimmick's weapon is a star which he can spawn above his head and throw in the toy world. The star doubles as a functional utility, as Gimmick can ride his creation and use it to reach otherwise unattainable areas. Gimmick!'s levels are relatively short, though they carry a menacing learning curve. Once the player completes all the levels, and the \"final\" boss, it is revealed that the girl is still missing. To fully complete the game, Gimmick must go back and find hidden areas in each level where a magic item resides. If he can obtain each level's magic item without losing all his lives (i.e. no continues allowed) a new, secret level will be made available where an extra boss must be beaten. Only after these compromising conditions are met is the game completed in full, with a new animation showing Gimmick rescuing the girl and leading her back to safety.", "platform": "Sony Playstation", "release_date": "November 21, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunsoft", "publishers": "Sunsoft", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/87292-memorial-star-series-sunsoft-vol-6\n"}