{"altername_name": ["Memorial Series: Sunsoft Vol. 2", "Sunsoft Classics Vol.2"], "name": "Memorial Star Series: Sunsoft Vol. 2", "overview": "The Memorial Series is a series of re-released Famicom video game titles for the Sony PlayStation game console by Japanese developer Sunsoft. The Memorial Star series Sunsoft Vol. 2 - Route 16 - Turbo & Atlantis no Nazo is a compilation of this two games and also features artwork, a jukebox and a quiz mode. - ROUTE 16 TURBO: Route-16 is an arcade game released by Tehkan and Sun Electronics in 1981. The game was licensed to Centuri for distribution in the United States. It was also ported to the Emerson Arcadia 2001. A racing game where the main character is the greed. Several cars battle each other on maze-like rooms trying to get the money bags and avoiding the dangers. In this game, everybody cares just about the money, showing that the money is the \"route\" of all evil. The player controls a car which must explore a maze divided into sixteen rooms. He or she must get all the money bags while avoiding the opposite cars and trying not to run out of fuel. Every time the player goes out of a room, a map is showed, indicating the position of every car and all the money bags. There are also flags that can be driven over to invert the roles, so the player can crash the opposite cars and stop them for a few seconds, while getting bonus points. Route-16 Turbo is an improved version of Route-16. It is also the Famicom port, which was developed and published on October 4, 1985 by Sunsoft only in Japan. These are the improvements on Route-16 Turbo over the original arcade version: * Adjustable difficulty via the title screen (easy, medium and difficult) * Improved graphics * Improved music Later, it was re-released for the two-in-one PlayStation game, Memorial Series Sunsoft Vol.2, which also included Atlantis no Nazo. - ATLANTIS NO NAZO: Atlantis no Nazo lit. \"The Mystery of Atlantis\") is a side-scrolling platform game developed and published by Sunsoft and released for the Family Computer in 1986. Though the game was never released outside of Japan, a partially translated version titled Super Pitfall 2 was under development by Activision for release in North America. The game is set in the mythical land of Atlantis. The player controls a boy named Wynn , whose objective is to rescue his master being held captive in the final level. SunSoft developed the game with the intention of surpassing the enormously popular Super Mario Bros., and advertised the game with the slogan Ano Super Mario wo koeta!!, lit. \"The game that surpassed Super Mario!!\" The number of levels included in Atlantis did surpass the number included in Super Mario Brothers). Several years ago, a gigantic island arose from the southern Atlantic Ocean due to sudden shifts on the Earth's surface. Numerous adventurers made their way to the island to investigate, but none of them were able to return home safely. This island was named Atlantis, and nobody approached it out of fear. The game's main character is an amateur adventurer named Wynn, who decides to go to the island after learning that his master disappeared on the island over half a year ago. Armed with the special dynamite invented by the master, Wynn heads over to Atlantis all by himself to face an evil emperor who seeks to revive an ancient empire. The game is a side-view, side-scrolling platform game similar to Super Mario Brothers, but unlike Mario, it is possible to scroll in both directions on the screen rather than just the right-hand direction. The levels in the game are called zones, and the player travels through various locations such as fields, caves, ruins, temples, and even across clouds. The games consists of 101 of these zones (zones 1-99, the final zone, and secret final zone), and Moai face statues and pyramids appear in the background even though the game takes place on Atlantis. In later zones, the terrain may be difficult to see because of the dark, or it may become hard to control the character because the ground is covered with ice. Some zones (called \"black holes\") only involves falling. Three zones are not connected to the main game, so they can only be accessed using a hidden command that allows the player to select and play any zone they want. It is never made clear what the \"mystery\" of the island is, even after the player finishes the final zone. However, another mystery does appear in the final zone where it turns out that Wynn's master is Gonbe; the main character from Ikki, another video game developed by SunSoft.", "platform": "Sony Playstation", "release_date": "December 6, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunsoft", "publishers": "Sunsoft", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80386-memorial-star-series-sunsoft-vol-2\n"}