{"altername_name": ["Memorial Series: Sunsoft Vol. 4", "Sunsoft Classics Vol.4"], "name": "Memorial Star Series: Sunsoft Vol. 4", "overview": "Memorial STAR Series-Sunsoft Vol.4 - Chou wakusei senki metafight & Lipple island features 2 conversions of old NES games: CHOU WAKUSEI SENKI METAFIGHT: Blaster Master is a platforming and run and gun video game released by Sunsoft for the Nintendo Entertainment System. It is a localized version of a Japanese Famicom game titled Chô Wakusei Senki Metafight (which loosely translates to \"Super Planetary War Records: Metafight\") called which was released on June 17, 1988 (1988-06-17). The game was released in North America in November 1988 and in Europe on April 25, 1991 (1991-04-25). The game is the first in the Blaster Master series, and it spawned two spin-off titles as well as two sequels. The game features a character named Jason who follows his pet frog Fred down a hole in the earth. There he finds a tank and uses it to battle radioactive mutants. The player controls Jason and the tank SOPHIA THE 3RD through eight levels of gameplay to find the whereabouts of Fred and to defeat the mutants and their leader, the Plutonium Boss. The game was praised for its smooth play control and level designs, detailed and clean graphics, and music, and it was criticized for its high difficulty level and lack of passwords or save points. The game was novelized by Peter Lerangis, as part of the Worlds of Power series published by Scholastic Books. The plot in Blaster Master is shown at the beginning in a cinematic slideshow as \"ominous\" music plays in the background. The game starts with a person named Jason who has a pet frog named Fred who, one day, decides to leap out of his fish bowl and out the door. Fred then touches a radioactive chest and, he grows to an emormous size; Fred and the chest then fall into a hole in the earth.[ Jason chases Fred down the hole[note 1] which leads to a large underground cavern. There, he finds an armored tank SOPHIA THE 3RD a vehicle designed to battle radioactive mutants that live inside the earth. Jason mounts SOPHIA to find the whereabouts of Fred and to destroy the mutants and their leader—the Plutonium Boss. The opening sequence has been described as \"one of the great scenes in all of video games\" Gameplay in Blaster Master depends on the situation and location of the player. The game has two modes of gameplay. The first mode is where the player controls SOPHIA in a two–dimensional platform mode; the second mode is where the player controls Jason while outside SOPHIA in either the same 2D platform mode or in a top-down perspective. Gameplay in the top-down perspective consists of a series of labyrinths in which players navigate and defeat enemies along the way. Gameplay is non-linear, meaning that players must return to previous levels in order to advance to higher levels in the game. The objective is to complete all eight levels and destroy the mutants and their bosses with various weaponry such as guns, grenades, and special weapons Jason and SOPHIA have separate power meters that decrease whenever they sustain damage by an enemy or any other hazardous object or whenever Jason falls from a high place. They lose a life if either of their power meters runs out, and the game ends when they lose all of their lives. The player gets five continues which allow them to restart the game at the same level in which they have lost all their lives. Players can restore their power meter by collecting power capsules that appear in various places. LIPPLE ISLAND: Is a adventure game developed by Tokai Engineering and published by Sunsoft. The game was only released in Japan on January 23, 1988 for the Nintendo Famicom. Ripple Island is a peaceful command-based adventure game where the player chooses from 5 different actions (look, take, enter, hit, and push) in order to arrive at the game's ending. The game takes place on a small island called Ripple Island, where humans and animals lived together in peace. However, one day, the evil emperor Gerogeru suddenly appears on the island and kidnaps the king's daughter. The king promises that he will allow whoever can rescue his daughter to marry her, and a young boy named Kyle sets off on a long journey to rescue the princess. CHARACTERS: All of the characters in the game are small humans that are about the same size as woodland creatures. They can communicate with animals in a common language. - Kyle: The main character of the game sets off on his adventure after seeing the king's offer to allow the rescuer to marry the princess. He is joined by Cal during his journey, and begins to have romantic feelings for her as they travel together. - Cal: This short-haired young girl was left alone after her home was destroyed by Gerogeru, and heads off to defeat Gerogeru along with Kyle. She also beings to have feelings for Kyle during the journey, but secretly fears facing the evil emperor, and backs out when they reach the castle doors. - King Dotella The king of Ripple Island is named after dotera (????), a type of traditional Japanese clothing which he also wears. - Princess Nasarell The daughter of King Dotella and princess of Ripple Island is kidnapped by the emperor at the start of the story, and is turned into a frog. - Gerogeru: The main antagonist of the game calls himself the emperor of darkness, and bears the appearance of a gigantic frog. Areas are marked by the player's progress. Fulfilling the a set of objectives allows the player to proceed to the next area, and the player may not return to the previous area later in the game. However, the player may be automatically taken to the next area depending on the player's actions. There are five areas int he game the last one is the evil's emperors castle.", "platform": "Sony Playstation", "release_date": "February 14, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunsoft", "publishers": "Sunsoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80388-memorial-star-series-sunsoft-vol-4\n"}