{"altername_name": ["Memorial Series: Sunsoft Vol. 5"], "name": "Memorial Star Series: Sunsoft Vol. 5", "overview": "Memorial STAR Series-Sunsoft Vol.5 - Raf world & Hebereke features 2 conversions of old NES games. RAF WORLD: Journey to Silius is a 1990 run and gun game developed and published by Sunsoft for the Nintendo Entertainment System. Tokai Engineering also supported Sunsoft in developing the title as well. It is a slightly edited version of Raf World , a Famicom game featuring a different main character sprite. Originally, the game was to be altered to utilize the Terminator movie license, but after Sunsoft lost the rights, the game was further edited into its current state. In the year 0373 of the new space age calendar, overpopulation of Earth has led to increased demand for emigration to space colonies. Jay McCray, the son of a scientist responsible for development of space colony #428 in the Silius Solar System (SSS), prepares to move there in order to follow in his father's footsteps. However, the space station is obliterated in an explosion, killing the entire research team and destroying all data onboard. In his father's home, Jay discovers a floppy disk containing not only the complete SSS colony plans but a personal message from his father asking that he complete the projects should terrorists succeed in destroying the colony. To protect the colony plans and to avenge his father's death, Jay sets out to fight the terrorists responsible for the space colony's destruction. Gameplay is similar to the Mega Man and Contra series, in that while Jay's default weapon has unlimited ammunition, his other weapons do not; likewise, most of the weapons Jay can use are acquired by defeating major enemies, and items dropped by minor enemies restore life and energy (ammunition). He also cannot shoot upward. HEBEREKE: Hebereke is a side scrolling adventure video game developed by Japanese company Sunsoft for the Nintendo Famicom (Nintendo Entertainment System) and released in Japan on September 20, 1991. The game was only released outside Japan in Europe and Australia under the name Ufouria: The Saga with minor alterations on November 19, 1992. Long ago, Peace was in their world, now to this day, there's such a big war. The battle is involving around the world, because the space-time is so twisted, The world started to collapse. All of the heroes are due to go and fight, They fell to the cleft of time and space. To all who are in grief, he eventually cares, now he decided to begin the adventure from their original home to their world. Somewhere in this world, The Hero, known as Hebereke, must find his three other colleagues: Oh-Chan, Sukezaemon, and Jennifer are hiding. So to survive in this weird world, you must find your friends, determine the skills of your team, and all three must venture into this magical world. To fight against a alien mastermind named Unyo! The games design is in the style of Metroid and Blaster Master where the player traverses an uninterrupted game world collecting items and power-ups enabling the player to reach even more locations, fighting bosses and minibosses. Throughout the game you can locate Hebereke's three friends who each have unique skills. The game allows you to switch between the characters at any time to utilise their skills when needed.", "platform": "Sony Playstation", "release_date": "March 28, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunsoft", "publishers": "Sunsoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/87291-memorial-star-series-sunsoft-vol-5\n"}