{"altername_name": [], "name": "Meremanoid", "overview": "In this unique RPG from Xing Entertainment, you take on the role of a mermaid attemping to discover the secrets of her race. Based on an anime series from the mid-90s, the plot goes something like this: ages ago the goddess Aphrodite created the world, but the jealous Merdam, also known as the Destroyer, contested her control. After a great battle, the Destroyer was locked away forever, and the denizens of Meremanoia flourished, building a civilization in their Creatrice's image - peaceful, compassionate, and very female. This is how the Church and the royal family choose to interpret things, at least. What the priestly Mer-Lion caste doesn't like to talk about is the sacred text that foretells the coming of a new Destroyer, one who looks like a Meremanoid but is not. Words cannot describe this being - but only because the language of the mermaids contains no masculine adjectives. In other words, the Y chromosome is believed to be the Harbinger of the Apocalypse. There are underwater mountains, caverns, and broad expanses of sand that for lack of a better term are referred to as the desert. One cave has a large field of high-density muck that passes for a swamp. There's a region of underwater volcanoes, and another one set beneath an ice cap. All of this terrain is explored in three dimensions. Mermaids are natural born swimmers, so instead of just walking around the hero has to take all directions into account. About the gameplay you control the mermaid that have to swim around discovering places and talking to characters to advance in the game's plot. Meanwhile the player will have to face different kind of enemies. Each character must learn new hit combinations as the game progresses, starting with two or three simple one-hit attacks for her weapon of choice. Whenever a critical hit is landed, the character gets another hit in. If the combination of first and extra hits matches a hit combo for that character's current weapon, a new attack skill is learned.", "platform": "Sony Playstation", "release_date": "August 5, 1999", "game_type": "Released", "esrb": "", "developers": "Xing Entertainment", "publishers": "Xing Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110283-meremanoid\n"}