{"altername_name": ["メタルスラッグ", "Metaru Suraggu"], "name": "Metal Slug: Super Vehicle-001", "overview": "Metal Slug: Super Vehicle-001 is a run and gun video game. The game is widely known for its sense of humor, fluid hand-drawn animation, and fast paced two-player action. It is the first title in the Metal Slug series. Story: In 2028, General Donald Morden launches an all-out, global attack against the Regular Army. With superior numbers and equipment, the Rebellion overwhelms the unsuspecting Regular Army troops easily. The attacks could have been countered effectively, or even prevented, had the high-ranking officials listened to the Regular Army's intelligence community, which had been warning about all sorts of indications that the Rebellion could attack at any moment in decisive force. Unfortunately, the same officials decide to save their own skins and announce that it was the intelligence failure that led to such catastrophe, which the personnel serving in the intelligence community did not appreciate whatsoever. Meanwhile, Regular Army is pushed to near annihilation, with cities that it was supposed to be protecting in ruins. General Morden makes an announcement that all of the major cities around the world will be under his control within 170 hours, also adding that any resistance would be futile. The announcement certainly did not discourage a band of Regular Army soldiers attempt to salvage whatever they had left. Shortly after, a group named \"Resistants\" are formed by surviving members of the Regular Army and its researchers, who began to covertly convert the Metal Slug tank prototypes into combat-ready status in a hidden factory, hoping to launch a counter-offensive to regain what they had lost to the Rebellion. Morden just as quickly learns of this fact and attacks the plant, crushing the Resistants and capturing the tanks, putting an end to the counterattack even before it could begin. The vehicles are then scattered to prevent any ragtag Regular Army troops reclaiming them and using them to launch attacks. Seeing the Regular Army panic and crumble, 1st Lieutenant Marco Rossi of the Regular Army Peregrine Falcons special forces unit quickly unites remaining Regular Army units and begins a desperate counter attack to reclaim the tanks he must reclaim them, or destroy them all. Fighting alongside him is Second Lieutenant Tarma Roving from the same unit. Their main objectives were to engage the Rebellion and neutralize its leader, General Morden, while reclaiming the Metal Slug tanks to aid them in battles. If the tanks could not be recaptured, then they would have to be destroyed to prevent them from being used by the Rebellion. After various campaigns, the Regular Army defeats the Rebellion forces and reestablishes stability. General Morden is apprehended near the end of the conflict and is jailed in a maximum security military prison complex while awaiting trial for his war crimes. The soldiers of the Peregrine Falcons squad were declared heroes by the Regular Army officials, with the lieutenants Marco and Tarma being credited with many awards. However, not everyone treated the P.F. squad as such because Regular Army officials had been discredited by their failure to prevent the Rebellion attack. The PlayStation version is currently being distributed by SNK Playmore as a re-release version and features the Combat School (where you fight with your friends for the best time on each level), an art gallery, and a new game mode dubbed \"Another Story\", which is comprised of a series of plot-based mini-games.", "platform": "Sony Playstation", "release_date": "April 18, 1996", "game_type": "Released", "esrb": "T - Teen", "developers": "SNK", "publishers": "SNK", "genres": "Beat 'em Up", "max_players": "2", "cooperative": "Yes", "rating": "3.55", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95745-metal-slug-super-vehicle-001\n"}