{"altername_name": ["Topolino e le Sue Avventure"], "name": "Mickey's Wild Adventure", "overview": "Mickey Mouse gets a chance to go down memory lane and walk through the timeless adventures he has lived. Mickey Mania is a platformer where all the levels are based on Mickey's most famous cartoons. The levels range about 75 years, starting off with \"Steamboat Willie\" and going all the way to \"The Prince and the Pauper\". The gameplay consists mostly of jumping and marble throwing at enemies, with an occasional puzzle element. Mickey Mania: The Timeless Adventures of Mickey Mouse is the title of a video game released for the 16-bit Sega Mega Drive/Genesis, Sega CD, and Super NES. In the game the player is Mickey Mouse, who navigates through various side-scrolling levels, each designed from classical Mickey Mouse cartoons from 1928 to 1990. The game was later released on Playstation in Europe and Australia as Mickey's Wild Adventure. Originally, Mickey Mania was planned as a game to be released as part of Mickey's 65th birthday. However, as that would have only allowed 6 months to develop the game, this idea was soon scrapped in favor of the more compelling concept of Mickey travelling back to his original cartoons. It pays tribute to Mickey's career (and was released in 1994, the year after Mickey's 65th birthday). The four versions of the game differ greatly from each other. The Super NES version is missing the Band Concert level and the staircase sequence in the Mad Doctor level, as well as a few special effects and some of Pluto's appearances. It also adds loading screens between each area. In contrast, the Sega CD and Playstation versions add a sequence near the end of the Prince and the Pauper level where Mickey must find pencils to call the other Mickeys from the six main levels to attack Pete, as well as giving Mickey extensive dialogue relevant to situations throughout the game. The Playstation version, meanwhile, enhances the graphics and adds a sequence at the end of the Mickey and the Beanstalk level where Mickey must run away from Willie the Giant (Willie makes no appearance in any of the other versions despite being mentioned in the manuals of all four versions).", "platform": "Sony Playstation", "release_date": "March 21, 1996", "game_type": "Released", "esrb": "", "developers": "Traveller's Tales", "publishers": "Sony", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.95", "wikipedia": "https://en.wikipedia.org/wiki/Mickey_Mania", "video_link": "http://www.youtube.com/watch?v=8FOZR9m1lPM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22923-mickeys-wild-adventure\n"}