{"altername_name": ["Mirano No Elevator Collection", "Mirano no Arbeit Collection"], "name": "Milano no Arubaito Collection", "overview": "Young Milano's world involves performing odd jobs (milking cows, cashier at burger, washing dishes, bakery, harvest fruit, nurse, pizza delivery & drummer, etc.) for people using the money to get by for forty days (her mother have to go to the hospital and leave her on charge). The jobs are actually mini games with great variety. After a hard days work you retire home where the correct course of rest and recouperation helps build your experience points opening up new lines of work. A popular title in Japan and quite a rare find. Milano can also buy new furnitures for improve his house like beds, wardroves, etc. to put the new furnitures the player can only do it during the days selecting Milano's house in the towns view. After completing the game, the mini games are all opened and are playable in a new game mode in the main menu. MINI GAMES: - Milking Cows: The goal is to milk the flying cows to do that Milano have to avoid the obstacles and jump to milk them. - Bakery: Move between ingredients and select the proper combination. - Washing dishes: Pick a dish put in on the water, wash it and put in on a new pile, be quick since the piles of dishes are waiting and if they reach the end of the line the whole pile will broke. - Harvest fruit: In this game the fruit falls from a tree and Milano have to be under where they fall to fill his bucket, she also will have to avoid a bee. - Cashier at burger shop: The customers appear and Milano have to go at the back and select the meals that the customer wants after that give them to him, be quick since new customers appear. - Nurse: Different patients awaits Milano's help, they will show a combination of buttons that have to be pressed (some of them in the proper order) to cure the patient. - Pizza delivering: You drive a motorcycle and have to avoid all the obstacles in the road to reach the goal, there are some speed up lines to help Milano to get a better speed, be careful not to crash with things since the motorcycle will stop and you lose time. - Drummer: Press the proper button where the button symbol reach the bottom line.", "platform": "Sony Playstation", "release_date": "July 1, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Victor Interactive Software", "publishers": "Victor Interactive Software", "genres": "Party", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93836-milano-no-arubaito-collection\n"}