{"altername_name": [], "name": "Million Classic", "overview": "Million Classic is a horse breeding simulation game that features a lot of different horse races for the player to breed the best horse and the final goal of the game is to win the Million Classic Cup. The player can buy different horses and mix between different species of horse to create the perfect horse racing champion. Maryland Million Classic is an American Thoroughbred horse race held annually in October since 1986 primarily at Laurel Park Racecourse in Laurel, Maryland or at Pimlico Race Course in Baltimore. To be eligible for the Maryland Million Classic, a horse must be sired by a stallion who stands in Maryland. Due to that restriction the race is classified as a non-graded or \"listed\" stakes race and is not eligible for grading by the American Graded Stakes Committee. The race is part of Maryland Million Day, a 11-race program held in mid October that was the creation of renowned television sports journalist Jim McKay. The \"Maryland Million\" is the first State-Bred showcase event ever created. Since 1986, 27 other events in 20 states have imitaded the showcase and it's structure. In its 24th running in 2009, the race was restricted to those horses who were sired by a stallion who stands in the state of Maryland. Both the entrant horse and their stallion had to be nominated to the Maryland Million program. The race itself has had many titles since 1986 due in large part to the aggressive marketing efforts of Maryland Million Limited, the series corporate founder. In its first seven years, from 1986 through 1992, the race was called the \"Budweiser Maryland Million Classic.\" From 1993 through 1996 the race was known as the \"First National Bank of Maryland Classic.\" From 1997 through 2004 the race was known as the \"Cosamin DS Maryland Classic.\"", "platform": "Sony Playstation", "release_date": "March 18, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110350-million-classic\n"}