{"altername_name": [], "name": "MLB 99", "overview": "Sony's MLB 99 offers a number of options to set it apart from most games based on the national pastime. The first advancement is a Spring Training mode. This involves creating a player at any position and nurturing him in spring training; if he does well both in the field and at the plate, he'll earn points. If you manage to reach 50 points by the end of spring training, the player will make the parent club's roster. It doesn't just end there, however. The pressure is on your player to maintain his right to play in the majors. If you continually strike out or miss routine grounders, then it's back to the minors. Other notable features include over 200 authentic pitching motions and batter stances, 300 unique animations (including collisions at the plate), and Hall of Fame broadcaster Vin Scully calling the play-by-play. The game features both Major League Baseball and MLBPA licenses, so you'll get real players (based on the 1997 season), authentic uniforms and actual stadiums. Improvements in the batting interface allow you to guess the pitch type and location, swing for contact or power, or adjust your stance. The game utilizes a cursor system for hitting and pitching, with the hitter's ability during the 1997 season affecting its size. MLB 99 also allows you to customize season length, trade players, sign free agents, enter the Home Run Derby or draft a new team. Statistics are tracked by team, player and league leaders, with performance awards given at the end of the season. You will need a memory card in order to save statistics, however. Batter-up, it's time to play ball! Features: * Create and customize a full roster of players are choose from among all MLBPA licensed players * Five modes of play: Home Run Derby, Exhibition, All-Star Game, World Series, and Playoffs * Trade players and sign free agents", "platform": "Sony Playstation", "release_date": "April 1, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "Sony Interactive Studios America", "publishers": "Sony Computer Entertainment America", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.43", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33288-mlb-99\n"}