{"altername_name": [], "name": "MLB 2001", "overview": "989 Sports is back for Major League Baseball's 2000 season! This marks the fifth installment of a series that originated with MLB Pennant Race, and the same batter-pitcher interface used in the three previous titles can be found in this one. So what are you waiting for? It's time for MLB 2001 on the PlayStation! Featuring all of the official stadiums and teams from the 2000 season, you can start swinging at your choice of five game modes: Exhibition, Season, Home Run Derby, All-Star Game, and Franchise. Each player and stadium has specific characteristics and nuances as well. You'll find that Seattle Mariners slugger Jay Buhner has his trademark open stance while smaller players will squat and crowd the plate. Stadiums have characteristics like the \"Green Monster\" in Fenway Park or the waterfalls in Kaufmann Stadium. You will also find over 250 new animations in this game. How about gameplay? Well, MLB 2001 has several new modes for you to participate in. The Franchise mode will let you customize and prepare a team from the ground up. In Season play, you can take a team through varying lengths or play all the way from spring training. You can also quickly get started with an Exhibition or All-Star Game, and players can aim for the bleachers in the revamped Home Run Derby. Want more features to whet your appetite? How about the enhanced Total Control Fielding and Total Control Batting systems? With these game mechanics, you will have ultimate control on how the ball is hit, its direction, and the power and type of swing. In the field, you'll be able to manipulate fielders and tell them what to do. They can dive, jump, slide, and run for the ball. Be careful not to run too close to your teammate, or else a collision could happen! As with the last game in the series (MLB 2000), commentary is provided by actual announcers Vin Scully and Dave Campbell for a television broadcast experience. 989 Sports also called upon baseball player Tony Gwynn and coach Davey Johnson to help develop the AI and playbooks. So if you think you're ready to hit the field and crank some dingers, MLB 2001 might just be your ticket to the Bigs!", "platform": "Sony Playstation", "release_date": "March 29, 2000", "game_type": "Released", "esrb": "", "developers": "989 studios", "publishers": "Sony", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.35", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23730-mlb-2001\n"}