{"altername_name": [], "name": "MLB 98", "overview": "Sony Interactive's MLB 98 represents a significant departure from 1996's MLB Pennant Race, the company's first baseball game on the PlayStation. Players in this game are now made up of polygons, making the transition into 3D, and there is a new cursor option to go along with the traditional timing method used to hit the ball. In addition to the new 3D players and authentic stadiums, more animation has been included to show fluid catches, dives, slides and throws -- even from the knees! Personalized moves of your favorite players are also in the game, so you'll recognize batters by their unique stances or pitchers by their deliveries. MLB 98 also includes six modes of play: Home Run Derby, Exhibition, Season, All-Star Game, Playoffs and World Series. Home Run Derby involves trying to knock as many pitches as you can into the bleachers, while Exhibition lets you choose any two teams for a single game against the computer or a friend. Season mode involves taking one team through a schedule of 162 games (which can be reduced) as you try to win your division and advance to the playoffs. For the impatient players who want to experience the drama of the post-season without the hard work, both Playoffs and World Series modes will let them cut to the chase and jump right into the final few games of the year. Last but not least is the All-Star Game, which pits the most popular players of the first half of the 1996 season against each other in a single-game contest between the American and National League. Rounding out the package are team and individual statistical tracking; the ability to create, trade or release players; and updated rosters to reflect the start of the 1997 season. A memory card with one to four blocks is required in order to save season data such as roster changes and statistics. Features: * Create and customize a full roster of players are choose from among all MLBPA licensed players * Five modes of play: Home Run Derby, Exhibition, All-Star Game, World Series, and Playoffs * Trade players and sign free agents", "platform": "Sony Playstation", "release_date": "July 10, 1997", "game_type": "Released", "esrb": "", "developers": "Sony Interactive Studios America", "publishers": "Sony Computer Entertainment America", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30476-mlb-98\n"}