{"altername_name": ["Kidou Senshi Z-Gundam", "Mobile Suit Z Gundam"], "name": "Mobile Suit: Z-Gundam", "overview": "The story occured right after the titans has been established. In another words, right after operation stardust. The story began when a group of rebel force took over the Gundam mk. II and decided to fight the titans with it. The pilot of the gundam mk. II is Camille, one of the best newtype pilots in the history of Gundam. He was even priased by Char and Amuro as one of the best newtypes. The game is basically a retelling of the important events that occured in Zeta Gundam. The player controls the Gundam MK II in the beginning of the game to fight thru a series of battles that are similiar to those in the story, halfway in the game, the player gets to control the mighty Zeta Gundam. This game is packed into 2 discs, with the same intent as RESIDENT EVIL 2's hook: to allow one to play essentially the same game through the eyes of two different characters, and thus derive from that a different perspective and experience. On Disc 1, you play as Camiyu Vidan, hero of the ZETA GUNDAM series, while on Disc 2 you will play the roll of Quattro Vajna (Char Aznable), the enigmatic freedom fighter for all Spacenoids and Newtypes—as well as a member of the AEUG, a group whose goal is to free the Earth sphere from the evil grasp of the Titans, and to achieve equality for Spacenoid colonists. The game plays very similarly to GUNDAM 2.0, where sorties are interspersed with animated scenes. And as with previous cases, the intermission FMV sequences have all been reanimated, this time using a mix of CG for mecha and background scenery, while using cel-like animation for the characters. With the story now separated into two slightly skewed perspectives via the 2 discs, you can finally glimpse the thoughts and actions of Quattro (Char) during the Grips War, especially at the end of the TV series where he mysteriously disappears. Each scenario is basically a one-on-one fight between your mecha (which varies depending on the scenario and whether you're playing as Amuro or Char, and the enemies. While the player's arsenal differs little between the few mobile suits available, enemies fare better in the variety department. The player's main equipment includes the beam rifle, beam saber, and shield. Occasionally you will have to pick between your beam rifle or the hyper bazooka before the mission starts, but since there is no ammo limit on any of the weapons (simply a recharge time), weapon choice has almost no bearing on success Mobile Suit Z-Gundam has four different play modes. The main story mode features cutscenes, all of which are, of course, in Japanese. Battle mode cuts out all the FMV mumbo jumbo and lets you get right to the fighting. Vs. CPU allows you to choose your opponent and just fight. Link mode allows you to hook two PlayStations up and duke it out with a friend. The game comes with two discs (one for each of the main characters), so you'll be able to link up with only one copy of the game. There are 16 characters to choose from, in all modes except story mode, each of which has different speed, armor, and firepower attributes. During a battle, the mobile suits have two weapons available: The gun is used for long-range attacks while the sword is used to deal damage up close. The game allows you to change elevation as well as direction to give the game a 3D feel. The two robots are kept a little too close together, which results in a slightly claustrophobic setting.", "platform": "Sony Playstation", "release_date": "December 11, 1997", "game_type": "Released", "esrb": "", "developers": "BEC", "publishers": "Bandai", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98402-mobile-suit-z-gundam\n"}