{"altername_name": ["Mobile Suit Gundam v.2.0", "Kidou Senshi Gundam: Version 2.0"], "name": "Mobile Suit Gundam: Version 2.0", "overview": "Mobile Suit Gundam , also known as First Gundam, Gundam 0079 or simply Gundam 79) is a televised anime series, created by Sunrise. Created and directed by Yoshiyuki Tomino, it premiered in Japan on Nagoya Broadcasting Network between April 7, 1979, and lasted until January 26, 1980, spanning 43 episodes. It was the very first Gundam series, which has subsequently been adapted into numerous sequels and spin-offs. It has been almost 80 years since the plan of space colonisation began. During that time, many colony clusters were established. Side 3, the farthest one from Earth, became a Republic, led by Zeon Daikun, whose ideals included the independence of the colonists and thefinal emigration of all mankind to space. Eventually, Side 3 declares itself independent and, with Zeon dead, goes under the control of the Zabi family, whocreate the \"Duchy of Zeon\". Zeon's gigantic industrial output is only matched by Earth's resources, and tensions escalate. Eventually, this leads to thedeclaring of war from the Duchy, in the year of Universal Century 0079. Zeon'ssuperior technology allows them to have the upper hand, with their powerful Mobile Suits, which the Federation lacks... for now. GAME MODES -Story Mode: Play as the RX-78 Gundam against Zeon in 14 missions. -Time Attack Mode: You can play missions you have already passed in Story Mode,to try and make better times in them. -VS U.N.T. Spacy Mode: The game's two extra missions are here, available from the start. You can choose between Char's Zaku-II or Gelgoog and fight the Gundam.", "platform": "Sony Playstation", "release_date": "March 29, 1996", "game_type": "Released", "esrb": "", "developers": "BEC", "publishers": "Bandai", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98400-mobile-suit-gundam-version-20\n"}