{"altername_name": ["Kidou Keisatsu Patlabor: Game Edition"], "name": "Mobile Police Patlabor: Game Edition", "overview": "Patlabor (a portmanteau of \"patrol\" and \"labor\") refers to Mobile Police Patlabor , an anime and manga franchise created by Headgear, a group consisting of director Mamoru Oshii, writer Kazunori Ito, mecha designer Yutaka Izubuchi, character designer Akemi Takada, and manga artist Masami Yuki. The story takes place in what was, at the time of release, the near future of 1998-2002. Robots called \"Labors\" are employed in heavy construction work. The Tokyo Metropolitan Police has its own fleet of Patlabors to combat crimes and deal with accidents involving Labors. The story arcs usually revolve around Tokyo Metropolitan Police Special Vehicle Section 2, Division 2. Noa Izumi is the main protagonist of the series, but all of Division 2 play roles. Noa Izumi Section 2 Division 2 Team 1: The bubbly, perky red-headed gamine labor otaku from Hokkaido. The main character of the show, Noa is usually at the center of the action. Noa loves her labor much like a pet and named it \"Alphonse\", a name previously held by a pet dog and a pet cat, respectively. She's somewhat impulsive, albeit not early as much as Ohta. Noa is arguably the best pilot in Division 2, although both Clancy and Kumagami have shown extreme talent as well but seldom pilot. She has a natural affinity for labors and gets 110% out of them, much to the amazement of her colleagues. Furthermore, she can drink quite a bit more than her co-workers, and recovers from hangovers much faster, since her family runs a liquor store. The basic story is similar to the first movie in which a virus has infected the operating system of many labors (i.e. giant robots). Its your job as a new member of the Tokyo Metropolitan Police Special Vehicles Section 2 to stop the terrorist responsible and protect the citizenry (and cause as little damage as possible). The storyline is fully voice-acted by the original actors, a huge plus for fans of the series. The battles put you in control of the AV-98 Ingram-3 in the streets and underworld of Tokyo. Oddly enough, the battle system is reminiscent of Xenogears.", "platform": "Sony Playstation", "release_date": "November 30, 2000", "game_type": "Released", "esrb": "", "developers": "Bandai", "publishers": "Bandai", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33430-mobile-police-patlabor-game-edition\n"}