{"altername_name": [], "name": "Money Idol Exchanger", "overview": "This game is a Japan-only port of the original Neo-Geo MVS Arcade system game of the same name (aka. \"Money Puzzle Exchanger\" in America), but it replaces the in-game synthesized audio of the original with enhanced digital audio soundtrack from the CD on top of other minor features. Money Idol Exchanger is a stacking game similar to the Magical Drop, Astro Pop, and Puzzle Bobble series whereby players race to prevent a perpetually falling array of coins in different values from filling up the screen. Coins are combined (vertically and/or horizontally) to form higher valued coins; for example, five '1' coins will form a '5' coin, and two '5' coins will form a '10' coin, and so on, until two '500' coins are put together, at which point both disappear. Coins are arranged and colored to match denominations of the yen coins. Two bonus tiles allow for changes in gameplay. A green RU tile will rank up all coins of the same denomination; for example, all '10' coins will become '50' coins. A blue ER title will erase all coins of the same value. The game is won when any coin reaches the bottom of the opponent's screen. In the single player mode, one of two characters can be selected who attempt to beat up to seven idiosyncratically named characters with names like Debtmiser, Mightdealer, Eldylabor, and Cherrybeiter. In the two player mode, both players fight each other until victory. The quicker and more efficiently each player clears out their screen, the quicker the other player's screen will fill up. Since filled screens offer the most opportunity for chaining together large combos, the tide can turn very quickly. There is also another single player mode called Solo Mode. Any character can be played in this mode. The aim in Solo Mode is to continually clear the screen from coins and try to keep the game going for as long as possible.", "platform": "Sony Playstation", "release_date": "November 5, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "FACE", "publishers": "Athena", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/25018-money-idol-exchanger\n"}