{"altername_name": [], "name": "Monkey Hero", "overview": "The Waking World, Dream World and Nightmare World all coexisted long ago to maintain harmony among all living things. This careful balance was ensured by the Magic Storybook of Dreams, preventing those who lived in the Nightmare World from entering the other two worlds and filling them with despair. Now many years later, the Nightmare King has figured out a way to steal the Magic Storybook of Dreams and threatens to upend the balance of the three worlds. Only one creature can hope to stop the evil Nightmare King: Monkey Hero. Monkey Hero draws from many of the elements found in The Legend of Zelda: A Link to the Past as you guide the title character through dungeons, strange lands and numerous puzzles while fighting enemies in real time. The simian hero will be able to use his bamboo staff to swipe at the Nightmare King's minions, throw long-range spears, toss firecrackers, and smash objects with a hammer. Of course, you'll also be able to find various items to help in your adventure, all of which can be stored in an inventory screen for later use. Some of the items you'll find are a Hover Scroll to fly over chasms, a Mega Bracelet to pull or push heavier objects, and candles to light up darkened areas. Monkey Hero will also talk to various inhabitants who may be able to offer some clues or useful tips in the quest to defeat the Nightmare King. Yet before you can face him and restore the worlds to their original state, you must first find the eight pages of the Magic Storybook of Dreams. To make things easier, you'll be able to access a World Map showing the dungeons where each missing page is located. Up to fifteen games can be stored onto memory card, with each save taking you to the beginning of the last room or dungeon entered.", "platform": "Sony Playstation", "release_date": "March 1, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Blam!", "publishers": "Take-Two Interactive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.19", "wikipedia": "https://en.wikipedia.org/wiki/Monkey_Hero", "video_link": "https://www.youtube.com/watch?v=SD4E1SUlMvQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10244-monkey-hero\n"}