{"altername_name": ["ムーンライトシンドローム"], "name": "Moonlight Syndrome", "overview": "Mika lead a mostly ordinary casual life. She usually spent her leisure time participating in after school clubs & kept company with her friends, Yukari and Chisato. This was how Mika Kishi spent most of her days. One day Mika's daily life became warped & abnormal, ever since she turned around when she heard a voice calling to her. Later that night a student (A senior) died in a traffic accident. Her name was Kyoko Kazan. She was a senior at Mika's school who happened to have a visage that looked remarkably similar to Mika Kishi's. Mika never really cared much for Kyoko. Mika was upset about a rumor that she heard about her. It's been said that Kyoko may have been Sumio's lover, whom Mika had a crush on. The accidental death of Kyoko was reported during the evening news. Mika's father raised his voice to call out to his daughter when he saw the Kyoko Kazan news report. Mika \"you're safe with your father.\" He was a bit bemused when he saw the eerie facial similarities that both Kyoko & Mika shared. That night, Mika's entire household paid closer attention to the news broadcast. If only they knew, that this is only the beginning of a contract. A contract that Sumio agreed to, because of his jealousy over Ryo Kazan. A teenage girl named Mika meets a mysterious person on her way home, who warns her of horrifying events that are about to happen to her and her friends. More strange events are happening this evening: a cancelled meeting, a boy who seems to have followed her - but the next day, she almost forgets it... until she hears on the news that her schoolmate Kyoko was killed in a truck accident. Now Mika must find out what is truly happening around her. And so does Ryo, Kyoko's brother, who has been seeing strange dreams lately... A spin-off of the Twilight Syndrome series, Moonlight Syndrome has a similarly text-heavy, low-interaction, linear gameplay with dialogue and/or action choices, which would sometimes influence the course of the narrative. As Twilight Syndrome games (and unlike most Japanese-style adventure games), Moonlight Syndrome has physical character navigation in limited 3D areas. Some scenes - such as most full-screen dialogue portraits, etc. - are depicted as pre-rendered images. The player controls different characters, starting with Mika, then switching to Ryo; most of the gameplay consists of walking/running to the next screen, triggering the next dialogue/scene. There is no other interactivity in the game, and no items.", "platform": "Sony Playstation", "release_date": "October 9, 1997", "game_type": "Released", "esrb": "", "developers": "Human Entertainment", "publishers": "Human Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110362-moonlight-syndrome\n"}