{"altername_name": ["Moon"], "name": "Moon: Remix RPG Adventure", "overview": "A little boy likes to play video games. Day and night he sits in front of his GameStation and plays a game called Moon: a typical Japanese RPG with a sword-wielding hero who kills monster after monster on his grand epic quest. Skipping through the boring, cliche story, the boy continues to play until his mother tells him to stop and go to bed. However, the TV on which he was just playing the game miraculously turns itself on, and the boy is sucked into the world of Moon, a fantasy land called Love-de-Gard. It turns out that the hero of the game that the boy was playing is a troublesome individual, who does nothing else but slaughter various creatures populating the land, barge into people's houses bothering them with questions and taking their possessions without asking, and complain that he \"can't reach the final dungeon\". Souls of the animals the hero has killed find no rest, and the land's inhabitants are horrified. The boy realizes that there can only be one answer to that: love. Moon: Remix RPG Adventure is an adventure game with light role-playing elements that parodies the RPG genre by presenting a situation in which the player character must act in a way opposite to the usual behavior of typical RPG protagonists. There is no combat in the game. Core gameplay resembles that of adventure games: the player explores various locations, talks to characters and solves problems in a non-violent way. The game's world is open-ended, and story progression is non-linear. The world has a day and night cycle as well as an internal calendar, with people following their own schedules daily. The main goal consists of raising the protagonist's \"love level\", which is achieved by fulfilling people's wishes. In many cases it is not immediately obvious what people really wish for, and the player has to gather clues and learn more about the game world's inhabitants in order to find a way to make a particular character happy. Some of these activities are timed. Soul-catching, i.e. resurrecting the animals killed by the hero of the game Moon, is one of the ways to increase the love level. Amassing love points raises the \"action limit\", which is the amount of time the boy can stay in Love-de-Gard. If the action limit falls to zero, the game is over.", "platform": "Sony Playstation", "release_date": "October 16, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Love-de-Lic", "publishers": "ASCII", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.38", "wikipedia": "https://en.wikipedia.org/wiki/Moon:_Remix_RPG_Adventure", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79051-moon-remix-rpg-adventure\n"}