{"altername_name": [], "name": "Mortal Kombat Mythologies: Sub-Zero", "overview": "Mortal Kombat Mythologies: Sub-Zero is a story-driven fighting game that casts you in the shoes of Sub-Zero, and chronicles a series of events that occurred prior to Mortal Kombat 1. In a storyline that is reminiscent of Looking Glass's Thief, the Lin Kuei assassin/thief is sent to steal an important document; this mission proves to be a test from a mysterious character (which turns out to be MK4's Quan Chi) and who charges you upon retrieval of this object to recover an ancient medallion of untold power. However once you retrieve the medallion, Quan Chi reveals that he actually tricked you, and the medallion is the key to awakening the demonic Shinnok (yup, the same baddie from MK4). You must now become a reluctant hero, as you pursue Quan Chi trough hell itself hoping you get to Shinnok before him. Gameplay wise the game takes the Mortal Kombat familiar 2D fighting environment and turns it into a hybrid fighter/platformer game, where you must travel trough hazardous levels running and jumping around as well as fighting your way against both digitized and polygonal enemies. Sub-Zero's interface is the same as in every MK game, with the addition of a \"use\" and \"turn around\" buttons and additions such as an inventory, and a slight RPG twist in which you get exp. for defeating opponents, which translates into new techniques and moves to execute in the game. Technically speaking this game represents the final evolutionary step in the MK's series 2D engines. New features include zooming, 3D lighting as well as 3D backgrounds and characters, etc.", "platform": "Sony Playstation", "release_date": "October 1, 1997", "game_type": "Released", "esrb": "M - Mature", "developers": "Midway Games", "publishers": "Midway", "genres": "Fighting", "max_players": "1", "cooperative": "No", "rating": "3.55", "wikipedia": "https://en.wikipedia.org/wiki/Mortal_Kombat_Mythologies:_Sub-Zero", "video_link": "https://www.youtube.com/watch?v=JL3nWjjyEk4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11161-mortal-kombat-mythologies-sub-zero\n"}