{"altername_name": [], "name": "Mortal Kombat 4", "overview": "In an attempt to save Earth, Raiden began a war with Shinnok, a fallen Elder God, and his minions; a decision that cost many people their lives. The battle raged on for thousands of years and many tournaments were held to find out who was the strongest combatant. The winner would then face the ultimate challenge of defeating one of Shinnok's disciples. After the Earth warriors were successful in overcoming his strongest adversary, the evil god Shao Kahn escaped the Netherealm for one last-ditch effort at world supremacy. Mortal Kombat 4 (straight from the arcades) is back sporting a 3D engine and new features in the gory fighting franchise. Each character (15 selectable) comes equipped with their own unique maneuvers, fatalities, and weapons. That's right, weapons. Fujin, for example, shoots his foes with a crossbow while Sub Zero cools opponents down with an ice scepter. Not only can each character's weapon be dropped and picked up by his or her opponent, projectiles straight out of the fighting arena can be used. Players can pick up rocks and other objects and beat their opponents senseless. The backgrounds and arenas are totally interactive, meaning anything you can see (in the immediate fighting area) can be picked up and used in combat. An assortment of gameplay options are available, including Arcade (1 vs. 1 or 2 vs. 2 Kombat), Team, Endurance, Tournament, and Practice. The Arcade version is the actual game -- choose your character and destiny (four different difficulty levels) and mount an assault against the various characters and Shinnok himself. In the Endurance mode, you can test your skill based on how well you hold up to a barrage of opponents. The Ultimate Endurance option keeps track of your statistics and gives out a \"Kombat\" rating. Mortal Kombat 4 comes equipped with a cheat code entry system, where you can find a code, enter it, and watch what happens. The developers also included extra characters, game options, and other bonuses not included in the original arcade version.", "platform": "Sony Playstation", "release_date": "June 24, 1998", "game_type": "Released", "esrb": "M - Mature", "developers": "Midway", "publishers": "Midway", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8028-mortal-kombat-4\n"}