{"altername_name": ["Moses: Prinz von Ägypten"], "name": "Moses: Prince of Egypt", "overview": "This is a Playstation game based on the story of Moses (Moses was born in a time when his people, the Children of Israel, were increasing in number and the Egyptian Pharaoh was worried that they might help Egypt's enemies. Moses' Hebrew mother, Jochebed, hid him when the Pharaoh ordered all newborn Hebrew boys to be killed, and the child was adopted as a foundling by the Egyptian royal family. After killing an Egyptian slave-master, Moses fled across the Red Sea to Midian where he encountered the God of Israel in the form of a \"burning bush\". God sent Moses to request the release of the Israelites. After the Ten Plagues, Moses led the Exodus of the Israelites out of Egypt and across the Red Sea, after which they based themselves at Mount Sinai, where Moses received the Ten Commandments. After 40 years of wandering in the desert, Moses died within sight of the Promised Land). The PSX game includes: Cartoon film Jigsaw puzzles Colouring game Manufacturer's description: Found by the river, and adopted into the royal family of Egypt, Moses must start on a quest to save his true people, the Israelites, from misery at the hands of their cruel Pharaoh. As well as a great half-hour cartoon video, Moses: Prince of Egypt features an easy-to-use virtual colouring book and a challenging puzzle game. Can the prince of Egypt fulfil his destiny? Features: First person perspective. 2D graphics Cartoon graphics Bible & Ancient Egypt themes.", "platform": "Sony Playstation", "release_date": "January 9, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "The Code Monkeys", "publishers": "Midas Interactive Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.31", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=aPPvElEYLhU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79381-moses-prince-of-egypt\n"}