{"altername_name": [], "name": "Mouri Motonari: Chikai no Sanshi Mouri", "overview": "Mouri Motonari - Chikai no Sanshi Mouri (Mouri Motonari: Oath of the Three Arrows) is the third entry of Eiji Fukuzawa's Eiketsuden series, a series of simulation games that portrays the titular historical figures in a heroic image. At the time of the game's release, the similarly themed Taiga drama was being broadcast. It is the only title in the series to not have multiple endings. The title surrounds the lives and conquests of Motonari Mori and his grandson. Time passes through fixed intervals in this title and several characters visually age throughout the story. Players can witness the childhood names for several daimyo and may see them grow into adulthood. In Motonari's case, he ages from a child to an elderly man and dies within the story. Following his death, the player finishes the game with Terumoto. The story modestly follows historical events until Terumoto leads the clan. Character designs were made by Hitoshi Natsume who later worked for visuals on the first two Kessen titles. After the obligatory story scenes for each chapter, the player can actually control the main hero by using the mouse to hover and left click on areas of interest. In the home console versions, a cursor is placed on the screen to represent the mouse. The player can use the directional pad to move it to select objects with the confirm button. Through this method, the protagonist may choose to talk with their fellow vassals or people living within their territory. Chatting with people may reward the ally army with random stat boosts, additional gold, or items. The main hero can choose to leave an area by pressing the cancel button. During the bird's eye view of the city, the player may visit a single building by highlighting on its name and confirming their choice.", "platform": "Sony Playstation", "release_date": "February 26, 1998", "game_type": "Released", "esrb": "", "developers": "Koei", "publishers": "Koei", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110365-mouri-motonari-chikai-no-sanshi-mouri\n"}