{"altername_name": [], "name": "Mr. Driller", "overview": "Mr. Driller loves to drill. So when Downtown was mysteriously overrun with colored blocks, he was the obvious choice to get to the bottom of the situation. Armed with his trusty jackhammer, he begins his descent toward the Earth's core. Our hero can drill up, down, left and right. Drilling through single blocks would take forever, so it's fortunate that blocks of the same color form into groups that vanish when only one of the blocks is drilled. This allows for chain reactions, since vanishing blocks will often cause other blocks to fall and form new groups. Alas, these falling blocks are also deadly if they hit Mr. Driller. If all Mr. Driller had to do was drill, life would be easy. But he also has to keep refilling his oxygen supply by collecting air capsules scattered throughout the blocks. The deeper he goes, the faster his air runs out. Hampering his progress even further are brown \"X-blocks\" that take five drill strikes to disappear and remove 20% of Mr. Driller's air when broken. The Arcade game consists of two courses: Easy (2,500 feet) and Hard (5,000 feet). A course is completed when Mr. Driller reaches the target depth. Bonus points are awarded if the course is finished in record time or if Mr. Driller has lives to spare (30,000 per life). Each single block is worth ten points; groups of four or more earn 40 points per block; and air capsules earn points on an increasing scale: 100 for the first, 200 for the second, 300 for the third, etc. The PlayStation version features two additional modes: Survival and Time Attack. In Survival mode, Mr. Driller must drill as deep as he can using only one life. He can begin at the surface, 5,000 feet or 10,000 feet. In Time Attack, Mr. Driller must drill through a predetermined course and beat the record time. Instead of air capsules, he collects clocks to decrease the timer. Initially, there are only four available courses, but more are unlocked when those are completed. Features: * Quickly drill through colored blocks before your air supply runs out * Features three play modes: Arcade, Time Attack, and Survival * Save progress and high scores to memory card", "platform": "Sony Playstation", "release_date": "October 5, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Namco", "publishers": "Namco", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.58", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=oVs16qsxpSU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/16843-mr-driller\n"}