{"altername_name": [], "name": "Muppet Monster Adventure", "overview": "Kermit and friends have agreed to go with Doctor Honeydew so he can attend his late Uncle Petry's will ceremony. The problem is that the house appears evil, and they begin to tremble as they knock on the door. Suddenly, Kermit's nephew Robin passes out from sheer terror as he sees a dark figure. When he awakes, only Doctor Honeydew, Beaker and Pepe are around. Apparently, Kermit, Miss Piggy, Gonzo and the others have been turned into hideous monsters! The surrounding village is slowly withering away and turning completely evil. Now, armed with a special evil absorbing glove and backpack, you must help Robin to eradicate the evil and save his friends. This game is a single-player adventure in which you must guide Robin through the areas to collect evil energy and items before turning his friends back to normal. In each level, you must collect enough evil energy to advance to the next. Muppet tokens and Morph Amulet Pieces are also essential to collect as they allow you to gain certain morphing skills needed to complete the levels. These skills include block pushing, smashing, climbing, swimming and gliding. Once you gain enough evil energy and morphing skills, you'll be able to take on one of your friends as a monster for the boss. Once you defeat them, they will turn back to normal and you'll be one step closer to saving the land. Collect Muppet power-ups to restore your life and gain evil energy. Colored Stars can be found for their evil energy and some of them are locked inside pumpkins, knight helmets, and boxes that you have to break open. Sub-lives allow you to replenish life taken from being hit, while bonus sub-lives allow Robin to gain more life. Bonus Letters open a special chest in the level for an extra Muppet Token, Extra Life tokens are available in glass jars, and coins allow you to unlock gallery images and sounds (if you have an available memory card). The Gallery is accessible through the main menu. It is a collection of Muppet images and sounds. If you defeat levels twice and save your progress, you'll be able to unlock new images. You (Robin) are the only one who can destroy all of the evil and save your friends, because the glove and backpack were specifically created for amphibious DNA (just your luck)!", "platform": "Sony Playstation", "release_date": "November 8, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Magenta Software", "publishers": "Midway Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.72", "wikipedia": "https://en.wikipedia.org/wiki/Muppet_Monster_Adventure", "video_link": "https://www.youtube.com/watch?v=heNLtykxgr4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31693-muppet-monster-adventure\n"}