{"altername_name": [], "name": "Muppet RaceMania", "overview": "Muppet RaceMania is a kart-racer for the PlayStation console. Starring the likes of the loveable Kermit the frog, the violent but always sweet Miss Piggy, Fozzie Bear, whose inspiration for racing is to make it the other side, the human cannonball Gonzo, Rizzo the Rat, who enjoys an occasional slice of cheese and likes nothing more than pulling obnoxious one-liners, the wild thing Animal, as well as Rowlf, Beaker, Dr. Bunsen Honeydew, Scooter, Sam The Eagle, the groovester Floyd Pepper and even those grumpy old men, meaning all of your favorites are here. Muppet RaceMania is split into the following modes from the main menu: Meet the Muppets (you may check up on what Muppets are currently available and take them for a test spin), Select Course (a single race mode of sorts where each of the six tracks is based upon a Muppets movie), and Tournament, which is available in one- or two-player competition split into two racing divisions. Also from the main screen, racers can dive into a status screen to see just how much of the game they have unlocked (there are four bonus courses to earn including one located in Fraggle Rock for anyone who remembers the television show). Numerous weapons also play a major role in cleaing up the compeitition and consist of fish missiles, bouncing bombs, landmine penguins, homing chickens, and more. Courses in Muppet RaceMania are located inside 3D worlds modeled upon Muppet movies. Locations include space, swamps, mansions, jetties and ships, Christmas fun worlds and many others. The Options menu will let players adjust the sound, controller configuration, and the screen.", "platform": "Sony Playstation", "release_date": "October 3, 2000", "game_type": "Released", "esrb": "", "developers": "Traveller's Tales", "publishers": "Midway", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.93", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=kzZa9jQOf1Q", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28055-muppet-racemania\n"}