{"altername_name": ["Naruto: Shinobi no Sato no Jintori Gassen"], "name": "Naruto: Shinobi no Sato no Jintori Kassen", "overview": "Naruto: Shinobi no Sato no Jintori Kassen is a Japanese-only board game-style video game based on the popular manga and anime series Naruto by Masashi Kishimoto. It was developed by Denyusha and Dimps and published by Bandai. The game is board based gameplay and you go throught the anime exactally. As you progress throughout the board you lay down traps using your chakra and when an opponent lands on it they have the option to take the damage or fight. If you fight your character runs over to where he is and you two do battle. You have all the moves that naruto can do in the anime including his Sexy Jin Jutsu and his Clone Jutsu. Also including unlocking the power of the Nine-Tail Fox power. Naruto is an ongoing Japanese manga series written and illustrated by Masashi Kishimoto. The plot tells the story of Naruto Uzumaki, an adolescent ninja who constantly searches for recognition and aspires to become a Hokage, the ninja in his village that is acknowledged as the leader and the strongest of all. The series is based on a one-shot comic by Kishimoto that was published in the August 1997 issue of Akamaru Jump. PLOT: Naruto Uzumaki is a young boy who has the Nine-Tailed Demon Fox sealed within him. Twelve years before the start of the series, the Nine-Tailed Demon Fox attacked the ninja village Konohagakure, slaughtering many people. In response, the leader of Konohagakure and its ninja military the Fourth Hokage sacrificed his life to seal the demon inside Naruto when he was a newborn. Konohagakure, however, regarded Naruto as if he were the demon fox itself and mistreated him throughout most of his childhood. A decree made by the Third Hokage, who replaced the Fourth Hokage after his death, forbade anyone mention the attack of the demon fox to anyone else. This included Naruto, who was not aware of the demon inside of him. Years later, Naruto is tricked by the renegade ninja Mizuki into stealing a forbidden scroll, but he is stopped by his teacher, Iruka Umino. When Iruka almost dies while protecting Naruto from Mizuki, Naruto uses a Jutsu he learned from the scroll that creates multiple clones of himself, Shadow Clone Technique, to defeat Mizuki. This encounter leads Naruto to realize that he is the container of the demon fox. The main story follows Naruto and his friends' personal growth. The one and only original Playstation release, the title is a strategic board game. \"Jintori\" is a children's game in Japan. The aim of the game is to occupy your opponent's home base. You can unlock the character profiles,objects, etc. The game has differents modes: -History -Party mode -Mini-games mode in which you play the two mini-games.", "platform": "Sony Playstation", "release_date": "June 26, 2003", "game_type": "Released", "esrb": "T - Teen", "developers": "Dimps / Denyusha", "publishers": "Bandai", "genres": "Board Game", "max_players": "4", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/25033-naruto-shinobi-no-sato-no-jintori-kassen\n"}