{"altername_name": [], "name": "NASCAR Thunder 2004", "overview": "NASCAR Thunder returns to PlayStation with all 23 authentic Winston Cup venues and 11 new fantasy tracks. The Career mode features a redesigned interface as players strive to develop relationships with sponsors, crews, and research teams during a span of 20 years. Aggressive drivers will no longer be tolerated in the game, with computer opponents aiming for retaliation if players cut them off or brush against them during the heat of the race. The consequences of wrecks are also more apparent in this version, as errant cars flip, ricochet, and bounce back into the field of play before bursting into flames. Features: Make smart business decisions to build a dynasty over the course of a 20-year racing career Includes mini-games designed to test your skills in passing, blocking, drafting, and speed Relive 40 of NASCAR's finest moments in the game's \"Lightning Challenge\" mode, hosted by Michael Waltrip Manufacturer's description: Race the pack, not the track REALISTIC VEHICLE PERFORMANCE: Includes tire grip and wear, handling and suspension, and collision physics CUSTOMIZE YOUR CAR: Select from multiple car skins to customize your racing machine COMPLETE CONTROL: Stability control & auto-braking driving aids help rookies drive like pros, keeping you on the track and teaching you when to brake COLLECT THUNDER PLATES: Unlock tracks and cheats as you prove your NASCAR expertise. 40 NASCAR DRIVERS: Stars from the NASCAR Winston Cup Series, NASCAR Busch Series, and Racing Legends including Dale Earnhardt and Richard Petty.", "platform": "Sony Playstation", "release_date": "September 16, 2003", "game_type": "Released", "esrb": "E - Everyone", "developers": "Budcat Creations", "publishers": "Electronic Arts, Inc.", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.3", "wikipedia": "https://en.wikipedia.org/wiki/NASCAR_Thunder_2004", "video_link": "https://www.youtube.com/watch?v=7jruYFUQtgs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/77170-nascar-thunder-2004\n"}