{"altername_name": [], "name": "NASCAR Rumble", "overview": "Did you ever want to take control of over 750 horses and drive 200 M.P.H. on twisting, open-road courses through the heart of America? You now have your chance with NASCAR Rumble for the PlayStation from EA SPORTS. Race Arcade-style in tricked out cars as one of nearly 40 NASCAR stock car and truck drivers, including Jeff Gordon, Dale Jarrett, Tony Stewart and Dale Earnhardt. After winning a championship race, you can even challenge the courses as \"The King\" Richard Petty, Benny Parsons or five other NASCAR legends. You will race at full speed over mountain, desert and beach courses -- on and off the road. The driver who handles big air, finds the short cuts, and dishes the best power-ups like the wicked \"twister,\" wins. NASCAR Rumble features six racing locales from Daytona Beach, The Badlands and on to the California Gold Country, with 18 unique courses and hidden tracks that can be unlocked. Racers earn new tracks, upgrades and faster NASCAR cars and trucks, as they progress through five different game modes: One-Player, Two-Player, Team Racing, Time Trials (Local Championships) and Legend Challenge races. There are also numerous hidden vehicles such as a golf cart, and a rocket car that can be earned by winning championships. While racing all across America, you can listen to a music soundtrack that includes original tunes from slide guitar sensation Derek Trucks of The Derek Trucks Band. The game's blow-by-blow commentary is provided by Jess Harnell, whose voice can be heard on the Animaniacs and The Tick animated series. Designed to appeal to many types of racers, NASCAR Rumble offers multiple difficulty levels from a \"no mistakes\" mode for little brother to advanced racing modes that will present challenges for experienced drivers. NASCAR Rumble also contains numerous power-ups including Nitro, Storm Cloud, Oil Slick, Bad Fuel, Freeze, Super Traction, Twister, Sonic Boom and Big KO. Purists can choose to race with no power-ups at all, and those brave souls who dare can race in Total Chaos mode with non-stop power-ups. The game supports vibration functionality as well as analog control for enhanced gameplay. With the slogan \"No Rules. No Ovals. No Limits!\" touting the game's release, be prepared for some high-powered action-packed racing.", "platform": "Sony Playstation", "release_date": "February 3, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Redwood Shores Studio", "publishers": "Electronic Arts", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "4.06", "wikipedia": "https://en.wikipedia.org/wiki/NASCAR_Rumble", "video_link": "https://www.youtube.com/watch?v=_rusZn6tgEY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32451-nascar-rumble\n"}