{"altername_name": [], "name": "NASCAR Thunder 2003", "overview": "NASCAR Thunder 2003 for PlayStation offers NASCAR Winston Cup fans Quick Race, Single Race, Season, and Thunder Plate challenge modes, customizable car skins, enhanced stability control and auto-braking, and multiple gameplay options. Ten fantasy road courses and a 1950s Daytona Beach track complement 23 regular NASCAR circuits, with action for up to two players in head-to-head competition. As in other iterations of NASCAR Thunder 2003, season mode is at the center of the action and features Race Weekend options of tuning your car in the garage, practice, qualifying, happy hour, and the main event. Season mode options include full or half season racing with default or fantasy settings, a road course challenge, speedway shootout, short track challenge, or custom season configuration. Cheats and unlocked tracks earned during Thunder Plate challenges are available only for Single Race mode. In-race displays show split times using segmented time traps, current lap times, car damage, track position, fuel, tachometer, and speed. Change two or four tires, control fueling (full or splash-and-go), repair damage, or make wedge adjustments during pit stops, and utilize the NASCAR options menu to customize car damage, engine breakdowns, race length and pit scaling. Features: More than two dozen tracks including fantasy and regular NASCAR venues Quick race, single race, or seasonal modes using 23 Winston Cup tracks, ten fantasy road courses, or the 1950's Daytona Customize car and driver or race as one of several available NASCAR drivers Unlock cheats and tracks in Thunder Plate challenges for single race mode Two player head-to-head competition", "platform": "Sony Playstation", "release_date": "September 19, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Budcat Creations", "publishers": "Electronic Arts", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.62", "wikipedia": "https://en.wikipedia.org/wiki/NASCAR_Thunder_2003", "video_link": "https://www.youtube.com/watch?v=i-ozmsj8JTg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/34379-nascar-thunder-2003\n"}