{"altername_name": [], "name": "NASCAR Heat", "overview": "NASCAR Heat is a racing game designed to appeal to both hardcore race fans and casual gamers alike. The game features several unique challenges and options to adjust realism and playability. The game's physics model has two settings for play: Normal mode and Expert mode. At the Normal setting, players can focus on basic steering and jockeying for position against other cars on the track, leaving some of the more sophisticated car-handling concerns out of the mix. The physics model becomes much more realistic in the Expert mode and players must compensate for many of the environmental and inertial factors that influence real drivers on real courses. There are several modes of play in NASCAR Heat. In the regular mode, AI opponents adjust to match the player's skill, slowing down a little when the player falls behind but speeding up when the player pulls ahead. In the \"Beat the Heat\" mode, players are assigned different challenges by real-life NASCAR drivers, often through a video clip featuring the professional racer. The \"Race the Pro\" mode of play pits the player against ghost cars that were actually played by NASCAR superstars, providing the player a unique opportunity for an honest test of skill against the likes of Dale Earnhardt or Jeff Gordon. Features: Offers 38 challenges in six increasingly difficult \"sets\" Choose one of 27 famous NASCAR stars and their cars, and race in an event from the NASCAR 2000 event schedule Customization features include realism settings, opponent strength, length of the race, number of opponents, and more", "platform": "Sony Playstation", "release_date": "November 6, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "DiCE", "publishers": "Hasbro Interactive", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "2.75", "wikipedia": "https://en.wikipedia.org/wiki/NASCAR_Heat", "video_link": "https://www.youtube.com/watch?v=ouBLjEKiY2A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/77169-nascar-heat\n"}