{"altername_name": [], "name": "NASCAR 99: Legacy", "overview": "Driver personalities, tense fender-to-fender tactics, and the white-knuckle anxiety of NASCAR's circuit speeds onto the PS in NASCAR 99. Features include 37 real-life cars (24 on the track in any given race), 17 licensed tracks, night racing, split-screen mode for two-player action, and single race or seasonal gameplay modes. Driver statistics are based on the 1997 season, and the NASCAR point system is utilized to track standings. Skilled driving in Championship mode will unlock legendary drivers like Bobby Allison, Cale Yarborough, and Richard Petty. Single Race mode lets you choose a driver, car, and track, as well as adjust pit mode, race length, damage, physics/AI setting, display, breakdown, or yellow flag options, before racing against 23 computer-controlled drivers at a specific venue. The Single Race Weekend menu lets you spend an entire weekend of activities at your favorite track, with car setups, practice, and qualifying preceding the race. Car setups feature settings for speedometer, fuel, wheel lock, rear spoiler, shocks, tire pressure, weight jacking, and transmission. Championship season offers a full-event package of 18-races to establish the top driver, while split-screen action allows two players to select specific cars and a track to compete head-to-head. Features: 37 NASCAR drivers and cars (24 on-screen per race) and 17 licensed tracks Single-race, seasonal, and two-player split-screen modes Unlock legendary NASCAR drivers in Championship mode Pre-race car setups, practice and qualifying Day or night racing LEGACY VERSION FEATURES: Dale Earnhardt, Jr. joins the field of 37 NASCAR Drivers 16 Licensed NCASCAR tracks - now including Miami-Homestead Speedway Authentic head-to-head NASCAR racing 2 Player split-screen racing - race father vs. son Championship season mode Exclusive Two-man booth featuring Bob Jenkins and Benny Parsons 24 Hi-res cars on the track Includes NASCAR Rocks Music CD!", "platform": "Sony Playstation", "release_date": "May 10, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Stormfront Studios", "publishers": "Electronic Arts", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92707-nascar-99-legacy\n"}