{"altername_name": [], "name": "NBA Live 2000", "overview": "Electronic Arts' long-running hoops series continues with NBA Live 2000 for the PlayStation. This five-on-five contest includes the majority of the players on the rosters of all 29 NBA teams from the 1998-1999 season, including Tim Duncan and Kevin Garnett. For a blast from the past, you can unlock 60 basketball legends, including Larry Bird, \"Magic\" Johnson, \"Dr. J\", Wilt Chamberlain and Bill Russell. Oh yeah, some guy by the name of Michael Jordan also made the cut. To play as Jordan, you must first beat him in a game of one-on-one. In NBA Live 2000 you can take a team from the first game to the championship for up to 10 consecutive seasons. Throughout a season, certain members of your team will experience hot and cold streaks, and injuries will invariably occur. You can draft and trade players, create new players and customize the makeup of your team and the size of the league. Complete statistics are kept for each player. If you're not interested in playing an entire NBA season, you can work on the fundamentals of the game in the Practice Mode, play an exhibition game or simply jump right into the playoffs. If outside jumpers are your thing, up to eight players can compete in a Three-Point Shootout. Also, a street court is available for use in playing one-on-one against NBA greats from the past and present. Street ball can be played at night or during the day. NBA Live 2000 features new (to the series) player reactions such as high fives, knuckle touches and more. You can select offensive and defensive sets, or have the computer do it for you. Other options and features include stutter steps, fakes, spin moves, hand checks, instant replays, shot displays, automatic positioning for rebounds, automatic substitutions and multiple camera angles. A turbo button is available for an extra boost of speed. In-game speech and color commentary round out the live experience. Features: Featuring a full roster of 29 teams from the 1998-1999 season including Tim Duncan and Bill Russell Adjust your game winning strategy as players are injured or suffering from cold streaks Take the court alone or with friends in multiplayer activities including one-on-one and three-point shot gameplay", "platform": "Sony Playstation", "release_date": "November 17, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Canada", "publishers": "EA Sports", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "3.38", "wikipedia": "https://en.wikipedia.org/wiki/NBA_Live_2000", "video_link": "https://www.youtube.com/watch?v=vCaADUIjLIY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/555-nba-live-2000\n"}