{"altername_name": ["NBA Jam T.E."], "name": "NBA Jam: Tournament Edition", "overview": "NBA Jam T.E. features 2-on-2 fast-paced and unrealistic basketball. Following in the tradition of NBA Jam this game is filled with super dunks and has no out-of-bounds. Also featured are 9-point plays, rookie and all-star teams, injuries, and fatigue. A variety of power-ups allow: monster jams from anywhere, speed increase, power increase, unlimited turbo, increased 3-point ability, catch fire, and a bomb that flattens all of the other players. There can be anywhere from three to five players included from each of the 27 NBA teams. Overall more than 120 players are included, some of which will have to be unlocked before you can use them. The T.E. in the title stands for Tournament Edition, which is what sets it apart from other games in the series. In the tournament all power-ups and cheats are disallowed. Aside from the usual secret characters and cheat modes, the T.E. also includes four new additions you can individually enable from the special options menu: - \"Hot Spots\" are randomized zones on the court that reward extra points (up to a 9-point shot!) for making a basket while standing within them. - Powerup icons appear randomly, and convey temporary arcade-like benefits when picked up. Some examples are instant \"on-fire,\" enhanced 3-point accuracy, monster dunks from anywhere on the court, or a bomb that knocks all other players to the ground. - \"Juice Mode\" increases the speed of the game up to 4x. - \"Tournament Mode\" disables all other modes, special characters, and cheats, and challenges you to defeat all the NBA teams to unlock extra players (2 extra players for almost every team). Winning Tournament Mode also unlocks a higher CPU difficulty level.", "platform": "Sony Playstation", "release_date": "September 5, 1995", "game_type": "Released", "esrb": "E - Everyone", "developers": "Iguana Entertainment", "publishers": "Acclaim Entertainment", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.86", "wikipedia": "https://en.wikipedia.org/wiki/NBA_Jam_(1993_video_game)#Tournament_Edition", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10615-nba-jam-tournament-edition\n"}