{"altername_name": [], "name": "NBA Live 96", "overview": "Officially licensed and endorsed by the National Basketball Association, NBA Live 96 features all 29 NBA teams in addition to two All Star teams and over 300 real players and rosters based on the 1995 season. Additionally, each team's home courts have been faithfully represented with realistic detailing. NBA Live 96 features a wealth of gameplay options including the setting up of actual defensive and offensive patterns, trading players, and setting your own player rosters. If you've elected to play a Season (either shortened or full), you'll be required to meet roster and trade deadlines in addition to leading your team to victory. Players can choose from box and inside triangle offensive strategies to defensive full court presses and half court traps. The Season mode features actual statistic tracking and a full team schedule of games. If you've ever felt like your favorite player doesn't get enough attention, here's your chance to make him shine! Statistics are based on rebounds, assists, points-per-game, etc. Be careful, though -- overplaying the same people over and over again can result in serious injuries. Additionally, players can select a Playoffs mode or a single game of basketball. The Playoffs save you the time and hassle of going through an NBA season; just pick your favorite team and play hard for the championship! Single games of basketball can be played with anywhere between one and eight players (a Multi-Tap device is needed for anything other than two-players). NBA Live 96 features SGI rendered courts and player models with realistic alley oops, dunks, dribbles, and Virtual Stadium technology. There are also multiple camera views that pan from basket to basket or hover above the action with a television-styled presentation.", "platform": "Sony Playstation", "release_date": "March 10, 1996", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Canada", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "8", "cooperative": "No", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/NBA_Live_96", "video_link": "http://www.youtube.com/watch?v=bo0rw0pk6eg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27337-nba-live-96\n"}