{"altername_name": ["Need for Speed: Porsche 2000", "Need for Speed: Porsche"], "name": "Need for Speed: Porsche Unleashed", "overview": "Porsche fans, start your salivating! Electronic Arts' latest installment in the Need for Speed series is a proud tribute to that great, sleek beast. Porsche Unleashed feautures a total of 70 different models, from the original 1948 356 No. 1 to the 2000 996 Porsche Turbo. Explore three deep modes of gameplay, including Evolution mode, Quick Race and Factory Driver. Hardcore Porsche fanatics can even check out the Video Showcase for some narrated clips of Porsches in action. The Evolution mode lets you start at the beginning: 1948, when the first generation of Porsches were ripping up the highways of the postwar world. Start off by purchasing your first Porsche, then trade it in for more, newer, and better models after earning cash purses by winning races. After completing the tournaments in each time period within Evolution mode, you'll advance forward through time to the next generation of Porsches, until arriving at the year 2000's models. The Quick Race mode includes three sub-modes: Chase, Race, and Time Battle. Chase mode puts you in the Porsche of your choice in hot pursuit by the law. Finish the round without getting caught and win. The multi-player option in Chase mode allows you to choose to be the hunter or the hunted. Race mode is just that: an old-school rally race that pits your car against either computer adversaries, or up to three of your best \"friends.\" Time Battle allots you a certain amount of time to complete each lap on a track. When one car finishes a lap, the clock begins to count down faster for each of the dust-eaters behind it until completing the lap themselves. Factory Driver is a unique mission-based mode in which you work your way through the ranks of the company by accepting test-driving missions from the higher-ups. After completing each mission, you receive a promotion and a tougher challenge for the next round. If you're one of those rabid Porsche fanatics that yearns to get behind the wheel of every Porsche ever built, Need for Speed: Porsche Unleashed might be as close as any normal civilian can get to that unique experience.", "platform": "Sony Playstation", "release_date": "February 29, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Eden Studios", "publishers": "Electronic Arts", "genres": "Racing", "max_players": "4", "cooperative": "No", "rating": "3.94", "wikipedia": "https://en.wikipedia.org/wiki/Need_for_Speed:_Porsche_Unleashed", "video_link": "http://www.youtube.com/watch?v=gw2MkF_bBxY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11835-need-for-speed-porsche-unleashed\n"}