{"altername_name": ["Need for Speed: Road Challenge", "Need for Speed: Brennender Asphalt", "Over Drivin' IV"], "name": "Need for Speed: High Stakes", "overview": "Just like its predecessors Need for Speed: High Stakes is an action racing game with a wide selection of exotic sports cars and many different types of tracks. The trademark Hot Pursuit mode game mode from the first game in the series is still present, where players race opponents on tracks filled with regular traffic and police cars that chase the racers. The classic pursuit mode is extended with two additional modes: Getaway and Time Trap. In Getaway the player needs to shake off the police in a set amount of time, or playing as the police trap a speeder before time runs out. In Time Trap an entire race needs to be completed before time runs out, or as the police all speeders need to be arrested. There are minor differences between the two platforms for this game mode, regarding spike strips, road blocks, and back-up. The latter for instance is unique to the PlayStation version. The Pursuit mode is available in multiplayer as well and players can take different sides or race together. It is the first game in the series to introduce a Career mode with a set of challenges. Beating these is rewarded with trophies for unlocks, and money to spend on new cars, repairs and upgrades. In the PlayStation version the Career mode is split up into two different sets of challenges: Tournament (required races) and Special Event (optional races). High Stakes in the title refers to races where players bet their cars. In the PC version these are a part of the Career mode when the player owns more than two cars. In the PlayStation version two players can insert their memory cards and race against each other. The winner immediately receives the opponent's car and it is deleted from the loser's memory card right away. In addition to the new game modes it is also the first game in the series to have a detailed physics models. Damage now affects both the appearance and the performance of the car for the first time.", "platform": "Sony Playstation", "release_date": "March 24, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Canada", "publishers": "Electronic Arts", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Need_for_Speed:_High_Stakes", "video_link": "http://www.youtube.com/watch?v=fmVQt3efScc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8935-need-for-speed-high-stakes\n"}