{"altername_name": [], "name": "Neko na Ka-N-Ke-I", "overview": "Neko na Kankei is a visual novel game in which the player takes the role of a normal highschool student's life who always seems to carry only 30 Yen (US$0.25) with you. Then, one day, he found a stone which looks exactly like a cat's eye. With that, his normal highschool student's life changed a little. The stone has the magical ability to change him into a cat and back whenever he wants. According to Serina, the owner of the stone, he has to wear the stone for 74 days and use it consistently, otherwise bad luck will fall upon him. In additional to that, bad luck will fall upon him if he uses the stone for evil. So, he use it in his quest of learning more about girls. The game is a event-based visual novel type of game and part of a popular genre in Japan, Ren'ai (Romantic Love) genre. The only voice actress that I can recognize is Kuwashiwa Houko-san. Her popular roles are Yurika-chan of Nadesico and Suzune-chan of Tokimeki Memorial. GAME SYSTEM: One game lasts for 10 weeks. Each week is divided into 7 days. Sundays are designated for dates. From Monday to Saturday, you will go to school with a small probability of meeting a girl on your way to school. From Monday to Friday, when it is Lunch time, you will choose to go to a place in school where you think the girl might be at and if the girl is there, you can have a event with her. After school, you can either choose to stay at school to search for your target girl or go out to town to get events at a certain place in town. After all, some girls are working part-time jobs. Most of those events are random, so it is very frustrating when you cannot meet the girl. However, you can limit the places to those places that the girl is most likely to be at. For example, Chiharu-chan is most likely to be in her classroom, at the school hallway or at the school entrance. If you get a girl to like you enough, you will get automatic special event. Saturday is exactly the same as Monday through Friday, except there is no lunch time (as Saturday is half school day). Instead, during recess, you will ask the girl of your choice on a date the next day (Sunday). You will fail if you did not get the girl to like you enough. In the evening from Monday to Saturday, you will turn yourself into a cat and visit a girl's house. Most of the time, you just need to listen to what the girl has in her mind currently. On Sunday, depending whether there is a special occasional or not, you have different kind of dates. If there is no special occasion, you will get to choose three date spots to go to. In additional to that, you must not choose to go to the same date spot, otherwise the girl might get angry and leave you half way. Of course, you choose REALLY bad response, the girl will leave you, as well.If there is special occasion like the night festival, you just follow the flow of the events and you do not need to choose date spots to go to. After any date, the girl will tell you how much she enjoyed the date and for some girls, if they have feelings for you, they will allow you to walk home with them.", "platform": "Sony Playstation", "release_date": "May 11, 1998", "game_type": "Released", "esrb": "", "developers": "Victor Interactive Software", "publishers": "Victor Interactive Software", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136216-neko-na-ka-n-ke-i\n"}