{"altername_name": ["Shin Seiki Evangelion - Koutetsu no Girlfriend"], "name": "Neon Genesis Evangelion: Koutetsu no Girlfriend", "overview": "Neon Genesis Evangelion - Girlfriend of Steel is a video game based on the Gainax anime/manga series Neon Genesis Evangelion, released officially only in Japan. RELEASES: Original version was released by Gainax for Microsoft Windows PCs in 1997. Subsequently, Macintosh version was released in response to requests from Mac users. In April 2006, a \"special\" edition was released for the PS2 and the PC as part of Evangelion's ten-year anniversary, with additional scenes focusing on the TRIDENT pilots' lives. On April 9, 2009, a version for the PlayStation Portable was released. STORY: A shy female character, Mana Kirishima (voice by Megumi Hayashibara, the seiyu of Rei Ayanami), starts at Shinji Ikari's school and immediately admits to finding him cute. Gradually, a relationship unfolds and they end up going on a date. It turns out, however, that she is one of three test pilots for the TRIDENT (alternatively named the \"Country Crawler\") units, a new competitor to the Evangelions, similar to Jet Alone; thus the name Girlfriend of Steel. Eventually, the TRIDENT goes berserk and the Evas have to destroy it. Throughout the game, Asuka Langley Soryu is constantly jealous of Shinji and Mana, consistent with her widely-speculated romantic feelings for Shinji. Rei Ayanami is present but plays a rather background role in the story. The interactivity in most of the game is limited to walking around areas until the next plot event is triggered. However, the one true branch occurs at the end of the game, where the player may choose to focus on Mana, Asuka or Kaji. This choice determines which of the game's three endings are shown. In the Mana ending, Mana is discovered not to have been killed in the battle. Shinji rescues her and brings her back to his apartment. She showers, emerges wearing only a towel, and teasingly asks Shinji if he would like her to remove it. In discussion with Misato, however, it is agreed that Mana has to leave Tokyo-3, and she says a teary goodbye to Shinji who has won her heart. In the Asuka ending, Asuka helps Shinji to get over Mana and the two children grow closer as a result. This ending contains romantic images of Asuka and Shinji together, including a moving scene where Asuka hugs Shinji emotionally. The third ending with Kaji does not focus on any one character as much as the other endings do. Mana is also discovered not to be killed, and says goodbye, with Shinji replying \"I'll be waiting for you\". GAMEPLAY: Unlike the two other Neon Genesis Evangelion games, \"Koutetsu no Girlfriend\" doesn't have any action sequences. You control Shinji by telling him where to go, looking at people, and talking to them. There are no FMVs in the game - all the images are still animé pictures. The game was developed by Gainax, the creators of the animé series.", "platform": "Sony Playstation", "release_date": "June 14, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Gainax Network Systems", "publishers": "Gainax", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Neon_Genesis_Evangelion:_Girlfriend_of_Steel", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110675-neon-genesis-evangelion-koutetsu-no-girlfriend\n"}