{"altername_name": [], "name": "NFL GameDay", "overview": "Calling all armchair football fanatics -- NFL GameDay brings tackles, fumbles, field goals and touchdowns to your living room with a full National Football League license. Featuring rendered 3D graphics, the developers have crammed over 1,500 actual football players along with 30 NFL teams and their respective stadiums onto a single PlayStation disc. Because of the licensing, each team's logo and end-zone visuals have been represented; jersey colors (both home and away) are authentic to the sport. There are four gameplay options including Preseason, Regular Season, the Playoffs and the season-ending Super Bowl. Designed for a quick football fix or novice players, a Preseason game is simply an exhibition match-up in which no statistics are altered. Based on the 1995-96 schedule, the Regular Season is a 16-week campaign against various teams. After selecting the team of choice, you'll control the action by trading players, signing free agents and setting up offensive and defensive strategies -- do whatever it takes to turn your team into a dynasty! Before each game, you're given a chart that compares each team in certain areas; it basically tells you which is favored to win. You can skip the Regular Season match-ups by selecting the Playoffs mode. Done in a tournament fashion, the Playoffs are broken into a scheduled chart. After suffering a loss, your team will be eliminated from the tournament; if you win each game, you'll eventually move onto the Super Bowl. Although it needs no introduction (unless you've never watched American football), the Super Bowl is the National Football League's championship game. Whichever team wins this competition is crowned a champion and each player is given a prestigious victory ring. NFL GameDay features Regular Season statistical tracking that records accumulated sacks, touchdowns and percentages pertaining to each individual player. When on the field, you can select from four unique camera angles including a close-up overhead view of the field an aerial view of the action. Additionally, it comes equipped with weather effects such as sunny skies, fog, driving rains and snowstorms. Features: Run offense and defense with over 500 authentic NFL plays Take the field as one of 30 NFL teams Track stats, trade and release players, and particpate in the draft", "platform": "Sony Playstation", "release_date": "December 4, 1995", "game_type": "Released", "esrb": "E - Everyone", "developers": "Sony Computer Entertainment", "publishers": "Sony Computer Entertainment", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.32", "wikipedia": "https://en.wikipedia.org/wiki/NFL_GameDay_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29069-nfl-gameday\n"}