{"altername_name": [], "name": "NFL Blitz 2000", "overview": "The two teams line up seven per side. It's a typical first and 30 on the initial play from scrimmage. The quarterback snaps the ball only to be pummeled well after the play is over. But there's no flag on the field -- he doesn't even expect one. Why would he when there's no men in zebra-striped shirts (referees) anywhere near the playing field? It's just another day on the gridiron with NFL Blitz 2000. Continuing Midway's popular NFL Blitz franchise, this sophomore effort features all of the original's mayhem -- and then some. The unique elements that distinguished the original from \"realistic\" football games remain intact: fewer players (each with superhuman potential), a faster pace, tougher first down requirements, and bone-crushing, less-than-sportsmanlike (can you say \"understatement\"?) hits, just to name a few. There are several new features that highlight this turn-of-the-millennium edition. As many as four players (up from two) can choose from more plays than featured in the original, even developing some of their own with the new Play Editor. Audibles can now be called at the line, and several new fields and stadiums are available. A simple tap of the L2 button on offense activates the Blitz Passing feature, allowing players to throw to a receiver identified by a button symbol instead of just aiming at one blinking target as in standard play. Also added to this version, a team achieves \"on fire\" status when the defense sacks the quarterback twice in a row or the offense completes three straight passes to a single receiver. Just as in Midway's NBA Jam, the awesome speed and power of a team in such as state (including unlimited Turbo meter) can often mean the difference in a game. It takes a great play from the temporarily overmatched other team to extinguish the flames. Keeping consistent with 1999's adjustments to NFL teams, NFL Blitz 2000 replaces the Oilers with the Tennessee Titans and adds the expansion Cleveland Browns. All other 29 teams are included, of course, each featuring players with abilities based upon 1998 statistics. Even highly touted draft picks such as New Orleans' Ricky Williams are included. As with the previous version, three modes of play are available in NFL Blitz 2000. Try to defeat all 31 teams in Arcade Mode or play through an actual season on your way to the Super Bowl in Season Mode. Meanwhile, gather some friends for the Tournament Mode and guide one of the possible eight teams through the brackets to ultimate victory.", "platform": "Sony Playstation", "release_date": "August 24, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Midway Games", "publishers": "Midway Games", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "4.05", "wikipedia": "https://en.wikipedia.org/wiki/NFL_Blitz_2000", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2652-nfl-blitz-2000\n"}