{"altername_name": [], "name": "NHL FaceOff 2000", "overview": "From 989 Sports comes the new incarnation of NHL FaceOff 2000. Officially licensed by the National Hockey League and NHLPA, it features many authentic bells and whistles that are found in actual NHL games. Everything from crease violations, deflected shots, and strategic play styles have been included with many configurable options. Players are able to shorten or lengthen gameplay, change the difficulty levels, and alter some presentation aspects of the game! The rosters and teams for the 1999-2000 NHL season have been included with the expansion Atlanta Thrashers. Because players can configure strategies, starting lines, and overall setups concerning the team, NHL FaceOff 2000 provides an actual coaching experience! If there are a few stragglers on your roster, trade them to other franchises or dip into the free agency pool. Do whatever it takes to make your team better! Keeping with the newly founded regulations, NHL FaceOff 2000 features many unique and realistic rules including disallowed goals, true-to-life rink dimensions, and rule changes. There is also a wealth of extra options including official three-star presentations, scoreboards, plenty of in-game music, and a television styled coverage. Nailing that coverage home is play-by-play commentary from Mike Emrick and Darren Pang. Among the various gameplay options are the Exhibition, Season, and Playoffs modes. Whereas the Exhibition mode is simply a single game of hockey, the Season is a full 82-game romp for the Stanley Cup! If this seems a little long, choose the Playoffs mode -- this allows players to choose a team and guide them through the playoffs only. NHL FaceOff 2000 also supports the PlayStation multi-tap device for an eight-man action experience! So strap on those skates and get ready to hit the ice!", "platform": "Sony Playstation", "release_date": "August 31, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "989 studios", "publishers": "Sony Computer Entertainment America", "genres": "Sports", "max_players": "8", "cooperative": "No", "rating": "4.04", "wikipedia": "https://en.wikipedia.org/wiki/NHL_FaceOff", "video_link": "https://www.youtube.com/watch?v=r_8DY9E7vuo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/46091-nhl-faceoff-2000\n"}