{"altername_name": [], "name": "NHL Rock the Rink", "overview": "While hockey is known for its fights and brutal checks, it's still a game of rules where the violence is a part of the game, but not expressly encouraged. With video games however, you have the chance to drop the rinky dink rules that hold the action back. NHL Rock the Rink puts your team of choice into a brutal league that's just not for the weak hearted rule follower. EA Sports has made the sport faster, and they've made it blatantly brutal. Not only do you have the standard array of checks and your fists, you have an arsenal of move usually only seen in professional wrestling arenas. Players also have the ability to leapfrog your opponents and they can play power or finesse depending on their team composition. Players also gain fantastical moves like gravity defying air dekes and empowering hot streaks that make your hot player an engine of scoring destruction. A new twist is the touch of boxing added to the game. One player will be initially randomly assigned the belt. The belt holder has better stats than he starts out with. If a player is able to knock out the belt holder, they win the belt and that team member gains the large fighting stat boost along with a general stat boost to make him even more dangerous. To keep the action fast paced and fairly simple, the teams have been knocked down to three on three (not counting the goalies) when they take the ice. Quick passing and crushing body checks interspersed with the odd clothesline and straight-arm rounds out the arena battling. There are multiple play modes to drive the action home as well. Arcade mode will put your team of choice up against another in a brisk exhibition contest. NHL Challenge mode will pit you against the rest of the NHL in basic tournament. You'll have to challenge three difficulty levels to master the mode completely and winning the lesser championships will allow players to earn new gear to improve their teams. King of the Rink mode will toss you into a double elimination tournament which up to eight players can participate in. EA Sports was also able to take advantage of the fewer team members onscreen by using character models with higher polygon counts than their usual five on five hockey games. Hulking brutes take the ice with extra animation. They've also tossed in 10 new arenas with a hard edged run down look about them. ES Sports also added in their own special embellishment to the usual 28 team NHL lineup. Expect to encounter special teams exclusive to Rock the Rink. NHL Rock the Rink offers three on three action reminiscent of other extreme sports interpretations like Mutant League Hockey, Arch Rivals or NBA Jam. Get ready to unload massive hits and brutal combinations as you make a run for the championship.", "platform": "Sony Playstation", "release_date": "March 16, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4.4", "wikipedia": "https://en.wikipedia.org/wiki/NHL_Rock_the_Rink", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/20618-nhl-rock-the-rink\n"}