{"altername_name": [], "name": "NHL 2000", "overview": "This game covers the National Hockey League's 1999-2000 season, with rosters for each NHL team and national team rosters for select hockey nations. It includes the expansion team, Atlanta Thrashers. Each NHL team's ice is faithfully reproduced, although the rest of the rink does not change. In international games, the international rink is used. In general, most hockey games from EA Sports use a familiar interface. Games can be played in Exhibition, Tournament, Shootout, Playoff and Season modes. The Quick Start option allows you to jump right in and start a game, with the computer choosing the teams. Basic and advanced options allow players to customize various aspects of gameplay, from choosing teams and deciding how often penalties will be called, to how frequently players will fight. Certain rules such as icing and offsides can be turned off to open up the game. There are four levels of difficulty, each with unique elements. Rosters rate players in 19 skill categories and display photos of most players, as well as their career stats. The jewel box claims the game has a Career mode and although Season mode contains elements of a Career mode, it was never completed. There are more ways to score in this game - take the goalie high or along the ice. Included is a Big Hit and Big Deke Button function that allows you to knock players over. If that pursues a fight, use the combination of Button Mashing Fights and take on your opponent in a \"brooh-ha-ha.\" And in Career mode, you take your team from the cellar to the Stanley Cup. All of the gameplay and fights are enhanced by the addition of color commentary from ESPN's Bill Clement. NHL 2000 takes one block for each setting and roster file, and up to six blocks for each saved tournament, season and playoff series. The game is also compatible with the Dual Shock Analog Controller. Features: Create a team full of your favorite players from the 2000 season through free agency, dispersal, and rookie draft Play through a variety of modes including Quick Start, Exhibition, Playoffs, and Shootout Skate down the ice as you listen to music from Garbage, Überzone, and Gearwhore", "platform": "Sony Playstation", "release_date": "September 20, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts Canada", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "8", "cooperative": "Yes", "rating": "3.89", "wikipedia": "https://en.wikipedia.org/wiki/NHL_2000", "video_link": "http://www.youtube.com/watch?v=IKqELUH1pYk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30626-nhl-2000\n"}