{"altername_name": [], "name": "Nicktoons Racing", "overview": "Revving up for some racing fun similar to Mario Kart and CTR (Crash Team Racing), Nicktoons Racing for PlayStation has arrived at the starting line. Players choose from one of twelve popular Nicktoons characters and race through 12 tracks while competing in either one- or two-player racing cups or relays. For an added bonus, a mystery driver becomes available after the player completes all levels. Racing begins with each player selecting a character. Some of the characters include Rugrats' Tommy and Angelica, The Wild Thornberrys' Eliza and Darwin, Spongebob Square Pants' SpongeBob and Patrick, and The Angry Beavers' Daggett and Norbert. Initially, four tracks are available in Cup 1, though by completing the race and placing at least third, players may then progress to Cup 2 and Cup 3. Power-ups are randomly available around the track, including Speed Burst Tokens that temporarily boost speed after enough have been collected. Mystery items can also be strategically used to delay competitors. Examples of these include Ickis' Trashcan, Tommy's Talcum Powder, and homing jellyfish and Gooze. Track boost arrows are also randomly available and will cause the cars to temporarily speed up by simply driving over them. Cup races take place on four tracks with the standings from each race recorded. Relay races allow players to choose three characters who take turns running each lap of the race. To reveal the mystery driver, players must win or place in all three cup races on three difficulty settings of easy, medium and hard", "platform": "Sony Playstation", "release_date": "September 7, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Software Creations", "publishers": "Hasbro Interactive", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.32", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=CPpRZaDQeYE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23727-nicktoons-racing\n"}