{"altername_name": [], "name": "Night Raid", "overview": "In the year 3309, humanity has been taken over by computers. The planet was mechanized by the main computer Batinbo at the south pole, and it was thought that all organic life on the planet had been wiped out. Humanity's fight, however, was not yet over. 87 years later, a computer in the desert that was once Asia began a program -- a program called \"Vector\", left by humans just before their extinction, created to restore life to the world. Vector must invade the computer Batinbo, and complete this final mission to revive humanity. Night Raid is a conversion of the 2001 vertical arcade shoot-em-up from Takumi, and has a similar feel to their earlier game Mars Matrix. Like in Mars Matrix, destroyed enemies release pickups, but rather than powering up your weapons they now affect your score multiplier. The multiplier is always slowly counting back to zero, but picking up the Score Items released by enemies will increase it. If a Score Item falls out the bottom of the screen, the multiplier is reduced, and can in fact go into negative, at which point the player will actually lose points for destroying enemies. The score can even go negative, and this is actually a viable method of play as the game will also track the lowest scores in addition to the highest ones. You have a standard shot (upgradable through pickups), bombs (which can also be picked up), and an attack called the \"hagu launcher\" which makes your ship crash into enemy ships to destroy them, and must be recharged after use. The game has six stages, and includes the original arcade mode as well as a score attack mode.", "platform": "Sony Playstation", "release_date": "July 25, 2002", "game_type": "Released", "esrb": "", "developers": "Takumi", "publishers": "Takumi", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.36", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KKy8dYNID-Y", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/52427-night-raid\n"}