{"altername_name": ["Mark of the Mermaid"], "name": "Ningyo no Rakuin", "overview": "Ningyo no Rakuin is a tactical RPG that tells the story of Keisuke Tate Rin and Mizuki Nakayama that are two young lovers that went on a high school graduation trip, and were involved in an accident when their plane crashed and they and a few other passengers were able to survive, when they all fall on an island with only minor injuries. The island is unknown, since it doesn't appear in any map, and had been dominated by an old pagan group, Mizuki believes that they have been abducted. In the island they find a woman in a cross that is goint to be sacrified and they rescued her but in this encounter Mizuki is kidnapped by the natives and the group must try to rescue her. The gameplay is the classic in a tactical RPG game since the player got some units in each game mission and each unit got a limited range of movement for each turn and the player can choose between different physical and magical attacks to defeat all the enemies in each mission. One of the most curious features of the game is that there are characters that are armed with weapons that are the only ones that can defeat the enemies. CHARACTERS: - Keisuke Tate Rin: Hero of the story and he is the chilhood friend of Mizuki - Mizuki Nakayama: She is the heroine of the story and she is an ahtlete, is capture by pagans and trasformed - Howard Carter: Doctor and one of the survivors of the crash plane. The game features different endings since the story changed depending of the player choices during the game.", "platform": "Sony Playstation", "release_date": "March 8, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Highwaystar", "publishers": "NEC Interchannel", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=gsu1Z2Y-LY8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136260-ningyo-no-rakuin\n"}