{"altername_name": [], "name": "Ninku", "overview": "Ninku is a Japanese manga series by Koji Kiriyama, which was later adapted into an anime series, produced by Pierrot and directed by Noriyuki Abe, spanning 55-episodes and a movie. The anime series, originally running between 1995 to 1996, premiered on the Fuji Television network, and was broadcast by the anime television network, Animax, across Japan, Southeast Asia, South Asia, and other regions. The anime series also spawned a movie in 1996, entitled Ninku: The Movie, which was a \"double bill\" (the other movie being a YuYu Hakusho film) release, produced by Pierrot. Media Blasters's AnimeWorks brand released both movies in their original \"double bill\" format across North America in 1998. The story in Ninku is about an odd-looking 12-year-old boy named Fuusuke who is a powerful warrior from the Ninku school of martial arts, a style that mixes ninjutsu and karate. It is explained that before the present time in the story that those who could use Ninku were targeted by an evil empire and the Ninku corps were formed to combat the menace. The names of the corps were taken from the twelve Chinese zodiac animals and each captain of the corps was called the zodiac animal Ninku master . When the war was over, the Ninku were defeated and almost all of them were killed (except for a few corps' captains) since they were useless and were also dangerous for the rulers. At the beginning of the story, three years later, Fuusuke, the young former captain of the 1st Ninku corps and controller of the wind and Hiroyuki , his flatulent penguin, start searching for the other Ninku captains, each of whom can control various elements. However, a new group of Ninku users has arisen and are trying to take over the world. Fuusuke and his penguin must defeat the new Ninku empire with the help of his old comrades. The Playstation game is a 2d fighting strategy game in which the player decide in each turn what movement will do his character. Game Modes: - Story Mode: Play through the game story. There are 3 difficulty levels but only in the hard one the full story can be played. - Vs Mode: Here the player can play against computer opponents - 2 Player Vs Mode: Play against another human player. - Galleries: Snap collection, Character voice collection & Anime movie.", "platform": "Sony Playstation", "release_date": "November 22, 1995", "game_type": "Released", "esrb": "", "developers": "TOMY", "publishers": "Tomy", "genres": "", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134894-ninku\n"}