{"altername_name": ["No Fear Downhill Mountain Biking"], "name": "No Fear Downhill Mountain Bike Racing", "overview": "Pedal power meets polygons in this no-holds-barred cycling experience. Not just another racing game, this title successfully captures the essence and devil-may-care style of competition mountain bike racing. The menu screens feature clanging guitars and jolting graphics that put you in the mood for adrenaline-rushing action. Once you hit the slope, you'll immediately encounter high-speed rough-and-tumble racing featuring huge jumps and varied terrain. From riverbeds to steep city roads, No Fear Downhill Mountain Bike Racing is filled with challenging race environments. While the graphics aren't as crisp as they could be, the speed is certainly here, and when players switch to a behind-the-handlebars viewpoint they'll know what it's like to tread the thin line between fear and control. Six riders are available, each flaunting personality and different strengths. Upgrades such as lighter frames or better tires are awarded after beating three separate opponents on each track. A strength meter decreases after holding the pedal button down for long periods of time. Players will learn to let the bike coast on downhill segments, supplying the riders with bursts of strength for pedaling on flat or uphill segments. This strategy, mixed with the visceral thrill of racing, makes No Fear Downhill Mountain Bike Racing an exhilarating experience.", "platform": "Sony Playstation", "release_date": "November 1, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Unique Development Studios", "publishers": "Codemasters", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "4.03", "wikipedia": "https://en.wikipedia.org/wiki/No_Fear_Downhill_Mountain_Biking", "video_link": "https://www.youtube.com/watch?v=IJADF4yH2bY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18364-no-fear-downhill-mountain-bike-racing\n"}