{"altername_name": ["SuperLite 1500 Series: Nobunaga Hiroku: Geten no Yume", "Nobunaga Hiroku - Geten no Yume"], "name": "Nobunaga Hiroku Ge Ten No Yume", "overview": "Oda Nobunaga (June 23, 1534 - June 21, 1582) was the initiator of the unification of Japan under the shogunate in the late 16th century, which ruled Japan until the Meiji Restoration in 1868. He was also a major daimyo during the Sengoku period of Japanese history. His opus was continued, completed and finalized by his successors Toyotomi Hideyoshi and Tokugawa Ieyasu. He was the second son of Oda Nobuhide, a deputy shugo (military governor) with land holdings in Owari Province. Nobunaga lived a life of continuous military conquest, eventually conquering a third of Japan before his death in 1582. His successor, Toyotomi Hideyoshi, a loyal Oda supporter, would become the first man to unify all of Japan, and was thus the first ruler of all Japan since the Onin War. In the 16th century, Japan's Sengoku (\"Warring States\") period divided the nation into numerous feudal states, each ruled by a daimyo. These daimyos would often go to war with each other. Many dreamt of conquering the land, becoming the Shogun and ruling the entire country. One of those daimyos was the ambitious Nobunaga Oda, a merciless ruler and a renowned strategist. Nobunaga Hiroku Ge Ten No Yume is an adventure / sound novel game based on the life of Oda Nobunaga and like in those kind the player watches the story in a first person view and can only choose an answer in some parts of the game that will take the story in a way or another, and that makes that the game features different endings depending of those choices.", "platform": "Sony Playstation", "release_date": "May 30, 1997", "game_type": "Released", "esrb": "", "developers": "Athena", "publishers": "Athena", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110685-nobunaga-hiroku-ge-ten-no-yume\n"}