{"altername_name": ["Noddy: Una Aventura Magica"], "name": "Noddy's Magic Adventure", "overview": "Noddy's Magic Adventure offers different skill levels from easy to hard to cater for a range of abilities and ages from three years and up. The child gets to journey into a magical adventure in Toyland with Noddy to search for the Wizard's missing magic wand, which has been stolen from the castle by the goblins Sly and Gobbo. The game allows the child to accompany Noddy on his adventures and help him earn an extra-special reward from the Wizard by completing six activities along the way. These activities include: * The racing cars are driving by themselves! Help Noddy catch up to the speeding cars and say a magic spell to stop them. * The goblins have taken all the batteries out of the robots. Put the batteries back in so the robots can finish building their space rocket. * The goblins have made all the balls bounce high in the sky... and stay there! Fly in the aeroplane and sprinkle magic dust to bring them back down again. * Bumpy dog is stranded--those naughty goblins have turned the bridge into jelly! Use the stones to help Noddy cross the stream. * The bluebells in Bluebell Wood have been turned into real bells! Match their tunes to turn them back into bluebells again. * The final chase...! Help Noddy chase the goblins up Snowy Mountain, avoiding obstacles and the snowballs that are rolling down. Can you catch those naughty goblins and return the wand to the Wizard? Features: * Search with Noddy to find the Wizard' missing wand * Help Noddy discover the mystery of the strange happening in Toyland * Can he get the wand back from the nasty goblins? * Fly aeroplanes, drive cars and teach those goblins a lesson", "platform": "Sony Playstation", "release_date": "December 1, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Mind's Eye Productions", "publishers": "BBC Multimedia", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "https://en.wikipedia.org/wiki/Noddy%27s_Magic_Adventure", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92697-noddys-magic-adventure\n"}