{"altername_name": [], "name": "Oha-Studio Dance Dance Revolution", "overview": "Oha Studio - Dance Dance Revolution is a Dance Dance Revolution game for the Sony PlayStation console. The game features songs from the Japanese children's' TV show Oha Studio. There is no arcade counterpart. Music: As previously mentioned, the game primarily consists of songs from Oha Suta, but the game also features several Konami Originals, such as \"Cutie Chaser (Morning Mix)\", \"Brilliant 2U\", \"Keep On Movin'\" and \"Make a Jam!\". Gameplay: The core gameplay involves the player moving his or her feet to a set pattern, stepping in time to the general rhythm or beat of a song. Arrows are divided by 1/4 notes, 1/8 notes, and so on (with differing color schemes for each), up to about 1/32 notes. During normal gameplay, arrows scroll upwards from the bottom of the screen and pass over a set of stationary arrows near the top (referred to as the \"guide arrows\" or \"receptors\", officially known as the Step Zone). When the scrolling arrows overlap the stationary ones, the player must step on the corresponding arrows on the dance platform, and the player is given a judgement for their accuracy (Marvelous, Perfect, Great, Good, Almost (close miss), Boo (complete miss)). Longer green and yellow arrows referred to as \"freeze arrows\" must be held down for their entire length, either producing a \"O.K.\" if successful, or a \"N.G.\" (no good) if not. Dance Dance Revolution X contains songs with Shock Arrows, walls of arrows with lightning effects which must be avoided, which are scored in the same way as Freezes (O.K./N.G.). If they are stepped on, a N.G. is awarded, the lifebar decreases, and the steps become hidden for a short period of time. Successfully hitting the arrows in time with the music fills the \"Dance Gauge\", or life bar, while failure to do so drains it. (If The Judgement on arrows scores less than Great, Combo will break immediately or if the dance gauge drains.) If the Dance Gauge is fully depleted during gameplay, the player fails the song, usually resulting in a game over. Otherwise, the player is taken to the Results Screen, which rates the player's performance with a letter grade and a numerical score, among other statistics. The player may then be given a chance to play again, depending on the settings of the particular machine (the limit is usually 3-5 songs per game). In most of the home versions, there is usually an option for event mode, where an unlimited number of songs can be played. On most DDR games, there is an option to use two pads at once, making it harder to play but increasing the number of moves to incorporate into songs.", "platform": "Sony Playstation", "release_date": "September 14, 2000", "game_type": "Released", "esrb": "", "developers": "Konami", "publishers": "Konami", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136085-oha-studio-dance-dance-revolution\n"}