{"altername_name": [], "name": "Oja Majo DoReMi Dokkan! Nijiiro ParaDice", "overview": "Ojamajo Doremi known as Magical DoReMi in English language adaptations, is a magical girl anime metaseries consisting of four regular TV anime series, one 13-episode sidestory, two anime films, and a manga series. The various series were aired from 1999-2003, with companion movies to the second and third seasons. A thirteen episode sidestory TV series was aired in 2004. A manga adaptation, written by Izumi Todo and illustrated by Shizue Takanashi, was published by Kodansha. The show is about elementary school children that transform into witch apprentices. Eight-year-old Doremi Harukaze aspires to be a user of magic, as she believes it would solve all her problems and help her confess to a boy she liked. One afternoon, she comes upon a magic shop and correctly suspects that the shop owner is a witch. The shop owner becomes a witch frog, as this happens to witches when their true identities are discovered. In order to retain her original form, the shop owner, Majo Rika, takes Doremi as her apprentice to turn her into a witch. Doremi must take nine witch exams at night to become an official witch; however, she must never let her own identity as a witch be found out or the same fate that befell Majo Rika will happen to her. On her way, Doremi is joined by her two best friends, Hazuki Fujiwara and Aiko Seno, as well as her younger sister, Pop. While taking tests to become better witches, at the same time, Doremi and her friends help out their classmates and friends with their own problems via magic, as well as battle Majo Rika's rival, Majo Ruka. All is going well until they meet Onpu Segawa, a child idol, who does not share the same morals in using magic as them. Eventually, Onpu allies with Doremi and the girls and even saves them from turning into witch frogs at the cost of her own consciousness. In order to rescue her, Doremi and the girls use forbidden magic to rescue her from her punishment, but because they did do so, all of them must resign as witch apprentices Hana now becomes a peer of the Ojamajo. When Majotourbillon's spirit revives, the witches now have to break her curse. From the help from Pao-chan, Doremi, Hana, and the other witches are able to defeat the curses. The gameplay is the usual in the board party games: The player choose a character (the game features up to 4 players at the same time) and roll the dice depending of the square that the character arrives he can lose or gain magic drops or have to play a mini game against another player. The game features a lot of different mini games such running to escape from a monster, pushing a giant ball, sewing, etc. Characters to choose: Doremi, Hana, Onpu, Momoko, Hazuki & Aiko.", "platform": "Sony Playstation", "release_date": "November 28, 2002", "game_type": "Released", "esrb": "", "developers": "Bandai", "publishers": "Bandai", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136443-oja-majo-doremi-dokkan-nijiiro-paradice\n"}