{"altername_name": [], "name": "One Piece Mansion", "overview": "In One Piece Mansion, you control Polpo, a manager in charge of building and maintaining an apartment complex inhabited by a host of wacky residents. Your overall job is to keep tenants happy by keeping their stress levels under control. Each inhabitant raises and/or lowers the stress in rooms around them in a particular pattern. For example, Ai-Chan decreases the stress in all the rooms around her, while Heebee increases the stress in the room directly above him. The game largely consists of arranging and moving tenants so their stress causing and reducing abilities balance out. If a resident's stress level gets too high, their apartment explodes. As long as you have a building full of happy residents, you'll receive rent checks at the end of every month. But for each room that explodes, you lose a certain amount of cash. You also have to deal with the members of the crime organization Syndicate 5, who take over rooms without paying rent and add extra stress to your paying dwellers. The goal is to increase Syndicate 5 members' stress until they can't stand to live in your complex anymore. And if the criminals wander around, bothering other people, you must drive them back into their rooms personally using your security whistle. Fires pose an additional source of turmoil, and these must be dealt with on a one-on-one basis using the fire extinguisher. One Piece Mansion's Story Mode revolves around Polpo's sister being kidnapped by a jealous building owner, and consists of a series of stages with specific goals, such as earning $10,000 or building a complex with 30 rooms. The Endless Mode allows you to build to your heart's content, or at least until you run out of money.", "platform": "Sony Playstation", "release_date": "October 1, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Capcom Production Studio 1", "publishers": "Capcom", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.05", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10589-one-piece-mansion\n"}