{"altername_name": [], "name": "One", "overview": "The unwitting recipient of a destructive prosthesis -- a powerful blaster grafted onto his left arm -- John Cain awakes to find himself being hunted down by a military organization, with no recollection of the events leading to this predicament. Inspired by Contra and other such titles, One is a pseudo-3D scrolling shooter in which players find themselves traversing a variety of locales, from futuristic Blade Runner-esque cities to remote mountainous regions, all in search of answers. The central gameplay mechanic is the player's Rage meter. Simply put, John Cain is fueled by rage. By destroying objects, killing people, and generally causing all kinds of wanton mayhem, he will increase in power. Cain's rage is represented by an orb-like indicator that undergoes a number of color changes, from the relative calm of green to an infuriated red, and beyond. The higher the color, the more damage the character can sustain and, as an added bonus, the damage yield of the arm blaster is increased as well. Eventually the protagonist will be capable of unleashing a mighty special attack. Taking too much damage however, will cause the meter to revert to a lower state. Though his primary means of attack is his newfound appendage, John Cain is capable of executing melee attacks as well. He can also perform a handful of evasive maneuvers, such as rolling, strafing and even a double jump, which must be mastered in order to traverse the many platforms and pitfalls that await in the title's eight missions. Restart points are scattered throughout the stages and players can save their progress at the conclusion of each level.", "platform": "Sony Playstation", "release_date": "November 30, 1997", "game_type": "Released", "esrb": "T - Teen", "developers": "Visual Concepts", "publishers": "American Softworks", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.72", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=dbBVeFJSgeQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30488-one\n"}