{"altername_name": [], "name": "Oracle no Houseki: Jewels of the Oracle", "overview": "Oracle no Houseki (Jewels of the Oracle) is a first person perspective adventure game that is about solving 24 puzzles. PLOT: Only one legacy remains of the civilization known throughout the Fertile Crescent before the Sumerians. People of extraordinary intellect, their pursuits were of the mind instead of conquering and fighting. They built a secret complex to train and practice their skills of logic and reason. Using technologies and ancient magic long since forgotten, they constructed devices of incredible ingenuity. Those who entered the domain of the Oracle and resolved all the tasks set before them went on to greatness. Those who failed... were lost forever. This structure, lost to the archeological record, has been sought for millennia but never found... until now. You, a supplicant who seeks admission to this lost city, must solve each puzzle laid down by the ancients in the 24 rooms of the domain. Guided by the Oracle, a jewel is rewarded for every success in resolving these tasks. When all the jewels are recovered and placed on the altar in the Oracle Room, the entrance to the lost civilization of the ancients will finally be revealed. The game has 24 puzzles in total. Some are logic based and some are games of strategy. There is no time limit set for each puzzle. The Well Room acts as a central hub that directs the player as to which puzzles are available to be solved at any given time. The puzzles vary greatly in the level of difficulty. Some puzzles are extraordinarily hard. The graphics for the puzzles are designed in an Egyptian or Mesopotamian style. Music plays in the background to provide atmosphere, but it can be turned off, if it gets repetitive. The basic layout is a hexagon around an Oracle's well. There are three doors on the outside of the hexagon, and the first one is where you begin the game. In each room is a puzzle you have to solve to get a jewel which must be taken back to the Oracle's well. The puzzles in this game can be compared to those found in The 7th Guest. The Chinese Checkers puzzle in Shivers rivals many of the ones contained in Jewels of the Oracle.", "platform": "Sony Playstation", "release_date": "December 6, 1996", "game_type": "Released", "esrb": "", "developers": "ELOI Productions", "publishers": "Sunsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110745-oracle-no-houseki-jewels-of-the-oracle\n"}