{"altername_name": [], "name": "OverBlood", "overview": "As you wake up from your slumber in a cryogenic tube, you begin to wonder who you are, where you are, and how you arrived at this unknown place. Thanks to the gadgetry surrounding you, the question concerning your identity is answered quickly: you are Raz Karcy. And with that helpful information you begin your quest to unlock your true past and discover why you are where you are. You soon discover that you're in some sort of laboratory and that you are part of a huge conspiracy being conducted by scientists intent on mastering cloning technology. Players assume the role of Raz, as well as other characters he comes in contact with, as they explore the surroundings, solve puzzles by flipping switches and using various items, and even fight a few genetic monsters. Can you help Raz with his little dilemma before it's too late? Players will encounter enemies, solve puzzles and gather clues to progress in the game. Three characters are available to play, including a small robot. These characters can be switched at will, allowing certain puzzles and obstacles to be met with different approaches. The camera angle can also be changed at will, from an overhead view to a first-person perspective. Players will also acquire weapons and health sprays in order to sustain life and protect themselves from enemies. Games can be saved onto a memory card at any time via the Voice Recorder, an item found early in the game. Features: * Control one of three characters, each with their own abilities * Stay alive by gathering important clues * View the action from different camera angles", "platform": "Sony Playstation", "release_date": "May 18, 1997", "game_type": "Released", "esrb": "T - Teen", "developers": "Riverhill Soft", "publishers": "Electronic Arts", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.96", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=dFIooeht3uY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/19633-overblood\n"}