{"altername_name": ["Pachi-Slot Teiou - Golgo 13 - Las Vegas"], "name": "Pachi Slot Teiou: Golgo 13, Las Vegas", "overview": "Pachi-Slot Teiou - Golgo 13 & Las Vegas is a pachi-slot (gambling machine) game that features 2 different gambling machines and different levels of zoom. The main character of one of the machines is Golgo from Golgo 13, the other machine got a Las Vegas theme. Golgo 13 is a manga series written and illustrated by Takao Saito, published in Shogakukan's Big Comic magazine since January 1969. In 1976, the manga won the 21st Shogakukan Manga Award for general manga. The series follows the titular character, a professional assassin for hire. The manga is one of the longest running adult manga in Japan and has sold over 200 million copies in various formats, including compilation books. It has been adapted into two live-action feature films, two animated films, a television series and five video games. A slot machine (American English), fruit machine (British English), poker machine (Australian English) or simply slot (American English) is a casino gambling machine with three or more reels which spin when a button is pushed. Slot machines are also known as one-armed bandits because slot machines were originally operated by a lever on the side of the machine (the one arm) instead of a button on the front panel, and because of their ability to leave the gamer penniless. Many modern machines still have a legacy lever in addition to the button. Slot machines include a currency detector that validates the coin or money inserted to play. The machine pays off based on patterns of symbols visible on the front of the machine when it stops. Modern computer technology has resulted in many variations on the slot machine concept. Slot machines are the most popular gambling method in casinos and constitute about 70 percent of the average casino's income. It is estimated that thirty percent or more of the profits from gambling machines come from problem gamblers.", "platform": "Sony Playstation", "release_date": "May 30, 2002", "game_type": "Released", "esrb": "", "developers": "Heiwa", "publishers": "Media Entertainment", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111775-pachi-slot-teiou-golgo-13-las-vegas\n"}