{"altername_name": [], "name": "PAL: Shinken Densetsu", "overview": "A high school girl named Kaoru found him abandoned in a box outside her house one rainy afternoon, and decided to take him in. Her dog-hating mother, however, didn't appreciate this, and after a month of putting up with puppy problems, she insisted that Kaoru get rid of it. But Kaoru didn't exactly have much of a chance to do this, since she had apparently been targetted by an evil organization fronted by none other than the world-famous prophet Nostradamus. And while our brave little puppy tried his hardest to take on the war-machine sent to abduct her, the battle ended with exactly the fate you'd expect when a puppy squares off against a war-machine. Bruised, battered, and on his own, poor little Pal seemed to be in a hopeless situation... ...until Zeus stepped in, anyway! After passing a series of trials, Pal is endowed with the ability to take on any shape of his choosing. Taking on a humanoid warrior-like appearance he is accompanied back to the human world by the Poverty God and the Mountain Goddess, and sets off to solve the mystery of Kaoru's whereabouts, and to figure out, once and for all, what the motives of Nostradamus and his minions really are. And he also enlists the help of Kaoru's boyfriend Yukito, who is apparently quite an expert chef. A new system in Pal gives the player the ability to cook different types of soups, casseroles and baked dishes that have different effects. A simple potion can be whipped up which will heal your wounds while a steaming broth can serve as a cure for poison. All dishes must be learned before you can make them but the cooking system is user friendly and easy to get into.", "platform": "Sony Playstation", "release_date": "April 25, 1997", "game_type": "Released", "esrb": "", "developers": "Fill-In Café", "publishers": "Tohoku Shinsha", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93843-pal-shinken-densetsu\n"}