{"altername_name": [], "name": "Panel Quiz Attack 25", "overview": "Panel Quiz Attack 25 is a game show airing on the Asahi Broadcasting Corporation network in Japan. It first aired on April 6, 1975, and is currently the only game show on Japanese television to use non-celebrity contestants. Presented by Kiyoshi Kodama until 2011, then by Yasuyuki Urakawa. GAMEPLAY: Four contestants, each designated by a different color (red, green, white, and blue), compete. The game is played on a grid of twenty-five numbered boxes in a manner similar to the game Reversi. The first question is a puzzle that is shown on the video screen; the first player to buzz in with the correct answer is awarded the center #13 box. After this, the contestants are introduced. From this point on, players are referred to by their designated color (in Japanese, red is \"akai,\" green is \"midori,\" white is \"shiro,\" and blue is \"ao\"). From that point on, questions may take any of several forms, including general trivia, an audio question, or a video or picture question or puzzle. Players may buzz in at any time after the announcer begins reading the question. Buzzing in with the correct answer allows the player to capture one of the boxes on the game board. In addition, if by capturing a box, a player brackets one or more boxes held by opposing players, whether in the same row, column, or diagonal, the player steals those boxes. When capturing a box, players must: Make a capture that will steal a box from an opponent Failing that, make a capture that will set up a steal on another correct answer. Failing both of the above, capture a box that touches at least one other box held by any player. Any time a contestant answers a question incorrectly, other than on the first question or any puzzle, that player is locked out from answering for two questions. If a question was answered incorrectly, play ends on that question, and a new question is asked; on a puzzle, play continues until someone answers correctly. (Players who are locked out must stand up from their chair and step away from their buzzers.) When multiple players are locked out, they are let back into the game one at a time. For example, if the red and green players are locked out, in that order, on consecutive questions, then the red player will re-enter the game after the next question (since it will be the second question that they had been out); whether that question is answered correctly or not, the green player must wait out another question before coming back in. From the \"Attack Chance\" (see below) to the end of the game, a player who answers a question incorrectly is always locked out for two questions, even if the next question is answered correctly. After twenty boxes are filled on the board, a bell rings, which signals the start of an \"Attack Chance.\" The contestant who gives the next correct answer after the Attack Chance is announced captures a box as usual, then \"attacks\" any box held by an opponent. The box that is attacked is turned yellow, and can then be captured by any contestant as normal. If the contestant that won the Attack Chance is the only one with territory on the board, he or she must then attack his or her own box. The game ends when the board is filled, or when time runs out (signaled by the Westminster Chimes). The contestant that holds the most boxes is declared the winner. If the game ends in a tie, the tied contestants play additional sudden-death questions until one of them gives a correct answer, thus winning the game. In addition to the TV show, there is also a video game version that is played on the PlayStation and PlayStation 2. The Playstation One version follows the same rules as in the TV program and features digitalized graphics and some different game modes for up to 4 human players.", "platform": "Sony Playstation", "release_date": "December 18, 1997", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "Quiz", "max_players": "4", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135527-panel-quiz-attack-25\n"}