{"altername_name": ["Parasite Eve 2", "Parasaito Ibu 2", "パラサイト・イヴ 2"], "name": "Parasite Eve II", "overview": "With a goal of fusing tension and drama found in movies with the game mechanics of the role-playing genre, the original Parasite Eve was Square's first attempt at creating a cinematic RPG; it was a commercial success, selling loads of copies to role-playing and survival horror fanatics. Because of the acclaim, the powerhouse development company did the only thing possible -- a sequel. Before detailing the follow-up, here's some background: the plot of the original game dealt with Eve, a woman transformed into a killing machine by a life form known as mitochondria. The infected woman/monster went on a bloody rampage through New York City, destroying anything and everyone in her path. Assuming the role of a young police officer named Aya Brea, it was in the players' hands to solve the murder case and thwart the vile creature; the awaking of her mitochondria gave her the clues and prowess to stop the madness of Eve. A few years have passed since the occurrences in New York. Aya Brea has joined the Federal Bureau of Investigations' Mitochondria Investigation and Suppression Team (M.I.S.T for short). After a series of strange incidents, the heroine is called into action and ordered to investigate the unfolding mystery once again. Human beings have begun transforming into hideous monsters known as Neo Mitochondrion Creatures; it is suspected that Eve is behind these bizarre events. While the look and feel of Parasite Eve II resembles the original, it features revamped character models with facial expressions and motion-captured animation, pre-rendered backgrounds, an overhauled battle system and full-motion video clips for storyline progression; the in-game dialogue is presented in written form with text boxes. Spanning dust-ridden ghost towns, elaborate laboratories and ancient dwellings, monsters roam about resulting in survival horror elements and scares galore! Whereas the original featured pseudo turn-based battles, the sequel's action sequences unfurl in real-time; you can dodge enemy attacks, run away or strategically decimate the opposition. Taking pieces from the sci-fi world, Aya Brea has been endowed with psychic powers and psionic spells including meditation, healing and offensive fire blasts in addition to conventional pistols and machine guns. Once the battle has finished, the heroine will receive two point awards: XP and BP. While XP points lean towards learning new spells (12 in all), BP points will have you customizing and buying weapons and items; enhancing weapons means purchasing or finding the right parts. Items include healing and effect-ridding canisters, different types of ammunition and important objects vital to the quest. Along the way, Aya will come in contact with other characters including a bounty hunter named Kyle Madigan, a weapons expert named Gary Douglas and M.I.S.T agents Pierce Carradine and Rupert Broderick, all of which offer help and advice. Additionally, the various locations are laced with puzzles ranging from finding certain key cards to solving riddles and manipulating gears and pictures for the sake of progress. A single-player experience, Parasite Eve II offers three different endings (depending on how well you do) and supports PlayStation memory cards for saving game data and the Dual Shock Analog Controller for analog controls and the vibration function.", "platform": "Sony Playstation", "release_date": "September 12, 2000", "game_type": "Released", "esrb": "M - Mature", "developers": "Squaresoft", "publishers": "Squaresoft", "genres": "Horror", "max_players": "1", "cooperative": "No", "rating": "4.36", "wikipedia": "https://en.wikipedia.org/wiki/Parasite_Eve_II", "video_link": "https://www.youtube.com/watch?v=_W3jICedly8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8981-parasite-eve-ii\n"}