{"altername_name": ["Parasaito Ibu", "パラサイト・イヴ"], "name": "Parasite Eve", "overview": "Parasite Eve is a Japanese science fiction novel by Hideaki Sena, first published in Kadokawa Horror Bunko in 1996. The book was published in North America by Vertical, Inc. in 2005. Parasite Eve has been adapted into a 1997 film and a 1998 video game for the Sony PlayStation by Square (now Square Enix). Two sequels to the game were released. Parasite Eve is a horror action role-playing game developed by SquareSoft (now Square Enix). The game is a sequel to the novel Parasite Eve, written by Hideaki Sena. It is the first game in the Parasite Eve series. The game takes place over a six day span in New York City in 1997. The incident starts on December 24 and ends on December 29. The game begins with Aya Brea, an NYPD rookie, attending an opera with an unnamed date. During the opera, everyone in the building spontaneously combusts, except for Aya, her date, and an actress on stage named Melissa Pearce. Aya confronts Melissa backstage, and Melissa says that Aya’s mitochondria need more time to develop. Melissa then mutates into a beast and flees into the sewers, declaring that her name is now Eve. There has to be some connection between the two of you, as that seems the only rational explanation. What if mitochondria are a species on its own, more advanced then humankind, and using them only to create environments and civilization for themselves? What if humankind are just hosts? What if mitochondria are the natural enemy of humankind? That would make Aya their natural enemy, so the battle for survival and uncovering the truth has already started. Mitochondria have taken on a new life of their own and begun to infest the city of Manhattan. It's up to NYPD detective Aya Brea to unearth the mystery behind this infestation. Journey through the dark streets of Manhattan as you battle mutated rats and other hideous creatures on your way to Eve, the central figure of the mitochondria attacks. Developed by Square, the same people who brought us the epic Final Fantasy RPG series, Parasite Eve is a three-disc RPG in a third-person perspective with 3D rendered backgrounds. You are allowed to roam around in real-time, polygonal battle sequences. A unique option lets you customize weapons, armor and character abilities. The game is compatible with analog controllers and takes up only one block of memory for saves. The game package also contains a bonus CD, Square Soft's 1998 Collector's CD Vol.1. This collection of demos and previews includes an interactive playable demo for Xenogears, the opening movie sequence for Bushido Blade, a preview movie for Brave Fencer Musashi, and a special preview movie for Final Fantasy VIII.", "platform": "Sony Playstation", "release_date": "September 9, 1998", "game_type": "Released", "esrb": "M - Mature", "developers": "Squaresoft", "publishers": "Square Electronic Arts", "genres": "Horror", "max_players": "1", "cooperative": "No", "rating": "4.35", "wikipedia": "https://en.wikipedia.org/wiki/Parasite_Eve_%28video_game%29", "video_link": "https://www.youtube.com/watch?v=BPyR9qgcdAU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/567-parasite-eve\n"}