{"altername_name": [], "name": "Paro Wars", "overview": "Paro Wars is a turn-based strategy game that, as it turns out, as almost exactly like Military Madness (and even looks similar to that game's spiritual successor, Nintendo's Advance Wars.) You take control of one of 8 factions - which include Hikaru and her bunny girls, Pentarou and his horde of penguins, Takosuke Jr. and his octopi friends, Michael and his pigs, and Koitsu's army of paper airplanes. Other choices include the pandas, the moais, and a set of business suit-clad dogs. You're given a small map with limited resources - the object is to capture factories so you have the ability to make more units, which include a huge variety of tanks, planes and boats. Like Final Fantasy Tactics, the terrain is 3D modeled but the sprites are 2D. When you attack an opposing enemy, you get a goofy little (voiced) cutscene where your characters fight and taunt each other - they're pretty amusing, but can be skipped if you just want to play. There's even a cat who occasionally pops in to give some commentary on the battle situation. For a game that seems this lighthearted, there's an incredible amount of depth. Not only do you create vehicles, but you also have a vast array of unique characters to command each unit - also with their own stats. Unfortunately, at this point it all becomes a little overwhelming. Throughout the game, there are over seventy units, and while some have wacky names like \"Gaba Gaba Mk 3\", \"Go Go Saber\" and \"Mig-800DX!?\", others have more generic titles like \"Pu-25\", \"SM1573\" and \"T-Back 34/85\". Even if you know some Japanese - and God help you if you try to go this one without any knowledge of it - keeping track of everything is just too much. It doesn't help that a learning curve is entirely nonexistant.", "platform": "Sony Playstation", "release_date": "September 25, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Role-Playing", "max_players": "4", "cooperative": "No", "rating": "3.12", "wikipedia": "https://en.wikipedia.org/wiki/Paro_Wars", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/26009-paro-wars\n"}