{"altername_name": [], "name": "Pitball", "overview": "Set in the 23rd century, Pitball is the only sport left in existence. There are no rules in this violent battle -- your objective is simply to score as many goals as possible while destroying the other team. Before jumping into the action, you'll select from one of twelve available teams. Consisting of two players per roster, teams include human beings and various alien races, each with their own distinctive forms of attack. While the Arquons utilize a series of oceanic attacks, the stone creatures of the Slorillians use volcanic rock to decimate their opponents. In this brutal sport, the idea is to smash up the other team in an attempt to make them drop the ball; the ball is made of pure energy. To help your team become stronger, you can purchase items and free agents. Money is gained from bank loans, team sponsors and by placing bets on games. While on the playing field, your team can obtain special power-up items that increase power, revitalize hit points, shield players from attacks and grant other mysterious effects. Pitball includes several gameplay options including Training, Single Game and Season modes. The Training mode is specifically designed for novice players and newcomers. Played on a holographic field, it teaches you the basics of gameplay. Whereas the Single Game is simply an exhibition match, the Season is a furious battle to the championship. There are also multi-player options including competitions for two, three and four players and a cooperative Versus mode. When more than two people are going to play, however, a Multi-Tap is needed.", "platform": "Sony Playstation", "release_date": "October 31, 1996", "game_type": "Released", "esrb": "E - Everyone", "developers": "Warner Interactive Entertainment", "publishers": "Accolade", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.57", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=M5OYj8604KI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31093-pitball\n"}