{"altername_name": [], "name": "Plane Crazy", "overview": "Players can either take part in quick race or ghost race, or can compete in a full five-world championship, earning cash by getting the fastest checkpoint times and, of course, winning. The money is then used to buy plane upgrades and pay the entrance fee into the next race. Each of the five courses has its own theme. \"Monument Rush\", for example, features steep ravines and wide canyons interspersed with Pueblo villages, rivers, waterfalls and rock formations. \"Border Dash\", on the other hand, is set in an open desert doted with small towns and forests of oil derricks, while \"Sin City Run\" is a maze of skyscrapers, road tunnels and freeways. In \"Docklands\", you'll woosh past cargo ships, loading cranes and belching oil refineries, while in complete contrast, \"Rain Forest\" takes you into the clouds and features dense forest, fiery volcanoes and twisting river trails to follow. Once you've powered up the throttle, you'll soon be racing neck and neck with your fellow pilots, collecting the bonuses scattered around the courses which will give you speed boosts, shield and power-downs, enabling you to take pot-shots at your rivals. You can also take seconds off your race times if you find the hidden shortcuts included in each course. The challenges presented to the player vary from course to course, and the vertical freedom afforded by the game's theme is used to dizzying effect. One minute you'll be soaring skywards to avoid being smashed on a girder, the next you will be flying deep into a narrow fissure in an attempt to grab a vital power-up. And to make matters even more nerve-wracking, there are pockets of air turbulence to avoid too.", "platform": "Sony Playstation", "release_date": "September 15, 1999", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Project Two Interactive", "publishers": "Inner Workings", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "4.12", "wikipedia": "https://en.wikipedia.org/wiki/Plane_Crazy_(video_game)", "video_link": "https://www.youtube.com/watch?v=5MAh7y9ogA0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92702-plane-crazy\n"}