{"altername_name": ["Planet der Affen"], "name": "Planet of the Apes", "overview": "The Planet of the Apes is an action/adventure interpretation of the 1968 film (which is itself an adaptation of the Pierre Boule novel). While the game's setting and opening sequence are based very heavily on the original film, the storyline is new and deals with the poignant social conflicts of the futuristic Earth from its own perspective. The game world is a land ruled by hyper-evolved apes in which human beings live like wild animals, without language or civility. Players take the role of Ulysses, the human hero of the game. As in the movie, the hero is an astronaut who is transported to the post-apocalyptic Earth when his ship crash-lands in the wilderness. Unlike Charlton Heston's Taylor in the film version of the story, Ulysses realizes fairly quickly exactly when and where he is. The game's most surprising revelations come from other discoveries that Ulysses makes as he proceeds through the adventure. The depth of the plot becomes more apparent as Ulysses discovers that many consider his presence on the planet to be the fulfillment of an ancient prophecy, in which a human messiah would fall from the sky to save mankind from its collapsed state. For what it's worth, Ulysses does not feel very much like a messiah. Gameplay follows conventions established by popular titles like Tomb Raider and Metal Gear Solid. The action is viewed from a third-person perspective, with the \"camera\" behind the hero's shoulders and panning occasionally to offer a better view in tight spots. While there is plenty of action and combat, the all-important storyline relies on character exploration and interaction for its progression. The game contains hundreds of lines of scripted dialog and Ulysses can have conversations with most non-player characters. One of three \"modes\" determines how Ulysses will approach a given situation. In \"normal mode,\" the hero walks about at a regular pace. In \"athletic mode,\" he is ready for action, running from place to place and able to jump and dodge quickly. In \"stealth mode,\" Ulysses crouches down and moves as silently as possible, allowing him to explore hidden areas without being noticed by guards and other apes. All three modes of action are required to guide Ulysses safely through this diverse and dangerous Planet of the Apes.", "platform": "Sony Playstation", "release_date": "August 22, 2002", "game_type": "Released", "esrb": "T - Teen", "developers": "Visiware", "publishers": "Ubi Soft Entertainment Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.58", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11166-planet-of-the-apes\n"}