{"altername_name": [], "name": "Planet Laika", "overview": "Planet Laika is a console role-playing game developed by Quintet and Zeque. The game was only released in Japan. The game follows the main character, Laika, through a mission to Mars which forces the player to manipulate Laika's multiple-personality disorder in order to solve puzzles. All the characters in the game have dog heads, a possible reference to the Russian space dog Laika. The story begins as the crew of a rocket ship heads to Mars on a mission to find out the truth behind rumors about the \"end of the world\" and the existence of an unknown supernatural being. All the characters in the game have dog faces, and you learn at one point that mankind was once destroyed for having human faces. Mars is controlled by a force called the \"Evil Mind,\" which manipulates the inhabitants of the planet, changing them into one of three colors and personality types. The people who are colored yellow are visually focused and pursue physical beauty. The reds are animalistic and strong, and they resort to violence quickly. The blues are psychotic but also quite crafty. The planet plays tricks on their minds, causing them to see illusions, including an illusion of the crew of the ship. A major theme of the game is Laika's different personalities, embodied by three different characters, Ernest, Yolanda, and Spacer. By talking to different characters, Laika absorbs their different colored auras and whena specific color has been absorbed enough, Laika can turn into that personality to solve a problem, such as needing Ernest, the strongest, to lift a heavy shutter. Unlike most RPG's, which feature turn-based battles, Planet Laika's are played out almost like Space Invaders and Pong. The player must bounce around a Mind Core and reflect back the enemies attacks to inflict damage. There are not a lot of battles in the game and enemies only attack when Laika is in one of the special forms.", "platform": "Sony Playstation", "release_date": "October 21, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Quintet", "publishers": "Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111884-planet-laika\n"}