{"altername_name": ["Guy Roux Manager 2000", "Barca Manager 2000", "Calcio Manager 2000"], "name": "Player Manager 2000", "overview": "Player Manager 2000 is a Sports game, developed by Anco Software and published by Ubisoft, which was released in Europe in 2000. A football management game from the creators of the Kick Off series. Player Manager 2000 lets you coach any team from England, Scotland, Italy and Germany, and there is totally more than 30,000 players. Tactical options are diverse, and the game features pre- and post-match analysis. What makes the game relatively individual is that you are able to put yourself in the team. There are three ways to play the matches, the first is the commentary mode that works almost the same way as the Championship Manager games. The second is the scanner mode where you watch the matches from a 2D top-down view. The third is to play them in full 3D similar to the FIFA games. Manufacturer's description: Developed using the real life professional experience of top managers, including Martin O'Neill, Bobby Robson, John Gregory, Jim Smith, Harry Redknapp, Gordon Strachan, Paul Bracewell and Graham Taylor, no other game gives you more control, no other game gives you more realism, nothing gets you closer to the action. Exploit their skills, nurture their individual characteristics and build their experience into your team strategy. Features the most powerful search engine ever - thousands of players detailed. Three game modes: Commentary, Scanner and Full 3D. Manage major European clubs in domestic and international competitions. The most in-depth pre-match and post-match statistics. Features: First person perspective. 2D & 3D graphics Cartoon graphics Soccer Management theme.", "platform": "Sony Playstation", "release_date": "June 20, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Anco Software", "publishers": "3DO", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.44", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90180-player-manager-2000\n"}