{"altername_name": [], "name": "Polaris SnoCross", "overview": "Polaris SnoCross brings the world of high-speed snowmobile racing home to the PlayStation. Chock-full of real licenses from actual snowmobile makers and modifiers, players will have to take on the world's best in hopes of becoming a modern hero of the snowmobile world. There are three different modes to choose from within Polaris SnoCross. These modes include Single Event, Instant Action and Tournament Series. The first two simply throw you right into an arcade experience, but the Tournament mode is a bit different. Here, you will race a small number of tracks, going for first-place finishes in hopes of obtaining the highest score of any of the other drivers. Doing so will open up new tracks to conquer, as well as more modern snowmobiles. Beyond this, players also have the ability to continually upgrade their own machines. They do this by performing one of over 15 tricks found in the game. They must do this during races, and every time they successfully perform a trick, they gain points in their Wrench meter. Fill up a meter, and it's time for automatic customization in between races. Players can upgrade parts, strengthen some areas of handling at the expense of others, and the like. Of course, if players ever get sick of simply racing the computer, they can also engage a friend in one-on-one snowmobile action. Use the tracks' various secret routes to your advantage and turn your friend into so many ice crystals as you take the checkered flag. So get on your snowmobile and take on Polaris Snocross. Features * Compete in three distinct leagues and on 10 different tracks * Perform such stunts as front and back flips, corkscrews, gyroscopes, and more * Choose from 16 licensed snowmobiles", "platform": "Sony Playstation", "release_date": "February 18, 2000", "game_type": "Released", "esrb": "", "developers": "Vicarious Visions", "publishers": "Vatical Entertainment", "genres": "Racing", "max_players": "4", "cooperative": "No", "rating": "2.79", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79386-polaris-snocross\n"}