{"altername_name": ["Doukyuu Re-mix: Billiard Multiple", "Doukyuu Re-mix: Billiards Multiple"], "name": "Pool Academy", "overview": "Pool Academy (aka Doukyu Re-Mix Billiard Multiple) is the sequel to Doukyu Billiard Master released for the Pal region. Again the objective is to play the best game of pool possible while wagering high amounts of cash. But no matter how good you think you are, there's always someone better than you...or is there? The game features a realistic ball move, and up to 8 human players can play at the same time using the multi-tap function. There is a new mode: The Artistic billiard that is in different ball positions gate in all the ball in one shoot. If the player do it a video appear that can be also seen in the collection part of the game (there are 40 unlockables videos). There are 10 different characters to choose (only 7 from the beginning of the game) Fancy an evening of playing pool without the smoky atmosphere of a pub with walls too close to the table? Why not try Pool Academy? With 5 game modes including a very fun and addictive trick-shot section, 8 players to compete against and help available from a pro to improve your skills, Pool Academy is all you need to hone your virtual skills. There are also a lot of videos of billiard by the japanese grand master Yoshikazu Kimura. Game modes: - Nine Ball Striking off into a diamond pack and scoring in selected pockets. - Rotation First potting the lowest-numbered ball on the table. Then you aim at any ball that suits you with the number being awarded in points. - Bowlard's: You get three throws in one innings and as many innings in a game as you decide. Balls are continuously pocketed until you miss. This takes you onto the second frame. - Tidiwinks: In this mode except for the break, you have to use one of the balls in your possession as the cue ball to pocket other balls starting with the cue ball first. Manufacturer's description: Put on your bowtie and black waistcoat and prepare for an evening of Pool ! - 4 game mode, including a trickshot session. - 8 players to compete against. - Help from the pro to improve your techniques and skills. Join the Academy... and discover all the secrets of Pool ! Features: First person perspective. 3D graphics Billiard theme.", "platform": "Sony Playstation", "release_date": "July 28, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "ASK", "publishers": "Ubi Soft Entertainment Software", "genres": "Sports", "max_players": "8", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78989-pool-academy\n"}