{"altername_name": [], "name": "Pop'n Music", "overview": "Pop'n Music, most commonly shortened to Pop'n, PM or PNM, is a music video game in Konami's Bemani series. The game is notable for its bright colors, upbeat songs, and cute character graphics. Although Pop'n Music was originally intended to be played by couples on dates, it has greatly escalated in difficulty since early iterations, and has since then attracted many players of beatmania and other Bemani games. Originally released in 1998, the game has had 15 home releases in Japan as well as many arcade versions. Pop'n Music and Pop'n Music 2 were released on the PlayStation and the Dreamcast, and for both consoles two further append discs were released: Pop'n Music 3 and Pop'n Music 4. These later two versions required a \"key disc\", i.e. one had to already possess Pop'n Music 2. A special controller featuring the nine colored buttons of the arcade version of the game was released for both consoles. Pop'n Music 5, Pop'n Music 6, Pop'n Music Animation Melody and Pop'n Music Disney Tunes were then released for the PlayStation, but there were no further releases on the Dreamcast. Pop'n Music 5 and 6 could be used as \"key discs\" to play the append discs mentioned above. Unlike most of the Bemani series, the Pop'n Music controller is not designed to represent any real musical instrument. Instead it is a pattern of nine buttons in two rows; four on top and five on the bottom. On the screen colored notes called pop-kun fall from the top to the bottom in nine rows corresponding to the buttons. When the notes reach the bottom the player presses the button and the game emits a note of the song, along with a judgement ranging from Great (hit the note perfectly on beat) (or Cool in expert mode.) to Bad (missed the note completely and breaks a combo). Like beatmania, there is a life bar with a long green section on the left and a short red section on the right. Getting Greats (Or Cool in Expert) raises the lifebar, while getting Bad lowers it. When it is completely full, a higher rating called 'Fever' replaces 'Great' until the lifebar drops again. A song is passed if the life bar is in the red section at the end, which lets the player play another song. If the song is failed, the game may give the player another chance of playing the game, but used up the first life. (Player can insert the credits during the time limit. This happened until Pop'n Music 13, where the use of second chance is free. Although the limit of lives is 2. But it does not give effect at Cho-Challenge, Expert, Osusume or Net-Taisen Mode. (or in the 2nd or final stage)) If the player fails the second time, the game ends. A player may play a maximum of 3 songs (4 songs in Expert Mode.) before the game is over. 100,000 points is the maximum amount of points that can be earned per song, and denotes getting all Greats (or Cools in Expert). Pop'n Music is differentiated from beatmania by its lack of a turntable and by its hand-size buttons. Where beatmania is played by pressing buttons with one's fingers, Pop'n Music is played by hitting buttons with one's palms, fingers, and in some situations, arms and elbows. Players can choose from a 5-key mode (disabling the leftmost and rightmost buttons), or a 9-key mode. Older console versions also included 7-key mode, which made it easy to fully use a beatmania IIDX controller. To make the gameplay more interesting, higher difficulty levels feature obstacles known as \"Ojamas\", large sprites which obscure the player's view of the descending pop-kuns. Starting at PM 5, Challenge mode, usually called \"standard\" mode allows the players to choose the normas or Optional objective that uses to boost the challenge points and it also uses by e-amusement after PM 14. A mode that was featured in Pop'n Music 6 is Expert or Nonstop mode, where the player chooses from different song lists or courses and plays through them in either Normal or Hyper mode. The lifebar is different in this mode. The life bar starts full, and then lowers every time you get a Bad. The life bar starts full and it can be increased or decreased. Play continues as long as the life bar does not reach zero or it's game over.", "platform": "Sony Playstation", "release_date": "February 25, 1999", "game_type": "Released", "esrb": "", "developers": "Konami Computer Entertainment Yokohama", "publishers": "Konami Co., Ltd.", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111922-popn-music\n"}