{"altername_name": [], "name": "PoPoRoGue", "overview": "PoPoLoCrois is a manga series by Tamori Yousuke, originally published in the Asahi Student Newspaper (a subsidiary of the Asahi Shimbun newspaper). It was later adapted into two anime series and five console role-playing games. Its title is a combination of words from two languages: the Italian word \"Popolo (people)\" and the French \"croix (crossing)\", which together mean \"crossing of people\". The general theme of the series is love and compassion, that the race to which one belongs isn't important and the importance of friendship. Poporogue is the sequel to SCEI's 1996 hit in Japan Popolocrois (also called Popolocrois monogatari). The battles in this game are not random, you can see the monsters on the screen and avoid them. What's more is that if you choose to escape from a battle, the monsters you ran from will chase you around the dungeon. Every time you enter a dungeon the pathways in the dungeon are randomly generated, though the landmarks remain in the same areas. Poporogue uses the \"Mercenary System\", in which all characters except the main are mercenaries and are hired out. It has been two years since Pietoro and company have defeated the evil Ice demon and his cronies, Pietoro has grown bored with every day life (Especially studying!), so he decides to escape from the castle.(For those of you who really care Poporogue takes place after the animation series. Thus the story can be followed by playing Popolocrois, watching all the anime, and then playing Poporogue. Whether you do this or not makes no difference as far as the story is concerned. Still the game is cooler if you've played Popolocrois before.) He sneaks out of the castle and explores the town, finally ending up dozing off in nearby grasslands. Everything is all La De Da until. A giant cloud covers Popolocrois and sucks half the continent into the sky!!", "platform": "Sony Playstation", "release_date": "November 26, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "G-artists", "publishers": "Sony Computer Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/48274-poporogue\n"}