{"altername_name": ["PoPoLoCrois Story", "波波罗古洛伊斯物语"], "name": "PoPoLoCrois Monogatari", "overview": "PoPoLoCrois is a manga series by Tamori Yousuke, originally published in the Asahi Student Newspaper (a subsidiary of the Asahi Shimbun newspaper). It was later adapted into two anime series and five console role-playing games. Its title is a combination of words from two languages: the Italian word \"Popolo (people)\" and the French \"croix (crossing)\", which together mean \"crossing of people\". The general theme of the series is love and compassion, that the race to which one belongs isn't important and the importance of friendship. The first game, \"Popolocrois Monogatari\", starts at the night of Pietro's (also called Pietoro) 10th birthday, when he learns that his mother, who he thought was long dead, was found in a coma. Pietro sets out into a journey along with the apprentice forest witch, Narcia, to save his mother's soul from the underworld. Pietro has to free her soul and defeat a menacing demon that is threatening to destroy the entire kingdom. The game starts when Pietro, our hero, who looks a bit gloomy despite it being his tenth birthday goes to see his father, King Paulo, and after that the king goes into the tower that he has always told Pietro is forbidden, and Pietro decides to follow him. Inside, he finds King Paulo talking to an unconscious Sania, Pietro's mother whom he had thought died. Pietro finds out that Sania's soul was taken to the Land of Darkness, a place where normally only the dead go, and that she has been asleep since shortly after he was born. Pietro decides he has to do something to help his mother, and despite King Paulo's wishes, sets off to see the forest witches who are researching a book that may be able to help the next day. Pietro also grows older as the story goes on, so you are able to control Pietro when he is 10, 12 and 15 years old. Players guide the adventures of the young Prince Pietoro, whose mixed heritage puts him in a unique position to foster peace and understanding between humans and their traditional rivals, the Ryu. Pietoro sets out to rescue his mother from a curse and it joined by an assortment of powerful and magical friends along the way. PoPoLoCrois is played from an isometric perspective. Combat is tactical and turn-based, similar to that of a traditional strategy RPG. While playing you are able to pick up different characters to form a party, each with a different personality and combat style. Battles occur randomly and they become semi-strategic turn-based if you turn off the default auto combat option. Combat doesn't take you to a different screen, it just defines a spot in the background moving it to a diagonal grid, where you will move and fight the enemy. In these fights, there are many battle options, from special skills to tag-team attacks. Actions are based on an action gauge that fills up.", "platform": "Sony Playstation", "release_date": "July 12, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "G-artists", "publishers": "Sony Computer Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.61", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/48272-popolocrois-monogatari\n"}