{"altername_name": [], "name": "Populous: The Beginning", "overview": "Have you ever wanted to conquer the world? Have you felt the primal need to take land and pillage towns all for the glory of your people? Well, if you want to be transported into a magical and barbaric world, step forward. Welcome to Populous: The Beginning, from Bullfrog Productions and Electronic Arts. As a brutal Shaman, you and your tribe must establish villages and go to war against rival tribes and their Shaman. Your powers are yoked from the very essence of the earth. Magical spells are at your command and followers hang on your every sentence. You must use them and your powerful skills to shape the land around you into a world of plenty and prosper, with victory coming from hard fought battles and exploration. Your skills will have to be acquired though, so your road to success will not be easy. Stoneheads and Obelisks will have to be worshipped by you in order for their powers to be unleashed. These powers include : magical spells, land altering powers and hints to success. Another stone statue that you will come upon are the Knowledge Vaults. These hold plans for new structures and new techniques. Only when you have found them will you be able to harness their power for your benefit. The basic structures are huts, guard towers and a training center for your warriors. More complicated structures, like a Preacher Tent, will let you build a Preacher who can manipulate the enemies mind and make them switch to your clan. They are a valuable asset to have on your side. There are many tasks that your followers must perform in order for your tribe to prosper. They must reproduce to keep your population high and healthy. This is essential so that you can always have reserved followers in case of attack. Some must also bee trained in the arts of fighting or preaching in order to help your tribe. A good mix of warriors, preachers and simple Braves must all be ready for use. Once you tell your people to build a structure or train for battle, they will do it. This is the power you hold. Even if you are killed in battle, you will be brought back to the resurrection site, providing you have followers remaining. Also, as the Shaman, you powers are meant to guide the people, but also aid in attack. Spells such as lightning, fire and deadly bug swarms must all be used to drive away the persistent enemy tribes. Only when you find spells, guide your people and build a substantial force will you be ready to take on the world. Until then, prepare your tribe and stay alive!", "platform": "Sony Playstation", "release_date": "November 16, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Bullfrog Productions", "publishers": "Electronic Arts", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "4.42", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/17659-populous-the-beginning\n"}