{"altername_name": [], "name": "Porsche Challenge", "overview": "Porsche Challenge is the first release from the European division at Sony Computer Entertainment. Based on the Porsche Boxster, fans can test drive as well as race one of Porsche's most spectacular looking vehicles to date. So strap yourself in as you prepare to put the pedal to the metal when you push one of the most powerful sport machines to its limits on test tracks set right across the globe. The Porsche Boxster is a machine capable of going from zero to 60 mph in a mere 6.7 seconds, powered by a six-cylinder, 24-valve twin overhead camshaft. With 201 horse power at 6,000 rpm and 181 pound-per-foot of torque at 4,500 rpm, the Boxster is well known for its amazing power and top speed at 200 km per hour. Sony Computer Entertainment Europe has been able to create the 3D model by blueprints of the vehicle from Porsche engineers and have created the car all the way up from gouraud shading and real-time lighting effects for maximum realism and effect. The View Boxster option allows players to watch a documentary film on the Porsche's and Boxster's creation with the history told from the viewpoint of the engineers themselves. Sony Computer Entertainment Europe has also created four test grounds for testing and racing the Boxster. These include U.S.A., Japan, Alpine, and Stuttgart, the official testing track for Porsche vehicles. These tracks have been further opened up to create a total of 20 track combinations through the use of opening up new paths, and racing the tracks in reverse. The single-player side of Porsche Challenge is split into Practice, Time Trial, and Championship modes. Championship provides a collection of 12 races with five other competitors per race, as well as being available through three different difficulties. The two-player option allows players to play either Single Race or Championship modes with the options to play Arcade or Simulation style where they can switch on or off, catch up, and choose one- or two-player delay. Players can also select what driver they want to use with each sporting a different color Boxster, as well as a racing personality. Options in Porsche Challenge include a CD player that allows: alignment of the four provided electronic tracks with each course (tracks include \"Asian Beats,\" \"Alpine Funk,\" and \"Tribute to Dragon\"), output effects, change music and sound effects volume, high scores, button configuration, and automatic and manual selections. English, French, and Italian languages are also offered. As well, the game supports analog control and uses only one block of memory.", "platform": "Sony Playstation", "release_date": "August 15, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "SCE Studio Soho", "publishers": "Sony Computer Entertainment", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.55", "wikipedia": "https://en.wikipedia.org/wiki/Porsche_Challenge", "video_link": "https://www.youtube.com/watch?v=C9cPjbXWO2I", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11907-porsche-challenge\n"}