{"altername_name": ["Power DoLLS 2"], "name": "Power Dolls 2: Detachment of Limited Line Service", "overview": "Power Dolls 2 - Detachment of Limited Line Service is a Tactical RPG video game in which an all-female elite force helps defend their homeworld, Omni, which is seeking it independence from Earth, using a variety of mecha-based weapons. Story of the series: In the year 2535, planet Omni entered independence war against planet Earth government for land dispute. Facing the overwhelming Earth forces, Omni government converted the pioneering Power Loader (PLD) units into walking combat machines. In 2540, the third team of 177th squadron, an all-female combat group named DoLLS (Detachment of Limited Line Service) has seen deployment. 177th squadron is a special force for the OMNI Military. It was established during OMNI independence war, specialized on combat using X-1 bipedal PLD. This elite composite detachment consists of members from all branches of Omni Military, organized in 3 teams. * Team 1: Forest combat team. Specializes in hill and forest combat. * Team 2: Urban assault team. Specializes in city, fortress combat. * Team 3: DoLLS team. Specializes in surprise attack, sniper, infiltration. Third team, also known as POWER DoLLS, is an all-female combat group. In the video games, player controls this team. They also use state-of-the-art X-3 (and above) type Power Loaders. In the game, player takes control of that combat group over nine missions. The game has 2 game modes: - Campaign Start - Scenario In order to start a scenario you'll need to point it to a campaign save file which contains characters you've used. Choosing \"Campaign\" will bring you to the character select screen where you must choose five characters from the list to use in the first battle.", "platform": "Sony Playstation", "release_date": "November 20, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Kogado Studio", "publishers": "Ascii Entertainment", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111979-power-dolls-2-detachment-of-limited-line-service\n"}