{"altername_name": ["Saban's Power Rangers: Time Force", "Power Rangers: La Force du Temps"], "name": "Power Rangers: Time Force", "overview": "Saban's Power Rangers Time Force brings the 2001 incarnation of the long-running Fox Kids show to the PlayStation. Players will take on the role of one of five Power Rangers -- red, green, blue, yellow and pink -- and battle evil throughout the universe and throughout time. Each Ranger has his or her own different attribute levels in categories like power, speed and martial arts skill. Each of the game's eight levels takes place in a different time period. Players will have to tame the Wild West, take down evil cavemen in the Stone Age, and go toe to toe with pirates on the high seas. Most levels require players to find objects scattered about the level before they can go on to fight the boss. And once they beat a boss the first time, it will mutate into a giant sized version, as on the show. It is then necessary to dispatch the villain by taking control of the Power Rangers' famous Blue Zord. Once a character has entered a level, they have a certain amount of time to complete the stage. If the timer runs out, the level doesn't end but players won't receive a power-bar bonus. To best the clock in any given level, players will come upon small and large hourglass icons. These icons slow down the clock or add a large chunk of time. Players will also find health power-ups and charger stations where they can regain the power to perform special maneuvers they will learn throughout the game. And if you run out of time in a level, you always have the opportunity to give it a try again.", "platform": "Sony Playstation", "release_date": "November 2, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Climax Studios", "publishers": "THQ", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=N50fMD28QXc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/20361-power-rangers-time-force\n"}