{"altername_name": [], "name": "Princess Maker: Yumemiru Yousei", "overview": "Princess Maker 3 is the fourth game in the series. The plot of this game is the Faery Queen observes all her beautiful children, stating that today is their birthday. She asks all what would be their main wish / desire. PLOT: The game begins with the Queen of the Faerie realm speaking to the father figure in this game, addressing the father figure by the profession he chooses. She explains that a certain faerie wishes to become a human princess, and has pleaded with her to come to the human world. She then bestows the girl on the hero, making it his job to raise her to adulthood. To help with the task, a faerie housekeeper by the name of Uzu is assigned to the hero, and thus the journey begins. A young faery girl asks the almighty Faery Queen to become a human princess. The queen tells her it's an odd wish. She says \"But I REALLY want to become a Human Princess!\" So now, the Faery Queen says that she will let the Faery have her dream, or something to that effect (did I mention I'm not a Japanese Major?, or even a minor..) She, for some reason, is put in your posession to raise into a human Princess. GAMEPLAY: To reach her dream she will have to improve his stats doing different kind of jobs: Babysitting, Housework, Ore miner, Market, Maid, Farmer, Tutor, Saloon, Carpenter, etc. The jobs offered aren't able to be done right away, first she is given a few, then when her skills develop, she can do other jobs. There are also different kind of schools to go to study (music, fighting, painting, dance, protocol, etc.).", "platform": "Sony Playstation", "release_date": "January 24, 1997", "game_type": "Released", "esrb": "", "developers": "Nine Lives", "publishers": "Nine Lives", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111983-princess-maker-yumemiru-yousei\n"}