{"altername_name": [], "name": "Pro 18: World Tour Golf", "overview": "Pro 18: World Tour Golf attempts to bring the authenticity of golf to the PlayStation console by incorporating real-life courses and world-renowned PGA and LPGA tournament players. Included is the 1998 United States PGA champion Vijay Singh and Mark O'Mera, who won both the 1998 Masters tournament and British Open championship. There are eight players in all with the ability to create your own golfer. There are various game modes including Practice, Stroke Play, Fourball, Shoot Out, Skins, and a Tournament. In the Practice mode, you can practice putting, driving, and chipping the ball on the course and hole of your choice. This is ideal for new players unfamiliar with the ways of professional golf. Stroke Play is simply nine or 18 holes of golf where players try to finish with as few strokes as possible. The Fourball option includes two teams of two golfers competing for the lowest score. One person hits the ball and the other team must beat or match that person's score. Whoever has the lowest number of strokes on a hole wins and tees off on the next hole. A Shoot Out involves a money-based tournament where players compete on a hole-to-hole basis. Whoever finishes the hole with the lowest score wins a sum of survival money; whoever has the most strokes is eliminated. Skins is much like the Shoot Out only players aren't eliminated and the hole payments are much more. Finally the Tournament consists of four rounds of golf played in the span of four days. There are initially 72 golfers competing throughout the first two days; at the end of the second day, the 36 best golfers advance while the other half is cut from the tournament. In order to win money, players must finish somewhere in the top 18. Pro 18: World Tour Golf is played with a 4-click swing meter that allows you to apply spin and add extra oomph to your shots. It allows you to draw or fade around obstacles (hitting the ball left or right), chip from the fairway, and other things found in professional golf. There are three different real-life courses to play though including the Ireland based Royal County Down, The Lost City located in South Africa, and the United State's Coeur d'Alene. Additionally, Pro 18: World Tour Golf supports the PlayStation's Multi Tap for up to eight players. Customized golfers, tournament settings and advancements, and course statistics can be saved via Memory Card.", "platform": "Sony Playstation", "release_date": "April 10, 1999", "game_type": "Released", "esrb": "", "developers": "Intelligent Games", "publishers": "Psygnosis", "genres": "Sports", "max_players": "8", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80599-pro-18-world-tour-golf\n"}