{"altername_name": ["World Soccer Winning Eleven 2002"], "name": "Pro Evolution Soccer 2", "overview": "Pro Evolution Soccer 2 is the latest edition of the greatest, most addictive footy sim series. Sticking to the principle that playability comes first, detail and frills second, the series all but guarantees season upon season of pulsating gameplay. Fans of Pro Evolution will naturally have a few gripes about this update. There has been some notable tampering with the terminology: \"injury time\", for example, is now \"loss time\". More annoyingly, the club teams have been renamed beyond recognition. Manchester United has been rechristened \"Aragon\", while the mighty Real Madrid becomes \"Navarra\". This shouldn't detract too much from what is a lovingly rendered simulation of the beautiful game. Opponents and computer-controlled team mates have been blessed with more intelligence this time around and players' skill sets more accurately reflect their individual stats. This version is harder to master than its predecessor but it is still accessible to newcomers thanks to far-reaching multi levels and changeable speed settings. Once familiar with the gameplay, gamers of all abilities will undoubtedly be hooked by the intensity and realism of the action. With a fantastic range of competitions in which to test their skills, gamers can play as one of 32 club teams in the Master League or compete in a plethora of international cups and leagues. And, at last, recognisable commentators are at the mic: Peter Brackley sits alongside Trevor Brooking although it soon becomes apparent that the pair's repertoires are even more limited than in real life. Frustratingly, Konami has raised the bar for soccer sims while tampering with some key details and features. But despite the few minor flaws in this update, Pro Evolution Soccer 2 is another sure step on the road to football gaming perfection.", "platform": "Sony Playstation", "release_date": "April 25, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.92", "wikipedia": "https://en.wikipedia.org/wiki/Pro_Evolution_Soccer_2", "video_link": "http://www.youtube.com/watch?v=gHKZeQRRSzg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30991-pro-evolution-soccer-2\n"}