{"altername_name": [], "name": "Psybadek", "overview": "Xako and Mia live for one thing and one thing only: to catch serious air performing mind-blowing stunts on their hoverdeks. A hoverdek is best described as a hovering skateboard, it works the same way but there are no wheels and it's constantly floating. Back to the story at hand, these two dekkies are fanatical about their skills; they would go adventuring with their buddies and show off new tricks. Would meaning past tense; dekkies are now being oppressed by the maniacal Krakken. With a sour hatred for hoverdeks, the cheese-smelling ingrate kidnaps dekkies and stores them in his mundane world. Xako and Mia are at the end of their ropes and decided that its time to destroy Krakken and rescue their fellow dekkies! Psybadek combines third-person 3D platforming with the trickery of a snow or skateboarding game. Spanning four unique worlds, players will overcome a series of platforming obstacles, pickup important items, and perform a barrage of death defying stunts aboard a hoverdek. Stunts include a ground-shaking SuperStomp, a 360-degree spiral, a circular back flip known as the Firewall, a near impossible spinning Powerblast, and a weather altering Elektra Storm. Broken into eight levels apiece (with a bonus level in each), the four worlds consist of an Ice World, a Jungle World, a Desert World, and the Underground. Level and world selection is chosen from the Psyba-Zone, which holds it all together as a hub. Each level features a unique design ranging from psychedelically rendered jungles to ancient temples. Krakken does not tolerate the insolent; anyone with enough guts to challenge him will be met with extreme resistance. His army consists of waddling penguins, genetically altered freaks that throw rocks and snowballs, and the ever-dangerous monkey. Fortunately, Xako and Mia are packing a few unique weapons such as the anti-matter missile, the C. King plastic explosive, and a Ballistic Bogey Bomb. They can also collect a number of stars that increase the overall score that awards the player with some extra goodies! Psybadek also features a few free-roaming areas and a local skate park when the going gets a little rough! So what are you waiting for? Grab your hoverdek, catch some massive air, and save your buddies from the evil Krakken!", "platform": "Sony Playstation", "release_date": "October 31, 1998", "game_type": "Released", "esrb": "", "developers": "Psygnosis", "publishers": "Psygnosis", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.6", "wikipedia": "https://en.wikipedia.org/wiki/Psybadek", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78983-psybadek\n"}