{"altername_name": [], "name": "Psychic Force: Puzzle Taisen", "overview": "Psychic Force is a fighting arcade game created by Taito which was later ported to the PlayStation in 1996. The PlayStation version was released by Acclaim in North America, and in PAL regions. The game was a 3D fighter which combined the normal features of an arcade fighting game with psychic powers. There were eight characters available to choose from in the game, all deemed as 'psychic masters'. The game was released without much hype and failed to sell many copies. In 1999 a sequel was released under the title Psychic Force 2012 also for the arcade, and was ported for the Dreamcast console. It was adapted to the PlayStation under the title Psychic Force 2. Psychic Force 2 (PF2) is the Playstation version of the arcade game Psychic Force 2012 (2012) which was released also for the Sega Dreamcast There was also a Puzzle Bobble style puzzle game released that was known as Psychic Force Puzzle Taisen, this game was never released outside of Japan, however. In 2006 in Japan, all three games were released together as an anniversary pack for the PlayStation 2. Taito plays the cross-licensing game by mixing their 3-D fighter Psychic Force with their 2-D puzzler Puzzle Bobble to spawn Psychic Force Puzzle Taisen. At its core, Puzzle Taisen is Puzzle Bobble. Fans of Bobble will immediately recognize the familiar colored spheres and the launching mechanism at the bottom of the screen. The difference that Psychic Force brings to the table is a simple storyline where you play a Psychic fighter who goes against another Psychic in a game that was once the sole domain of stout green dragons and other chubby Taito mascots. The gameplay involves you shooting off colored projectiles, which you aim at groups of the same colored spheres. Hit a well-placed chain of spheres, and you can dispatch an avalanche of them... The storylines and character interaction between the adversarial Psychics prove to be mildly interesting and help to string the encounters together. There are 3 games modes: 1 - 1p mode: Choose between 9 characters and play 9 stages 2 - History mode Play 9 different stories. 3 - 2p mode: Play vs other human or a computer rival The premium CD features a movie special (that are movie adverts of games like Time Gal & Ninja Hajate, Psychic Force, Tokyo Shadow, Super Football Champ, Raystorm, etc), a voice library and a sound gallery.", "platform": "Sony Playstation", "release_date": "October 2, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Taito", "publishers": "Taito", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111989-psychic-force-puzzle-taisen\n"}