{"altername_name": [], "name": "Purumui Purumui", "overview": "The game starts with Mui and Popuri (a pink bunny with a ribbon. Looks similar to Mui) running along until they come across a strange area with a magical emblem on the ground. The two look up into the sky to find a beautiful girl descend to the ground in a radiant glowing orb. Eventually, Madoka (the girl from the light) awakens and she is in the home of the old Fillip Side inhabitant, Muu. \"Fillip Side\" is the name of the world in this game. Anyway, setting some details aside, you will end up saving Fillip Side from utter disaster and you will need to become a great chef to do so. Throughout the game, you will find recipes and gather ingredients to make several dishes. They can be used for a number of different things, but the important recipes create items that allow Mui to change his shape! Mui can become a rocket, bridge, and other unusual objects to help Madoka progress through the story, but he can only transform at morphing points. The game also functions like an hack-n-slash action RPG. Madoka will gather several power medals which allow her to change her persona. She can become a knight and a mage as well as other forms. When Madoka changes, so does Mui, giving Madoka a variety of different abilities she can change on the fly. Madoka can even summon special creatures to aid her. The effectiveness of her various forms change based on the scenario present, but you must watch how many Star Points (SP) you use because you can only carry a few items at a time. She also has a charge attack that deals more damage than her normal attack. Pocket Kitchen. This option allows you to play a Purumui Purumui minigame via the Pocketstation.", "platform": "Sony Playstation", "release_date": "September 14, 1999", "game_type": "Released", "esrb": "", "developers": "F2 Company", "publishers": "Culture Publishers", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111992-purumui-purumui\n"}