{"altername_name": ["Starsweep", "SuperLite 1500 Series: StarSweep"], "name": "Puzzle Star Sweep", "overview": "Puzzle Star Sweep is the first puzzle game in A1 Games' line of budget-oriented titles. The object of the game is to clear an area of red, yellow and blue rectangular blocks by rotating and moving them so their stars line up. Each block is the same size and contains either one or two stars. Your well is constantly being filled with blocks that rise from the bottom of the screen, and the blocks that you place yourself can be placed anywhere they will fit. The One-Player Mode is an endless mode where you play until the blocks reach the top of the screen. Story Mode is a series of vs. battles. In this mode, clearing multiple blocks and starting chain reactions dumps obstacles on top of your opponent's playfield. But watch out, because the same can be done to you. The gameplay in VS Mode is the same as in the Story Mode, except you compete against another human player. Attack Mode is a collection of six challenges that revolve around completing specific tasks, such as making as many chains as possible or going for a high score. One notable feature in Puzzle Star Sweep is the concept of \"stardust,\" which functions as points that go toward unlocking bonus features. Stardust is earned through a variety of means, including defeating opponents in the Story Mode and earning medals in the Attack mode. ´ Features * Includes four modes of play from the start: 1-player, 2-player, Story and Attack * Story mode features eight characters to choose from * Unlock Special Mode by collecting star fragments", "platform": "Sony Playstation", "release_date": "January 15, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Axela", "publishers": "A1 Games", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=TvlWWjZA3nE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31900-puzzle-star-sweep\n"}