{"altername_name": ["Q-bert"], "name": "Q*bert", "overview": "Hasbro Interactive continues their series of classic Arcade game remakes with Q*bert for the PlayStation. In this disc you'll find the original game, a new Adventure mode and a special Head-To-Head contest. Those of you who misspent your youths in the Arcades will recall that the original Q*bert stars a little round orange guy with bulging eyes, a round snout for a nose, short legs and no arms or torso. Your job is to hop Q*bert around a pyramid of cubes and change the colors of the cubes to a target color. In later rounds, you will need to change the colors of the cubes more than once in order to achieve your goal. Once the entire pyramid has been changed to the target color, you advance to a new pyramid. While you are hopping Q*bert up and down the cubes of each pyramid, enemies, most of which are deadly to the touch, will try and stop your progress. Another way to die is to hop off of the pyramid without landing on one of the three discs that are placed above and beside the pyramid. These discs are useful when enemies, such as Coily the snake (Q*bert's archenemy), are in hot pursuit. Green enemies and objects can (and should be) be touched, and some of them cause trouble. For example, Slick and Sam wreak havoc by hopping on cubes and changing their color. In the Adventure Game, Q*bert's home world and friends, including Q*dina (a female version of Q*bert), have been kidnapped by Coily the snake. You must brave four unique dimensions with six levels each in order to find four pieces of the Magic Disc. Once again, you must hop on cubes to change them to a target color (or colors), but this time the playfield varies in shape from level to level and there are lots of new enemies and features. You'll discover bonus rounds, secret levels and special cubes that score you bonus points or transport you to new locations. Also, power-ups, such as keys, smart bombs, speed boosters, torches and other useful items, will help you defeat enemies and complete levels. In the Head-To-Head competition, one player controls Q*bert and the other assumes the role of Q*dirk. Yes, once again, cube-hopping is the name of the game. Q*bert's cubes are orange , Q*dirk's are blue, and green cubes are shared. Players must complete their own color cubes while trying to grab as many green cubes as possible. Many of the Head-To-Head cubes can be used to foil the other player. For example: A Coily Spawn Cube will produce a snake in your opponent's playing field; a Camera cube reduces the visibility of the opposite player's cubes; and a Trigger cube sets off an explosion for tagged cubes in your opponent's playing field.", "platform": "Sony Playstation", "release_date": "November 12, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Artech Studios", "publishers": "Atari", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "2.43", "wikipedia": "https://en.wikipedia.org/wiki/Q*bert_(1999_video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5218-qbert\n"}