{"altername_name": ["Simple 1500 Series Vol.80: The Jintori"], "name": "QIX Neo", "overview": "Based on the 1989 Taito coin-op Volfied, Qix Neo brings updated arcade classic gameplay to your PlayStation. Volfied (also known as Ultimate Qix on the Sega Mega Drive/Genesis or Qix Neo on PlayStation) is an arcade game released by Taito in 1989. A port for MS-DOS has been developed by Empire Interactive and published by Taito in 1991. The game is an updated version of Qix, with extra features and a futuristic science fiction aesthetic, rather than Qix's abstract geometry style. The player pilots a small spaceship instead of a simple dot and the enemies come in the form of various aliens. Taking place in another galaxy, a space pilot is returning to his home world of Volfied, only to discover that it is under attack by an unknown alien force. The few remaining Volfied inhabitants are in an underground location of the planet and signal the pilot to their aide. The pilot flies to Volfied using his ship's defensive weapons in order to eliminate the alien threat and save his people. You are in charge of eliminating a mysterious virus from your computer, and just like in the arcade game, you control a marker that is used to fill the screen with boxes, rectangles, and any other shape that can be made by drawing straight-line segments. As you draw, you must not let a Qix or a Spritz touch your marker or your Stix. A Stix is any line of a square or other shape you are drawing prior to its becoming a filled-in section of the screen. If you stop moving while in the middle of drawing a Stix, a Fuse will burn up your Stix and try to destroy your marker. The game includes two modes of play: \"Original\" mode taken straight from the arcade, and \"Arrange\" mode that features 96 levels with varying attack patterns. There are a variety of ways to clear a level including cutting off at least 80 percent of each level's playing field, gaining a special laser item that will defeat the boss, colliding with a spark, or hitting an enemy with your weapon. The difficulty may be adjusted between easy, normal, and expert and a ranking system shows the top five scores of \"Original,\" and \"Arrange\" mode. Features: * Eliminate the virus from your computer by filling the screen with boxes, rectangles, and other shapes * Avoid Qix and Spritzs that will ruin your unfilled sections of the screen * Play through \"Original\" and \"Arrange\" mode", "platform": "Sony Playstation", "release_date": "December 1, 2003", "game_type": "Released", "esrb": "E - Everyone", "developers": "Taito", "publishers": "D3Publisher", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.93", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31095-qix-neo\n"}