{"altername_name": [], "name": "Quiz $ Millionaire: Waku Waku Party", "overview": "Who Wants to Be a Millionaire? is a television game show which offers large cash prizes for correctly answering a series of randomized multiple-choice questions of varying difficulty. The format is owned and licensed by Sony Pictures Television International. The maximum cash prize (in the original British version) is one million pounds. Most international versions offer a top prize of one million units of the local currency, though the actual value of the prize varies widely, depending on the currency's exchange rate. The programme originated in the United Kingdom, where it is hosted by Chris Tarrant. It is based on a format devised by David Briggs, Steven Knight and Mike Whitehill. Mino Monta hosts the Japanese version of \"Who Wants to Be a Millionaire. The contestants first have to undergo a preliminary round, called \"Fastest Finger First\", where they are all given a question and four answers from the host. They are asked to put those four answers into a particular order. (In the very first series of the British version and until the end of the 2003 season in the Australian version, Fastest Finger First required the contestants to answer one multiple choice question correctly as quickly as possible.) The contestant who does this correctly and in the fastest time goes on to sit in the chair (the \"hot seat\") and play for the maximum possible prize (often a million in the local currency, though this depends on its value). Once in the hot seat, the contestant is asked increasingly difficult general knowledge questions by the host. Questions are multiple choice: four possible answers are given (labelled A, B, C and D), and the contestant must choose the correct one. On answering the first question correctly, the contestant wins £500 (in the UK – other countries vary the currency but have the same basic format). There is no time limit to answer a question; a contestant may (and often does) take as long as they need to ponder an answer. After the first few questions, the host will ask the contestant if that is their \"final answer.\" Upon making the answer the final answer, it cannot be changed. The first five questions usually omit this rule, unless the contestant has guessed a wrong answer (at which point, the host is hoping the contestant will take the hint)[citation needed], because the questions are generally so easy that to require a final answer would significantly slow the game down; thus, there are five chances for the contestant to leave with nothing if he or she were to give a wrong answer before obtaining the first guaranteed amount; going for £1,000 after winning £500 is the last point in the game at which a contestant can still leave with nothing. Subsequent questions are played for increasingly large sums (roughly doubling at each turn). On the first few questions, some choices often have joke answers. Produced by Fuji TV, this version of the show is commonly known simply as Millionaire, not overly distorted by Japanese phonetics. The rules are the same as the original. Prize levels are denominated in Yen as follows: ¥10,000, ¥20,000, ¥30,000, ¥50,000, ¥100,000, ¥150,000, ¥250,000, ¥500,000, ¥750,000, ¥1,000,000, ¥1,500,000, ¥2,500,000, ¥5,000,000, ¥10,000,000. After viewing a question, the contestant can quit with the money he has already won rather than attempting an answer. If the contestant answers a question incorrectly, then he loses all the money he has won, except that the £1,000 and £32,000 prizes are guaranteed: if a player gets a question wrong above these levels, then he drops down only to the previous guaranteed prize. This means that the players can always attempt the £2,000 and £64,000 questions without fear, since they are guaranteed the previous amount even if they get the answer wrong. If at any point the contestant is unsure of the answer to a question, he or she can use one or more lifelines. After using lifelines, contestants can either answer the question, use another lifeline, or walk away and keep the money (except for the Double Dip lifeline). Each lifeline can only be used once. * Fifty-Fifty (50:50): The contestant asks the host to have the computer randomly eliminate two of the incorrect answer choices, leaving the contestant with a choice between the correct answer and one incorrect one. - Ask the Audience: The contestant asks the studio audience which answer they believe is correct. Members of the studio audience indicate their choices using an audience response system (having 20 seconds to do so, though many televised versions will edit out most of the time). The results are immediately displayed on the contestant's and host's screens. This is a popular lifeline, known for its near-perfect accuracy. Philbin once said that the audience's answer is statistically 95% of the time correct - Phone-A-Friend: Contestants may call one of up to five (in some countries, three) pre-arranged friends", "platform": "Sony Playstation", "release_date": "November 28, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Hothouse Creations", "publishers": "Eidos Interactive", "genres": "Quiz", "max_players": "4", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112097-quiz-millionaire-waku-waku-party\n"}