{"altername_name": ["RC Stunt Copter"], "name": "R/C Stunt Copter", "overview": "R/C Stunt Copter is the PlayStation's first remote controlled helicopter simulation. Having been in development for over two years, R/C Stunt Copter saves the player from having to buy another stunt copter ever again! It does this by offering a realistic physic engine, a variety of gameplay options, free flights, and over forty-five arenas to test your landing, shooting, hovering, slaloming, and stunt flying. Among the gameplay modes are Training, One Player Game, Two-Player Competition, and Free Flight. The Training mode is mandatory as it thoroughly explains how the controls work and how to maneuver the helicopters. Try not to mess up too badly -- there's a drill sergeant watching your every move and hasn't much tolerance for mistakes. Upon completion of the Training mode, the One Player Game will become unlocked. It features five different stages broken into five different levels apiece for a total of 25 levels in all. There are four different types of copters including the Rookie, Pilot, Captain, and Ace, each being the focus of a certain stage. When all stages are complete, a bonus level will open up that truly tests your piloting skills! The Two-Player Competition pits you and a friend in heated battle to discover who is the better helicopter pilot. Players will use copters identical to each other while being graded on accuracy, timing, speed, stunts, etc. Though this mode can be played by alternating one controller, it is recommended that two controllers are used. When there are two controllers, the spectator can toggle on The Hand to distract the current player -- but be careful, that player will use The Hand on you! It also has a limited amount of use. Free Flight allows the player to choose a location and practice everything from landing the helicopter to pulling off advanced stunts. There is no need to worry about that nasty drill sergeant or messing up -- just fly the copter to your heart's desire! R/C Stunt Copter features Dual Shock Analog Controller support in both analog controls and the vibration function. Players can save their scores, stage progress, and stunts by using two Memory Card blocks of data. Features * Master 45 stunt-based challenges * Earn medals in a ten-level training mode * Use both analog sticks on the Dual Shock controller to guide your 'copters", "platform": "Sony Playstation", "release_date": "October 5, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Big Grub", "publishers": "Titus France", "genres": "Flight Simulator", "max_players": "2", "cooperative": "No", "rating": "3.73", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12375-rc-stunt-copter\n"}