{"altername_name": [], "name": "R-Type Delta", "overview": "The story of R-Type Delta throws players into the year 2163, a time of utter chaos. After suffering massive damage, the Bydo Empire has resurfaced with new plans to destroy Earth. By using the destructive newly infected Mortiz-G as a doomsday weapon, the evil empire is threatening to destroy all of the planet's major cities and eventually the human race. Naturally, it is up to you to save the planet by commandeering one of three different R-Type warships! The R9a Delta features a devastating energy dispersing wave cannon with a special nuclear fusion weapon and a quad-force (force powers are explained in the next paragraph). Developed by McGwire Co. Ltd., the Rx features an arsenal of wave cannons, a time disruption corridor, a chain reaction missile, and a tentacle force. Finally, the R13 uses a lighting cannon with a dimensional rift, photon missile, and a claw-shaped anchor force. Force power-ups can be found within the seven different levels of R-Type Delta. Coming in three different colors (yellow, red, blue), the force powers can be attached on the front of a ship or on the back. Not only can they absorb enemy fire, they are indestructible; and by collecting more force pickups of the same color, the attack will be much more devastating. All seven levels are played from a 3D side-scrolling perspective (much like Squaresoft's Einhander). The call of duty will have players battling Mecha-Bydo enemies throughout demolished city streets, a run-down energy reactor, Earth's space fortresses, and a ripple in time through another dimension. This journey isn't a cakewalk, however, as there are countless enemies waiting to destroy your tiny vessel! Best described as organic robot machines, the enemies come from all quadrants of the playing screen. Not only will players have to deal with the Mortiz-G, but they'll have to destroy the crippling Contrite, the reproductive Eve models, a dimension dwelling organism known only as Cyst, and U-Launch Missile Pods. Think you've got what it takes to save the world? Let's hope so -- the Earth is counting on you, pilot! And if you're good enough, send in your high scores to Agetec's R-Type Delta website!", "platform": "Sony Playstation", "release_date": "August 10, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Irem", "publishers": "Agetec", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.31", "wikipedia": "https://en.wikipedia.org/wiki/R-Type_Delta", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5219-r-type-delta\n"}