{"altername_name": ["Ridge Racer Bonus Turbo Mode Disc", "Ridge Racer Type 4"], "name": "R4: Ridge Racer Type 4", "overview": "R4 Ridge Racer Type 4 combines the arcade driving action of its predecessors with simulation-style elements such as custom cars and participating in a full racing season. The game features 45 unique cars (plus over 300 variants), eight different tracks and the following three game modes: Grand Prix, Time Attack and Versus Battle. The heart of the game is the Grand Prix, where you select one of four racing teams and embark on a season spanning eight races. By finishing in certain spots during the event, you will be able to unlock additional cars. Time Attack has you trying to beat the record time for each course, while Versus Battle involves challenging a friend on a horizontally-split screen. Cars that are earned through the season will be automatically stored in a garage awaiting registration. Once registered, the new cars will be eligible for competition in either the Versus Battle or Time Attack modes. Players can also design their own logos, choose from pre-designed decals or simply change each car's color for an added touch of personality. The game also supports standard analog controllers, Namco's NeGcon and the 1999 Jogcon controller. The Jogcon is notable for featuring a built-in dial instead of the two sticks found on Sony's Dual Shock Analog Controller. Steering left or right is accomplished by using both thumbs on either side of the dial, while the shoulder buttons handle acceleration and braking. A motor located behind the dial provides force-feedback. R4 Ridge Racer Type 4 requires a memory card in order to save option settings, unlocked cars, trophies earned during the Grand Prix as well as the top five lap and total race times. The game is also compatible with Sony's PocketStation (canceled for the U.S. market), which would have allowed players to exchange cars with other PocketStations. Along with the fourth installment in the series, Namco has included a second disc entitled \"Ridge Racer Turbo Mode,\" offering two separate versions of Ridge Racer: the 1995 original and a 1999 update featuring high-resolution graphics, vibration feedback and 60 frames per second racing. The bonus disc also contains playable demos of both Klonoa: Door to Phantomile and Tekken 3, movies of Namco's Guncon games and a video preview of Ace Combat 3. Features * Features 45 cars and eight different courses * Witness such special effects as lens flares, skid marks, and smoking tires * Includes a two-player split-screen Vs. mode", "platform": "Sony Playstation", "release_date": "May 5, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Namco", "publishers": "Namco", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "4.32", "wikipedia": "https://en.wikipedia.org/wiki/R4:_Ridge_Racer_Type_4", "video_link": "https://www.youtube.com/watch?v=oDw3265qS0g", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/576-r4-ridge-racer-type-4\n"}