{"altername_name": [], "name": "Race Drivin' a Go! Go!", "overview": "Race Driving' A Go! Go! is the sequel of Hard Drivin' released in 1990. A racing game with three seperate tracks: stunt, autocross, and super stunt track. You can choose from four different cars using either an automatic or manual transmission. Race around each track earning points for distance travelled, passing checkpoints to earn more time. The regular stunt track has other racers and on-coming traffic: a blue minivan, a green sedan, and a large brown dumptruck. This selection actually has two seperate courses: a speed track with ramps and dips in road, and a stunt track with a jump, a loop and a banked curve. The Autocross track is a small track with a pace car. This course requires more precision manuevers, less speed and more skill. The Super Stunt track has banked curves, mountains, winding roads, large jumps, a loop/inverted jump, a barrel roll, a giant ramp, and a tunnel. This is a very large track, the biggest of the three. The player can choose from four different cars three with manual transmissions and one with automatic. All vehicles have different handling characteristics. This is a port from the Atari arcade game Race Drivin', which was their second game of this genre. The first was Hard Drivin'. I remember reading that these games were considered more to be driving simulators than games because of the realistic clutch (friction point) shifter, and force feedback steering. Some people even learned to drive \"stick\" by playing this game in the arcade. Don't let the cute title fool you, this is a very hard game to play. You must perfectly balance the brakes, throttle and steering to make it to the finish line. And lets not forget \"The Loop\". Yes that's right, the tracks have vertical loops that you must maintain the right amount of speed in order to successfully cross them. I told you it was a hard game. Nonetheless, when you crash, and you will, you are treated to your car exploding!", "platform": "Sony Playstation", "release_date": "June 28, 1996", "game_type": "Released", "esrb": "", "developers": "Time Warner Interactive", "publishers": "Time Warner Interactive", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "2.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134886-race-drivin-a-go-go\n"}