{"altername_name": [], "name": "Radikal Bikers", "overview": "Radical Bikers is a conversion from an arcade machine by Gaelco/Atari of 1998 Radikal Bikers will lead players through towns all over Europe and through big cities like New York in the States. Players are required to pick up extra time and power-ups littered around the tracks so they can make it to certain destinations on time. On the way, the players have to perform jumps, smash front windows of shops, and more. Racing from one side of a city to the other within a time limit is the crux of what is happening. Of course, you’ll race against a rival pizza deliverer to up the ‘thrill’ factor and be called upon to collect various pizza ingredients scattered randomly throughout the city. You must choose your pizza delivery boy - each with his own particular abilities -and level of difficulty. There are three levels: Margherita (easy), Capricciosa (medium) y Diavolo (difficult), from which you should choose according to your own skill level. There are four different races at each level to allow you to show the other delivery boy who has the most skill, daring and ability. The main characters use a scooter from 'Italjet', a very famous Italian manufacturer now defunct (in 2001), which is also very well known in Spain. The model used in the game is similar to the 'Dragster' model. There are a few differences between the Arcade version that was ported to the Playstation: - Graphics downsized for the PlayStation's abilities. - 4 extra playable characters instead of just 2. - Split screen 2-Player mode, rather than having to find an arcade with two linked arcade machines. - Radikal Mode is all new for the console.", "platform": "Sony Playstation", "release_date": "May 23, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "Bit Managers", "publishers": "Infogrames", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "4.2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24271-radikal-bikers\n"}