{"altername_name": [], "name": "Raiden DX", "overview": "RAIDEN DX is another one of the few good PSX shooters, proving that the machine can be good with sprites if you know what you're doing. Proper vertical mode is included for the purists, and there are two remixed soundtracks along with the arcade original (\"original release\" and \"Viper Phase 1\"). Three courses are available. Training is a huge level in which you only have one credit (unless you cheat and play 2P) - so it may as well be called \"Score Attack\" level. Novice has five levels, and may just be plain Raiden 2 as there is some reference to it above the course select bit. Expert mode is a full eight-stage game with entirely new levels (except in that each stage has the corresponding Raiden 2 boss at the end), plus an Extra Stage. The third option, however, is one of Raiden DX's most noteworthy innovations. The \"Training Stage\" is a single all-new level, around 15 minutes long and with only one boss, right at the end. Unlike the rest of the game, no continues are allowed, and no 1UPs are available - you get three lives with which to battle all the way to the end, and if you blow it there are no second chances. After more play, you'll also unlock the Special Stage (yet another exclusive-to-DX addition), in which the nervous player must face all ten of the game's bosses one after the other, with generous power-ups but again without the benefit of continues, in a round which is played not for points but against the clock (you get awarded a \"lap time\" for each individual boss, and for the stage as a whole should you finish). The only way to get on the Special Stage's high score table is to complete it, a task which will keep even the most hardcore expert shooter busy for many an hour.", "platform": "Sony Playstation", "release_date": "April 11, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Seibu Kaihatsu", "publishers": "Nihon System", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.21", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24349-raiden-dx\n"}