{"altername_name": [], "name": "Railroad Tycoon II", "overview": "Sid Meier's Railroad Tycoon is a business simulation game. There are five versions; the original Railroad Tycoon (1990), Railroad Tycoon Deluxe (1993), Railroad Tycoon II (1998), Railroad Tycoon 3 (2003), and Sid Meier's Railroads! (2006). Railroad Tycoon was written by game designer Sid Meier and published by MicroProse Railroad Tycoon 2 is the only game of the series that was released for the PSX console. You try to make it to the top of the transportation industry in Railroad Tycoon II, a simulation that takes you from a wannabe to a tycoon (if you're lucky!) The game starts in the year 1804 and past 2020 if you make it that long. There are over 60 different engines and 34 cargo train types available to you through different points in the game. In addition, there are 18 different campaign scenarios for those that want to have a real goal in mind. To begin, you can choose either a tutorial (which is like the manual but more simplified), or you jump in with a campaign. The 18 different campaigns are designed to be played in succession, since they go from easy to difficult. Starting a campaign consists of choosing a map, a difficulty, and a bonus modifier (not available for each campaign). Getting into the actual game play, the main interface is much like SimCity. You can see an entire map, or portions of it, depending upon whether you are zoomed in or not. The left side of the screen has a series of different actions that you can take from within the game, including bulldozing, purchasing tracks, trains, and so forth. There is also an economic overview that brings up a list of all the potential cargo. Lay track is where the real game starts. You have to choose what type of track, what type of bridge and so on. The more track that you lay, the more expensive it gets. You really have to watch every last dollar if you intend to make your way to the top of the industry. Purchasing trains and planning strategic routes for them is the real way to make money in Railroad Tycoon II. You must find open areas and turn them into burgeoning hot spots if you intend to make money in the long run. As you go on, more options are available for your perusal. Cargo and train types increase, as do places for placement. As you go on, you have the option to purchase stocks and control the sale of it. Buying and selling parts of your company and that of others is another key to success in the game. To all potential tycoons, good luck. You certainly have got your hands full here. Features: * Take control of an entire railroad operation from laying tracks to issuing stock * Chug through 18 scenarios like the British Industrial Revolution and U.S. Western Expansion * Master 60 different train engines and 34 types of cargo cars", "platform": "Sony Playstation", "release_date": "January 31, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "GearHead Entertainment", "publishers": "Take-Two Interactive", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Railroad_Tycoon_II", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11350-railroad-tycoon-ii\n"}