{"altername_name": [], "name": "Rampage 2: Universal Tour", "overview": "Rampage 2 Universal Tour is a video game released in 1999 and is the third game in the Rampage series. They say that lightning never strikes twice, but apparently the old adage doesn't apply to the fine folks at Scumlabs International. The unfortunate incident with George, Lizzy and Ralph should have forever changed the manner in which the chemical company conducts its business, but there has been yet another \"accident.\" Now the world has to deal with the fury of three new beasts, and they won't stop until they find their fellow monsters for an all-out \"bash\" of epic proportions! George, Lizzie, and Ralph have been captured for the world to see. George is held at New York, Lizzie is imprisoned in Tokyo, and Ralph is stored in London. Scumlabs, who has just rebuilt their facilities in Salt Lake City, causes another accident that results in three new monsters so you must take control of one of the new beasties to set your friends free. Players can choose from a lobster named Ruby, the rhino Boris, and a giant rat called Curtis. When a player (literally) unlocks Ralph, Lizzie, or George, then they become playable characters. Once all the monsters are rescued, aliens begin to invade the earth, leaving the monsters the only ones who can save the planet they just helped partially destroy. After fending off the invasion on Earth, the monsters rescue Myukus (a cyclops-like alien) from Area 51 before chasing the aliens through space, destroying the aliens' bases throughout the Solar System and eventually rampaging through their homeworld. The object of the game is simply to stomp, punch, and kick everything in sight while trying to demolish a 2D city. Hostile threats include members of the armed forces, who will riddle your hide with bullets, explosives, and rockets on the ground as well as in the air. In order to clear a level, you'll have to completely destroy all of the buildings within the city. To do this, each monster can punch at the building while climbing it or repeatedly jump on the roof until it collapses. Things to keep an eye out for are open windows that can hold assorted power-ups and food. Watch out though, there might be a hazard that will cause your monster to vomit uncontrollably! After clearing a stage, a damage report will appear with statistics in the following three areas: building destruction, vehicle destruction, and human consumption or destruction. So the more you destroy, the higher ratings you'll receive in the damage report! Rampage 2: Universal Tour lets you compare such totals against up to two other players (with a Multi-Tap peripheral), and monster lovers can also continue the \"tour\" using one block of memory card space. Other features include multiple difficulty levels, the ability to share lives with friends and the option to damage fellow monsters with your attacks. The game also supports the Dual Shock Analog Controller to make you feel every rumble and crash! Features * Play as one of nine giant monsters * Smash and bash your way across three continents and more than 125 levels * Features three-player simultaneous action", "platform": "Sony Playstation", "release_date": "March 31, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Avalanche Software", "publishers": "Midway", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.7", "wikipedia": "https://en.wikipedia.org/wiki/Rampage_2:_Universal_Tour", "video_link": "https://www.youtube.com/watch?v=2g1-am3jHXo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/578-rampage-2-universal-tour\n"}