{"altername_name": [], "name": "Rayman Rush", "overview": "Rayman Rush is a character-based racing game similar to other foot-racing titles such as Micro Maniacs or the Xbox' Mad Dash Racing. A selection of seven playable characters from the Rayman universe race to the finish line, overcoming obstacles and collecting power-ups along the way. Rayman Rush is a on-foot racing game developed and published by Ubisoft, based on the Rayman universe. In many ways, it is like half of a port of Rayman Arena, featuring conversions of the same race tracks, the same introduction movie and also character theme songs (it, however, lacks the battles from M, and the character roster is different). It is a 1-2 player game, and each race has 2 characters running (1 in certain game modes). The game was released 4 months after Rayman M/Arena. Races take place on 12 tracks in four worlds and there are five main modes of play: Training, Championship, Time Attack, Lum, and Target. Some of the modes of play in Rayman Rush concern more combative contests, as opposed to straightforward racing. Success allows players to unlock new characters and play modes. Two Rayman Rush players can race head-to-head, split-screen style. CHARACTERS: Rayman Rush features 8 playable characters: * Rayman: The limbless main character of the game and series. He uses his hair as a helicopter to glide and likes to use his torso as a ball. * Globox: Rayman's best friend. He blows up like a balloon to glide. While he might appear a bit awkward and clumsy, his oversized body hides a definite dexterity and fighting spirit. * Globette : As shy as her husband Globox, she is yet a fierce competitor when it comes to racing. She blows up like a balloon and rotates her feet like a fan to glide, sort of like Globox. * Admiral Razorbeard: Previously the main villain in Rayman 2, Razorbeard is the admiral of the robot pirates. He is always angry, irritable and mean. What he lacks in size, he makes up for in spite. He rotates his arms as a helicopter to glide. * Henchman 800: One of Razorbeard's robot pirate lackeys. He glides using his built-in jet pack. * Tily: A slight, fragile and impish little fairy who likes to perform kicks. She uses her wings to glide. * Hunchman 1000: An older version of the robot pirates, which came before the Henchman 800. He glides using his built-in jet pack, like the 800. * Razorwife (called Mrs. Beard in the character menu): Razorbeard's wife, who has a more refined and fashionable appearance, though thinly revealing the same traits as her horrible husband, only worse. She rotates her arms as a helicopter to glide. GAMES MODES: There are 5 game modes (only Championship Mode has multiplayer support): * Championship Mode: You will compete with a computer-controlled character (or a second human player if multiplayer is on). You have to finish 3 laps before your opponent to win. One victory in Championship Mode unlocks Lums Mode for the same track. With multiplayer, the screen is divided vertically. * Lums Mode: Only available once the corresponding level has been unlocked in Championship Mode. In this mode, many Yellow Lums are spread around the maps. You must compete with a computer-controlled character and win the 3-lap race. At the same time, collect as many Lums as possible. If you win, the corresponding level will be unlocked in the Target Mode, Depending on the number of Lums you collect, you will win a time bonus for Target Mode. * Target Mode: Only available once the corresponding level has been unlocked in Lums Mode. You will racing alone against the clock, shooting at butterflies that are spread around the level. Each butterfly you shoot gives you extra time. * Time Attack Mode: You will run one lap on your own. The aim is to reach the next checkpoint before the timer reaches 0. * Training Mode: This mode serves only as a means of familiarizing you with the tracks, and allows you to practice and master the game controls and tricks before a real challenge. Features: * Play as or against eight characters from the Rayman series * Challenge friends or the computer on 12 themed courses * Features five play modes: Training, Championship, Time Attack, Lum, and Target", "platform": "Sony Playstation", "release_date": "March 29, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Ubisoft Shanghai", "publishers": "Digital Dream Studio", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.16", "wikipedia": "https://en.wikipedia.org/wiki/Rayman_M#Rayman_Rush", "video_link": "https://www.youtube.com/watch?v=-HMo4kifz6M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11170-rayman-rush\n"}