{"altername_name": [], "name": "Rayman", "overview": "Rayman is a side-scrolling platform game starring a whimsical character with fists instead of arms and feet instead of legs. Rayman embarks on strange quest to save the Great Protoon and his tiny followers from the evil Mister Dark. Since the land relies on the Great Protoon to maintain balance and harmony, the planet is now in chaos. Guide Rayman across 70 cartoon-like levels while facing over 50 bizarre baddies trying to put the limbless hero out of commission. Along the way, you must attempt to free singing creatures called Electoons from their cages. Don't expect a walk in the park, however. The enemies have been designed to learn your playing style in order to defeat you. Acquire new moves and abilities as you progress through the world, and return to earlier levels to find hidden secrets. Rayman offers CD-quality sound effects and music, vibrant vistas featuring 65,000 colors, and four layers of independently scrolling backdrops. A memory card with two blocks of free space is required to save progress. Features: * Help Rayman rescue the Electoons * Includes 70 levels and more than 50 characters * Graphics feature 65,000 colors and independently scrolling backgrounds STORY: Embark on a strange quest to save a world's Great Protoon and rescue little Electroons from imprisonment. You see, the world of Rayman relies on the Great Protoon to maintain balance and harmony for every living creature. The problem is that the evil Mister Dark has decided to capture him (it?) to throw the planet into chaos. This is where you come in! Guide Rayman through 70 cartoon-like, side-scrolling levels facing over fifty bizarre characters trying to put you out of commission. Along the way, free the Electroons who have been forced into cages by the baddies. Don't expect a walk in the park, however. The enemies will actually learn your playing style in order to defeat you! Acquire new moves and abilities as you progress through the world and return to earlier levels to find hidden secrets. Rayman also features CD-quality sound effects and music, 65,000 colors, plus four layers of independently scrolling backdrops to mesmerize you while playing. Don't just stand there gawking, the Great Protoon awaits! GAMEPLAY: The Rayman character is perfect for little children, though this game is easily difficult enough for adults. 60 levels for Rayman to conquer and none of them is easy, not even the first levels, because you have to get used to controlling Rayman. Sometimes the difficulty can be quite annoying, but luckily, if you get by a clown holding a camera and let him take your picture, you can save your progress in a level. On the world map there's also points where you can save after completing a level, it doesn't take much space in you system memory. A problem is, that when you completed all levels in the game, you still haven't beaten mister Dark. To get to this final level you must find each of the six cages of Electoons in each of the 60 levels. So if you can't find one cage, completing the game is impossible. A very good thing in the game is that the further you get in the game, the more abilities you get. For example, Rayman can hang on an edge, helicopter, use his glove to beat enemies, that sort of thing.", "platform": "Sony Playstation", "release_date": "September 9, 1995", "game_type": "Released", "esrb": "E - Everyone", "developers": "Ubi Soft Paris Studios", "publishers": "Ubi Soft Entertainment Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.07", "wikipedia": "https://en.wikipedia.org/wiki/Rayman_(video_game)", "video_link": "https://www.youtube.com/watch?v=ZNO9AaJ7I_4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11115-rayman\n"}