{"altername_name": ["Rayman Junior: 1. + 2. Klasse: Lesen und Rechnen"], "name": "Rayman Junior: Level 1", "overview": "Designed by educators, Rayman Brain Games for PlayStation incorporates learning activities into an adventure game starring the established character Rayman. Based on standard curriculums, the title introduces math skills, numeral recognition and place value, phonics, spelling, and reading as part of a multi-level game similar in play to the original Sonic The Hedgehog. Players will take Rayman through 12 adventure games, each with five levels, in search of The Wizard's Magic Book of Knowledge stolen by Mister Dark. Upon successfully completing an activity, a piece of the parchment, which in whole reveals the location of Mister Dark's hideout, is awarded. Art Alley, Peeble Peril, Ring Rhapsody, Copter Candy, Butterweed Bog, Eraser Rebound, Rocky Road, Slick Slopes, Crazy Caves, Rising Tides, Percussion Path, and Tasty Chase are the 12 activities making up the game. They are equally divided into six grammar and six math activities. Copter Candy teaches children about place value while making use of Rayman's super helicopter ability as he flies through a candy maze. Art Alley encourages children to recognize beginning word sounds while guiding Rayman through the level by gliding on artist's pallets. Three difficulty levels allow the activities to be tailored to different grade levels. Practice levels in Betilla's Garden are available from the beginning of the game, allowing children to hone their Rayman-controlling abilities such as jump and crawl, as well as his Superfist and Helicopter actions. This area can be skipped, permitting players to begin the first activity immediately. The Wizard and Bettila the Fairy guide Rayman through the adventure offering help and advice, and extra help is also available on some of the levels by pressing the R2 button. The Magician's Hat gives instructions for the exercise, and players will need to be on the lookout for items such as life giving Super Power Balls, Extra Lives, Speed Fist, and Golden Fists that give speed and power to Rayman's Super Fist action. Blue Bubbles lead the way through every level and provide an extra life for every 50 collected. Rayman will be hindered by spiked berries, rocks, and other critters he encounters. Progress can be saved after completing any of the activities and requires one free Memory Card block per single game file.", "platform": "Sony Playstation", "release_date": "December 20, 2000", "game_type": "Released", "esrb": "", "developers": "Aqua Pacific", "publishers": "Ubisoft Entertainment", "genres": "Education", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127152-rayman-junior-level-1\n"}