{"altername_name": [], "name": "Rayman Junior: Level 3", "overview": "Rayman Junior (also known as Rayman Brain Games in the United States) is an educational video game based on Rayman that was designed to teach children aged 6-8 years old the basics of mathematics and literacy. Many variations of the game are known to have been released for MS-DOS starting from 1996, with the Sony PlayStation version being released in 2000. PLOT: Happiness abounds in Rayman's world. The sun shines brightly, the plants are green and the clear water of the river bubbles and sings merrily as it flows. Deep in the forest, the Wizard's cottage is peaceful and sheltered. There, he and Betilla the Fairy spend time enjoying their idyllic world and protecting the Wizard's Magic Book of Knowledge. The Wizard, a very scholarly and philosophical person, has put all the secrets of wisdom and knowledge in this book; the secrets that keep the world happy and beautiful. But one day, the evil Mister Dark breaks into the Wizard's cottage, destroying everything in his wake, and steals the Book of Knowledge and the map to this secret hideout that Rayman gave to the Wizard! Now the world will be at the mercy of the evil Mr Dark! So the Wizard and Betilla call for the one person who can save the world and return it to its former happiness and beauty. They call for Rayman!!! Only this superhero, who has proven his courage time and again, can save the world from such a grave situation. It will be a long and difficult journey, but Rayman is strong and clever, and prepared to face the challenges ahead. Each time Rayman successfully completes a challenge, he gets a piece of parchment which, when matched with all the other pieces he obtains along the way, forms the map that will show the way to Mister Dark's hideout. Once the map is pieced together, a final test will give Rayman the chance to retrieve the Magic Book of Knowledge from the evil Mister Dark, and fill his world with happiness and beauty again. Good luck Rayman!!!!! GAMEPLAY: The gameplay in Rayman Junior is somewhat simplified specially for the young player. The number of levels in the game has been reduced to just twelve, two per world, and each one covers an educational topic, such as phonics, adding and subtracting, number recognition etc. The questions asked come in three difficulties, which may or may not be selectable depending on the version. Each level starts with the Magician giving Rayman an overview on what he has to do. Then the player will see the Magician's hat at various points of the level where he asks the player a question when you walk past it. The player then has three paths to choose from, the right path being the right answer to the question. A life is lost if the wrong path is taken. After the level is completed, the player is then sent to a bonus stage and given a time limit in which he or she must complete whatever challenge the Magician has now set for him or her. Once all of these levels are cleared, Rayman can then have access to Mr Dark's hideout. The game contains a new world map, and, separately from the main levels, there is an extra one called Betilla's Garden, which the player may use to practice. This is the first time in which Betilla the Fairy speaks English. It also has a new title theme, and the level music is extended. VERSIONS: Rayman Junior is known as Rayman Brain Games in the USA. The UK version has three difficulty levels split across three separate games. Rayman Brain Games has all the difficulty levels in one game. The difficulty levels indicate the volume number, for instance Volume 1 is level 1 and so on.", "platform": "Sony Playstation", "release_date": "January 12, 2001", "game_type": "Released", "esrb": "", "developers": "Aqua Pacific", "publishers": "Ubi Soft Entertainment Software", "genres": "Education", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127161-rayman-junior-level-3\n"}