{"altername_name": [], "name": "Real Robots Final Attack", "overview": "Super Robot Wars , or Super Robot Taisen, abbreviated as SRW) is a series of tactical role-playing video games produced by Banpresto, a Japanese division of Namco Bandai. Its main feature is having a plot involving multiple mecha titles, allowing characters from different titles to team up or battle each other. The first game in the franchise was released for the Nintendo Game Boy in 1991 and later games are released on various consoles and handhelds. In most games, the player selects or is given a Banpresto original character and machine, who is connected to the overarching storyline which ties together the events of the constituent anime for the game. Some featured anime also has their plot intertwined: in Super Robot Wars Alpha, the White Fang from New Mobile Report Gundam Wing allies with Paptimus Scirocco's rebellion from Mobile Suit Zeta Gundam, resulting in the two enemy forces working together. The first mecha series featured are Mazinger Z, Getter Robo and the earliest incarnations of Mobile Suit Gundam. It was tradition for a Super Robot Wars game to include a Mazinger, a Getter and a Universal Century Gundam series, forming what fans call the \"Holy Trinity\"; however, newer handheld titles began omitting one or more of these series in favor of increased focus on newer properties. Since the second game, the series has also included a number of original characters and mecha designed specifically for each game. These serve as viewpoint characters for the player, who follows the events of the game through their perspective. Most games also will end with an original threat that may ally itself with other villains from the series' involved, and usually serves as the final villain(s) in the game. These heroes and villains are collectively knows as Banpresto Originals. Theme of the R-series mechas from Real Robots Final Attack, Banpresto's Virtual-On (The fighting game that allows the player to controls fully armored battle droids and duke it out against other droids in duel-like battles over a set of different arenas). clone featuring licensed Real Robots and their own originals. The gameplay is like in Virtual On since the player have to defeat different enemy robots in different fighting arenas to advance in the game. The game features also 7 different characters and a 2 players vs mode.", "platform": "Sony Playstation", "release_date": "August 1, 1998", "game_type": "Released", "esrb": "", "developers": "Banpresto", "publishers": "Banpresto", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112146-real-robots-final-attack\n"}