{"altername_name": [], "name": "Refrain Love: Anata Ni Aitai", "overview": "In Refrain Love - Anata Ni Aitai the player plays a college student who happens to live right by the campus. It's summer and I think you're going to America for Christmas, but you'd love to get a woman before then. Enter you're three buddies Kousuke the jock, Tetsuya the DJ, and Taizo the... nerd. All of you vow to find a girlfriend before Christmas time and what do you know, there are quite a few suitable ladies in town. You yourself have been having weird dreams of some mystery girl and when a walk in the park leads you to find a girl that looks suspiciously like the one of your dreams, you find that maybe you do have chance with the ladies. But, let's face it. You have to juggle part time jobs, romance, and seeing your dude friends. Welcome to Refrain Love. While there are many females in the game, only three of them are really suitable love interests as I think only the three main girls have actual endings (which is a shame, since I liked the other girls more, like the chick who works at the office building, or the cafe keeper's daughter). And if you don't make a move on the girls then you're buddies will and you'll end up all alone. Ouch! The game is broken up into Adventure mode and Simulation mode. Adventure mode is typical date-sim fare: go places, look for girls, talk to girls, choose the right thing to say, and then hopefully get some sort of CG picture. The simulation mode is where you have to go to work to raise your stats. If you have low stats, then you are prone to passing out and you have to go to the hospital. You decide where to go by clicking on houses on the map and the map is fairly large. Lots of places in town from the clubhouse where you DJ friends spins records, to the school campus, the video store, and the park. As well as all the apartment buildings where all your friends live. In your room, you can choose to stay at home and raise your stats by watching TV, listen to music (which raises your \"sense\" stats), save the game, call people, or decide which part-time job to take on. Calling people is essential as that's how you set up dates. However, I could never figure out where to meet up with the girl or when. I've tried going to their apartments, but I guess that's not the way. As for the jobs, I liked this part a bit. It's cute. The jobs change with the seasons. I was a lifeguard at the pool (got to meet many bikini girls), a baby sitter first for some little boy, then for a slightly older girl (oh my), the clerk at the video store, a construction worker, a host, an office building security guard and more. Working on the job allows you to meet all the various women associated with each work place. Plus they all do different things to your stats. Some raise your pride (like the security guard), while others lower your pride and raise your humor (host). All of them eat up at your stamina, so you have to go home and sleep sometimes in the morning to make sure you don't pass out. The game features japanese voices for all the characters and once you beat the game you fully open omake mode, where you can listen to the music of the game, view CGs and character designs, and hear the voice actors talk about the characters. The game features also different endings depending of the decissions that the player make during the game.", "platform": "Sony Playstation", "release_date": "March 14, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Riverhill Soft", "publishers": "Riverhill Soft", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112147-refrain-love-anata-ni-aitai\n"}