{"altername_name": [], "name": "Remote Control Dandy", "overview": "Japan exclusive that was followed up on the PS2 with player friendly front end to ease you into controlling a friendly robot. It soon becomes second nature to control the robot and gameplay is full of the delight a mechanised friend would bring. Innovative and enjoyable - a refreshing title. The plot of the game is about these mysterious robots suddenly appear in the city wreaking havoc and you, a kid from some rich family in Europe, controls a robot of your own call Vordan by a remote control (hence the name of the game) must stop these enemy robot. GAMEPLAY: During the missions you are not suppose to destroy the buildings. You could, but it comes out of your paycheck. So you're trying to navigate through the city's narrow streets with the funky controls. If your enemy dies and land right on one of the buildings, well that's going to cost ya. The game was based around the player controlling a large mecha limb by limb from a fixed viewpoint on the ground. As a consequence, the player toggled between their human player and the mecha (allowing the former to get a better viewpoint on the resultant robotic carnage). It’s worth explaining here what controlling a mecha limb by limb actually entails. The shoulder buttons represent the left and right leg respectively. In that pressing L1 and R1 sequentially makes the mecha walk by moving it’s left leg forward followed by its right leg. Conversely L2 and R2 make your mecha walk backwards. In the case of Dandy, arms are controlled via the face buttons Circle and Square respectively. Taking out a target requires the player to basically punch the crap out of it. Due to the limitations of the original PlayStation pad, the game only let you control one thing at a timeIn that, you had to toggle control between the mecha and the human viewpoint. This meant the human protagonist’s job was to get the best vantage point on the situation so that the mecha could tackle their target with greater clarity and ease. The game features also a dating part in the game in the style of tokimeki's games. There is also a versus mode to fight using different robots and fight in a variety of landscapes like cities, harbors, etc", "platform": "Sony Playstation", "release_date": "July 22, 1999", "game_type": "Released", "esrb": "", "developers": "Human Club", "publishers": "Human Entertainment", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31168-remote-control-dandy\n"}