{"altername_name": ["Starlight Scramble: Renai Kouhosei", "Starlight Scramble - Ren'ai Kouhosei"], "name": "Renai Kouhosei: Starlight Scramble", "overview": "Renai Kouhosei Starlight Scramble is a Playstation game developed by KSS based on the 2 episodes OVA also released in 1998. The game features japanese voice acting for all the characters and is a mix between a dating simulation with some mini games to unlock. In the game the player controls Yuya a young boy that can go around the space station meeting different girls and other people and can also go play some different mini games at the arcades. STORY: Four years had passed since the NUN (Neo United Nations) unified the Earth's nation in 2120, and them the project of the pseudo-earth environment \"One's Home\" was started and led by Kirishima. Five years later, the first satellite town in the history of mankind, \"Second One's Home\" was completed. By this means, the human beings left a \"cage\" called the earth, and began to immigrate to the Second One's Home where they created a second home. The mother computer \"Maxis\", which controls the whole Second One's Home was completed in advance. Howerever, some control problems had been left which was solved two years later. Since then peaceful days have continued. The incident happen as if the peaceful days were laughed at mockingly. The first incident was \"anxiety\". It was that \"Kirishima\", who as the leader of the \"One's Home Project\" dissappeared. The Second One's Home tried to hush up the incident, while the NUN side tried to intervene in it. However, the action ended in failure by some powerful people, and the incident of Kirishima's disappearence was concealed. The second incident was \"resistance\". The affair of terrorism occurred at Universe Port \"SUS\". Since there is no statement for the offense, it was treated as in discriminate terrorism. However, the criminal's true character has not yet been captured... The third incident was \"fear\". three planes for the second platoon of the NUN space force which belonged to the Second One's Home, encountered uncertificated Flying objects, and were shot down. This unknown object was called \"Hughey\". As a clue of this, the NUN Space Force intends to further build up it's forces. This incident might be a warning from space to human beings who left the \"cage\" called Earth. Time passed, and in February, 2149, the past incident does not mean what it used to. The story starts at this Second One's Home, and it is an ordinary love story as if it can be seen from the Earth.", "platform": "Sony Playstation", "release_date": "September 23, 1998", "game_type": "Released", "esrb": "", "developers": "KSS", "publishers": "KSS", "genres": "", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136000-renai-kouhosei-starlight-scramble\n"}