{"altername_name": [], "name": "Renegade Racers", "overview": "Poor Buck Billionaire -- only 30 years old and bored with life. Mount Everest, the English Channel, top speed records on air, water, land and space behind him, what could the future hold in the way of challenge and excitement? Perhaps taking a 700-foot plunge from the top of a Brooklyn Bridge cable support tower would be a worthy adventure. Stepping into space for his 12-second fall to the water below, Buck was surprised to see a yacht suddenly appear beneath him. Hitting a stack of life preservers feet first, Buck was propelled back up and landed in a comfortable deck chair. The sloop's name, Renegade, triggered an idea--yeah, that's it! Buck would sponsor a series of races, inviting racers from around the globe to apply, then selecting the 12 best (including himself) to participate in the ultimate test of speed. Renegade Racers, a watercraft racing game, has three game modes including arcade, quick race and high score. The modes are further broken down into eight race modes of varying types. In Battle Race, you blast opponents during the race while Check Point Challenge requires reaching checkpoints within pre-set parameters. Other self-explanatory races include Smash & Grab, Treasure Hunt, Head-to-Head and Dodgems. Rounding out the modes are the precision events Air Time and Drop Zone. The game features three difficulty choices, each with a different number of levels. At the easy setting there are 32 levels while the medium and hard settings have 40 and 48 levels respectively. In arcade mode, you must face increasingly difficult challenges as you complete the levels by meeting pre-determined times, tasks and finish-position parameters. As you complete various levels, a head-to-head challenge mode allows you to race against level bosses, unlocking the race for use in other play modes. Quick race mode is one or two player and lets you race on a maximum of six tracks that have been unlocked during head-to-head challenge races in the arcade mode. Only one track is available at the start of the quick race mode. The final gameplay mode is high score racing, a one-player only venue. Any races completed in arcade mode are available, contingent upon the level of difficulty at which the race was won, for setting new high scores. During gameplay, various weapons and pickups such as shields, mines, missiles, turbos and medi-paks become available. Each of the 12 contenders have unique strengths and weaknesses, a nationality and ratings in weight, maneuverability and acceleration. The manual contains full backgrounds on all dozen competitors. The global participants include English, American, Italian-American, Russian, Jamaican, Egyptian, Transylvanian/Moldavian and a \"child of the world\" based racers.", "platform": "Sony Playstation", "release_date": "December 14, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Promethean Designs", "publishers": "Interplay", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11363-renegade-racers\n"}