{"altername_name": ["Resident Evil: Uncut"], "name": "Resident Evil: Ultimate Director's Cut", "overview": "Resident Evil: Ultimate Director's Cut is a fan-made mod of the original Resident Evil for the Sony PlayStation. The original Resident Evil came out in the west in 1996 with censored black and white intro and cut-scenes. The Director’s Cut version, released a year and a half later, was supposed to fix that. However, Capcom developers forgot to include the uncensored FMV (Full motion Video), an omission that was the result of a localization mistake, the studio said. In 1998, a third version was released called \"Resident Evil: Director’s Cut – DualShock Ver.\", featuring DualShock controller support. Disappointingly, this one was still censored and replaced the game's soundtrack with a new one fans would later deem to be inferior. So to celebrate the 15th anniversary of the Capcom classic's release, modder Wes67 uploaded to the internet the longtime update that restores the uncut videos and original score. Also included is an all-new \"Arranged mode\" called \"Deranged\", which adds a new degree of difficulty to the game – a condensed playthrough that changes map layout and item management to give a new twist on an old classic. FEATURES: • It inserts the original soundtrack back from “Resident Evil” in “Resident Evil: Director’s Cut”, meaning you get the DualShock features without the DualShock soundtrack. • The original, uncut, full-color FMVs have been inserted. They’re higher quality than the original black and white ones, too. • A new Deranged Mode replaces Arrange Mode, which condenses the Spencer Mansion while making it a much more difficult experience. • A second disc is included that replicates the Sega Saturn exclusive Battle Mode, as well as including a new Maze Mode that turns the mansion into a nonviolent labyrinth. Choose the wrong door and it’s back to the start for you. • There is one small bug that was never fixed: on Jill’s route, if you get poisoned by the Yawn, a cutscene triggers of her waking up in the infirmary save room. Should this happen, a small room with candles you have to use the Lighter on will instead warp you inside the Garden’s shed without needing to collect any Crests. As the candle room doesn’t have any plot significant items, it can be safely ignored if the Yawn poisons Jill.", "platform": "Sony Playstation", "release_date": "September 15, 2013", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Wes67", "publishers": "Wes67", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149023-resident-evil-ultimate-directors-cut\n"}