{"altername_name": ["Biohazard Gun Survivor", "Baiohazado Gansabaiba", "バイオハザード ガンサバイバー"], "name": "Resident Evil Survivor", "overview": "The player takes control of an amnesiac protagonist, struggling desperately against overwhelming odds to stay alive and uncover his identity. Survivor's gameplay is a combination of first-person shooter and arcade-style light gun game. The player views the environment from the perspective of the character (first person view) and moves the character through the environment with the controller. At the same time, if the player wishes to attack an enemy or destroy an object, they press a button which allows them to control a crosshair on the screen. This crosshair can be moved to any location within the main character's line of sight. Using the G-Con 45, players move around by shooting off screen to move and the side buttons to turn, and point at the screen to shoot enemies. The game borrows its enemies from Resident Evil 2, featuring the zombie models from that game, as well as creatures such as Lickers, the Ivy plants, Moth Giants and Tyrants. In addition, Survivor also reintroduces the original Hunters from the first Resident Evil and features two new enemies in the form of the Umbrella Trashsweeper unit – soldiers armed with machine guns – and the Hypnos T-Type, a new Tyrant model that evolves into different forms. The player's arsenal consists almost entirely of pistols, such as the Glock 17 and the CZ75. As the protagonist progresses through the game, the player receives larger weapons to aid in defending against ever more dangerous opposition while they make their way through Umbrella's ruined city and shadowy research labs. The game features branching paths that allow the player to determine how the story will unfold and whom they will meet along the way.", "platform": "Sony Playstation", "release_date": "January 27, 2000", "game_type": "Released", "esrb": "M - Mature", "developers": "Capcom", "publishers": "Capcom", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.16", "wikipedia": "https://en.wikipedia.org/wiki/Resident_Evil_Survivor", "video_link": "https://www.youtube.com/watch?v=YPERSYte9b0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10253-resident-evil-survivor\n"}