{"altername_name": ["Biohazard 2: Dual Shock Ver."], "name": "Resident Evil 2: Dual Shock Ver.", "overview": "After its initial release for the PlayStation in January 1998, Resident Evil 2 was reissued and ported to other systems, often gaining new features in the process. The first re-release was the Dual Shock Ver., which incorporated support for the vibration and analog control functions of the PlayStation's DualShock controller. Other additions include a new unlockable minigame called \"Extreme Battle\", and a \"Rookie\" mode that enables the player to start the main story with a powerful weapon that features infinite ammunition. The Japanese release of the Dual Shock Ver. contained a \"U.S.A. Version\" mode based on the difficulty level of Resident Evil 2's Western versions. The Dual Shock Ver. served as the basis for the majority of ports, such as the Windows 9x-based PC-CD version Resident Evil 2 Platinum. Aside from retaining all previously added features, the PC version can be run in higher resolutions. A \"Data Gallery\" was added to the main menu, allowing the player to view movies, rough sketches, illustrations and 3D models. In February 2006, a Japan-exclusive, Windows XP-compatible PC-DVD re-release was published. Developed by Sourcenext, it included high-quality FMVs encoded at a resolution of 640×480 pixels. The Dreamcast version keeps the additions from the original PC release, and incorporates real-time display of the character's condition on the Visual Memory Unit peripheral. The Japanese edition of the Dreamcast port was given the subtitle Value Plus and came with a playable demo of Resident Evil – Code: Veronica. An unmodified port of the Dual Shock Ver. was released for the GameCube. The initial PlayStation version was re-released on the Japanese PlayStation Network in 2007, while the service's North American counterpart received the Dual Shock Ver. two years later.", "platform": "Sony Playstation", "release_date": "August 6, 1998", "game_type": "Released", "esrb": "M - Mature", "developers": "Capcom", "publishers": "Capcom", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.62", "wikipedia": "https://en.wikipedia.org/wiki/Resident_Evil_2#Releases_and_ports", "video_link": "https://www.youtube.com/watch?v=rbIv42eGyuk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99910-resident-evil-2-dual-shock-ver\n"}