{"altername_name": ["Biohazard: Director's Cut"], "name": "Resident Evil: Director's Cut", "overview": "Resident Evil: Director's Cut is a reissue of the original Resident Evil. Unlike Resident Evil for the GameCube, it is not a remake of the original game, instead, it is more of a slight remix. There are three gameplay modes available. \"Original\" contains the original game with no changes or additions. \"Beginner\" features double the amount of ammunition and save ribbons, plus increased health for the player, increased damage for their weapons, and an auto-target feature. \"Arrange\" mode is the \"Director's Cut\" version of the original. The default outfits for Jill, Chris, and Rebecca are changed, new camera angles are introduced, and the placement of key items is changed. Most of these changes are designed to play against the expectations of veteran players of the first Resident Evil - so zombie dogs may smash through new windows, or keys will not be where they were, forcing players to hunt for them anew. The default Beretta pistol is also changed to a chromed version with a randomized chance to kill standard zombies in one shot. The original release of the Director's Cut advertised an uncut version of the opening cinema, in full color, and never-before seen. Notable aspects of this video include shots of a corpse with bites taken out of the face, close-ups of zombie dogs bleeding when shot, and graphic quick-cuts of Joseph being bitten by these dogs. Chris is also shown smoking in his introduction, which was cut from Western releases. However, only the French and German releases contained this footage. U.S. and UK versions retained the censored black-and-white video shipped with the original release. This has never been corrected, either in the Greatest Hits reissue, or with the PSOne Classics downloads on the Playstation Network. The original issue of the Director's Cut contained a demo of Resident Evil 2 on a second disc. The \"Greatest Hits\" re-release added Dual Shock support for the controller (left \"movement\" stick only).", "platform": "Sony Playstation", "release_date": "September 25, 1997", "game_type": "Released", "esrb": "M - Mature", "developers": "Capcom", "publishers": "Capcom", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.43", "wikipedia": "https://en.wikipedia.org/wiki/Resident_Evil_(1996_video_game)#Director.27s_Cut", "video_link": "https://www.youtube.com/watch?v=odj2GHkErnU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10364-resident-evil-directors-cut\n"}