{"altername_name": [], "name": "Return to Zork", "overview": "Return to Zork is a 1993 adventure game in the Zork series. It was developed for PC by Activision and was the final Zork game to be published under the Infocom label. And got versions in systems like Mac, 3DO, Saturn and PC-FX. Unlike the previous games in the Zork franchise, which were text adventures, Return to Zork takes place from a first-person perspective and makes use of video-captured actors as well as detailed graphics; a point-and-click interface replaced the text parser for the first time in a Zork game. The overall gameplay style was somewhat similar to Myst, although Return to Zork predated Myst by a few months. Unlike Myst, which had no extraspatial dimensions of functionality, Return to Zork featured multiple ways of interacting with each object in the game world, as well as with several non-player characters also present in the world via a menu which appeared on the left side of the screen. Among the actors who appeared in the game were a number of instantly recognizable (by face, if not necessarily by name) character actors as well as a number of well-known younger actors: Robyn Lively of Twin Peaks as \"The Fairy\", Jason Hervey of The Wonder Years as \"The Troll King\", and Sam J. Jones from the 1980 film Flash Gordon as \"The Blind Bowman\" and A.J. Langer of My So-Called Life as fellow Zork explorer Rebecca Snoot whom the player encounters on several occasions. According to the myth, the Great Underground Empire of Zork was destroyed and all evil magic was dispersed. But now, the IT&L Corporation claimes to have discovered the mythical dark recesses beneath the Valley of the Sparrows. Since their discovery, nightmares have become common. People have vanished. Buildings have disappeared. And you, the unwitting traveler, must save the underground empire from the forces of evil. GAME PLOT: The player's character is a sweepstakes winner who wins an all expenses paid holiday to the Valley of the Sparrows, in Zork. Upon arrival, however, the player quickly learns that the entire area has fallen under some dark and sinister influence, becoming decayed and dysfunctional. Whole buildings have mysteriously vanished, murderous vultures infest the land, people have frequent and disturbing nightmares featuring some dark being which refers to itself as Morphius, and many of those who have survived have become reclusive and paranoid. The player must survive countless perils whilst exploring the valley, investigating the causes of the powers that have gripped the land and ultimately putting a stop to them. The Playstation version got japanese texts and japanese voice acting.", "platform": "Sony Playstation", "release_date": "September 27, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Activision", "publishers": "Bandai Visual", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112160-return-to-zork\n"}