{"altername_name": ["Megami Ibunroku Persona", "Persona"], "name": "Revelations: Persona", "overview": "The first entry in Atlus' modern role-playing franchise, Revelations Series: Persona finds players in control of a group of high schoolers who use multiple personalities to combat demons and prevent their town from slipping into another dimension. While playing a children's folklore game, the teenage characters are struck unconscious and greeted by a man named Philemon, who imbues within them the ability to summon different personalities known as personas. These phantasm-like personae serve the role typically assigned to mages or wizards, unleashing a variety of different magic attacks on enemies, while the main characters can use traditional melee weapons for close-quarters combat or modern guns for ranged attacks. Gamers need to manage and improve all of these skills, as the SEBEC Corporation's newest invention seems to be inviting a constant stream of demons from another dimension. Battles present players with an isometric viewpoint of the action, while the dungeon-crawling aspect of the game switches to the first-person perspective. Combat helps characters level up, but physical violence is not always the best course of action. Each character can use four different conversational techniques to coax items from the demons, and new personas can only be acquired by convincing demons to relinquish their spell cards. Features * Use swords, shotguns, and other weapons to defeat over 300 monsters * Choose from four Persona transformations per character * Features an estimated 100+ hours of role-playing content", "platform": "Sony Playstation", "release_date": "September 20, 1996", "game_type": "Released", "esrb": "E - Everyone", "developers": "Atlus", "publishers": "Atlus", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.49", "wikipedia": "https://en.wikipedia.org/wiki/Revelations:_Persona", "video_link": "https://www.youtube.com/watch?v=VK7K7rf37HM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110262-revelations-persona\n"}