{"altername_name": ["Marl Oukoku no Ningyouhime: The Adventure of Puppet Princess"], "name": "Rhapsody: A Musical Adventure", "overview": "Rhapsody: A Musical Adventure represents a strange stepping off point in the heady realm of the role-playing genre. First, it crosses strategy RPG elements with a mixture of random-encounter action found in games like Final Fantasy VIII. That doesn't even get into the musical aspect of the game, nor the storyline that runs counter to the typical \"guy saves girl\" plot. You take the role of Cornet in the game. She's a young woman who lost her parents at a young age and possesses a strange ability to talk to and control puppets. With that rather unique mix, Cornet is a rather independent and strong-willed person despite her youth. Her quest intitially involves meeting the prince she first encountered in the forest, but it quickly develops into a much broader quest once her beloved prince is kidnapped under strange circumstances. Battling through the game will take Cornet to all corners of the kingdom. She'll make friends, face enemies and encounter betrayals throughout the course of her adventure. With multiple dungeons and many boss creatures, she'll have to build up a force of puppet friends to tackle this quest properly. She'll encounter potential puppet allies almost everywhere; graveyards, ancient ruins and even unwanted junk can make for some potentially valuable allies. Monsters you fight can join up with you as well, and they can either level up like your puppet allies or be sold to local monster collectors for some quick cash.", "platform": "Sony Playstation", "release_date": "June 30, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nippon Ichi Software", "publishers": "Atlus", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.62", "wikipedia": "https://en.wikipedia.org/wiki/Rhapsody:_A_Musical_Adventure", "video_link": "https://www.youtube.com/watch?v=mtaAMfPE0NE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/581-rhapsody-a-musical-adventure\n"}