{"altername_name": [], "name": "Riichi Mahjong: Ohitorisama demo Utemasu!", "overview": "Japanese. Mahjong is a game for four players that originated in China. It was called, meaning sparrow in ancient China, which is still the name most commonly used in some southern Chinese dialects such as Cantonese and Minnan, as well as in Japanese. However, most Mandarin-speaking Chinese now call the game má jiàng. Mahjong involves skill, strategy, and calculation, as well as a certain degree of luck (depending on the variation played, luck can be anything from a minor to a dominant factor in winning). In Asia, mahjong is also popularly played as a gambling game. In the game, each player is dealt either thirteen or sixteen tiles in a hand, depending on the variation being played. On their turn, players draw a tile and discard one, with the goal of making four or five melds (also depending on the variation) and one pair, or \"head\". Winning comes \"on the draw\" by drawing a new or discarded tile that completes the hand. Thus, a winning hand actually contains fourteen (or seventeen) tiles. Riichi Mahjong - Ohitorisama demo Utemasu! is the sequel to All-Star Mahjong - Kareinaru Shobushi Kara no Chosen is again is a mahjong game in which the player have 100000 yens to play mahjong matches againts 3 different opponents around town to increase his money. Manufacturer's description: It is the sequel of the large long-selling \"All-Star Mahjong\". Thorough the speed up of the place, more comfortable playable. Star of the following is a confrontation with the 100 people gambler.", "platform": "Sony Playstation", "release_date": "December 14, 2000", "game_type": "Released", "esrb": "", "developers": "Pony Canyon", "publishers": "Pony Canyon", "genres": "Board Game", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135855-riichi-mahjong-ohitorisama-demo-utemasu\n"}