{"altername_name": [], "name": "Rikujou Boueitai Maochan", "overview": "Rikujou Boueitai Maochan is a game based on a 26-episode comedy anime, created by Ken Akamatsu, the author of Love Hina. It stars three eight-year-old girls, Mao, Misora and Sylvia, as they try to defend the earth against invading aliens. The world's defense has fallen to unlikely straits because the aliens are excessively cute, of which combat engagements are televised: if the forces battling the aliens were not cute themselves, the general public would revolt, as it would be seen as \"bullying\". Consequently, three military leaders chose their granddaughters to be the defenders, fittingly, becoming a team even cuter than the aliens. They each have a clover-shaped badge that enables them to transform. (This transformation provides no apparent special ability.) The series itself is rife with parodies and references, particularly to Akamatsu's earlier work Love Hina. The girls' commanding officer bears a resemblance to Naru Narusegawa from Love Hina. See also below in the characters, and anime episode 20, manga chapters 17 and 25. The game is a mix of an adventure and a simulation game with japanese voice acting and some mini games to advance in the game or improve the character stats. Manufacturer's description: Popular anime and comic books] [Ground Defense Force Mao-chan of the game. Consists of two modes: Battle Mode Mode and training. By upbringing, personality changes or ax, 90 different methods of attack and extend to other characters by talking with them, but I also would change the ending. Mao raised pug-ugly main character, \"cute alien\"Save the Earth.", "platform": "Sony Playstation", "release_date": "January 23, 2003", "game_type": "Released", "esrb": "", "developers": "Marvellous Entertainment", "publishers": "Marvelous Entertainment", "genres": "", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135856-rikujou-boueitai-maochan\n"}