{"altername_name": [], "name": "Riven: The Sequel to Myst", "overview": "Riven is a sequel to Myst, and is very similar to its predecessor in gameplay style, controls, and visual presentation. The game world is presented as a series of computer-generated still screens; the player explores it in a point-and-click fashion. Interaction with the environment is possible only when said environment is highlighted as a \"hot spot\", and is also performed by simple clicking. Like its predecessor, Riven is heavy on puzzles, which rarely include using inventory items, but usually involve understanding and manipulating the complex environments and machinery of the game world. At the end of the first game, Atrus, the central character, asked for help to track down his wife, Catherine, who was trapped on another world. As Riven begins, you're transported to that world, a string of five islands called Riven. Atrus warns you that a higher power is involved in Catherine's disappearance before leaving you to explore your surroundings and unravel the many mysteries. Enter a deceptively beautiful world torn apart by timeless, unresolved conflicts where secrets lie hidden at every turn. . . and nothing is as it seems. You must search. You must explore. You must summon every spark of intellect and intuition to unearth clues which both land and inhabitants hold sacred. You must let Riven become your world. Only then may the truth be discovered and a world saved. Riven stands as a story for all time, a story that evokes a sense of awe, wonder and profound purpose. Prepare to go to Riven, a world unlike any you've ever known before. STORY: You are a friend of Atrus, who wrote many linking books that bring readers to different worlds. He has a request to make; you need to enter a dying world, Riven , to find his wife, Catherine. In Riven, Catherine leads the Moiety in an opposition against Gehn, who also has his followers, but now, Catherine is imprisoned on asolitary island. Gehn, is in fact, Atrus' father, whom Atrus has been able to seal inside Riven because there is no linking book back to the outside world. You will find that Gehn has gone mad. For this reason alone, Atrus gives you a special weapon; the Prisoner's Book, in which to trap Gehn. It looks like a linking book back to D'ni, but in fact traps the one who touches its page. As you explore the island, you see various creatures, civilizations, puzzles and machines, most of which are built by Gehn and his followers to allow enough power to make linking books on Riven work. Then, you must realize that the only way out of Riven and to assure safety to D'ni and everywhere else is to trap Gehn within the Prisoner's Book to prevent him from writing his way out of Riven. But as you land on the island, your Prisoner's Book is stolen from you... ISLANDS There are five islands for you to explore around in. You can reach each of them by special trams, carts or walkways that will carry you over the water. In yourpackage of Riven, you should have five disks, in which each of them represent one island, so when you go to another one, you will be prompted to switch disks.", "platform": "Sony Playstation", "release_date": "November 30, 1997", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Cyan Productions", "publishers": "Acclaim Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.05", "wikipedia": "https://en.wikipedia.org/wiki/Riven", "video_link": "http://www.youtube.com/watch?v=5fiYaGa-YUA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11371-riven-the-sequel-to-myst\n"}