{"altername_name": [], "name": "Roadsters", "overview": "Titus returns to the racing games that they started in Commodore Amiga with the Crazy Cars game series (the first one was released in 1987 and the third and last one in 1992) with Roadsters that features the same great gameplay with enhanced 3d graphics. Ever feel like betting on yourself in a high-speed race? Well Roadsters gives you that opportunity. In a racing game featuring ten tracks with thirty different cars, Titus has made a game where being the best driver does not necessarily ensure success. You also need the cash flow! When the game begins you have $50,000. You select a car from an assortment of vehicles in various price ranges and a driver from a pool of contestants. Once you have your car, you are allowed to upgrade it (assuming you have enough cash left). Eventually, you will get to the racing. The Roadster Trophy, your goal, has three divisions. You begin in Division 3 and work your way up by earning money from bets and finishes. Prior to each race you are allowed to bet on the outcome. If you win, you double your money. Also, prize money is paid out to the top few finishers. Once you acquire a certain amount of money, you are able to move on to the next level. Unfortunately you can't just keep stockpiling your cash. You will need to pay to upgrade your car in order to stay competitive. You can improve your tires, your gearbox, your turbo and so forth. Other modes include multi-player, quick race, and time trial. Features: * Choose one of eight available drivers before embarking on a multiple-season career * Features four play modes: Roadster Trophy, Multiplayer, Quick Race, and Time Trial * Upgrade current vehicles or purchase new cars with money earned from top finishes", "platform": "Sony Playstation", "release_date": "March 21, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Smart Dog", "publishers": "Titus France", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "4.2", "wikipedia": "https://en.wikipedia.org/wiki/Roadsters_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13188-roadsters\n"}