{"altername_name": [], "name": "Robbit mon Dieu", "overview": "Robbit Mon Dieu is the third game in the Jumping Flash series. The third game in the series, however, was passed from the hands of Excite Games to a small subdivision of Sony called Sugar & Rockets. Robbit, having saved the universe and thwarted all of its evil opponents, now serves as an all-purpose problem-solver in the Space City Hall. If you have a problem -- no matter how minute or insignificant it may be -- you can call Robbit, and he'll come a-jumpin' in to save the day... or the laundry... or the carrots... or blast open a few geysers for an old guy who wants to start a hot springs resort on a volcanic island. Baron Aloha's reign of terror is over. The world is completely at peace now, and all that's left for a hero to do is to make sure that the people he saved are as comfortable and care-free as possible. How the game works: You get an overworld map. On this map, little icons are placed in areas that have been ''unlocked'' (a process which occurs seemingly at random after certain scenarios have been completed). Above certain areas, a little ''Help!'' bubble will pop up. If you guide your ship over one of these ''Help!'' areas, you'll be able to both read and hear the original ''distress'' message that the Space City Hall received. Afterwards, your boss will comment on it, and you'll watch a short cut-scene as your Robbit descends and meets the sender of the message, receiving more detailed instructions on what he/she wants you to do. You'll then receive a mission checklist that explains, in the simplest terms possible, what exactly you're expected to do... and then, you do it. If the mission you completed advances the game's overall plot, you'll get a newspaper delivered to you with relevant information that ties everything together. Once enough missions have been completed to end one of the game's many ongoing ''sub-plots,'' you'll also see a brief ending scene for it.", "platform": "Sony Playstation", "release_date": "October 14, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Sugar & Rockets", "publishers": "Sony Computer Entertainment", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.64", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28512-robbit-mon-dieu\n"}