{"altername_name": ["Rollcage - Stage II"], "name": "Rollcage: Stage II", "overview": "Rollcage Stage II is an arcade-style racing game for PlayStation and PC, developed by Attention To Detail, and published by Psygnosis. It is the sequel to Rollcage and was released in 2000. On top of the basic racing concept, the cars can be equipped with weapons, that are picked up on the track as bonuses, which can be used against competing cars. The automobiles themselves, once again, have wheels that are larger than the body of the car thus creating a car that has no 'right way up' and can be flipped and continue to drive. Rollcage Stage II implements a streamlined handling system with improved physics, fully destructible courses, gameplay modes, and cars built for extreme racing! There are over twenty vehicles included (some of which are locked) with three unique paintjobs apiece. Following in the footsteps of Rollcage, the indestructible vehicles are designed for 360-degree racing; by flipping upside down and spinning around, they can race on walls, ceilings and other locations normal cars could only dream of going. Broken into five unique environments, Rollcage Stage II features a whopping 65 tracks set over alien landscapes and futuristic cities. Because tracks are fully destructible, players can use the scenery to their advantage. By destroying large boulders and other scenic hazards, you can potentially hamper your opponent's progress by blocking certain portions of the tracks. Tracks are littered with high-powered weaponry including rockets, mines, and unique bombs. Featuring a unique weapon structure, players can double the amount of weapons to 24 by combining certain combinations for explosive results. Players can also utilize a variety of shield upgrades and turbo boosters located on each track. There are 16 gameplay options including the Single Player, Rubble Soccer, Scramble, Pursuit, Stunt, Survivor, Multi-Player Tournament, and Destruction Time Attack modes. The Single Player tournament is broken into a series of five leagues with four tracks apiece; three standard tracks and one knockout track. Winning races and leagues is fairly important as the better you do, the more vehicles and gameplay options you'll unlock. There are also a variety of bonus \"toys\" to discover! Rubble Soccer is one of the many multi-player modes in which two contestants hit a large boulder back and forth. Whoever scores the most goals within the given time limit wins! As a test of skills and coordination, the Stunt mode is a points-based romp in a half-pipe. By performing high-risk maneuvers and various stunts, you'll be awarded a number of points. Featuring two tracks specifically designed for it, the Pursuit mode is a frantic race in which you're being chased by a computer-controlled opponent. Rollcage Stage II also features a completely reworked AI system that fixes many of the complaints found within the original title. The developers have also fixed the controls so that vehicles no longer spin out erratically. Additionally, there are three unique introduction movies that play randomly upon booting up your PlayStation. It also makes use of a memory card for saving various data and a Dual Shock Analog Controller for unprecedented control.", "platform": "Sony Playstation", "release_date": "October 10, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Attention to Detail", "publishers": "Midway", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.79", "wikipedia": "https://en.wikipedia.org/wiki/Rollcage_Stage_II", "video_link": "https://www.youtube.com/watch?v=H6gZ0cK4IAY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11085-rollcage-stage-ii\n"}