{"altername_name": ["Rugrats: Auf der Suche nach Reptar", "Nickelodeon Rugrats: Auf der Suche nach Reptar", "Nickelodeon Rugrats: Search for Reptar", "Nickelodeon Rugrats: La Busqueda de Reptar", "Les Razmoket : A la Recherche de Reptar"], "name": "Rugrats: Search For Reptar", "overview": "Rugrats - Search for Reptar is an adventure video game that was released in 1998 for PlayStation in North America and in the PAL region by THQ. The game is based on the popular Nickelodeon cartoon Rugrats which aired from 1991 until 2004. The game follows the main character of the cartoon, Tommy Pickles, who has lost his Reptar puzzle. It features stages that are typically based on episodes from the television show. It was developed with the intent of appealing to ages seven through twelve. A marketing campaign, which was the second biggest of 1998, was formed in conjunction between Sony Computer Entertainment America and THQ for its North American release, in order to bolster the children's market on the PlayStation. The game has been met with mixed reviews from critics, though it has regularly been noted that children will enjoy it. It was criticized for its camera and gameplay by publications such as IGN and GameSpot; but was given a positive reception for its presentation and was well-received commercially, being the third best-selling game in the first two weeks of its release. It was incorporated into the Greatest Hits brand and sold more than 1.5 million copies. GAMEPLAY & PREMISE: The game follows the main character of the cartoon Rugrats, Tommy Pickles, who has lost a puzzle featuring the cartoon dinosaur Reptar. It is a 3D platform game which requires players to control several of the main characters in order to accomplish the goals. The game has fourteen levels that are accessed by players picking up certain objects. It also has bonus levels with Reptar bars. Players can play the levels in any order, but the more difficult levels have to be unlocked to be playable. The levels that players explore are mostly based on episodes from the cartoon, such as \"Chuckie's Glasses\", and contain various pieces of the Reptar puzzle. The game also has a training and activities mode, as well as multiplayer mode. Tommy is beside himself with grief: he can't find his Reptar puzzle pieces! Now Chuckie, Angelica, Phil and Lil must help him locate the twelve pieces so all can be right again in the Rugrats world. In this 3D adventure, you'll be able to explore the Pickles' house as you search high and low for each piece. Certain objects in each room will grant you access to the game's fourteen levels, which can be played in any order and are classified as either easy, medium or hard. Levels can take place inside the house, outside in the backyard, and even at a miniature golf course, supermarket or toy store! After you select a level, your job is to help the selected Rugrat baby complete the task, whether it's using Spike to find Angelica's doll or gathering eggs within a time limit. Finish a task and you'll be one step closer to finishing the puzzle. During your adventure you'll also get to play bonus levels, including Cookie Race, Touchdown Tommy, No More Cookies and Gold Rush, giving you the chance to earn Reptar bars. Once you collect 15 Reptar bars, you'll get another puzzle piece! Training and Activities modes allow you to practice certain moves or play nine holes of miniature golf with up to four players. Game progress can be continued with a memory card, because as Tommy says: \"a baby's gotta do what a baby's gotta do.\"", "platform": "Sony Playstation", "release_date": "November 1, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "N-Space", "publishers": "THQ", "genres": "Adventure", "max_players": "4", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14141-rugrats-search-for-reptar\n"}