{"altername_name": ["Rurouni Kenshin: Meiji Kenkaku Romantan: Juuyuushi Inbou Hen", "Rurouni Kenshin - Meiji Kenkaku Romantan - Juuyuushi Inbou-hen"], "name": "Rurouni Kenshin: Juuyuushi Inbou Hen", "overview": "Rurouni Kenshin: Meiji Swordsman Romantic Story is a Japanese manga series written and llustrated by Nobuhiro Watsuki with an anime adaptation. The fictional setting takes place during the early Meiji period in Japan. The story is about a fictional assassin named Himura Kenshin, formerly known as the \"Hitokiri Battosai\" (\"Battosai the Manslayer\" in the English dub). Kenshin later grieves for all the lives he has taken, and vows that he will never kill again. This is the second Playstation game based on the Rurouni Kenshin anime world. This time the game is an rpg game. This game takes place after the 10 Katanas and the Shi-Shi-O story. You choose to follow the story of either Hijiri or Hikaru as they try to remember their past. Both stories are pretty similar. If you play as Hijiri, you will meet Saitou Hajime. If you play as Hikaru, you will meet Shinomori Aoshi. The game is pretty linear, but it's got a bunch of mini-games, side-quests, and enough special appearences from the characters in the anime to keep any fan happy. SUBQUESTS: Depending on who you chose to be, you will encouter different adventures and people in the game. If you're Hikaru, you will get a chance to go to the convent and meet some nuns, bar-hopping with Kaoru, errands for Kenshin, and meet Misao. With Hijiri, you can meet Soujirou, monks in the monastry, errands for Kaoru & Megumi, and lastly the scary haunted house. The haunted house was cool since all the characters, both Aoshi and Saitou were in it, but it was very difficult. MINI GAMES: Aside from the main plot & a bunch subquests, you can do some of the mini games available throughout the game: * There's the puzzle game where you get to unscramle an anime picture in an allotted time to give to Tsubame for her collection. * Then there's the dice game where you can go to an illegal gambling hall and risk it like Sano! * The sumo wrestling game. It was in a tournament fashion. You win a mini sumo statue for every match you win and a golden one if you beat everyone. Fun, but made my thumbs hurt. * The boxes games. An old guy pays you money to moves boxes around his room. * The juggling game was pretty hard. You got to mimic this clown and then you get a prize if you go good. Sorry, I'm not good at juggling. The game is split into 3 different parts: The first is the overworld map which is split into 9 pieces. You start with one piece and as you progress through the game, you will receive new pieces which let you explore more of Japan and get to new towns and dungeons. The second is towns/dungeons which is where you talk to people or get into fights. The last part is the battle part.", "platform": "Sony Playstation", "release_date": "November 19, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Pandora Box", "publishers": "Sony Computer Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/26980-rurouni-kenshin-juuyuushi-inbou-hen\n"}