{"altername_name": [], "name": "Ryuuki Denshou: Dragoon", "overview": "In Dragoon, May is the key to unlocking the deadliest weapon, known as the Dragoon. Soon into the film, May is shown in a tube being controlled by two older men. May escapes and finds herself lost in the woods. While sword fighting, a young man named Sedon, hears soldiers and airplanes around where he is practicing his sword techniques. He comes across a search party looking for May, keeping himself hidden behind a row of shrubbery as he follows them. Down the line of hedges, while he isn't looking where he is going Sedon trips. He turns over and realizes what he has stumbled over. He finds May lying naked, unconscious beside him. After finding May in the woods, Sedon takes her to his small cabin, in which his father built. They stay there a while, and soon after May awakens. Soon after that, the search party comes across the cabin, and they knock on the door. Sedon and May escape just in time, but they are leaving tracks in the snow. To hide this, they run down a small nearby stream. The Searchers lose the trail, and Sedon takes May back to his village. After they arrive, Sedon learns of May's Amnesia. She can't remember a thing. Ryuki Densyo Dragoon is a classical rpg game based on a 1997 anime (released also in PC with a sequel for PC only) with 2d cartoon graphics in which the player controls a young man that will start a journey when he rescued a girl. The gameplay is the typical in this kind of games a top view in the travel part and a static view in the battles. Manufacturer's description: In adventure Find hometown girl Miu mysterious boy Cedi met, simulation RPG going caught up to a big fight. The recorded events visual scene of many, I direct the attractive characters' rich personality. You can enjoy the combat in a variety of situations fighter VS fighter, such as human machine VS to VS monster other than human.", "platform": "Sony Playstation", "release_date": "December 18, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "KSS", "publishers": "KSS", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135976-ryuuki-denshou-dragoon\n"}