{"altername_name": ["サガ フロンティア"], "name": "SaGa Frontier", "overview": "SaGa Frontier is a Sony PlayStation role-playing game by Square, released in Japan on July 11, 1997. The game was later published by Sony Computer Entertainment (SCEA) in North America on March 25, 1998. It is the seventh game in the SaGa series and the first to be released on the PlayStation. The game was directed and produced by Akitoshi Kawazu with aid from chief planner Koichi Ishii and musical composer Kenji Ito. When the game was re-issued in Japan in 2000 as part of the Square Millennium Collection, it included a collectible teacup set and a tee-shirt depicting the character Blue. The plot of SaGa Frontier takes place in a science fiction/fantasy universe called the Regions, a group of worlds with varying degrees of culture, unique races, technology, and magic. The game allows the player to follow the exploits of one of seven protagonists, each with his or her own storyline and goal. The game's Free Scenario System offers a large amount of non-linear gameplay, allowing the player to freely travel between many of the Regions, interact with other characters, and take part in turn-based combat. The basic concept of SaGa Frontier is based on its Free Scenario System, in which one can play as any of seven different protagonists, all of whom exist in the same setting: a solar system known as The Regions, a group of planets, each with its own culture, game-level of technology, and form of magic. STORY: The player can choose any one of seven main characters to play as, each with their own storyline. - Asellus, formerly a human girl, was run over by a carriage and given a blood transfusion by the Mystic Lord Orlouge. Chosen as the Charm Lord's heir, she is despised by human and mystic alike due to her status as the only half-Mystic in existence. She escapes Orlouge's castle with the help of the Princess White Rose. Asellus and White Rose remain on the run from Orlouge's many servants, but after White Rose sacrifices herself to save Asellus's life and freedom, Asellus decides to return and defeat Orlouge, to end the struggle once and for all. Depending on the actions the player does, there are three endings, in which she end live on as a human, half Mystic, or complete Mystic. - Blue is a young mage fresh out of magic school. His quest is to collect the \"Gift\" for as many magics as possible. After that he is destined to fight his twin Rouge who has gained the opposite magics. Whichever brother survives obtains the other's magic and receives the sacred \"Life\" magic. It is revealed they were created artificially to produce the only wizard who could master all magical powers, even the conflicting pairs, and the duel is a mere formality to establish the dominant persona. Afterwards, Blue/Rouge descends into Hell to fight the demons who attacked his home. - Emelia is a blonde ex-con and secret agent formerly working as a model. Her story begins when her fiance Ren was murdered by a mysterious villain known as the \"Joker\". Wrongfully accused of the crime, she was sentenced to imprisonment in Despair, where she met Annie and Liza. With their help, they complete a competition the warden created to receive a full pardon for their crimes. After their escape, Emelia was recruited by the two to join the secret organization Gradius, which was also hunting for the \"Joker\". - Lute is a carefree bard whose mother kicked him out of the house until Lute found a decent job. He stumbles face-first into a plot involving Trinity general Mondo and resistance leader Captain Hamilton, and the legacy of Lute's deceased father, who was betrayed and killed by Mondo. - Red is a teenage boy whose family is destroyed by the criminal syndicate called Black X. After being rescued from the same fate by the masked superhero named Alkarl, he is granted the identity of the superhero Alkaiser. After destroying several Black X bases and their main stronghold, Red stands at his father's grave, and Alkarl appears to take Red's powers away, making him a normal man again. It turns out that Alkarl was Red's father's friend, Hawk, and Red will not be able to live a \"normal\" life for long. - Riki (Known as Coon in the Japanese release) is a Lummox, a fox-like creature, and one of the last remaining inhabitants of the mysterious world, Margmel. Determined to save his homeworld, he seeks the Rings of Margmel. In his search, he starts out in Scrap, where he finds the researcher Mei-ling. Riki's quest takes him around the regions to gather the Rings until he comes face to face with Virgil, a Mystic Lord. Following the battle, Riki returns home to attempt to restore Margmel, but faces Mei-Ling, who is under the control of the Rings. - T260G is an ancient Mec, a model constructed from junk parts, awakened in modern times. Originally part of a combat ship with a mission against RB3[clarification needed], it lost its memory when it crashed into Junk. With help of Leonard, a human who transferred his memories into a Mec, and Gen, a master swordsman, it recovers its memory and finishes the job.", "platform": "Sony Playstation", "release_date": "March 6, 1998", "game_type": "Released", "esrb": "T - Teen", "developers": "Squaresoft", "publishers": "SCEA", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.53", "wikipedia": "https://en.wikipedia.org/wiki/SaGa_Frontier", "video_link": "https://www.youtube.com/watch?v=GB_Fb2ab-r8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2486-saga-frontier\n"}