{"altername_name": [], "name": "SaGa Frontier 2", "overview": "SaGa Frontier 2 has two separate storylines: The history of Gustave XIII of Finney (AKA Gustave the Steel), and the Knights family. The game takes place in the land of Sandail, roughly in the years 1200-1300. Gustave XIII is the former prince of Thermes, and successor to the throne of Gustave XII. He is exiled by his father when, at the age of 7, he fails the Firebrand Ceremony due to an inability to ignite a sword through manifestation of his Anima. His mother, Queen Sophie, unsuccessfully tries to prevent Gustave XIII's banishment. She and Gustave XIII are banished from the castle by Gustave XII and are forced to live in the slums of Thermes, and are forbidden to leave for Nohl. Master Cielmer asks Gustave XII for permission to leave the King's Employ and to depart Thermes. His request is granted. Cielmer uses this opportunity to sneak Gustav XIII and the Queen to Gruegel. Gustave will set neither foot nor sights on Thermes, Finney, or Merchmin for another 20 years. Shortly after the death of his mother and his conquering Wide, Gustave hears of the death of his father and heads to the Finney kingdom to take the throne. He gives the throne to his brother Phillipe. Gustave dies at the age of 49 in one of his forts. The secondary playable storyline in the game is that of Wil Knights, and his journey to learn the secrets of the soul-stealing entity known as 'The Egg'. Wil's story spans three generations of his family, and is intertwined within the storyline of Gustave XIII.", "platform": "Sony Playstation", "release_date": "February 15, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "Square", "publishers": "Square", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.52", "wikipedia": "https://en.wikipedia.org/wiki/SaGa_Frontier_2", "video_link": "https://www.youtube.com/watch?v=Cm20ZBy52Xk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/583-saga-frontier-2\n"}