{"altername_name": ["Saiyuuki"], "name": "Saiyuki: Journey West", "overview": "Saiyuki: Journey West is a title that weaves the tale of a fantastic quest featuring tactical medieval combat between people and creatures with a host of bizarre powers. Saiyuki: Journey West is based on one of the most famous Chinese folk tales; the journey of the monk Sanzo to India and back from his native land. Sanzo has the power to call forth powerful guardians to aid him in times of need, and as his quest progresses, so will the strength of his summoning. Along the way he encounters a whole host of characters and situations, and most of the allies he meets will have the peculiar power to mutate into monstrous were-creatures that possess enhanced powers. Saiyuki is a tactical/strategy RPG that centers around an adolescent named Sanzo or Genjo, depending on whether players should choose the character to be male or female. The main character was found in a basket floating down a river in a way not unlike the Holy Bible's Moses, then adopted by some monks in China. The story kicks off when a goddess named Lady Kannon appears to Sanzo/Genjo and tells him/her to deliver a thunder staff to a sacred temple in India. Kannon then provides a staff to to the hero, the monks bid him you farewell and good luck, and then players take off for a journey West. Players will journey as Sanzo or Genjo, taking on an expanding cast of characters to help win the day. The path through the game is very linear, comparable to Final Fantasy Tactics, and focuses on squad combat. All of the player-controlled characters aside from Sanzo have alternate were-forms they can slip in and out of at any given point in the fight. Yet finding the right time to alter one's form is the key to the battle, since transitions can take quite a bit out of the individual and can only occur once during a single combat. Although Saiyuki: Journey West does rely on skill management in relation to the were-forms and Sanzo's guardian magic, the complexities of similar tactical combat games have been put aside. But the key to this game is the fighting. Most time on the battlefield is spent attempting to correctly place troops in order to get a jump on your enemies. Each character is attuned to a certain element, as are the enemies. A good deal of the game's strategy comes in finding which element is more powerful against which, and then exploiting the strengths and weaknesses of the opponents' elemental stature.", "platform": "Sony Playstation", "release_date": "November 11, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Koei", "publishers": "Koei Co., Ltd.", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.21", "wikipedia": "https://en.wikipedia.org/wiki/Saiyuki:_Journey_West", "video_link": "https://www.youtube.com/watch?v=bDzWZf3dcHI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11957-saiyuki-journey-west\n"}