{"altername_name": [], "name": "Salamander Deluxe Pack Plus", "overview": "Salamander Deluxe Pack Plus is a compilation featuring ported versions of the arcade classic Salamander, its westernized port Life Force, and for the first time since its arcade release Salamander 2. In all the games you control a lone starfighter as he battles the armies of Zelos, a terrible alien creature that threatens to eat the entire galaxy. Collect power-ups, defeat bosses and clear stages until you defeat the game without being blasted into space dust. All games feature small tweaks like infinite continues and difficulty settings, but are otherwise faithfully recreated from their arcade counterparts. Salamander 1 was created back in 1986. It features nice multi-colored sprite design and some innovative scrolling techniques. Explosions, laserbeams, scaling and other special effects are obviously just multi-layered, variable sized sprites flashing on and off, but the effects are great and enjoyable to watch. Lifeforce was brought out in 1987 and is basically a supplement to Salamander 1. There is a larger palate of colors to dazzle your eyes and subtle improvements in the overall graphical presentation of the game. Salamander 2 was released in 1996 and clearly shows what a difference a decade can make in videogame technology. The leap in graphical brilliance is astounding...smooth parallax scrolling, transparencies, sprites mixed with polygons. While the game plays basically the same, the amount of on-screen objects has virtually doubled. Background animation's are riveting and the level of detail is great.", "platform": "Sony Playstation", "release_date": "July 3, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.78", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/26130-salamander-deluxe-pack-plus\n"}