{"altername_name": [], "name": "Sammy Sosa High Heat Baseball 2001", "overview": "This is The 3DO Company's second game in their High Heat Baseball series on the PlayStation, and for the 2001 version they've brought out some of the big lumber and signed up Sammy Sosa and his winning smile as their key spokesperson. As expected, all 30 teams from Major League Baseball and their players are presented in all their 3D glory, complete with 45 authentic stadiums which include not only the new parks in San Francisco and Detroit, but also classics such as Shibe Park and Baker Bowl. Little touches such as the fountains in Kansas City and stadium-top championship pennants fluttering in the breeze are scattered throughout. Team .366 (their name is a nod to Ty Cobb's lifetime batting average) promises that they've significantly upgraded their graphics from 1999's version. One new feature which they've been touting is a technique called \"motion blending,\" which smoothes transitions from one animation to the next in real-time so that the players' moves are as fluid as possible. They've also scaled the players' bodies so that a slight speedster like Kenny Lofton will look much different from an imposing hulk like Mark McGwire, complete with their actual faces. San Francisco Giants announcer Ted Robinson is back with an even bigger array of quips and observations than last year, and the Home Run Challenge has been augmented by a Batting Practice Mode which allows the player to take their swings against three different types of pitchers (overhand, sidearm, or submarine) and ask for specific pitch types. After every contest, the gamer gets a chance to look at the box score as well as an at-bat-by-at-bat account of the game. Furthermore, there's the chance to watch a sort of post-game highlights show wherein the computer selects the most significant plays of the game and runs them again (replays are also available after the action has just happened). True-to-life physics are always an important part of any sports simulation, and Team .366 has brought a 3D mound into the game for 2001. Instead of being a meaningless part of the field, it now plays a part in pitch trajectories and the paths of balls that hit it and ricochet away. Improved player fatigue levels and CPU AI are also part of the effort to make the game as close to real life as possible. Gamers can use their Dual Shock controllers for vibration feedback and memory cards to save a season in progress (which can be reduced to 16 or 81 games). The game comes packaged in a double CD jewel case to allow room for a separate strategy guide on the nuances of baseball. Features: Features both MLB and MLBPA licenses for authentic teams and players Includes 45 classic and modern stadiums Listen to play-by-play announcing from broadcaster Ted Robinson", "platform": "Sony Playstation", "release_date": "March 21, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Team .366", "publishers": "3DO", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13175-sammy-sosa-high-heat-baseball-2001\n"}