{"altername_name": [], "name": "Sampras Extreme Tennis", "overview": "Codemasters used their Pete Sampras license for a second time on this tennis game. Playing as either a male or female in singles or doubles matches, your ultimate aim is to win each of the 8 matches, which represent the finals of 8 tournaments The four Grand Slam tournament venues are unlocked when you win tournaments on the other four (in Barcelona, Hong Kong, Frankfurt and Moscow). Single matches or quick multiplayer knockout tournaments can also be played, the latter with up to 8 human players. Lob, slice and drop shots each have their own control buttons, and spin can be comfortably applied. Serving involves stopping a curving arc at the right moment - there are three serve speeds and the arc's motion reflects this, so it is harder to get the faster serves accurate. Ten camera styles are available, encompassing both fixed and moving camera work. There are three game modes to choose from in the main menu: Single Match, Knockout, and Tournament. In the Single Match, one to four players may play against the computer or each other in a game of Singles or Doubles with sets of one, three or five. In Knockout, eight players compete in singles matches and try to remain unbeaten to win the final. If there are less than eight human players the computer will make up for the difference. You choose the number of games to be played from either one, three or five. Tournament can be played with either one or two players in a Singles or Doubles match taking on International players. Each Sampras opponent will be stronger than the last as you work your way through the Sampras Extreme World Tour. The number of sets can be either three or five.", "platform": "Sony Playstation", "release_date": "July 1, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Codemasters", "publishers": "Codemasters", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/19239-sampras-extreme-tennis\n"}