{"altername_name": [], "name": "Sangokushi V with Power-Up Kit", "overview": "Romance of the Three Kingdoms, written by Luo Guanzhong in the 14th century, is a Chinese historical novel based upon events in the turbulent years near the end of the Han Dynasty and the Three Kingdoms era of China, starting in 169 and ending with the reunification of the land in 280. Three Kingdoms is acclaimed as one of the Four Great Classical Novels of Chinese literature; it has a total of 800,000 words and nearly a thousand dramatic characters (mostly historical) in 120 chapters. It is arguably the most widely read historical novel in late imperial and modern China. The Romance of the Three Kingdoms has been adapted into several comic versions in Japan, varying in levels of historical accuracy and loyalty to the original novel and popular tradition. Sangokushi (Japanese for \"Records of the Three Kingdoms\") by Yokoyama Mitsuteru (Ushio Shuppansha) and the adapted anime Yokoyama Mitsuteru Sangokushi. Sangokushi V is the 5th installment in Koei's famous Romance of the Three Kingdoms series. The Playstation remake features new graphics, music & sounds over the original versions. The Power up kit includes following features: 4 new scenarios. Part 5 of \"Sangokushi\" masterpiece of historical simulation game. 2-3 centuries in China, against the backdrop of the Three Kingdoms period Shu-Wei Wu, led to efficiently warlords become one of the monarch, promoting the wealth and military strength, and make foreign policy, the unification of China aim. Have adopted the new system and the number of commands per turn is determined by the value of \"fame\". Features: First & Third person perspectives. 2D graphics Cartoon graphics Medieval China theme.", "platform": "Sony Playstation", "release_date": "July 2, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Strategy", "max_players": "8", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Sangokushi_V", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367869-sangokushi-v-with-power-up-kit\n"}