{"altername_name": [], "name": "Sangokushi Koumeiden", "overview": "Romance of the Three Kingdoms, written by Luo Guanzhong in the 14th century, is a Chinese historical novel based upon events in the turbulent years near the end of the Han Dynasty and the Three Kingdoms era of China, starting in 169 and ending with the reunification of the land in 280. Three Kingdoms is acclaimed as one of the Four Great Classical Novels of Chinese literature; it has a total of 800,000 words and nearly a thousand dramatic characters (mostly historical) in 120 chapters. It is arguably the most widely read historical novel in late imperial and modern China. The Romance of the Three Kingdoms has been adapted into several comic versions in Japan, varying in levels of historical accuracy and loyalty to the original novel and popular tradition. Sangokushi (Japanese for \"Records of the Three Kingdoms\") by Yokoyama Mitsuteru (Ushio Shuppansha) and the adapted anime Yokoyama Mitsuteru Sangokushi. Sangokushi Koumeiden is the second installment in the Sangokushi Eiketsuden tactical role-playing series developed by Koei. STORY: This release loosely describes the events of Zhuge Liang's life as depicted in Luo Guanzhong's historical dramatic novel Romance of the Three Kingdoms. As Zhuge Liang, the player must assist Liu Bei in procuring the territories of Jingzhou and Yizhou and establishing the Shu Han kingdom. In addition, the player must organise Zhuge's Southern Campaign against the Nanman peoples and carry out the Northern Expeditions against the opposing kingdom of Cao Wei. GAMEPLAY: Unlike its predecessor title, the player's skill and success for each battle are a major factor in determining how Sangokushi Koumeiden will end. In addition to having decisions at the beginnings of most stages that affect troop placements for both sides, event triggers, and the items found in armories and granaries, the game also tracks the player's overall record by monitoring the character's physical health and counting the amount of times the player has retreated from battle and restarted a level. Taking too many turns to reach a certain point in the story, or restarting battles too many times, will severely affect Zhuge's health and, if he becomes too weak, he will die before the decisive Battle of Wuzhang Plains takes place. However, if the player's skill is adequate, Zhuge Liang will feign death, luring his nemesis, Sima Yi, into the open. The game will then continue to the last chapter in a series of final battles against the kingdoms of Cao Wei and Sun Wu. Another notable feature in this release is that Zhuge Liang's son, Zhuge Zhan, is a playable character in the final chapter of the game. The player is also able to choose throughout the third and fourth chapters how Zhuge Zhan's character statistics will be allocated whilst he is growing up. The player is then able to determine Zhuge Zhan's unit class before he becomes playable. The PlayStation, Sega Saturn and Game Boy Advance versions offer additional stages and minor storyline alterations. For example, it is possible in said versions to save Pang Tong, which in turn allows the player the opportunity to rescue Guan Yu. Successfully rescuing Guan Yu will prevent the disastrous Battle of Yiling from ever taking place, thus sparing Shu Han from one of the kingdom's greatest defeats and causing Liu Bei to pass away much later than normal (shortly after Zhuge Liang's Southern Campaign, in fact).", "platform": "Sony Playstation", "release_date": "February 14, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112248-sangokushi-koumeiden\n"}