{"altername_name": [], "name": "Schroedinger no Neko: Die Katze von Schroedinger", "overview": "Schrodinger no Neko is a mix between a first person adventure game and a rpg game. the game begins when the player's character (a young girl) is travelling and she is transported into another world, she arrives at a castle and the adventure begins there. The gameplay is about using different objects to open doors or active things, the player character has also to eat or she becomes hungry and her health will decrease. Travel through time and visit medieval Europe and the Mu Empire in this surreal adventure game. Based somewhat on the same-named principle of existence and non-existence and how perception affects reality. Does anyone know where my Schrodinger is? Open the door to the adventure world of real-time full polygon. Move through seven worlds, such as the medieval civilization of the My Empire and Europe in the Middle Ages. Traps in the dungeon and monsters await you one after another. Meet and talk with people on the way, and collect the charms you need to find Schrodinger! Characters in the story: - Schrodinger - Male, age unknown A charming cat with shiny blue-gray fur and beautiful, mysterious eyes. After settling in Iris' house, it became her favorite. Schrodinger tempts Iris to a mysterious journey. - Iris - Female, age 16 Iris, the main character, is a strong-willed cheerful girl of the Celtic race. On the way to visit her grandmother with her family over Christmas vacation, she accidentally wanders into a church running after her beloved car, Schrodinger. There awaited a very mysterious adventure through time. Items: You can discover more than 120 items in various locations in different worlds. You will need to know how to use each item effectively, as they are the key to proceed the game successfully. Basil - You can find them everywhere throughout the game. Eat them when you are hungry, and regain a quarter of your strength. You'll also find that they have an effect of cancelling curses. Chocolate - Drink this to regain strength and recover from all your ailments. Cumin - They can be found everywhere and they neutralize posion. You cannot eat this even if you are hungry. Figs - You can regain all your strength by eating this, but there is a side effect; poison will circulate inside your body. To counter this, you need to either take the cumin to neutralize poison or other items to protect yourself from being poisoned. Pistachio - Like figs, you will regain your strength, but as a side effect it will leave you paralyzed. Rosemary - It neutralizes poison. Eat them when you are hungry to regain half the strength. Sage - Eat them to recover from paralysis. You cannot eat this even if you are hungry. Bracelet - Wear it to protect your body from poison. Compass - Very important item. Be sure to get it when you first wander into the church. Feathered boots - Helps you to avoid traps. Goblets - Wear these to reduce the chances of encountering monsters. Leather sandals - These increase the ability to defend yourself. Nuggets - Collect and exchange them with special items. Nuggets may be Gold, Silver, or Copper. Torch - Let you see better and it is necessary for searching in dark places.", "platform": "Sony Playstation", "release_date": "May 30, 1997", "game_type": "Released", "esrb": "", "developers": "Takara", "publishers": "Takara", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136145-schroedinger-no-neko-die-katze-von-schroedinger\n"}