{"altername_name": ["Rune No Joka Hikari to Yami No Sei-Oujo", "Seikon no Joka: Hikari to Yami no Seioujo"], "name": "Seikon no Joker: Hikari to Yami no Seioujo", "overview": "Rune No Joka Hikari to Yami No Sei-Oujo (aka Seikon no Joker - Hikari to Yami no Seioujo) is a RPG game made by Media Works in 1997 that features the story of a young boy that is an adventurer that explore old ruins in searh of treasures. One day when he tried to escape from an ruin he is ambushed by a group of mercenaries. After defeat them and use their balloon to escape he arrives at his town an encounter other people that will join him through a big adventure. The gameplay is a little special, specially during the battle part: The player got a limited number of movements (10) to move his character and when the number reaches 0 he have to make a decision of what his character is going to do, he can attack an enemy, see his stats or defend. After choosing attack the number of attacks that the player got appear and the player can choose a normal attack or a special attack. Special attacks consume SP so is good to think where to use them. When an attack is made the camera angle changes to a big close up using a 3D engine. The graphics use a 3D engine with a camera angle that can be rotated 360 degrees using the R1 and L1 Button. The characters are made using a 2D cartoon engine. When the player arrives to a town he can go to different shops or taverns and there he can choose who he wants to speak using the different words that appears in the menu of actions that appear in that location.", "platform": "Sony Playstation", "release_date": "April 25, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Media Works", "publishers": "Takara", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112270-seikon-no-joker-hikari-to-yami-no-seioujo\n"}