{"altername_name": [], "name": "Senran", "overview": "The Sengoku period or Warring States period in Japanese history was a time of social upheaval, political intrigue, and nearly constant military conflict that lasted roughly from the middle of the 15th century to the beginning of the 17th century. The name \"Sengoku\" was adopted by Japanese historians in reference to the Warring States period in Chinese history (Sengoku jidai) in Japanese) which preceded the unification of China. Likewise, the Sengoku period in Japan would eventually lead to the unification of political power under the Tokugawa shogunate. Takeda Shingen, of Kai Province, was a preeminent daimyo in feudal Japan with exceptional military prestige in the late stage of the Sengoku period. Oda Nobunaga (June 23, 1534 - June 21, 1582) was the initiator of the unification of Japan under the rule of the shogun in the late 16th century, a rule that ended only with the opening of Japan to the Western world in 1868. He was also a major daimyo during the Sengoku period of Japanese history. His opus was continued, completed and finalized by his successors Toyotomi Hideyoshi and Tokugawa Ieyasu. He was the second son of Oda Nobuhide, a deputy shugo (military governor) with land holdings in Owari Province. Nobunaga lived a life of continuous military conquest, eventually conquering a third of Japanese daimyo before his death in 1582. His successor, Toyotomi Hideyoshi, a loyal Oda supporter, would eventually become the first man to conquer all of Japan and the first ruler of all Japan since the Onin War. Senran is a strategy game based on the Warring States period featuring characters like Takeda Shingen or Oda Nobunaga", "platform": "Sony Playstation", "release_date": "August 23, 1996", "game_type": "Released", "esrb": "", "developers": "Hokusho", "publishers": "Angel", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112276-senran\n"}