{"altername_name": [], "name": "Serial Experiments Lain", "overview": "The Serial Experiments Lain video game was released for PlayStation on November 26, 1998 by Pioneer LDC, and was never classified into a particular genre. It is speech-intensive, and entirely in Japanese (it was never released outside Japan). Throughout the game, with the assistance of Lain, the player unlocks pieces of multimedia information (Lain's therapy sessions, her diary, notes of her therapist, video segments) to discover what happened to her. The game shares the themes and protagonist, but not the plot, with the anime series with the same name. Gameplay: The game was made to be a \"network simulator\" in which the player would navigate to explore Lain's story. The creators themselves did not call it a game, but \"Psycho-Stretch-Ware\", and it has been described as being a kind of graphic novel: the gameplay is limited to unlocking pieces of information, and then reading/viewing/listening to them, with little or no puzzle needed to unlock. Lain distances itself even more from classical games by the random order in which information is collected. The aim of the authors was to let the player get the feeling that there are myriads of informations that he would have to sort through, and that he would have to do with less than what exists to understand. As with the anime, the creative team's main goal was to let the player \"feel\" Lain, and \"to understand her problems, and to love her\" Plot: The series of events differs slightly from that of the animated series. In the video game, Lain talks to a therapist, a character that doesn't appear in the anime, while most characters from the anime (like Alice) are absent from the game. Lain herself is basically the only common element between the two, and even the ending is different: while she erases everyone's memories and becomes an entity of the Wired in the anime, and kills Eiri Masami, in the video game she commits suicide to escape to the Wired, where she is finally joined by her psychiatrist. There has been speculation that the plot of the anime follows on chronologically from the game.", "platform": "Sony Playstation", "release_date": "November 26, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Pioneer", "publishers": "Pioneer", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93850-serial-experiments-lain\n"}