{"altername_name": ["Elmo's Letter Adventure"], "name": "Sesame Street: Elmo's Letter Adventure", "overview": "Sesame Street: Elmo's Letter Adventure is an educational 3D action-adventure that is designed to help children ages three to six with letter recognition and basic spelling skills. This game is brought to you by Children's Television Workshop, the same company responsible for the PBS television series Sesame Street. It was released almost simultaneously with Sesame Street: Elmo's Number Journey, also for the PlayStation. In Sesame Street: Elmo's Letter Adventure you assume the role of the adorable red Muppet Elmo as you journey and explore three different fantasy worlds. These worlds are Big Bird's Farm, Grover in Outer Space and Ernie's Underwater World. You will begin your adventure on Sesame Street, where you will meet Sesame Street characters who invite you to visit their fantasy worlds to search for letters and play games. Before you leave Sesame Street you can interact with the characters around you as well as visit Elmo's Room, where you can practice playing the game. While in Elmo's Room you can also view the game's credits and watch preview videos from Sony Wonder (by pressing the \"down\" directional button). Each of the three fantasy worlds you will travel to consist of two different game environments and a bonus world. Once you have acquired the correct number of letters required to pass through each fantasy world you will be instantly transported to the bonus world where you will be challenged to solve word puzzles. Throughout the game you will receive both verbal guidance from Sesame Street characters as well as the guidance of a special onscreen controller that will prompt you on what buttons on the controller need to be used. Sesame Street: Elmo's Letter Adventure does not require the use of a memory card. The game's three levels of difficulty (Easy, Medium and Hard) can be accessed and changed at any time while playing.", "platform": "Sony Playstation", "release_date": "October 16, 1998", "game_type": "Released", "esrb": "EC - Early Childhood", "developers": "Realtime Associates", "publishers": "NewKidCo", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92678-sesame-street-elmos-letter-adventure\n"}