{"altername_name": ["Chivas 1-2-3 - Destiny! Unmei o Kaeru Mono!", "Chivas 1-2-3: Destiny! Unmei wo Kaeru Mono!"], "name": "Shibasu 1-2-3 Destiny!", "overview": "Shibas 1-2-3 Destiny! Unmei O Kaerusha! is a Playstation game based on the Shibas Anime serie. It's Shibas' job to rid his kingdom of powerful sorcerers and demonic monsters - for a price of course! In short, Shibas is a bounty hunter a very well paid bounty hunter! Although he may be debauched, debased and a real bastard at times, his services don’t come cheap. He’s that good! So good, that when a local nasty needs a powerful sorcerer to serve as a sacrifice, the \"honor\" goes to Shibas. It's just his bad luck that Shibas has no intention of cooperating... Shibas Scotch is a wretched man who hunts for bounties with his group of loyal followers: Kiss, who adores Chivas and can turn into a wolf; Genmi who also adores Chivas but in THAT WAY, much to the chagrin of Chivas; and Gin Fizz, a big-boobied goody two-shoes, who isn't a loyal follower but more of a slave to Chivas' whims. Ruthless sorcerer Shibas Scotch is hired by a count named Cuttlefish to destroy an evil monster attacking a nearby village. But things go awry when Chivas fails to destroy the monster and he's forced to transfer his spirit in the body of his beautiful servant Gin Fizz. The Playstation game is an impresive mix between an adventure game and an action rpg in the battles. During most of the game the player will use a first person perspective to advance in the adventure part and have to choose between different possible answers to advance. In the battle parts the player controls one of the characters and move with the controler making the attacks or magic attacks that he choose to do.", "platform": "Sony Playstation", "release_date": "January 6, 2001", "game_type": "Released", "esrb": "", "developers": "Jaleco Entertainment", "publishers": "Jaleco Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112303-shibasu-1-2-3-destiny\n"}