{"altername_name": [], "name": "Shinsetsu Samurai Spirits: Bushidou Retsuden", "overview": "Samurai Shodown RPG, known as Samurai Spirits, a True Story: Bushido Biographies (Shinsetsu Samurai Spirits - Bushidou Retsuden) in Japan, is a console role-playing game for the SNK's Neo Geo CD system, and was also ported to the Sega Saturn and Sony PlayStation. It was never released outside of Japan. 1 - The First Scenario - Jiatenkourin no Sho (Amakusa's Scenario) This scenario is about the evil Amakusa Shirou Tokisada who is trying to conquer Japan. As you know, you can choose one from six characters as your main character. For this scenario, every main character starts off differently from the others. That means, a different main character holds a different purpose to defeat Amakusa. Therefore, the story lines may vary depending on who you choose. Haohmaru: Haohmaru starts off in Nicotine's training room(Nicotine is the master of Haohmaru and Genjuro). Amakusa comes to 'visit' Haohmaru and ask him to join the evil dark forces. Haohmaru refuses. Genjuro hears everything they say and he is pissed off that Amakusa doesn't even ask him to join him. Then, he challenges Haohmaru. Haohmaru loses to Genjuro. Later, Haohmaru begins his journey to defeat the evil Amakusa. Kibagami Genjuro: Genjuro's beginning is almost the same as above(Haohmaru's). But for Genjuro's version, he fights Amakusa instead of Haohmaru. Of course, he loses to Amakusa. He is pissed off and he begins his journey to defeat Amakusa. Nakoruru: Nakoruru starts off in her home village. Nakoruru and her sister, Rimururu are worry about their father who hasn't come back yet. Nakoruru goes off to search for her father, after she receives her father's sword from her hawk, Mamaha. She finds her father and he tells her that the growing evil force might endanger nature. He tells her that she must go to Edo to find Jubei. Tachibana Ukyo: Ukyo comes to ask the old wise man about the \"ultimate flower\". After the old man is touched by Ukyo's determination to search for the flower, he then tells him that he can only find the flower at the gate of devil's place. The old man asks him to go find Jubei for assistance. Ukyo then begins his journey. Galford: Galford and Earthquake are going to learn more techniques from Hanzo. But suddenly, Amakusa comes and takes away Shinzo(Hanzo's son)'s body. Amakusa wants to use his body as the host. Hanzo can't stand a chance with him. After Amakusa is gone, Hanzo rushes to find him. The righteous Galford also begins his journey to defeat Amakusa. Cham Cham: Tam Tam has always been the protector of his village. But one day, Amakusa comes to 'visit' and takes away the Parenke Stone. Because Tam Tam is not able to protect the Parenke Stone, the god of that stone punish him and turns him to a monkey. Cham Cham then realizes that she has to get it back. So, she begins her journey with the monkey, Paku Paku(Tam Tam) to search for Amakusa and get the Parenke Stone back from him. 2 - The Second Scenario - Youkadoukoku no Sho (Mizuki's Scenario) For this scenario, it doesn't matter who you choose as your main character, you'll get the same beginning. Nicotine Caffein realize that the hell's sorcerer Mizuki Rahoujin is resurrected. In order to stop Mizuki from turning this world to hell, Nicotine has asked you(the main character) to prevent this from happening. You start off with yourself(main character) and other Samurai you choose. Later, this person named Reon will join your party. From what we know, she is trained to defeat Mizuki.", "platform": "Sony Playstation", "release_date": "June 27, 1997", "game_type": "Released", "esrb": "", "developers": "SNK", "publishers": "SNK", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.81", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93851-shinsetsu-samurai-spirits-bushidou-retsuden\n"}