{"altername_name": ["Qin Shi Huang: The First Emperor"], "name": "Shin Shikoutei: The First Emperor", "overview": "Qin Shi Huang - The First Emperor is a strategy game based on the life of the chinese emperor Qin Shi Huang. The player start the game choosing 4 generals that will lead his forces and them he can build weapons, and new units like farmers, soldiers, etc. He can also attack other lands enemies. Qin Shi Huang (259 BCE - 210 BCE) personal name Ying Zheng, was king of the Chinese State of Qin from 246 BCE to 221 BCE during the Warring States Period. He became the first emperor of a unified China in 221 BCE. He ruled until his death in 210 BCE at the age of 50. Qin Shi Huangdi remains a controversial figure in Chinese history. After unifying China, he and his chief adviser Li Si passed a series of major economical and political reforms. He undertook gigantic projects, including the first version of the current Great Wall of China, the now famous city-sized mausoleum guarded by a life-sized Terracotta Army, and a massive national road system, all at the expense of many lives. To ensure stability, Qin Shi Huang outlawed Confucianism and buried alive many scholars. All books other than those officially decreed were banned and burned. Despite the tyranny of his autocratic rule, Qin Shi Huang is regarded as a pivotal figure. Title romanizes in Japanese to Shin Shikoutei, but represents a Chinese name Historical simulation to achieve the unification of China Qin Shi Huangdi become. Introduced a real-time system timing is largely a battle strategy, achieve its own tension. The characters have made the destruction of the building structure as well as combat repair, expand agricultural activities, such as more flexible. To produce a unique world-tone graphic ink. Features: First person perspective. 2D graphics Cartoon graphics Medieval China theme.", "platform": "Sony Playstation", "release_date": "May 30, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Shangri-La", "publishers": "Shangri-La", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135350-shin-shikoutei-the-first-emperor\n"}