{"altername_name": ["Shinseiki Evangerion: Kōtetsu no Gārufurendo"], "name": "Shin Seiki Evangelion: Koutetsu no Girlfriend", "overview": "Fourteen-year-old Mana Kirishima (voiced by Megumi Hayashibara) is transferred to Shinji Ikari's school, and almost immediately they begin to establish a special relationship. This provokes much jealousy in Asuka, who also suspects that Mana is a spy who is trying to get information from Shinji about NERV and the Evas. Rei Ayanami is present but plays a rather background role in the story, though she seems to agree with the suspicions of Asuka. Gradually, a relationship between Mana and Shinji unfolds and they end up going on a date. It turns out, however, that Mana is one of three test pilots for the TRIDENT (alternatively named the \"Country Crawler\") units, a new competitor to the Evangelions, similar to Jet Alone; thus the name Girlfriend of Steel. Eventually, the TRIDENT goes berserk and the Evas have to destroy it. The interactivity in most of the game is limited to walking around areas until the next plot event is triggered. However, the one true branch occurs at the end of the game, where the player may choose to focus on Mana, Asuka or Kaji. This choice determines which of the game's three endings are shown. In the Mana ending, Mana is discovered not to have been killed in the battle. Shinji rescues her and brings her back to his apartment. She showers, emerges wearing only a towel, and teasingly asks Shinji if he would like her to remove it (which she eventually does). In discussion with Misato, however, it is agreed that Mana has to leave Tokyo-3, and she says a teary goodbye to Shinji who has won her heart. In the Asuka ending, Asuka helps Shinji to get over Mana and the two children grow closer as a result. This ending contains romantic images of Asuka and Shinji together, including a moving scene where Asuka hugs Shinji emotionally. The third ending with Kaji does not focus on any one character as much as the other endings do. Mana is also discovered not to be killed, and says goodbye, with Shinji replying \"I'll be waiting for you\".", "platform": "Sony Playstation", "release_date": "April 16, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Gainax", "publishers": "Gainax", "genres": "Visual Novel", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Neon_Genesis_Evangelion:_Girlfriend_of_Steel", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136037-shin-seiki-evangelion-koutetsu-no-girlfriend\n"}