{"altername_name": [], "name": "Shin Sedai Robot Senki: Brave Saga", "overview": "On some planet. The Emperor Grandark sends his henchmen to try to invade earth. However around the earths orbit. A mysterious life force witnesses hostile forces entering earth. Meanwhile in the VARS Stadium, our hero Shunpei and his best friend Hiro have made it to the VARS Finals. The next match places them both against each other to see who will be the champion. However outside the stadium the Two Geist-stars attack the stadium, almost destroying. Fribird and Exkaiser both show up and holds off the Geist-Stars attack for the time being. Inside the stadium Shunpei wakes up and finds the place is on fire. He tries to look around for his Friend Hiro but sees that where Hiro once was, is buried under rubble. Thinking that his friend is dead, Shunpei begins to cry. However His VARS begins to talk to him and introduces himself as Sei Yuusha (Star Hero) Ban. This of course freaks Shunpei out. Ban tells him that he needs Shunpei's help in order to fight the Evil forces that are attacking earth. Shunpei Pulls a Shinji from Evangeleon and whines how he isn't a fighter and doesn't want to fight. Ban tries once more to talk some sense into Shunpei, because he senses the great potential courage in Shunpei, which is why he choose him as a partner. Ban asks Shunpei to shout out the phrase \"Brave Charge!\" to activate his power. Shunpei still being the wimp that he is cant bring himself to do it. Until his friend Nanako was about to get crushed by falling debris.. Thus begins the adventure of Shinpei and Sei Yuusha Ban. The only unit you can personally modify is Ban. Go to the first floor of the VARS base and you can choose which of the 3 abilities you want to increase (Attack, Hitting and Defense). Hit L1 or R1 to switch between the stats and hit up or down to increase or decrease. Eventually later in the game you can modify your units weapons as well. But you can't do this till like episode 20 or even sooner. It's one of the rooms on the first floor again.", "platform": "Sony Playstation", "release_date": "December 17, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Pandora Box Creative Office", "publishers": "Takara", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.12", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/108056-shin-sedai-robot-senki-brave-saga\n"}