{"altername_name": [], "name": "Shin Nihon Pro Wrestling: Toukon Retsuden", "overview": "Wrestling is a martial art[citation needed] that uses grappling type techniques such as clinch fighting, throws and takedowns, joint locks, pins and other grappling holds. A wrestling bout is a physical competition, between two (occasionally more) competitors or sparring partners, who attempt to gain and maintain a superior position. There are a wide range of styles with varying rules with both traditional historic and modern styles. Wrestling techniques have been incorporated into other martial arts as well as military hand-to-hand combat systems. Japanese professional wrestling, also known as puroresu, is treated as a sport rather than the entertainment style of wrestling found in North America. There are no storylines or any sort of angle found in most puroresu promotions. The matches have the atmosphere of real wrestling competition. Techniques include use of amateur or shoot wrestling tactics in addition to hard hitting martial arts strikes and complex submission maneuvers. This means that the wrestlers are more prone to injury. Popular Japanese wrestlers include Kenta Kobashi, Tiger Mask, The Great Muta, Jun Akiyama, Jushin \"Thunder\" Liger, and KENTA. New Japan Pro-Wrestling is a major professional wrestling promotion in Japan and is a member of the National Wrestling Alliance[citation needed], founded by Antonio Inoki in 1972. Owing to its TV program aired on TV Asahi, it is the largest wrestling promotion in Japan and one of the largest in the world. Shin Nihon Pro Wrestling - Toukon Retsuden is the first game in the Shin Nihon Pro Wrestling series for PSOne console and is one of the most popular wrestling games ever made.", "platform": "Sony Playstation", "release_date": "September 29, 1995", "game_type": "Released", "esrb": "", "developers": "Yuke's", "publishers": "Tomy", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112308-shin-nihon-pro-wrestling-toukon-retsuden\n"}