{"altername_name": ["Shinseiki GPX Cyber Formula: Aratanaru Chousensha"], "name": "Shin Seiki GPX Cyber Formula: Aratanaru Chousensha", "overview": "In the future, special AI computers called \"Cyber Systems\" have been used in racing as to help racers improve his ability and reduce accidents, one of them is a machine called \"Asurada\", a super-intelligent AI computer developed by Sugo Corporation, which is being targeted by Smith, who wants to use it as a military weapon. As the system is built for racing, Sugo puts Asurada into a car called GSX and delivers it to the Cyber Formula GPX's qualifying round in Fujioka, however, during the delivery, the machine is attacked. The story focuses on a young 14-year-old boy named Hayato Kazami, the son of the designer of the car, who activates Asurada GSX in order to escape from Smith's men. But because of the machine has locked Hayato's driver data, he has no choice but to become a racer for the Sugo Team. In the first qualifier, he races heatly with Naoki Shinjyo from Aoi and ends up in third place. In the second qualifying round, Hayato meets Johji Ohtomo, a racer from Albatross DDT and become good friends. During Hayato's training at night, he's attacked by Smith's men. In the race, Asurada's tire blows up, Hayato barely wins the race in third place. Hayato made it into the final 10 rounds of the Cyber GPX mainly with Asurada's ability and luck, which makes him overconfident. In the first race, he false-started and got a 60-second time penalty. Hayato pushed Asurada too far and was forced to retire. This made him realize that he has next to no skill at all. Hayato went through a depression for while, but makes a comeback after he makes more friends and he gets a fourth place in the second race. In the third race, one of the racers, Knight Schumacher, crashed his car into Edelhi Bootsvorz's Missionel to protect Asurada from being attacked by him. Smith is killed after that, and Knight Schumacher is revealed to be Osamu Sugo, Asuka's brother, and Hayato learns that his father is already dead. With the shock of his father's death, Hayato loses his control in the fourth race by activating the boost in a dangerous spot, resulting in Asurada GSX being totally wrecked up. The team then leaves to England to find his father's last gift, a new machine called Super Asurada SA-01. Hayato successfully unlocks Asurada's code and install Asurada into that machine and preparing for the next Grand Prix. In the fifth race however, Super Asurada is suffering a problem that it can't change modes and will blow up if the machine races after sometime. But with Hayato and Asurada's trust toward each other, they finishes the race in the first place safely. Shinjyo overpushes his car in the race against Hayato and get his engine blown up right before the finish line. Entering Karl Richter von Randoll, a prince and a racing genius who falls in love with Asuka, and therefore, building his rivalry with Hayato, after having a race duel, Randoll enters the Cyber GPX's sixth race and win first place. Shinjyo, even with a new car, loses in this race. In the seventh race, Hayato's friend, Bleed Kaga shows up and race for Shinjyo's team, while Shinjyo is forced into a secondary team. Shinjyo, though, work up with his new team almost win this race, but because of overuse of gas, his car stops right before the finish line. Shinjyo walked out and pushes the car to the finish line in fifth place. 8th race's mostly like a duel between Hayato and Randoll, Hayato wins by the end and Randoll gets pushed into the sea. In the ninth race, Hayato start to lose his trust with Asurada. He crashes with Othomo in this race, forcing Ottomo to retire the final race. Hayato, filled with rage, tries to destroy Asurada, but Asurada and his team mates snap some sense into him. With Super Asurada badly damaged, the Sugo team decides to use the old GSX until the repairs are finished. Hayato swaps his car during the middle of the race and catches up with Shinjyo and Randoll. After the heated race, Hayato wins the race and the Grand Prix in the end. Shinseiki GPX Cyber Formula - Aratanaru Chousensha is an adventure game in which the player to advance in the game have to make some choices between different options, the racing part is the same since in some parts of the race the player is asked to choose between different options in a limited time (9 seconds or so) and depending of the choice the race or the story will go in a way or another.", "platform": "Sony Playstation", "release_date": "August 21, 2003", "game_type": "Released", "esrb": "Not Rated", "developers": "Vap", "publishers": "Vap", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=3Zdg_zFIFXU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134904-shin-seiki-gpx-cyber-formula-aratanaru-chousensha\n"}