{"altername_name": [], "name": "Shiritsu Justice Gakuen: Nekketsu Seishun Nikki 2", "overview": "Rival Schools is a team-oriented 3D fighter featuring an assortment of characters, many recognizable as exaggerations of familiar High School stereotypes. Find a new use for baseball player Shoma's bat or outflank the competition with the fast attacks of cheerleader Tiffany. Harness the violent tendencies of the hyperactive Edge or unleash a precision beating with the quiet, bespectacled Kyosuke. The main fighting game is best described as a polygonal Marvel vs. Capcom game, with some notable differences. Control wise, the game varies from other Capcom fighting games by only having four buttons (two punches and two kicks, which is closer to the SNK game format) rather than the standard six. A player chooses a team of two characters, and fights against another two character team. The actual fights, however, are one-on-one fights, with the partner only participating by being called in when a player has enough 'vigor' for a Team Up attack, done by pressing a punch and kick button of the same pressure. In Japan, Capcom released this version a PlayStation-exclusive update to the original Rival Schools titled Shiritsu Justice Gakuen: Nekketsu Seisyun Nikki 2? . The game featured two additional characters, Ran of Taiyo High School and Nagare of Gorin High School, as well a new version of the Nekketsu Seisyun Nikki school sim mode, which feature additional mini games and further plot developments over the original Japanese version of Shiritsu Justice Gakuen.The game aso features Pocketstation support. STORY: The story introduces the player to a Japanese city called Aoharu City, where several local schools are the victims of unknown attacks and kidnappings of students and staff. The various characters in the game set out to find who is responsible for the attacks on their school, with the cut-scenes and fights portraying their interactions with the other schools and among themselves. Eventually, the story reveals that an elite school in the city, Justice High, is responsible for the attacks. The player's team eventually faces off against Raizo Imawano, the principal of the school, and first boss of the game. If certain requirements are met during the fight against Raizo, the story continues and the players play a last fight against Hyo Imawano, Raizo's nephew and the true mastermind behind the events of the game. The structure of the single player game of Rival Schools varied depending on how characters were selected. If two characters from the same school were selected (with a few exceptions), single-player would play in a progressing story with fights predetermined beforehand and each fight preceding and ending with short 2D cut-scenes to explain the story. If two characters from different schools were chosen, the single-player mode would instead play similar to other fighting games, with the player's chosen team fighting against random teams of opponents before facing the boss. In the arcade, character selection was initially limited to selecting two characters from the same school and free selection of any character was accessed through time; the PlayStation versions, which included all characters unlocked by default, had no such restrictions.", "platform": "Sony Playstation", "release_date": "June 24, 1999", "game_type": "Released", "esrb": "", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.57", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KLaWt3MNsjQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/26981-shiritsu-justice-gakuen-nekketsu-seishun-nikki-2\n"}