{"altername_name": ["Shutokou Battle Gaiden: Super Technic Challenge: Drift King e no Michi"], "name": "Shutokou Battle Gaiden: Super Technic Challenge", "overview": "Shutoko Battle is an arcade oriented driving game series created by Genki in 1994. The games were released in America as Tokyo Xtreme Racer and in Europe as Tokyo Highway Challenge. The series is based on illegal highway racing on the Shuto Expressway's Bayshore Route in Tokyo with custom tuned cars, a common occurrence at the time of the series' debut. However, since then Japanese police have begun cracking down on street racing and the hashiriya scene. Anti-street-racing legislation have also been enacted, levying heavier fines for street racing infractions. Despite this, the underground cultural phenomenon of illegal street racing has seen its popularity steadily growing in Japan since the mid-80's with its own dedicated manga (Shutoko Battle's biggest inspiration being Wangan Midnight), anime series and video games franchises (C1 Circuit, Wangan Trial, Naniwa Wangan Battle, etc.). Perhaps the most influential popular works spawned by the phenomenon were the six Shuto Kousoku Trial films (a.k.a. Freeway Speedway: Megalopolis Express Way Trial) released from 1986-1996, which were an obvious source of inspiration for the Shutoko Battle series. The game series' influence can be measured by the number of North American and European driving video games inspired by its iconic features, such as cosmetic tuning (Midnight Club, Need For Speed Underground, Juiced, and Supercar Street Challenge among many others), a wide selection of Japanese import cars, or the choice of Tokyo as the game setting, which has even influenced films like The Fast and the Furious: Tokyo Drift. Indeed, the trailer of the first the Fast and the Furious movie was included in western editions of Shutoko Battle Zero. The series is known under many names when published including the extra \"Drift King\" when released by BPS, it was renamed overseas Tokyo Highway Battle when published by Jaleco & THQ International. Other names include Tokyo Xtreme Racer by Crave Entertainment, Tokyo Highway Challenge and Import Tuner Challenge by Ubi Soft, and even Street Supremacy when released by Konami. The series was originally subtitled \"Drift King\", after the trademark nickname of street racing and professional racing driver Keiichi Tsuchiya who is featured in the first Shuto Kousoku Trial episodes and endorsed the game with, then team manager, Masaki Bandoh of Bandoh Racing Project. Shutokou Battle Gaiden - Super Technic Challenge features a story mode in which the player takes the role of a car driver that wants to become the new drift king, starting from the botton he will have to win races against other drivers to earn more money and using the money to improve his car.", "platform": "Sony Playstation", "release_date": "December 20, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Mitsui & Co", "publishers": "Media Quest", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96281-shutokou-battle-gaiden-super-technic-challenge\n"}