{"altername_name": ["Civilization"], "name": "Sid Meier's Civilization: Shin Sekai Shichidai Bunmei", "overview": "Sid Meier's Civilization is a turn-based strategy computer game created by Sid Meier for MicroProse in 1991. The game's objective is to \"...build an empire to stand the test of time\". The game begins in 4000 BC, and the players attempt to expand and develop their empires through the ages until modern and near-future times. It is also known simply as Civilization, or abbreviated to Civ or Civ I. Civilization is a turn-based single-player computer game. The player takes on the role of the ruler of a civilization starting with only one or two Settler units. The player attempts to build an empire in competition with between two and six other civilizations. The game requires a fair amount of micromanagement (although less than any of the simulation games). Along with the larger tasks of exploration, war and diplomacy, the player has to make decisions about where to build new cities, which improvements or units to build in each city, which advances in knowledge should be sought (and at what rate), and how to transform the land surrounding the cities for maximum benefit. From time to time the player's towns may be harassed by barbarians, units with no specific nationality and no named leader. These threats only come from unclaimed land or sea, so that over time there are fewer and fewer places barbarians will emanate from. Before the game begins, the player chooses which historical civilization to play. In contrast to later games in the Civilization series, in Civ I, this is largely a cosmetic choice, affecting titles, city names, musical heralds, color, and also their starting position on the \"Play on Earth\" map (and thus different resources in one's initial cities). It has no effect on starting position, however, when starting a random world game or a customized world game. The player's choice of civilization also prevents the computer from being able to play as that civilization or the other civilization of the same colour, and since computer-controlled opponents display certain traits of their civilizations this affects gameplay as well. The Aztecs are both fiercely expansionistic and generally extremely wealthy, for example. Other civilizations include the Americans, the Mongols, and the Romans. Each civilization is led by a historical figure, such as The scope of the game is huge — larger than most other computer games. The game begins in 4000 BC, before the Bronze Age, and can last through to 2100 AD (on the easiest setting) with Space Age and \"future technologies\". At the start of the game there are no cities anywhere in the world: the player controls one or two Settler units, which can be used to found new cities in appropriate sites (and those cities may build other settler units, which can go out and found new cities, thus expanding the empire). Settlers can also alter terrain, build improvements such as mines and irrigation, build roads to connect cities, and later in the game they can construct railroads which offer unlimited movement. As time advances, new technologies are developed; these technologies are the primary way in which the game changes and grows. At the start, players choose from advances such as Pottery, the Wheel, and the Alphabet to, near the end of the game, Nuclear fission and Spaceflight. Players can gain a large advantage if their civilization is the first to learn a particular technology (the secrets of flight, for example) and put it to use in a military or other context. Most advances give access to new units, city improvements or derivative technologies: for example, the Chariot unit becomes available after the Wheel is developed, and the Granary building becomes available to build after Pottery is developed. The whole system of advancements from beginning to end is called the Technology tree, or simply the Tech tree; this concept has been adopted in many other strategy games. Since only one tech may be \"researched\" at any given time, the order in which technologies are chosen makes a considerable difference in the outcome of the game and generally reflects the player's preferred style of gameplay. Players can also build Wonders of the World in each of the epochs of the game, subject only to obtaining the prerequisite knowledge. These wonders are important achievements of society, science, culture and defense, ranging from the Pyramids and the Great Wall in the Ancient age, to Copernicus' Observatory and Magellan's Expedition in the middle period, up to the Apollo program, the United Nations, and the Manhattan Project in the modern era. Each wonder can only be built once in the world, and requires a lot of resources to build, far more than most other city buildings or units. Wonders provide unique benefits to the controlling civilization. For example, Magellan's Expedition increases the movement rate of naval units. Wonders typically affect either the city in which they are built (e.g., the Colossus), every city on the continent (e.g., the Hanging Gardens), or the civilization as a whole (e.g., Darwin's Voyage). Also, some wonders are made obsolete by new technologies. The game can be won by destroying all other civilizations, reaching the end of the modern era with the highest score or by winning the space race by reaching the star system of Alpha Centauri.", "platform": "Sony Playstation", "release_date": "April 26, 1996", "game_type": "Released", "esrb": "", "developers": "MicroProse", "publishers": "Asmik Ace Entertainment", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112326-sid-meiers-civilization-shin-sekai-shichidai-bunmei\n"}