{"altername_name": ["Silent Möbius: Genei no Datenshi", "Silent Moebius: Gen'ei no Datenshi", "Silent Mobius: Genei no Datenshi"], "name": "Silent Mobius: Genei no Datenshi", "overview": "In 1999 Gigelf Liqueur, aided by the Magician's Guild, set into motion a plan to open a gate between Earth and the world of Nemesis. The intent was to exchange Earth's polluted air and water with clean air and water from Nemesis. To aid in this endeavor, a huge cyclotron was built under Tokyo. Unfortunately for all involved, Ganossa Maximilian - Gigelf's old apprentice - sabotaged the plan, opening the gate early and perverting the gate for his own means. Following this event, Gigelf and the Magician's Guild battled an invasion of Lucifer Hawk (the name for the inhabitants of Nemesis) for a number of years. Gigelf was killed in 2006 and it would seem that the rest of the Guild met similar fates over the next few years. In 2023, Rally Cheyenne, daughter of Guild member Lufa Cheyenne, started the Attacked Mystification Police. Of mixed heritage (her father was from Nemesis), Rally felt partially responsible for the growing attacks on innocent humans by marauding creatures from Nemesis. She started the organization with a mere three officers (Kiddy Phenil, Lebia Maverlick and Nami Yamigumo). Over the next few years, she added Katsumi Liqueur and Yuki Saiko to the team; aiding in the fight to protect Earth from the vicious Lucifer Hawk. Characters: The main character are 5 women. Kastsumi Liqueur ( A blue haired sorceress.), Nami Yamigumo ( A purple Haired Shinto Priestess.), Kiddy Phenil (A hot headed tough girl with cybernetic limbs), Yuki Saiko (a brown haired Psychic girl.), & Lebia Maverick (a blondehaired woman who is an expert hacker.) The gameplay is about the usual in graphic adventure the player use a pointer to select the actions, there are 3 different character to use, each of them with different habilities. The battle parts are the usual in rpg: select the proper action and the character will make it.", "platform": "Sony Playstation", "release_date": "December 23, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "TechnoSoft", "publishers": "Bandai Visual", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112330-silent-mobius-genei-no-datenshi\n"}