{"altername_name": [], "name": "Silhouette Mirage: Reprogrammed Hope", "overview": "Story The game is set on Earth in the year \"2XXX\"[13] after a system known as Edo has catastrophically failed and caused the world's inhabitants to be genetically mutated into beings known as either \"Silhouette\" or \"Mirage\". The protagonist Shyna Nera Shyna[14] is a creation that is activated by the computer system Gehena. Shyna's purpose is to track down and repair Edo to undo the damage that has been done and unite the two opposed types of beings that were created.[4] Shyna learns that Edo experimented on and created a being called Armageddon who was both Silhouette and Mirage. Due to the polar nature of these attributes, Armageddon was split into two individual entities known as Medigo and Hal, respectively the Silhouette and Mirage leaders.[15] Those that display both of the attributes are known as Proteans, and in addition to Armageddon, Shyna and Zohar are also such beings. Shyna battles through Silhouette and Mirage creatures, including Medigo, Hal and Zohar. She is eventually able to repair and reboot Edo. Gehena then notifies Shyna that all Silhouette and Mirage lifeforms will be located, identified, processed and returned to their original selves. Gehena estimates that this process will take 932,000 hours to complete. Development Silhouette Mirage was developed by Treasure.[1] At the time the developer was shifting their focus to the Nintendo 64 and PlayStation, and announced that Silhouette Mirage would be their final game for the Sega Saturn.[16] (In actuality, Treasure would go on to make one further Saturn game, Radiant Silvergun.) According to director Masaki Ukyo, the original concept was to incorporate the idea of two different attributes to make a unique action game, and that other concepts such as grabbing, throwing and \"Cash Bash\" were added later in development simply because \"we got all these cool ideas and wanted to add them\".[17] The gameplay mechanic of the player's power dropping if the spirit gauge falls was added near the end of development, and was based on a system Treasure used in Guardian Heroes (1996).[17] The character Shyna originally had a more typical fantasy witch design, but producer Koichi Kimura did not feel comfortable with fantasy settings, so gave the setting and character a futuristic design. He decided to use chibi character designs because he was not skilled at drawing realistic characters.[17] Release Silhouette Mirage was released in Japan on the Sega Saturn on September 10, 1997.[1] Sega, which had published Treasure's previous Saturn game, Guardian Heroes, expressed a lack of interest in releasing the game in the West.[18] The game was ported to the PlayStation as Silhouette Mirage: Reprogrammed Hope in Japan on July 23, 1998.[3] Treasure handled the port completely in house with a small team, including the difficult adaption of the 2D view into the PlayStation format.[19][20] The soundtrack was trimmed with the training music being replaced and a few minor background elements were simplified or removed.[12] The Reaper and Geluve bosses are exclusive to the PlayStation version. The game's story was also adjusted to accommodate these new characters, resulting in some more dialogue, a new battleground, and another ending.[21] This version was released as a PS one Classic on the Japanese PlayStation Network on August 25, 2010.[22] American publisher Working Designs localized the PlayStation version for North America and made further alterations.[12] They increased the gameplay difficulty,[12] and added vibration support and memory card selection. Working Designs discovered that the game used virtual controllers to control enemy bosses, and took advantage of this to make Zohar a fully playable character during the credits.[21] Cutscenes were enhanced to run at a slightly higher resolution.[14] There are also secrets such as a debug mode, more options, and \"Super Core Fighter 2\",[21] a two player mini-game battle between Shyna and Zohar.[21] Also, the Hare Wares sprites were censored/edited. His cigarette was replaced with a gloved hand, and the burning cross was replaced with a dragon. A preview video for Lunar 2: Eternal Blue, another game localized by Working Designs, was also added to the game.[6] Some character and location names that reference the Bible were also changed.[21]", "platform": "Sony Playstation", "release_date": "July 23, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "Treasure", "publishers": "Entertainment Software Publishing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.8", "wikipedia": "https://en.wikipedia.org/wiki/Silhouette_Mirage", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134926-silhouette-mirage-reprogrammed-hope\n"}