{"altername_name": [], "name": "Silhouette Stories", "overview": "A single young man wakes up one morning, looks out the window at the sunrise, and decides that today is the day when he will finally find a girlfriend. He then proceeds to find a strange star-like alien creature in his mailbox, eating his newspaper. This creature introduces itself as Pani, from the planet Gals, and claims to be able to help the man change his fate. Will Pani really be able to help this young man find love? Silhouette Stories is a spinoff of Kaneko's Gals Panic series, removing the nudity but adding light visual novel elements. The player chooses one of 12 locations, where they find one of the possible female matches. Depending on the player's choices in the dialogues, and their performance in the stages, each girl's story will branch in different ways. However, the player must reach all possible endings with a girl, including the bad ones, before their true \"happy end\" will be unlocked. The gameplay itself is a basic QIX variant, where the player must use their cursor to capture the glowing silhouette of the female character without being hit by enemies. Several items will also appear to aid the player, such a speed booster, and a time stop. Each stage also has a random objective such as \"collect every item\" or \"get 30% in one capture\". Failing to complete the objective does not necessarily mean game over, and in many cases will result in a different story branch. Images from completed stages can be freely viewed from an in-game gallery, and completing all of a girl's story paths will unlock a bonus dress-up mode for that character where the player can swap out different outfits.", "platform": "Sony Playstation", "release_date": "September 27, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Kaneko", "publishers": "Kaneko", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134074-silhouette-stories\n"}