{"altername_name": ["Silver Jiken: The Silver"], "name": "Silver Jiken", "overview": "The player navigates their way through a series of situations in a first-person perspective. The player character can move from node to node on an invisible grid (but with the graphics drawn in real-time 3D), rotating their view horizontally and vertically, and selecting actions to carry out on various items in the environment, or in the character's inventory. Non-interactive story elements are presented in a unique style dubbed “Film Window” by the game's creators. While the story and dialogue proceeds in written text, other information and images regarding the story or presentation such as real-time 3D displays, real-life photographs, 2D illustrations, video, typography, texts, etc. are constantly changed and displayed in a series of frames that are automatically opened and closed as the main text displays. Plot: In 1999, there exists an area called the \"24 Districts\". A series of mysterious and bizarre murders have happened there. Detectives of the High-degree Murder Division (HMD) in the 24 Districts Police Department investigate the case and find that they closely match the profile of a well-known killer, Kamui Uehara, who assassinated many key government figures one after another several years ago. Uehara was supposedly shot and killed by Kusabi, a veteran detective of the HMD, but current events seem to indicate that Uehara is still alive, and at large in the 24 Districts. Has the deadly assassin returned to life? The plot is separated into 2 scenarios that are titled \"Transmitter\" (written by Goichi Suda) and \"Placebo\" (written by Masahi Ooka and Sako Kato). In \"Transmitter\", the detectives of the HMD hunt for the killer, and in \"Placebo\", a freelance writer investigates the affair. As the game was directed by Goichi Suda, his distinctive world-view, characters with vivid personalities, and unconventional and unexpected storylines give the game an attractively surreal aspect. Takashi Miyamoto's character designs and 2D illustrations add to this surreal mood, by giving mostly realistic figures and places the look of a slightly artifical, plastic finish. Additionally, Masafumi Takada's music succeeds in imparting a dark, conspiratorial atmosphere to the 24 Districts. Manufacturer's description:", "platform": "Sony Playstation", "release_date": "October 5, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Grasshopper Manufacture", "publishers": "Ascii Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93852-silver-jiken\n"}