{"altername_name": [], "name": "Sim Town", "overview": "SimTown is a 1995 personal computer game published by Maxis, much like the best selling SimCity and Sims but on a smaller scale. SimTown allows the player to construct a town consisting of streets, houses, businesses and parks and then control the people in it. SimTown was one of the many 'Sim' spin-offs at the time, and was targeted more towards children. The game structure of SimTown is similar to SimCity, but on a generally smaller and simplified scale, where players are tasked to craft a small town instead. Players are allocated a blank and flat tract of land, where they will be required to place homes, workplaces and civic buildings. In addition, other elements such as roads and flora can be placed, although they do not appear to have any other practical use besides beautification. The primary objective in SimTown is to keep the town's citizens happy. This can be achieved by ensuring that water supply, trees, farm crops, and the recycling program remain well maintained and well funded, with the allocation of \"credits\" given at each stint. The amount of these resources required for the town and the credits awarded will depend on how much has been built in the town. Trees and ponds, for example, may consume a certain amount of water, while most businesses and homes will generate an amount of garbage that will have to be dealt with using the recycling program. If these resources are not kept in check, the town may experience negative repercussions, such as the presence of dying trees and dried-up ponds if water supply is not sufficiently provided. This aspect of the game may be compared with the annual or monthly budgets seen in SimCity; however, there are no signs of actual currency used in SimTown aside from the credits allocated for the external resources; construction of buildings and landscaping also require no monetary costs. Like SimCity, SimTown places emphasis in ensuring a balance between the number of residents and jobs is properly regulated and maintained. Each household in a home contains two children, a pet, and two adults; the latter may need to find jobs from businesses or civic buildings placed by players. Likewise, businesses and civic buildings require a sufficient number of workers to function properly. If residents are unable to find jobs after a while, indications of their long-term unemployment will show when their home rots and is eventually reduced to rubble (and its inhabitants move out). Similarly, if a business or civic building lack enough employees, the buildings will decay and eventually collapse into rubble. SimTown allows a player to monitor the town's condition with a feature that allows players to craft and name a resident, who will provide basic feedback and daily activities through diary entries. A local newspaper is also provided to monitor general conditions of the town. SimTown also awards players with trophies and award ribbons by meeting certain objectives and requirements. There are also several easter eggs hidden in the game. PLAYSTATION VERSION: The game was first released in PC and 2 years later it got his Playstation version", "platform": "Sony Playstation", "release_date": "May 16, 1997", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "Construction and Management Simulation", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134053-sim-town\n"}