{"altername_name": ["Simple 1500 Series Vol. 86: The onigokko"], "name": "Simple 1500 Series Vol. 86: The onigokko", "overview": "Onigokko is a Japanese playground game usually played with two or more people. This game is played for the preliminary to sports or other activities. The more number of people are playing, more fun it gets. There is no limit of age to play Onigokko. The rule is simple, just run away from what we call \"Oni.\" \"Oni\" is the one who tries to catch (means ?touch?) all the people running away from Oni. Normally, we choose Oni by ?Janken? (rock-paper-scissors). People running away from Oni are trying to escape until the time limit comes or the Oni gives up, and that is when this game is over. There are variations to this game of Onigokko. For example, there is \"Koori Oni.\" This game is very similar to the normal Onigokko, but the difference is that you stays at the place where you were caught. If someone who isn't caught touches you, you are free to continue running away from Oni. It is very hard for the Oni to finish the game so generally Oni gives up. Another example would be \"Shippo-tori.\" This is different than other ones. Everyone is running away form everybody. In this game, everybody is an enemy, the ?Oni.? All people playing must put handkerchief behind their back, half way in their pants and half way out. The object for this game is to take other people's handkerchief. If your handkerchief is taken away, you lose the game. Who ever left with the handkerchief on their back wins the game. Simple 1500 Series Vol.086 - The Onigokko is based on the child game and features up to 4 human players to play at the same time, 10 different characters (male and female ones) to play with and a really complicated control system...", "platform": "Sony Playstation", "release_date": "February 28, 2002", "game_type": "Released", "esrb": "", "developers": "BESTMEDIA", "publishers": "D3 Publisher", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116081-simple-1500-series-vol-86-the-onigokko\n"}