{"altername_name": ["Simple Characters 2000 Series Vol. 16: Ganba no Bouken: The Puzzle Action"], "name": "Simple Character 2000 Series Vol. 16: Gamba no Bouken: The Puzzle Action", "overview": "Ganba no Boken is a Japanese anime series that was directed by Osamu Dezaki. Its 26 episodes were broadcast on NTV between April 7, 1975 and September 29, 1975. The series has been adapted into a movie, called Gamba to Kawauso no Boken, which was released in Japan by Tokyo Movie Shinsha on September 20, 1991. On March 4, 2003 Bandai released a puzzle and action Play Station game called Ganba no Bouken: The Puzzle Action. CHARACTERS: - Ganba: is a town mouse, and he calls himself \"Ganbari-ya no Ganba\". He is always energetic, full of curiosity, and has a strong sense of justice. He takes a trip to show Bobo, his close friend, the sea, and meets Chuta in the harbor at which they arrived. - Bobo: is Gamba's best friend, and is a town mouse, too. He is a glutton and an easygoing mouse. His name comes in his being absentminded. - Yoisho: is a captain of sailor mice. He is very dependable and has a kind heart, but, he is calmer than Ganba. He had his right eye injured by Noroi before. - Gakusha: is a childhood friend of Yoisho. He is a knowledgeable mouse, is clever, and wears big glasses. - Ikasama: He is a gambler good at a fraud. He is also called a \"swift runner\" because he is light-footed. - Shijin: is a wandering doctor mouse. Every time he gets drunk, he reads poetry out. - Chuta: is an insular mouse who comes to the town for help. He is a younger brother of Shioji. - Noroi: Noroi is a weasel of snow-white body hair and a red eye. He is 3 times the size of an ordinary weasel. He is a cunning and brutal slaughter. GAME: Simple Characters 2000 Series vol.16 - Ganba no Bouken Puzzle is an action puzzle game featuring characters from the anime series. The gameplay is about put the counter that is in botton right part of the screen to zero, in some stages that means destroy mouses, cats, birds or find all the items. In the 1 player mode the player has 7 lives to complete each stage (each of them using a different character), in the 2 players cooperative mode, the players can hit between them and they choose 3 different mouses each of them. A really difficult and challenging puzzle game.", "platform": "Sony Playstation", "release_date": "April 3, 2003", "game_type": "Released", "esrb": "", "developers": "Bandai", "publishers": "Bandai", "genres": "Board Game", "max_players": "", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135984-simple-character-2000-series-vol-16-gamba-no-bouken-the-puzzle-action\n"}