{"altername_name": ["Simple Characters 2000 Series Vol. 12: Kidou Butouden G Gundam: The Battle"], "name": "Simple Character 2000 Series Vol. 12: Kidou Butouden G Gundam", "overview": "The Gundam Series is a metaseries of anime created by Sunrise studios that features giant robots (or \"mecha\") called \"Mobile Suits\" (MS); usually the protagonist's MS will carry the name Gundam. Mobile Fighter G Gundam, known in Japan as Kido Butoden G Gundam, is a Japanese animated television series directed by Yasuhiro Imagawa (Giant Robo, Getter Robo Armageddon). Created to commemorate the 15th anniversary of the franchise in 1994, it is the first of the Gundam series to be set in an alternate continuity from the original \"Universal Century\". The 49 episodes of the series aired on TV Asahi from April 1, 1994 to March 31, 1995. An English language version aired on American Cartoon Network's Toonami block from August 5, 2002 to October 16 of the same year. The show takes place in \"Future Century\", a war that is fought in which a fighting tournament is held every four years between the space colonies. Each country sends a representative Gundam Fighter to fight on Earth until one is left, and the winning nation of that Gundam earns the right to govern over the colonies for the next four years. G Gundam follows Neo-Japan's representative Domon Kasshu in year 60 of that century, during the 13th Gundam Fight. He is in the fight both to win and to track down his brother, who had stolen a mysterious Gundam - the Devil Gundam (Dark Gundam in the American version) - from the Neo-Japan government. The series takes a wildly different turn from the rest of the franchise. It has a number of shonen elements: the main cast behaves differently,[clarification needed] and characters gain superhuman speed and strength through intense martial arts training. Though most of its Gundams feature super robot elements, such as heroic designs and voice activated special attacks, others still behave like real robots. Simple Characters 2000 Series vol.12 - Kidou Butouden G Gundam is a 2d fighting game that features characters from the G Gundam series and these game modes: - Street - VS CPU - VS 2 Player", "platform": "Sony Playstation", "release_date": "October 10, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Natsume", "publishers": "Bandai", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112347-simple-character-2000-series-vol-12-kidou-butouden-g-gundam\n"}