{"altername_name": ["Simple Characters 2000 Series Vol. 17: Sentou Mecha Xabungle: The Race in Action"], "name": "Simple Character 2000 Series Vol. 17: Sentou Mecha Xabungle: The Race in Action", "overview": "The planet Zola is separated into a number of different cultures. Most prominent of these are the Innocent, with their mastery of highly-developed ancient science and technology, and the resilient and adaptable Civilians who rely on the Innocent for replacement technology and things that need to be mechanically-produced. The Innocent use their multiple contacts with various Civilian groups to keep them at odds with each other, and maintain their own narrow mastery of power. Prominent among the above mentioned means of production are Walker Machines, ubiquitous vehicles with vaguely humanoid silhouettes, which Civilians use for such various purposes as mining, transport of persons and goods, construction, and combat. While many, if not all Walker Machines are armed to a degree, purely combat-oriented Walker Machines are a rarity, and it was one such rare variety of Walker Machine that a young Civilian named Jiron Amos, prompted by his new acquaintances, the Sand Rats, decide to liberate for his own use. Using the stolen combat machine, revealed to be a Xabungle-type Walker Machine, Jiron soon gets himself and his allies into (and out of) all sorts of trouble, which make for an entertaining romp across the desolate planet Zola, where things are not as simple and innocent as they first appear to be. Eventually a showdown is forced between Jiron and his allies and the forces of the Innocent. GAME: Simple Characters 2000 vol.17 - Sentou Mecha Xabungle - The Racing Game is a racing game that features 2 game modes: - Story Mode: Advance through the story getting a good position in each race - Free Mode: Play all the different circuits and use the different characters in a sort of a practice for the story mode.", "platform": "Sony Playstation", "release_date": "April 3, 2003", "game_type": "Released", "esrb": "", "developers": "Bandai", "publishers": "Bandai", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135986-simple-character-2000-series-vol-17-sentou-mecha-xabungle-the-race-in-action\n"}