{"altername_name": [], "name": "Simple 1500 Series vol. 40: The Shogi 2", "overview": "Shogi, also known as Japanese chess, is a two-player board game in the same family as Western chess, chaturanga, and Chinese Xiangqi, and is the most popular of a family of chess variants native to Japan. Shogi means general's. The earliest predecessor of the game, chaturanga, originated in India in the 6th century, and spread from China to Japan, where it spawned a number of variants. Shogi in its present form was played as early as the 16th century, while a direct ancestor without the \"drop rule\" was recorded from 1210 in a historical document Nichureki, which is an edited copy of Shochureki and Kaichureki from the late Heian period (ca 1120). According to ChessVariants.com, \"Perhaps the enduring popularity of Shogi can be attributed to its 'drop rule'; it was the first chess variant wherein captured pieces could be returned to the board to be used as one's own. David Pritchard credits the drop rule to the practice of 16th century mercenaries who switched loyalties when captured - no doubt as an alternative to execution.\" Simple 1500 Series vol.040 - The Shogi 2 is a shogi game that some difficulty levels and a tutorial. Manufacturer's description: A popular pursuit in the interest of a simple game \"SIMPLE1500 series\" 2nd game of chess. Is produced by the concept of deriving the ultimate appeal of chess, more CPU than previous work that has been hammered in nature and more thoughts come to enjoy using the tactic against a varied CPU telling the other. Features: First person perspective. 2D graphics Cartoon graphics Shogi theme.", "platform": "Sony Playstation", "release_date": "October 26, 2000", "game_type": "Released", "esrb": "", "developers": "Warashi", "publishers": "D3 Publisher", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115972-simple-1500-series-vol-40-the-shogi-2\n"}