{"altername_name": ["Simple Characters 2000 Series Vol. 13: Shin Kidou Senki Gundam W: The Battle"], "name": "Simple Character 2000 Series Vol. 13: Kidou Senki Gundam W: The Battle", "overview": "The Gundam Series is a metaseries of anime created by Sunrise studios that features giant robots (or \"mecha\") called \"Mobile Suits\" (MS); usually the protagonist's MS will carry the name Gundam. Mobile Suit Gundam Wing, known in Japan as New Mobile Report Gundam Wing, is an anime series in the mecha genre, and is one of the alternate universe Gundam series, taking place in the After Colony timeline. It is the second alternate universe in the Gundam media franchise, following Mobile Fighter G Gundam. The plot centers around a war between Earth and its colonies in space; however, in contrast to the Universal Century continuity, the Gundam pilots of Gundam Wing are more closely allied to each other than they are to any particular side in the conflict unfolding around them. The series aired across Japan on the terrestrial TV Asahi network. The series ran for forty-nine half-hour episodes, beginning on April 7, 1995 and ending on March 29, 1996. Masashi Ikeda was the overall director of the series. Katsuyuki Sumizawa (Yoroiden Samurai Troopers) wrote the scenario for the series and was one of three official script-writers, along with Akemi Omode and Katsuhiko Chiba. Ikeda wrote one script himself and one with Omode and one with Sumizawa. Toshifumi Kawase also wrote three scripts in the latter part of the first half of the series. Kow Otani composed the music. The series was loosely based on the original 1979 series, Mobile Suit Gundam, created by Yoshiyuki Tomino and Hajime Yatate. Gundam Wing was among the first series in the Gundam franchise (not including OVAs) to be dubbed in English and was aired on Cartoon Network in the U.S. and the U.K. Since then, the series has also been dubbed into Tagalog, French, Italian, German, Arabic, Spanish, Indonesian, Malay and Portuguese. Simple Characters 2000 Series vol.13 - Kidou Senki Gundam W - The Battle is a 2d fighting game that features characters from the G Gundam series and these game modes: - Street - VS CPU - VS 2 Player", "platform": "Sony Playstation", "release_date": "October 10, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Natsume", "publishers": "Bandai", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112348-simple-character-2000-series-vol-13-kidou-senki-gundam-w-the-battle\n"}