{"altername_name": [], "name": "Simple 1500 Series Vol. 19: The Sugoroku", "overview": "Simple 1500 Series vol.19 The Suguroku is a board game based on the Sugoroku game, the game features different boards and can be played by up to 4 human players at the same time. Sugoroku is a game with which you can step one block by one from start to the end of various stories using a dice. Sugoroku has become popular about 300 years ago and still remains even today in Japan. There are so many fantastic, dramatic and a bit retrospective sceneries in Sugoroku. History of Sugoroku: Sugoroku is a type of board games like Shogi, Igo or Chess. One of the oldest board games is exhibited in the Iraqi National Museum in Baghdad. Among all, the game board of 2600 BC which is excavated in the king's tomb of the third Ur dynasty in southern Iraqi is the most elegant and exquisite, thus called Royal Game of Ur. It is decorated with jewelry and patched on the board face and side with block formed or eye formed shell blade mosaic. This game's rule has been determined in England where is acknowledged as the most advanced place in its researches in the history of games. According to I. Finckel, vice division manager of Western Asian Archeology in the British Museum, \"the Ur game is a racing game played by 2 players. Players advance their pieces from the starting block to the finish block. It uses one triangular pyramid formed dice and 5 black and white pieces each. It has fairly complicated playing rule. For example, you can forward to 13th block when the number of dice turns to 2, you can throw dice twice when you hit one of 5 Rosetta blocks and so on\".", "platform": "Sony Playstation", "release_date": "November 18, 1999", "game_type": "Released", "esrb": "", "developers": "", "publishers": "D3Publisher", "genres": "Board Game", "max_players": "4", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135372-simple-1500-series-vol-19-the-sugoroku\n"}