{"altername_name": ["Simulation RPG Tkool"], "name": "Simulation RPG Tsukuru", "overview": "RPG Maker, known in Japan as RPG Tsukuru, is the name of an expansive series of programs for the development of role-playing games (RPGs), first created by the Japanese group ASCII, then succeeded by Enterbrain. The Japanese name, Tsukuru, is a pun mixing the Japanese word tsukuru , which means \"make\" or \"create\", with tsuru, the Japanese transcription of the English word \"tool\". The RPG Maker series has been released primarily in Japan, with later versions also released in China, Taiwan, South Korea, and North America. According to Enterbrain, RPG Tsukuru Dante 98, released on December 17, 1992, was the first game of the RPG Maker series, although there were a few versions of RPG making software by ASCII preceding it. This, along with its follow-up RPG Tsukuru Dante 98 II, was made for NEC PC-9801, and games created with these programs can be played on a Windows computer with emulators called Dante for Windows and D2win, respectively. The first console RPG Maker, RPG Tsukuru Super Dante, debuted in 1995 for the Super Famicom, as a port of RPG Tsukuru Dante 98. RPG Tsukuru Super Dante was later broadcast via the Super Famicom's Satellaview subunit. The first official English language release was a PlayStation version, simply called RPG Maker in the North American market. As of 2007, all North American versions of the console RPG Maker are published by Agetec. Simulation RPG Tsukuru is the first game in the RPG Maker series for the Playstation console, featuring more than 100 different characters, predesigned dungeons, and a complete 2d editor for creating 2d tactical rpgs.", "platform": "Sony Playstation", "release_date": "September 17, 1999", "game_type": "Released", "esrb": "", "developers": "Pegasus Japan Corp.", "publishers": "Ascii Entertainment", "genres": "Sandbox", "max_players": "1", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112349-simulation-rpg-tsukuru\n"}