{"altername_name": [], "name": "Sister Princess 2", "overview": "The game itself plays out like a dating sim. Players have about a month to spend with the sisters with each day broken up into three segments: first is the free time period before noon, followed by the period after lunch and ending with another period of time before bed. During day time, the player can choose which of the girls he wishes to escort to school, if any. The period after lunch is similar to the one in the morning, with additional choices which allow the player to go to various places in town besides walking home with one of the girls. Every night before bed, the player will be allowed to check his e-mail and send replies. As the player continues to interact with the sisters, their reactions to their big brother will change accordingly until the ending. According to one source, there are two different endings for each sister: the normal ending and the \"non-blood relation\" ending. As the name would suggest, the special ending reveals that the brother-character and sister aren't actually related by blood. In the case of some of the older sisters, this can lead to the protagonist and \"sister\" marrying one another. For Sister Princess 2, the story begins on the final day of school before summer vacation. Then the player chooses a sister who he wants to start with for a close relationship. Therefore, Sister Princess 2 is about spending the player's time with either one sister or all sisters at the same time as they spend their summer together. Specially in Sister Princess 2, the player can spend the summer with all the sisters, not just one, in a special ending where the sisters invite their brother to a summer party where the brother and the sisters would swear to be together forever. Sister Princess is one of the few popular dating game series that does not feature hentai elements. Despite (or perhaps because of) this, a rival company known as GIGA decided to create the hentai knockoff Colorful Kiss. While this game features a different cast of characters (to avoid lawsuits), their setup and personalities are comparable. Colorful Kiss was popular enough to warrant the sequel Colorful Heart. It is important to note that these GIGA titles are ultimately incestuous.", "platform": "Sony Playstation", "release_date": "March 20, 2003", "game_type": "Released", "esrb": "", "developers": "Stack", "publishers": "Media Works", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112351-sister-princess-2\n"}