{"altername_name": [], "name": "Ski Air Mix", "overview": "Ski Air Mix (スキーエルーミックス) is an alpine skiing video game released on the PlayStation that was developed and published by KID in Japan. It was published by Midas Interactive Entertainment in Europe two years later and sold as a \"budget\" title. The player takes control of one of four different skier models; two male models and two female ones. Each model can be equipped with one of 11 different pairs of skis, each with their own statistics including Max Speed, Performance, Stability and Response. Then the player can ski on five different international slopes which include Italy, Austria, Japan, Switzerland and Canada in order of increasing difficulty. The game offers two modes, Alpen mode, which is single player and has the player racing against the clock, and Versus mode, which allows two players to compete on the same slope. During a game, the player is required to race downhill to the finish line before the clock runs out. Along the way there are jump points where the skier can pull off stunts and moves in mid-air which grant the player Air Points upon successfully landing. Winding paths, gaps and slopes of varying steepness provide a constant challenge to the skier as he or she travels to the finish line. Each slope is divided into 3 sectors, and each one is timed differently with different counters for Air Points. The player wins a game by reaching the finish line before time runs out. Upon finishing a slope, the player has the option to view a replay of the run and then reaches a Results screen which report the time taken to complete each sector of the slope along with how many Air Points were attained in each one with a total. The player is then brought to a rankings screen which shows the best runs of the slope the player originally picked to play on. An option is also given to save a ghost replay of the run or in case one already exists, to update it.", "platform": "Sony Playstation", "release_date": "January 9, 2000", "game_type": "Released", "esrb": "", "developers": "Kid", "publishers": "Midas Interactive", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78980-ski-air-mix\n"}