{"altername_name": [], "name": "Slayers Royal", "overview": "Slayers is a series of over 52 light novels written by Hajime Kanzaka and illustrated by Rui Araizumi. It was later developed into several manga titles, five televised anime series, two three-episode original video animations (OVAs), and five movies. It also spawned several console role-playing games for the Sega Saturn and PlayStation, as well as one for the Super Famicom. Slayers is a Dungeons & Dragons inspired narrative that follows the adventures of the young sorceress Lina Inverse and her companions as they journey through their world. Using powerful magic and swordsmanship they battle overreaching wizards, demons seeking to destroy the world, dark lords, and the occasional hapless gang of bandits. The series is considered to be one of the most popular of the 1990s. Slayers Royal is a 1997 video game based on the Slayers franchise released for the Sega Saturn and the PlayStation, featuring all the original anime cast, with the original voice actors. Slayers Royal is notable for bringing together Naga the Serpent (Lina Inverse's companion in the prequel OVA's) with Gourry Gabriev, Amelia and Zelgadis Greywords (Lina's companions in the TV series) for the first time. However, it is debatable whether or not the game's story stands as canon. The game tells the adventures of Lina Inverse, Gourry GabrieffLina & Naga the Serpent. The adventure Mode itself has two components : Conversation and Roaming. In Conversations, simply use the button to go to the next screen of text, and use the D-pad to choose options. Just about all throughout the game, the Circle buttons select an option, and the X button will either pull up a menu or cancel.", "platform": "Sony Playstation", "release_date": "June 25, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "JAM Software", "publishers": "Kadokawa Shoten", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112354-slayers-royal\n"}