{"altername_name": ["3, 2, 1, Smurf! My First Racing Game", "Die Schlümpfe: Auf die Plätze, Fertig, Los!", "1,2,3 ¡A Pitufar!"], "name": "Smurf Racer!", "overview": "The popular cartoon franchise of the 1980s returns in Smurf Racer!, where players, as one of a dozen Smurf characters, go kart racing on eight different courses. Each blue-skinned, white-capped, \"three-apples-tall\" Smurf is defined by a particular personality trait, apparent by the theme of his or her vehicle. Smurfs compete for the Mushcup or Sasparilla Palm using wind-up cars and special tricks, with Brainy Smurf, always the authority, judging the matches. Single-player action includes races in three modes: Single, Championship, and Flag. Eight Smurfs are available at the beginning of the game. Four more can be unlocked later in the Championship mode, where the goal is to win each of nine levels in three different worlds to find the last super Smurf in the secret level. Flag racing requires running over flags on the track before the computer-controlled racers can get them. Hitting opponents with firecrackers causes them to drop all their flags, though they can play the same trick on you as well. Two-player action is accommodated in the Versus Mode, with either a one-on-one or flag race. Smurfs include Papa, Smurfette, Cook, Jokey, Hefty, Harmony, Handy, Painter, Wild, King, Super Drive, and Astro, with the last four comprising the hidden characters. Brainy guides you through Smurf Village, The Big Castle, The Forbidden Zone, and Astro Smurf's Challenge. Featured items include firecrackers, red rockets, magic potion bottles, and special attacks unique to each Smurf. This kart racer features the Smurfs as characters. Choose one of eight (with four secret) characters to race with among various climates and regions. You can race in single player or championship modes, along with a Capture the Flag-style Flag Race.", "platform": "Sony Playstation", "release_date": "March 29, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Artificial Mind & Movement", "publishers": "Infogrames", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.34", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Y7f5_72v4Hg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11174-smurf-racer\n"}