{"altername_name": [], "name": "Snatcher", "overview": "Snatcher is a cyberpunk-themed graphic adventure game produced by Konami, originally released in Japan for the NEC PC-8801 and MSX 2 computer platforms in 1988. It was followed by a CD-ROM-based remake released for the PC Engine video game console in 1992, which was subsequently ported and localized into English for the Mega-CD/Sega CD in 1994. Snatcher was the second video game written and directed by Hideo Kojima, following the original Metal Gear for the MSX2. The game's story centers around an investigator named Gillian Seed, who is assigned to investigate a breed of bioroids known as \"Snatchers\", who are killing humans and taking their place in society. The game borrowed elements from the cult film Blade Runner. GAMEPLAY: The game is set in a primarily first person perspective and uses a menu-based interface that allows the protagonist (Gillian Seed) to interact with his environment. The player can choose to \"Look\", \"Investigate\", \"Talk\", \"Ask\" and \"Move\" (in addition to other options) to acquire key items or receive vital information from other characters. The player can analyze items in Gillian's belongings or show it to other characters. The player uses Metal Gear (Gillian's robotic assistant) to communicate with other characters via a videophone or save their current progress. During key points of the game's story, the player must pass shooting sequences to defend Gillian from assailants. These shooting segments uses a 3x3 grid which the player can target to fire at enemies. A shooting trainer, called \"Junker's Eyes\", is accessible at Junker HQ that allows the player to measure their accuracy. STORY: On June 6, 1996 (1991 in the Japanese versions), a chemical weapon known as Lucifer-Alpha under development in Chernoton, Russia, is released into the atmosphere, resulting in the death of 80% of the Eurasian population which in turn results in the death of half of the world's population. The contaminated area becomes uninhabitable for a decade, when Lucifer-Alpha mutates into a non-lethal form. This tragic event later becomes known as \"the Catastrophe\". Fifty years later, a breed of artificial life-forms or bioroids known as \"snatchers\" began appearing in the artificial island of Neo Kobe City, killing their victims and taking their place in society. Nobody knows exactly what they are or where they come from. As Gillian Seed, an amnesiac working for an Anti-Snatcher task force called J.U.N.K.E.R., the player's goal is to track down the source of the snatchers and discover Gillian's mysterious connections with them. In 1996, Snatcher was ported to the PlayStation (February 12) and Sega Saturn (March 29). These two 32-bit versions added slightly redone graphics, a CG animated opening and other subtle changes (most of them derived from the English Mega-CD version). Most of the graphic violence were censored, the talking heads (when a character spoke) were completely redrawn, and the music was completely remixed.", "platform": "Sony Playstation", "release_date": "February 16, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.94", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112363-snatcher\n"}