{"altername_name": ["SnoBow Kids Plus"], "name": "Snowboard Kids Plus", "overview": "Snowboard Kids Plus\" (スノボキッズプラスsunobo kizzu purasu; スノボ is a shortening of スノボード?), is an enhanced port of Snowboard Kids released as a Japanese-excluvise title for the original Playstation. It adds an additional four characters (three default, one secret), changes part of the soundtrack, enhances some of the visuals in the courses, and gives more options to further customize the characters. Plus incoporates the following changes from the N64 original: - Nicole Couch, Pamela Rasteri, and Ruby Green are added as playable characters. - Additionally, a second secret character, Kaede, is unlocked by finishing the game as one of the starting eight characters. Shinobin is still available, but the game must be conqured a second time as Kaede for Shinobin to become available. - A FMV intro replaces the original opening sequence. Also, there are several different cutscenes that use still images to describe the plot, and each of the ten character's endings. - The menus are updated, with different visuals. - Because of the Playstation's resolution and frame rate, the gameplay is slightly slower, and the characters appear to be more blocky. - If the player switches characters in single player, the \"Battle Mode\" progress is not carried over, as each character has their own ending. - When the player crosses the finish line when not on the final lap, the computer (by choice) takes over control of the player's character so that it can get him/her on the lift as soon as possible. If necessary, it will use items. Once the player arrives back at the top of the course, the player regains control. - In Mr. Dog's shop, there are sixteen different paint styles of boards, rather than fourteen. - In Mr. Dog's shop, the player can enter a \"Wear Booth\" and \"Bleach Booth\" to give the characters different hair colors/patterns and clothing.", "platform": "Sony Playstation", "release_date": "January 21, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Racdym", "publishers": "Atlus", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Snowboard_Kids", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104176-snowboard-kids-plus\n"}