{"altername_name": [], "name": "Sotsugyou Vacation", "overview": "Sotsugyou Vacation is an adventure, and \"gal get\" (love simulation) game in the Sotugyou -Graduation- series of games. The goal of the game is to find a treasure on a southern island, and also become friends with the girls. The playstation game was released on 1997.10.16. The first edition came with a 50 page Character Guide Book. The game features 10 different mini games and unlockable character artworks. STORY: The player is on a southern island called Suzunari Jima. The 15 girls from Seika Joshi high school are also on the island for summer vacation. The game starts as the master of the hotel tells a story of a hidden treasure on this island. Since many of the girls are pretty bored on the island, they decide to go look for the treasure. Each day, the girls break up into several groups, and go looking for clues in finding the treasure. There are ten different locations on the island, and there are three times during the day (morning, noon, afternoon) that the player/girls can go to these locations. Then during dinner, everyone talks about what happened that day and makes plans for the next day. Even though the girls make plans for the next day, they don't necessarily have to go there. Also since there are three times during the day, the girls will visit other locations too. GAMEPLAY: The basic idea of Sotsugyou Vacation is to go to the various locations during the day, to look for clues of the treasure, and to become friends with the girls. The game takes place from August 2 to August 30. At dinner time, the girls will all gather and talk about the day's events and the next day's plans. There will be seven \"groups\" every day. (Three of the girls going out alone, two pairs, and two larger groups.) Each group will plan to go to a certain location, and will usually go there once during the day (either morning, noon, or afternoon). Each day, the player chooses which location he wants to go to in the morning, noon, and afternoon. He can go to the same location every time, or different locations. The player's previous actions don't affect which locations the girls go to. But the player's actions do affect what happens when you meet the girls. The daily events of the player are as follows. * choose the location for the morning * choose the location for noon * choose the location for the afternoon * listen to the girls at the dinner table * [option] save the game, modify game settings * [sometimes] one of the girls come to talk * sleep", "platform": "Sony Playstation", "release_date": "October 16, 1997", "game_type": "Released", "esrb": "", "developers": "MyCom", "publishers": "Mycom", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112401-sotsugyou-vacation\n"}