{"altername_name": ["Armored Trooper Votoms: Lightning Slash"], "name": "Soukou Kihei Votoms: Lightning Slash", "overview": "Armored Trooper VOTOMS is a 52-episode anime television series, created by Ryosuke Takahashi and Sunrise, aired in Japan from April 1, 1983 to March 23, 1984 on TV Tokyo. The series followed a main character named Chirico Cuvie (Kiriko Kyuubi), a former special forces Armored Trooper pilot and former member of the Red Shoulder Battalion, an elite mecha force used by the Gilgamesh Confederation in its war against the Balarant Union—both interstellar nations within the distant Astragius Galaxy. Gilgamesh and Balarant had until recently been locked in a century-old galactic war whose cause was long ago forgotten. Now, the war is ending and an uneasy truce has settled. Mecha design by Kunio Okawara. High resolution AT's beautiful to the limit of realism! Customize to a greater degree then before in Berserga Story! In 2 player compettition of course 2 on 2 tag battling is possible. Not just AT's but helicopter, tank, and various kinds of shock troops are available. Soukou Kihei Votoms - Lightning Slash is one of the games released for the Playstation One console based on the anime series. The game features these game modes: - Story Mode - Battling Mode - Vs Mode - Survival Mode Manufacturer's description: Mechanical design is Kunio Okawara. A. Everything that is displayed in high resolution * T. Beautiful, infinitely real! Customize provide more flexible than previous story Beruzeruga *! * 2P Battle, as well as pigeon ring tag can be two pairs of two. * A. T. Not only opponent, helicopters, fighting against foreign partner can also tank. You have a war of the rings battle in every power-up. Features: First & Third person perspectives. 2D & 3D graphics Cartoon graphics SCI-FI, Futuristic & Anime themes.", "platform": "Sony Playstation", "release_date": "March 18, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Takara", "publishers": "Takara", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135244-soukou-kihei-votoms-lightning-slash\n"}