{"altername_name": ["装甲騎兵ボトムズ-ウド・クメン編-", "Soukou Kihei Votoms - Woodo Kummen"], "name": "Soukou Kihei Votoms: Uoodo-Kummen Hen", "overview": "Armored Trooper VOTOMS is a 52-episode anime television series, created by Ryosuke Takahashi and Sunrise, aired in Japan from April 1, 1983 to March 23, 1984 on TV Tokyo. The series followed a main character named Chirico Cuvie (Kiriko Kyuubi), a former special forces Armored Trooper pilot and former member of the Red Shoulder Battalion, an elite mecha force used by the Gilgamesh Confederation in its war against the Balarant Union—both interstellar nations within the distant Astragius Galaxy. Gilgamesh and Balarant had until recently been locked in a century-old galactic war whose cause was long ago forgotten. Now, the war is ending and an uneasy truce has settled. The PSX version featured the anime of Votoms brought to \"realistic 3D shooting action\"! Various missions in 10 stages. Scenario supervisor director Ryusoke Takahashi. The Votoms world in full 3D polygons! Including the AT31 series. The armored trooper movement faithfully reproduced. Tune up your AT's for facing missions! The character voices are from the TV anime! Manufacturer's description: 3D robot action game renowned as a masterpiece of animation \"Votoms\". The re-edit the game for TV version Story \"Udo\" and \"cumene\" Hen. Aircraft mission set by disk movement and (Armored Trooper) unique AT also fully reproduced! You can manipulate the AT, to defeat the enemy looming, and let's clear the mission given! Features: Third person perspective 3D graphics SCI-FI, Futuristic & Anime themes.", "platform": "Sony Playstation", "release_date": "April 2, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Takara", "publishers": "Takara", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135242-soukou-kihei-votoms-uoodo-kummen-hen\n"}