{"altername_name": ["Armored Trooper Votoms: Steel Force", "装甲騎兵ボトムズ 鋼鉄の軍勢"], "name": "Soukou Kihei Votoms: Koutetsu no Gunzei", "overview": "Armored Trooper VOTOMS is a 52-episode anime television series, created by Ryosuke Takahashi and Sunrise, aired in Japan from April 1, 1983 to March 23, 1984 on TV Tokyo. The series followed a main character named Chirico Cuvie (Kiriko Kyuubi), a former special forces Armored Trooper pilot and former member of the Red Shoulder Battalion, an elite mecha force used by the Gilgamesh Confederation in its war against the Balarant Union—both interstellar nations within the distant Astragius Galaxy. Gilgamesh and Balarant had until recently been locked in a century-old galactic war whose cause was long ago forgotten. Now, the war is ending, and an uneasy truce has settled. Mecha design by Kunio Okawara. High resolution AT's beautiful to the limit of realism! Customize to a greater degree than before in Berserga Story! In 2 player compettition of course, 2 on 2 tag battling is possible. Not just AT's but helicopter, tank, and various kinds of shock troops are available. Soukou Kihei Votoms - Koutetsu no Gunzei (Armored Trooper Votoms - Steel Force) is one of the games released for the Playstation One console based on the anime series, this time instead of the usual 3d action game the game is a tactical RPG with the usual limited range of movement for the player units in each turn and different attacks. Manufacturer's description: Just like a battle scene to produce a variety of anime camera work! Significant impact on combat between individuals of the pilot? Operation on a 3D terrain map representation. Win case using the height difference! Given the damage to the enemy in conjunction with colleagues' attacking aid, \"can be!\" According to the pilot and the AT mission, ?Seru a variety of customized weapons. Features: Third-person perspective. 3D graphics Cartoon graphics SCI-FI, Futuristic & Anime themes.", "platform": "Sony Playstation", "release_date": "September 30, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Takara", "publishers": "Takara", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135245-soukou-kihei-votoms-koutetsu-no-gunzei\n"}