{"altername_name": [], "name": "Sound Novel Evolution 2: Kamaitachi no Yoru Tokubetsu Hen", "overview": "Kamaitachi no Yoru (\"The Night of the Sickle Weasels\"?) is a sound novel developed and published by Chunsoft. The game was first released on November 25, 1994 for the Super Famicom. It became available on the Virtual Console in February, 2007 for 800 Wii Points. The story-line was written by Takemaru Abiko and production was directed by Kazuya Asano and Koichi Nakamura. Kamaitachi no Yoru was the second sound novel developed by Chunsoft, and its popularity brought a myriad of other companies to develop similar games. The term \"sound novel\" was originally a registered trademark of Chunsoft, but is now regarded as a whole genre of its own. The game sold close to a million copies (including remakes and ports), making it a financial success as well. The game revolves around Toru and his girlfriend Mari, who are suddenly drawn into a horrible murder mystery while on vacation at a skiing lodge. The first part of the games develops as a crime-solving adventure. Additional murders occur if the player is unable to find clues, and the story culminates into a horror movie-esque ending. When the player completes the main story with a certain number of different endings, two additional stories (the occult chapter and spy chapter) are unlocked. When all three stories are finished with every possible ending, two more self-parodical stories also become available. Fulfilling one final requirement allows the player to unlock a parody of Torneko no Daiboken: Fushigi no Dungeon. The additional stories cover a wide variety of themes, and are completely unrelated to each other and to the main story. Though the same set of characters is used throughout the game, the character settings differ significantly in each story. CHARACTERS: * Toru: The main character of the game. He was given the name Toru Yajima in later instalments, but was simply referred to as \"Toru\" in the original version. He has a one-sided crush on Mari, and was overjoyed when she invited him to go on a skiing trip with her. * Mari: The heroine of the story. She was given the name Mari Kobayashi in later instalments, but was simply referred to as \"Mari\" in the original version. She attends the same college as Toru, and her uncle owns a ski lodge in Shinshu. It is yet to be known whether she has feelings for Toru. PlayStation version: * A flow chart was added, and choices were colored according to whether they had been chosen in previous playthroughs. The player may also replay past scenes. * Vibration added. * Two more additional stories were added. * Changes in unlocking the extra story-lines and parodies. * Improved graphics. * Added background information on characters. Manufacturer's description: Packed with tips for solving mysteries! ! Journal unpublished novel version of game! ! Now is a criminal who is. Features: •First person perspective. •2D graphics •Cartoon graphics •Mystery theme.", "platform": "Sony Playstation", "release_date": "March 12, 1998", "game_type": "Released", "esrb": "", "developers": "Chunsoft", "publishers": "Chunsoft", "genres": "", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135203-sound-novel-evolution-2-kamaitachi-no-yoru-tokubetsu-hen\n"}