{"altername_name": ["Space Invaders X"], "name": "Space Invaders", "overview": "First Contact occurred November 22nd, 1978. It was then that the original Space Invaders hit the Arcades in full force, wrenching millions of quarters from gamers' pockets. Wave after wave of alien invaders descended from the heavens in precise rows, pouring missiles upon an all but helpless Earth. If it weren't for the experimental Tanks (originally called Laser Bases), which had been created by our xenophobic government years before, humanity would have fallen prey to these ominous galactic beings. Guided by the hands of skilled gamers across the nation, these tanks were instrumental in shooting the aliens out of the skies. Countless tank pilots lost their lives, but in the end, we won the battle and Earth returned to a state of (relative) normalcy. Flash forward 21 years and the aliens have returned. Just like those in the original Space Invaders, these aliens begin at the top of the playfield, march in rows from side to side and descend to the bottom of the screen. Beginning with Pluto, this new alien invasion is headed for Earth. Luckily, using the wreckage from the destroyed aliens from the original invasion, the government has been at work the last couple of decades on a new kind of tank. The new Tank was born complete with hover capability, multi-adaptive hard-points and an electromagnetic shielding system powered by a nuclear core. Your job in this updated-for-the-'90s version of Space Invaders is to maneuver the newly designed Tank horizontally along the bottom of the playfield and blast enemies out of the sky. Each time you destroy a wave of invaders, a new wave appears. Between stages (planets) you must face a giant boss. There are 13 enemy species and more than 100 levels, including hidden worlds and the original Space Invaders game. Scoring 50,000 will net you an extra tank. You can also earn extra tanks in the bonus stage. Unlike the original Space Invaders, which consisted of standard slide-and-shoot action (using a single type of missile), this game is loaded with power-ups. You can retrieve shields, double shots, timestops and energy boosts from the mother ship. Destroyed aliens provide vertical blasts, horizontal bursts, diagonal bursts, swarm missiles, fat lasers, boomerang bombs, acidic clouds and other powerful weaponry. The original game had bunkers for defense in every wave while this version offers blockades that appear in some levels. You can shoot the blockades upwards, into the aliens' path. Space Invaders offers a two-player simultaneous mode in which players cooperate against the aliens, but there is no two-player alternating mode like in the original. Manufacturer's description: Battle squadron after squadron of alien forces as they pulse down through the menacing sky. No time to stop! You can't look away! The pressure's on: You've got a galaxy to save. Stop the alien invasion! Frenetic Action Hunt for power-ups, hidden worlds, and a replica of the arcade original in over 100 explosive 3-D levels. Menacing Bosses Test your rapid-fire skills against 13 enemy species and huge alien bosses on 10 distinct space worlds. Multiplayer Alienfests Play with a friend and go for the high score in two-player cooperative blast-a-thons.", "platform": "Sony Playstation", "release_date": "September 30, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Z-Axis", "publishers": "Activision", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.06", "wikipedia": "https://en.wikipedia.org/wiki/Space_Invaders_DX", "video_link": "https://www.youtube.com/watch?v=CCQQ5EKuCAk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11179-space-invaders\n"}