{"altername_name": ["Uchuu Senkan Yamato: Haruka naru Hoshi Iscandar"], "name": "Space Battleship Yamato Distant Iskandar", "overview": "Space Battleship Yamato Distant Iskandar (also known as Uchusenkan Yamato - Harukanaru Iskandar) is a Japanese science fiction anime series and the name of its eponymous space craft. It is also known to English-speaking audiences as Space Cruiser Yamato or Star Blazers; an English-dubbed and partly edited version of the series was broadcast on American and Australian television under the latter title. Set in the year 2199, an alien race known as the \"Gamilas\" are raining radioactive bombs on Earth, rendering the planet's surface dead and uninhabitable. Humanity lives in refuges built deep underground, but the radioactivity is slowly infiltrating the underground cities too. Earth's space fleet is hopelessly outclassed by the Gamilas and all seems lost until a mysterious space probe is retrieved on Mars. Blueprints for a faster-than-light engine are discovered, and a message from Queen Starsha of the planet Iscandar in the Large Magellanic Cloud says that she has a device, the Cosmo-Cleaner D (Cosmo DNA), which can cleanse Earth of its radiation damage. The inhabitants of Earth secretly convert the ruin of the Japanese battleship Yamato into a massive spaceship, the Space Battleship Yamato of the title. Using Starsha's blueprints, they equip their new ship with a space warp drive and a new, incredibly powerful weapon called the \"wave motion gun\" that fires out the bow. The Playstation game is based on the first television series of Yamato. Refitting an old Earth battleship, the Yamato, the Star Force takes off on a 148,000 lightyear voyage to the planet Iscandar, where Queen Starsha offers the people of Earth a machine to remove the radiation. The Star Force must battle the evil Gamilons to reach Iscandar and return within one Earth year! Hurry Star Force, there are only 365 days left!", "platform": "Sony Playstation", "release_date": "February 4, 1999", "game_type": "Released", "esrb": "", "developers": "Vingt-et-un Systems", "publishers": "Bandai", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113206-space-battleship-yamato-distant-iskandar\n"}