{"altername_name": ["PlayStation Comic: Space Adventure Cobra: Galaxy Nights (Japan)"], "name": "Space Adventure Cobra: Galaxy Nights", "overview": "Cobra is a space-opera manga series written and illustrated by Buichi Terasawa of the Black Sheep studio, originally appeared in serialized form in the Japanese shonen manga magazine Weekly Shonen Jump from 1978 to 1984. The individual chapters were collected and published in 18 tankobon volumes by Shueisha. The series follows the adventures of Cobra who lived an ordinary life until enemies started to hunt him down. Cobra surgically alters his face, and erases his own memory to hide from his enemies. Cobra starts to regain his memories and then unites with his old partner Lady Armaroid, and his ship Tortuga. Later in his adventures, Cobra meets the Royal sisters whose map-tattoos lead to treasure. The Cobra manga has also spawned nine sequel series, as well as one-shots serialized in Super Jump and Monthly Comic Flapper. The manga later served as the basis for a feature-length film adaptation, for a 31-episode anime series that retells the film's story, and for two original video animations. In 1990 Viz Media published part of the manga in the United States in twelve 48-page volumes. The full series was published in France by Dybex and later Taifu Comics, in Sweden by Epix Förlag, and in Taiwan by Tong Li Publishing. The series has received mixed reviews from critics. PLOT: Johnson, a worker for a futuristic trade-company, got woken up on a Sunday morning by his robotic maid, Ben. Ben suggested that Johnson go to the Trip Movie Corporation (T.M. Company), a company that lets its guests experience a dream as if it were real. Johnson asked to be the king of Harlem, surrounded by beautiful women, and commanding a battlestar. In his dream, Johnson as \"Cobra\" explored space with his partner Lady Armaroid. Cobra wielded the \"Psychogun\" and fought off monsters from other planets and most of all the Pirate Guild, the leader being Captain Vaiken whom he let loose. Vaiken distributed Cobra's picture to all the other pirates making him a wanted man. When the dream ended a women asked Johnson how the dream was, Johnson responding, and the woman correcting to the fact it should have been about him being the king of Harlem. On Johnson's way back home, he crashed into a man speeding in his car. He recognized the man, who looked identical to Captain Vaiken. Johnson started explaining how he looked like Vaiken right in front of him, thus making Vaiken think he knew something about Cobra. Johnson unconsciously lifted his right arm as if he had a gun. Johnson shot a ray out of his hand, killing Vaiken. The shot blew up his arm, revealing the Psycho-gun. Johnson hurried back home, where Ben noticed his arm and Johnson realized that he did not remember anything from the last three years that he had lived in his house. Johnson looked into a mirror, which he turned a nob to reveal a secret room behind it, which he looked inside to see his revolver which he used in his dream. Lady Armaroid came out from hiding within Ben. Johnson started to remember more, and at that moment many people were recruited by the Pirate Guild to come in and kill Johnson. Johnson killed the recruited people and started to remember that he is Cobra and he was wanted by the Pirate Guild and he was sick of fighting them off. In order to get away from them, Cobra surgically altered his face and had his memories erased. Lady Armariod told Cobra that Trip Movie triggered his sub-conscious and instead brought back old memories. Once more, Lady Armaroid and Cobra set off to all the adventures that come forth. Cobra later meets Jane Royal, one of the Royal sisters, in a bar. Jane Royal teams up with Cobra and Lady to find the other two Royal sisters, whose tattoo maps lead to the greatest treasure in the whole universe. Space Adventure Cobra - Galaxy Nights is an interactive comic game in which the player can select what chapter to view and there is also an auto play function.", "platform": "Sony Playstation", "release_date": "February 18, 1999", "game_type": "Released", "esrb": "", "developers": "Arc Entertainment", "publishers": "Sony", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112408-space-adventure-cobra-galaxy-nights\n"}