{"altername_name": [], "name": "Space Invaders 2000", "overview": "Space Invaders is an arcade video game designed by Tomohiro Nishikado, and released in 1978. It was originally manufactured and sold by Taito in Japan, and was later licensed for production in the United States by the Midway division of Bally. Space Invaders is one of the earliest shooting games and the aim is to defeat waves of aliens with a laser cannon to earn as many points as possible. In designing the game, Nishikado drew inspiration from popular media: Breakout, The War of the Worlds, and Star Wars. To complete it, he had to design custom hardware and development tools. It was one of the forerunners of modern video gaming and helped expand the video game industry from a novelty to a global industry (see golden age of video arcade games). When first released, Space Invaders was very successful and popular. Following its release, the game caused a temporary shortage of 100-yen coins in Japan, grossed US$2 billion in quarters by 1982, and by 2007 had earned Taito over $500 million in profits. Guinness World Records ranks it the top arcade game. The game has been the inspiration for other video games, re-released on numerous platforms, and led to several sequels. The 1980 Atari 2600 version quadrupled the system's sales and became the first \"killer app\" for video game consoles. Space Invaders has been referenced and parodied in multiple television shows, and been a part of several video game and cultural exhibitions. The pixelated enemy alien has become a pop culture icon, often used as a synecdoche representing video games as a whole. Space Invaders was created by Tomohiro Nishikado, who spent a year designing the game and developing the necessary hardware to produce it. The game's inspiration is reported to have come from varying sources, including an adaptation of the mechanical game Space Monsters released by Taito in 1972, and a dream about Japanese school children who are waiting for Santa Claus and are attacked by invading aliens. However, Nishikado has cited Atari's arcade game Breakout as his inspiration. He aimed to create a shooting game that featured the same sense of achievement from completing stages and destroying targets, but with more complex graphics. Nishikado used a similar layout to that of Breakout, but altered the game mechanics. Rather than bounce a ball to attack static objects, players are given the ability to fire projectiles at their own discretion to attack moving enemies. GAMEPLAY: Space Invaders is a two-dimensional fixed shooter game in which the player controls a laser cannon by moving it horizontally across the bottom of the screen and firing at descending aliens. The aim is to defeat five rows of eleven aliens - some versions feature different numbers - that move horizontally back and forth across the screen as they advance towards the bottom of the screen. The player defeats an alien, and earns points, by shooting it with the laser cannon. As more aliens are defeated, the aliens' movement and the game's music both speed up. Defeating the aliens brings another wave that is more difficult, a loop which can continue indefinitely. PLAYSTATION GAME: Space Invaders 2000 for Playstation features a complete arcade machine conversion, featuring all the original arcade artworks, and 3 game modes: - Original mode: The arcade machine conversion - VS-Battle mode: Play againts another human player in a plit screen mode. - Time Attack mode: The new game mode only avaliable in this 2000 version", "platform": "Sony Playstation", "release_date": "December 3, 1998", "game_type": "Released", "esrb": "", "developers": "Taito", "publishers": "Taito", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112426-space-invaders-2000\n"}