{"altername_name": [], "name": "Spriggan: Lunar Verse", "overview": "Spriggan - Lunar Verse is an action game based on the manga series \"Spriggan\" written by Hiroshi Takashige and illustrated by Ryoji Minagawa during the early 1990s. It was initially released as Striker in the North American English translation, as it is the English translation of the word Spriggan from Celtic. Spriggan takes places in the last years of the Cold War where mysterious and unknown artifacts called out-of-place artifacts (OOPArt) are discovered in various parts of the world, leading to a secret war between various forces against the ARCAM Corporation, an organization that placed itself the guardians of the OOPArts in order to prevent them from being used as weapons. Spriggan was serialized in Shogakukan's manga magazines Weekly Shonen Sunday and Shonen Sunday Super. The manga was adapted into an anime film by Studio 4°C in 1998. A PlayStation game called Spriggan: Lunar Verse was also based on the manga with some material created for the game. PLOT: Many years ago, an ancient civilization known for their advanced technology once ruled Earth, but were destroyed in the end by their misuse. So, they left messages for later generations in the form of indestructible message plates written in ancient Hebrew, informing them that if they could not find a good use for their creations, they should be destroyed. Various paramilitaries, national armies, and armed private forces began to secretly search for these \"mysterious artifacts\" in order to be used for their own good and against their enemies. The ARCAM Corporation and their military arm, the ARCAM Private Army, can stop these forces from destroying themselves with their elite secret agents known as Spriggans (or Strikers). GAME: On June 16, 1999, From Software released a video game adaptation in Japan and Asia of Spriggan for the PlayStation named Spriggan: Lunar Verse with an initial street price of ¥6,090. It can be played by either one or two players. The game is divided into 16 missions all of them full of action. A soundtrack of the game, composed by Keiichiro Segawa, Tsukasa Saito, and Yuji Kanda, was also released by Absord Music Japan on November 26, 1999. Manufacturer's description: This popular comic work, \"Spriggan\" (the book form of sales 8,000,000) based on a view of the world, Takashi Tschugge authorship is an action battle game developed with both men completely original story under the supervision Ryoji Minagawa. This work was included and plenty of action patterns that are represented in full polygonal graphics are fully reproduced the atmosphere of the original. Players can grow into any character you like the power of my hero dispatched.", "platform": "Sony Playstation", "release_date": "July 16, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "FromSoftware", "publishers": "FromSoftware", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Spriggan_(manga)#Video_game", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134348-spriggan-lunar-verse\n"}