{"altername_name": ["Star Gladiator: Episode I: Final Crusade"], "name": "Star Gladiator: Episode 1: Final Crusade", "overview": "Star Gladiator Episode I: Final Crusade is a 1996 weapon-based 3D fighting game released by Capcom for the PlayStation-based ZN-1 arcade hardware. It was Capcom's first polygonal fighting game, preceding the original Street Fighter EX (which Capcom co-produced Arika) by a few months. A PlayStation port was released on November 1996. It was followed by a single sequel, Plasma Sword, in 1999. Star Gladiator gives players the option of choosing 10 unique and personable characters, each with their own style of fighting and plasma weapon at their disposal. Moves are similar to executing fireballs and uppercuts in the Street Fighter series, and the game has many combos and super moves unique to each character. Fighting arenas consist of a fixed platform that each player can be knocked off of for a ring-out. The environments are composed entirely in 3D, allowing players to step in and out of the foreground at will while battling each other. Also available is a Vs. mode for two player action, as well as a Team Battle mode where players choose a certain number of opponents per team and square off to see who the last man standing is. Characters are saved using one block of memory on the Playstation memory card. STORY In the year 2348, humans have been exploring space for the past four centuries, and have established contact with various alien civilizations. People now emigrate from one planet to another, and life is generally good. However, all of that changes when Dr. Edward Bilstein, a Nobel Prize-winning physicist, uncovers the secret to humanity's \"sixth sense\" and discovers how to use it as an energy source he calls \"Plasma Power\". Within time, Bilstein develops ambitions of universal conquest and now seeks to conquer the entire galaxy in his own accord. After failed attempts to coerce other Plasma wielders to join him in taking over the Earth, Bilstein is captured by the authorities of the Earth Federation for his inhuman heinous crimes in experimenting on innocent people with his Plasma Power and he is imprisoned in a satellite orbiting Planet Zeta. Six years later, Bilstein has built himself a powerful cyborg body and managed to escape from his prison, gathering a cadre of Plasma mercenaries at his side. After making quick work of Zeta's defenses, Bilstein sets his eyes on Earth and hopes to conquer it in due time. A panicked Earth Federation has only one recourse: to find people who could utilize Plasma Power in their own accord and attempt to stop Bilstein in a last, desperate effort before the mad genius can invade Earth with his nascent Fourth Empire.", "platform": "Sony Playstation", "release_date": "November 10, 1996", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.72", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13125-star-gladiator-episode-1-final-crusade\n"}