{"altername_name": ["Street Fighter Zero 2"], "name": "Street Fighter Alpha 2", "overview": "This is the sequel to Street Fighter Alpha. Essentially, the Alpha series, known to some as Street Fighter Zero, takes place before the more popular Street Fighter II. However, many of the characters are the same. In both games are the following characters: Akuma (the boss in Street Fighter 2:CE, and later versions), Chun Li, Dhalsim, Ken, M. Bison, Ryu, Sagat, and Zangief. Some *new* (really older) characters are Adon, Birdie, Charlie, Dan, Gen, Guy, Rolento, Rose, Sakura, and Sodom. All of these supposed new characters are much the same as the others. They all have the same special move type motions, fireballs, hurricane kicks, and the like. Also, specially for the Alpha series, Alpha 2 has the Alpha Counter. The Alpha Counter is a special move that allows the character to perform a quick counter move against a vulnerable opponent. A quarter circle motion from back to down is used when you block your opponents attack. Just about everything else in Alpha 2 is your regular Street Fighter fare. The modes are as follows: Arcade, Versus, and Training, in which you can perfect all of your special moves and combos. There is also an options mode, as well as a backup mode to save all those top ten scores. The major difference is the loss of chain-combos and the gain of a custom combo system. Once you reach the required level (which is 1 at the least) you can execute a custom combo by combining any of the buttons (which there are 6 in total) or any of the special attacks (fireballs, etc.)", "platform": "Sony Playstation", "release_date": "August 9, 1996", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.87", "wikipedia": "https://en.wikipedia.org/wiki/Street_Fighter_Alpha_2", "video_link": "https://www.youtube.com/watch?v=NJwRcmKlH3o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10977-street-fighter-alpha-2\n"}