{"altername_name": ["Street Fighter Zero 3", "ストリートファイターZERO3"], "name": "Street Fighter Alpha 3", "overview": "Capcom's Street Fighter Alpha 3 marks a return of the legendary 2D fighting series complete with the characters of yore combined with new fighters and a plethora of gameplay options, modes, and hidden goodies. E. Honda, Blanka, and Fei Long are among the fighters making a grand return to action with newer characters Cody (from Final Fight lore) and Juni; there is a total of 31 initially playable characters and many more waiting to be found. There are a few gameplay options to choose from including Arcade, Versus, and the new console exclusive World Tour, Entry, and Training modes. The Arcade mode is exactly what the name implies -- a conversion of Street Fighter Alpha 3 from the Arcades with new and improved lighting effects. Training is there for new players to learn various combinations and moves. Once you learn those moves, try challenging a friend in the Versus mode to show off some newfound skills! The real meat and potatoes of Street Fighter Alpha 3 comes in the form of a World Tour Mode where secret characters are unlocked, and each fighter raises his or her fighting abilities. Each character has three distinctive fighting styles, or \"isms,\" to choose from; the \"X-ism,\" \"A-ism,\" and \"V-ism\" all work differently and will significantly alter the way your character fights. Depending on which \"ism\" is chosen, the characters will be awarded different skills such as the ability to pull off certain combos, inflict dizziness, strength increases, etc. Like Soul Blade's various story missions, the World Tour Mode will place characters in unique situations that thoroughly test a player's skills. At times, you'll have to fight a multitude of characters at one time (sort of like an endurance mode), beat characters using only super combos, regular combos, and throws. As incentive to play the World Tour Mode, players can save their strengthened up characters in the Entry mode. By saving your characters in the Entry mode, new characters, skills and gameplay options will be unlocked. Features: Choose from more than 30 different characters from the Street Fighter universe New enhanced game modes like World Tour mode and 3-player battle Each character battles with three unique fighting styles", "platform": "Sony Playstation", "release_date": "May 5, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.19", "wikipedia": "https://en.wikipedia.org/wiki/Street_Fighter_Alpha_3", "video_link": "http://www.youtube.com/watch?v=4NKbNyHSaeQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8044-street-fighter-alpha-3\n"}