{"altername_name": ["Street Boarders", "Simple 1500 Series Vol.047: The Skateboard", "Street Skater"], "name": "Street Sk8er", "overview": "Take to the streets on one of ten stylin' boards in the first skateboarding game for the PlayStation, courtesy of Electronic Arts and Micro Cabin. Two variations of play include the Street Tour Mode, where you skate through three 3D courses trying to pull off as many tricks as you can within a time limit, and Free Skate Mode, where you either play for points or practice your moves without worrying about the clock. Skaters can also play against a friend in Versus Mode to see who can pull off the most tricks. Street Sk8ter features 200 different moves and combinations to perform while racing, each of which earns your skater points depending on its level of difficulty. Of course, if you wipe out, you'll have points deducted from your score. Three other \"traditional\" areas are available, including a Half-Pipe, Big Air and Bowl. The main aspect of the game is the Street Tour, which is structured similar to a racing game: weave your way down sidewalks and streets, pass through checkpoints to extend your time, and finish before the clock winds down to zero. Along the way there will be plenty of opportunities to catch some air and perform tricks with the pad. The goal is to score as many points as possible with one of four alter-egos: TJ, Jerry, Ginger and Frankie. Each skater also differs in style (Goofy or Regular) and has individual ratings in jump power, cornering, maximum speed and acceleration. Playing through the Street Tour with different characters allows you to open up additional routes, unlock bonus skaters and reveal new decks (designs on the main platform area of a board). You'll even get to increase your character's overall ratings! After finishing each course, players will also be able to watch their performance on instant replay. Other notable features include: Dual Shock Controller support (vibration only), best times saved to memory card, an announcer, deck graphics from Powell Skateboards, and twelve alternative music tracks from bands under the Epitaph and Capitol Records labels.", "platform": "Sony Playstation", "release_date": "January 1, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Atelier Double", "publishers": "Electronic Arts", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.9", "wikipedia": "https://en.wikipedia.org/wiki/Street_Sk8er", "video_link": "https://www.youtube.com/watch?v=lhYIztXVLOQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13113-street-sk8er\n"}