{"altername_name": ["Street Skater 2", "Street Boarders 2"], "name": "Street Sk8er 2", "overview": "Grab your skateboard and be prepared to grind the rails and grab some big air! Street Sk8er 2, the sequel to the first-ever skateboarding game for the PlayStation has finally arrived. More than an upgrade to the 1999 hit Street Sk8er, with Street Sk8er 2 you can now design and compete in your own skate park, hit wide-open skating arenas in five international cities and play with 10 all-new customizable characters. With Street Sk8er 2, quarter pipes, half pipes, bowls, rails and ramps can be placed in any manner within the abandoned warehouse that serves as the skate parks' home. Killer combinations can be created (such as a long rail grind straight into a bowl, or ramp up into a quarter pipe). Spontaneity and imagination are the only tools needed to build a fun fantasy skate park. Best of all, the parks can be saved onto memory cards for trading or competing with friends. You can also skate through five major international cities, unlocking hidden bonuses as you progress. San Francisco, Moscow, Miami, Washington D.C. and London are recreated in Street Sk8er 2 for your skating pleasure. Virtually every surface on the city streets is skateable. Players can grind off the curbs on San Francisco's world-famous curvy Lombard Street, jump off cannons in Moscow's Red Square, roll over taxis in London and pull off insane tricks in the empty swimming pools of a Miami hotel. Each city is also filled with an abundance of breakable objects that can be discovered and busted for added points. There are also numerous animated objects that affect gameplay such as the moving escalators in the Moscow subway. Evade police cars chasing you in the streets San Francisco, or watch the lunar modular being launched while visiting the Smithsonian Museum in Washington D.C. Street Sk8er 2's 10 customizable characters each have individual skater attributes that affect gameplay. Certain characters may excel in speed, others may be experts in maneuvering, while still others perform the best tricks. Four characters are available at the beginning of the game and as you progress through the game others can be unlocked. Building skills such as cornering and jumping will make the characters stronger, resulting in bigger air and more time to pull off `phat' tricks. The extra skills will also enable you to reach places within each city that were previously inaccessible. Once you build up a character they can be saved onto a memory card to be played later or against friends. Street Sk8er 2 also offers 30 skateboard designs to choose from, including the latest models from Powell Skateboards. Skating takes place in three modes, Street Tour, Free Skate and Multi-player. In the five level Street Tour, you race against the clock while performing mind-boggling tricks for points through the streets of Moscow, London, San Francisco, Miami and Washington D.C. in addition to events such as Big Air, Bowl, Half Pipe, Rooftop Park and Noah's Park. In all, you will compete in 10 championship events in Street Tour. In Free Skate mode, you can explore tracks without the pressure of a timer, as well as practice moves and master courses. Multi-player mode features two-player split screen or four player serial skating action in addition to Pool Duel, a mini split screen game where the first player to break five of his opponent's boxes wins. In Street Sk8er 2, you can choose from two trick control systems that determine the difficulty of each level. Those who want to jump right into grinding heaven can select Amateur mode for easy pick up and play with over 200 tricks at the push of a button. Skaters who want more of a challenge can go for ultimate control over executing fly tricks and dope combinations in Pro mode. The soundtrack for Street Sk8er 2 includes music from seven Warner Bros. bands, including 12 songs from Deftones, Ministry, Citizen King, Showoff, Static-X, Shootyz Groove, 8stops7 and Del The Funky Homosapien. In addition, the soundtrack contains one song from the Chick Magnets, who had previously won a band search contest sponsored by Electronic Arts and Heckler Magazine.", "platform": "Sony Playstation", "release_date": "March 15, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "Micro Cabin", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "2.81", "wikipedia": "https://en.wikipedia.org/wiki/Street_Sk8er_2", "video_link": "https://www.youtube.com/watch?v=lNPKk_USWpY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/589-street-sk8er-2\n"}