{"altername_name": [], "name": "Street Fighter Collection", "overview": "Street Fighter Collection is a 1997 fighting game compilation released for the PlayStation and Sega Saturn. It collects the original Super Street Fighter II and its follow-up Super Street Fighter II Turbo, along with an enhanced version of Street Fighter Alpha 2 titled Street Fighter Alpha 2 Gold exclusive to this compilation. This compilation contains Super Street Fighter II and Super Street Fighter II Turbo (known in Japan as Super Street Fighter II X) in the first disc, with Street Fighter Alpha 2 Gold (Street Fighter Zero 2 Dash in Japan) in the second disc. The Super Street Fighter II games are ported from their original CPS II arcade versions. After selecting either game from the Street Fighter Collection title screen on the first disc, the player is taken to the attract mode from the game they have selected. Both games feature the standard \"Arcade\", \"Versus\" and \"Option\" modes. In Super Turbo, the Super Street Fighter II versions of the returning characters, as well as a hidden character Akuma, are playable through easier means compared to the ones provided in the original arcade version. This version of Super Turbo is very easy compared to the Arcade and HD Remix versions, which were both punishingly difficult. Street Fighter Alpha 2 Gold, the game on the second disc is based on Street Fighter Zero 2 Alpha, an enhanced arcade version of the original Street Fighter Alpha 2 released in Japan, Asia and South America. All the game modes and features in the previous PlayStation and Sega Saturn versions of the original Alpha 2 are featured, with the exception of the exclusive \"Gallery\" mode in the Sega Saturn version of Alpha 2. Evil Ryu, who was selectable in the Sega Saturn version of the original Alpha 2 but not in the PlayStation, is featured in both versions of the game, along with Champion Edition-style renditions of all the Street Fighter II characters featured in the game. Exclusive to this version of the game is the debut of Super Street Fighter II character Cammy in the Alpha series, who is selectable as a hidden character in the game's \"Versus\" and \"Training\" modes. The version of the Cammy is the same one previously featured in X-Men vs. Street Fighter, which depicts Cammy as a Shadaloo agent working for M. Bison before joining Delta Red.", "platform": "Sony Playstation", "release_date": "July 10, 1998", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Virgin Interactive Entertainment", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.16", "wikipedia": "https://en.wikipedia.org/wiki/Street_Fighter_Collection", "video_link": "https://www.youtube.com/watch?v=k0e4FH8WoQI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/591-street-fighter-collection\n"}