{"altername_name": [], "name": "Stressless Lesson: Les Les", "overview": "Dating sims (or dating simulations) are a video game subgenre of simulation games, usually Japanese, with romantic elements. They are also sometimes put under the category of neoromance. The most common objective of dating sims is to date, usually choosing from among several characters, and to achieve a romantic relationship. The term dating sim is also often used as a synonym for the visual novel genre. However, this is mixing genre and medium, as visual novels are considered a subgenre of adventure games and the term does not cover simulations. While the two genres often share a common visual presentation, dating sims are sometimes considered to be more statistically based than the \"choose your own adventure\" style of visual novels. Stressless Lesson - Les Les is based on those dating simulation games, but instead of being a dating simulation is a puzzle game that features 8 high school students (4 male and 4 female ones) as selectable characters and the player can choose one of them (male or female) and the desired love and to win that love, the player will have to defeat other game characters in puzzle battles. The gameplay is make different pieces of the same colour and gathering 4 of the same colour will make an attack and send pieces to the opponent, one of the features of this game is that the player when he makes combinations will increase his heart attacks points and those can be used to change the not combinative pieces into combinatives ones. To win a match the angels in the center of the screen have to be in the player's side and that can be done making pieces combinations. So this game is a curious mix of genres. Manufacturer's description: Set in high school, challenging puzzle game in order to fulfill the love of love at first sight of eight male and female characters, including a love element Tetris type game. Are expressed in the form of an internal struggle against puzzles, love rival and best friend, and we will fight minerals. Let love be fulfilled to win the final against confess. Features: First person perspective. 2D graphics Cartoon graphics High School, Romance & Anime themes.", "platform": "Sony Playstation", "release_date": "June 27, 1997", "game_type": "Released", "esrb": "", "developers": "Compile", "publishers": "Max Five", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=2I0iPEPIdzo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135068-stressless-lesson-les-les\n"}