{"altername_name": [], "name": "Stuart Little 2", "overview": "Based on the same-titled movie, Stuart Little 2 for PlayStation is a 3D adventure played out over seven levels and features Stuart, Snowbell, and their flirtatious feathered friend, Miss Margalo. One very fiendish Falcon has added jewel theft to his rap sheet, and Miss Margalo has asked Stuart and Snowbell to help her return the stolen jewels to their rightful owners. In the role of Stuart, players must collect all the jewels in each level to defeat Falcon in a final showdown. Beginning in the Little home, Stuart faces challenges such as avoiding insect enemies, collecting cat biscuits, and winning mini-games, in addition to locating all the jewels. He can perform a multitude of actions including jumping, spinning, climbing, swimming, and crawling as he makes his way through the house and later, the streets (and underground) of Manhattan. Balloons, wires, and ropes aid Stuart in his progress, along with his little red convertible and the model airplane his brother George built. A total of six jewels are located in each level and play can only proceed to the next level by collecting them all. Mini-game challenges are presented in all but the last level and include Mine Cart, Up, Up and Away, On Your Marks, Get Set, Go!, Speed to Victory, Skateboard Extreme, and Shoot to Score. If Stuart is successful at the mini-game challenges, Falcon gives up a jewelled ring. Found keys can be used to unlock Golden suitcases containing jewelled rings hidden by Falcon. Stuart's health can be drained by encounters with critters such as spiders, beetles, and flies and replenished with blue, green, and red suitcases. Levels are interspersed with movie scenes and can be returned to at any time. Checkpoints are placed randomly throughout levels, though progress can be saved to a memory card when prompted or via the pause screen. The game ends when all jewelled rings in all levels are found.", "platform": "Sony Playstation", "release_date": "July 19, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Magenta Software", "publishers": "Sony Computer Entertainment America", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.89", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=uM9jZCnJ6kU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9488-stuart-little-2\n"}