{"altername_name": [], "name": "Submarine Commander", "overview": "In submarine Commander the player takes the role of the captain of a submarine and have to complete several missions to advance in the game plot. Features: Control a nuclear powered submarine You need stealth and tactics needed for anti submarine warfare Using hi-tech weapons, sonar, radar and periscope Over 20 tense stories Manufacturer's description: A shark like figure glides through the cold dark waters of the Pacific, feeling it's way through the midnight black waters using sonar eyes. At these depths any other submarine would have it's rivets popping but you're different, you command the only surviving prototype J -Class thermonuclear submarine capable of eradicating entire Continents with your lethal atomic arsenal. Submarine Commander puts you in control of a J-Class submarine as you are taught the strategies and tactics needed to survive treacherous seas. Using hi-tech radar, torpedoes, sonar, mines, missiles and periscope you must defeat enemy targets including nuclear submarines, aircraft carriers and battleships. Having passed this test you can play in the games mission mode featuring over twenty tense command sorties.Submarine Commander is the first U-Boat based game to appear on the PlayStation. Utilizing a unique S.U.B.S (Submarine, Underwater, Battle System) locator screen for seeking out enemy subs, Submarine Commander is a tactics and action based game where the right choice of weapons and strategy mean the difference between survival and fish food. Weapons, engines and various parts including upgrades can be purchased to make your sub an effective deadly war machine. Features: First person perspective 3D graphics SCI-FI & Futuristic themes", "platform": "Sony Playstation", "release_date": "April 6, 2001", "game_type": "Released", "esrb": "", "developers": "Avalon Interactive", "publishers": "Victor Interactive Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78979-submarine-commander\n"}