{"altername_name": [], "name": "Suikoden: Tenmei no Chikai", "overview": "Bandit Kings of Ancient China, also known as Suikoden-Tenmei no Chikai in Japan, is a turn-based strategy role-playing simulation video game developed and published by Koei, and released in 1989 for MS-DOS, Amiga and the Macintosh and in 1990 for the Nintendo Entertainment System. In 1996, Koei issued a remake for the Japanese Sega Saturn and Sony PlayStation featuring vastly improved graphics and new arrangements of the original songs. STORY: In the 12th century, the Emperor Hui Zhong is faced with an internal rebellion led by Imperial Minister Gao Qiu. The Song Dynasty comes to an end, and Gao Qiu became the new ruler. You take the role of an exiled ruler, and you must build your stats up to be able to challenge- and destroy- Gao Qiu and restore Hui Zhong to the throne. GAMEPLAY: Based on the Great Classical Novel Water Margin, the game takes place in ancient China during the Song Dynasty. The Bandit Kings of Ancient China—a band of ten bandits—engage in war against China's Minister of War Gao Qiu, an evil person with unlimited power. The objective of the game is to build, sustain, and command an army of troops to defeat Gao's army before January 1127. Players hold certain attributes such as strength, dexterity, and wisdom. Players must also deal with other situations such as taxes, care for the troops, maintenance and replacement of weapons and equipment, forces of nature, and troop unrest and desertion. Battlefields take place on hexagonal grids, where players move their armies across various terrain in order to strategically engage and defeat the enemy army. Troops have the capability of fighting with either melee weapons, bows and arrows, magic, or dueling swords. When a player defeats an enemy army, they have the option of recruiting, imprisoning, exiling, or executing the captured enemy troops. Every individual battle lasts for a month, and players have until January 1127 to defeat Gao's entire army.", "platform": "Sony Playstation", "release_date": "October 4, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Strategy", "max_players": "7", "cooperative": "No", "rating": "4.7", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112804-suikoden-tenmei-no-chikai\n"}