{"altername_name": ["SuperLite 1500 Series - Oekaki Puzzle"], "name": "SuperLite 1500 Series: Oekaki Puzzle Vol. 1", "overview": "Nonograms (Picross), also known as Paint by Numbers or Griddlers are picture logic puzzles in which cells in a grid have to be colored or left blank according to numbers given at the side of the grid to reveal a hidden picture. In this puzzle type, the numbers measure how many unbroken lines of filled-in squares there are in any given row or column. For example, a clue of \"4 8 3\" would mean there are sets of four, eight, and three filled squares, in that order, with at least one blank square between successive groups. These puzzles are often black and white but can also have some colors. If they are colored, the number clues will also be colored in order to indicate the color of the squares. Two differently colored numbers may or may not have a space in between them. For example, a black four followed by a red two could mean four black spaces, some empty spaces, and two red spaces, or it could simply mean four black spaces followed immediately by two red ones. There are no theoretical limits on the size of a nonogram, and they are also not restricted to square layouts. Superlite 1500 Series - Oekaki Puzzle is the first game in the picross (or nanograms) series released by Succes in the year 2000 for the Playstation console. The game features more than 200 different puzzles, with different puzzle size (5x5, 10x10, 15x15 or 20x20) and a tutorial about how to play the game. Manufacturer's description: Complete the puzzle game will fill the picture based on the number of horizontal and vertical squares. We offer a total of 500 questions and problems can enjoy hearty beginners to advanced. The addictive puzzle game once while doing ratchet simple rule, mode is also equipped with a polite explanation of worry beginners. Features: First person perspective. 2D graphics Cartoon graphics Nanograms theme.", "platform": "Sony Playstation", "release_date": "May 27, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Success", "publishers": "Success", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://psxdatacenter.com/ntsc-j_list.html", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134185-superlite-1500-series-oekaki-puzzle-vol-1\n"}