{"altername_name": ["SuperLite 1500 Series - Shanghai - Dynasty"], "name": "SuperLite 1500 Series: Shanghai Dynasty", "overview": "Introducing Shanghai: Dynasty, with four royally addictive tile-matching games to render you powerless - including revolutionary multiplayer variations of the long-standing ruler of puzzle games. And for the first time in history, Shanghai represents the centuries-old tradition of Mah-Jongg. Shanghai: Destiny has come to power fall under its domination. THE GAME OF MAH-JONGG Popular for its challenging competitive elements, Mah-Jongg requires four players (computer and/or human) to play. Similar in concept to Rummy, players must make a pair and four groupings of either sequences or three-of-a-kind to win the gang. Choose Western or Chinese rules and other options. CLASSIC SHANGHAI It's deceptively simple. Match tiles until you run out of tiles, moves or time. Classic Shanghai features six 3-D tile sets: Fantasy, Egyptian, Prehistoric, Astrology, Outer Space, and Mah-Jongg. View layouts from four camera angles - plus, import custom tile sets made with your own images! \"PANDAMONIUM\" Challenge your Shanghai strategy against up to four opponents (computer or human) in a race to match pairs from the same tile layout. Concentration and speed are key in this chaotic event since only seconds can separate you from the winner with the most pairs. SHANGHAI FOR KIDS Now Shanghai makes tile-matching a kids pastime, too with smaller layouts, brightly-colored tiles and point-and-click entertainment. Kids can choose from a minimum of 28 tiles per layout and three tile sets designed especially for kids: Alphabet, Math and Household Objects! DYNASTY Build your Dynasty against four opponents who threaten your power. It's a virtual uprising as each player battles to clear his/her individual layout first. Deploy your arsenal of Power Tiles, and the battle begins with \"weapons\" that add tiles, shuffle tiles or even turn tiles face down!", "platform": "Sony Playstation", "release_date": "March 22, 2001", "game_type": "Released", "esrb": "", "developers": "Success", "publishers": "Success", "genres": "Board Game", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161392-superlite-1500-series-shanghai-dynasty\n"}