{"altername_name": [], "name": "Super Adventure Rockman", "overview": "This game is mostly an \"interactive story\" in three episodes. During the game, the player has to make choices, some story-based, some action-based. The story-based choices happen now and then between the animated scenes and the player has all the time to think about with selection to choose. The action-based choices happen inside the scenes: arrows will appear on the screen and the player only have one or two seconds to choose in which direction he wants to go. Sometimes, the player will encounter enemies and will have to fight them in a first-person shooter window. You have a cursor to target at your opponents and projectiles. The game is divided into 3 episodes (each of them in each game cd) and each episode can be played separately, so the player can start in the second or third episode if he wants to. A strange phenomenom occurs in Amazonia: a pyramid appeared out of nowhere and people trying to approach it with helicopters are shot down. Dr. Wily, dressed as a explorator, gets to the area with a jeep and decides to continue by foot. Dr. Light explains to Rock what is happening, while Roll enters the room with drinks. Rockman is remembering when Dr. Light and Dr. Wily were working together. They were talking about getting to Amazonia and Wily volunteered to go there. Suddenly, Roll falls on the floor, scaring everyone. She is brought to the lab and put on a scaning machine. She suffers from a phenomenom that disables all electronic machines. She could die if this continues for a couple of days... Dr. Light decides to prepare Rock, Rush and Beat for stopping Dr. Wily. All the six Robot Masters of Dr. Light agrees to help Rock in his mission. Then, Rock is heading for Amazonia by ocean with a small vehicule.", "platform": "Sony Playstation", "release_date": "June 25, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Kouyousha", "publishers": "Capcom", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "4.1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/28516-super-adventure-rockman\n"}