{"altername_name": ["Billiards"], "name": "Super Price Series: Billiards", "overview": "Cue sports (sometimes written cuesports), also known as billiard sports, are a wide variety of games of skill generally played with a cue stick which is used to strike billiard balls, moving them around a cloth-covered billiards table bounded by rubber cushions. Billiards: cue sports in general, including pool, carom billiards, snooker, etc.; the term \"billiards\" by itself is also sometimes used to refer to any of the following more specifically: - Carom billiards (also known as French billiards) games in general (a chiefly non-British usage) - Three-cushion billiards even more specifically, the most popular form of carom billiards worldwide (the most common specific usage) - The specific game of English billiards (a chiefly British, Irish and Australian usage) - Pool (pocket billiards) games, such as eight-ball and nine-ball, in general (a chiefly colloquial North American usage) Super Price Series - Billiards is a billiard game that features these game modes: 8 Ball, 9 Ball, 14.1 Continuous, Bowlliards, Cut Throad, Three Ball, Poker, Pocket Game, Mitsudama, Yotsudama, Pocket Carom, Equal Offense, Three Cushions. The game features 4 different kind of rules (Novice, House, Slop, Call Shot) and 5 different computer levels. Manufacturer's description: Billiards game with lowest price shock, realized the quality of the surprise. The 14 types recorded game of classic eight ball, nine ball, rotation, etc. Borado, can be set to a variety of each per game. The strength of the CPU 5 stage of the relief newbies. By the deployment of the viewpoint switching function to the 2D, proper assessment of the situation is possible. Features: First person perspective. 2D graphics Cartoon graphics Billiard theme.", "platform": "Sony Playstation", "release_date": "July 12, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Selen", "publishers": "Selen", "genres": "Sports", "max_players": "3", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160726-super-price-series-billiards\n"}