{"altername_name": [], "name": "Taikou Risshiden III", "overview": "Taiko Risshiden is a Japanese video game series produced by Koei. It was later re-released on the Wii Virtual Console on September 1, 2009, ported from the Super Famicom version. The name of the game roughly means \"the Taiko's success story\". The games involve the player taking on the role of a character from the era in one of seven roles (samurai, warrior, pirate, ninja, businessman, doctor, tea man and blacksmith) and living that life during the Momoyama period through minigames, resource management, and strategic thinking. A good player will meet various historical figures who lived during that era. Toyotomi Hideyoshi (February 2, 1536 or March 26, 1537 - September 18, 1598) was a daimyo warrior, general and politician of the Sengoku period. He unified the political factions of Japan. He succeeded his former liege lord, Oda Nobunaga, and brought an end to the Sengoku period. The period of his rule is often called the Momoyama period, named after Hideyoshi's castle. He is noted for a number of cultural legacies, including the restriction that only members of the samurai class could bear arms. Hideyoshi is regarded as Japan's second \"great unifier\". Hideyoshi was very successful as a negotiator. In 1564 he managed to convince, mostly with liberal bribes, a number of Mino warlords to desert the Saito clan. Hideyoshi approached many Saito clan samurai and convinced them to submit to Nobunaga, including the Saito clan's strategist, Takenaka Shigeharu. Nobunaga's easy victory at Inabayama Castle in 1567 was largely due to Hideyoshi's efforts, and despite his peasant origins, Hideyoshi became one of Nobunaga's most distinguished generals, eventually taking the name Hashiba Hideyoshi. Like Nobunaga before him, Hideyoshi never achieved the title of shogun. Instead, he arranged to have himself adopted into the Fujiwara Regents House, and secured a succession of high imperial court titles including, in 1585 the prestigious position of regent (kampaku). In 1586, Hideyoshi was formally given the name Toyotomi by the imperial court. He built a lavish palace, the Jurakudai, in 1587 and entertained the reigning Emperor Go-Yozei the following year. Taikou Risshiden III is a Playstation adventure strategy game based on the life of Toyotomi Hideyoshi, in the game the player have to travel around the town talking with different people and spending his money in gather new things, he can also hire a horse, sleep at the town inn, etc. The game features 2 different main characters to play with and the player have to choose one of them at the beginning of the game, one is a young lord and other is a young servant. The gameplay is in first person and the player have to choose different options when he talk to any of the town's people.", "platform": "Sony Playstation", "release_date": "August 19, 1999", "game_type": "Released", "esrb": "", "developers": "iNiS", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112816-taikou-risshiden-iii\n"}