{"altername_name": ["Taisen Ren'ai Simulation - Trifers Mahou Gakuen"], "name": "Taisen Renai Simulation: Trifers Mahou Gakuen", "overview": "Taisen Renai Simulation - Trifels Mahou Gakuen features seven anime girls, four anime boys that join the fun in this isometric interaction game. Dialogue screens shift to and from whenever it's time to chat with a cute girl. The game is a cartoon dating simulation in which the player have to compete againts other characters to win the affection of their friends. Depending of the conversation choices or if he wins the mini games the love meter will increase or decrease with each character. The game is divided into different stages, for example the first stage takes place in a snow place where they are located in a hotel and they can make snowmans, skiing, take walks, etc. The second stage takes place in a tropical place, they can go around the beach, go to the sea, etc. Each stage is divided into different sections: 1 - The first one is the activity to do with the friends, depending of the player's afinity with his friends they will join him or not, or they can go with his rival, in that activity if he goes with more than one friend he will have to first choose with which one he will spend his time and after that they will be another moment in which he will have to answer some questions that will make him be more or less appreciate by his friend. 2 - After that is launch time, and a mini game will happen there, the player have to make that as much friends as he can join him and not his rival in the table, to do that the player have to move to pointer over a character and press the circle button until the bar is full. 3 - Another time with his friends as in part 1. 4 - Night time, choose one of the girls to meet her at night and more questions to answer that will make him be more or less appreciate.", "platform": "Sony Playstation", "release_date": "April 20, 2000", "game_type": "Released", "esrb": "", "developers": "ASCII", "publishers": "ASCII", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136020-taisen-renai-simulation-trifers-mahou-gakuen\n"}