{"altername_name": [], "name": "Tales of Fandom Vol. 1: Mint Version", "overview": "Tales of Fandom Vol.1 was released on January 31, 2002. selling 94,000 copies. It is the 1st game in the Tales of Fandom sub-series of the Tales RPG Series, it features the characters from Tales of Phantasia, Tales of Destiny, and Tales of Eternia. There are two versions of Tales of Fandom Vol.1, a Cless Version, and a Mint Version. A sequel was released in 2007, entitled Tales of Fandom Vol.2 for the PlayStation 2, it also featured two versions, a Luke Version, and a Tear Version. Set up like an adventure game (and with actual gameplay elements to explore and unlock extra bits), nearly every character from the franchise is here to meet and talk or play with. Things to do include exploring, playing a puzzle game called the Craymel Lab (with multiplayer support), a scene maker where the characters can play out a created scenario, and an extensive gallery of the series. Tales of Fandom Vol. 1 is a fan-disk, which has loads of face chats, face chat adventures, and a Tetris-type game. All of these game modes feature \"Tales of...\" characters from Tales of Phantasia, Tales of Destiny, and Tales of Eternia. In addition, you can play online, and view a gallery with many \"Tales of...\" pictures. Tales of Fandom Vol. 1 was released for the Playstation in Japan on January 31st, 2002, selling 94,000 copies. The same game was released on two separate discs, one called the \"Cless\" version, and one called the \"Mint\" version--the game is identical on both discs. Story Info: Although Tales of Fandom Vol. 1 is a fan-disk made up of characters and storylines from prevous \"Tales of...\" games, there are certain game modes that tell various stories using those characters from the previous \"Tales of...\" games. Graphics: Mostly new designs of old characters; very detailed and colorful. They are great, especially for hardcore \"Tales of...\" fans. Difficulty: The \"Craymel Lab\" portion of the game is a Tetris-like game. Replay: As a fan-disk, the amount of replay value the game has is different for each player. For each individual player, the amount of replay value is a function of the amount of nostalgia and sentimental value the player derives from seeing the classic \"Tales of...\" characters interact with each other. Also, the aforementioned \"Craymel Lab\", Tetris-like game is fairly addicting and must be played many times in order to unlock things in the game.", "platform": "Sony Playstation", "release_date": "January 31, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Namco", "publishers": "Namco", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112854-tales-of-fandom-vol-1-mint-version\n"}