{"altername_name": [], "name": "Tantei Jinguji Saburo: Early Collection", "overview": "The first game in the Jinguuji Saburo series was released on the NES in 1987. The series told the different cases of a 32 years old detective named Saburo Jinguuji out to solve deadly crimes, that is supported by a cast which includes his assistant Yoko Misoni and local police inspector Sanzo Kumano. CHARACTERS: The main character of the series is Jake Hunter (known in Japan as Saburo Jinguji), a 32 year-old private detective who operates a detective agency in Aspicio, USA (Shinjuku, Tokyo in Japanese versions). He was born as the third son of a wealthy business enterprise owner, and traveled to New York during his youth to work as an assistant detective. He is a heavy smoker, and often assembles his thoughts while smoking a Marlboro cigarette. According to his in-game profile, his favorite alcoholic beverage is cognac, and he drives a green Mini Cooper. Other recurring characters include: Yulia Marks (known in Japan as Yoko Misono), Jake's assistant, and Scott Kingsley (known in Japan as Sanzo Kumano), the inspector of the Aspicio police. EARLY COLLECTION: This Playstation game is a compilation of the first four titles about detective Saburo. In this version there are also an art & sound gallery, topics about the series and the series characters and movie previews of the other games released for Playstation. These 4 cases are also released in Nintendo DS as part of the Jake Hunter Memories of the Past collection. CASE 1 - The Petty Murder of a Fragile Heart: The strangled corpse of a popular hostess is discovered at Asipicio Central Park. A doctor, homeless man and someone else may know something. CASE 2 - Seaside City Conspiracy: The search for a missing girlfriend results in the discovery of her hiding guns, and the police begin to suspect a link with an underground trafficking organization. CASE 3 - Crash and Burn: Jake visits a race circuit at the invitation of one of Yulia's friends. A motorcycle racer, Sabin Olsen, crashes at the circuit, but a different racer's body is recovered from the crash site. At the same time, Sabin Olsen, at a hotel, is found where a man he was supposed to meet was killed causing Olsen to be framed as he fled the hotel. CASE 4 - As Time Goes By: Jake investigates a burglary at a mansion, while Yulia searches for the home of a young boy. Both cases seemed simple, until they become one.", "platform": "Sony Playstation", "release_date": "August 5, 1999", "game_type": "Released", "esrb": "", "developers": "Media Rings", "publishers": "Data East", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.64", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112868-tantei-jinguji-saburo-early-collection\n"}