{"altername_name": ["Tantei Jinguuji Saburou - Mikan no Report"], "name": "Tantei Jinguji Saburo: Mikan no Rupo", "overview": "The first game in the Jinguuji Saburo series was released on the NES in 1987. The series told the different cases of a 32 years old detective named Saburo Jinguuji out to solve deadly crimes, that is supported by a cast which includes his assistant Yoko Misoni and local police inspector Sanzo Kumano. CHARACTERS: The main character of the series is Jake Hunter (known in Japan as Saburo Jinguji), a 32 year-old private detective who operates a detective agency in Aspicio, USA (Shinjuku, Tokyo in Japanese versions). He was born as the third son of a wealthy business enterprise owner, and traveled to New York during his youth to work as an assistant detective. He is a heavy smoker, and often assembles his thoughts while smoking a Marlboro cigarette. According to his in-game profile, his favorite alcoholic beverage is cognac, and he drives a green Mini Cooper. Other recurring characters include: Yulia Marks (known in Japan as Yoko Misono), Jake's assistant, and Scott Kingsley (known in Japan as Sanzo Kumano), the inspector of the Aspicio police. MIKAN NO RUPO: Production was halted after the 4th installment, but was revived in 1996 with the release of the 5th game in the series on the PlayStation and Sega Saturn. The series was revamped with improved graphics and sound made possible by the use of the CD-ROM disk, and featured voice acting for the first time. Mikan no Rupo is the fifth game in the series. As with previous entries in the series, the game progresses mostly through menu selection, as you slowly piece together a solution to the case. The game is released in Nintendo DS as part of the Jake Hunter Memories of the Past, this is the case 5 named The Red-Eyed Tiger. PLOT: An overseas package containing a small key arrives at the detective agency from Jinguji's journalist acquaintance. Jinguji must uncover the hidden meaning of the key.", "platform": "Sony Playstation", "release_date": "November 29, 1996", "game_type": "Released", "esrb": "", "developers": "Data East", "publishers": "Data East", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112870-tantei-jinguji-saburo-mikan-no-rupo\n"}