{"altername_name": ["Disney's Tarzan", "Disney's Tarzan", "Disneyn Tarzan", "Disney Tarzan", "ディズニー ターザン", "Walt Disney Pictures Presents Tarazan"], "name": "Tarzan", "overview": "In this adaptation of Walt Disney's animated film of the same name, Disney's Tarzan for the PlayStation swings into action with 13 levels set within a dangerous jungle. While the graphics are in 3D, play involves moving from left to right to find the exit, similar to that of a 2D platform game. Levels begin with animated film clips, each telling part of the story as Tarzan grows from a young boy to a man. The jungle is filled with dangerous animals that will diminish Tarzan's health (represented by a vine) every time he makes contact with them. Among the animals you'll encounter are frogs, baboons, rhinos, alligators, coconut-dropping birds and even enemy hunters. Of course, not all the animals are there to hurt you. Your friend, a female gorilla named Terk, will offer some tips along the way, and Tantor the elephant can also help out during certain stages. Moves include swinging from vine to vine, climbing trees or ledges, jumping over enemies and pounding the ground. The latter technique is useful for revealing hidden power-ups or breaking certain structures so you can continue onward. Tarzan can also throw an unlimited number of fruit at the animals, as well as use a knife and spear (once found). Besides making his way through the jungle, Tarzan can collect items to help him succeed. These include Tarzan coins (an extra life is earned for every 100 coins collected); letters to spell T-A-R-Z-A-N, which will let you watch opening movies from the option screen; four pieces of a sketch to open up a bonus round; and three different pieces of fruit to increase attack power. Bananas are also available to replenish lost health. Fans of the animated film will experience levels that closely follow its story, from trying to outrun stampeding elephants to saving Tarzan's gorilla family from the evil hunter Clayton. Players will also be able to slide down a jungle vine at high speeds from a perspective behind Tarzan! Battle the leopard Sabor and meet up with Professor Porter and his daughter Jane as you strive to become lord of the jungle. A memory card with one block free is required to save progress, but players can revisit past levels to hunt down every artifact. Complete the game with a 100% rating to unlock a special secret! Manufacturer's description: Disney's animated film TARZAN gets the video game treatment and makes his way to the PlayStation. The game follows the plot of the movie: you must help Tarzan grow from a boy to an adult in the span of 14 levels of action. While many of the levels offer platform-jumping, vine-swinging fun, some of them recreate some of the action sequences from the movie. No matter where he is, Tarzan must collect the tokens and fruit that are scattered about. Collecting 100 tokens earns an extra life, and the fruit can be used to dispose of enemies. If you can collect the four pieces of Jane's baboon drawing, you can earn the chance to play a bonus level. You've got to help the young ape-man discover his place in the world with TARZAN. Features: Third-person perspective 3D Graphics Cartoon Graphics Fantasy & Cartoon themes.", "platform": "Sony Playstation", "release_date": "June 30, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Eurocom Developments", "publishers": "Disney Interactive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.18", "wikipedia": "https://en.wikipedia.org/wiki/Disney%27s_Tarzan_(video_game)", "video_link": "http://www.youtube.com/watch?v=Isu9i40S6mY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7970-tarzan\n"}