{"altername_name": [], "name": "Tatsunoko Fight", "overview": "Tatsunoko Fight is a fighting video game developed and published by Takara for the PlayStation game console released in Japan in October 2000. It features characters from various Tatsunoko superhero properties in addition to original creations developed exclusively for the game. Each series is represented by characters, backgrounds, music, and voice actors from the original television programs, along with new art and animated sequences produced by Tatsunoko Production. Tatsunoko Fight is a two-dimensional, one-on-one fighting game where players must defeat their opponent in two of three rounds in order to advance.The game relies on using both normal and special attacks in order to damage the opponent, with a round ending once all of a character's remaining vitality has been lost. A special gauge at the bottom of the screen steadily fills when a character deals or receives damage, reaching a maximum of three levels. Player's can then expend one level at a time to unleash a more powerful super attack on their opponent to deal more damage. The game uses a combo system where light and heavy attacks can be chained together to launch a succession of attacks that cannot be interrupted or stopped until the sequence ends. In addition to normal versus mode, players may choose a round-robin-style team battle mode involving multiple characters, as well as a single-player story mode that resembles an arcade fighting game. Tatsunoko Fight features playable characters from four established Tatsunoko franchises: Science Ninja Team Gatchaman, Neo-Human Casshern, Tekkaman: The Space Knight, and Hurricane Polymar, as well an original series created exclusively for the game, Denkou Senka Volter. Each series is represented by three members, consisting of a \"Hero\", \"Supporter\", and \"Arch Rival\" character from their respective titles. Many of the game's characters are voiced by the actors who portrayed them in their original animated appearances, with additional supporting characters making cameo appearances throughout gameplay.", "platform": "Sony Playstation", "release_date": "October 5, 2000", "game_type": "Released", "esrb": "", "developers": "Eleca", "publishers": "Takara", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.35", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33525-tatsunoko-fight\n"}