{"altername_name": [], "name": "Team Buddies", "overview": "Team Buddies are heavily armed and ready for combat through more than 60 missions in eight Buddieland venues, including Central Park, Loon-A Moon, Rubber Jungle, Ori-Mental Peaks, Chilling Fields, Droopy Wood, Dirtbox Desert, and Insane Plains. Worlds are unlocked sequentially after mission-specific tasks are successfully performed. Depending on the mission and world, seven types of Buddies are available: Regular, Commando, Medic, Super Buddie, Karate, Stealth, and Cyborg, each with unique abilities and combat skills. Weapons and Buddie-types are contained in crates that drop out of the sky, and strategies involve stacking the crates within a foursquare grid area to achieve specific effects. Squad members kick boxes to reveal the contents, and combinations are key to discovering new and stronger weapons or Buddies. In addition to normal crates, mega-crates, which contain special weapons or flying vehicles that can't normally be built and weapon-enhancing super-crates, are also available. Weapons include a shotgun, bazooka, Uzi 9mm, grenades, and flamethrowers, and vehicles include tanks or planes, with an option to drive or \"ride shotgun.\" Up to four players can compete in five types of multiplayer action: Deathmatch, Domination, Capture, Bomball, and Ghosts, but not all are initially available. Additional game types are unlocked based on the amount of gaming invested. All missions include briefings, VR Training modes, and non-player characters that can affect the outcome of battles. While the European version of the game boasts some \"adult\" language, the U.S. release received an \"E\" for \"Everyone\" rating from the ESRB. Features: - Eight worlds with more than 60 levels of intense combat - Seven types of Buddies with weapons ranging from shotguns to flamethrowers - Five modes of multiplayer action for up to four players", "platform": "Sony Playstation", "release_date": "March 15, 2000", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Psygnosis Camden Studio", "publishers": "Midway Games", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "3.61", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8954-team-buddies\n"}