{"altername_name": ["Yutona Eiyuu Senki", "泪指轮传说：尤特娜英雄战记", "Yutona Eiyuu Senki: TearRingSaga"], "name": "Tear Ring Saga", "overview": "Tear Ring Saga is a tactical RPG with gameplay very similar to the gameplay found in the Fire Emblem series of video games. The game was created as a spiritual sequel to Fire Emblem by the game's creator, Shouzou Kaga, who no longer had the rights to the Fire Emblem IP upon leaving Intelligent Systems and Nintendo. The game shares the same interface, graphical and music style, and overall gameflow. The game involves the player moving characters in a turn based fashion across a large grid from an top-down perspective. The player is tasked with certain objectives, commonly fighting and defeating an entire opposing faction, or a particular member or leader of a faction. There are two protagonists in the game, Runan and Holmes, each with their own army to command. Though the two armies travel separately for the majority of the game, the cross paths at several point of the story, allowing the player to switch allocations of fighters and items amongst the two groups. Runan's story follows a strict set of scenarios where he battles against an enemy empire, while Holme's scenario allows for more freedom, allowing the player to ignore the main scenarios in favor of gathering treasure and increase the army's strength. The game takes place on an island continent called Riberia, which had long been divided and ruled under four kingdoms. However, these kingdoms were destroyed by the evil Zoa Empire and its devil-worshipping ruler, and the island was starting to regress into a period of instability and darkness. The Rīve Kingdom was one of the four kingdoms of Riberia, and the first protagonist, Runan (リュナン Ryunan?), is the prince of Razelia; one of the principalities within the kingdom. After the fall of his father's principality, he escaped and went into hiding in a nearby port-town. However, this town also fell into the hands of the Empire, and Runan and Holmes (ホームズ?), the prince of another one of the kingdom's principalities, retreat to the newly created Uelt Kingdom with a small contingent of troops. The two receive assistance from the Uelt king, and begin a long journey to destroy the evil empire.", "platform": "Sony Playstation", "release_date": "May 24, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Bits Laboratory", "publishers": "Enterbrain", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "4.28", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32424-tear-ring-saga\n"}