{"altername_name": ["TechnoMage: Die Rückkehr der Ewigkeit", "TechnoMage: En Quete de L'Eternite", "TechnoMage: De Terugkeer der Eeuwigheid", "Technomage: El Retorno de la Eternidad"], "name": "Technomage: Return of Eternity", "overview": "Technomage is a video game released by German game developer Sunflowers. Technomage was only released in PAL territories. The player character, Melvin, must save the world of Gothos from destruction. The people of Gothos are split into two types, the magic using Dreamers, and the technological Steamers. Melvin is half Dreamer, half Steamer. Melvin starts in his hometown of Dreamertown, when it is attacked by monsters. He is blamed, and taken to trial to be exiled. His uncle then teaches you the \"basics\", pending your exile. This section serves as the tutorial stage. After this you leave Dreamertown and head to Steamertown, on your adventure to find your father. TechnoMage: Return of Eternity is a hybrid game that incorporates elements of adventure, role-playing, and action-based combat. Many of the game's missions involve peaceful wandering through the environments, talking to characters, and performing tasks that often involve solving puzzles of various kinds, in an adventure-like fashion. RPG elements are present in experience points which the hero receives form eliminating enemies and completing quests. STORY: After passing Steamertown, Melvin enters a huge underground labyrinth called \"The Hive\", where his father vanished during an expedition. The Hive is a vast network built by the former rulers of Gothos. It contains grave complexes, libraries and laboratories; Melvin finds the first crystal of eternity there. When he leaves the Hive, he steps into the Great Forest, the realm of the fairies. They suffer from goblin uproars which are stopped by Melvin who then joins a pair of Shach traders on their journey to the canyon. Here, Melvin encounters Dagomar for the first time, the last survivor of the former rulers of Gothos. He acts as Melvin's mentor and guide. Also, Melvin befriends Talis, a girl who lives in exile because she also is half Dreamer, half Steamer. After clearing the canyon's mines, they travel to the tower, the former rulers' fortress of knowledge, which is now haunted by an undead dragon. As Melvin kills the dragon, another dragon is freed who takes Melvin to the volcano, which is where the Shach traders live. In the deeper levels of the volcano's caves, Melvin discovers more artifacts and buildings from the former rulers, as well as a map which leads him, talis and the dragon to the ancient ruins of the former capital of Gothos. Here, Dagomar drops his disguise and Melvin has to find out that he is Ramogad, the traitor who led to the downfall of the former rulers. After a big fight against Ramogad, Melvin uses the crystals of eternity found in the different regions of Gothos to reactivate both a stasis trap to stop Ramogad and a barrier device which uses a magic liquid to shield Gothos from the demon realms below. Talis then helps Melvin to escape the collapsing ruins and they fly across the ocean towards the sun.", "platform": "Sony Playstation", "release_date": "June 30, 2001", "game_type": "Released", "esrb": "E - Everyone", "developers": "Sunflowers", "publishers": "Infogrames", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.47", "wikipedia": "https://en.wikipedia.org/wiki/Technomage_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73207-technomage-return-of-eternity\n"}