{"altername_name": ["Ten Made Jack: Odoroki Mamenoki Daitoubou!!"], "name": "Ten Made Jack: Odoroki Manenoki Daitoubou!!", "overview": "Jack and the Beanstalk is a folktale said by English historian Francis Palgrave to be an oral legend that arrived in England with the Vikings. The tale is closely associated with the tale of Jack the Giant-killer. It is known under a number of versions. In the Jacobs version of the story Jack is a young lad living with his widowed mother and struggling in hard times. Jack is in love with the counts daughter and wishes to marry her. In desperation for money Jack is sent by his mother to sell their only cow at the market, but along the way he is apparently swindled by a man who offers him supposedly magic beans in exchange for the cow. Jack took the beans but when he arrived home with no money, only a hand full of beans, his angry mother threw the worthless beans out the window and sent Jack to bed without supper for his foolishness. As Jack slept, the beans germinated in the soil, and by morning a gigantic beanstalk grew in their place. When Jack saw the huge beanstalk, he immediately decided to climb it. He arrived in a land high up in the clouds that happened to be the home of a giant. However, Jack was saved by the giants wife and as he escaped from the castle, he took a bag of gold coins with him. However this would not suffice to please the all-powerful count. Jack desired to seek out more treasures from the castle, to gain standing among his fiancees family. He climbed once more up the beanstalk. This time he stole a hen which laid golden eggs. This would be sure to please the all-powerful count. Jack being nearly caught by the giant twice decided that none must know of where he found this magical item, and the gold coins so he decided to go up the beanstalk. This time, a magical harp that played by itself, caught his eye. He stole it and then proceeded to kill the giant in a murderous rage, for the all-powerful count must never know of his misdeeds. With the blood on his hands he quickly climbed down the beanstalk and cut it. However this was giants blood and could not be washed off of his hands. The all-powerful count was most pleased with these gifts, and so he disregarded Jacks blood-stained hands. Jack married his beloved, and knew riches for the rest of his days. Ten Made Jack (Tenma de Jack - Odoroki Manenoki Daitoubou) is an intriguing release from Enix based loosely on the Jack and the Beanstalk fairytale. Jack must escape up the beanstalk as he is being pursued and must reach the goal within the time limit. There are a host of enemies in the way though and flowers have to be rescued too. Water bottles are on hand to help the beanstalk grow in the right places, put out fires or delay the progress of enemies. A bit different, but special too. The gameplay is really hard, in each level there is a main enemy that is a human character that will pursuit the player around the level and cant be destroyed, and there are animal enemies around the level that can be used when they are knocked to knocked the human enemy for some few time, some animals keep appearing until you destroy a bird cottage that are near them, to complete each level the player have to reach to goal. Manufacturers description: Comical 3D action to manipulate the hero Jack, aim the goal to climb the tree of strange beans towering up to heaven in order to escape from chasing come enemy. Aiming to top in a variety of actions and or dive the sky climb the stem, chasing come enemy while attacking throwing his head, trying to arrive at the Sanctuary of the goal within the time limit. Features: Third person perspective. 3D graphics Cartoon graphics Fantasy theme.", "platform": "Sony Playstation", "release_date": "December 23, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Exrays", "publishers": "Enix", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=3XW-3DQ5RYs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123971-ten-made-jack-odoroki-manenoki-daitoubou\n"}