{"altername_name": ["Rittai Ninja Katsugeki Tenchu 2"], "name": "Tenchu 2: Birth of the Stealth Assassins", "overview": "With the threat of civil war at an all-time high and bloodthirsty warlords in pursuit of territory and regional recognition, Japan desperately needs an intervention -- a group of heroes that will band together and save the once peaceful land. When desperation sets in, the common man looks to the House of Gohda; Lord Gohda Matsunoshin enlists the services of deadly, shadow warriors known as the Azuma Ninja in times of dire need. Matsunoshin has called upon three young warriors: Rikimaru, Ayame and Tatsumaru; the aforementioned characters, excluding the latter, were called upon in Tenchu: Stealth Assassins. Whereas Rikimaru is a tranquil, ardent ninja, the dagger wielding Ayame has a rebellious attitude -- she's also the youngest of the three. With exceptional sword abilities and having been trained as a future leader of the Azuma Ninja, Tatsumaru is the most prominent of the three. Together, they'll not only have to save the House of Gohda from an unparalleled evil, the young ninjas must improve their stealth and further develop their skills. Developed by Acquire, Tenchu 2: Birth of the Stealth Assassins is a prequel to Tenchu: Stealth Assassins; the events found within this game happened before those in the original. Retaining the third-person 3D viewpoint and stealth tactics, this prequel features over 21 new techniques including devastating deathblows and weapon combinations. Depending on which character you choose will determine your fighting style as each comes with his or her own unique weapons. Unlike the original, characters can now swim through trenches and other bodies of water. Additionally, players now have the option of dragging dead corpses into secluded areas; if someone sees a dead body, they're going to know something's wrong and begin combing the area for clues. There are 29 unique missions involving the assassination of certain warlords, the protection of innocents and the elimination of unwanted troops. While you could run out in the open, the point behind this series is to remain undetected and silently slay the given targets. This involves propelling yourself onto rooftops and trees with a grappling hook and quietly sliding around walls while focusing on the surrounding environment. Finishing missions without being seen will earn you higher rankings and secret goodies; if your only concern is to finish the game, feel free to rush through each level. Rankings are as follows: stealth kills are 20 points and normal kills are five points with 150 and 30 point deductions coming in the form of murdering an innocent and being spotted; if you remain unseen throughout an entire level, you're awarded 300 points. In addition to your characters' default weapons, you'll have access to a wide variety of Azuma Ninja weapons and items including flaming arrows, mines, colored rice used for navigational purposes, poison rice, throwing stars and healing potions. Once you've been detected by an enemy, use the leaves of stealth to disorient him; after the effect wears off, your character will be positioned behind the enemy, waiting to cut his throat or snap his neck. Tenchu 2: Birth of the Stealth Assassins also includes a Mission Editor that allows to create your very own mission objectives and 3D worlds. After giving the mission a name and objective, you can utilize the terrain or character editor and begin constructing a level; building either a dojo or village-type level, you'll have access to textures and prefabricated items found within the actual game. Although the developers denied players full use of the game's engine editor (there are no backgrounds in custom made scenarios), it allows you to adjust terrain heights, place trees and assorted items and set patrolling paths for the enemy forces you put into the map.", "platform": "Sony Playstation", "release_date": "August 15, 2000", "game_type": "Released", "esrb": "M - Mature", "developers": "Acquire", "publishers": "Activision", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.16", "wikipedia": "https://en.wikipedia.org/wiki/Tenchu_2:_Birth_of_the_Stealth_Assassins", "video_link": "https://www.youtube.com/watch?v=vVQ6ZnnMeWo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9863-tenchu-2-birth-of-the-stealth-assassins\n"}