{"altername_name": [], "name": "Tenshi na Konamaiki", "overview": "Tenshi Na Konamaiki is a comedy romance manga series by Hiroyuki Nishimori. It focuses on the adventures of a 15-year old schoolgirl Megumi Amatsuka, a popular and beautiful tomboy with a secret: she remembers being a boy whom a genie/trickster had changed into a girl. Only in the last volume is the trickster's trick fully revealed. At the age of nine, Megumi wanted to be a typical boy, rampant wild loud and so on. One day he saves a man being chased and attacked by a gang of other children, which was then realized a sorcerer. In return, Megumi receives a magic book that would grant him wishes. Megumi, being the boy that he is, wished to become the manliest man on earth or the man of men. Pierrot, the jester/genie in the book tells him he can and may grant the wish, and appears to do what Megumi had asked, but turns out to be a trickster: Megumi thinks she becomes a woman of women instead of man of men, Pierrot claiming to have misheard the wish as \"woman among women\". This left Megumi in rage and bewilderment, for while the first wish is always free, the second comes at a price: it would cost [waiting] 10 years of Megumi's life to reverse it, and as an act of rage she throws the book into a river. Little did she know that after being transformed into a woman she cannot be returned to a male without the book, so begins her quest to retrieve it and reverse the spell that has befallen upon her. The game features japanese voices for all the game characters and a first person perspective. The game features a lot of different endings.", "platform": "Sony Playstation", "release_date": "September 26, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Visual Novel", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136015-tenshi-na-konamaiki\n"}