{"altername_name": [], "name": "Tetris Plus", "overview": "Tetris Plus is a puzzle video game developed by Natsume and published by Jaleco for arcades exclusively in Japan in 1996, and was ported to the Game Boy, Sega Saturn, and PlayStation later that year. The game would be followed by a sequel, Tetris Plus 2, in 1997. GAMEPLAY: The game consists of two main modes, Classic Mode and Puzzle Mode. Classic Mode functions like the original Tetris game for the Game Boy except with different music and visuals. However, because the cartridge has battery-powered SRAM, it also has the ability to remember your high-scores, unlike the original Game Boy game. Puzzle Mode is a twist on the classic gameplay that provides a new scenario. Also included is an editor for making Puzzle levels, and Link capability for going head-to-head with another player in either game mode. The Console Versions also have a two player Versus Mode which is essentially puzzle mode with two players racing for the finish line. PUZZLE MODE: The biggest addition to Tetris Plus is the Puzzle Mode. The player starts by choosing any of four world locations: Maya, Knossos, Egypt, or Angkor Wat. The final area, Atlantis, is unlocked by successfully completing the other four stages (in any order). Each of the four locations has a different level set. Once the game starts, the player is presented with a cluster of pre-placed bricks, and the professor enters the play-area through a disappearing gate. The objective is to get the professor to the bottom of the screen, by placing blocks and clearing lines, before the spiked ceiling at the top comes down and crushes him. The player's goal is to guide this archaeologist to the bottom as fast as possible. Two blocks wide and tall, he will aimlessly walk forward until he bumps into a block, after which he turns around and walks the other way. If he comes across a gap that is large enough for him to fit through, he will fall down onto the blocks below him. Conversely, if blocks are placed on top of him, he will climb up them until he reaches the top. As one could guess, if these blocks lead too closely to the spikes, the professor will die. Upon starting the level, the spiked ceiling will start at the top of the play-area. About once every eighteen seconds, it will move down one row, slowly taking away workable space. The player is able to make the ceiling go back up, however, if they can clear three or four rows at once. The ceiling will also destroy any placed blocks that are in its way. This can be used as a garbage disposal, by having it remove any unwanted pieces until the piece the player wants shows up.", "platform": "Sony Playstation", "release_date": "October 18, 1996", "game_type": "Released", "esrb": "E - Everyone", "developers": "Natsume", "publishers": "Jaleco", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.77", "wikipedia": "https://en.wikipedia.org/wiki/Tetris_Plus", "video_link": "https://www.youtube.com/watch?v=bpwhg4ZsyAQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11450-tetris-plus\n"}