{"altername_name": [], "name": "TFX: Tactical Fighter eXperiment", "overview": "TFX - Tactical Fighter Experiment (aka TFX) was one of the precursor combat flight simulators that helped to define the standards of modern combat flight simulators, together with Tornado, F14 Fleet Defender and the Falcon series. TFX was programmed by the British company Digital Image Design and published by Ocean Software in 1993. At the time, TFX graphics and realism with all options on (most players missed the realism settings in the SETUP menu) were far superior to any other home computer simulator of the time and most made even years ago, so much that it bought the attention of British and Australian military, and eventually DID became involved in military projects such as the TIALD laser designator trainer. Even though its graphics and realism were acclaimed, the player was alone in most missions, maybe because most of the players had only 386 computers at the time, and having 3 or more planes at full realism/quality being simulated in an 386 or Amiga would make the game run very slow, at around 2 frames per second. For demonstration purposes in ECTS September 1993, a 486 DX4 100 MHz was used. Ideally it is desired to run this combat flight simulation on a 80486 based PC @ 66 MHz or higher with an SVGA PCI graphics card to obtain good video graphic frame rates. The simulation runs rather nicely in DOS mode on an Intel Pentium microprocessor based PC. GAMEPLAY: The pilot could fly 3 planes: The Eurofighter, the F-22 and the F-117. The payload for each plane could be fine-tuned by the player according to mission type. The possible modes of play included an instant-action arcade mode, custom missions or the campaign (Tour of Duty). The campaign mode sees you taking the role of a pilot flying for the fictional, United Nations Air Force flying missions in one of five theatres (Colombia, Somalia, Libya, the Balkans and also the South Georgia Islands). The tour of duty was designed to offer a \"soap opera\" approach, where actions from the players would affect the world and following missions, as well as reaction in the front page of journals according to what the player did. The interactive parts of the game were reduced to still images or omitted altogether for the Amiga version, which although never officially released by Ocean, was later included as a give away game on a CU Amiga Magazine cover disc. There was also an experimental port produced for the PSX shortly after its release. The Soap Opera Engine was manually programmed in TFX, but would be altered to become automated in future games. Manufacturer's description:", "platform": "Sony Playstation", "release_date": "November 29, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Digital Image Design", "publishers": "Imagineer", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/17282-tfx-tactical-fighter-experiment\n"}