{"altername_name": [], "name": "That's QT", "overview": "That's QT is a design game in which the player can design a lot of clothes. The game was also released in Nintendo DS as That's QT in Japan and as Pop Cutie! Street Fashion Simulation in the United States in the year 2008. This game is about fashion. There are customers that will visit the shop to buy your creations. The game provides more than 30000 items that permits a lot of different combinations. The player will also have to compete againts another fashion designers. The game also features models, and the player must be sure of the taste of the possible customers, since the fashion changes a lot. The gameplay is about go out on the streets and see what the people likes in every moment, after that go to the background room of the shop and design the new clothes, tell the model to wear your new clothes and see if the people likes them and start selling them to earn more money. Players take control of every aspect of a small fashion boutique, from running the cash register and hiring models and assistants, to choosing the look and music for the store and placing magazine ads. But the fast-paced world of fashion means players must also hit the streets to discover all the latest trends, and then use any new styles as inspiration for clothing, accessories, and hairstyles. Rival designers are also prowling the streets on a hunt for the hottest fashions, so players must be ready to square off against their competitors in fashion battles where judges determine the next \"in\" thing. Features: - Manage every aspect of a fashion boutique, from the cash register to advertising - Walk around the streets to discover the hottest new fashion trends", "platform": "Sony Playstation", "release_date": "January 27, 2000", "game_type": "Released", "esrb": "", "developers": "iNiS", "publishers": "Koei", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112898-thats-qt\n"}