{"altername_name": ["Familie Feuerstein: Bedrock Bowling", "La Famille Pierrafeu : Bedrock Bowling"], "name": "The Flintstones: Bedrock Bowling", "overview": "Prehistoric times, beware -- The Flintstones have invaded the bowling alley! Fred Flintstone, Barney Rubble, Pebbles, Bamm-Bamm, and Dino are taking advantage of a newly transformed Bedrock. That pesky alien Gazoo is always up to no good; now he's turned the entire town into massive bowling lanes complete with obtruding hazards and lots of rock! Developed by Adrenalin Interactive, The Flintstones: Bedrock Bowling isn't meant to be your typical bowling game -- not by a long shot. Fred Flintstone and his buddies will bowl in offbeat 3D areas including Barney's Backyard Pool, Slate's Crystal Mine, the Bedrock Drive-In, the Tar Pit, a Volcano, and the Bedrock Expressway. There are also bonus space lanes courtesy of Gazoo. Whereas bowling alleys typically feature slick, straight lanes with white pins, this game thrives on obstacles and unavoidable hazards! Hazards typically include dinosaur drawbridges, geysers, blasting powder, oil slicks, tar patches, and prehistoric cars, but you can use the hazards to your benefit. When lining up a shot, don't be afraid to ricochet the ball off a huge slab of granite or enlist the help of a dinosaur -- the better you work the hazards, the more points you'll get. By doing well on any given course, you'll be rewarded with bonus goodies and high scores. Rather than using traditional bowling balls, you'll be speeding down the lanes in a hollowed out shell. In order to control the character and shell, you'll need to aim right and left; if necessary, there's additional turbo power. Additionally, players can put spin on the ball and do pretty much anything you'd find in an actual bowling alley. The Flintstones: Bedrock Bowling also features three difficulty settings for novice, intermediate, and expert bowlers. There are a total of two gameplay options: the Single Player and Multiplayer modes, where up to four people can compete by taking turns. The game also uses a memory card for saving scores and unlocked bonuses. So what are you waiting for? Hop on your prehistoric foot-powered vehicle and get ready to bowl!", "platform": "Sony Playstation", "release_date": "September 19, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Adrenalin Interactive", "publishers": "Southpeak Interactive", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "2.86", "wikipedia": "https://en.wikipedia.org/wiki/The_Flintstones:_Bedrock_Bowling", "video_link": "https://www.youtube.com/watch?v=z74fVEiiXog", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11254-the-flintstones-bedrock-bowling\n"}