{"altername_name": ["Hamunaptra - Ushinawareta Sabaku no Miyako", "La Momia"], "name": "The Mummy", "overview": "Dashing explorer Rick O'Conell has just made a bit of a mistake. In discovering the lost City of the Dead, he's awakened an all-powerful evil known as Imhotep, a cursed priest who was mummified alive in ancient Egypt and is now, as one might imagine, hankering for revenge. It will take all of Rick's brains and brawn to make it through the coming ordeal, as he'll have to survive the Mummy's traps and vile legions if he hopes to make it out of the City of the Dead alive. As if that wasn't enough, he'll also have to take on the Mummy itself. Based on the 1999 summer blockbuster starring Brendan Frasier, you take on the role of Rick as he swashbuckles his way through this third-person action game, running, jumping and mainly fighting his way to the greater depths and secrets of the lost city. Throughout this action-adventure game, players will have to fight off all manner of supernatural beasts, from deadly mummies to scarabs, spirits and hordes of man-eating bugs. But fighting isn't the only task you'll be forced to encounter, as the City of the Dead is laced with all manners of traps and puzzles, each waiting for you to make the one mistake that will see you swallowed whole by the infinite dust of time. You won't be going in empty-handed if you take on the hefty task, thankfully, as Rick has a veritable arsenal at his disposal, representing many of the guns and weapons that were used in the movie, from swords to revolvers, and even to magical amulet grenades. Pure action isn't the only item on The Mummy's menu, however, as you will occasionally undertake certain objectives with their own unique viewpoints and controls, such as running for your life in a side-scrolling portion. Also included on The Mummy is a trailer for its theatrical sequel, The Mummy Returns.", "platform": "Sony Playstation", "release_date": "November 15, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "Rebellion", "publishers": "Konami", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.79", "wikipedia": "https://en.wikipedia.org/wiki/The_Mummy_(video_game)", "video_link": "https://www.youtube.com/watch?v=40VVhK6bBf4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11250-the-mummy\n"}