{"altername_name": [], "name": "The Airs", "overview": "On a world called Floatia, a land of continents floating in mid-air, a young man named Tigaro is about to be drawn into an adventure of a lifetime. Developed by Pack in Soft, The AIRS has a wide variety to offer players. First and foremost are the Taplers. Taplers are flying machines used by the inhabitants of Floatia to move from continent. Taplers are also raced in the \"Celestial Cannonball\" once every decade, a race full of dangers, which claimed the life of Tigaro's father. By selecting from over 70 seperate parts, players can upgrade their Tapler, which changes form, depending on the parts applied to it. This way, players can choose whether to build a sleek, fast Tapler which can run circles around the enemy, or a big, buff Tapler which can take a licking and keep on ticking. The choice is pretty much up to the player. The world of Floatia is split into two seperate parts. First, there is the air, a completely 3D environment where the player can fly their Tapler, and interact with other Taplers. This interaction takes place in two primary forms; exchange of information and fighting. These aerial battles are also displayed in full 3D, making for some potentially spectacular battles. The second part of Floatia is the continents. Players can walk over the continents, on 2D maps, where they can enter towns and collect supplies and information. Another rather interesting feature of The AIRS is the way the passage of time affects the game. During the day a character might reveal a particular piece of information, but at night the information he gives you could be completely different. There are also a few timed events in The AIRS. To go from one air island to another one the player has to pilot the plane that is the only time in the game that used a third person perspective with a 3d engine, once he reached the new island he can go around and gather new information talking to the different characters that are around there.", "platform": "Sony Playstation", "release_date": "March 25, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Pack-In-Soft", "publishers": "Victor Interactive Software", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.8", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122917-the-airs\n"}