{"altername_name": ["Oni Taiji!!, The - Mezase! Nidaime Momotarou"], "name": "The Oni Taij: Mezase! 2-daime Momotarou", "overview": "The Oni Taiji - Mezase! 2-daime Momotarou is a board mini games game based on the traditional tale of Momotaro. Momotaro is a popular hero from Japanese folklore. His name literally means Peach Taro; as Taro is a common Japanese boy's name, it is often translated as Peach Boy. Momotaro is also the title of various books, films, and other works that portray the tale of this hero. STORY: According to the present form of the tale (dating to the Edo period), Momotaro came to Earth inside a giant peach, which was found floating down a river by an old, childless woman who was washing clothes there. The woman and her husband discovered the child when they tried to open the peach to eat it. The child explained that he had been sent by Heaven to be their son. The couple named him Momotaro, from momo (peach) and taro (eldest son in the family). An older form of the story has the old, childless woman discover the giant, floating peach and take it home with her, as she finds it to be of good color and tasty-looking. After eating a piece of the peach, the old woman is suddenly rejuvenated and regains the beauty of her youth. When her old husband comes home from the hills, he is astounded to find a dazzling young lady in his house. At first, he does not even recognize his own wife in her rejuvenated form, but she explains to him how she has picked up an unusual peach floating in the river and brought it home to eat it and was magically transformed. She then gives her husband a piece of the peach to eat, and he also regains his youthful vigor. That night, the newly invigorated couple make love, and the woman becomes pregnant as a result. She eventually gives birth to their first child, a son, whom they name Taro, as that is a common Japanese name for a first son. Years later, Momotaro left his parents for an island called Onigashima to destroy the marauding oni (demons or ogres) that dwelt there. En route, Momotaro met and befriended a talking dog, monkey, and pheasant, who agreed to help him in his quest. At the island, Momotaro and his animal friends penetrated the demons' fort and beat the demons' leader, Ura, as well as his army, into surrendering. Momotaro returned home with his new friends, and his family lived comfortably from then on. Momotaro is strongly associated with Okayama, and his tale may have its origins there. The demon island of the story is sometimes associated with Megijima Island (an island in the Inland Sea near Takamatsu) due to the vast manmade caves found on that island. The game features different mini games and can be played for up to 4 human players at the same time.", "platform": "Sony Playstation", "release_date": "October 13, 1995", "game_type": "Released", "esrb": "", "developers": "Nippon Ichi Software", "publishers": "Nippon Ichi Software", "genres": "Board Game", "max_players": "4", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136121-the-oni-taij-mezase-2-daime-momotarou\n"}