{"altername_name": [], "name": "The Dog Master", "overview": "Do you like dogs? Do you think that you know a lot about them? In that case you will love this game. The Dog Master is a game about dogs, the game got a complete database of a lot of dogs types and breeds. When developer Artlist International set about creating the definitive Japanese Dog Quiz game, they recruited help from dog owners, dog clubs, kennels and even breeders of fine pooch pedigrees. After exhausting scrutiny and ponderous debate, Artlist narrowed down all that data into 2000 questions which test the mettle of those who deign to dub themselves Dog Masters. Questions range from breeds, behavior, health issues and physiology of man's best friends. Two puzzle games are also included to break the tedium of constant questioning. The first limited edition of Dog Master includes an adorable puppy CD carrying case seen on the left side of the packaging. Pup's mouth opens up to hold up to 8 CDs in individual slips. The game is divided into different sections: - In the first part the player can choose a type of dog and view it in the game viewer (there are lots of images of dogs there). - The second part is a jigsaw puzzle game: There are different images of dogs and the player can solve them to see the full image and them play again to make a best time solving the puzzle. - The third part of the game is a quiz mode: The game will ask different questions about the dogs, types, orders, education, etc. - The fourth and last part is a database of the different types showing them and their characteristics. The game cames in a box set which includes a CD wallet.", "platform": "Sony Playstation", "release_date": "August 7, 2003", "game_type": "Released", "esrb": "", "developers": "Visit", "publishers": "Visit", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "4.1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133978-the-dog-master\n"}