{"altername_name": [], "name": "The Great Battle VI", "overview": "The Compati Hero Series is a video game series published exclusively in Japan by Banpresto and Namco Bandai Games (formerly Bandai) that began in 1990, that serves as crossover between Ultraman, Kamen Rider (also known as Masked Rider) and Gundam. It was the first video game series to involve a crossover between animated giant robots and live action tokusatsu heroes from different established franchises. The series makes this possible by using caricaturized versions of the characters (officially referred as \"SD\" or \"Super Deformed\" characters), which allowed the different heroes and villains to co-exist and interact with each other without the need to reconcile their contrasting styles and settings. Part of the Compani Hero Series is The Great Batle Series: - SD The Great Battle (Super Famicom - December 29, 1990) - The Great Battle II: Last Fighter Twin (Super Famicom - March 27, 1992) - The Great Battle III (Super Famicom - March 26, 1993) - The Great Battle IV (Super Famicom - December 17, 1994) - The Great Battle V (Super Famicom - December 22, 1995) - The Great Battle VI (PlayStation - April 11, 1997) In the Great Battle VI The sprawling Super Famicom series gets shifted to the Playstation making excellent use of the Super Deformed Gundam, Ultraman and Kamen Rider characters. Gameplay is varied keep the pace high with platform shoot em up sections, vertically scrolling shoot em up levels and one on one beat em up battles. Each of the characters possesses an array of special techniques to get them out of a squeeze. A fine action title from the Far East, little known, but warmly recommended. This game doesn't have any kind of save feature and that's mean that the player has to complete the game in one time, using only the continue option.", "platform": "Sony Playstation", "release_date": "April 11, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Aspect", "publishers": "Banpresto", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.44", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97584-the-great-battle-vi\n"}