{"altername_name": [], "name": "The Firemen 2: Pete & Danny", "overview": "The Firemen was a Super Nintendo Entertainment System game where the player controls Pete, the fire fighter, as he rescues people from a burning building. Fires, smoke, and other hazards await as Pete tries to save the day. Use of the fire extinguisher is unlimited although continues are limited in number. The game was released in Europe, Australia and Japan. The Firemen 2 tells the story of two courageous firemen who are named Pete Grey and Danny McClean. They're busy keeping New York City safe from rampaging fires. The game takes place on Christmas Eve. Guided by their correspondent back at the station, Winona, Pete and Danny must visit multiple areas across the city, and put a stop to a series of mysterious fires that have been popping up all over. You (or you and a friend in 2 player mode) guide Pete and Danny in a traditional bird's eye view format. The game plays like a standard old-school 2D shooter game, like Commando or Contra. The only difference is, instead of guns, you're armed with hoses. And instead of seemingly endless military and/or alien drones, you battle the most malicious fire to ever walk the face of the earth. The areas that our heroes explore include a wide variety of locations around New York City. These places include a theme park, a giant aquarium, a hotel, and even an animatronic dinosaur exhibit. In each level, you are given a mission. (Rescue Pete's daughter, who got caught in one of the fires, rescue the penguins in a zoo before the fire gets to them, etc.)", "platform": "Sony Playstation", "release_date": "December 22, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Human Entertainment", "publishers": "Human Entertainment", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.44", "wikipedia": "https://en.wikipedia.org/wiki/The_Firemen_2:_Pete_%26_Danny", "video_link": "https://www.youtube.com/watch?v=8KJw6xGdT3E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32244-the-firemen-2-pete-danny\n"}