{"altername_name": [], "name": "The Tower: Bonus Edition", "overview": "Developed by Yoot Saito of OPeNBooK, SimTower was originally titled The Tower. SimTower: The Vertical Empire (known as The Tower in Japan) is a construction and management simulation computer game developed by OPeNBooK Co., Ltd. and published by Maxis for the Microsoft Windows and Mac OS 7 operating systems in November 1994. In Japan, it was published by OPeNBooK that same year and was later released for the Sega Saturn and Sony Playstation in 1996. The game allows players to build and manage a tower and decide what facilities to place in it, in order to ultimately build a five-star tower. Random events take place during play, such as terrorist acts that the player must respond to immediately. Critical reception towards the game was generally positive. Reviews praised the game's formula, including its open-ended nature and its ability to immerse the player into the game. Criticism targeted the game's lack of documentation, which some reviewers found made it harder to learn how to play the game. The in-game speed was also criticized for being too slow, which was a crucial issue in the game because time must pass for the player to earn income to purchase new facilities. GAMEPLAY: SimTower allows the player to build and manage the operations of a modern, multi-use skyscraper. They must plan where to place facilities in the tower that include restaurants, condominiums, offices, and elevators. To prevent tenants from vacating their properties, the player must keep their stress low by fulfilling their demands for medical centers, parking lots, recycling facilities, clean hotel rooms with the help of housekeepers, and an efficient transportation system, which involves managing elevator traffic. SimTower, which was built around an elevator simulation program, places a strong emphasis on good elevator management. The game begins with a one-star tower with limited building options. To increase the tower's star rating, it must attract more tenants by providing more living space. New facilities are made available while the tower progresses from a one-star rating to a five-star rating. The tower is limited to a maximum of 100 floors above ground and nine stories below ground. Standard elevators, which can span a maximum of 30 floors, and express elevators, which can span the entire height of the building, must be used efficiently to decrease tenant stress. Sega launched a version of SimTower for the Game Boy Advance, called The Tower SP, in Japan on April 28, 2005, and in the United States on March 15, 2006. A version of SimTower called The Tower DS was published by DigiToys in Japan on June 26, 2008", "platform": "Sony Playstation", "release_date": "November 1, 1996", "game_type": "Released", "esrb": "", "developers": "OPeNBooK", "publishers": "OPeNBooK", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134927-the-tower-bonus-edition\n"}