{"altername_name": [], "name": "The Blue Marlin", "overview": "The Blue Marlin is a 1991 fishing video game developed and published by Hot B for the Nintendo Entertainment System (NES). Following in the tradition of its predecessors, The Black Bass for MSX and The Black Bass for NES, the objective is to win a tournament by catching the largest fish in the time allotted. The Blue Marlin features four tournament rounds (one in Florida and the other three in Hawaii). Experience the joys of fishing in BLACK BASS WITH BLUE MARLIN, as you venture out on the lake and bring in the biggest bass possible. If lakes and bass are not your thing, hit the exotic deep-sea locales in search of blue marlin. With a wide variety of available camera angles, you’ll never miss a second of the action. When the fish aren’t biting, you can get help from fishing legend, Hank Parker. Whether it’s on the lake or out in the deep sea, BLACK BASS WITH BLUE MARLIN has something for every aspiring angler. Fishing fans get two games in one with this release from Hot-B. Cruise four large freshwater lakes in a hunt for a trophy bass. Visit 12 different locales for marlin tournament fishing. This 3D simulation is designed to provide a believable fishing experience offering realistic equipment, action, and environmental factors. The game also features famous pro angler Hank Parker. Black Bass with Blue Marlin were developed and published by Hot B USA and released as a two-in-one package. Both games offer \"realistic\" fishing environments and physics. Black Bass features freswater fishing, while Blue Marlin features saltwater. Both games come with real lures and rods. The game features 4 lakes with 12 locations, 12 types of fish, precise rod and reel movements, vast selection of baits and tackles. Two fishing games in one -- freshwater and saltwater tournament series Head-to-head two-player mode Real-life lakes and ports Fully three-dimensional design Realistic fish habitats, vegetation and environmental factors Complete freshwater and saltwater lure selections", "platform": "Sony Playstation", "release_date": "May 2, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Hot-B", "publishers": "Starfish", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130194-the-blue-marlin\n"}