{"altername_name": [], "name": "The Legend of Heroes III: Shiroki Majo: Mouhitotsu no Eiyuutachi no Monogatari", "overview": "The Legend of Heroes III is a computer role-playing game originally developed by Nihon Falcom Corporation. Its initial release was 1993 for the NEC PC-9801. It was also released for Sega Saturn, Sony PlayStation, and Microsoft Windows in 1998. A remake of this game was released for the PlayStation Portable in 2004, and was later given a United States release in 2006. However, the remake of The Legend of Heroes IV: A Tear of Vermillion had been released before this game in the US, under the title The Legend of Heroes: A Tear of Vermillion. This resulted in the confusing re-titling of The Legend of Heroes III to The Legend of Heroes II: Prophecy of the Moonlight Witch in the US. STORY: A long time ago, a girl traveled around Tirasweel. Her silver hair shone even in the moonlight, and her eyes were clear as a fountain. She could cast a glance into the future. When good things happened, people admired her. When bad things happened, people accused her. Some people called her the Moonlight Witch. A long time ago, a Witch traveled around Tirasweel. She disappeared, leaving many questions behind... The Legend of Heroes III begins the story with childhood friends Jurio and Chris as they embark on a pilgrimage to five shrines surrounding their village. During their journey, they learn of the dangers of the Raual Wave that threatens to destroy everything in its path. Can Jurio and Chris, with the help of their friends, stop the Raual Wave emanating from Queen Isabella's castle? Will they discover the identity of the mysterios \"Moonlight Witch\" who predicted it all? This game is actually the second of the Gagharv Trilogy and the third in the Dragon Slayer: The Legend of Heroes series -- its sequel, A Tear of Vermillion, was the first brought to America for PSP to kick the series off (I and II stayed in Japan), with the original Prophecy of the Moonlight Witch following as \"part II\" to complete the story.", "platform": "Sony Playstation", "release_date": "March 19, 1998", "game_type": "Released", "esrb": "", "developers": "Nihon Falcom", "publishers": "GMF", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109950-the-legend-of-heroes-iii-shiroki-majo-mouhitotsu-no-eiyuutachi-no-monogatari\n"}