{"altername_name": ["The X-Files Game"], "name": "The X-Files", "overview": "Do you believe in the existence of extraterrestrial life? Is the government conspiring to cover up evidence? The truth is out there, but you'll have to go looking for it when you take on the role of Craig Willmore, an FBI field agent assigned to search for missing agents Fox Mulder and Dana Scully in Fox Interactive's The X-Files. Previously a hit PC title, this interactive movie-adventure will take your PlayStation console into the realm of the popular X-Files science fiction drama series, as you assist the stars in their latest investigation into paranormal activity cases. Designed from a story written by Chris Carter, The X-Files features many of the main cast members from the show including Assistant Director Walter Skinner, as well as new characters tailored specifically for this game. You'll be interviewing witnesses and suspects with the aid of special FBI equipment, weapons, and tools. Use them wisely to pick up clues throughout your case and follow-up on crime scenes at the crime lab. Discover a plot that thickens as you progress. The game is viewed from a first-person perspective and features looped video footage when you're at a distance from other characters or environments. When you move in any direction (by clicking on the pointing hand icons), you'll pass through predetermined, fixed frames of digitized scenery. By enabling the Navigating Transitions option, you'll experience more realism when turning left or right, thanks to a motion-blur effect. With the VirtualCinema game engine, the four-disc set breaks new ground standards for PlayStation video technology (FPQ 24-bit), enabling greater compression at the highest quality for video playback. The original footage was shot live, entirely on location in the Pacific Northwest. As you come upon something of importance, such as an FBI agent, a witness or even new items, a video clip starts to play. You'll be making some critical, multiple-choice decisions. The game consists of multiple plot lines and at times, three icons will appear at the bottom of the screen indicating which attitude you want to take towards a certain person. This will affect the next outcome of game flow - be careful what you wish for! Some of the tools you'll be using are a PDA (or Personal Digital Assistant), a cellular phone, your badge, a gun and handcuffs, an evidence kit and lock pick, a digital camera, a flashlight, a pair of binoculars, and night vision goggles. Your PDA is one of your best friends because it allows you to take notes, e-mail reports to your superiors, and utilize the internal map to locate specific areas. Another mission-critical item you'll be using is your very own desktop workstation, which features the ING (Intelligence Network Gateway). With this tool you'll have access to background checks, vehicle license plate numbers, phone number tracing, a database with a full search engine, a Photo Viewer for your camera, e-mail, and important messages and All Points Bulletins.", "platform": "Sony Playstation", "release_date": "January 9, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "HyperBole Studios", "publishers": "Fox Interactive", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.34", "wikipedia": "https://en.wikipedia.org/wiki/The_X-Files_Game", "video_link": "https://www.youtube.com/watch?v=YPT2OZ0p9BM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11248-the-x-files\n"}