{"altername_name": [], "name": "Theme Aquarium", "overview": "Providing a home even Flipper would be proud to call his own this winter is the latest in the Theme series title from Electronic Arts, Theme Aquarium. The game was later released for PC in Europe with the name of Aquarium and in english language. The game features 2 game modes: - Standard: The player can choose between an aquarium park in USA, Australia or Japan. - Story: The player got different missions that he got to try complete. Beginning with an expanse of empty floor space, your task is to construct a maritime wonderland that will bring visitors flocking to witness your famous Dolphin Show and thrill at the aquatic menagerie you have built up. In place of fairground attractions or hospital rooms, players construct aquaria which they must fill with interesting and appropriate creatures at the same time as dealing with all the attendant challenges of running a business including that old chestnut -- employee negotiations. Since the dolphin show is your star attraction, proper care and attention has to be lavished upon the animals; easily done because the game is compatible with the Pocket Station, meaning you can play with, feed, and generally nurture them constantly, Tamagotchi style. GAMEPLAY: The gameplay is very similar to the other games in the Theme series, and the graphics are similar to Theme Hospital. In Theme Aquarium, the player begins with an expanse of empty floor space and the task is to construct a maritime attraction for visitors which must be filled with interesting and appropriate creatures at the same time as dealing with all the attendant challenges of running a profitable business. There are two ways of getting fish and other sea life, either by buying them off sellers or by catching them yourself. Dolphin shows can also be created and serve as the star attraction of the aquarium. Staff must be hired to maintain the aquarium and also to take proper care and attention to the animals. Manufacturer's description: Management of the aquarium simulation game. Fish collected from around the world and proficient staff, to increase the customer.", "platform": "Sony Playstation", "release_date": "February 17, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Bullfrog Productions", "publishers": "Electronic Arts", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112899-theme-aquarium\n"}