{"altername_name": ["サウザンドアームズ"], "name": "Thousand Arms", "overview": "In the quiet country of Tradguld, there are many sleepy little towns. Langoud rests on the coast, Sharan is the floating city where most of the trade and business is done, and Myscatonia is clouded in mystery and wonder. Each city has nothing in common with the other except for the fact they share the same country. That is until the Dianova sets their sights on them. Dianova is a dark evil empire bent on conquering the world through swords and magic. PLOT: Meis Triumph lives in the nature-rich town of Kant deep within the countryside of Tradguld. He has no worries and lives with his loving family who happens to be powerful Spirit Blacksmiths. Then the Dianova brought their war-machine crashing down on his quiet life. Everyone was forced to flee in terror and Meis became separated from the family he loved. He fled to Boyzby where he vows to free his people from the terror and oppression of the Dianovan Empire and where he meets the beautiful Sodina. Now the adventure truly begins. GAMEPLAY: Thousand Arms by Atlus is an RPG with a faceted story and intricate gameplay. As in all RPGs, it has a turn-based combat system but only the character in the fist position may attack. The other two members of your party are used for defensive back-up. You play as Meis Triumph, heir to the Triumphs, a family of Spirit Blacksmiths. You can add two other members to the war party. You must travel the world and talk to people in the cities and towns to get valuable allies and information that will aid you on your quest. Stop in the village shops to get new armor, weapons and other items to truly make your band of heroes unstoppable. You also have to go on dates as all great heroes do. Rather than seeking love, these dates have another purpose. Keep your date happy and you can get special weapons, information and new abilities. So be sure to be a gentleman and always pay attention to what must be done in the mini-games to win her over! As a Spirit Blacksmith you have the ability to make weapons better by increasing their attack and defensive power as well as adding new features and spells. Of course, along the way you must battle enemies, explore dungeons and perform mini-quests in order to achieve your ultimate goal: the destruction of the Dianovan Empire and the evil Mecha. Are you hero enough to save your people? Are you suave enough to be a great date? Do you have the emotional and spiritual power to be a truly powerful Spirit Blacksmith? Pray you do; your entire race is depending on you.", "platform": "Sony Playstation", "release_date": "December 17, 1998", "game_type": "Released", "esrb": "T - Teen", "developers": "Red Company", "publishers": "Atlus", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.48", "wikipedia": "https://en.wikipedia.org/wiki/Thousand_Arms", "video_link": "https://www.youtube.com/watch?v=4yLgfGxvumU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13075-thousand-arms\n"}