{"altername_name": ["Three Lions: The Official England Team Game"], "name": "Three Lions", "overview": "Z-Axis and Take 2 Interactive's Alexi Lalas International Soccer brings the global sport to your PlayStation. Players are greeted with two options -- a friendly match and the tournament. The former is simply a single game against a friend or the computer. In both modes, players have the option to choose from 70 actual international teams complete with real rosters. The real meat and potatoes lies within the tournament aspect. Once a team has been selected, the objective is to guide them to the World Cup -- the supreme objective in soccer. After a team plays three matches, the knock-out tournament begins. Weaker teams that are prone to losing are then dropped from the tournament as the quarterfinals begin. Tournaments are played just like the real thing -- commit an offense and you'll be penalized! The game uses official and up-to-date rulings (circa 1999) for international soccer. Like Electronics Arts says, \"If it's in the game, it's in the game\" -- Alexi Lalas Soccer features a wide variety of goal kicks, back-passes, slides, shin hits, etc. In order to achieve the World Cup, it will be up to the player to manage his or her team successfully. To do this, you'll need to set up strategies depending on the team you're playing, initiate player substitutions and keep your eye focused on the gameplay. On each given team, you have the option of comparing each player in skill -- this becomes very useful for setting up squad formations (28 in all). Depending on your players' skills, you may want to set up a squad for attacking and a squad for defense. How you choose to do it is entirely up to you! Alexi Lalas International Soccer comes equipped with over 250 motion captured soccer actions courtesy of Eric Wynalds who coincidentally is on the United States team with Alexi Lalas. Additionally, it combines high-resolution graphics with a variety of different camera angles (six in all). There is also an option to play the game in Spanish.", "platform": "Sony Playstation", "release_date": "April 15, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "Z-Axis", "publishers": "Take-Two Interactive", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10293-three-lions\n"}