{"altername_name": ["Time Bokan Series: Bokan to Ippatsu! Doronboo", "Bokan to Ippatsu! Doronbo: Time Bokan Series"], "name": "Time Bokan Series: Bokan to Ippatsu! Doronbo", "overview": "Bokan to Ippatsu! Doronbo features 8 stages which involve Doronjo and her gang defeating a certain hero. At the beginning of each level, the player has access to six mechs each with different stats based on attack power, speed and shield. Half way through the game, an additional three mechs are unlocked. Once the player has made their choice, they are locked into that mech for the duration of the level and cannot switch to another until the next level. Also, players cannot use the same mech twice in a row, due to required repairs. Similar to other Shoot 'Em Ups, players can upgrade their vehicle's weapons up to level four through the use of powerups in the form of Doronjo emblems. However, upon contact with a Yatterman hat, their weapons are degraded. There are several other pickups that can be obtained such as ones that restore the player's shield, grant extra lives or enable 'turbo' allowing the player to move much faster for a short period of time. Also scattered throughout the levels are skulls, which once collected up to a certain amount, allow the player to transform into a large mech and unleash a devastating attack. The player also has access to an unlimited supply of bombs, but each must be loaded individually and can be charged before being thrown. However, this limits the movement speed of the mech and while holding bombs players cannot perform barrel rolls, a vital move in the game. If the player loses all of their shield, their mech explodes and the Doronbo gang appear riding a bicycle with a simple attack. This grants the player the chance to find a shield pickup and continue on.", "platform": "Sony Playstation", "release_date": "November 29, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Banpresto", "publishers": "Banpresto", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.93", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80634-time-bokan-series-bokan-to-ippatsu-doronbo\n"}