{"altername_name": [], "name": "Time Crisis", "overview": "As Richard Miller, your primary objective is to eliminate all moving targets and save the girl; if you accept this mission, there will be lots of carnage and death following in your wake. Developed by Namco and previously released in the Arcade, Time Crisis is a first-person on-rails light gun shooter; there are two versions -- one with the Guncon peripheral and one without. Using either control method, you'll blast your way through three stages, each with four areas filled with hired goons and vile boss characters. When the action stage begins, you'll start from a crouched position while enemy troops try and thwart your objective. While they're reloading, stand up and start spraying the area. You will have the option of crouching behind objects at anytime during gunfights. Just remember to keep your gun reloaded! STORY: The main plot of the original Time Crisis arcade game release involves an attempted coup in the fictional republic of Sercia. For a millennium, the Garo family ruled Sercia with an iron fist. In 1995, the V.S.S.E. International Intelligence Agency sent William MacPherson, who successfully toppled the Garo regime and became its first democratically elected president. The last remaining member of the Garo family, Sherudo Garo, sought to recapture the throne from the hands of President MacPherson. He sends a mercenary named Wild Dog and kidnaps the president's daughter, Rachel. Garo demands military secrets in return for Rachel's safe return or he will kill her by sunset. V.S.S.E. sends its best agent, Richard Miller (also called the One-Man Army) to break in, invade Garo's castle and rescue Rachel. GAMEPLAY: Time Crisis is a three-dimensional first person rail shooter similar to Virtua Cop and The House of the Dead installments, in which the player holds a light gun and goes through the motions of firing at on-screen enemies. Time Crisis is best known for its cover system, in which players can duck behind cover to avoid enemy fire and reload his weapon. There are three stages, each consisting of three areas and a boss fight. There are various modes in which to choose including Arcade, Time Attack and the Special modes. Like the name implies, the Arcade mode is the original version of Time Crisis. Here, you'll follow the storyline and play until you've run out of lives, time or continues. Time Attack will have you blasting goons with unlimited lives. However, you must clear the stage as quickly as possible. In the Special mode, Richard Miller receives a new mission -- to infiltrate a weapons factory. Unique to the PlayStation, your success in this mode will determine the route the game will take.", "platform": "Sony Playstation", "release_date": "October 31, 1997", "game_type": "Released", "esrb": "T - Teen", "developers": "Namco", "publishers": "Namco", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.08", "wikipedia": "https://en.wikipedia.org/wiki/Time_Crisis_(video_game)", "video_link": "https://www.youtube.com/watch?v=Y-U4vVZ1TNI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/595-time-crisis\n"}