{"altername_name": [], "name": "Time Gal & Ninja Hayate", "overview": "Time Gal is a FMV-based game which uses pre-recorded animation rather than sprites to display the on-screen action. Gameplay is divided into levels, referred to as time periods. The game begins in 4001 AD with the theft of a time travel device. The thief, Luda, steals the device to take over the world by changing history. Reika Kirishima (霧島零香?), the protagonist also known as Time Gal, uses her own time travel device to pursue him; she travels to different time periods, such as 70,000,000 BC, 44 BC, 1588 AD, and 2010 AD, in search of Luda. Each time period is a scenario which presents a series of threats that must be avoided or confronted. Successfully navigating the sequences allows the player to progress to another period. The player uses a joystick and button to input commands, though home versions use a game controller with a directional pad. As the game progresses, visual cues—highlighted portions of the background or foreground—will appear on the screen to help survive the dangers that occur throughout the stage; more difficult settings omit the visual cues. Depending on the location of the cue, the player will input one of four directions (up, down, left and right) or an attack (shoot the target with a laser gun). Inputting the correct command will either avoid or neutralize the threats and progress the game, while incorrect choices result in the character's death. Reika dying too many times results in a game over. Specific moments in the game involve Reika stopping time. During these moments, players are presented with a list of three options and have seven seconds to choose the one which will save the character.", "platform": "Sony Playstation", "release_date": "July 5, 1996", "game_type": "Released", "esrb": "", "developers": "Taito", "publishers": "Taito", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.89", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=0CvT49dXy9s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24856-time-gal-ninja-hayate\n"}