{"altername_name": ["C3 Racing: Car Constructors Championship", "C3 Racing", "Max Power Racing"], "name": "TNN Motorsports Hardcore TR", "overview": "C3 Racing is a racing game released in 1998 by Infogrames for the PlayStation. The game allows you to race in 11 locations around the world in a variety of sports cars. In each country there are three tracks to race on. The term C3 Racing stands for three C's; Car Constructors Championship. The game was released in the UK as Max Power Racing as a tie-in to the Max Power magazine. In North America, the game was released as TNN Motorsports Hardcore TR, which featured different cars, but with the similar tracks (but relocated to locations within the United States) and menus. As another addition to the off-road racing genre, TNN Motorsports HardCore TR features over 30 unique courses and 24 souped-up hotrods and all-terrain trucks customizable to your own preferences. Tracks span various locations throughout the United States ranging from the deserts and dirt trails of Arizona and the muddy swamps of Florida to the familiar wine valley landmarks of Northern California and the deep canyons of New Mexico. Held together by a map outlining race locations, the gameplay options include an Arcade, Championship, Player, Time Trial and Test Track modes. After making various modifications to your truck, you'll want to select the Test Track in order to see whether or not those changes positively or negatively affected your vehicle. Once your truck's handling and feel is to your liking, its time for some competition!", "platform": "Sony Playstation", "release_date": "December 2, 1999", "game_type": "Released", "esrb": "E - Everyone", "developers": "Eutechnyx", "publishers": "American Softworks", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.44", "wikipedia": "https://en.wikipedia.org/wiki/C3_Racing", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/13064-tnn-motorsports-hardcore-tr\n"}