{"altername_name": [], "name": "To Heart", "overview": "To Heart is a Japanese adult visual novel developed by Leaf and released on May 23, 1997 for the PC. It was later ported to the PlayStation and given voice acting. The PlayStation version had the adult scenes removed. To Heart was adapted into a thirteen-episode TV anime series by Oriental Light and Magic aired between April and July 1999, and a second anime, To Heart: Remember My Memories, aired between October and December 2004. The gameplay in To Heart requires little player interaction as much of the game's duration is spent reading the text that appears on the screen, which represents either dialogue between various characters or the inner thoughts of the protagonist. Every so often the player will come to a \"decision point\", where he or she is given the chance to choose from multiple options. The time between these points is variable and can occur anywhere from a minute to much longer. Gameplay pauses at these points, and depending on which choice the player makes, the plot will progress in a specific direction. There are eight main plot lines that the player will have the chance to experience, one for each of the heroines. In order to view all eight plot lines, the player will have to replay the game multiple times and make difference decisions to progress the plot in an alternate direction. In this game, you play as Hiroyuki Fujita, a high-school student who seems to have more interest in romance than in his studies. In his school there are several pretty girls, and his goal is to be nice to one of them, to make the right decisions when talking to her, and ultimately to win her heart. \"To Heart\" plays like a \"choose your own adventure\" book: you read text and look at CG images, and at some point you'll have to choose a response or an action out of several available ones. Your decisions determine the outcome of the story. Each girl has her own \"path\" and ending, with various degrees of difficulty to attain. The Playstation version got also unlockables voices and cg galleries of the characters that will be unlocked with the saves made during playing the adventure.", "platform": "Sony Playstation", "release_date": "March 25, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Aqua Plus", "publishers": "Aqua Plus", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/To_Heart", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102965-to-heart\n"}