{"altername_name": ["Tokimeki Memorial 2 Substories: Dancing Summer Vacation"], "name": "Tokimeki Memorial 2 Substories Vol. 1: Dancing Summer Vacation", "overview": "At the start of the game the player is an 8 year old boy The girl next door, Hikari Hinomoto, is your best friend. However, you move away, and Hikari is very sad (heart-wrenching anime sequence...) But before you move, you meet an array of other girls, who are close and not so close friends! The player meet these girls and have events with them in the first few days of the game... But some girls appear on certain days (Like Mei, for instance). DANCING SUMMER VACATION: It's summer, you got a call from Miyuki-chan one morning to ask you to go out on a date to the game center. You went with her, and unbelivably, she got perfect score for DDR. She was spotted by a DDR contest official, and he asked her to join the DDR competition. The next day, she called you and she showed you how bad she really is. After you dance, she asked you to be her partner and you agreed. Then, you called Hikari-chan for help on DDR. She said she will come after her athletic club the next day. The next day, Hikari-chan came. She borrowed you her DDR. It's new and she just bought it. You felt awkward, but she said she bought it for herself, not for you. She wanted to buy it long time already. She then coached you to play DDR. The next day, you went to Miyuki-chan's house. After you showed her your dance, suddenly the floor collapsed under you and sent you to the hospital. You no longer able to play DDR, but you promised Miyuki-chan that you will look for a partner for her.", "platform": "Sony Playstation", "release_date": "September 28, 2000", "game_type": "Released", "esrb": "", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112905-tokimeki-memorial-2-substories-vol-1-dancing-summer-vacation\n"}