{"altername_name": [], "name": "Tokimeki Memorial: Taisen Tokkaedama", "overview": "Like its predecessor, Puzzle Dama, is based on an already existing game engine with no noticeable changes in gameplay. As rows of balls are slowly pushed up from the bottom of the screen you move your cursor around. Picking up a ball from under the cursor, you can then move it to another point on the screen and switch it with a ball at that location or release it in an empty space, to drop down onto the puzzle. If at any time three or more balls of the same color become adjacent, they will disappear, allowing balls above them to fall down and possibly start a chain reaction. The game graphics are identical to the arcade Tokkae Dama. To customize the game for theTokimeki Memorial environment, the backgrounds have been changed to pictures of the various TokiMemo girls. Unfortunately most of the artwork is rather uninspired. The body proportions and poses all appear identical across the spectrum of girls, leading to some rather freakish looks when the characters are pasted onto the bodies. The ending sequences are fairly good though, and the SD characters shown while the credits roll are extremely good. Thankfully the game is fairly playable. The various modes give a wide degree of challenge, although you need a win on either Tokimeki mode or second/third year (difficulty) of the Kirameki mode to get an ending. One feature which players of Puzzle Dama will definitely appreciate is that the CPU does not appear to cheat during the final stage. GAMEPLAY: Tokkaedama has a 6x12 (base by height) playing field. If all of your columns (i.e. your entire playfield, not just one particular column) become filled, you will lose. There are two types of pieces on the board: ko-damas (small, square pieces) and o-damas (large, round pieces) (\"tama/dama\" ~= \"ball\"). You get to move a special piece around the board called a hane-dama (it looks like a winged circle), in which you can hold one ko-dama or o-dama at a time. The hane-dama can switch the piece it's holding with the piece it's currently hovering over (\"tokkae\" ~= \"switch/give&take\"), drop the piece it's holding if the space it's over is empty, or grab a piece from the board if the hane-dama is empty. If three or more o-damas of the same color (there are five colors) are made to touch each other (vertical or horizontal adjacency counts as \"touching\"; diagonals don't count), they will disappear. Any ko-dama next to (once again, diagonals don't count) an o-dama that disappears will become an o-dama. Setting off chain reactions (chains) (one o-dama set disappears, triggering another set to disappear, etc...) will send ko-damas over to your's opponent's board in a manner determined by your character's attack-pattern. The playfield will slowly (it gets faster as time progresses) inch its way upwards, revealing new pieces (you can even manually push it up a bit if you're in need of a particular piece), row by row...", "platform": "Sony Playstation", "release_date": "September 16, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95720-tokimeki-memorial-taisen-tokkaedama\n"}