{"altername_name": [], "name": "Tokyo Mew Mew: Toujou Shin Mew Mew! Minna Issho ni Gohoushi Suru Nyan", "overview": "Tokyo Mew Mew, also known as Mew Mew Power, is a Japanese shojo manga series written by Reiko Yoshida and illustrated by Mia Ikumi. It was originally serialized in Nakayoshi from September 2000 to February 2003, and later published in seven tankobon volumes by Kodansha from April 2003 to May 2004. It focuses on five girls infused with the DNA of rare animals that gives them special powers and allows them to transform into \"Mew Mews\". Led by Ichigo Momomiya, the girls protect the earth from aliens who wish to \"reclaim\" it. At the start of the series, a young girl named Ichigo Momomiya attends an endangered species exhibit with her 'crush' and future boyfriend, Masaya Aoyama. After an earthquake, Ichigo and four other girls are bathed in a strange light. A cat appears before Ichigo, then merges with her. The next day she begins acting like a cat and, after meeting Ryou Shirogane and Keiichiro Akasaka, learns that she was infused with the DNA of the Iriomote Cat. Ryou and Keiichiro explain that this allows her to transform into Mew Ichigo, a powerful heroic cat girl. She is ordered to defeat chimera animas—alien parasites—which infect animals and turn them into monsters. Ryou and Keiichiro instruct Ichigo to find the four other girls from the exhibit—the remaining Mew Mews. They are Mint Aizawa, a spoiled, wealthy girl who is infused with the genes of the Ultramarine Lorikeet; Lettuce Midorikawa, a meek girl who endures constant bullying and absorbs the genes of the Finless Porpoise; young Pudding Fong, who receives the genes of the Golden Lion Tamarin; and Zakuro Fujiwara, a professional model infused with the genes of the Gray Wolf. The five Mew Mews battle the chimera animas and their alien controllers, Kish, Pie and Tart. Kish claims to be in love with Ichigo; he tries to gain her love despite the fact that he is trying to eliminate the other Mew Mews. Two more aliens, Pie and Tart, later join Kish in trying to destroy the Mew Mews. As the fighting intensifies, the Mew Mews are tasked with finding \"mew aqua,\" a material created from pure water that contains immense power for combating the alien attacks. During a battle with Kish at an aquarium, Ichigo is in danger of losing when the mysterious Blue Knight appears and rescues her. He returns periodically throughout the series, protecting Ichigo from various dangers; it is later revealed that the Blue Knight is in fact Masaya. Shortly after this discovery, Masaya collapses and transforms again, into Deep Blue—the alien leader who wants to destroy humanity. After explaining to Ichigo that Masaya was a false form for temporary use, Deep Blue attacks the Mew Mews. Masaya's personality briefly reappears and he uses a nearby mew aqua drop to destroy Deep Blue, killing himself in the process. Crying over his body, Ichigo pours her power into Masaya to save his life, losing her own in the process. Masaya kisses her, changing her back to a human, and revives her. Ryou gives Pie the remaining mew aqua to save the aliens' world, after which Kish, Pie and Tart say their goodbyes and return to their own world. In this full voice RPG, you have an original character called \"Mew Ringo\" in your party! This game marks the debut of \"Mew Ringo,\" a new character created by Mia Ikumi, the original author. She levels up depending on how well she gets along with the other characters. The storyline might change, giving you an opportunity to show off your teamwork skills in battle. Also, it's a full voice game because it has all of the same voice actors from the anime.", "platform": "Sony Playstation", "release_date": "December 5, 2002", "game_type": "Released", "esrb": "", "developers": "Takara", "publishers": "Takara", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136026-tokyo-mew-mew-toujou-shin-mew-mew-minna-issho-ni-gohoushi-suru-nyan\n"}