{"altername_name": ["Tokyo Majin Gakuen Ken Kaze Tobari", "Tokyo Majin Gakuen - Kenpuuchou"], "name": "Tokyo Majin Gakuen Kenpuu Chou", "overview": "The Tokyo Majin series features high school students. In this game the player choices will make the story to go in different ways (depending of what the player choose) and will have different characters, different fights and different places. Tokyo Majin Gakuen was also released as a Japanese anime series, which premiered in Japan on the anime satellite TV network Animax based on this PlayStation game, In the nights of Tokyo, mysterious deaths involving the 'Reborn Dead' occur. People that are disappearing at night suddenly reappear during the day as a corpse. Not only that, but as the corpses are sent to the morgue to be autopsied, they disappear again leaving signs showing that they escaped themselves. To fight these 'Reborn Dead' and to prevent more deaths, mysterious transfer student, Tatsuma Hiyuu, and delinquent student, Kyouichi Houraiji, stay up every night to fight and solve what's causing this. Along with the rest of their group, who all have supernatural powers, they soon realize that a greater threat, which involves even more powerful demons, is near. Tokyo Majin Gakuen Ken Kaze Tobari (aka Kenpu Cyou) is the first game in the Tokyo Majin game series. 10 years later, the game was upgraded and released on Nintendo DS with the title Tokyo Majin Gakuen: Kenpuchou. Early preorders of the re-release included a pair of bonus Tokyo Majin Gakuen chopsticks that were given out in 30% ratio. The game told the story of a siege on Tokyo where undead beings and demons conspired to expand their sphere of influence. To combat the supernatural threat, a group of gifted students from Magami High School venture out every night to suppress the menace and get to the bottom of why Tokyo has been targeted. Year: 1997. Tokyo Majin Gakuen begins on a dark and stormy night where three ruffians are about to harass a lone stranger. Little do they know that he's armed, skillful, and not someone to be trifled with. Year: 1998. The din of a group of students blares through the speakers and a view of a standard classroom appears on the screen. A green chalkboard spans the front of the room and the backs of seats and tables may be seen. The assembly bell rings and a teacher appears in front of the class. She says, \"Good Morning Everybody\" and the class chimes back \"Good Morning Miss Maria.\" Tokyo Majin Gakuen is a mix of lengthy interactive sequences with other characters in the game and conventional S-RPG battles where a team of students battle undead and other undesirables in isometric-viewed action. The introductory sequence is rather lengthy with only a small amount of input required as the game sets up the background and current situation. From the moment you start the game and go through the entire intro, roughly 50 minutes will have passed. You'll get to save your progress to one of four slots after the introduction.", "platform": "Sony Playstation", "release_date": "June 16, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Shout! Designworks", "publishers": "Asmik Ace Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113071-tokyo-majin-gakuen-kenpuu-chou\n"}