{"altername_name": ["Tombi! 2", "Tomba! The Wild Adventures", "Tombi! 2: Contra los cerdiablos", "Tomba 2: The Evil Swine Return"], "name": "Tomba! 2: The Evil Swine Return", "overview": "That pink-haired, pig-thumping jungle boy is at it again. Tomba! 2: The Evil Swine Return marks Tomba's second adventure on the PlayStation console. This time around Tomba has grown into a young man and is living a peaceful life with his friends. One day a letter falls from the sky. As Tomba opens it a friendly little bug named Zippo pops out and informs him that the evil pigs have returned and are invading a neighboring land. Zippo then tells him the worst news of all: The evil pigs have kidnapped his childhood friend Tabby. Now Tomba must embark on yet another challenging adventure to rescue his friend. Tomba! 2 takes place in a brand new 3D world. Using an Adventure Journal to record his progress Tomba travels from land to land, talking with townspeople and kicking some Swine tail in order to complete numerous mini-quests and rescue Tabby. The Adventure Journal keeps track of the items Tomba has acquired, the status of events he has discovered, and his current location and condition. Throughout his journeys, Tomba finds various weapons and clothing that can alter his abilities and aid him in his quests. For example, when Tomba acquires the Bird Clothes he is able to glide through the air for a limited time, allowing him to overcome obstacles that were previously impassable. Along with weapon attacks and special clothes, Tomba still has basic actions allowing him to pummel pigs, read signs, climb surfaces, bite and throw enemies, and communicate with the townspeople. Tomba! 2 features two modes of play. The first is an Action mode where Tomba travels along predetermined paths, jumping, fighting and solving action-oriented events. The second mode is a Free-Roaming mode where Tomba can move freely in 360 degrees. While in this mode, Tomba cannot jump or attack with weapons; however, no enemies appear and Tomba can focus on completing other events without fear of being attacked. Tomba! 2: The Evil Swine Return is a one-player game and uses one memory block to save data. Analog control and vibration function is supported. This time the Swine have crossed the line. Help Tomba rescue Tabby and defeat the evil pigs once and for all.", "platform": "Sony Playstation", "release_date": "January 18, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Whoopee Camp", "publishers": "Sony Computer Entertainment", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.77", "wikipedia": "https://en.wikipedia.org/wiki/Tomba!_2:_The_Evil_Swine_Return", "video_link": "https://www.youtube.com/watch?v=hS_QDj36wHM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9489-tomba-2-the-evil-swine-return\n"}