{"altername_name": ["Tomb Raider 3", "Tomb Raider III: Les Aventures de Lara Croft"], "name": "Tomb Raider III: Adventures of Lara Croft", "overview": "In the Prologue, millions of years ago, a meteor struck the then tropical environments of Antarctica. It was first discovered by a tribe of ancient Polynesians who settled there and constructed a city in the meteorite crater. They worshipped the immense supernatural powers it appeared to hold, fashioning four artefacts out of the meteorite's core material (which become the focus of the game). Shortly thereafter, the tribe laid witness to the deformed birth of their prophesied leader, born without a face, and fled Antarctica in fear of what the meteorite was capable of. In the present day, the ancient Polynesian city has been buried beneath snow and ice and RX Tech are excavating the site, investigating the meteorite. Led by Dr. Willard, the crew discovers remnants of the Polynesian city, ancient stone statues resembling the Easter Island Moai, and finds the grave of a man named Paul Caulfield of the HMS Beagle. When the game begins, Lara Croft is in India searching for a legendary stone in the ruins of an ancient temple once inhabited by the Infada tribe. She encounters Tony, an RX Tech employee who seems to be suffering from a severe bout of jungle fever. After parting ways, Tony remains one step ahead of Lara in their search for the stone, eventually finding it hidden deep within an underground cavern. After killing an oddly superhuman Tony, Lara takes the stone and exits. On her trek back to the Indian jungle, she is discovered by Dr. Willard.", "platform": "Sony Playstation", "release_date": "November 21, 1998", "game_type": "Released", "esrb": "T - Teen", "developers": "Core Design", "publishers": "Eidos Interactive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.10", "wikipedia": "https://en.wikipedia.org/wiki/Tomb_Raider_III", "video_link": "http://www.youtube.com/watch?v=7To-vVJbizk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2431-tomb-raider-iii-adventures-of-lara-croft\n"}