{"altername_name": ["Stolen Song: A Virtual Music Adventure: Tomayasu Hotei"], "name": "Tomoyasu Hotei: Stolen Song", "overview": "Tomoyasu Hotei: Stolen Song is a musical adventure featuring songs by Tomoyasu Hotei where the player strives to become a professional guitarist. The game uses entirely live-action scenes and actors to forward the story which uses 1st-person perspective and is presented in somewhat a comic-style during interaction and descriptive elements with actors facing the player when talking to you. During interactive scenes the player can jump from selectable objects on the screen which are highlighted so player can tell which object is currently being selected. The guitar playing scene shows a blurry background image with an ongoing song where the goal is to play the note at the proper moment to earn points and by earning them background image becomes more and more clear with the goal to make it crystal clear by the time song ends. During song play the bar will use red and green lights to show your current status, whether you're doing it good or bad. Right notes are played automatically, player just needs to press the same button on a controller at the right time in a song. In the settings area the player can choose difficulty level and type of guitar (rhythm or lead) and how guitar sounds should sound like. The game also supports two-player band mode where each play their own instrument (i.e. guitar and drums). From the main menu you can also check the guitar rack to show you all the guitars you have currently won in competitions.", "platform": "Sony Playstation", "release_date": "May 21, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Virtual Music Entertainment", "publishers": "Sony Computer Entertainment", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135207-tomoyasu-hotei-stolen-song\n"}