{"altername_name": ["Battle Arena Toshinden Subaru", "Toshinden Subaru", "Battle Arena Toshinden 4"], "name": "Toshinden 4", "overview": "The fourth Toshinden game. As usual, the basic concept is standard Beat'em'Up fare - two men enter, one man leaves. This time around, characters work in teams of three and are selected as such, although there is a normal single-character versus mode for two players as well. Most of the \"old\" faces have been removed and replaced with new characters, and some of those that remain have changed significantly. Other than that, the (nowadays somewhat standard-fare) twist of \"overdrive\" bars that fill up during combat and can be used for extra-powerful special moves is back from the previous incarnation. Like many other things, the system has slightly changed in Toshinden 4 compared to its predecessor: the overdrive bar is separated in three units, and characters either have normal overdrive moves that empty one third of the bar, or a particularly devastating special that uses up the whole bar at once. Manufacturer's description: Battle Arena Toshinden 4 is a spectacular 3d combat tournament that goes beyond the limits in an all-out battle where reflexes, skills and timing are essential to defeat the many adversaries. Each bout is played within an incredible 3d location, with every move and counter attack displayed in stunning detail. Toshinden 4 blends a wealth of stunning showcase moves with all the traditional moves. The result is a free-flowing fight boasting cinematic visuals. New \"overdrive\" mode allows you to produce devastating combinations of moves and the innovative team battle mode creates a truly incredible battle royale. Features: Third person perspective 3D graphics Cartoon graphics Martial Arts & Fighting themes.", "platform": "Sony Playstation", "release_date": "June 30, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Takara", "publishers": "Virgin Interactive Entertainment", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2.84", "wikipedia": "https://en.wikipedia.org/wiki/Toshinden_4", "video_link": "https://www.youtube.com/watch?v=I9cTNLVGNJ0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11104-toshinden-4\n"}