{"altername_name": [], "name": "Touge Max 2", "overview": "Toge or Touge is a Japanese word literally meaning \"pass.\" It refers to a mountain pass or any of the narrow, winding roads that can be found in and around the mountains of Japan and other geographically similar areas, like the legendary Nordschleife in Germany. In order to decrease the incline of mountain roads, thereby making them easier for commercial trucks to pass, engineers place a series of S bends in steep roads that provide access to and from high mountain elevations. These passes have become popular with street racers and motorsport enthusiasts because they provide a challenging, albeit dangerous, course. Toge racing's notoriety outside of Japan may be attributed to entertainment media such as Initial D (originally manga, and later anime, and in 2005, live action under the Chinese title Tou Wen Zi D. Touge is a series of touge racing games published by Atlus in Japan since 1995. The series was originally developed by Cave, however Touge R was developed by Nextech. As best sellers, Touge Max: Saisoku Drift Master and Touge Max 2 received re-releases in Sony's The Best line of budget range games. The gameplay focuses on import sports cars driving downhill in Japanese mountain passes using the drifting technique on curves. The first Touge Max game was the only game released outside Japan, and Touge Max 2 is the first game released only in Japan. Game Modes: - King Battle: Battle against the king of each of the 4 courses and there are 3 difficulty levels and different cars to choose. - School: practice the tracks and learn the drift basics - Time Trial: Race againts time - 2 Players: Compete compete against another human player - Story: Compete against computer controller players in a story mode in which the player is a young driver that wants to become the drift king and the player will go through different jobs, situations and vehicles to drive.", "platform": "Sony Playstation", "release_date": "September 17, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Cave", "publishers": "Atlus", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.58", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95722-touge-max-2\n"}