{"altername_name": [], "name": "Touhou Chinyuuki: Halfling Hearts", "overview": "Touhou Chinyuuki - Hafling Hearts!! is an adventure game based on the classical chinese novel Journey to the West. Journey to the West is one of the Four Great Classical Novels of Chinese literature. Originally published anonymously in the 1590s during the Ming Dynasty, its authorship has been ascribed to the scholar Wu Cheng'en since the 20th century. The novel is a fictionalised account of the mythologized legends around the Buddhist monk Xuánzàng's pilgrimage to India (known as the Western Regions) during the Táng dynasty in order to obtain Buddhist religious texts called sutras. The Bodhisattva Guanyin, on instruction from the Buddha, the historical founder of Buddhism, gives this task to the monk and his three protectors in the form of disciples - namely Sun Wùkong, Zhu Bajiè and Sha Wùjìng - together with a dragon prince who acts as Xuánzàng's mount, a white horse. These four characters have agreed to help Xuánzàng as an atonement for past sins. The novel comprises 100 chapters. These can be divided into four very unequal parts. The first, which includes chapters 1-7, is really a self-contained introduction to the main story. It deals entirely with the earlier exploits of Sun Wùkong, a monkey born from a stone nourished by the Five Elements, who learns the art of the Tao, 72 polymorphic transformations, combat, and secrets of immortality, and through guile and force makes a name for himself as the Qítian Dàshèng, or \"Great Sage Equal to Heaven\". His powers grow to match the forces of all of the Eastern (Taoist) deities, and the prologue culminates in Sun's rebellion against Heaven, during a time when he garnered a post in the celestial bureaucracy. Hubris proves his downfall when the Buddha manages to trap him under a mountain and seals the mountain with a talisman for five hundred years. Touhou Chinyuuki - Hafling Hearts!! use female characters for the main role, instead of the classic male ones, the game takes place in a distant future and Goku and her friends got to defeat an evil enemy that wants to destroy their world. The gameplay is about watching the story part and there are dungeons where the player decides where to go and in some of those spots are enemies to defeat, when they reach the end of the dungeon they face the enemy and the adventure continues. The game features mini games and japanese voice acting for the characters.", "platform": "Sony Playstation", "release_date": "November 22, 1996", "game_type": "Released", "esrb": "", "developers": "Earthly Soft", "publishers": "Naxat Soft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113175-touhou-chinyuuki-halfling-hearts\n"}