{"altername_name": [], "name": "Treasures of the Deep", "overview": "Players assume the role of Jack Runyan, a retired and highly decorated ex-Navy Seal. After serving his country during the Gulf War, he retired his service due to repeated nightmares about the blood he had shed. Jack still had a burning desire, however, and that was to be a man of the oceans. To fulfil that desire,Jack obtained a contract from the Underwater Mercenary Agency and immersed himself in the open seas. His main objective is to search out any and all treasures that lurk at the ocean's floor. Unfortunately, a group of assassins and greed-mongers are searching for the same treasures; it will also be a survival mission with Jack shedding more blood if necessary. There are 14 mission-based objectives in Treasures of the Deep, a third-person action/adventure title from Namco. Players will visit the majestic underwater ruins off the Yucatan Peninsula, explore the mysteries of the Bermuda Triangle, and be on the lookout for sharks in the Great Barrier Reef. Each location and mission has a specific goal: to find the well-documented treasure pertaining to that area. While in the ocean looking for treasure, players are met with a great deal of resistance. There are a variety of underwater creatures like sharks and electric eels that have very little sympathy for your mission. Additionally, other agencies have sent their goons in to stop Jack's mission; players will disperse of harpoon-shooting frogmen, enemy attack subs, underwater turrets, etc. There also eight unique attack submarines, each with differing characteristics. Players are required to choose their vessel wisely; whereas the Deep Rover is a heavily-armored submarine that can hold a wealth of treasure, the Viper is a speedy attack sub best utilized for combat. Be sure to read the mission objectives carefully, as you'll have a better understanding of which submarine to choose. Additionally, players are treated to a variety of power-up items including the devastating torpedo, mines, missiles, seekers, cargo nets used to apprehending frogmen and treasure, sonic missiles, and the plasma torpedo. There are also health pickups and air tanks that replenish Jack's oxygen supply. Treasures of the Deep features a variety of perspectives including the behind-the-back and first-person viewpoints. There are also a couple helpful inclusions such as the life and air gauge meters, a sonar device that guides the player to the next piece of treasure, and an overhead map that fills in upon exploration.", "platform": "Sony Playstation", "release_date": "September 15, 1997", "game_type": "Released", "esrb": "T - Teen", "developers": "Black Ops Entertainment", "publishers": "Namco", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Treasures_of_the_Deep", "video_link": "https://www.youtube.com/watch?v=YGdVyFbmr-w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11091-treasures-of-the-deep\n"}