{"altername_name": [], "name": "True Love Story 2", "overview": "True Love Story is a series of four dating sims (as distinct from the similar but unrelated title True Love). True Love Story and True Love Story 2 were released by ASCII for the PlayStation. True Love Story 3 and True Love Story: Summer Days, and yet... were released by Enterbrain for the PlayStation 2. The True Love Story land are notable for their geko, or walk-home system. When the player asks a girl to walk home with him from school, the game enters a special conversation mode. In this mode, in addition to the usual long-term, strategic \"love meter\", the girl you are conversing with has a short-term, tactical \"heartthrob meter\" representing her level of immediate interest in the conversation with you. The player is given the choice of approximately 30 topics of conversation to choose from, and the heartthrob meter will increase or decrease based on the appropriateness of his selections. High heartthrob can then be leveraged to ask the girl out on a date, or simply to effect a permanent increase in her love meter. Later True Love Story games added further complexity to this system, such as a \"combo\" system measuring the number of consecutive good choices of conversation topics. In large part because of this system, True Love Story is one of the most gameplay-rich dating sims. True Love Story 2 is the second game in the series and features 10 differents girls to date and they and the rest of the game characters got japanese voice acting. The gameplay is about choosing between different places to go each day and meet different people depending of those choices and can talk to different girls and got a better or worse relation with them depending of those choices.", "platform": "Sony Playstation", "release_date": "January 21, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Bits Laboratory", "publishers": "ASCII", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113182-true-love-story-2\n"}