{"altername_name": [], "name": "Tunguska: Legend of Faith", "overview": "Tunguska is a 3D action-adventure game in which you play Jack Riley, an inter-dimensional traveler. The main objective is to decode the secret of the Castle of the Order of Tunguska, where he finds himself after he's accidentally caught by the 'powers of darkness'. In this complex thriller you play Jack, a young man who has escaped from the clutches of a suicidal cult. Except for Jack, all of the members of the cult have perished in a hideous fire. Unfortunately, because of this Jack is accused and convicted of mass murder and sentenced to death. Suddenly, just as he is strapped into the electric chair, Jack is transported into another world -- one much worse than even his own. Death cults, psychopathic monks, being framed for murder; this was only the beginning. Jack now must escape from the terrors of his nightmare, find the real killer, and get back to this world by means of puzzle solving, combat, and a search for obscure but fascinating objects. PLOT: Tunguska is a story of inter-dimensional travel and a struggle whose outcome will effect us all. At the centre of it all is Jack Riley. An innocent party (aren't we all!) who finds himself caught up in the battle that could allow the powers of darkness to rule our earth. Only decoding the secret of the castle of the Order of Tunguska will ensure our survival. Facing cruel creatures of the night is only part of the struggle as Riley comes to terms with the side of his inner self he'd rather forget. GAMEPLAY: The game involves tactical real-time fighting, in which you advance by a skill/level based system, as well as a limited amount of classic adventure gaming and puzzle-solving. When you decode the secret of the Castle, the powers of darkness will be defeated and Jack is free to continue his journey. The 3D rendered world is based on Exortus' self-developed game engine, and the view is 3-dimensional in non-isometric, third-person.", "platform": "Sony Playstation", "release_date": "October 27, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Exortus", "publishers": "Project Two Interactive BV", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31695-tunguska-legend-of-faith\n"}