{"altername_name": ["TV Animation X: Unmei no Sentaku"], "name": "TV Animation X: Unmei no Tatakai", "overview": "X is Clamp's foray into apocalyptic fiction. It combines elements from various end of the world scenarios, both secular and religious, with its own mythos. The story takes place at the end of days, in the year 1999. The series follows Kamui Shiro, a young esper who returns home to Tokyo after a six-year absence to face his destiny as the one who will determine humanity's fate. The series is intended for a female audience, so X is drawn in the ornate style characteristic of shojo manga but with the emphasis on moral conflict and gruesome violence expected of seinen works. The story is influenced by the works of Go Nagai and Kyokutei Bakin. The events take place in 1999. The end of the world is fast approaching as superhuman individuals gather and take sides in the city of Tokyo, the battle site of Armageddon. The key player in this day of reckoning is Kamui Shiro, a young man who returns home to Tokyo after a six-year absence to protect those dearest to him, Kotori and Fuma Monou, and fulfill his mother's dying wish. Unbeknownst to the three friends, Kamui and Fuma are destined to fight each other during the end of the world. The first half of the series focuses on the gathering of the soldiers in the final battle and culminates with Kotori's death at the hands of her brother Fuma, sealing Kamui's choice as the protector of mankind and Fuma's place as his foil. The second half follows Kamui as he grows into his role as savior while the world moves along toward its inevitable destruction. The story is Kamui's heroic journey, where the narrative places an emphasis on his choices and how they affect the world around him as he attempts to reconcile his dual destinies. The Playstation game is a 3d fighting game with these game modes: - Introduction - Battle mode: Story mode. - VS Mode: Playt against the computer or another human player. - Gallery mode: Playing the battle mode will earn points for the player and can use them to unlock the pictures in the gallery. Storyline: The fate of the earth lays in the hands of the 7 Heaven Dragons, the Seals, and the 7 Earth Dragons, the Angels. Will the earth continue to thrive? Will it be destroyed? Now the battle to determine earth's fate begins.", "platform": "Sony Playstation", "release_date": "August 22, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Taito", "publishers": "Bandai", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95842-tv-animation-x-unmei-no-tatakai\n"}