{"altername_name": [], "name": "Tweenies: Game Time", "overview": "Tweenies is a television programme aimed at young children, broadcast on the BBC. The programme is set in a nursery attended by the four Tweenies themselves: Milo, Jake, Bella and Fizz. They are supplemented by two adults, Max and Judy, and two dogs, Doodles and Izzles. The original prototypes for the tweenies characters were designed by Sally Priesig of Mimics Productions; they were later re-scaled into two sizes for the characters shown on the series. In addition, Sally also designed the character costumes and was co-constructor/developer for the Tweenies' full-size puppets. The costume fabric comes from the US and was imported and dyed into their present colours; it is about the same thickness as fleece jumpers. The show includes a \"Tweenie Clock\", with five circular lights arranged in a pentagonal shape with the lights denoting \"news time\" (orange), \"messy time\" (blue: art, sticking, painting), \"song time\" (yellow: generally nursery rhymes or children's classics), \"telly time\" (green; in some later episodes, this is also used when they use the computer) and \"story time\" (red). \"Surprise Time\" is a special time determined when all five lights glow. A button at the centre of the clock is pressed to select the activity that will be undertaken next. It is currently being shown on CBeebies, the BBC's channel for young children. The Playstation game is a collection of different mini games and features: * Jake's Dot World - Fly your favourite Tweenie through a world where all the colour has been gobbled up * Fizz's Disco - Help your Tweenie copy Fizz as she dances to the disco music * Milo's Space Race - Race through space collecting the musical instruments. Then make your very own tune with them… * Bella's Fairy Castle - Welcome to Bella's castle...but your Tweenie needs to collect a fairy costume to enter it!", "platform": "Sony Playstation", "release_date": "March 30, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Intelligent Games", "publishers": "BBC Multimedia", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95858-tweenies-game-time\n"}