{"altername_name": ["Twilight Syndrome: Search", "Twilight Syndrome - Tansaku-hen"], "name": "Twilight Syndrome: Tansaku Hen", "overview": "Every high-school has its own dark secrets. Well, maybe not every; but in Japan, this seems to be a rather popular theme. Mysterious disappearances, ghostly photographs, untimely deaths, eerie sounds coming out of the music room - all these things attract the curiosity of three high-school girls: Yukari, Mika, and Chisato. At night, armed with nothing but a flashlight, the trio of heroines enters the dark school building, prepared to explore every corner, and investigate every urban legend they have heard of... Tansaku-hen opens the Twilight Syndrome horror adventure series, defining its stylistic traits and gameplay. The game is divided into chapters, each dedicated to a particular \"ghostly\" story. Unlike most Japanese-style adventures, there is physical character navigation in the game; the player moves digitized images of the three girls on 2D backgrounds, in a manner somewhat similar to side-scrolling games - though many areas feature a third dimension, like in Western third-person perspective adventures. The gameplay consists of two activities only: walking and occasionally choosing a dialogue option and/or action, as prompted by the game's narrative. There is no other kind of interaction, no inventory, and no combat. Different choices may lead to different endings; the next chapter can be accessed only if the player has not attained the \"bad\" ending. Twilight Syndrome: Tansaku-hen abandons the nearly omnipresent anime/manga graphical style of Japanese games in favor of digitized images and photos of real people.", "platform": "Sony Playstation", "release_date": "March 1, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Human Entertainment", "publishers": "Human Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93812-twilight-syndrome-tansaku-hen\n"}