{"altername_name": [], "name": "U.S. Navy Fighters", "overview": "The high-G excitement of modern carrier aviation comes alive in U.S. Navy Fighters, the first in Electronic Arts' new Air Combat Series for the PC and released only in Japan for the Playstation console. Developed by the team that brought us Chuck Yeager's Air Combat_, this ultimate dog fighting sim lets players push the envelopes of some of the hottest U.S. combat aircraft including the F-14 Tomcat, F/A-18 Hornet, and the proposed naval version of the F-22 Lightning. In addition, the player get the unique chance to \"turn and burn\" in the SU-33 Flanker, the Russian Navy's powerful fourth-generation fighter-bomber. The first in the series, U.S. Navy Fighters, utilizes features such as digital stereo sound effects, bit-mapped and digitized animations, and -- a first - - rear view mirrors, to create an environment unrivaled by other flight sims. U.S. Navy Fighters is the first flight sim to display rear view mirrors like those used in real fighter aircraft. These provide the pilot with a quick \"check six\" for bandits and enemy missiles. \"Track View\" simulates a pilot's head rotation -- the player's view shifts around the cockpit to keep sight of the enemy target. The player remains in control of the airplane and is free to maneuver in order to bring the target back into his sights. The story line of U.S. Navy Fighters, places the player, a Navy pilot, on board the aircraft carrier Dwight D. Eisenhower. Radical nationalist forces in Russia have ousted Boris Yeltsin and are now leading a crusade to absorb ethnically Russian areas in neighboring republics. When the United States agrees to protect Ukraine, a recent ally in the region, the Eisenhower is deployed to the Black Sea. The player must use his skill and judgment to repel the Russian invasion using all of the aircraft in his carrier wing. In the course of a 50 mission campaign, he will experience a wide variety of fighter and strike missions: combat air patrols, escort missions, anti- ship and anti-tanks strikes, close air support, suppression of enemy air defenses, and more. U.S. Navy Fighters, With a large campaign, lots of single missions, an in-game single mission creator, and a quick mission creator, USNF had lots of replay value.", "platform": "Sony Playstation", "release_date": "November 6, 1997", "game_type": "Released", "esrb": "", "developers": "Electronic Arts", "publishers": "Electronic Arts", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95838-us-navy-fighters\n"}