{"altername_name": [], "name": "UFO: A Day in the Life", "overview": "In UFO: A Day in the Life, the player takes control of a little alien, who is sent by his superior (a creature known as \"Mother\") to retrieve over fifty aliens who were stranded in a regular apartment building on the Earth after a UFO crash. There is, however, one big problem: these aliens are invisible! The little hero must use a device named \"Cosmic\" in order to locate them; but even then, it is necessary to take a full picture of the alien so that the rescue team will know where to search. So, how is it possible to take pictures of invisible beings?.. By carefully observing the environments and the behavior of humans and other animals. For example, if an animal appears to be afraid of something, there might be a chance an alien is nearby. Or, if something has changed in the scenery, perhaps an alien was at work there. UFO is essentially a puzzle game with adventure elements (navigating a character). The hero must travel to different rooms in the apartment building at different times, trying to snap the perfect picture of the invisible alien. The player is given a time limit and a picture limit (ten pictures per visit). Afterwards, the hero has to return to Mother, who will eat the negatives (really), produce pictures, and then decide whether they are suitable or not. Each successfully taken photo opens a new area and/or a new time of the day in the apartment block. UFO is Love-de-lic's second game (after Moon: Remix RPG Adventure). It shares a few stylistic traits and gameplay elements with its predecessor, such as the eccentric character design, the \"gibberish\" language with sub-titles, and the day/night cycle with character schedules as an important gameplay element.", "platform": "Sony Playstation", "release_date": "June 24, 1999", "game_type": "Released", "esrb": "", "developers": "Love-de-Lic", "publishers": "ASCII", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30314-ufo-a-day-in-the-life\n"}