{"altername_name": [], "name": "Urban Chaos", "overview": "What should be a time of wonderful change and justified excitement brings a new reign of terror and bloodshed. Rather than celebrating the dawn of a new millennium, the Union City residents are suffering from malicious gang wars, terrorists and widespread famine. The once friendly streets are an open battleground for anyone wanting to solve their problems. Many fear the Apocalypse is at hand; ancient predictions cast by Nostradamus are becoming a reality. The Union City police force has a difficult mission at hand: they're to restore order to the once peaceful city by any means necessary. Players assume the role of either D'arci Stern or Roper McIntyre. Whereas the hardened and mentally unstable Roper uses his knowledge of advanced weaponry and highly explosive materials to get the job done, D'arci is an excellent sleuth specializing in stealthy infiltration and reconnaissance missions. Spanning thirty missions, Urban Chaos takes the player on a wild third-person adventure filled with explosive action and terrorist activities. Depending on the character, missions include highly dangerous infiltration objectives, arresting terrorist masterminds, and the eradication of street gangs. By successfully completing each mission, an apocalyptic story is slowly unraveled; something is definitely wrong in the city and it's not just crime. Union City is broken down into a series of neighborhoods crawling with terrorist activity and scared pedestrians. Using a non-linear gameplay method of exploration and interactivity, players will question civilians for any information they may have about the whereabouts of wanted criminals. They'll often guide you to the completion of your quest, so pay close attention! Players will also engage in a series of frantic car chases throughout congested city streets; utilizing armored squad and civilian vehicles, players should be on the lookout for ambushes and car bombs! On certain infiltration and seek and destroy missions, combat ensues from the fleeing terrorists. Using a variety of hand-to-hand combination attacks (kicks, slides, and punches), pistols, and assault rifles, players will assault tough-willed street gangs and put an end to their waves of crime. While killing the bad guys is certainly an option, try arresting them for questioning and clues regarding criminal activities. Urban Chaos a realized 3D engine with weather, time, and pollution effects for added realism. Game progress can be saved with a PlayStation memory card and makes full use of the Dual Shock Analog Controller for unprecedented control and feel. The city needs a hero -- can you save the innocent civilians from the arms of Armageddon?", "platform": "Sony Playstation", "release_date": "March 31, 2000", "game_type": "Released", "esrb": "M - Mature", "developers": "Mucky Foot", "publishers": "Eidos", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.09", "wikipedia": "https://en.wikipedia.org/wiki/Urban_Chaos", "video_link": "https://www.youtube.com/watch?v=g1dQKL22IdQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9061-urban-chaos\n"}