{"altername_name": ["Utauta Woo: Seirei-Songs"], "name": "Utauta-Uh: Seirei-Songs", "overview": "In a Crayola-hued tropical island somewhere happily south of realism, a population of people, local spirits and animals live out a peaceful tandem existence. The island has its \"Utadashishi\", a sort of musical shaman, to thank for the idyll; 'Grandpa' to the young hero of the game, the old man communicates with the spirits through music, ensuring harmonious relations. However, when Grandpa goes out of action with a sudden illness and a volcano begins to rumble ominously in the middle of the island, the boy protagonist must put himself through an on-the-job training as an Utadashishi. With the help of Grandpa's spirit friend and his birthright as a shaman, he embarks on a musical adventure to save the island. The animistic spirits that play a large role in the title are represented as beings which reside within objects and people. Touching certain objects or talking to people brings up a pale outline of a spirit, along with a faint chord of music. Push the button to have the protagonist take out his musical instrument. Venture a few tunes and if the spirit approves, the game segues into communication mode. The spirit will reel out a few riffs, and the player's job is to replicate the phrase. The quality of the performance will be scored in real time in the Norinori Gauge (Groove Gauge). Both the spirit and the player will start to smile if the performance is going well. If the guage hits the green zone, the player is scored a \"GOOD\" and the story continues. A blue-zone-performance is a \"GREAT\" and some spirits will reward the player with a free play time to groove to your heart's content. A good or great performance with a spirit will have a positive effect on the spirit's host object or person, whether it be fixed machinery or better moods. The protagonist also acquires better musical instruments with every successful encounter, working his way up from simply clapping to some elaborate music-makers. Should, however, the player turn in an abysmal rendition, both the spirit and the protagonist begin to look depressed and a \"DANGER\" indicator appears. Failing to improve will net the player a \"BAD\" score, and the only choice is to start over again. In addition to these sessions with the spirits, each stage has a variety of musical-theme events topped off with a final event that the player must clear before proceeding to the next stage.", "platform": "Sony Playstation", "release_date": "February 24, 2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Opus Corp", "publishers": "Enix Corporation", "genres": "Music", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113217-utauta-uh-seirei-songs\n"}