{"altername_name": [], "name": "V-Rally 97 Championship Edition", "overview": "V-Rally is a racing video game developed by Infogrames Multimedia and released for the PlayStation console in 1997. The first game in the V-Rally series, it is based on the 1997 and 1998 World Rally Championship seasons, and features officially licensed cars and tracks inspired by real locations of rally events. Players drive rally cars through a series of stages spread over eight different locations, ranging from European countries like England, Spain or Sweden, to island countries such as Indonesia and New Zealand. As a simulation game, V-Rally places a strong emphasis on replicating the behaviour physics of real cars and generally requires more practice than arcade-style racers. The game was developed over the course of nearly two years by a team that would later be known as Eden Studios. Ex-rally world champion Ari Vatanen gave the developers insight on how the cars should handle collisions and drifts. Upon release, the game was critically and commercially successful in Europe, selling more than two million copies as of November 1998. However, the game was not very successful in North America. Critics generally praised its large number of tracks and challenging yet rewarding gameplay, but some criticized its overly-sensitive and difficult controls. After its release on the PlayStation console, V-Rally was ported to multiple platforms, including the Nintendo 64, Game Boy Colour, and Microsoft Windows. A sequel, V-Rally 2, was released in 1999.", "platform": "Sony Playstation", "release_date": "1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Infogrames Europe", "publishers": "Infogrames Multimedia SA", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.17", "wikipedia": "https://en.wikipedia.org/wiki/V-Rally_(video_game)", "video_link": "https://www.youtube.com/watch?v=iy_oGjeNCig", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127871-v-rally-97-championship-edition\n"}