{"altername_name": [], "name": "Virus: The Battle Field", "overview": "Virus: The Battlefield is the second game based on Virus Buster Serge anime serie and the first one released for the Playstation. Virus Buster Serge, known in Japan simply as Virus is a Japanese media franchise. It originated as an adventure game for the Sega Saturn. It was adapted into an anime television series which was directed by Masami Obari, produced by J.C.Staff and Plum, and aired on AT-X and TV Tokyo from October 2 to December 19, 1997. A light novel and second video game (for the PlayStation) were also created. Virus the Battle Field is a battle card game in a distant future with these game modes: Normal mode, 1p vs computer, 1p vs 2p and a database mode. The normal mode features 2 characters to choose from: A male one called Serge and a female one called Erika. The normal mode is divided into different missions and each mission is a card battle against an enemy. The game features different anime sequences during the game. STORY: In the year 2097 in the city of Neo Hong Kong, man and machine have melded nicely and the city has been blooming with technological advances. However, an entity that takes over the machines called the Virus is becoming a problem. For this problem, there exists the organization STAND equipped with their Gears (machine suits) led by the mysterious Raven. The latest member of the team is Serge, a man who cannot remember his past and thought joining STAND and confronting Raven would help him better understand. Little does he know how important he will become to the whole Virus conflict.", "platform": "Sony Playstation", "release_date": "April 8, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Polygram", "publishers": "Polygram", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95737-virus-the-battle-field\n"}