{"altername_name": ["Choujin Gakuen: Gowcaizer", "超人学園 ゴウカイザー"], "name": "Voltage Fighter: Gowcaizer", "overview": "Choujin Gakuen Gowcaizer, also known as Voltage Fighter Gowcaizer is a 1995 superhero-themed head-to-head fighting game produced by Technos Japan Corp. for the Neo Geo arcade and home console. It was the company's third attempt at a fighting game after the success of Capcom's 1991 arcade-hit Street Fighter II, following the 1992 Family Computer title Nekketsu Kakuto Densetsu, and the Neo Geo fighting game version of Double Dragon. It features character designs by artist Masami Obari, who previously worked on the anime adaptations of the Fatal Fury series. Ports of the game were released for the Neo-Geo CD and PlayStation (Japan only). In 1995 it appeared on the Neo Geo then in 1997 it was ported over to the PSX by Urban Plant. Its a VERY RARE game to get hold of now since there never was a reprint of it. Exclusive PSX features: - A new full motion anime intro. - A new 3d mode. It seems like 70% of the sprite animations are missing compared to the arcade version. The PSX exclusive 3D mode is pointless and at best a novelty. The backgrounds and characters are still 2D but the camera moves around. The background is basically a wallpaper on a black background and everything looks very tacky indeed. CHARACTERS: - Gowcaizer (Isato Kaiza) Voiced by: Nobuyuki Hiyama - Hellstinger (Kash Gyustan) Voiced by: Hikaru Midorikawa - Karin Son (Sun Hualing) Voiced by: Tomo Sakurai - Kyosuke Shigure Voiced by: Ryotaro Okiayu - Shaia Hishizaki (Shaia Shu Silveianu) Voiced by: Yumi Toma - Brider (Ikki Tachibana) Voiced by: Masami Obari - Fudohmaru (Ranpou Fudoh) Voiced by: Ryotaro Okiayu - Captain Atlantis (Randy Riggs) Voiced by: Hideo Ishikawa - Marion (DES/CO-P IV \"Marionette\") Voiced by: Yoshiyuki Kono - Sheng-Long (Gouichirou Kaiza) Voiced by: Yusaku Yara - Ball Boy Voiced by: Yoshiyuki Kono", "platform": "Sony Playstation", "release_date": "July 17, 1997", "game_type": "Released", "esrb": "", "developers": "Technōs Japan", "publishers": "Urban Planet", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114628-voltage-fighter-gowcaizer\n"}