{"altername_name": [], "name": "Wagamama Fairy: Mirumo de Pon! Mirumo no Mahou Gakkou Monogatari", "overview": "Mirmo! (Wagamama Fairy Mirumo de Pon!) is a manga series written by Hiromu Shinozuka and serialized in Ciao magazine from 2001 through 2006. It was also published in twelve collected volumes by Shogakukan. The manga series was awarded the 2003 Kodansha Manga Award and the 2004 Shogakukan Manga Award for children's manga. The series has been licensed for an English language release by in North America by Viz Media. Mirmo! was adapted into an anime series by Studio Hibari. It premiered in Japan on TV Tokyo on April 6, 2002 and ran for 172 episodes until its conclusion on September 27, 2005. The anime series is also licensed by Viz Media for an English language release in North America, and by ShoPro Entertainment. A dubbed version of the series is being broadcast on Warner Bros. Television under the title Mirmo Zibang! The main character, Kaede Minami, is a cheerful and energetic eighth grader who is shy around her male classmates, making it difficult for her to date. One day, on her way home from school, she walks into a mysterious shop and buys a blue cocoa mug. When she arrives at home, she peeks into the bottom of the mug and discovers an engraved note which says, \"If you read this message aloud while pouring hot cocoa into the mug, a love fairy (\"muglox\") will appear and grant your every wish.\" The skeptical but curious Katie follows the directions and announces her wish to date Setsu Yuuki, her crush. A love fairy named Mirmo appears. At first she was afraid of him but later understood that he was a muglox. Kaede soon finds out that Mirmo prefers eating chocolate and creating mischief over helping Katie. It turns out Mirmo is prince of the muglox world. Horrified at the prospect of having to marry Rima (Rirumu), his princess bride-to-be, Mirmo escaped the muglox world. Hot on his heels, however, are Rima, Yatch (Yashichi) the bounty hunter, Murumo (Mirmo's brother), and many other muglox as well. The Playstation game features an adventure game with mini games and 16 possible endings. The game features the voices of the anime series cast. The game also features a gallery mode (artwork, music & videos) that will be unlocked playing the story mode.", "platform": "Sony Playstation", "release_date": "March 20, 2003", "game_type": "Released", "esrb": "", "developers": "Konami", "publishers": "Konami", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136128-wagamama-fairy-mirumo-de-pon-mirumo-no-mahou-gakkou-monogatari\n"}