{"altername_name": ["Wai Wai Trump Taisen"], "name": "Waku Puyo Dungeon Ketteiban", "overview": "Waku Puyo Dungeon Ketteiban (aka Waku Puyo Dungeon (Expert)) is an action RPG title or at least that's what the description on the box says. You must guide Arel around the dungeons of Puyo land while attacking monsters and so on in a fashion similar to that of Magic Knight Rayearth. Waku Waku Puyo Puyo Dungeon mixes up things by being one of those Rogue-style games (like Diablo, to site a more popular/recent example.) You wander through randomly generated dungeons, find lots of items, and try to make it out alive with all of the booty you've found. Fighting is mindless simple, as you simply go next to an enemy and hit the attack button, occasionally choosing different spells. Therefore, most of the focus is on resource management, making sure you have enough magic to last through the course of your adventure, and knowing when to run to the magic circles that potentially restore your health. There are three playable characters - Arle (with Carbuncle, who helps find hidden stuff), Rulue (with Minotaurus, who will help fight) and Schezo (who goes it alone.) The art portrays everyone as being much more adult, although one has to wonder why there's absolutely no voice acting at all. There are several dungeons to play through, which at least gives a bit of variety to the monotony usually found in games like these. Some of the more annoying quirks of the genre are present - if you die or exit a dungeon prematurely, you lose all of the items/experience/gold you gained when you first entered. And since identifying items is quite costly, you end up using items without knowing what they are (although I suppose that doesn't make a difference if you don't know Japanese anyway.) There's also a dismaying lack of voice acting. While it's better than similar dungeon crawlers of this era (such as Azure Dreams, Chocobo's Mysterious Dungeon),", "platform": "Sony Playstation", "release_date": "March 18, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Compile", "publishers": "Compile", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83265-waku-puyo-dungeon-ketteiban\n"}