{"altername_name": [], "name": "WarGames: DEFCON 1", "overview": "Although it was essentially defeated some twenty years ago, WOPR (War Operations Planned Response) is back online. The supercomputer designed to defend the United States from nuclear war has apparently developed a grudge against humanity! It now commands an arsenal of mechanical troops and has positioned itself in key sectors around the globe. Your mission is to defeat WOPR with all that NORAD (North American Aerospace Defense) has to offer! This means using helicopters, tanks, jeeps, patrol boats and more in your assault on WOPR's defenses. WarGames: Defcon 1 is a real-time 3D strategy game with an emphasis on action. You'll directly control up to eight units and switch vehicles at any time during the heat of battle. Your objectives are detailed at the beginning of each mission, typically involving the destruction of enemy structures before WOPR can send reinforcements. There are also various buildings available in order to help you sustain the war. Among the featured structures are cloning facilities to produce an unlimited amount of ground troops, guard towers, helicopter pads, command centers (can be hacked by sending a unit next to it, allowing you to retrieve supplies), SAM turrets, robot maintenance facilities (robot reparation), aircraft hangars and landing pads, where units are dropped off by transport helicopters. Destroying these buildings can reveal power-ups to increase weapon damage (each vehicle has two attacks), shields or repair armor. The game is divided into fifteen missions per side, letting gamers play as either NORAD or WOPR. There are six different 3D environments consisting of snowy alpine, desert, the Pacific Ocean, countryside, urban and lowlands. WarGames: Defcon 1 also features high-resolution graphics, real-time weather effects, split-screen cooperative and deathmatch modes for two players, and Dual Shock Analog Controller support. Features: Command NORAD's forces against WOPR's powerful mechanical army Launch 30 sea, air, and ground attacks Engage in 30 campaign-based missions Three modes of two-player warfare", "platform": "Sony Playstation", "release_date": "June 30, 1998", "game_type": "Released", "esrb": "T - Teen", "developers": "Blitz Interactive Studios", "publishers": "MGM Interactive", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9639-wargames-defcon-1\n"}