{"altername_name": [], "name": "Warriors of Might and Magic", "overview": "Warriors of Might and Magic is another entry in the Might and Magic line from 3DO. It is a single-player action-adventure title, in much the same vein of the previous entry in the series, Crusaders of Might and Magic. It is the first Might and Magic game to appear on the PlayStation 2. Players take on the role of Alleron, who has been plucked from his life by mysterious forces that seek only to bring him to his final fate. His face has been encased in a mysterious and shameful mask that he cannot remove. With it, he has set out on a quest to discover the truth behind his imprisonment, along the way becoming wrapped up in an adventure that will determine the fate of the very world. Alleron will quest through nine different worlds in hopes of finding his persecutors, the chief of which just might be the Grand Inquisitor, who has much knowledge of the mask Alleron bares. To make it through these worlds, Alleron has several different kinds of attacks at his disposal. He has traditional melee weapons, such as swords, axes, clubs, and maces to slice and dice the demonic hordes that stand in his way. He'll also borrow some power from the realms of magic, indulging in a spell system that will allow him to give himself power-ups and eradicate pesky monsters that block his path. Alleron can upgrade his armor and weapons, and he'll need it, with over 30 different varieties of monsters to face. But dark creatures aren't his only obstacle in this journey, as he'll also have to deal with deceptive and shady characters, solve puzzles, and hone his weapon and spell skills. It could be a long haul for Alleron, but the prospect of being trapped in the mask forever is much worse a fate. Features: - Lead Alleron through nine 3D worlds - Wield melee weapons and cast magic spells against more than 30 monster breeds - Upgrade and enhance a wide variety of weapons, armor, and magic", "platform": "Sony Playstation", "release_date": "February 7, 2001", "game_type": "Released", "esrb": "T - Teen", "developers": "3DO", "publishers": "3DO", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.81", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/600-warriors-of-might-and-magic\n"}