{"altername_name": [], "name": "Warzone 2100", "overview": "In the year 2080, the North American Strategic Defense Agency (NASDA) was formed to protect North America from nuclear attacks. A year later NASDA began building a satellite defense system that was designed to control all aspects of nuclear threat. However, during a routine system check the NASDA satellite system malfunctioned and launched nuclear strikes on all major cities of the world. The targeted countries quickly launched a counterstrike and the NASDA system failed to defend against the incoming missiles. Nuclear Winter covered the Earth. Civilization came to an end. Billions of people died from widespread plagues and famine; however, there were survivors. One particular group rallied together in a subterranean military base and began what was known as The Project. The goal of The Project was to recover Pre-Collapse Technologies and rebuild a better world. Unfortunately, The Project was not the only group of survivors looking to recover this technology. There are others out there with sinister intentions that hope to find and use the technology before you do. You are the best Command General in the ranks of The Project. Your mission is to lead your troops into the wasteland of the Western United States and recover the technology essential to the rebirth of civilization. You must battle and defeat the other groups that seek this technology and discover the true reason that NASDA failed. Warzone 2100 is a real-time strategy game where you must plan, design and implement a number of factors in order to complete missions. You must begin by setting up a base camp and clearing away any scavenger groups within the vicinity. You start with a small force of troops that must be commanded to fight attacking forces and build the base camp. Oil derricks must be constructed in order to extract oil, which is your main source of energy. Power generators must also be built to convert the oil into power. This power is used to run the rest of your base camp, which can consist of command centers, research facilities, factories and other military structures. After your base camp is established you must send troops out into the wasteland to recover artifacts, discover more oil pools and raid enemy strongholds. It is vitally important to recover artifacts because these are the source of new technologies. Artifacts must be studied at your research facility before the new technology can be implemented. The new technology can be used to design and manufacture new weapons and vehicles. There are over 2,000 units that can be designed in Warzone 2100. All missions are timed, so you must think and act quickly or you could risk losing the new technology to those who wish to use it for evil means. Warzone 2100 is a one-player game and requires three blocks of memory to save data. It supports vibration function and is compatible with the analog controller and a mouse. Muster your courage and quicken your wits. After all, the rebirth of civilization depends on your success alone.", "platform": "Sony Playstation", "release_date": "March 31, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Pumpkin Studios", "publishers": "Eidos", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12891-warzone-2100\n"}