{"altername_name": [], "name": "Water Summer", "overview": "Water Summer or Suika is an Japanese visual novel developed by Circus and was first released on July 27, 2001 for the PC as a CD-ROM, followed by a DVD-ROM release on August 31, 2001, it was followed by an all-ages consumer port for the PlayStation, retitled as Water Summer. The gameplay in Water Summer follows a linear plot line, which offers pre-determined scenarios and courses of interaction, and focuses on the appeal of the main female characters. The Water Summer visual novel is divided into four segments which contain different stories and characters, though all take place in the same rural town. In the first chapter, the player assumes the role of Akira Kazuma and centers around his interaction with the first chapter's sole main heroine Itsuki Minase. In the second chapter, the protagonist is Souji Kamishiro who interacts with the second chapter's heroine Sayaka Shirakawa. In the third chapter, the player plays as Yoshikazu Masaki who interacts with two heroines, Akane Masaki and Touko Kyouya. In the fourth and final chapter, the player assumes the role of Hiroshi Inaba and centers around his interaction with a heroine who remains nameless throughout the story. Water Summer gameplay requires little interaction from the player as most of the game's duration is spent reading the text that appears on the game screen, which represents either dialogue between the various characters or the inner thoughts of the protagonist. After progressing through the text, the player will come to a \"decision point\" where he or she must choose from multiple options. The time between these decision points varies. Gameplay pauses at these points and depending on which choice the player makes, the plot will progress in a specific direction. There are five main plot lines the player experiences—one for each heroine. The player must replay the game multiple times and make different choices during decision points to view all five plot lines.", "platform": "Sony Playstation", "release_date": "July 18, 2002", "game_type": "Released", "esrb": "", "developers": "Princess Soft", "publishers": "Princess Soft", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "0.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136059-water-summer\n"}