{"altername_name": [], "name": "Wayne Gretzky's 3D Hockey '98", "overview": "Wayne Gretzky's 3D Hockey '98 is an ice hockey game for the Nintendo 64 and PlayStation, it was released in 1997. The game is endorsed by hockey star, Wayne Gretzky and is the sequel to Wayne Gretzky's 3D Hockey. The game gained widespread criticism for several perceived shortcomings. The game was perceived to be crude and unfitting as a pure hockey simulator, leaving many enthusiasts disappointed, but many arcade fans delighted. Wayne Gretzky's 3D Hockey '98 continues same fast-paced, arcade-style spin that made its predecessor a system standout. The sequel retains the same look and feel as the original while adding new features to give players more choices in managing their teams. Both arcade and simulation play styles are available, with the latter expanding the roster size from 11 to 17 athletes; incorporating both injuries and fatigue; and recording team and league leader statistics throughout the season. Customization options include seven camera angles, toggles for penalties and fights, two game speeds, adjustable period lengths, and five difficulty levels. GAMEPLAY: Gameplay consists of two basic options: Arcade and Simulation. Although the graphics and earlobe vary little between the two, other changes have the effect of changing the chemistry and intensity of gameplay between the two options. The gamer has the ability to customize period length, fatigue (on/off), line changes, fighting (on/off), penalties (simulation only), rink size (arcade only), puck-streak (on/off), and camera angle. Simulation Mode: Simulation mode is designed to emulate the real game of hockey. Players may play five, four, or three to a side, depending on preference. Recognition of penalties, off-sides, and icing are all optional, but two-line pass is not considered. Period length can be selected between 5, 10, 15, and 20 minutes. Arcade Mode: During the Arcade mode checking, hooking, and tripping are more violent. Fights occur with greater frequency, and penalties are disregarded entirely. Additionally, arcade mode sees the introduction of a \"power shot\", which a player may utilize to light the net on fire after a goal. Arcade mode tends to be more exciting.", "platform": "Sony Playstation", "release_date": "December 26, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Software Creations Ltd.", "publishers": "Midway", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.38", "wikipedia": "https://en.wikipedia.org/wiki/Wayne_Gretzky%27s_3D_Hockey_%2798", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/601-wayne-gretzkys-3d-hockey-98\n"}