{"altername_name": ["Virtual Pro Wrestling"], "name": "WCW vs. the World", "overview": "WCW vs. the World (known in Japan as Virtual Pro-Wrestling) is a professional wrestling video game released in 1997 for the PlayStation video game console. It was the first game developed by The Man Breeze (who later became the AKI Corporation) to be released outside of Japan and the second wrestling game for the PlayStation, following Power Move Pro Wrestling. WCW vs. the World marks the first title in the Japanese Virtual Pro-Wrestling series and would be the first World Championship Wrestling video game released during its rise amidst the Monday Night Wars. This is one of the original wrestling games for the Sony Playstation. It is the second title created, following Power Move Pro Wrestling. The game has a variety of characters from all over the world. There are 15 WCW Superstars (superstars at the time the game was created, anyway), and 60 wrestlers under aliases in the game. These wrestlers are from around the world, many in Japan, some even from the WWF. They are not under their real name because THQ did not have the copyright to them. The game itself consists of many modes. You control one wrestler at a time, and can take part in any of the following: League Challenge, fight for the belt in a league; Best of Seven, select seven opponents and fight for a new belt; Exhibition, pick any wrestlers and fight; Elimination, choose five wrestlers each, and winner stays on; Tournament, select up to eight wrestlers and battle; League, round-robin, winner is wrestler with most points; and Double Title, two wrestlers fight, winner wins both belts. The game features 51 wrestlers. In addition to its WCW/nWo roster, in keeping with the game's title, WCW vs. the World also has several \"fictional\" foreign wrestlers. These performers are actually renamed counterparts of real-life Japanese wrestlers that could not be properly represented in the game's American version due to copyright restrictions. This practice of altering Japanese performers for American games would carry on through two more AKI games for the Nintendo 64.", "platform": "Sony Playstation", "release_date": "February 28, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "AKI", "publishers": "THQ", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2.89", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=46fh5PXz66s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/21761-wcw-vs-the-world\n"}