{"altername_name": [], "name": "WCW Mayhem", "overview": "WCW Mayhem is based on Ted Turner's hit cable wrestling league World Championship Wrestling. The game takes many of it's wrestlers and combines them with authentic moves, settings, and actual events found on the various cable programs and pay-per-view specials. \"Mayhem\" is probably an accurate word to describe the first wrestling game from Electronic Arts. A TV-style presentation features play-by-play commentary along with signature entrances enhanced by pyrotechnics and theme music. Over 50 professional wrestlers from World Championship Wrestling are included, although you'll need to play through the \"Quest for the Best\" mode to unlock them all. \"Quest for the Best\" has you advancing through three divisions in an attempt to win the TV title, the U.S. title, and the WCW Heavyweight Championship. You can compete on various levels of difficulty and unlock hidden wrestlers along the way, including broadcaster Mean Gene Okerlund and head of security Doug Dillinger. Other featured wrestlers include Goldberg, Sting, Diamond Dallas Page, Hollywood Hogan, and Macho Man Randy Savage. Additional options include a \"Quick Start\" game, a \"Main Event\" match, and the ability to design custom grapplers in the \"Create Wrestler\" mode. As the title suggests, WCW Mayhem is not limited to the confines of the ring. Thirteen backstage areas are available, including locker rooms, boiler rooms, first-aid rooms, and hallways. Various weapons are also included for use against your opponent, from tasers and baseball bats to standard chairs and trashcans. Individual matches can be customized to include the following types of play: Singles, or one-on-one fights; Handicap, where a single player takes on a two-wrestler tag team; Triangle, which pits three wrestlers against each other; Four Way Dance, where four wrestlers fight to be the last man standing; Battle Royal, which involves throwing as many wrestlers over the ropes as possible; and Tag Team, which is a two-on-two contest. Features: Features more than 50 WCW wrestlers with authentic moves and entrances Take the action outside the ring in 13 backstage areas Includes support for up to four players", "platform": "Sony Playstation", "release_date": "August 31, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Kodiak Interactive Software Studios", "publishers": "Electronic Arts", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=UQ-Cz5EDcfc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12886-wcw-mayhem\n"}