{"altername_name": ["Wedding Peach: Doki Doki Oironaoshi Fashion Daisakuse"], "name": "Wedding Peach: Doki Doki Oiro-naoshi", "overview": "Wedding Peach, literally \"Legend of the Angel of Love: Wedding Peach\") is a shojo manga by Nao Yazawa and Sukehiro Tomita that was originally serialized in Shogakukan's Ciao magazine. In North America it is translated and published by VIZ Media in its entirety, comprising six volumes. The manga later was adapted into an anime television series that was directed by Kunihiko Yuyama and ran for 51 episodes on TV Tokyo, from April 5, 1995 to March 27, 1996 as well as 2 omakes : Ai Tenshi Robot: Wedding Peach and Ai Tenshi Sentai and spawned a 4-episode OVA sequel (Wedding Peach DX) in 1996. This Playstation game is based on a manga and an animated TV series about a very very idealistic and romantic girl, whose belief in the very literal power of love enables her to fight against evil forces seeking to reduce the love in the world. Its of the same genre as \"Sailor Moon\" (\"magical girl\") and is an obvious attempt to appeal to the same market, though it is quite a different show in many important ways. In the game the pictures have been redrawn, and the girls will appear in outfits that were not in the TV anime. You choose which clothes the girls will wear on certain days, and that will determine how they act when they go out. CHARACTERS: - Momoko Hanasaki /Wedding Peach: The central character of the series. Momoko is clumsy unlike Yuri. Momoko is half-angel from her mother's side, and is given the power to transform into Wedding Peach, a Love Angel tasked with fighting devils intent on destroying a type of wave called Love Wave. Like many other girls at her school, she has a crush on Yanagiba in the first season. In the second season she develops feelings for Yousuke, whom she marries in the manga. Momoko and Yosuke's love is so powerful that in the last episode it shows that their love saved the world despite their different races. In the last episode Momoko and Yousuke are shown watching the sunrise during the credits. - Yuri Tanima /Angel Lily: One of Momoko's best friends. Yuri is very well-mannered and polite. She lives with her mother (a wedding dress designer) and her father. She is actually the Love Angel Lily, reborn on Earth as a human. She had a close relationship with the angel Limone as an angel and this love carries over into her present life. - Hinagiku Tamano /Angel Daisy: Another one of Momoko's close friends. Hinagiku is a short-haired rough-speaking tomboy who practices judo. Her family consists of her mother, father and younger brother. Although she has a tomboyish exterior, Hinagiku a sensitive side too (which she tends to cover up wherever possible). Like Yuri, she was an angel reborn on Earth as a human. - Scarlett Ohara /Angel Salvia: The fourth Love Angel to appear in the series, Salvia is a loner with a violent and unforgiving streak. She wishes to destroy devils rather than purify them like the other girls. A pure angel, she assumes the name of Scarlett O'Hara while in the human world. Salvia still carries emotional wounds from the time she lost her best friend (Freesia) to a devil's attack. It takes some time for the other Love Angels to wear down her difficult exterior, though she eventually joins forces with them. In the second DX episode, she enjoys a loving (if doomed) relationship with a businessman named Clark Oasis. She becomes hypnotized by his powers and forces her to marry him. Scarlett and Dean's names were inspired by Scarlett O'Hara and Rhett Butler from the novel Gone with the Wind. - Jama-P: A cute and small devil that served as Pluie's sidekick until he was purified by Wedding Peach, and subsequently forced out of the devil realm. He becomes a close friend of Momoko, who cherishes his company, and pretends to be a stuffed toy when others are around. - Yousuke Fuuma /Viento: The freshman goalie on the school soccer team. He enjoys teasing Momoko such as calling her \"Momopi\" (a term of endearment in Japanese) instead, but eventually begins to have feelings for her. Later on in the series, it is revealed that he is half-devil on his father's side. - Kazuya Yanagiba /Limone: Limone (which means lemon in Italian) is a powerful angel sent by Aphrodite to watch over Momoko and the other Love Angels, granting them assistance whenever he is able. Limone is actually a senior angel, just like Momoko's mother Sakura. To remain close to them, he takes the form of Yanagiba, a popular upperclassman at the school and captain of the soccer team, but when turning into Yanagiba, he has no memory of the Love Angels or that he is one himself until later in the season (in the anime). - Takuro Amano: A frail childhood friend of Hinagiku. Desiring to be stronger and more confident, he makes a pact with Igneous, who takes residence in his heart and controls his body when the time is right. In the anime, he had a crush on Momoko; in the manga, his constant stalking of Momoko led many to believe he liked her but he in fact wanted to impress Hinagiku. In the manga, he later marries Hinagiku. - Reine Devila: The leader of the devil world (her name is French for \"Queen Devil\"). Her greatest desire is to destroy all love and subjugate the angel world. In the anime, it is revealed that years ago she ventured into the Angel World and fell in love with an angel at first sight, who later became another angel's husband. With that event, they both unknowingly banished Reine Devila out of the Angel World. Ever since, Reine Devila has wanted to kill all those who love. - Aphrodite: Goddess of love and ruler of the angel world. She is unable to leave the angel world and must rely on Limone and the Love Angels to ward off the devils. She is the sister of Angel Celeste. She erased the Love Angel's and Limone's memory in the last episode in the second season. In Wedding Peach DX she made the Love Angel's memories because of the new evil that was coming. - Pluie: The first of Reine Devila's primary henchmen to appear in the story. He enacts various schemes to both destroy love and lure out the Love Angels, but eventually he is sucked into the vortex of destruction as punishment for countless defeats by Reine Devila (in the anime). He is destroyed by the angels in the manga. - Hiromi Kawanami/Potamos/Angel Potamos: The third of Reine Devila's henchmen to appear in the story. She comes to help out Igneous, but later in the series kills him for turning soft by the love angels and falls for Yousuke at first sight. Potamos is later turned good by Wedding Peach and lives a life as an ordinary school girl. She becomes a love angel during the second omake. - Sakura Hanasaki/Angel Celeste: Celeste is the sister and guardian of Aphrodite. While fighting against some devils with Angels Lily, Daisy and Salvia, she was knocked down to earth. She lost her memory during the fall. She begins to use the name Sakura. On earth she fell in love with Hanasaki Shouichirou, a young photographer. They had a child together, named Momoko.", "platform": "Sony Playstation", "release_date": "September 27, 1996", "game_type": "Released", "esrb": "", "developers": "KSS", "publishers": "KSS", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136056-wedding-peach-doki-doki-oiro-naoshi\n"}