{"altername_name": [], "name": "Weltorv Estleia", "overview": "With Weltorv Estleia, Hudson has attempted to make a completely nonlinear and free roaming world for the player to adventure in and interact with. To begin, you are able to specify just about every detail of your character, such as hair color, physical appearance, height, weight, strength, and even intellectual prowess. Once you have created your ideal character, you can even select from an extensive costume list to cloth your him or her in any fashion you see fit. Hudson wants the player to feel as though he or she is the main character and is himself participating in the game. Abouth the gameplay the game uses a Scenario System: - First you recieve a key word or phrase from various people that give you a hint about a quest or adventure. - Once you have an idea of what to do from the given clues, you proceed to the scenario point where your adventure will take place. - Now if you have followed the clues appropriately, you will have discovered a Scenario to enjoy. There are around 103 scenarios to discover. Some of these are relatively easy, giving the player something to do right off the bat, while others are more difficult to find, but if completed will reward the player with special items. In one scenario, aptly titled \"Hell's Garden\", You are asked by the horsemen of the Imperial Palace to free the spirit of their King, which has been captured by the members of an opposing royal family. When you enter the household of this family, you will meet a woman who is gradually transforming into a monster. Another example involves saving a woman who is being harrassed in a bar by a large, drunken man. In all cases the outcome of the scenario is entirely up to you as the player, depending on how you choose to handle the situation. Will you just ignore the woman and keep on your way, avoiding a potentially dangerous conflict, or will you try to help her? The game takes places in the kingdom of Weltorv and there are a lot of different cities to travel to. The game also features the emotional system, so the player character can express his emotions (angry, happy or sad) in different situations. The battles use the tactical rpg system, the player character and the enemies got a range of movement adn when they reach the enemy they can choose the kind of attack that they prefer. The game also uses stats to see what weapons the player character can use and there are a great collection of weapons (swords, arrows, knifes, shields, etc).", "platform": "Sony Playstation", "release_date": "February 25, 1999", "game_type": "Released", "esrb": "", "developers": "Hudson", "publishers": "Hudson", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136057-weltorv-estleia\n"}