{"altername_name": [], "name": "Wheel of Fortune: 2nd Edition", "overview": "Based on the popular television game show, Wheel of Fortune 2nd Edition supplies puzzle solvers with 2,500 new puzzles. Hosted by Vanna White, there are four modes of gameplay and six options for setting a thematic stage, ranging from Disco to the Great Outdoors. Players can choose a normal or tournament game for three players, challenge the computer, or participate in a solo game. A self-adjusting AI system matches puzzles to the skill levels demonstrated by contestants, keeping the game competitive for players of all skill levels. Much like the television show, players spin the wheel for cash amounts and prizes. Bonus and bankrupt spaces appear on the wheel, and puzzle categories include People, Places, Things, Titles, Phrases, and Before and After. Options to spin the wheel, buy a vowel, or solve the puzzle are presented to each player during every round with the exception of the speed round. In this round the dollar value of each correctly guessed letter is predetermined by one final spin from Vanna. The player with the most cash at the end advances to the bonus round for a shot at winning a sailboat, ski trip, or other fantasy prize. Also included are behind-the-scene interviews and a sample contestant exam. This exam tests players puzzle-solving skills in a format similar to the official exam administered to potential contestants for the television show. To pass, players must solve 12 of 16 partially completed puzzles within five minutes. The answers are supplied in the instruction booklet. The behind-the-scenes option reveals video footage of interviews with Vanna White and different members of Wheel of Fortune's production staff. Features: Solve 2,500 puzzles View behind-the-scenes video clips, and an interview with Vanna White Try your luck on the sample contestant exam", "platform": "Sony Playstation", "release_date": "October 18, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Artech Studios", "publishers": "Hasbro", "genres": "Puzzle", "max_players": "4", "cooperative": "No", "rating": "2.9", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31100-wheel-of-fortune-2nd-edition\n"}