{"altername_name": ["Wer wird Millionär", "Quiere ser millonario", "Quiz $ Millionaire", "Wer wird Millionaer", "Haluatko Miljonaariksi", "Qui Veut Gagner Des Millions", "Chi Vuol Essere Miliardario", "50 por 15: Quiere Ser Millonario", "Vil du bli millionaer"], "name": "Who Wants to Be a Millionaire", "overview": "Who Wants To Be A Millionaire is the videogame version of the popular TV game show that is currently sweeping the world. The aim of the game is to correctly answer consecutive questions to win progressively more money - get one wrong though, and your out..! For those of you that have seen the show on TV (and at this point who hasn't?) one of the things that really helps to build the tension of this game is the music. The good news is that the same score is included in this game. As you work your way up the questions, the music gets more dramatic and really helps to build that anticipation that goes along with each question. The music definitely gets a thumbs up for what it accomplishes. We are also treated to various quips and banter throughout the game by the presenter, but unfortunately he doesn't actually read off the questions. On the graphics side of the house.well let me just say, this is gonna be a real short read for you folks. The actual set of the TV is a true spectacle in terms of lighting, display and overall interactivity between the contestant, the host and the audience. Everything works perfectly. Unfortunately this just has not been translated very well to the home console version. About the best way to describe the graphics in Millionaire is \"sterile\". What we see are the questions as they would be viewed through the contestants monitor and a split screen view of the stage.devoid of all life. The flash and substance of the TV show is completely lost here. Playing Millionaire is simplicity itself.Players are given the opportunity to win a million by correctly answering 15 multiple choice questions that increase in difficulty as the amounts rise. Players are given the question and must choose from four possible answers. To help players further, they are given 3 lifelines: - Lifeline #1 called the 50:50 allows for two of the incorrect answers to be eliminated leaving one wrong answer and of course the right one. - Lifeline #2 is called \"Ask The Audience\". Here the game developers reveal the results of a poll of 100 people. There is no guarantee that the most popular answer is correct, but it can be of great help to confirm your suspicions. - Lifeline #3 called \"Phone-A-Friend\". This time you call someone that may know the correct answer to the question. Again this is all simulated by the computer and occasionally the person asked will give the wrong or no answer at all. That's about it.as you progress up to higher monetary amounts the questions increase in difficulty. It is really amusing to watch as people begin to doubt themselves and panic as they reach the 32,000 plus level. It is not uncommon to see someone go totally brain dead and use all of their lifelines on a single question.and still not feel comfortable enough to give a final answer! Features: Over 1000 questions Familiar features of the TV show are included", "platform": "Sony Playstation", "release_date": "September 29, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Hot House", "publishers": "Eidos Interactive", "genres": "Quiz", "max_players": "4", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Who_Wants_to_Be_a_Millionaire_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29662-who-wants-to-be-a-millionaire\n"}