{"altername_name": ["Wizardry VII: Guardia no Houju"], "name": "Wizardry VII: Gadeia no Houshu", "overview": "Wizardry VII - Gadeia no Houshu also known as Wizardry VII: Crusaders of the Dark Savant, is the 7th title in the Wizardry series of computer role-playing games by Sir-Tech, preceding Wizardry 8 and succeeding Wizardry VI: Bane of the Cosmic Forge. It is also the 2nd in the 'Dark Savant trilogy'. It was published in 1992 by Sir-Tech Software, Inc. It was originally developed for DOS. In 1996 it was remade into Wizardry Gold, designed to work on Windows 95 and Macintosh, and distributed by Interplay. STORY: Crusaders of the Dark Savant picks up where Wizardry VI: Bane of the Cosmic Forge left off. The party had just found the Cosmic Forge, the pen that the Cosmic Lords use to script the events of the universe, after it was stolen by the Bane King and his Wizard, Xorphitus. Before the party could decide what to do with it, it was spirited away by a servant of the Cosmic Lords, the cyborg Aletheides. The Cosmic Forge was used to hide the location of the Astral Dominae, a powerful artifact with power over life itself, on planet Guardia. Because of this, its theft revealed Planet Guardia to the universe. Now, multiple forces are converging on Lost Guardia to find this artifact, including the party itself. It is after planetfall on Guardia that the story begins. As there are three endings to Bane of the Cosmic Forge, there are four beginnings to Crusaders of the Dark Savant (one for each of the endings from the previous game, and a fourth for parties who are starting fresh). The first beginning follows a party who believed the lies of the Bane Queen and killed her husband, the Bane King, his lover, Rebecca, and her brother, Bela. On a whim, the party then enters the mouth of a \"giant slumbering beast\" (in actuality, a spaceship), which was secreted behind Bela's room, and takes off for the stars. The ship is captured in mid-flight by the Black Ship Dedaelis, which belongs to the Dark Savant, who is the main antagonist of the story. The party is then pressed into service by the Savant, who explains that he wants the Astral Dominae to overthrow the Cosmic Lords, and they are then transported down to Lost Guardia to aid the T'Rang in finding the Astral Dominae for the Savant. The second beginning follows a party who did not believe the lies of the Bane Queen, and who spared the life of the Bane King. He commits suicide, and Rebecca gives the party the key to her brother Bela's room. In this case, Bela does not attack the party; in fact, the party agrees to accompany him on his spaceship to chase Aletheides to his destination. As Bela has been in contact with a race called the Umpani for some time on an interstellar communication device, the party transports to the surface of Guardia just outside Ukpyr, where the Umpani are based. They then have the option of joining up with the Imperial Umpani Federation in their mission to defeat the T'Rang. The third beginning is not hinged on believing the Bane Queen or not; rather, it is dependent on whether or not the party decides to take the Cosmic Forge before boarding Bela's ship. Aletheides appears and takes the pen, and offers the party the opportunity to accompany him to Lost Guardia. After a long voyage, he transports the party to the surface of Guardia just outside Dionysceus, where the Dane live. The fourth beginning for new parties describes the party as adventure and treasure seekers, who stumble upon the Cosmic Forge in an abandoned temple. Aletheides appears and introduces the events of Wizardry VI, then the party accompanies him to Lost Guardia. This party starts just outside of New City. Whatever the initial circumstances of the party's arrival on Guardia, they are free to make or break alliances as they see fit. For example, a party initially aligned with the Savant and the T'Rang are fully capable of turning on them, with no repercussions in finishing the game. In fact, it is possible to either befriend or make enemies of every nation on the planet, and still be able to complete the main quest. The main plot involves the party's quest to find the resting place of the Astral Dominae, the greatest artifact ever created by the god Phoonzang. There are four distinct endings; each of these endings can then be imported as savegame files to Wizardry 8, the final chapter of the Dark Savant trilogy, which in turn has its own set of five beginnings.", "platform": "Sony Playstation", "release_date": "October 13, 1995", "game_type": "Released", "esrb": "", "developers": "Locus", "publishers": "Sony", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113243-wizardry-vii-gadeia-no-houshu\n"}