{"altername_name": ["SuperLite Gold Series: Wizardry: New Age of Llylgamyn"], "name": "Wizardry: New Age of Llylgamyn", "overview": "Wizardry: New Age of Llylgamyn is a continuation of the Legacy of Llylgamyn. The New Age of Llylgamyn continues with the remakes of the 4th and 5th part of the story. Each collection has great smooth-scrolling 3D graphics (which can be turned off completely if you’re a purist), and gallery bonuses that show off some beautiful artwork. This is the only collection of games to include a vast remake of Wizardry IV: The Return of Werdna, the most difficult Wizardry ever made. There are two different modes for Wizardry IV: classic and arrange. Classic allows you to play Wizardry IV in English if you set the options correctly - Wizardry IV: The Return of Werdna is the fourth scenario in the Wizardry series of computer role-playing games. It was published in 1986 by Sir-tech Software, Inc. The Return of Werdna is drastically different from the trilogy that precedes it. Rather than continuing the adventures of the player's party from the previous three games, The Return of Werdna's protagonist is Werdna, the evil wizard that was defeated in the end of Wizardry: Proving Grounds of the Mad Overlord and imprisoned at the bottom of his dungeon forever. The game begins at the bottom of a 10-level dungeon. Most of Werdna's powers are depleted, and must be gradually recovered throughout the game. The initial goal is to climb to the top of the dungeon, reclaiming Werdna's full power along the way. Each level has one or more pentagrams at specific points. The pentagrams have three purposes: The first time a pentagram is discovered in a level, Werdna's strength increases, and a portion of his powers are restored. This only happens once per level; finding multiple pentagrams on a single level will not increase his powers multiple times. The second purpose is that monsters may be summoned from the pentagrams. The higher the level, the stronger the monsters available. There is no cost to summoning monsters, but only three parties of monsters may be summoned at a time, and any existing monsters will be replaced by the summoned ones. The third purpose is that pentagrams refresh Werdna's health and spellcasting capacity. Instead of fighting monsters, the player fights against the heroes from the past three Wizardry games. Players of the first three games who sent their character disks to Sir-Tech might have their characters present in Wizardry IV. - Wizardry V: Heart of the Maelstrom: Despite the defeat of Trebor, Werdna, and L'kbreth, dark times once again threaten the kingdom of Llylgamyn. So once again a party of adventurers must venture forth to vanquish the evil. Wizardry V represents a complete revision of the gaming system used in the first four installments, with larger mazes, new spells and character classes, and an expanded system for combatting and interacting with creatures. It is also the first game in the series that allows, but does not require characters imported from a previous scenario.", "platform": "Sony Playstation", "release_date": "October 28, 1999", "game_type": "Released", "esrb": "", "developers": "Thunder Stone Japan", "publishers": "Locus", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Wizardry", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82378-wizardry-new-age-of-llylgamyn\n"}