{"altername_name": ["SuperLite Gold Series: Wizardry: Llylgamyn Saga"], "name": "Wizardry: Llylgamyn Saga", "overview": "Wizardry - Llylgamyn Saga is a remake of the first three Wizardry games: Proving Grounds of the Mad Overlord, Knight of Diamonds, and Legacy of Llylgamyn. As in the original games, the player can create characters choosing from five races and eight classes, and level them up by exploring the maze and fighting monsters, finding and buying items in process. Monster graphics have been updated, and dungeons have been given textures, but the player can also opt for original graphics with wireframe dungeons. An auto-mapping feature has been added. The player can also transfer characters between the three scenarios. To put the game in english move options 1 to 4 to the rightest one. - Proving Grounds of the Mad Overlord: The Mad Overlord Trebor was once only power-mad, but went off the deep end after he acquired a magical amulet of immense power, only to have it stolen from him by his nemesis, the evil archmage Werdna. Werdna, not quite sure how to use the amulet properly, accidentally causes an earthquake which creates a ten-level dungeon beneath Trebor's castle. To avoid looking silly, Werdna declares the dungeon to be the new lair for him and his monster hordes. Trebor, not to be outdone, declares the labyrinth his new Proving Grounds where adventurers must prove themselves for membership in his elite honor guard, and incidentally retrieve his amulet in the process. The first Wizardry was one of the original dungeon-crawling role-playing games, and stands along with Ultima and Might & Magic as one of the defining staples of the genre. - Knight of Diamonds - The Second Scenario: The sequel to the original Wizardry follows the defeat of the evil Werdna and the return of Mad Overlord Trebor's amulet. The heroes who had accomplished that were inducted into Trebor's personal honor guard. Unfortunately this particular honor didn't last very long as Trebor's madness and obsession with the amulet and preventing Werdna's return drove him to suicide. With both Trebor and Werdna dead all seemed well within the kingdom of Llylgamyn. Unfortunately, this peace didn't last very long. With Werdna dead and out of the limelight, an evil knight named Davalpus felt it was time to make his move. He stormed the castle, slaughtered the royal family, and declared himself supreme dictator for life. The Prince of the land fought and killed Davalpus using the legendary Staff of Gnilda and wearing the armor of the Knight of Diamonds. However, the god Gnilda took the staff back and placed it deep within his heavily guarded six-level temple. Since the staff's power protects the land from invasion by hostile outlanders, someone will need to venture into the temple and get it back along with Gnilda's blessing. - Legacy of Llylgamyn - The Third Scenario: A generation has passed since your band of adventurers reclaimed the Staff of Gnilda and the armor of the Knight of Diamonds, and the land has been at peace. But now nature itself seems to be attacking the land of Llylgamyn, as earthquakes and tidal waves ravage the land. The Sages believe the Orb of Scrying is the city's salvation, but it is guarded by the dragon L'kbreth. A band of explorers must once again venture forth in search of the Orb.", "platform": "Sony Playstation", "release_date": "February 26, 1998", "game_type": "Released", "esrb": "", "developers": "Soliton Soft", "publishers": "Soliton", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/48275-wizardry-llylgamyn-saga\n"}