{"altername_name": ["Three Wonders", "Arcade Gears: Wonder 3", "Wonder 3: Arcade Gears"], "name": "Wonder 3", "overview": "Wonder 3 contains three different games: Midnight Wanderers (side-scrolling action), Chariot (shoot-em-up) and Don't Pull (puzzle). Midnight Wanderers: Quest for the Chariot Midnight Wanderers (Roosters in the Japanese version) is a run-and-gun game. The player walks along side-scrolling stages while shooting enemies with a bow. The player can grab power-ups such as stronger shot, or a companion that follows the avatar and shoots. The gameplay is very similar to Ghosts 'N Goblins, made by the same developer. If the avatar gets hit he loses his clothes and will walk in his underwear in the same way. Chariot: Adventure Through The Sky Chariot is a shoot-em-up similar to Gradius. The player shoot enemies on a vertically scrolling screen, collect power-ups and fight end bosses. The player collects power-ups such as three-way shot, stronger laser, extra points, bombs and shields. If the player picks up extra bombs, they attach to his or her ship like a tail. The end bosses are themed after the classic elements, like the wind, the Moon, the sun, etc. Don't Pull Don't Pull is essentially a polished and updated version of Pengo. In this single screen game, the player plays as a bunny or chipmunk walking through a maze full of baddies. The player can push the blocks of the maze to crush the enemies. If a tile that is pushed is blocked by another tile, it is crushed and clears the way through the maze. There also are special blocks, for example a block with a bomb icon, that explodes and stuns any nearby enemies. Bonus points are earned for crushing multiple enemies with a single block push.", "platform": "Sony Playstation", "release_date": "April 2, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Xing Entertainment", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Three_Wonders", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76782-wonder-3\n"}