{"altername_name": [], "name": "World Tour Conductor: Sekai Yume Kikou", "overview": "World Tour Conductor is an adventure game developed by TYO and sponsored by JTB, that is the JTB Corporation, the largest travel agency in Japan and one of the largest travel agencies in the world. It specializes in tourism. There are branches all over the world to help Japanese visitors, including both private and business travelers. It was formerly owned by the Japanese government. It is headquartered in the JTB Building in Shinagawa, Tokyo. History: It was established as \"Japan Tourist Bureau\", which takes care of foreign tourist visiting Japan, in 1912. In 1941, it was renamed as East Asian Travel Agent, then changed its status from corporation to foundation on the following year, although it still has functions as a travel agent company. After the World War II, it is renamed as \"Japan Travel Bureau\". In 1963, Japan Travel Bureau was divided into two different organizations by separating travel agent function as an independent corporation while leaving foundation as it was, then same name is given to both organizations. On January 1, 2001, the corporation side was renamed as \"JTB Corporation\", while the name of foundation side remains as it was. World Tour Conductor let's the player travel around the World in places like Hawaii, Los Angeles, San Francisco, London, Paris, etc. The player can try to improve his knowledge about the places before travel there and also improve his knowledges about other subjects like TV, art, Movies, etc. Those knowledge will help them later in the game when he will get the change to date some of the girls that travel with him, that before they let him date them they will ask him some questions about different subjects. In each place the player travel the tour guide will ask him some questions about the place that will make him a better traveller or a worse one. The game features video footages of the places and also an album mode where the player can watch the different pictures of the girls that he takes in the dates if he answer the questions in the right way.", "platform": "Sony Playstation", "release_date": "August 26, 1999", "game_type": "Released", "esrb": "", "developers": "TYO", "publishers": "TYO", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134928-world-tour-conductor-sekai-yume-kikou\n"}