{"altername_name": [], "name": "World Soccer Jikkyou Winning Eleven 3: World Cup France '98", "overview": "World Soccer Jikkyou Winning Eleven 3 World Cup France '98, is a soccer game published by Konami Sports. This game itself, looks like more an enhanced version of Konami's recent games Goal Storm and a world series revised of J-League WE3. You're able to select your favourite team among the 32-qualified team in the World Cup 1998, and even some other 8 good teams. Play in the real World Cup, selfmade tournament, international league, or just in a friendship exhibition. The game features audio comments in six lenguages : English ,French, German , Italian , Spanish and Japanese. GAME MODES: - Exhibition Mode: Where you'll only play a friendship game, here you'll able to play alone against the computer, or co-operate with friends/computer to play against the computer. You will also able to set up the ingame environment by selecting the Weather Condition, Difficulty Level, Match Time, Home/Away system, and Stadium. This is a good choice for beginners to get himself familiar with the game. - League Mode: Where you'll compete against 15 international teams. You'll have a chance to select whether you'll play a half competition (15 times) ora full competition (Home-Away system, 30 times). This game will also featuring the league-table, top-scorers, and line-graphic evaluation for all participating team. This is a good choice for those who like a long competition. - Cup Mode: Where you'll compete in a real World Cup 1998, selfmade tournament, or zonal tournament. The option is Japanese, so here's the option: - World Cup 1998: You'll play in a world-cup, and can only choos among the 32 qualified team. - Free Tournament: You'll play in a selfmade tournament. You can decide how many team will participate! The game offers 3-16 participant from all zone. - Europe Zone You'll play against the European team. - Africa Zone You'll play against the African team - N/C America Zone You'll play against the North/Central American team along with the Caribbean team - South America Zone You'll play against the South American team - Asia/Oceania Zone You'll play against Asian and Oceanian team - All Star Match: Where you're about to take the most precious challenge in football You'll play whether for theEurope side (Italy,France,Germany,etc. or for the Rest of the World side (Brazil,Argentina,Nigeria,etc.) - P.K Mode (Penalty Kick Challenge): Where you'll challenged to a penalty kick shoot-out. Choose from all 40 available teams. Play against friend, CPU, or co-operate with CPU against CPU. -Training Mode: Where you'll try to be familiar with the game, the whole game, and all its environemnt, getting used to the controller function, and of course, practicing your shooting, passing, dribbling, ball control, and anything. Inside, you're able to choose from 3 option: - Free Training Running around, kicking and dribbling, do everything as you like - Free Kick Training Place the ball in the desired position to practice free kick, volley kick, and heading - Corner Kick Training The ball placed in the corner area to prac-tice corner kick along with the volley kick and heading", "platform": "Sony Playstation", "release_date": "May 28, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami Computer Entertainment Tokyo", "publishers": "Konami", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.79", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95845-world-soccer-jikkyou-winning-eleven-3-world-cup-france-98\n"}