{"altername_name": ["World Neverland 2: Pluto Kyouwakoku Monogatari"], "name": "World Neverland 2: The Waktic Republic of Pluto", "overview": "World Neverland 2 The Waktic Republic of Pluto is the second game in the World Neverland series for the Playstation console. The game takes place in the city-state marine republic of Pluto. Is a small country in which lives multi-racial people. Live a life as an ordinary citizen in the fantasy Waktic republic of Pluto. There is no epic quest to conquer or world spanning adventure to go on. You live a life. Thats it. Since gamers will be living an average life, you'll get to choose a profession and work, meet a girl and get married, raise kids, retire, etc. At the outset of the game, players may travel around town and explore the local area. The D-pad is used for movement while the analog nub toggles the size of the screen. Pressing the \"X\" button slashes out a sword attack and the \"O\" button is used for interacting with fellow citizens. When wandering around town, the time passes in a natural manner with the day eventually turning into night. If you stand around in the middle of town doing nothing, you'll be able to watch the other citizens scrabbling around doing their daily routines. Every once in a while, someone will run into your character and initiate a conversation or challenge you to a duel that takes place in a rudimentary ring. The player have to reflecs the voice of the people to create a peaceful country, doing it well he can be a member of the council and even become the chairman. The player can do different jobs, learn martial arts, and become stronger meanwhile he meet different people and talk to them.", "platform": "Sony Playstation", "release_date": "February 25, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Riverhill Soft", "publishers": "Riverhill Soft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://youtube.com/watch?v=fHXS_cNNQFk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113278-world-neverland-2-the-waktic-republic-of-pluto\n"}