{"altername_name": ["Exciting Pro Wrestling 2"], "name": "WWF Smackdown! 2: Know Your Role", "overview": "WWF Smackdown! 2 Know Your Role follows 2000's highly successful WWF Smackdown! with wrestlers new to the federation (over 50 included) and never before seen Ladder and Tornado Tag Team matches. Whereas the original title was the first wrestling game to have storyline sequences, this sequel has improved on the idea with better and up to date character interaction. The subtitle of WWF Smackdown! 2 comes from one of the World Wrestling Federation's most notable superstars -- The Rock; he informs his opponents to \"Know your role and shut your mouth!\" The sequel features a larger arsenal of moves, which not only includes signature moves of WWF wrestlers, but also those of other wrestling promotions, such as WCW, Japanese associations, etc. The game also adds striking moves in one-on-one matches and special double team moves. The Season Mode from the previous game returns, adding more scenes depicting wrestlers preparing for a match, and featuring multiplayer support, with up to four players participating in a tournament. Create-A-Superstar mode has been enhanced, allowing the player to customize facial features and outfits of their wrestlers. A new Create-A-Taunt feature, in which the player can create a new taunt for a custom wrestler, has been added. Features: - Featuring a variety of WWF experiences including the \"High Flying Ladder\" match, \"Hell in a Cell,\" and the \"Casket\" matc - Select from 50 different characters and fight in a variety of environments including the VIP room and a parking lot - Cooperate with a friend and finish your opponent in \"Tornado Tag Team\" mode", "platform": "Sony Playstation", "release_date": "November 20, 2000", "game_type": "Released", "esrb": "T - Teen", "developers": "Yuke's", "publishers": "THQ", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12843-wwf-smackdown-2-know-your-role\n"}