{"altername_name": [], "name": "WWF War Zone", "overview": "WWF War Zone is a wrestling game based on the show of the same name. It includes a wide variety of World Wrestling Federation superstars (mostly current through the year 1998) as well as gameplay modes. Among the wrestlers included are Shawn Michaels, Triple H and Stone Cold as well as The Undertaker and his brother Kane. Each superstar has his own unique \"finishing move\" programmed in as well as their regular maneuvers. The various gameplay options are as follows: WWF Challenge, Versus, Steel Cage, Hardcore, War, and Tag Team. If you choose to play through the Challenge, you are presented with a full wrestling \"season\" in competition for the belt. The various versus modes allow you to play with up to 4 friends in a tag team match, or a straight-up rumble called the Tornado. While it is essentially a Battle Royal, the War mode is an every man for himself match to the finish. The last man standing wins. In addition to the featured superstars and some hidden characters, WWF War Zone gives you the option of creating your own wrestler. You can select your own unique facial expressions, hair, weight, height, body art and wrestling moves (there are over 300 motion-captured moves in the game). It allows you to save up to thirty wrestlers on a memory card. To bring authenticity to the game, Vince McMahon and Jim Ross conduct a play by play commentary of each wrestling match. WWF War Zone is also compatible with the Multi Tap. Features: - Six ways to play, including Versus, Tag Team, Steel Cage, and War - Triple H, Stone Cold, The Undertaker, Kane -- play as your favorite WWF star or create your own - Authentic play-by-play commentary from Vince McMahon and Jim Ross", "platform": "Sony Playstation", "release_date": "July 1, 1998", "game_type": "Released", "esrb": "T - Teen", "developers": "Iguana West", "publishers": "Acclaim Entertainment", "genres": "Fighting", "max_players": "4", "cooperative": "No", "rating": "3.45", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/603-wwf-war-zone\n"}