{"altername_name": [], "name": "X-Bladez: Inline Skater", "overview": "In-line skating comes to the flourishing category of \"extreme sports\" video gaming in X-Bladez. Players choose one of six characters to flip, spin, and grind through slalom and circuit courses in an assortment of 3D environments. Race for speed or hot dog for style. Time-of-day and weather effects add variety to the look and mood of the virtual skate parks. Unlock new environments as you progress and upgrade your skates with the money you earn. How are your wheels? Do you need to patch up those injuries with a health boost; can you afford those dream speed skates? All these will change as you progress, keeping interest in the game alive. Wheels can also be tweaked to give emphasis on speed increase & stability or maneuverability & instability, giving the player an advantage against other competitors. Special Features - In-depth game modes including Tour mode, Time mode, and Practice. - 6 male or female characters, each with their own “signature” tricks such as the “Turntablist” and the “Roundhouse.” - 7 kinds of power ups including Turbo boost for added speed, Money to upgrade your skates, and health power ups to help you recover from spills faster. - 13 unique tracks with their own recognizable scenery in 5 different countries. - Go to the Shop for 3 levels of upgrades for both your skates and wheels. These upgrades will improve acceleration, top speed, balance, and cornering.,Cool characters; plenty of tricks; high AI; hidden bonuses; two-player action", "platform": "Sony Playstation", "release_date": "January 24, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Vision Scape Interactive", "publishers": "Crave Entertainment", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "2.31", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11464-x-bladez-inline-skater\n"}