{"altername_name": [], "name": "X-PO: 2089 Cyber-Revolution", "overview": "An unreleased 3D platformer that was in development for the Playstation and PC. At first glimpse, X-PO looks like a traditional 3D platformer game. In 2089, you are playing as Koji, a hero tasked with the mission to protect Internet from an evil entity. You'll explore many levels in search of several objects and information that will guide you through the story. The player character can jump and punch, but the most efficient method to get rid of the enemies is to jump over them, like a famous italian plumber! What makes this game stands out from the others is the nature of the objects you'll collect in the levels. For example, the first level tasks you to develop a photo, and explains you how photography was invented in 1827 by the French scientist Nicéphore Niépce. Later in the level, you'll find a film roll, and the game will then explain you how the French Lumière brothers invented cinema. During a water level, you'll have to find the missing propeller of a submarine invented by French diver Commander Jacques Cousteau. In another level, you'll meet Lucy, one of the oldest fossilized human skeleton, discovered in 1974 by Americans and French researchers. Among others examples, you'll also have to avoid getting hit by a Foucault pendulum, and to help a TGV (french type of high-speed trains) stuck on its rails. Long story short, this game, while being quite fun, is also educational. This dimension is perfectly presented by one of the sponsor of the project: the then-President of France, Jacques Chirac. During the speech he gave for the official announcement of the game, he said: \"It is an action game, mainly aimed at children, to talk about France: the role of our country in the great discoveries throughout History, but also how the country is participating in the recent technological innovations.\" Developed by the French studio Kalisto, X-PO is scheduled to be released in Japan in 1999, during a major cultural event: the Year of France in Japan.", "platform": "Sony Playstation", "release_date": "1999", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Kalisto Entertainment", "publishers": "Unreleased Prototype", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "https://youtu.be/L3YWRChNcm8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/169695-x-po-2089-cyber-revolution\n"}