{"altername_name": ["Xena: La Princesa Guerrera"], "name": "Xena: Warrior Princess", "overview": "Grab your Chakram and sword, because the evil sorceress Kalabrax has broken free after centuries of imprisonment. She will finally get her revenge upon the gods who imprisoned her and the world they created. Only one thing is stopping her. In order for her spell to gain ultimate power to work she must sacrifice a queen. Unfortunately for Xena, it would appear that Gabrielle is the sacrifice de jour, being Queen of the Amazons and all. So with the help of her allies, who just happen to be Xena's bitter enemies, she has captured Gabrielle and it's up to Xena, Warrior Princess to save her. It won't be easy though. Nothing for Xena ever is. She will have to journey far and wide before she can face Kalabrax. She must defeat the vile King Valarian and his cronies as well as Narsus the evil renegade Amazon, and a host of other creatures like a cyclops and dragon just to name a few. Developed by Universal Studios Digital Arts, Xena: Warrior Princess is one experience you won't forget as you must defeat all the enemies on a stage, solve puzzles and save a few hapless villagers before you can continue on your journey. You have all of Xena's trademark moves and weapons at your disposal, including her classic warrior scream. Will it be enough to save Gabrielle from becoming an ingredient in Kalabrax's evil spell? Can you save the world? Do you really want to save the gods? There's really no choice; you must stop Kalabrax before all you hold dear crumbles in an instant. Safe journey! Battle on, Xena...", "platform": "Sony Playstation", "release_date": "October 5, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Universal Digital Arts", "publishers": "Electronic Arts", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.46", "wikipedia": "https://en.wikipedia.org/wiki/Xena:_Warrior_Princess_(video_game)", "video_link": "https://www.youtube.com/watch?v=LCiTqAYNyAA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11205-xena-warrior-princess\n"}