{"altername_name": ["Xenocracy"], "name": "Xenocracy: The Ultimate Solar War", "overview": "The year is 10,600, a time when Mankind has colonized space. This has only been made possible by the joint discovery of a liquid energy mineral called lycosite by the four great planetary superpowers - Earth Dominion, Mars Combine, Venus Alliance and the Mercury League. Distant moons have been colonized and subsequently terraformed to mine and refine this indispensable precious power source. Of course cooperation between the four superpowers was never to last and so each begin to wage a covert war for solar domination. Only you, Commander of the United Planet Nations elite peacekeeping squadron, can keep the hostilities from escalating into an all out thermostellar conflict! Xenocracy is a space flight combat game. Set within an accurately represented Solar System, you will pit sophisticated space fighters and bombers against human fleets, pirates and swarms of ravenous aliens. As the planetary superpowers skirmish amongst themselves, you must fight to maintain the peace and battle an implacable menace that threatens to destroy mankind! The player takes the part of Commander WingToucher of Rei Squadron, a pilot for the UPN, a kind of United Nations of the future. It’s peace keeping time but there is an awful lot of peace to keep since the planetary superpowers insist on bickering and squabbling like naughty children. Features: - Mix between space combat simulator and strategy game - Balance your aid between the planets or risking losing your impartial status - Battle pirates and a looming alien threat - Manage research and development of newer and more powerful technologies", "platform": "Sony Playstation", "release_date": "July 15, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Simis Ltd", "publishers": "Grolier Interactive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Xenocracy", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91400-xenocracy-the-ultimate-solar-war\n"}