{"altername_name": [], "name": "XI (sai) Jumbo", "overview": "XI Jumbo is Devil Dice sequel, this time the game was only released on the original PlayStation in Japan and Asia. The \"Jumbo Mode\" gameplay changes were integrated into Bombastic on the PS2. Ultimately exhilarating! XI [sai] is back and bigger than ever! This time, the Aquis are a bit different. Now they can jump, lift, and create reserved chains! New types of actions are possible with simple controls! Three completely redesigned, full-featured modes are included! There's even your own private Aqui room where fights, events, and dancing await. With all the new features and modes, this game can only be described as JUMBO! Gigantic jumbo dice appear to make your life miserable! Special note for those of you who have only played Devil Dice: the main change in this version is throwing, and not just throwing die but also throwing the other player! It can be a little tricky to get this right and expect to make a few mistakes early on. What you want to do is stand on the side of the dice you want to pick up, then pick it up and face the direction you want to throw it. Additionally, you can now jump. This means that if you want to not roll a rice to an empty space you can actually jump off the edge to the other side. Features: - New types of actions are possible with simple controls! Jump and lift with a single press of a button. Get those bothersome dice out of the way in no time! - Three completely new, full-featured modes! The Battle Mode has been completely redesigned. A two-field battle where opponents rain dice down upon each other is now used. Use your brain and vicious nature to defeat your opponent by snatching dice or hurling dice at them! - Your own private Aqui room! Fights, events, and dancing awaits. What sort of events could possible be in store?", "platform": "Sony Playstation", "release_date": "December 22, 1999", "game_type": "Released", "esrb": "", "developers": "Shift", "publishers": "Sony", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95847-xi-sai-jumbo\n"}