{"altername_name": ["Nightmare Project - Yakata"], "name": "Yakata Nightmare Project", "overview": "The story of Yakata Nightmare Project begins when the player's character is invited to travel to an island, but during the travel his ship sinks and he lost his memories. He arrived at a mansion and they tell him that the world is going to collapse, but he didn't believe such an story. When he wakes up next morning they discover a murder in a closed room. They first try to call the police but the telephone doesn't work, they will try to use the yatch but they don't have the keys but anyway there is an invisible force that will not allow them to go out of the island. PLOT: A young man named Yukiya goes on a yacht travel together with a few friends. Suddenly, a terrible storm comes out of nowhere: Yukiya is washed out on the shore. He regains consciousness, but not memories of recent events. Realizing that he is on an island, he begins to explore it and reaches a big mansion. To his surprise, his friends are already there; apparently, they have all been invited. Thinking that the worst is behind, Yukiya goes to sleep. But the next day, the young and beautiful owner of the mansion, Chiori Nakamura, is found dead in a locked room. One of Yukiya's companions reveals herself as the famous detective Edogawa Ranko (perhaps Conan's older sister; definitely a reference to the Japanese crime novel author Edogawa Ranpo). Under her guidance, the group decides to investigate the murder, but it turns out that the mansion is cut off the rest of the world. They are stuck on the island, and one of them might be a murderer...", "platform": "Sony Playstation", "release_date": "June 4, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Chime", "publishers": "ASK", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110684-yakata-nightmare-project\n"}