{"altername_name": ["焼肉アクションゲーム 焼肉奉行"], "name": "Yakiniku Bugyou", "overview": "This is a game sponsored by actual chain restaurants from Japan (the Gyu-Kaku: a well known chain of korean style BBQ places). When cooking food, various customers line up across the top of the screen who have been plucked from the spectrum of society. There's a fiery redheaded punk rocker, a somewhat flabby house frau, corpulent ones and a number of svelte maidens from fifteen possible customers who all have different preferences - rare, medium rare, well done or black. Stray from their desired meat treatment and face the wrath of a spurned and furious consumer. Do it just right and watch as your patron masticates a little morsel of heaven. Along with meat, meat, meat and more meat, other foods may be burnt as ordered up by the customer such as the occasional sprig of some vegetable or a slice of melon which are also thrown on the grill for some enzyme destroying heat. Up to 12 pieces of food may be thrown on the grill at once but since the foods appear randomly, one must work quickly to make sure that each customer does not wait too long for their desired cut of meat, vegetable or other. Food that is kept too long on the grill will also tend to stick or leave chunks of crust which slows down your pace. Graphical stylings include grill lines on meat when they've been sufficiently seared and smoke trails that rise from the grill as the meat sizzles and bubbles. Yakiniku offers light-hearted action in a week when many barbecues, grilling and other backyard smoking action are taking place around the meat munching nation. Publisher Media Entertainment designed Yakiniku Bugyou Bonfire with Japanese barbecue beef chain Gyukaku, whose store logo appears through the game.", "platform": "Sony Playstation", "release_date": "May 24, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Media Entertainment", "publishers": "Media Entertainment", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95848-yakiniku-bugyou\n"}