{"altername_name": ["雪割りの花"], "name": "Yarudora Series Vol.4: Yukiwari no Hana", "overview": "Yarudora Series vol.4 Yukiwari no Hana is the latest game in the Yarudora series for Playstation One console. The game series are also released in the PSP console. The game plot's is about a student at a university that lives next to a girl named Kaori Sakuragi who he has a major crush on. One day, he is invited to a party but refuses to go so that he can stalk the object of his affection. When he witnesses Kaori kissing her fiancé, he becomes distraught but soon after, two policemen knock on his door. They query him and ask if he knows a girl named Kaori Sakuragi... The time when truth & lie will collide in a story that takes place in a port area area of the city at winter. A story that combines loves with the anxiety caused by uncertainty. A forgotten past that is lost in the present and advance to an uncertain future, a love enveloped in silence and in the snowflakes that delayed the spring time that will bloom the flower that is covered in a white layer of mistery. Originally released in 1998, the Yarudora (an abbreviation of Yaru Dorama which translates to \"Drama that You Do\") series of games all followed a central theme where a girl with amnesia enters the player's life. With the appearance of the girl, an interactive adventure follows where the story plays out in animated motion with choices to select along the way which affect the ultimate outcome. Features in the game include a graphics gallery, a replay function, and the ability to view various endings once they are achieved during a normal game.", "platform": "Sony Playstation", "release_date": "November 26, 1998", "game_type": "Released", "esrb": "", "developers": "Production I.G.", "publishers": "Sony Computer Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113301-yarudora-series-vol4-yukiwari-no-hana\n"}