{"altername_name": [], "name": "You Don't Know Jack", "overview": "After four years of success on the computer screen, You Don't Know Jack finally makes its debut on the PlayStation. Forever billed as \"the show where high culture and pop culture collide,\" you and up to two friends compete in a game show priding itself in off-the-wall questions and all-out irreverence. Along with humorous, often suggestive topics, your host does the best that he can to insult you in any way possible. Of the 1,400 questions in the game (600 new ones and 800 from previous versions), most are of the multiple choice variety but they're not like anything you'd see on the SAT. For instance, choosing the category \"Hey! No Biting!\" will lead to a question like this: Oh no! You've been attacked by Count \"Facula\"! What are your symptoms? -You're burned to a crisp. -You're a list of Frequently Asked Questions. -You're covered in chocolate. -You've been transformed into a scrotum. To answer, you must buzz in and choose the appropriate selection, indicated by the symbols on the controller buttons. Depending upon the value of the question, a right answer awards players with a $1,000 to $6,000 payoff while an incorrect answer will subtract that amount from your earned total (and reward you with a nice shock from the Dual Shock Analog Controller). In a multi-player game, you can \"screw\" an opponent if you don't think he or she knows the right answer, forcing them to answer the question. Be careful with the screws; while the odds may be in your favor, a right answer rewards your opponent and equally penalizes you. Also, don't be surprised if the host forces you to answer a question if no one wants it and you've got a cushy lead. On occasion, different types of multiple choice questions will present themselves. \"DisOrDats\" force the player to associate a word with its proper category; \"ThreeWays\" involve all competitors as they race to match random words or phrases with one of three related words (bad dancer: George, Kramer or Elaine?), and $20,000 \"Impossible Questions\" typically live up to the hype. Each game concludes with a \"Jack Attack\" lighting round in which players must buzz in when two words or phrases relating to the final clue appear together. If your money total is high enough at the end of the game, you might have the glory of logging your name onto the top scores board. But no matter how much cash you've collected, you can still count on being informed that You Don't Know Jack.", "platform": "Sony Playstation", "release_date": "October 31, 1999", "game_type": "Released", "esrb": "T - Teen", "developers": "Jellyvision Games", "publishers": "Sierra", "genres": "Quiz", "max_players": "3", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11201-you-dont-know-jack\n"}