{"altername_name": [], "name": "Yuusha-Ou GaoGaiGar: Blockaded Numbers", "overview": "Yuusha-Ou GaoGaiGar is a Japanese anime television series series begun in 1997, created by Sunrise's internal \"Studio 7\" under the direction of Yoshitomo Yonetani, and was the eighth and final in the Yusha metaseries funded by Takara and produced by Sunrise. It takes place in 2005 (initially referred to as only \"the 21st Century\"), two years following an incident where the first identified extraterrestrial intelligence—classified as \"EI-01\"—crash-landed on Earth and absorbed a large number of machines into itself before disappearing without a trace. Following this incident, the Japanese government created a secret organization to combat potential alien threats: the Gutsy Geoid Guard, or \"GGG\", based beneath G-Island City in Tokyo Bay. Parasitic alien lifeforms known as \"Zonderians\" have begun to emerge; using the Zonder Metal of which they are made, they can assimilate various kinds of matter to form \"Zonders.\" which use humanoid beings as their hosts. The Gutsy Galaxy Guard gains three key resources with which to combat this threat: Galeon, a sentient mechanical lion of alien design; the alien child Mamoru Amami, whom Galeon had left with human parents eight years earlier; and the human cyborg Guy Shishio, whose life was saved by Galeon two years earlier and is capable of fusing with him, forming the mechanoid GaiGar. When combined with the GGG-made GaoMachines, GaiGar becomes the Super Mechanoid GaoGaiGar: a mecha capable of defeating Zonders, recovering their cores for Mamoru to \"purify\" and saving the human host in doing so. The Playstation game is a mix between an adventure game in which the player controls the character and goes to different places to make the adventure advance and a mini games action part in which the player have to pass different kind of action mini games (like jump on an orc, ride on a rollercoaster, defeat an enemy using an mecha robot, etc). The game uses third person perspective and a first person one for the sequences part, the game features japanese voice acting, a database mode that will be unlocked playing the game and lots of anime sequences.", "platform": "Sony Playstation", "release_date": "April 8, 1999", "game_type": "Released", "esrb": "", "developers": "Takara", "publishers": "Takara", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=54S7kWZl3CI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128621-yuusha-ou-gaogaigar-blockaded-numbers\n"}