{"altername_name": [], "name": "Zanac X Zanac", "overview": "Zanac X Zanac was released to celebrate the Compile's 15th anniversary of the release of its classic NES game, Zanac. Zanac is an arcade-style shoot 'em up video game designed by Compile and published in Japan by Pony Canyon and in North America by FCI. It was released for the MSX computer, the Family Computer Disk System, the Nintendo Entertainment System, and for the Virtual Console. It was reworked for the MSX2 computer as Zanac Ex and for the PlayStation as Zanac X Zanac. The game has three different versions of the original NES Zanac, and the new game Zanac Neo Players fly a lone starfighter, dubbed the AFX-6502 Zanac, through twelve levels; their goal is to destroy the System—a part-organic, part-mechanical entity bent on destroying Mankind. Zanac differs from other vertical shooters in its ability to adapt to your strengths and to adjust the game to attack your weaknesses. Your performance during the game and your choice of subweapon will partially determine what and how much Zanac will send at you. ZANAC STORY: The technology for faster-than-light travel was developed by humankind in only a short time. One of the expeditionary forces sent to investigate the stars near our galaxy believed they had found a relic of an intelligent extraterrestrial culture, and with this, the \"Icon\" (Holy Statue) was discovered. The Icon appeared to be intended to test the people who contacted it. If those people looked for the proper procedure, they would be able to open it in a nondestructive way and would receive beneficial knowledge in return. However, if they instead were impatient and used force to open it, it would reward them with destruction. The expeditionary force, each one of them suspecting that something was hidden inside, were impatient to make the discovery and turned their spacecraft's on-board weapons on the Icon. From the ruins of the destroyed Icon emerged a message which triggered the awakening of a huge battle \"System,\" lying in wait in space. However, it seemed as if there existed another chance to make up for humankind's failed test by the Icon. Another expeditionary team, unaware of the danger to Earth, encountered another Icon separate from the one that was destroyed, and were able to open it correctly. The Icon transmitted this success to System, requesting it to halt its attack. But System, having remained waiting an extreme length of time that its designers could not have predicted, had degraded to the point where it would no longer stop until its target was annihilated and thus had become a simple instrument of mass destruction. Because of this, the order to stop was disregarded and the attack on Earth was begun. In spite of the overwhelming difference in attack power, humanity went out to meet the approaching machines. Fortunately, one of the Icons was still operating normally, and from information obtained from it, a proposal was made to save Earth. System was a tactical machine, designed to battle against countless enemies. There was little hope of an all-out attack succeeding, but if a very small-scale attack with very strong attack power was used, a hidden thrust with a needle, so to speak, System would not be able to cope with it successfully. Then, by striking at the core, System would be defeated. Thus, the AFX battle machine (commonly known as ZANAC), the hidden trump card against System, was constructed and departed for the battle to save humanity. ZANAC NEO STORY: Humanity was just barely able to repulse the attack by the System bent on destroying the earth. However, the battle was not over just yet. System had used its long existence to multiply, and even though one System was destroyed, it was not long before another System took up the attack. That repeat battle has already been going on for 30 years. Even though humanity has been holding off System's attack, people are tired and exhausted. However, during the destruction of System's core, a pilot discovered the escape of a unit with the ability to transmit data. The unit escaped successfully, but as a result of analyzing who the signals were transmitted to, it was discovered that a host computer higher than the System existed. The investigation, along with discovering the location of this higher System, was able to establish its true nature. As the System was originally made as one part, this could be called its parent. If this \"original System\" could be destroyed, if it could be silenced, then the command hierarchy could be used to stop all other Systems, and finally the unending attack on the citizens of Earth could be ended. There was a big problem. The specs of the original System far exceeded that of the other Systems. If they raised a hand against it, humanity would certainly become a target for this original System. If they did not succeed on the first try, then it need not be said what the final outcome would be. Should they challenge it, or should they continue to endure? Faced with the slow decline of humankind, they decided to fight. And now, the Zanac unit heads out to begin the final battle.", "platform": "Sony Playstation", "release_date": "November 29, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Compile", "publishers": "Compile", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.81", "wikipedia": "https://en.wikipedia.org/wiki/Zanac#Release_history", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23093-zanac-x-zanac\n"}