{"altername_name": [], "name": "Zeiramzone", "overview": "Zeiramzone is a game based on the anime Iria: Zeiram the Animation that is a six episode OVA series featuring Iria, a female bounty hunter. The series serves as a prequel to the original live-action film Zeiram, taking place several years earlier when Iria is still a rookie and detailing the events surrounding her first encounter with the unstoppable Zeiram. The story begins with Iria as an apprentice to her older brother, Gren, a veteran bounty hunter, and his partner Bob, who work for Ghomvak Security along with a somewhat loutish hunter named Fujikuro. During a rescue mission to a hi-jacked spaceship called the Karma, they discover that the hi-jacker is actually a seemingly indestructible alien called Zeiram that broke out of the cargo hold during transit and began to massacre the crew. Bob is critically wounded by Zeiram while evacuating the survivors, and Gren is lost while attempting to kill Zeiram by destroying the Karma. Returning to Myce, Iria finds herself targeted by assassins working for Tedan Tippedai, the corporation that owned the Karma, and discovers a covered-up plot to control Zeiram in order to use it as a weapon. Iria escapes with the help of Fujikuro and reunites with Bob, who never recovered from his injuries but had his mind downloaded into a computer program. Together they continue to investigate rumours that Zeiram has appeared on Myce, and try to find out what happened to Gren, who also seems to have survived the Karma's destruction... In the game the player takes the role of the bounty huntress from Myce named Iria. The gameplay is a classic beat'em up in which the player advance through different levels defeating all the enemies on each level.", "platform": "Sony Playstation", "release_date": "December 13, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Crowd", "publishers": "Banpresto", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33527-zeiramzone\n"}