{"altername_name": [], "name": "Zoids: Battle Card Game: Seihou Tairiku Senki", "overview": "Zoids is a multi-media model-kit-based franchise originating from Japanese toy company Tomy (now Takara-Tomy); though now produced by various companies through licenses. The majority of the franchise is built around and focused on the various model kit series. The franchise has expanded from strictly motorized model kits to highly detailed and posable model kits, action figures and even PVC figurines. The various anime series, comics, manga books and video games all serve as tie-in media products for the franchise, to expand both consumer base and franchise recognition. Zoids are fictional mechanical life-forms, found on the planet Zi. A Zoid is essentially a mechanical animal formed around a techno-organic 'core' (known as a \"Zoid Core\"), which serves as its heart and mind. The Core is considered to be 'alive', making the Zoid a living creature. Otherwise, its body is an artificial mechanical construct like any other mecha. Beginning fairly early after the start of the original Japanese Zoid releases, the battle story first introduced the conflict between two rival nations: the Helic Republic and Zenebas Empire. Their main weapons were Zoids, living war machines built from metal-based lifeforms native to planet Zi. The Zenebas Zoids were mostly red and silver and more armored, the Helic more skeletal and favoring blue and grey. Zoids - Battle Card Game - Seihou Tairiku Senki it's a tactic RPG for the PlayStation system, the gameplay is like a table board game, you can combine the units with a card deck that includes weapons, situations, equipment, ammo, pilots, etc.", "platform": "Sony Playstation", "release_date": "July 26, 2001", "game_type": "Released", "esrb": "", "developers": "TOMY", "publishers": "Tomy", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113329-zoids-battle-card-game-seihou-tairiku-senki\n"}