{"altername_name": ["Zoids 2: Heric Kyouwakoku vs. Guylos Teikoku"], "name": "Zoids 2: Helic Republic vs Guylos Empire", "overview": "Zoids is a multi-media model-kit-based franchise originating from Japanese toy company Tomy (now Takara-Tomy); though now produced by various companies through licenses. The majority of the franchise is built around and focused on the various model kit series. The franchise has expanded from strictly motorized model kits to highly detailed and posable model kits, action figures and even PVC figurines. The various anime series, comics, manga books and video games all serve as tie-in media products for the franchise, to expand both consumer base and franchise recognition. Zoids are fictional mechanical life-forms, found on the planet Zi. A Zoid is essentially a mechanical animal formed around a techno-organic 'core' (known as a \"Zoid Core\"), which serves as its heart and mind. The Core is considered to be 'alive', making the Zoid a living creature. Otherwise, its body is an artificial mechanical construct like any other mecha. Beginning fairly early after the start of the original Japanese Zoid releases, the battle story first introduced the conflict between two rival nations: the Helic Republic and Zenebas Empire. Their main weapons were Zoids, living war machines built from metal-based lifeforms native to planet Zi. The Zenebas Zoids were mostly red and silver and more armored, the Helic more skeletal and favoring blue and grey. The Zoids revival in 1999 included both an anime and a new battle story. After decades of peace, the current Emperor died, leaving only the young Rudolph as his heir. His regent, Prozen, took the opportunity to resume the conflict between the Guylos Empire and the Republic. Early on, both sides used their past Zoids, the model line focusing entirely on reissues of popular past kits. Zoids 2 - Helic Republic VS Guylos Empire (aka Zoids 2 - Herikku Kyouwakoku VS Gairosu Teikoku) is a PlayStation simulation game set in the Zoids universe. The game pits the Helic Republic against the Guylos Empire, using the popular Zoids toys/anime characters to battle out the conflict. Players move the more than 100 different Zoid units to try to beat the computer-controlled enemy forces. There is also a two-player versus mode where players pit their Zoids against each other.", "platform": "Sony Playstation", "release_date": "February 21, 2002", "game_type": "Released", "esrb": "", "developers": "Will", "publishers": "Tomy", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113328-zoids-2-helic-republic-vs-guylos-empire\n"}