{"altername_name": ["ZXE-D: Legend of Plasmatlite"], "name": "ZXE-D: Legend of Plasmalite", "overview": "This game doesn't work in any emulator since it needs the Robot Controller plugged in the memory card to work. ZXE-D is a novel game, and an expensive one at that, for the Playstation. The game package sits in a large suitcase sized container that houses four plastic model robots that can be built from the included parts and the ZXE-D game disc. Two of the models are full height robots that stand about 5 inches high. Assembling the robots is very easy, the parts are designed so that they click and latch onto each other for a simple and uncomplicated project. No glue, paint or exacto knives are required to assemble these beautiful models. The models are very detailed and should give lovers of quality plastic constructs a nice addition to their collection. The ZXE-D program is capable of interpreting the way that the robots are constructed and will show them accordingly on screen. For example, the robot to the left will look exactly like you have made it on screen, with its awkward proportions and color schemes intact. The robot plugs into the Playstation through a cable that extends from the back of his torso. The cable goes into the Playstation memory card slot. Its impressive and very innovative for this first attempt at something new for the Playstation. You can choose from eight different player characters as your mech driver. The pilots don't really make too much of a difference in the actual battles since the mechs are what matter but some characters have better stamina while others are more agile in their controlling patterns. Each robot has their own set of signature and special moves that may be executed with the common semi-circle and button combinations.", "platform": "Sony Playstation", "release_date": "December 20, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai", "publishers": "Bandai", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95850-zxe-d-legend-of-plasmalite\n"}