{"altername_name": [], "name": "Cal Towns", "overview": "This compilation contains: Cal Cal II The second game can be started only after having completed the first one. CAL The hero of this game is an ordinary high school student (the player has to name him by himself). He is mostly interested in pretty girls, in particular the lovely Mika, with whom he is even ready to discuss books just to get her attention. One day, a beautiful woman appears in front of him out of nowhere. She says that she is Venus, the goddess of love. She comes from a world called Cal, the eternal world populated by lovely girls. She tells the hero that soon he will be needed in that world... and disappears. Was that a dream? Or will our hero really travel to the magical world of Cal and encounter dangers he hasn't even imagined before? Cal is a visual novel, with the sole interaction consisting of choosing sentences to say and sometimes actions to do from a context-specific menu at the bottom of the screen. Usually only one such selection triggers the next event; some choices lead to Game Over. The game contains erotic pictures with nudity and sexual situations. CAL II You are Wataru Ishibashi, a high-school student in modern Japan. Up until recently you led a normal life, enjoying the relationship with your lovely girlfriend Mika. But short before the graduation ceremony, you had a strange vision that you first believe to be a dream. But when you are contacted by Venus, the goddess of love, you realise Mika was abducted by Aeon, the goddess of time, and transferred into the Realm of Time. You must now travel to the legendary dream world of beautiful goddesses and bring Mika back. Cal II plays like a Japanese-style adventure game with visual novel elements. You read the text and sometimes are able to choose between various actions. In addition, there is a \"world map\" on which you navigate your character from a top-down view, visiting different locations in an order you prefer. The game features voice-overs for the dialogues.", "platform": "Fujitsu FM Towns Marty", "release_date": "1992", "game_type": "Released", "esrb": "", "developers": "Birdy Soft", "publishers": "Birdy Soft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/138062-cal-towns\n"}