{"altername_name": [], "name": "Can of Worms", "overview": "Can of Worms is a collection of eight small aand humorous games: Acne: You are Dr. Frankenstein and you have brought your monster alive, but problem is, his face is breaking out in acne. You must move a cursor around the monster's face and remove as much acne as you can. Vasectomy: You are a surgeon and your latest surgery is a vasectomy but you are drunk and the patients 'manhood' seems to be moving around all over the place. You have to move a pair of scissors around the screen to catch the moving organ and snip it in the right place. Smut: A program that shows four random words on screen attempting to show a smutty sentence. Hitler: Hitler is alive in an old people's home in Cambridge and moves about in a wheelchair. You have been given the task to kill him by giving him a heart attack. To do this you must place a whoopee cushion underneath him by picking a number on where you think he will stop. You have to successfully place the cushion ten times to kill him. Dole: You are in Government and you you are presented with five items and their figures which are Cuts, Inflation, Majority, Dole and Term. You must survive for as long as possible by adjusting the figures to keep everyone happy and not get the sack. Royal Flush: The King is on the toilet but the pipes are prone to suffer blockages. It is your job to remove the offending blockage by choosing a number between one and nine and then flushing. Too little flush and the blockage stays, too much and the King gets covered. Reagan: Plays like Acne but instead of removing spots you have have to remove grey hair from the head of former President of the USA, Ronald Reagan. P's 'n' Q's: You want to pee but the toilet appears in various places and you have to make sure your stream hits the bowl. You choose a number between one and ten to choose the power of your peeing.", "platform": "Sinclair ZX-81", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Automata Cartography", "publishers": "Automata Cartography", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373939-can-of-worms\n"}