{"altername_name": [], "name": "Dangel", "overview": "Long time ago, there was balance in the world. Three great tribes lived in peace with each other. Up in the sky, the Heavenly Tribe; down on the Earth, the Human Tribe; and between them, the Demon Tribe. But among the demons, there were some who wanted more power. The members of the Heavenly Tribe were forced to seal the rebellious demons in what they called \"Path of Light\". But one of them figured out how to break the seal. The demons were now free, and they attacked the Human Tribe. Horrible massacres, ruined cities and villages, exterminated nations - it looked like the End of Days had come to the humans... ...A boy named Anduke was raised in a secluded location by two female elves. It was clear that the boy possessed extraordinary powers: at the tender age of nine, he was already able to sexually satisfy his lovely nannies. But a mysterious force tore the boy away, knocking him unconscious. He awoke ten years later, in a human village. A promise given to a young girl led him to a fateful meeting that revealed his destiny: he had the blood of Heavenly Tribe in him, and was the only one able to save the Human Tribe from the demons... Dangel is a traditional Japanese-style RPG. Anduke meets companions on his quest, who join his party. The navigation is done from top-down perspective, while random turn-based battles use first-person view. Player-controlled characters can use regular attacks or magic. Anduke is also able to give commands to his elf companion, who has access to many magical spells. The game features full-screen anime-style cut-scenes to advance the story, many of which depict sexual encounters.", "platform": "Fujitsu FM Towns Marty", "release_date": "1996", "game_type": "Released", "esrb": "", "developers": "Mink", "publishers": "Mink", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/138073-dangel\n"}