{"altername_name": [], "name": "Drakkhen", "overview": "A player may freely travel the entirety of Drakkhen's game world not long after beginning a new game, although this can be unwise in practice. Chance encounters with hostile monsters are regular, but in contrast to other RPGs, the player may be attacked while stationary. All battles are automated by default but allow the player to micromanage their four combatants. The player is given time to focus on the real-time tactics of each enemy encounter, such as activating defense magic, moving around, or switching weapons on the fly. The player's party may also be accosted at night when viewing constellations in the sky, or any time after bumping into a half-buried urn. The player may attempt to flee from attackers or retaliate against foes who, when defeated, grants all party members experience points that go towards leveling up and improving character stats. Each of the characters in the player's party have health points, magic points for spellcasting, power, defense, physique, fortune, intelligence, knowledge, and agility; each stat has a direct effect on how a character plays. Character stats are assigned by the player at the start of the game using a cap-and-trade system. Each party member fills one of the four roles: scout, wizard, fighter, and priest, each with different strengths and abilities. Items can be purchased from traveling merchants who ambush the party, or at the tavern. Items are categorized as armor, weapons, healing items, rings, and misc. (such as torches). Past castles can be revisited at any time, which themselves act like Temples found in Legend of Zelda games. Castles are self-contained levels with obstacles, loot, enemies, and maze-like architecture; and they each must be visited at least once. Drakkhen's gameplay is colored by its early-game brutality and surreal enemy encounters, the former especially in the SNES version. One special enemy is relegated solely to appearing when the player kicks one of the many urns in the ground. Upon doing so, a black, stationary canine head rises from beneath the floor to shoot bolts from its eyes. These encounters are quickly fatal to new players who don't know any better. They offer no experience points, suggesting that kicking an urn is frowned upon. Another difficult enemy is the \"Shadow Man\", a tall figure that can unexpectedly lift itself out of the ground, accompanied by an ominous tune. Each enemy has movement and attack differences, some being less subtle than others, such as enemies that zigzag sporadically at a much greater speed than the player's party can keep up with. The game contains over one hundred different enemy variants.", "platform": "Fujitsu FM Towns Marty", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Infogrames", "publishers": "Fujitsu", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.07", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=k_Pep1toCCM&ab_channel=FunCade64", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96765-drakkhen\n"}