{"altername_name": [], "name": "EMIT Vol. 3: Watashi ni Sayonara o", "overview": "Emit is a visual novel divided into 3 parts which was made to help Japanese people study English. The game can be played both in English or Japanese with the ability to listen to the audio and/or read the transcript in both languages. There are 2 modes to play the game: Story mode and English Game mode. The story mode is the main game divided into chapters where players get to watch the story unfold and can do a number of exercises after each chapter. During the story mode, players can pause the game at any time in order to look up a term they didn't understand or to change the language. The exercises are: Listening comprehension activities where players pick the right options to check their understanding of the story. Guessing what's going to happen where players choose the question that's closest to their opinion and listen to the characters in the story commenting about the player's opinion. Conversation practice where students can listen to the characters speech and act out the dialogues. Exclusive to the third volume is a new English Game called Ghost Sweeper. This game is modeled after traditional turn-based RPGs and in this game players must defeat ghosts and search for objects in haunted houses that they can sell. Players can encounter enemies in set places on a map as well as when searching for objects in rooms and furniture. Some ghosts that are trapped can tell the player where to find things if the player guarantees their freedom. The last volume concludes the story with Yuri barely surviving her trip back to her world. In this game, Yuri searches for her doppelgänger to get her back to her world and to her son.", "platform": "Fujitsu FM Towns Marty", "release_date": "September 18, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "0.5", "wikipedia": "https://en.wikipedia.org/wiki/Emit_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/138129-emit-vol-3-watashi-ni-sayonara-o\n"}