{"altername_name": [], "name": "Lunatic Dawn II", "overview": "Like other Lunatic Dawn games, Lunatic Dawn II is, despite its Japanese origins, an exploration-oriented Western-style RPG. There is no main story line in the game, beside the cryptic mentioning of a legendary group of heroes who fought demons and as a result became demons themselves in the introduction sequence. There are no \"main goal\"in the game, and no plot-advancing events; it is entirely dedicated to free-form exploration and role-playing. In the beginning, the player creates the main character (default name Lunatic), choosing gender and background - social status, strengths and weaknesses, etc. All this affects the parameters of the character, which include strength, stamina, weapon technique, charisma, etc. Like in the previous Lunatic Dawn game, the gameplay revolves around exploring the vast game world. The graphics are much more detailed in this installment, with actual locations within a city. There are more shops and places of interest to visit in each city, including the ruler's castle, as well as horse stables, where it is possible to buy a carriage to quickly transport to another city. It is possible to \"call the master\" in every location; some of the masters will join the main character. Also available for recruiting are various NPCs staying in the inn (a party can contain up to six characters). The NPCs have names and different abilities/parameters, but no distinct personalities. As before, there is a real day-by-day calendar in the game, and it is necessary to buy food rations for several days ahead if the player is planning a long journey. \"Jobs\" are available at the inns of various cities, which include treasure hunt, monster-eliminating, etc. The heroes get paid for completing those tasks. Roaming the top-down world map, the party can enter dungeons, which are viewed from an isometric perspective. Enemies are visible on the screen, and a turn-based battle initiates upon contact. The player can assign general strategies to the whole party, but is only able to control directly the main character. The party acts according to its AI, and the rest of the battle evolves automatically until the player interrupts it to input new commands.", "platform": "Fujitsu FM Towns Marty", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "ArtDink", "publishers": "ArtDink", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/138203-lunatic-dawn-ii\n"}