{"altername_name": [], "name": "Phoenix Adventure", "overview": "Phoenix Adventure is an arcade adventure where you must find and kill a Black Phoenix over four parts with an energy of 100. The parts you will encounter are: Hexagonal Room: You are in a room with eight doors leading to eight rooms described with text. Inside the rooms are creatures and traps and you must enter each room finding objects to take to other rooms to receive other objects. If you enter a room that has been solved then you lose 15 energy. Land of the Goblins: You have been teleported to a large area viewed from above on the whole screen. You start on the left of the screen and you have to reach an exit on the right side of the screen. Also in this area are Goblins and Dragons and you must avoid them or lure the Goblins into swamps and find a sword to kill the Dragons. You move one place at a time in eight directions before each creature moves one place each and if you touch a creature you lose energy. Food can also be collected to give you energy boosts. Coded Room: This part takes the form of a wordsearch grid full of letters and you must move around the grid horizontal and vertically to make a message. The message must be continuous and if you get a letter wrong then you lose energy and have to start the grid again with a new message. Land of Phoenix: You are now in an area viewed from above with the whole area seen on screen. There are five locations and also where the Phoenix lives and you must explore the locations to equip yourself for the final showdown. The locations are Pit, Caves, Castle, Swamp and Forest and like the Hexagonal Room, there are objects and traps, and you must enter each one to get the objects to help you receive other objects. Once you are equipped you can go and face the Phoenix. The game is half text-adventure, half action-adventure.", "platform": "Sinclair ZX-81", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "CDS Microsystems", "publishers": "CDS Microsystems", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367608-phoenix-adventure\n"}