{
  "name": "7 Wonders: Treasures of Seven",
  "shortName": "7-wonders-treasures-of-seven",
  "description": "<i>7 Wonders: Treasures of Seven</i> is a tile-matching game, where the player swaps adjacent runes on a grid, making matches of three or more to remove them. The remaining pieces move downwards, occupying the vacant spaces. A water column at the right side shows the time left to complete each level. The objective is to destroy the stone background by making matches over it. The pieces of broken stone fall on the field, where workers collect them to construct a monument.<br><br>After removing all the background stone, a key <b>7</b> piece appears on the grid surrounded by an outline. It can only move within the limits of the closed lines, and the player must make it fall inside a specific glowing slot, guiding it by making matches and turning the whole grid on its sides. Two arrows at the top allow the grid to rotate 90º to the left or right side.<br><br>Special pieces on the grid release their powers after being swapped with adjacent tiles. The ice ball appears after a match of four runes is made. It removes a line of tiles, breaking the background stone as well. The fire ball appears after a five-runes match, and destroys both a column and a row with its fiery cross. The dice piece appears after using several ice and fire balls, and removes random tiles from the grid.<br><br>Sometimes, a parchment with a proposed bonus match appears at the left side, staying there for a minute. If the player manages to make the match before the time runs out, the column of water freezes giving extra time to clear the board.",
  "publishedBy": "MumboJumbo, LLC",
  "developedBy": "MumboJumbo, LLC",
  "released": "Dec 03, 2011",
  "alsoFor": "Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/7-wonders-treasures-of-seven",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Falling block puzzle, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "MumboJumbo, LLC",
          "developer": "MumboJumbo, LLC",
          "ported": "",
          "country": " United States",
          "releaseDate": "Dec 03, 2011",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}