{
  "name": "Atlantic Quest",
  "shortName": "atlantic-quest",
  "description": "&quot;Under the sea, under the sea! Darling, it's better down where it's...cough...cough!&quot; Life under the sea was good but then an oil tanker spilled thousands of gallons of crude oil. Help save the fish!<br><br><i>Atlantic Quest</i> is a match three game. You have three match options to select from. There is the &quot;swap two items to create a straight line of three or more&quot; style. There is the chain style where you click and drag your mouse along a line of three or more of the same items, and there is the click on a group of three or more of the same items style. You can swap between styles at any time by selecting it at the bottom. There are fish trapped in green oil bubbles. Below these are blue bubbles with a picture of an item from the board. To release the fish, match the item in the blue bubble. Also on the board are green oil tiles. Make matches over these to clear them. To clear a level, clear all green tiles and free all fish.<br><br>As the game progresses, you will have bonus items, like a bomb that clears some squares and obstacles, like a stone that keeps items from dropping. To clear the stone, make a match next to it. Later, you also have pearls that, if you get them to the bottom of the board, give you a bonus extra. These pearls are:<ul>\n<li>Orange: The clownfish: Removes the item and tile from one square, anywhere on the board.</li>\n<li>Green: The octopus: Shuffles the board.</li>\n<li>Blue: The shark: Randomly removes items and green tiles from the board. Only removes items where there are green tiles.</li>\n<li>Red: The crab: Tosses a stick of dynamite randomly onto the board. It removes a large chuck of items and green tiles.</li></ul>\nIn between stages, you have puzzles. These may be a mixed up picture that you must put in order.",
  "publishedBy": "Avanquest Software Publishing Ltd.",
  "developedBy": "rokapublish GmbH",
  "released": "Feb 17, 2012",
  "alsoFor": "Macintosh, Nintendo 3DS, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/atlantic-quest",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Falling block puzzle, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Avanquest Software Publishing Ltd.",
          "developer": "rokapublish GmbH",
          "ported": "Heptamind UG",
          "country": " United Kingdom",
          "releaseDate": "Feb 17, 2012",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}