{
  "name": "Band Hero",
  "shortName": "band-hero_",
  "description": "This version of <i>Band Hero</i> is more of a successor to the <a href=\"https://www.mobygames.com/game/guitar-hero-on-tour\">Guitar Hero: On Tour</a> games than a port of <a href=\"https://www.mobygames.com/game/wii/band-hero\">Band Hero</a>. The game includes 45 pop songs.  Two tracks are identical to those from the console version, while some artists are present in both versions, albeit with different songs. The tracklist of the US and European versions differ: both share 15 songs, but each have 30 unique tracks.<br><br>The band consists of four artists (vocals, guitar, bass and drums) and the player takes control over one of them. While the vocals always require singing into the DS microphone, the other instruments are basically quick-time events: notes of four colours fall down the screen and the player has to press the associated buttons with the right rhythm. This is either done with the regular buttons or with the two included hardware attachments which fit into the GBA slot. In addition to the known Guitar Grip for guitar and bass players, this game introduces a drum skin (DS Lite only) which fits over the control interface and has the player tapping on four buttons. When doing well, star power is awarded which eventually allows to activate a score multiplier. Another way to get star power is playing touch screen mini games during the song.<br><br>Because there is no career mode, the player is restricted to playing single songs either in single- or multiplayer with any instrument combination. This awards money which is used to unlock more objects for the characters. However, there is an option to connect with the Wii version. Then the player can either participate in the Roadie multiplayer mode (up to two DS player try to sabotage the Wii band) or in fan requests (challenges) which unlock items for the Wii version.",
  "publishedBy": "Activision Publishing, Inc.",
  "developedBy": "Vicarious Visions, Inc.",
  "released": "Nov 03, 2009",
  "alsoFor": "",
  "genre": "Action, Simulation",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/band-hero_",
  "visual": "",
  "gamePlay": "Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "Vicarious Visions, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 03, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}