{
  "name": "Bleach: The 3rd Phantom",
  "shortName": "bleach-the-3rd-phantom",
  "description": "<i>Bleach: The 3rd Phantom</i> is a turn-based strategy game based on the anime series <i>Bleach</i>. This game tells a spin-off story: while there are many familiar faces present, the protagonists Fujimaru and Matsuri Kudo are new characters. Both join the Soul Society, an organization facing the soul-consuming Hollows, and become involved in a story of betrayal and revenge. Depending on the chosen character, there are minor differences in the story which is mostly told in dialogue windows.<br><br>The game can be divided into two main parts. The battles are played on an isometric playfield. The player moves the available characters, brings them into position to attack enemies. All characters have different abilities which make them more or less effective against certain enemy types. Important to take into account are the team mechanics: when two characters are near each other they help each other out when attacked or can perform a cooperative attack. While only seven characters can participate in a battle, the player can unlock about 50 during the campaign to choose from.<br><br>Between fights, there is free time which is organized similar to a board game. The character starts at one end of the area and moves toward the end by choosing events. These usually involve interactions with other characters and certain panels give permanent bonuses or items which can be used during combat. Each event coses a certain amount of action points: the character moves one space per used action points - this means the player will pass certain fields and won't be able to choose between the associated events. Free time ends when all action points are used up or the character ends on a field which instantly ends it. Here the player can also improve each character by dividing ability points (earned after level-ups) on their statistics (e.g. health or accuracy) or weapon (unlocks new abilities or elemental powers). It is also possible to participate in training fights for grinding experience and items (there are no shops).<br><br>Besides the campaign, the player can also participate in survival matches (unlocked after beating the campaign) or multiplayer fights with either pre-defined or saved campaign characters.",
  "publishedBy": "SEGA of America, Inc.",
  "developedBy": "H.I.C. Co., Ltd., Tom Create Co., Ltd.",
  "released": "Sep 15, 2009",
  "alsoFor": "",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/bleach-the-3rd-phantom",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "SEGA Corporation",
          "developer": "H.I.C. Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 26, 2008",
          "ean13": "4 974365 910372",
          "comments": ""
        },
        {
          "publisher": "SEGA of America, Inc.",
          "developer": "H.I.C. Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 15, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}