{
  "name": "Brain Quest: Grades 3 &amp; 4",
  "shortName": "brain-quest-grades-3-4",
  "description": "<i>Brain Quest: Grades 3 &amp; 4</i> is an educational quiz game as an adaptation of the Brain Quest series of flashcards which quizzes children on a variety of academic subjects. Aimed at children aged eight to ten (the American grades three and four), it contains 6,000 questions on a variety of subjects such as English, Science, Math, History, Geography, and Grab Bag. The latter is a mix of music, food and pop culture.<br><br>Different approaches are used to answer the questions. Players can tap to fill in the missing letters in words, cross letters out, select the correct answer from a list of possibilities (through words or images), do pairs matching by drawing lines, or use the stylus to arrange a sequence in the correct order. Questions appear in the upper screen and answers need to be inputted in the lower part. There are many cartoony characters and backdrops that provide a visual element to the questions. Questions are organized in series and the game keeps track of the player's score.<br><br>The available game modes are Brain Mode, Quest Mode, Multiplayer, and Sudoku. Collectibles can be gathered while playing and these are stored in a separate menu. In Quest Mode players participate in the Quest Extreme Games festival and complete quizzes to talk to other kids, win competitions and research subjects. Prizes awarded in this mode are used in a customizable scrapbook. Multiplayer is of the hot seat variety where the DS is passed on and scores are compared afterwards. Multiplayer can also be done cooperatively. The Sudoku mode offers sudoku puzzles of 4x4, 6x6, and 9x9.<br><br>The game mechanics are identical to <a href=\"https://www.mobygames.com/game/brain-quest-grades-5-6\">Brain Quest: Grades 5 & 6</a>, released on the same day, only the content is different.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Planet Moon Studios",
  "released": "Sep 22, 2008",
  "alsoFor": "",
  "genre": "Educational, Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/brain-quest-grades-3-4",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Planet Moon Studios",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 22, 2008",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}