{
  "name": "Build-a-lot",
  "shortName": "build-a-lot",
  "description": "As a real-estate developer, it's your job to buy, sell, build, rent, and upgrade houses to make a profit. In each level, you are given a field of houses and lots, only some owned by you. Lots can be built on, and houses can be upgraded or demolished. Houses and lots up for sale can be bought by you, and ones owned by you can be sold, or held on to for the rental income. Workers and materials are also tracked; materials are needed to build or upgrade houses, and you need workers to work on the projects. Buying in bulk will result in cheaper prices, but requires a large cash investment. Adding to the fun are special buildings that change the rules; building a bank gives you interest on your money, a workshop lets you train workers cheaper, and so on.<br><br>Two modes are included. In career mode, each level has a different challenge, with a time limit. (For example, building several houses of some type, and having a rental income of over a certain amount.) There's also a second time limit, much tighter than the first, which if achieved, gives a star for the level. In casual mode, each map has a cash goal, but there's no time limit.",
  "publishedBy": "MumboJumbo, LLC",
  "developedBy": "HipSoft LLC",
  "released": "Dec, 2008",
  "alsoFor": "Android, iPhone, Nintendo DSi, Windows | Combined View",
  "genre": "Simulation, Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/build-a-lot",
  "visual": "",
  "gamePlay": "Real-time strategy",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "MumboJumbo, LLC",
          "developer": "HipSoft LLC",
          "ported": "",
          "country": " United States",
          "releaseDate": "Dec, 2008",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}