{
  "name": "Captain Morgane and the Golden Turtle",
  "shortName": "captain-morgane-and-the-golden-turtle",
  "description": "<i>Captain Morgane and the Golden Turtle</i> is a prequel to the <a href=\"https://www.mobygames.com/search/quick?gamegroup=So+Blonde\">So Blonde</a> games. Set in a much earlier era, the player follows the adventures of Morgane, daughter of pirate captain Alessandro Castillo. In the first chapter, that doubles as a tutorial, she is a young girl that wants to go out and play with her friends Nell and Bobbi, but her mother says she has to do some chores first. This involves finding some items and using them to clean up some dust and dirt around the house. When that is done, she is finally free to do as she pleases. Joining her friends she finds the local bully, Arno, pestering the two. She defeats him and climbs her favorite look-out rock, then sees her father's ship come in. Climbing through the bedroom window (the door is locked as her parents always have to do these silly private cuddle sessions when he gets home), she overhears him telling her mother that Uncle Eduardo fell overboard and is missing (presumed dead). Morgane is inconsolable. In the next chapter, players join Morgane again as she is made acting captain as a birthday present. After her mother died, her father had no other option than to take her aboard and let her travel with him. Now she's finally old enough to get given some more responsibility on the ship, much to the chagrin of the first mate, Diego. Her first task is to go ashore and find a new crew and a cargo for the ship she gets to pilot, the Winsome Maid.<br><br>During the game, the player visits five islands, one of them the same island that Sonny will one day wash up on. It reuses some of the locations and characters from <a href=\"https://www.mobygames.com/game/so-blonde-back-to-the-island\">So Blonde: Back to the Island</a> but it is not necessary to have played any of those games to understand the story. Travelling on the islands is instant through clicking on locations on an interactive map, between the islands by clicking on the ship in the docks. Progress is made by talking to people, solving puzzles and playing mini-games. The latter are entirely optional. The Nintendo DS version has no voice-overs but is otherwise identical to the other versions.",
  "publishedBy": "Reef Entertainment Ltd.",
  "developedBy": "Wizarbox SARL",
  "released": "Mar 16, 2012",
  "alsoFor": "PlayStation 3, Wii, Windows | Combined View",
  "genre": "Adventure",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/captain-morgane-and-the-golden-turtle",
  "visual": "",
  "gamePlay": "Graphic adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Reef Entertainment Ltd.",
          "developer": "Wizarbox SARL",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Mar 16, 2012",
          "ean13": "5 060112 430749",
          "comments": ""
        },
        {
          "publisher": "dtp entertainment AG",
          "developer": "Wizarbox SARL",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Apr 20, 2012",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/585006-captain-morgane-and-the-golden-turtle-nintendo-ds-screenshot.png",
      "caption": "Title screen"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/242719-captain-morgane-and-the-golden-turtle-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/242720-captain-morgane-and-the-golden-turtle-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/242929-captain-morgane-and-the-golden-turtle-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United Kingdom",
      "platforms": "Nintendo DS"
    }
  ]
}