{
  "name": "Ch?gaku Eitango Target 1800 DS",
  "shortName": "chgaku-eitango-target-1800-ds",
  "description": "<i>Ch?gaku Eitango Target 1800 DS</i> is an educational English language learning game based on the <i>Eitango Target</i> series of books by Obunsha. These books teach a common common set of English words in order to help students pass English exams. This game, specifically, is based on the <i>Ch?gaku Eitango Target 1800</i> which teaches 1800 common English words selected for a middle-school audience.<br><br>A variety of different modes are provided to let players study:\n<ul>\n    <li>Self-study mode: Provides a dictionary of the 1800 words along with recordings of their pronunciations.</li>\n    <li>Test mode: Players select a group of words, and then must write them down in English after hearing them spoken. This uses the DS's touchscreen and handwriting recognition.</li>\n    <li>Game mode: Two different minigames to test players' memories from the other modes. In Pop'n English, players have to use the stylus to pop bubbles containing words that match a spoken word. In English Puzzle, players are given four kanji and a grid of sixteen English letters and have to draw a line through the letters to spell English words that translate to the four kanji.</li>\n</ul>",
  "publishedBy": "IE Institute Co., Ltd.",
  "developedBy": "Mechanic Arms",
  "released": "Aug 10, 2006",
  "alsoFor": "",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/chgaku-eitango-target-1800-ds",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "IE Institute Co., Ltd.",
          "developer": "Mechanic Arms",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 10, 2006",
          "ean13": "4 582107 391183",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1040839-chugaku-eitango-target-1800-ds-nintendo-ds-screenshot-title.png",
      "caption": "Title screen / Main menu"
    }
  ],
  "cover": []
}