{
  "name": "Daigasso! Band Brothers",
  "shortName": "daigasso-band-brothers",
  "description": "<i>Daigasso! Band Brothers</i> is music game in which the player can choose any instrument in a song, and then perform that instrument's role in the song. Your ability to perform will affect the outcome of the song, as your input corresponds with musical notes. To play your instrument you use the buttons on the DS. Beginner Mode only requires you to press either the D-Pad or a button, and will play harder sections of songs for you by touching the touch screen when shown. As you progress through the Amateur and Pro modes, you'll be using all eight face buttons/directions to play an entire octave, and shoulder buttons to modify the note, making it a sharp or an octave higher.<br><br>The top screen shows the next few bars of music, with the buttons you are required to press to play your instrument. A marker will move along each bar, showing the notes the player needs to play. Correctly playing the right notes at the right time will result in the song playing perfectly, while too many mistakes will create a mess of inaccurate sounds.<br><br>In multiplayer mode, up to eight players on one cartridge each pick a different instrument and try and play a song together, with each player hearing everyone else's mistakes.<br><br>A unlockable song editor allows you to create your own MIDI compositions, and then play these normally in the game. You can also create simple songs by humming or whistling into the microphone.",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Nintendo SDD",
  "released": "Dec 02, 2004",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/daigasso-band-brothers",
  "visual": "",
  "gamePlay": "Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Nintendo SDD",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 02, 2004",
          "ean13": "4 902370 509755",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/45987-daigasso-band-brothers-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/45988-daigasso-band-brothers-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/45989-daigasso-band-brothers-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    }
  ]
}