{
  "name": "Desktop Tower Defense",
  "shortName": "desktop-tower-defense",
  "description": "As indicated by the name, <i>Desktop Tower Defense</i> is a strategy game in the tower defense genre that takes place on a desktop—that being an actual desk, as the background shows a wood surface, the edge of a keyboard, and some loose change among other objects. During each round the player is presented with a blank field that they must populate with a variety of towers, all having unique weapon capabilities.<br><br>Some of the weapons include Pellet Towers, which simply fire  small pellets; Dart Towers, which of course fire darts; Frost Towers, which can freeze the enemy; and Ink Towers, which fire ink that traps the enemies in place. The enemies in this game are known as creeps, and there are multiple varieties which resemble various microorganisms. All have different abilities—some are more resistant to damage, others move faster, while some can even fly (necessitating the use of &quot;anti-aircraft&quot; towers). <br><br>The player's score is calculated based on how many creeps escape to the exit, and how much time is left on the clock when they proceed to the next level (once all creeps are destroyed, the player can either wait out the clock, or click on a button to immediately go to the next level). Destroying creeps earns gold that can be used to buy or upgrade towers.  Upgrading towers makes them more powerful, and is necessary to defeat some of the more advanced creeps.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Humagade Inc.",
  "released": "May 11, 2009",
  "alsoFor": "Browser | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/desktop-tower-defense",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Tower defense",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Humagade Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "May 11, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}