{
  "name": "Diner Dash: Flo on the Go",
  "shortName": "diner-dash-flo-on-the-go",
  "description": "Flo is back, but this time, she is on vacation.  Join Flo as she works as a waitress while on vacation.  Flo was planning on just taking a nice, quiet vacation, but she keeps losing her clothes and needs to work to make money to buy new clothing.<br><br>The gameplay is very similar to the other games in the series.  You play as Flo, who is a waitress.  Your job is to seat and serve customers and to clean up after they leave.  Different customers act differently, with some being very patient, some being loud and annoying, and some being in a hurry.  Also, each person is a certain color and if you can match the person with a seat that is the same color, you can get bonus points.  First, you'll need to seat your customers.  Then, when they are ready to order, you will take their orders and then serve them their food.  When they are done, you can collect their money and clean up their table.  Sometimes, there will be other things to do as well, such as serving drinks or desserts or cleaning up spills.<br><br>There are some notable differences in this game from the previous games in the series.  Some of those differences include sometimes having 2 babies at a table having &quot;love birds&quot; as a customer type.  Also, you are not working at regular restaurants... you're on vacation.  Instead of restaurants, you will serve customers in different locations, such as on a cruise ship or a train.  Sometimes, you will even have to serve customers in the dark, with only a flashlight to guide you.<br><br>During the game, you will unlock new clothing and you will be able to dress Flo up in a variety of different shirts, pants/shorts/skirts, shoes, hats/sunglasses, and aprons.  You can also upgrade each restaurant.  However, unlike in previous games in the series, you can upgrade any part you want to instead of having to only upgrade items in a specific order.  You only have a single upgrade option for each item, though... no choosing different colors or designs.",
  "publishedBy": "Zoo Publishing, Inc.",
  "developedBy": "PlayFirst, Inc.",
  "released": "Oct 27, 2009",
  "alsoFor": "BlackBerry, BREW, J2ME, Macintosh, Windows | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/diner-dash-flo-on-the-go",
  "visual": "Isometric",
  "gamePlay": "Arcade, Time management",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Zoo Publishing, Inc.",
          "developer": "PlayFirst, Inc.",
          "ported": "Empty Clip Studios, LLC",
          "country": " United States",
          "releaseDate": "Oct 27, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}