{
  "name": "DiRT 2",
  "shortName": "dirt-2__",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/dirt-2__/adblurbs\">Ad Blurbs</a>)</h3><p style=\"margin-top: 0\">\n      DiRT 2 is set to take off-road racing games on DS to a new level.\n    </p><br><br><p style=\"margin-top: 0\">\n      DiRT 2 features exciting action-sports attitude and takes players on a \n      stunning World Tour. Influenced by the big-event atmosphere rally is \n      showcased in at events like the X-Games, this global tour takes players \n      to some of the most diverse and exotic real-world locations and offers a \n      sensational line up of officially licensed rally and off-road vehicles.\n    </p>\n    <p style=\"margin-top: 0\">\n      Designed from the ground up exclusively for DS, DiRT 2 is tuned for \n      portable play including a career mode, arcade mode and a range of \n      quick-fire challenges. DiRT 2 also comes equipped with the latest \n      evolution of the most powerful track editor on a handheld game system. \n      Now for the first time in 3-D, players can create and share their own \n      unique races. With 4 player head-to-head racing supported over local \n      wireless connection, compete and create with DiRT 2 on DS.\n    </p>\n    <p>\n      <b>Features</b>\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      <b>•</b> The pinnacle of portable off-road racing, DiRT 2 bring \n      mixes a contemporary action-sports live sports event vibe with sublime \n      handling across a killer range of vehicles including the Subaru Impreza \n      WRX STI, Nissan 350z, Hummer H3, Mitsubishi Evo and Kincaid Ford F150.<b>•</b> \n      The most powerful track editor in portable gaming returns as players \n      unleash their creativity with the powerful 3-D race designer. Create \n      circuits or, for the first time in the Create and Race series, \n      point-to-point races and enjoy near-limitless design options. Using the \n      DS stylus, players can use the simple Free-Draw tool to create a track \n      in minutes yet the editor offers enough depth for players to create \n      masterpieces, then share and play them with their friends.<b>•</b> \n      Perfect for portable play, DiRT 2’s rewarding career mode offers both \n      circuit and point to point racing, and is complimented by an arcade mode \n      for quick-fire race thrills and a challenge mode featuring 20 events, \n      where players are rewarded for performing jumps, power sliding and high \n      speed runs.<b>•</b> Get DiRTY in multiplayer with full \n      wheel-to-wheel support - four players can compete against each other in \n      6 vehicle, 5 event championships multiplayer over local wireless \n      multi-card connection. Using wireless single card play, two to four \n      players can race each other in 3 event challenges with just one edition \n      of the game<b>• </b>Express yourself with DiRT 2’s extensive \n      livery editor enabling players to customise their vehicles by drawing \n      icons and unlocking different stamps and stickers to show off their \n      style!\n    </p>",
  "publishedBy": "Codemasters Software Company Limited, The",
  "developedBy": "Firebrand Games and Entertainment Ltd.",
  "released": "Sep 08, 2009",
  "alsoFor": "",
  "genre": "Racing / driving",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/dirt-2__",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Codemasters Software Company Limited, The",
          "developer": "Firebrand Games and Entertainment Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 08, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}