{
  "name": "Disney•Pixar Cars 2",
  "shortName": "disneypixar-cars-2__",
  "description": "<i>Disney•Pixar Cars 2</i> is a racing game that follows the story of the movie its based on.<br><br>The single-player game features two different portions of gameplay. The first lets players race as Lightning McQueen as he travels the world to compete in the World Grand Prix. The type of races vary from a one-on-one race with a car representing the country Lightning is racing in or Lightning's rival  Francesco, a knockout race against three other cars, and finally the World Grand Prix race for the country Lightning is in.<br><br>The second portion features stealth missions with Mater. Mater has the spy abilities of sneaking which lets him become invisible, a Repellor to stun, and a Retractor to grab. In these missions he has to sneak by lights of enemy cars and helicopters.Mater also has some light hearted mission where for example he goes around collecting ice cream.<br><br>The game also has a pure racing Grand Prix mode and another mode called CHROME, where players can replay levels with the characters they unlocked during the game.\n",
  "publishedBy": "Disney Interactive Studios, Inc.",
  "developedBy": "Firebrand Games and Entertainment Ltd.",
  "released": "Jun 21, 2011",
  "alsoFor": "Nintendo 3DS | Combined View",
  "genre": "Racing / driving",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/disneypixar-cars-2__",
  "visual": "",
  "gamePlay": "Stealth",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Disney Interactive Studios, Inc.",
          "developer": "Firebrand Games and Entertainment Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jun 21, 2011",
          "ean13": "",
          "comments": "Free Movie Ticket release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}