{
  "name": "Disney Planes",
  "shortName": "disney-planes_",
  "description": "<i>Disney Planes</i> is based on the 2013 animated movie of the same name. This handheld version has gameplay similar to the <a href=\"https://www.mobygames.com/search/quick?game=Disney+Planes\">PC / Wii (U)</a> release, but is not identical. Players get to experience the game world using six characters and six environments (four less for each compared to the other version), but it does have full voice acting. Each character has different statistics based on boost, power, speed and technique. The game contains four game modes, but not the multiplayer portion of the other release. The included game modes are: Balloon, Challenge, Race and Story.<br><br>In the Balloon mode the plane needs to pop all balloons before time runs out. Challenge has the player complete objectives such as washing off dirt from buildings, soaking opponents using a water blaster or performing in a stunt show. Race mode is about completing courses in a fast time, usually by flying through rings. Story is based on the movie's story with activities based on those of the other game modes including story sequences.",
  "publishedBy": "Disney Interactive Studios, Inc.",
  "developedBy": "Tose Co., Ltd.",
  "released": "Aug 06, 2013",
  "alsoFor": "Nintendo 3DS | Combined View",
  "genre": "Racing / driving",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/disney-planes_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Disney Interactive Studios, Inc.",
          "developer": "Tose Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Aug 06, 2013",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}