{
  "name": "Disney•Pixar Cars: Race-O-Rama",
  "shortName": "disneypixar-cars-race-o-rama_",
  "description": "<i>Cars: Race-O-Rama</i> is a racing game set in the Disney/Pixar Cars universe. It is the third entry in a series of <a href=\"https://www.mobygames.com/search/quick?game=Cars+licensees\">THQ licensed games</a>. The game includes a single-player story mode and an arcade mode. <br><br>Lightning McQueen helps out Doc Hudson when he opens up a racing academy in Radiator Springs in order to prepare his students for the Race-O-Rama competition. Lightning McQueen also discovers that Chick Hicks has also opened a racing academy where he teaches his students to not race honorably when they crash two of Doc Hudson's students during the intro race. Now Lightning McQueen must race against Chick Hicks and his students to keep the Race-O-Rama competition honorable.<br><br>In story mode, the player progresses through a series of races competing against the chick hicks student racers, up to 4 cars would race around a circuit. At the end of a series of tracks the player would face off against one of the 4 leading character cars in a one on one race. In arcade mode the player is able to freely choose tracks and characters they have unlocked while playing through story mode. A special mini game section is also available to the player after completing the single player story mode. These games are based on the short animations known as &quot;Mater's tall tales&quot;. The challenges involved racing down a sewer pipe avoiding ninjas and pipes, and rocketing down a ramp then trying to land on a target.<br><br>The game also has a multiplayer mode, where 4 players can compete using an ad-hoc connection on all unlocked tracks. On the DS version a single cart multiplayer track is also available.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Tantalus Media Pty Ltd.",
  "released": "Oct 12, 2009",
  "alsoFor": "PSP | Combined View",
  "genre": "Racing / driving",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/disneypixar-cars-race-o-rama_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Tantalus Media Pty Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 12, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/503372-disney-pixar-cars-race-o-rama-nintendo-ds-screenshot-title.png",
      "caption": "Title screen."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/647352-disney-pixar-cars-race-o-rama-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United States",
      "platforms": "Nintendo DS"
    }
  ]
}