{
  "name": "Disney Violetta: Rhythm &amp; Music",
  "shortName": "disney-violetta-rhythm-music",
  "description": "<i>Disney Violetta: Rhythm &amp; Music</i> is a rhythm and trivia game based on the Argentine telenovela that ran for three seasons between 2012 and 2015. It tells the story of the teenager Violetta who returns with her father Germán from Europe to her hometown Buenos Aires in Argentine. Violetta has musical talent and episodes focus a lot on Latin and pop music as she enrols in Studio 21 to become a star. While there are some differences between the versions for the three platforms, the basic concept is identical.<br><br>Players get to play three types of rhythm games with songs from the show as the soundtrack in a career mode or through quick play sessions. One of the games is played on a staff where the player moves a microphone icon using the wiimote or the stylus to catch notes, stars and full hearts, while avoiding broken hearts. In the Wii version full motion video from the show is running in the background while the DS version has 3D animated scenes. A score is kept and the lyrics to the song are shown so players can sing along.<br><br>In another game notes fall from the sky and the player needs to catch them along with butterflies, while avoiding hearts, before they reach the bottom of the screen.<br><br>The third game is a trivia game where the title of a song or the next line in the lyrics needs to be guessed based on an excerpt and with a timer counting down. A score is calculated based on the number of correct guesses, streaks and the remaining time.",
  "publishedBy": "Little Orbit, LLC",
  "developedBy": "Game Machine Studios",
  "released": "2014",
  "alsoFor": "Nintendo 3DS, Wii | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/disney-violetta-rhythm-music",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "Game show / trivia / quiz, Mini-games, Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Little Orbit, LLC",
          "developer": "Game Machine Studios",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2014",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1040425-disney-violetta-rhythm-music-nintendo-ds-screenshot-english.png",
      "caption": "English Title Screen"
    },
    {
      "link": "/images/shots/l/1040426-disney-violetta-rhythm-music-nintendo-ds-screenshot-main.png",
      "caption": "Main Menu"
    }
  ],
  "cover": []
}