{
  "name": "Disney•Pixar Brave",
  "shortName": "disneypixar-brave_",
  "description": "Based on the 2012 movie of the same name by Pixar, 'Brave' focuses on the Scottish princess Merida, who embarks on a quest to rescue her mother (Queen Elinor) after she was turned into a bear by a witch's curse. However, it is soon revealed to Merida that Mor'du (an evil demon-bear) is the one responsible for Elinor's curse, as well as corrupting many of the creatures of the Scottish woodlands. Now it's up to Merida to put an end to Mor'du once and for all and revert her mother back to her original human form.<br><br>The Nintendo DS version is significantly different from its home console cousins. The in-game cutscenes only consist of FMV sequences from the console versions and lack vocal dialogue, the brother triplets and Queen Elinor herself are unplayable, Merida can't double-jump and wall-jump, the Ring Of Stones in the home console versions is replaced with a world map and Merida collects orbs instead of coins. However, Merida can still attack enemies with her bow and arrow (from a far range), as well as her sword (in close range). Merida also has the ability to roll to evade oncoming enemy attacks.<br><br>Throughout the game, Merida discovers the power of 4 separate elements (Fire, Air, Ice and Earth) and the player must help her use each element correctly to solve certain puzzles along the way (even though the DS version's elements lack the powerful abilities present in the home console versions e.g. Earth allows plants to grow in order to progress). Later in the game, the player has the ability to see an elemental icon above the enemies, indicating that this element weakens them more easily. The elements can be changed at any time by tapping them on the Touch Screen.<br><br>The DS version still retains the puzzle-solving gameplay, in which the player must use the Nintendo DS stylus to solve several puzzles such as tapping the correct symbols in a certain order, as well as moving stones to their correct slots. Merida can also find several varieties of armour, bows and swords in numerous treasure chests that are added to the inventory, each of them allowing her to possess more fighting power. At the world map screen, the player can press X and select the preferred type of armour, sword and bow.<br><br>The orbs found within the game can be used to upgrade a wide range of Merida's abilities, such as allowing her to fire 3 arrows at once, increasing sword power and even enhancing her health bar. The abilities menu is accessible by pressing Y at the world map screen at any time. <br><br>The in-game narration is supplied by Kelly Macdonald (voice of Merida in the movie), and Gavin Hammon (who voices the Tutorial sections of the game).<br><br><br><br>",
  "publishedBy": "Disney Interactive Studios, Inc.",
  "developedBy": "Behaviour Interactive, Inc.",
  "released": "Jun 19, 2012",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/disneypixar-brave_",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Disney Interactive Studios, Inc.",
          "developer": "Behaviour Interactive, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jun 19, 2012",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/353234-disney-pixar-brave-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353235-disney-pixar-brave-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353239-disney-pixar-brave-nintendo-ds-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353238-disney-pixar-brave-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353236-disney-pixar-brave-nintendo-ds-manual.jpg",
      "scanOf": "Manual",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353237-disney-pixar-brave-nintendo-ds-manual.jpg",
      "scanOf": "Manual",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    }
  ]
}