{
  "name": "Dr. Seuss How the Grinch Stole Christmas!",
  "shortName": "dr-seuss-how-the-grinch-stole-christmas",
  "description": "The Whos in Whoville are fond of Christmas, but up on Mount Crumpit lives the green Grinch who despises the Whos and their festivities. He decides to steal their Christmas and all their presents using a santa suit as a disguise. Players take control of the grouchy old Grinch to accomplish this evil task.<br><br>Based on the 2000 <i>How the Grinch Stole Christmas</i> movie, this game offers classic platform-based gameplay. To steal Christmas, the Grinch needs to steal a numbers of presents from the different houses. There are three difficulty levels that influence the amount of presents that need to be stolen before time is up. The Grinch can collect presents as well as small decorations used to unlock secrets. All of this is accomplished through sneaky tactics. The Grinch needs to stay unnoticed using doors, stairways, nooks, fireplaces and chimneys to avoid contact with the inhabitants.<br><br>There are different kinds of Whos (Sleeping Who, Cindy Lou Who, Sleepwalking Who, Sentry Who) with their own habits. When the Grinch is detected, a mini-game is started (except for the Sentry Who). Completing it successfully allows the player to continue. The games are:<ul>\n<li><i>Snoozin' Whos (Sleeping Who)</i>: use the stylus to touch all falling footprints.</li><br>\n<li><i>Back to Bed! (Cindy Lou Who)</i>: use the stylus to touch all small Who girls and boys that walk toward the Grinch from the top of the screen.</li><br>\n<li><i>Sleepy Walking (Sleepwalking Who)</i>: move the Grinch around the room without touching the bouncing Sleepwalking Whos.</li></ul>",
  "publishedBy": "Destination Software, Inc.",
  "developedBy": "Black Lantern Studios, Inc.",
  "released": "Nov 01, 2007",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/dr-seuss-how-the-grinch-stole-christmas",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Stealth",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Destination Software, Inc.",
          "developer": "Black Lantern Studios, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 01, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/164658-dr-seuss-how-the-grinch-stole-christmas-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "United States , Canada  and Mexico",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/164659-dr-seuss-how-the-grinch-stole-christmas-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "United States , Canada  and Mexico",
      "platforms": "Nintendo DS"
    }
  ]
}