{
  "name": "DreamWorks Rise of the Guardians",
  "shortName": "dreamworks-rise-of-the-guardians_",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/dreamworks-rise-of-the-guardians_/adblurbs\">Ad Blurbs</a>)</h3><p style=\"margin-top: 0\">\n      Let your imagination soar in Rise of the Guardians: The Video Game as \n      you play as one of the classic childhood legends, including: North (aka \n      Santa Claus), Tooth (aka the Tooth Fairy), Bunnymund (aka the Easter \n      Bunny), Sandman, and Jack Frost.\n    </p><br><br><p style=\"margin-top: 0\">\n      In this action-packed adventure game, each Guardian has their own set of \n      upgradable and extraordinary abilities that will help you take on the \n      evil spirit “Pitch” and his infectious nightmares. Along the way, you’ll \n      unlock new powers and spellbinding special moves that will increase your \n      character’s strength and skills throughout the game, plus you can \n      unleash cool team attacks with your fellow heroes. Work together with \n      your team of Guardians to protect the hopes and imaginations of children \n      all over the world!\n    </p>\n    <p>\n      <b>Features</b>\n    </p>\n    <p style=\"padding-left: 25.0px; margin-top: 0\">\n      • Join Forces with Your Favorite Characters From the Film – Play as one \n      of the classic childhood legends from DreamWorks Animation’s upcoming \n      feature film, Rise of the Guardians, including: North, Tooth, Bunnymund, \n      Sandman, and Jack Frost.• Battle Pitch in an Epic Adventure – Take \n      on Pitch and his evil nightmares in a deep and intuitive adventure \n      combat game that includes new original enemies designed specifically for \n      each Guardian’s realm.• Unique Abilities and Upgrades – Unlock \n      power-ups such as weapon upgrades for your character. Plus, earn unique \n      new abilities including special combat moves like a snowball attack, \n      summoning a swarm of miniature tooth fairies, and more!• Explore \n      Legendary Guardian Realms – Experience the imaginative worlds from Rise \n      of the Guardians, including; Tooth’s Palace, North’s Workshop, \n      Bunnymund’s Warren, and many more.\n    </p>",
  "publishedBy": "D3Publisher of America, Inc.",
  "developedBy": "Torus Games Pty. Ltd.",
  "released": "Nov 20, 2012",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/dreamworks-rise-of-the-guardians_",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "D3Publisher of America, Inc.",
          "developer": "Torus Games Pty. Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 20, 2012",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}