{
  "name": "Dream Chronicles",
  "shortName": "dream-chronicles",
  "description": "<i>Dream Chronicles</i> is an unusual casual puzzle/adventure game that assigns the player the role of Faye, a young woman, whose husband, Fidget, has been whisked away via magical means by Lilith, a mysterious fairy. To ensure that Faye's husband stays with her, Lilith has put an entire kingdom to sleep. Somehow, Faye wasn't affected, and now, it is her purpose to rescue her husband and to save the kingdom in process.<br><br>The game comprises 18 chapters (screens), in each location a specific set of puzzles should be solved and a number of jewels located, by playing a <a href=\"https://www.mobygames.com/game-group/hidden-object-games\">Hidden Objects</a> type of game. Those jewels do not assist in solving puzzles, but instead help to unravel the mysteries surrounding the story and increase the player's final score. Player can take his time  while solving the puzzles, however, his final score will be affected if it takes too long.<br><br>The puzzles presented by the game vary from classical inventory-based puzzles to mathematic and logic puzzles reminiscent of <a href=\"https://www.mobygames.com/search/quick?quickSearch=Myst\">Myst</a>. Another resemblance Dream Chronicles shares with Myst is its presentation, which is the same pre-rendered 3D stills viewed from the first person perspective.<br><br>However, due to its casual nature the game incorporated a number of limitations to the formula of classic adventure. All of the game puzzles must be solved within the limits of one screen and player is not allowed to move any further, before solving the puzzles for a present chapter. Previously completed chapters cannot be revisited either, and all the jewels left in them are gone for good.<br><br><i>Dream Chronicles</i> boasts a fairy-tale approach to its artwork and music, trying to create an interesting and gripping story through the series of visions, diary entries and various comments on the events by the game's protagonist.",
  "publishedBy": "Zoo Publishing, Inc.",
  "developedBy": "Katana Games S.L.",
  "released": "Mar 09, 2010",
  "alsoFor": "BREW, iPhone, Macintosh, PlayStation 3, Windows, Xbox 360 | Combined View",
  "genre": "Puzzle",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/dream-chronicles",
  "visual": "",
  "gamePlay": "Hidden object",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Zoo Publishing, Inc.",
          "developer": "Katana Games S.L.",
          "ported": "Empty Clip Studios, LLC",
          "country": " United States",
          "releaseDate": "Mar 09, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}