{
  "name": "Eijukugo Target 1000 DS",
  "shortName": "eijukugo-target-1000-ds",
  "description": "<i>Eijukugo Target 1000 DS</i> is an educational English language learning game based on the <i>Eitango Target</i> series of books by Obunsha. These books teach a common common set of English words in order to help students pass entrance examinations. This game, specifically, is based on the <i>Eijukugo Target 1000</i> book which teaches 1000 common English phrases. The core gameplay centres around virtual flashcards: players are given an English phrase, in both spoken and text form, and must select the correct Japanese phrase that matches it. There are three different modes, each of which features a slightly distinct slant on the core gameplay.\n<ul>\n    <li>Real Test: Players select a group of words and then run through a set of tests for words within that group.</li>\n    <li>Training: Players select a group of words from the &quot;standard&quot;, &quot;advanced&quot;, or &quot;professional&quot; set and run through a set of practice problems. Players are able to retry problems at their leasure, and successful answers are tracked persistently. In addition to the standard flash cards, players can also try a mode where they need to spell out phrases using the DS's touch screen after hearing them spoken.</li>\n    <li>My Challenge: A mini-game that incorporates the flashcard minigames. Players are taken into the cockpit of a spaceship where their goal is to shoot down enemy ships. Their weapon? English. Players need to spell out phrases that have been spoken out loud quickly enough to take down enemies, but if they're too slow enemies will get a shot in instead. Play continues until either the player takes out all the enemies or the player runs out of health.</li>\n</ul>\nTo encourage players to keep studying daily, playing the Training mode at least a bit during a day gives the player a little plant representing their progress. The in-game calendar tracks the players' progress every day, and as their virtual garden grows they get a visual representation of how far they've come.",
  "publishedBy": "IE Institute Co., Ltd.",
  "developedBy": "Degikan",
  "released": "Aug 09, 2007",
  "alsoFor": "",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/eijukugo-target-1000-ds",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "IE Institute Co., Ltd.",
          "developer": "Degikan",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 09, 2007",
          "ean13": "4 582107 391466",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1040840-eijukugo-target-1000-ds-nintendo-ds-screenshot-title-screen.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}