{
  "name": "Facening de Hy?j? Yutaka ni Insh? Up: Otona no DS Kao Training",
  "shortName": "facening-de-hyj-yutaka-ni-insh-up-otona-no-ds-kao-training",
  "description": "<i>Otona no DS Kao Training</i>, or Adult Face Training DS if it were translated to English, is a touch-generations brand game released only in Japan. The software was developed under the consultation of Japanese beauty expert Fumiko Inudo. The game includes a peripheral camera attached to a GBA cartridge which runs alongside the DS game. The training software instructs the user on how to perform several facial exercises that have a goal of keeping your face healthy looking and wrinkle free. The exercises range from opening your eyes wide to tilting and turning your face to the left or right. The training program will tell you to perform a move and hold it for a count of five, and slowly relax. While you perform the exercises, the peripheral camera tracks your facial expressions and critiques your techniques by taking several snapshots and adding visual cues to illustrate how the motions can be improved. <br><br>Similar to Brain-Age, and other Touch Generation titles, the Otona no DS Kao Training is meant for daily use but in short durations. <br><br>",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Intelligent Systems Co., Ltd., Nintendo SPD",
  "released": "Aug 02, 2007",
  "alsoFor": "",
  "genre": "Educational, Simulation",
  "perspective": "1st-person, 3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/facening-de-hyj-yutaka-ni-insh-up-otona-no-ds-kao-training",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Intelligent Systems Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 02, 2007",
          "ean13": "4 902370 516098",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}