{
  "name": "Fire Emblem: Shin Monsh? no Nazo - Hikari to Kage no Eiy?",
  "shortName": "fire-emblem-shin-monsh-no-nazo-hikari-to-kage-no-eiy",
  "description": "This is both a remake of the <a href=\"https://www.mobygames.com/game/fire-emblem-monsh-no-nazo\">third Fire Emblem</a> game originally for SNES and a continuation of an earlier DS title <i><a href=\"https://www.mobygames.com/game/fire-emblem-shadow-dragon\">Shadow Dragon</a></i>.  Graphically and gameplay-wise <i>Fire Emblem: New Mystery of the Emblem</i> is almost unchanged, though there are some new features. <br><br>First of all, you can choose a less hardcore mode that would disable permanent death of the characters - a feature that was with Fire Emblem from the start. After a certain amount of time that cartridge stays in the slot, characters would be able to &quot;rest&quot; between the battles, randomly recieving boons to stats, experience or finding unique items and weapons. There's also one one multiplayer mode with a separate set of cards where players need to capture and hold a castle. It's also possible to trade units wirelessly. And last but not least there are some additional missions that explain parts of the story that weren't shown during the campaign called Archanean Chronicles. Those were remade from a Satellaview Fire Emblem game, episodically distributed via satellite SNES addon.<br><br>And another feature is that you can create your own avatar, or rather select it from a range of classes and name it. This character would also become a part of story. At the beginning you come to the palace grounds to compete for the right to be a part of royal knight force for prince Marth, who's now a war hero. A year has passed since he and the other heroes vanquished the baleful sorcerer Gharnef that tried to unleash the dragons back into the human world while also getting different countries at war with each other. At your graduation ceremony you witness an assassination attempt on your liege that starts a chain of events that again leads you on a long-winded war campaign. In you travels (and battles) you'll meet the characters that were familiar and fought at your side in the previous game, but now many of them are again at the opposing side.",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Intelligent Systems Co., Ltd.",
  "released": "Jul 15, 2010",
  "alsoFor": "",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/fire-emblem-shin-monsh-no-nazo-hikari-to-kage-no-eiy",
  "visual": "",
  "gamePlay": "Tactical RPG",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Intelligent Systems Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 15, 2010",
          "ean13": "4 902370 518269",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1044214-fire-emblem-shin-monsho-no-nazo-hikari-to-kage-no-eiyu-nintendo.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}