{
  "name": "Fix It: Home Improvement Challenge",
  "shortName": "fix-it-home-improvement-challenge",
  "description": "'Fix It' is a mini-game compilation game in which players must help two handymen (Stonewall and Brick) to help out several customers throughout a large city by playing separate minigames including hammering, sawing, mixing paint, cutting glass and much more.<br><br>In the story, Brick's niece Andrea is arriving in the city to help him and his tough but friendly associate Stonewall in their DIY business, 'The Workshop' (also seen on the outside as 'S&amp;B'). When she sees that the business is about to go bankrupt, she uses the 'feminine touch' and gives the small office a complete makeover! To help the duo get their business going, Andrea then makes out a list of clients throughout the city that could use their help...<br><br>The Nintendo DS stylus plays an important role of the gameplay, as it is needed for all the numerous DIY minigames to encounter. Examples include tapping nails repeatedly using a hammer, rubbing the stylus left and right to work a saw and even tracing shapes to cut through several materials (namely glass). For each of Andrea's clients, an invoice (a list of tasks to carry out to accomplish their job needs) is shown on the Touch Screen and players can play each several task by tapping it within the invoice. Each task is then made up of several of the aforementioned DIY minigames.<br><br>For each task completed, the player is awarded a medal (in the form of a nut fastener). Depending on the time taken for each task, the medals come in either gold (if each minigame is completed as fast as possible), silver or bronze (if the minigames are not completed quick enough). Players are welcome to replay the tasks as many times as they want once after completing them. If the player manages to collect all gold medals for each client's tasks, a trophy is then unlocked within the Workshop in the City menu screen to view at any time.<br><br>Throughout the game, there's also 3 separate boss battles against rival handymen, in which the player must also carry out several minigames to accomplish the task successfully.<br><br>On the main menu, there's also a separate 'Odd Job' screen that allows players to try out all the DIY minigames and earn medals on each, as well as getting a fair idea on what to expect in the upcoming tasks in the main story.<br><br><br><br><br><br>",
  "publishedBy": "Nobilis France",
  "developedBy": "Freedom Factory Studios",
  "released": "May 21, 2010",
  "alsoFor": "Windows | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/fix-it-home-improvement-challenge",
  "visual": "",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nobilis France",
          "developer": "Freedom Factory Studios",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "May 21, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/353205-fix-it-home-improvement-challenge-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353206-fix-it-home-improvement-challenge-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353210-fix-it-home-improvement-challenge-nintendo-ds-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353209-fix-it-home-improvement-challenge-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353207-fix-it-home-improvement-challenge-nintendo-ds-manual.jpg",
      "scanOf": "Manual",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/353208-fix-it-home-improvement-challenge-nintendo-ds-manual.jpg",
      "scanOf": "Manual",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    }
  ]
}