{
  "name": "Fullmetal Alchemist: Trading Card Game",
  "shortName": "fullmetal-alchemist-trading-card-game",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/fullmetal-alchemist-trading-card-game/adblurbs\">Ad Blurbs</a>)</h3><p style=\"margin-top: 0\">\n      Behold! The TCG has been transmuted to the DS!\n    </p><br><br><p style=\"margin-top: 0\">\n      A painstakingly accurate translation of the popular Fullmetal Alchemist \n      trading card series by Press Pass, Inc (formerly JoyRide Entertainment), \n      the Fullmetal Alchemist Trading Card game brings the collectible \n      strategy game to the Nintendo DS with nearly 500 cards, a variety of \n      play modes and extensive touch screen support.\n    </p>\n    <p style=\"margin-top: 0\">\n      Featuring the most popular characters from one of the top-rated anime \n      programs on Adult Swim, the Fullmetal Alchemist Trading Card Game allows \n      you to battle against both AI-controlled opponents and friends via the \n      Nintendo Wi-Fi Connection.\n    </p>\n    <p style=\"margin-top: 0\">\n      With every card from the Premier Edition trading card set and the \n      complete Blood &amp; Water expansion, the Nintendo DS version of the \n      Fullmetal Alchemist Trading Card Game has everything that both trading \n      card fans and Fullmetal Alchemist aficionados could want, including:\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      • Multiple modes, including Tutorial, Single match, Character mode, \n      Fantasy mode, and Multiplayer via the Nintendo Wi-Fi Connection\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      • The complete rule set from the Press Pass Fullmetal Alchemist trading \n      card game\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      • Unlockable characters like Edward Elric, Roy Mustang, Father Cornello \n      and Lust, complete with voiceovers from the original cast\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      • Extensive Touch Screen support: Shuffle and move cards with the DS \n      stylus. You can even tear open booster packs!\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      • Build and save your own custom decks\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      • Sounds, music and voices from the Fullmetal Alchemist series on Adult \n      Swim\n    </p>\n    <p style=\"margin-top: 0\">\n      Fullmetal Alchemist Trading Card Game has a simple goal: Beat your \n      opponent to the Philospher’s Stone. How you do that is by marching \n      slowly through a complex but gorgeous trading card game converted for \n      play on the Nintendo DS. Both extremely deep and extremely challenging, \n      this game is definitely not for the casual fan.\n    </p>\n    <p style=\"margin-top: 0\">\n      Those who are familiar with the trading card game will feel very much at \n      home on this DS game. The gilt-edged graphics evoke the atmosphere of \n      the Fullmetal Alchemist world very well. The card game itself definitely \n      makes you feel as though you’re on the quest for the stone with the \n      Elric brothers.\n    </p>\n    <p style=\"margin-top: 0\">\n      If you like Fullmetal Alchemist but aren’t familiar with the trading \n      card game you’re in for a demanding learning process that's no doubt as \n      difficult as learning how to become an alchemist would be in real life! \n      Your goal: Be the first to find nine clues that lead to the \n      Philosopher’s Stone.\n    </p>\n    <p style=\"margin-top: 0\">\n      Get clues by winning locations, which are randomly drawn cards with \n      varying victory conditions, effects, and amount of clue points. \n      Depending on which location is drawn, your hand could have a distinct \n      advantage or disadvantage. Win locations by attacking your opponent with \n      your leader and additional characters you recruit. Also, you can \n      “attach” special equipment and abilities to your characters for a \n      bewildering array of deck-building strategies.\n    </p>\n    <p style=\"margin-top: 0\">\n      The exhaustive support includes pages upon pages of online instructions, \n      a step-by-step tutorial, and even a hint system when you’re playing \n      actual matches. But all of this just blunts the effect of having to play \n      a game with seemingly endless phases and subphases that often feel \n      redundant.\n    </p>\n    <p style=\"margin-top: 0\">\n      The mechanics of card viewing and playing and viewing your opponent’s \n      table takes a lot of getting used to. Each card is represented with a \n      tiny unreadable picture of itself. Loading a card's details takes longer \n      than it should.\n    </p>\n    <p style=\"margin-top: 0\">\n      Once you learn how to play, you can join opponents online and play \n      fantasy matches in which you have access to every card in the game. No \n      doubt this is the easiest way to experience the game at its fullest \n      since you don’t have to collect any cards on your own to play them in \n      this mode.\n    </p>\n    <p style=\"margin-top: 0\">\n      Bottom line\n    </p>\n    <p style=\"margin-top: 0\">\n      If you already enjoy the trading card game, then you’ll love this game. \n      If not, then prepare yourself for a steep learning curve or -- better \n      yet -- get a buddy to show you the ropes. The reward for learning how to \n      play the game is an enormously engrossing trading-card game experience \n      that’s steeped in Fullmetal Alchemist goodness.\n    </p>\n    <p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p>\n    <p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit <a href=\"https://support.nintendo.com/servicesupdate\">support.nintendo.com/servicesupdate</a>.\n    </p>",
  "publishedBy": "Destineer",
  "developedBy": "Magellan Interactive, Inc.",
  "released": "Oct 16, 2007",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/fullmetal-alchemist-trading-card-game",
  "visual": "",
  "gamePlay": "Trading / collectible card",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Destineer",
          "developer": "Magellan Interactive, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 16, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}