{
  "name": "Germany's Next Topmodel: Das offizielle Spiel zur Staffel 2009",
  "shortName": "germanys-next-topmodel-das-offizielle-spiel-zur-staffel-2009",
  "description": "<i>Germany's Next Topmodel: Das offizielle Spiel zur Staffel 2009</i> is based on the German reality show <i>Germany's Next Topmodel</i>. The player takes control over one of twelve contestants which all live in a free accessible apartment. Every twenty days they are judged by a jury and the worst one gets eliminated from the show. The judgment is based on three character stats: styling, self confidence and popularity. <br><br>Popularity gets improved by talking with the other contestants. Here the player has to choose between three sentences, two mean and a nice one. Of course just the nice one improves the stat. The styling is divided into clothes, make up and hairstyle. In each one the player receives a reference and needs to shape his model after it. Then this gets judged by the game and it tells one false aspect. Every try costs one day. The last stat, self confidence, gets raised by answering trivia questions about fashion styles and successful photo shoots. These are mini games where the player needs to emulate movements with his input device.",
  "publishedBy": "SevenOne Intermedia GmbH",
  "developedBy": "Coreplay GmbH",
  "released": "2009",
  "alsoFor": "PlayStation 2, Wii, Windows | Combined View",
  "genre": "Simulation",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/germanys-next-topmodel-das-offizielle-spiel-zur-staffel-2009",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "SevenOne Intermedia GmbH",
          "developer": "Coreplay GmbH",
          "ported": "",
          "country": " Germany",
          "releaseDate": "2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}