{
  "name": "Grease: The Official Video Game",
  "shortName": "grease-the-official-video-game",
  "description": "<h3>www.nintendo.co.uk (from <a href=\"https://www.mobygames.com/game/grease-the-official-video-game/adblurbs\">Ad Blurbs</a>)</h3>The original High School Musical, the story that spawned a million fancy dress parties and captured the hearts of fans worldwide now has an official game for the Nintendo DS, so get your stylus hand ready because (just like rock 'n' roll) Grease is here to stay.<br><br>It's summer 1957: think drive-in movies, ice cream parlours, rock and roll queens with skirts a twirling and fast talking gum snapping teenage ne'er do wells sleeping in rollers. Danny and Sandy meet over the holidays and fall head over heels in love, but their summer dreams are ripped at the seams when they part at summer's end and are forced to go back to their normal lives, hundreds of miles away from each other. Back in the real world Danny's a good looking greaser who cares about cars, chicks and bravado while Sandy's a sweet, clean-cut cheerleader. When fate conspires to make Sandy the new girl in Danny's school sparks fly once more. Still as much in love as during those summer nights, the two must find a way around the cliques and expectations of their peers if they mean to be together; but that will be no easy task. Grease is a classic coming of age story of romance, compromise and figuring out what's really important in life.<br><br>Step into Rydell High, a place populated by T-Birds, Pink Ladies and beauty school dropouts, where there's no need for tears on your pillow if you can keep the beat. In this fast, energetic rhythm action game you can play as your favourite character from Grease and take part in dance offs at various iconic locations around Rydell High. As you play you can unlock new costumes for Danny and Sandy, learn the lyrics to tracks from the movie, or learn the actual choreography from the dance routines in Dance Steps. If you have a Nintendo DSi you can even take your own picture and put yourself into the game! You can play through memorable moments from the movie in chronological order in Storymode, jump into your favourite bits in Quickplay, or have a ball with a friend in Multiplayer.<br><br>Brought to the Nintendo DS by 505 Games, Grease is officially licensed from Paramount Digital Entertainment and features 10 classic compositions that fans will know and love from the movie musical of the same name.<br><br><ul>\n<li>Play solo or with a friend using Multi-Card Play or DS Download Play.</li><br>\n<li>Compete in dance off showdowns around Rydell High.</li><br>\n<li>Learn the lyrics and the dance steps to 10 beloved songs from Grease.</li></ul>",
  "publishedBy": "505 Games (U.S.), Inc.",
  "developedBy": "Big Head Games Ltd.",
  "released": "Aug 24, 2010",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/grease-the-official-video-game",
  "visual": "",
  "gamePlay": "Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "505 Games (U.S.), Inc.",
          "developer": "Big Head Games Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Aug 24, 2010",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "505 Games S.R.L.",
          "developer": "Big Head Games Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Aug 27, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}