{
  "name": "Grey's Anatomy: The Video Game",
  "shortName": "greys-anatomy-the-video-game",
  "description": "<i>Grey's Anatomy: The Video Game</i> is based on the TV series <i>Grey's Anatomy</i> and basically built up like the series itself. The story about a infectious virus which infests the Seattle Grace Hospital is divided into five episodes, the episodes are divided into acts and the acts are divided into scenes. Every scene focuses on one character and concludes with a mini game. <br><br>There are basically two kinds of scenes. During conversations the player sometimes has to choose between two choices how the characters interact with each other. Then a mini game follows, e.g. tearing apart a photograph, a sliding puzzle, a rhythm sequence or a tile-matching puzzle. The operations and treatments are also sequential  mini games, e.g. disinfecting by sliding the cursor over the screen, then cutting the skin by making a straight line and stitching it by connecting points.<br><br>The player has five tries per mini game, if he fails more often he has to restart the scene. Because of the technical limitations of the platform there are no voices or animated cutscenes on the DS.",
  "publishedBy": "Ubisoft Entertainment SA",
  "developedBy": "Longtail Studios",
  "released": "Mar 11, 2009",
  "alsoFor": "Wii, Windows | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "1st-person, 3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/greys-anatomy-the-video-game",
  "visual": "",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Ubisoft Entertainment SA",
          "developer": "Longtail Studios",
          "ported": "",
          "country": " United States",
          "releaseDate": "Mar 11, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/428145-grey-s-anatomy-the-video-game-nintendo-ds-screenshot-title.png",
      "caption": "Title screen with main menu."
    }
  ],
  "cover": []
}