{
  "name": "Heroes of Hellas 2: Olympia",
  "shortName": "heroes-of-hellas-2-olympia",
  "description": "Long ago, the Briarey, a multi-armed demon, rose up from Tartarus, stole the Rod of Discord and used it to cause fear and corruption across Hellas. The tiny realm of Olympia was spared, but it needs a ruler who can help it grow from a small settlement into a thriving metropolis. Only then will it be possible to defeat Briarey, recover the rod and restore peace.<br><br><i>Heroes of Hellas 2: Olympia</i> is the sequel to <a href=\"https://www.mobygames.com/game/heroes-of-hellas\">Heroes of Hellas</a>. Unlike the first game, increasing population through city building is the primary objective. Attract new settlers by using gold to buy food, buildings and fortifications. The people will rejoice and build a beautiful new palace with elements chosen by the player.<br><br>At its heart, this is a tile matching game in which at least three alike hex-shaped tiles must be selected and removed. It uses the same gameplay mechanic as the first game (click-hold-drag-release). When a chained grouping is removed, all upper tiles drop down and more tiles fall from the top to fill in the blanks. A gold coin appears at end of chains containing five or more tiles. These coins match to any other tile and be used to complete or lengthen a chained selection. Similarly, randomly appearing bombs, lightning rings, and hourglasses can be part of a group of other tiles.<br><br>Individual screens for puzzle objectives have been added as well as bonuses for reaching those goals quickly (hero, expert and master). Failed attempts can be restarted. Up to five puzzles can be skipped entirely. Special feats (for removing an unusually long chain of tiles, for instance) are rewarded with trophies and displayed in the trophy room.<br><br>New are the four level types. The first three are timed, while the last is not. They are:<ul>\n<li><i>Classic</i>: standard match and removal</li>\n<li><i>Locket</i>: Contains several sub-levels in which a piece of a locket must be collected. When the locket is complete, powers of one deity become available to help with future puzzle-solving. Optional mini-games (hidden object or jigsaw) for each god/goddess can be solved to earn gold and unlock desktop wallpapers.</li>\n<li><i>Treasure Hunter</i>: A quick-draw type level. Free as many treasure chests as possible in one minute.</li>\n<li><i>Puzzle</i>: Logic-based, untimed puzzle with only one correct solution</li></ul>\nCharge up a god's powers by removing tiles specific to him/her. In the former game a god's power could not be used until charged completely. In this sequel only a partial charging is required, but not as effective.<br><br><i>Heroes of Hellas 2: Olympia</i> features three difficulty levels (easy, normal and hard), dynamic visual effects, an original musical score and sound effects.",
  "publishedBy": "Purple Hills",
  "developedBy": "Jaibo Games",
  "released": "Jan 09, 2012",
  "alsoFor": "Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/heroes-of-hellas-2-olympia",
  "visual": "Fixed / flip-screen",
  "gamePlay": "City building / construction simulation, Falling block puzzle, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Purple Hills",
          "developer": "Jaibo Games",
          "ported": "CyberPlanet Interactive Public Co., Ltd.",
          "country": " Germany",
          "releaseDate": "Jan 09, 2012",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}