{
  "name": "I Spy: Universe",
  "shortName": "i-spy-universe",
  "description": "In the second I Spy DS game from Scholastic, players will take to the stars to find hidden items across six different zones with two search areas each. <br><br>The sun has gone out, but there are special items scattered around the universe that can construct a generator to bring it back to life. Travel to different colored zones for a hidden object game where rhymes tell you what you need to find, and to refill your fuel to travel to new ones, participate in brief minigames to unlock new areas with their own I Spy puzzles. Objects tend to be hidden in cluttered environments, the player sometimes asked to find multiple instances of an object, the largest version of one, or think more cleverly about what the terms in the read-out riddle that starts every level could mean.<br><br>Touch screen minigames involve things like matching objects to their shadows, ordering objects based on similarities, or rearranging a pipe maze to let a marble roll through it. All hidden object screens and minigames repeat over the course of the game, just with new items to find or changes to the minigame design to increase the game's difficulty.",
  "publishedBy": "Scholastic, Inc.",
  "developedBy": "Big Blue Bubble Inc.",
  "released": "Jun 15, 2010",
  "alsoFor": "",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/i-spy-universe",
  "visual": "",
  "gamePlay": "Hidden object, Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Scholastic, Inc.",
          "developer": "Big Blue Bubble Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jun 15, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}