{
  "name": "The [email protected]: Dearly Stars",
  "shortName": "idolmster-dearly-stars",
  "description": "<i>THE <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"6f062b2023222f3c3b2a3d\">[email&#160;protected]</a> Dearly Stars</i> is a game in <i>THE <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"670e23282b2a2734332235\">[email&#160;protected]</a></i> series, and the first in the 2nd Vision continuity. Unlike previous games, where the player assumes the role of a producer, they play as an actual idol. Instead of the usual 765 Production, the story takes place at 876 Production. There are three playable idols: Ai Hidaka, the daughter of a famous idol, Eri Mizutani, a former Internet celebrity, and Ryo Akizuki, a boy masquerading as a female idol and the cousin of 765 Production idol Ritsuko Akizuki.<br><br>In story mode, the player chooses one of the three idols. They play through the idol's day-to-day life in various scenarios. Activities the player can choose to do include lesson, including vocal lesson, dance lesson, and visual lesson, promotion, where an idol interacts with other people and obtains memories, audition, where an idol can raise their fan count, statistics and performance ranking, and day off, which skips to the next day. In stage mode, the player watches the idols perform. Costumes, choreography, and camera work can be customized and a cheering rhythm game can be played.<br><br>Multiplayer features include the aforementioned cheering game with up to 6 players. Scores of the game can be uploaded via Nintendo WFC. The game is also DSi enhanced, utilizing the Nintendo DSi's camera to read QR codes.",
  "publishedBy": "Namco Bandai Games Inc.",
  "developedBy": "Namco Bandai Games Inc.",
  "released": "Sep 17, 2009",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/idolmster-dearly-stars",
  "visual": "",
  "gamePlay": "Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Namco Bandai Games Inc.",
          "developer": "Namco Bandai Games Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 17, 2009",
          "ean13": "4 582224 497072",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/806846-the-idolm-ster-dearly-stars-nintendo-ds-screenshot-title-screen.png",
      "caption": "Title screen."
    }
  ],
  "cover": []
}