{
  "name": "Jane's Hotel",
  "shortName": "janes-hotel",
  "description": "In <i>Jane's Hotel</i> the player controls the protagonist as she operates a bed and breakfast, oddly enough though no one stays in the hotel past 12:00 AM. In the old country Jane's grandparents had run a successful hotel but events in Europe unwillingly delivered them to American shores. After an abnormally large loan for such an endeavor from the local bank; Jane reenters the family business. <br><br>The gameplay, reminiscent of <a href=\"https://www.mobygames.com/search/quick?game=Diner+Dash\">Diner Dash</a> focuses on providing a comfortable stay for your guests each of whom will stay for about a minute, 3-5 hours in game time. When a guest wants something you can click on that thing and bring it to them; for example, the gentleman in room four wants coffee, go to the coffee machine and deliver it to his room. You may stack a series of actions to cover the wants of many customers. In addition to Jane you will also command a maid who is in charge of cleaning and other low duties.<br><br>As the game progresses more tasks will become available for you to perform as your guests start lounging about the lobby such as turning on televisions, delivering fruit, water plants, and so on. Your hotel will also gain more rooms, until you can't see them all on screen at a single time. Your ability to keep up with the increased demands will affect how big your tips are. General things can also affect tip size, dead plants have a negative effect, while an aquarium will be positive.<br><br>Each level can be completed by gaining a certain amount of money  before the last guest leaves, at around midnight. Should you succeed you'll move a step closer to upgrading your hotel and be able to buy new amenities. <br><br><i>Jane's Hotel</i> is available in English and Russian.",
  "publishedBy": "Zoo Games, Inc.",
  "developedBy": "Realore Studios",
  "released": "Apr 27, 2010",
  "alsoFor": "Android, iPhone, Macintosh, PlayStation 3, PSP, PS Vita, Windows | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/janes-hotel",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Managerial / business simulation, Time management",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Zoo Games, Inc.",
          "developer": "Realore Studios",
          "ported": "",
          "country": " United States",
          "releaseDate": "Apr 27, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}