{
  "name": "Jeopardy!",
  "shortName": "jeopardy________",
  "description": "The 2010 version of venerable TV game show <i>Jeopardy!</i> brings <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,274868/\">Alex Trebek</a> and 2,400 new questions to Nintendo's two major platforms.  Both versions allow up to three players to compete in a full episode of the show, with computer-controlled contestants optionally filling in any empty seats.  Jeopardy, Double Jeopardy, and Final Jeopardy sections of the show are all recreated, with an authentic virtual recreation of the set, and stat tracking for profiles (including questions successfully answered, lifetime winnings, and more).<br><br>There are three levels of difficulty.  The easiest level provides four multiple-choice answer options for every question.  The medium and hard levels require the player to begin typing in their answer, but provides a list of auto-complete options in a corner window.  Medium difficulty starts suggesting at 3 letters, while hard won't suggest until 5 letters have been typed in.  Due to the auto-complete ability, perfect spelling is required much more in this version than previous console ports.<br><br>Players can input their answers with a virtual keyboard.  Optionally, players can use handwriting recognition on the Nintendo DS to write out their answers, or use the Wii Speak to speak their answers on the Wii version.  Mii support is included for the Wii, allowing players to attach their Mii to their game profile and see their character during the game.  As an alternative (and on the DS), players can select from Mii-esque pre-rendered characters.  Prizes in the form of additional costumes and accessories (to be used in-game) are awarded at various milestones.  Players can also turn on brief trivia minigames between rounds (in place of commercial breaks) where more outfits and game concept art can be won.<br><br><i>Jeopardy!</i> features the voices of announcer Johnny Gilbert, host Alex Trebek, and traveling &quot;Clue Crew&quot; member Kelly Miyahara.  Trebek and Miyahara also appear in the game in a stylized, big-head form similar to Miis.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Griptonite, Inc.",
  "released": "Nov 02, 2010",
  "alsoFor": "Wii | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/jeopardy________",
  "visual": "",
  "gamePlay": "Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Griptonite, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 02, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/649658-jeopardy-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United States",
      "platforms": "Nintendo DS"
    }
  ]
}