{
  "name": "Jewel Quest Mysteries: Trail of the Midnight Heart",
  "shortName": "jewel-quest-mysteries-trail-of-the-midnight-heart",
  "description": "After her adventures in Egypt, Eva Witheby receives a call from her uncle Donald asking for help in India. She travels to Southeast Asia arriving at the famous Bijapour, the &quot;Monkey City&quot;, on her 21st birthday, and starts to search for pieces of the missing jewel boards, the key to great treasures.<br><br><i>Jewel Quest Mysteries 2: Trail of the Midnight Heart</i>, like its <a href=\"https://www.mobygames.com/search/quick?game=Jewel+Quest+Mysteries%3a+Curse+of+the+Emerald+Tear\">predecessor</a>, is a hidden object game with tile-matching mini-games between each chapter. A new adventure element was added to the design, with the inclusion of an inventory in the interface. Most of the time, the objective is to find and click on all the items from a list at the left side of the screen within a time limit, on locations filled with assorted things scattered around the scenery. Some of the objects are stored inside the inventory to be used later, by dragging and dropping them over logical places on the screen to solve puzzles. The interface at the left side has three tabs for the jewel board pieces, the list and the inventory.<br><br>Besides the required items, each screen is decorated with lots of jewels that can be collected, to be used later as currency for upgrades. Each location also has three gold coins with lion heads, that when collected give an extra hint. Certain helpful items and upgrades can be purchased between chapters, like a dragonfly that helps to find the gold coins, an upgrade that makes the cursor glimmer when near one of the jewels, extra slots for hints, a freeze power-up that stops the chronometer for some minutes and golden background portions for the tile-matching game.<br><br>In some instances, the main character travels to another location initiating a quick separate game, where the location scenery is replaced by the view of a window on the moving vehicle or other mean of transportation. The goal is to click on a number of objects of the same type while the window scenery is scrolling, with the option of repeating the level at the end if the player was not able to find them all. At the end of each chapter the tile-matching game comes up, where the objective is to swap two adjacent tiles to make matches of three of the same kind and break the background, turning it into gold.",
  "publishedBy": "Media Sales &amp; Licensing",
  "developedBy": "3 Blokes Studios, iWin.com",
  "released": "2011",
  "alsoFor": "Windows | Combined View",
  "genre": "Adventure, Puzzle",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/jewel-quest-mysteries-trail-of-the-midnight-heart",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Falling block puzzle, Hidden object, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Media Sales &amp; Licensing",
          "developer": "3 Blokes Studios",
          "ported": "Engine Software B.V.",
          "country": " France, The Netherlands, United Kingdom",
          "releaseDate": "2011",
          "ean13": "8 716051 044208",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}