{
  "name": "Jewel Match",
  "shortName": "jewel-match_",
  "description": "This is the Nintendo DS release of the well-received match-3 game <a href=\"https://www.mobygames.com/game/windows/jewel-match\">Jewel Match</a> for Windows/Macintosh. Due to the limited screen size of the handheld, the grid size of the levels had to be cut down from 14x14 to 12x12 tiles, thus forcing a complete redesign of all the levels. While at it the developers added some DS-only gameplay options like the new magical storm where the player can blow into the microphone to reshuffle the jewels. <br><br>The basic idea of <i>Jewel Match</i> comes from <a href=\"https://www.mobygames.com/search/quick?game=Bejeweled\">Bejeweled</a> / <a id=\"de3e953875e508c6a3fee59a434a0ba4f\" href=\"https://www.mobygames.com/search/quick?game=Diamond+Mine\">Diamond Mine</a> - the player is presented with a grid of jewels. By swapping pairs of tiles which are next to each other, rows of three or more identical jewels can be formed that will disappear instantly, giving points to the player and making room for other gems falling from above to take their place. The levels have gaps and shaped areas, though, so pieces do not simply fall vertically but also can fall diagonally.<br><br><i>Jewel Match</i> has its own victory criterion though. On each of the 150 levels, a selection of squares have gold or even silver backings. One match (gold) or two (silver) must be created over each of these against a ticking clock to clear the level. Later in the game there are jewels tied to their square with a golden or silver chain, which thus are not falling down and blocking empty squares beneath them. These jewels can be freed by matching them once or twice, too, which means that the most difficult squares must be matched four times (silver chain and silver background) to be cleared.<br><br>A succession of hammers are unlocked once you have scored a certain amount of points. The first removes a particular jewel, the second not only removes the gem but also any effects (background or chains) on the square, and the final one removes all gems of that colour. Another extra to be unlocked is a magical storm that will have the player blow into the DS microphone to mix up the jewels. Moreover, matching more than three jewels in a row will create gems with special powers. Matching four will create a joker gem while matching five gives a gem that, once activated, will destroy the whole row it is in. <br><br>The game also offers a hot seat mode where two players can play the same level right after another, competing for the better clearing time.",
  "publishedBy": "Purple Hills",
  "developedBy": "Joindots GmbH",
  "released": "Apr 27, 2009",
  "alsoFor": "Nintendo DSi | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/jewel-match_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Falling block puzzle, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Purple Hills",
          "developer": "Joindots GmbH",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Apr 27, 2009",
          "ean13": "4 017404 015901",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/169677-jewel-match-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/169675-jewel-match-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/169676-jewel-match-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    }
  ]
}