{
  "name": "Joan Jade and the Gates of Xibalba",
  "shortName": "joan-jade-and-the-gates-of-xibalba",
  "description": "While archaeologist and adventurer Joan Jade was busy investigating some Mayan ruins, her children suddenly disappeared from the site. She asks for help from the local police, but decides to personally go look for the kids after the authorities take too long to assemble a search team. The clues on the excavation site point to a series of puzzles and ancient relics from the long lost civilization, leading her closer to the missing children.<br><br><i>Joan Jade and the Gates of Xibalba</i> is an adventure game with hidden object screens, where the main objective is to solve all the puzzles from one location to open a passage and move to the next one. As in most point-and-click games, the player has to collect objects from the scene, stored on the inventory always visible at the bottom, and use them on specific portions of the screen to perform an action or complete a task.<br><br>Separate screens for puzzles and hidden object challenges appear after clicking on certain hotspots. In the seek-and-find scenes, the goal is to search and click on all the objects listed at the bottom of the screen, on locations filled with assorted items like Mayan symbols and other paraphernalia. The hint button highlights the position of one of the required items, but takes a minute to recharge after use.<br><br>Some locations have mini-games, that usually give a necessary inventory tool after being solved. There are several types, where the player has to <a href=\"https://www.mobygames.com/game/pipe-dream\">assemble a pipeline</a> to oil a machine, move rectangular stone blocks in the limited space of a box to create an exit path for a key, replace orbs on a door in a memory challenge, find identical pairs of fish fossils, align the symbols of several rotating wheels, guide Joan through a maze by laying arrows pointing to the correct way, and complete other similar puzzles. These games can be optionally skipped after a few minutes.",
  "publishedBy": "S.A.D. Software Vertriebs- und Produktions GmbH",
  "developedBy": "Artifex Mundi sp. z o.o.",
  "released": "Nov 16, 2011",
  "alsoFor": "iPad, iPhone, Macintosh, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/joan-jade-and-the-gates-of-xibalba",
  "visual": "",
  "gamePlay": "Hidden object",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "S.A.D. Software Vertriebs- und Produktions GmbH",
          "developer": "Artifex Mundi sp. z o.o.",
          "ported": "CyberPlanet Interactive Public Co., Ltd.",
          "country": " Germany",
          "releaseDate": "Nov 16, 2011",
          "ean13": "4 017404 020417",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1026897-joan-jade-and-the-gates-of-xibalba-nintendo-ds-screenshot.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/1026898-joan-jade-and-the-gates-of-xibalba-nintendo-ds-screenshot.png",
      "caption": "Intro"
    },
    {
      "link": "/images/shots/l/1026899-joan-jade-and-the-gates-of-xibalba-nintendo-ds-screenshot.png",
      "caption": "Instructions"
    },
    {
      "link": "/images/shots/l/1026900-joan-jade-and-the-gates-of-xibalba-nintendo-ds-screenshot.png",
      "caption": "I need to find some objects from the list"
    },
    {
      "link": "/images/shots/l/1026901-joan-jade-and-the-gates-of-xibalba-nintendo-ds-screenshot.png",
      "caption": "I earned a trophy"
    },
    {
      "link": "/images/shots/l/1026902-joan-jade-and-the-gates-of-xibalba-nintendo-ds-screenshot.png",
      "caption": "The trophy room"
    },
    {
      "link": "/images/shots/l/1026903-joan-jade-and-the-gates-of-xibalba-nintendo-ds-screenshot.png",
      "caption": "I need to make a path"
    }
  ],
  "cover": []
}