{
  "name": "Jump Ultimate Stars",
  "shortName": "jump-ultimate-stars",
  "description": "Jump Ultimate Stars is more or less an expanded version of the original game, <a href=\"https://www.mobygames.com/game/nintendo-ds/jump-superstars\">Jump Super Stars</a>. It features the same Super Smash Bros.-style fighting gameplay with a plethora of licensed manga characters, bringing in a wide variety of new franchises and characters. The roster has been expanded to more than 300 characters from 41 different manga titles. There is also Nintendo Wi-Fi Connection support, making global internet play a possibility.<br><br>Generally, the game is structured the same as the previous title. The player sets up decks made up of the three types of panels, which can be used on the fly with the touchscreen. There is a story mode, versus modes, several single-player modes, as well as a quiz mode and information archives and story synopses for each series. The method of obtaining new panels has changed, however: each character has a progress tree, and successful battles earn gems which can be spent to power up different characters.<br><br>The complete list of series represented is: Eyeshield 21, I''s, Ichigo 100%, Katekyo Hitman Reborn!, Captain Tsubasa, Gintama, Kinnikuman, Kochi Kame, Cobra, Sakigake!! Otoko Juku, Jigoku Sensei Nube, Shaman King, Jungle no Tar-chan, JoJo's Bizarre Adventure, Slam Dunk, Saint Seiya, Taizo Mote Ou Saga, D.Gray-man, Death Note, The Prince of Tennis, Dr. Slump, Tottemo! Luckyman, Dragon Ball, Naruto, Ninku, Hunter x Hunter, Pyuu to Fuku! Jaguar, Buso Renkin, Black Cat, Bleach, Hoshin Engi, Fist of the North Star, Bobobo-bo Bo-bobo, Majin Tantei Nogami Neuro, Midori no Makibao, Muhyo to Rouji no Mahoritsu Soudan Jimusou, Yu-Gi-Oh, Yu Yu Hakusho, Rurouni Kenshin, Rokudenashi Blues, and One Piece",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Ganbarion Co., Ltd.",
  "released": "Nov 23, 2006",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/jump-ultimate-stars",
  "visual": "",
  "gamePlay": "Fighting, Platform",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Ganbarion Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 23, 2006",
          "ean13": "4 902370 515572",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/129659-jump-ultimate-stars-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/129660-jump-ultimate-stars-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/129661-jump-ultimate-stars-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    }
  ]
}