{
  "name": "Kateky? Hitman Reborn! DS: Fate of Heat",
  "shortName": "kateky-hitman-reborn-ds-fate-of-heat",
  "description": "In the Japanese town of Namimori, seemingly random attacks are occurring in the night. Tsunayoshi Sawada, middle school student and unwilling mafia boss, does his best to avoid any trouble - after all, delinquents who Tsuna has no desire to associate with are common targets. However, when Ryohei Sasagawa, the older brother of his crush Kyoko, becomes a victim, Tsuna realizes this is much more than a series of random attacks, and that he himself may be the true target. Based on the manga/anime series <i>Kateky? Hitman Reborn!</i>, <i>Fate of Heat</i> features the story of the Kokuyo Arc, where Tsuna's Vongola Famiglia battles Mukuro Rokud?'s Kokuyo Gang, and the Varia Arc, where the Vongola Famiglia's Varia Assassin Squad chooses to secede due to disagreements on who deserves to lead the Vongola, though the latter is in the form of a tournament. Added to the original story are mysterious transfer students Albito and Rizona from Italy, who also appear to have connections to the mafia.<br><br>The gameplay is in the form of a turn-based RPG; walking around on the field results in random battles where the player's party take turns making moves with the enemy party. Attacks (along with some supportive actions) are in the form of cards, with some being specific to certain characters while others may be used by the entire cast. These can be collected by interacting with items on the field or completing story battles. Many of the cards are derived from character attacks from the anime, such as Yamamoto's Shigure Kintoki and Xanxus' Colpo d'Addio. Low level cards may be bought from Dino where they may then be upgraded by Giannini to more powerful cards. More powerful cards spend more CP, which can be increased by leveling up. Additionally, items that aid in battle may be bought from Romario; these range from drinks that restore health to a talisman that raises luck. ",
  "publishedBy": "TAKARATOMY",
  "developedBy": "",
  "released": "May 01, 2008",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/kateky-hitman-reborn-ds-fate-of-heat",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "TAKARATOMY",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 01, 2008",
          "ean13": "4 904810 792314",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/294970-katekyo-hitman-reborn-ds-fate-of-heat-nintendo-ds-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/294971-katekyo-hitman-reborn-ds-fate-of-heat-nintendo-ds-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/294972-katekyo-hitman-reborn-ds-fate-of-heat-nintendo-ds-media.png",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    }
  ]
}