{
  "name": "Knerten Gifter Seg",
  "shortName": "knerten-gifter-seg",
  "description": "<i>Knerten Gifter Seg</i> is a children's title based on the film with the same name (Known as <i>Twigson Ties the Knot</i> in English). In the game the player meets Twigson and his friends and can explore the city of Gampetreff to solve various tasks. <br><br>The player can visit various locations such as &quot;Junior's House&quot; near the woods and the shop. Each location offers mini-games in which players try to beat each others high scores. In the game the player must help Junior in the shop, make waffles with Knerten and Caroline, fly with Knerten and ride Junior’s brand new red bicycle. Whenever the player finds waffle hearts they get to love each other more. With enough practice and skill, the player can actually get them to marry each other! The more the player plays, the more &quot;happier ever after&quot; Knerten and Caroline will become!<br><br>The game story is based on the movie “Knerten Gifter Seg”. In the movie Knerten meets Caroline. You don't find birch twiglets like that in every forest. And it takes a special girl to knock Knerten off his perch. Because as we all know, twigs like Knerten don't grow on trees…<br><br>Junior is dreaming of a fabulous red bicycle all of his own. Mum gets knocked down by a car and won't get better without a daily dose of gossip about the royal wedding. Tiny and Junior sell waffles as part of a plan to solve a crime and Junior's older brother Philip has to take charge on the home front. Knerten also learns to fly and Junior runs away from home.",
  "publishedBy": "PAN Vision AB",
  "developedBy": "Ravn Studio AS",
  "released": "Nov 01, 2010",
  "alsoFor": "",
  "genre": "Adventure, Educational",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/knerten-gifter-seg",
  "visual": "",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "PAN Vision AB",
          "developer": "Ravn Studio AS",
          "ported": "",
          "country": " Norway",
          "releaseDate": "Nov 01, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/479738-knerten-gifter-seg-nintendo-ds-screenshot-spot-the-differences.png",
      "caption": "Spot the differences!"
    },
    {
      "link": "/images/shots/l/479739-knerten-gifter-seg-nintendo-ds-screenshot-the-top-screen-shows.png",
      "caption": "The top screen shows the map."
    },
    {
      "link": "/images/shots/l/479740-knerten-gifter-seg-nintendo-ds-screenshot-learning-to-fly.png",
      "caption": "Learning to fly!"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/206881-knerten-gifter-seg-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Promotional",
      "country": "Norway",
      "platforms": "Nintendo DS"
    }
  ]
}