{
  "name": "Legend of Kay",
  "shortName": "legend-of-kay_",
  "description": "<i>Legend of Kay</i> is a 3D puzzle platformer based on the 2005 PS2 game <a href=\"https://www.mobygames.com/game/ps2/legend-of-kay\">Legend of Kay</a>. It takes place on the island Yenching where four clans (cats, frogs, pandas and rabbits) live together in peace. They follow a lifestyle called The Way with the help of magical water from springs/fountains, but over the years become complacent, with the water drying up. The island is then invaded by a gorilla army joined by alchemist rats. The protagonist is the cat Kay who is a martial arts scholar and will attempt to stop the invasion and free his fellow animals. The storyline also includes interaction with his master and a love interest. The story is largely identical to the original game, but the biggest difference is that the DS version features no combat, which is an important part of the original game.<br><br>The game is played on the top screen where sometimes there are animated cut-scenes presented in a comic book style with panels. The bottom screen is used to display conversations with portraits, hints, and a map of the game world. The game takes place in a large 3D environment, split up into five worlds with valleys, mountains, swamps and rivers that can be freely explored. The camera can be freely rotated, Kay can be moved in any direction and the B button is used to jump. Some enemies such as spiders can be defeated by jumping on top of them, but all major enemies such as the gorilla soldiers need to be avoided using stealth with no combat option. Lives are presented as hearts and one is taken away when Kay is hurt or noticed. When out of hearts, a large section needs to be replayed. The game has a lot of platform jumping, finding and opening doors and switch based puzzles. Some new techniques can be learned along the way, such as double jumping. Arrows point the player in the next direction.",
  "publishedBy": "JoWooD Entertainment AG",
  "developedBy": "Firehazard Studio",
  "released": "May, 2010",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/legend-of-kay_",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "JoWooD Entertainment AG",
          "developer": "Firehazard Studio",
          "ported": "",
          "country": " Germany",
          "releaseDate": "May, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}