{
  "name": "The Lord of the Rings: Aragorn's Quest",
  "shortName": "lord-of-the-rings-aragorns-quest",
  "description": "The handheld and PlayStation 2 version of <i>Aragorn's Quest</i> follows the same story as the <moby game=\"The Lord of the Rings: Aragorn&#39;s Quest\">eponymous console version</i>: the story of Aragorn during the War of the Ring is narrated by Frodo's friend, Samwise Gamgee, who recalls the story to entertain his children who want to know about the adventures of the one known as Strider. In this version, however, the hobbits are only seen in cutscenes, and has no gameplay in the Shire, that serves as the game hub in the PlayStation 3 and Wii version of the game.<br><br>In game, the player takes control of Aragorn who fights orcs, trolls and other enemies using both his sword and his bow. Aragorn can block, use quick or strong sword attacks and shoot arrows and charge his bow for more powerful attacks. He can also use a variety of special moves, many of which are acquired as the game progresses. Defeating foes replenishes some health, and gives experience points and morale. Aragorn's morale is depleted by using some special moves. As in most RPGs, gaining experience results in leveling-up, which improve Aragorn's stats and rewards the player with points to use to learn previously acquired special moves. Pieces of equipment such as swords and belts can be equipped to increase Aragorn's prowesses.<br><br>This version does not have cooperative play, but has an Arena mode.",
  "publishedBy": "Warner Bros. Interactive Entertainment Inc.",
  "developedBy": "Tt Fusion Ltd.",
  "released": "Sep 14, 2010",
  "alsoFor": "PlayStation 2, PSP | Combined View",
  "genre": "Action, Role-Playing (RPG)",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/lord-of-the-rings-aragorns-quest",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Warner Bros. Interactive Entertainment Inc.",
          "developer": "Tt Fusion Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 14, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/742648-the-lord-of-the-rings-aragorn-s-quest-nintendo-ds-screenshot.png",
      "caption": "Title/Menu screen."
    }
  ],
  "cover": []
}