{
  "name": "Mage Knight: Destiny's Soldier",
  "shortName": "mage-knight-destinys-soldier",
  "description": "Inspired by the <i>Mage Knight</i> board game, <i> Mage Knight: Destiny's Soldier</i> is a turn based strategy war game. Taking place in the year is 435 Tz, the Land is embroiled in a never ceasing war. This war was caused by the Solonavi warlords casting their spell of power over the Land, invoking the magical energies of the earth which increased the amount of energy available which strengthens the power of magical weapons and spells. All of this energy being drawn from the earth is causing massive earthquakes which are ruining crops and causing the wells to dry. Now its up for the prophesied champion to defeat the Solonavi and restore order to the land by uniting the warring tribes.<br><br>The single-player campaign consists of more than 80 different maps and features a branching storyline. Players start by choosing one of five selectable champions  each of a different race with different stats such as range and range damage. Then they choose the warriors they want to send into battle, with each warrior type having unique abilities. Warriors costs points so the player has to choose the make up of their army by considering the costs of each warrior type by what the set total they are allowed to spend before each battle.<br><br>The battles themselves will have an objective ranging from things like capturing a flag, destroying all the enemies forces, or keeping an ally out of danger.\nA unique feature of this game is that warrior units can suffer from injury and fatigue which degrades a combatants effectiveness over time and limits their movements. However, while taking damage is usually a negative outcome, some damaged units can enter in a rage allowing them to deal more damage than usual. Units can also be ordered to move past their typical range of movement, with the trade off being a reduction of their health.<br><br>Options:allow for players to turn on or off the grid, team colors, dice, sound and music.",
  "publishedBy": "Namco Bandai Games America Inc.",
  "developedBy": "Big Blue Bubble Inc.",
  "released": "Sep 26, 2006",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/mage-knight-destinys-soldier",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Namco Bandai Games America Inc.",
          "developer": "Big Blue Bubble Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 26, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}