{
  "name": "Mahjongg Mysteries: Ancient Egypt",
  "shortName": "mahjongg-mysteries-ancient-egypt",
  "description": "<i>Mahjongg Mysteries: Ancient Egypt</i> is the first in a series of games featuring Dr. Deanfield, Miss Mosely and Professor Prestwick.<br><br>This is a game of two parts<ul><li>In Adventure mode the game starts with a confrontation at the Museum Of Ancient History in 1947. There's rivalry between Professor Prestwick, the nice white haired old guy, and nasty Professor Murdoch. In the Windows version of the game this is shown in two comic-strip style screens which end in a bet being made and the three adventurers setting off to Egypt. This part of the game is a fifteen level set of Mahjongg challenges which culminate in two more comic-strip scenes that set the scene for a sequel.</li>\n<li>The Classic mode of the game has one hundred Egyptian themed layouts with three levels of difficulty. In addition to this there are multiple ways to play Standard; Countdown; Point Race; Remember; Ghosts; Exchange; Shuffle; 10 Seconds; Match; Freecell; and Ten. There are a couple of tile sets to choose from while playing through the Adventure game can unlock a few more</li></ul>\n<br>The Windows version also has an editor which allows the player to create their own levels, it has music and sound effects and can optionally play the player's own music. It can be played either in a window or in full screen.\n",
  "publishedBy": "Destineer",
  "developedBy": "Avanquest Software S. A.",
  "released": "Jun 23, 2010",
  "alsoFor": "Windows | Combined View",
  "genre": "Simulation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/mahjongg-mysteries-ancient-egypt",
  "visual": "",
  "gamePlay": "Board game, Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Destineer",
          "developer": "Avanquest Software S. A.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jun 23, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}