{
  "name": "Marvel Ultimate Alliance 2",
  "shortName": "marvel-ultimate-alliance-2_",
  "description": "<i>Marvel Ultimate Alliance 2</i> shrinks <a id=\"d390af4a01eeffa0e6508b6c899ea9bda\" href=\"https://www.mobygames.com/search/quick?game=Marvel+Ultimate+Alliance+2\">the console game</a> to fit on Nintendo's handheld. It is still in 3D and played on the upper screen. The lower screen is used to switch characters and use the star meter.<br><br>As with other versions, you play a squad of four characters at a time. You can switch between them at any time. There are shield points throughout the game where you can save and swap out characters.<br><br>Defeating enemies builds up a star meter. You can spend two stars to resurrect a fallen ally or all five to perform a powerful fusion attack where two characters combine their powers. Any pair of characters has their own unique fusion.<br><br>Defeating enemies also builds experience, which causes your characters to level up, increasing their powers and stats. Each character has four active and two passive powers and you can distribute the points however you wish or let the computer do it for you. Points can be reassigned at any time.<br><br>The story is told through 2-D cutscenes staged in the style of cardboard cutouts. It combines the Secret War and Civil War storylines from the comics. After Nick Fury uses superheroes in an unauthorized attack on Latveria, public sentiment turns against them. Then, after more than six hundred people are accidentally killed in a super hero fight, Congress passes the Super Human Registration Act, mandating all powered individual reveal their identity to the government. The game has you pick a pro or anti registration side. The beginning and end of the game are the same either way, but the middle section is different depending on which side you choose. The levels are mostly the same, but have different objectives. Several characters are restricted to each side and locked out if you play the other.",
  "publishedBy": "Activision Publishing, Inc.",
  "developedBy": "n-Space, Inc.",
  "released": "Sep 15, 2009",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/marvel-ultimate-alliance-2_",
  "visual": "2D scrolling, Isometric",
  "gamePlay": "Action RPG, Fighting",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "n-Space, Inc.",
          "ported": "",
          "country": " United States, Canada",
          "releaseDate": "Sep 15, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}