{
  "name": "Max &amp; the Magic Marker",
  "shortName": "max-the-magic-marker",
  "description": "<i>Max &amp; the Magic Marker</i> is a physics based 2D puzzle platformer where the player needs to solve puzzles by drawing into the environment, forming physical objects that can be used to overcome puzzles. The game's protagonist is Max, a young boy who receives an envelope with a marker inside. He draws a monster, Mustacho, but suddenly the character comes to life and disappears into Max' drawings. Max chases after him and needs to travel through different worlds to halt the villain.<br><br>Max is able to run around, jump, push and pull objects, and climb up or slide down. At the same time the player controls a large marker on the screen. To use it, it needs to be filled with ink, which is collected through bubbles scattered around the level. At certain passages Mustacho often appears to vacuum all the ink out of the marker. Using the orange marker the player can draw lines and shapes into the environment to form objects. The possibilities are determined based on the amount of ink available and quick swipes use less ink compared to drawing slowly. Using the marker the player can draw steps, bridges and platforms to help out Max. More complex shapes are also possible, include shields, objects to drop down on enemies or to use seesaw mechanics; offering different possibilities to solve puzzles. Different objects can exist next to each other and independent lines can be connected to form complex shapes. At any time the used ink can be reclaimed to start over. When the objects are out of view the marker can be shaken to retrieve all of it.<br><br>There are different worlds to explore, each with a unique theme, and every world consists of multiple levels with checkpoints. At any time the player can swap between Max' imagination and the original drawings. In the original drawing mode the graphics change and time is halted. The latter is also used as a game mechanism to pause the game and draw objects without time constraints. Next to the ink each level also holds a number of secret items and gel bubbles. Max is vulnerable against most dangers, such as enemies and especially water or rain.<br><br>Collected objects open up additional play modes and secrets.",
  "publishedBy": "Easy Interactive B.V.",
  "developedBy": "Press Play ApS",
  "released": "Nov 08, 2011",
  "alsoFor": "iPad, iPhone, Macintosh, Wii, Windows, Windows Phone | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/max-the-magic-marker",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Easy Interactive B.V.",
          "developer": "Press Play ApS",
          "ported": "Most Wanted Entertainment Kft.",
          "country": " United States",
          "releaseDate": "Nov 08, 2011",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1057990-max-the-magic-marker-nintendo-ds-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1057991-max-the-magic-marker-nintendo-ds-screenshot-start-game.png",
      "caption": "Start Game"
    },
    {
      "link": "/images/shots/l/1057992-max-the-magic-marker-nintendo-ds-screenshot-cutscene.png",
      "caption": "Cutscene"
    },
    {
      "link": "/images/shots/l/1057993-max-the-magic-marker-nintendo-ds-screenshot-the-first-tip.png",
      "caption": "The first tip"
    },
    {
      "link": "/images/shots/l/1057994-max-the-magic-marker-nintendo-ds-screenshot-drew-a-bridge.png",
      "caption": "Drew a &quot;bridge&quot;"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/294354-max-the-magic-marker-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "France  and The Netherlands",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/294355-max-the-magic-marker-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "France  and The Netherlands",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/294356-max-the-magic-marker-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "France  and The Netherlands",
      "platforms": "Nintendo DS"
    }
  ]
}