{
  "name": "Mazes of Fate",
  "shortName": "mazes-of-fate",
  "description": "The ancient gods have passed judgment, and as a result all of mankind has been sentenced to be replaced with a new, less sinful race. The only chance for redemption lies withing a magical item that will allow mankind to atone for its sins. But the item in question has been stolen by the enemies of humanity, and the verdict of the gods will soon come to pass.<br><br>Mazes of Fate is a fantasy medieval first person &quot;dungeon-crawler&quot; RPG in which you create a character based on gender, class and attributes (or take your pick from one of the three pre-made characters) and set out in a quest to save the human race from oblivion. The game alternates between world and town map sequences in which you control your party from an overhead perspective and visit shops and get quests from NPCs and the many dungeons that compose the bulk of the game itself. While dungeon crawling the game switches to a first-person perspective from which you control your party as it fights all the monsters that cross your path and loot the treasures uncovered. Combat is real-time although the game pauses while you navigate action menus.<br><br>Features loads of items, weapons and quests, as well as tons of monsters and up to 5 recruit-able party members.<br><br>The Nintendo DS version changes a few things from the Game Boy Advance version. The DS version uses a 3D engine that replaces the pseudo 3D and also adds new secret dungeon areas along with entire new dungeon maps.",
  "publishedBy": "Graffiti Entertainment, LLC",
  "developedBy": "Sabarasa Inc",
  "released": "Sep 08, 2008",
  "alsoFor": "Game Boy Advance | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/mazes-of-fate",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Graffiti Entertainment, LLC",
          "developer": "Sabarasa Inc",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 08, 2008",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/484202-mazes-of-fate-nintendo-ds-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/484203-mazes-of-fate-nintendo-ds-screenshot-character-selection.png",
      "caption": "Character selection."
    },
    {
      "link": "/images/shots/l/484204-mazes-of-fate-nintendo-ds-screenshot-name-edit-screen.png",
      "caption": "Name edit screen."
    }
  ],
  "cover": []
}