{
  "name": "Mega Man Star Force: Pegasus",
  "shortName": "mega-man-star-force-pegasus",
  "description": "Many years in the future, humankind has finally discovered extraterrestrial life.  In an effort to make contact with aliens, they have created a Space Station called 'Peace'.  However, the space station mysteriously vanished, and all attempts to find it were in vain.  Now, three years later, the son of one of those on-board the satellite has an encounter with an alien life-form from the Planet FM.  The alien, Omega-Xis (or Mega for short) meets Geo Stelar.  Together, they are able to explore Earth's hidden Wave World and become Mega Man.<br><br><i>Mega Man Star Force</i> is an Action RPG in the vein of <a href=\"https://www.mobygames.com/search/quick?quickSearch=013388280032\">Mega Man Battle Network</a>.  Players assume the role of Geo Stelar, who can explore the real world of Earth.  All devices in Earth use a wireless network called the Wave World to send data and communicate.  By merging with Mega, Geo becomes Mega Man and can explore the Wave World to destroy viruses, fix machines, and read secret info in people's Transer devices (which allow communication between others).  After a key point in the game, Mega Man can also use the power of one of the three different satellites - in this version, Pegasus, which has powerful ice attacks.<br><br>As Mega is a fugitive, he is being hunted by others from Planet FM.  This means that other nasty FM-ians will turn up and cause trouble on Earth, and Mega Man will need to fight them.  Battles take place  on the top screen in third person, behind Mega Man.  At the start of each turn, you can select your cards which can be used as powerful attacks or defenses for Mega Man.  You can move Mega Man left or right to avoid attacks and shoot, or you can put up a shield to block most attacks.  At the end of a battle, you are rewarded with money, health, or even new cards, depending on how well you did.<br><br>Unique to the game is the &quot;Brother Band&quot; system, which lets other people lend you their powers and cards.  The more Brothers you link up with, the more powerful your Mega Man becomes.  You can either link up with virtual Brothers in the game, or real friends online through Nintendo WFC or local wireless.  You can also connect up with friends who have the other satellite versions of the game to gain their powers too.",
  "publishedBy": "Capcom Entertainment, Inc.",
  "developedBy": "Capcom Co., Ltd.",
  "released": "Aug 07, 2007",
  "alsoFor": "",
  "genre": "Action, Role-Playing (RPG)",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/mega-man-star-force-pegasus",
  "visual": "Isometric",
  "gamePlay": "Puzzle elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Capcom Co., Ltd.",
          "developer": "Capcom Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 14, 2006",
          "ean13": "4 976219 021036",
          "comments": ""
        },
        {
          "publisher": "Capcom Entertainment, Inc.",
          "developer": "Capcom Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Aug 07, 2007",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "CE Europe Ltd.",
          "developer": "Capcom Co., Ltd.",
          "ported": "",
          "country": " France",
          "releaseDate": "Nov 23, 2007",
          "ean13": "5 055060 942048",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/126618-mega-man-star-force-pegasus-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Austria , Belgium , Germany , Switzerland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/126619-mega-man-star-force-pegasus-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Austria , Belgium , Germany , Switzerland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/126620-mega-man-star-force-pegasus-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Austria , Belgium , Germany , Switzerland  and United Kingdom",
      "platforms": "Nintendo DS"
    }
  ]
}