{
  "name": "Meitantei Conan &amp; Kindaichi Sh?nen no Jikenbo: Meguriau Futari no Meitantei",
  "shortName": "meitantei-conan-kindaichi-shnen-no-jikenbo-meguriau-futari-no-me",
  "description": "Twilight Island, one of Japan's tourist hotspots during the summer, has become the source of a disturbing rumor as of late. It tells of several visitors being spirited away to another place, which at first sight seems to be the same island, but is in fact fundamentally different, as if it was lost in time. These missing persons eventually do return safely, just as mysteriously as they disappear, however the rumor was enough to spook some of Professor Agasa's colleagues into cancelling their vacation there. The professor has come handsomely out of this situation with some spare tickets and, knowing Conan's interest in such riddles, has suggested that they go in their stead. Fait accompli, and now the whole gang, besides them including detective Kogor? M?ri, his daughter Ran, and Conan's friends from elementary school, are off to unravel the island's mysteries.<br><br>Meanwhile Hajime Kindaichi, an amateur detective just like Conan, receives a letter from a former classmate who relocated a long time ago. She asks for him to come to Twilight Island and prevent a certain tragedy that took place there 25 years ago from happening again. Troubled by the urgency of the note, the teenage sleuth, together with his friend, Miyuki, and inspector Kenmochi, departs towards the island. On this adventure, the two detectives' paths will cross each other in a way that no one would've expected.<br><br><i>Meitantei Conan &amp; Kindaichi Sh?nen no Jikenbo: Meguri au 2-Jin no Meitantei</i> is an adventure game and a crossover between <i>Meitantei Conan</i> and <i>Kindaichi Sh?nen no Jikenbo</i>, two franchises centered around different detective manga series--the first one published in Shogakukan's <i>Weekly Sh?nen Sunday</i> since 1994, and the second one in Kodansha's <i>Weekly Sh?nen Magazine</i> starting from 1992. The bulk of the game functions as a visual novel, in which either Conan or Hajime travels around the island using a map, talks with other characters and gathers clues to solve a murder. When investigating the crime scene, the player can use the touchscreen in order to analyze an object of interest in a regular point-and-click fashion, albeit with a stylus. Information about the evidence, testimonies and the suspects is stored in a journal available at all times. The dialogue system makes it possible to talk with all characters present at the moment, but they may not have much to tell, since the plot is linear. It can be moved forward only by interrogating specific people.<br><br>Solving a case can be divided into two parts: gathering the evidence and confronting the murderer. Finding clues is not limited to the crime scene--there are more secrets to discover elsewhere on the island, including by talking to other people. Sometimes it's necessary to make a connection between two different pieces of evidence and literally combine them. This clarifies a minor problem during the investigation and a new clue is born, one that is central to disentangling the entire case. The game checks the player's understanding of the events often via multiple choice questions. Suspects are prone to lie, and in such situations their statements must be searched for contradictions--this is done by marking a specific phrase in the statement's text. In all instances a wrong answer, a mistake or using the hint system decreases the number of logic points. Once they are all depleted it's game over. The pool of logic points is restored to 100% at the start of each murder case. Confronting the culprit starts out by summarizing all the data in a flowchart. The player must place the answers to major questions pertaining to the murderer's identity, the victim, the tricks used etc. into the correct boxes. Incorrect answers are not penalized and the player can make an unlimited number of attempts. After all the boxes are filled with the right choices, Conan or Hajime will accuse the culprit directly supported by several more multiple choice questions.<br><br>The game is divided into chapters, each played from the perspective of either Conan Edogawa or Hajime Kindaichi, depending on the script. In the last chapter, the player has the freedom of choosing whom (of the two detectives) to control and wrap up the entire investigation. The player's deductive abilities are scored at the end of every chapter. Included are a couple of mini games such as riding the turbo-engine skateboard on a course full of obstacles or defusing a time bomb. Some of them can be skipped.",
  "publishedBy": "Namco Bandai Games Inc.",
  "developedBy": "Spike Co., Ltd.",
  "released": "Feb 05, 2009",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/meitantei-conan-kindaichi-shnen-no-jikenbo-meguriau-futari-no-me",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Namco Bandai Games Inc.",
          "developer": "Spike Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 05, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/818380-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/818381-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The intro."
    },
    {
      "link": "/images/shots/l/818382-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Instructions at the beginning of the game."
    },
    {
      "link": "/images/shots/l/818383-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Everyone landed safely on the island."
    },
    {
      "link": "/images/shots/l/818384-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The gift shop owner looks rather nervous."
    },
    {
      "link": "/images/shots/l/818385-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The first victim--my question is who's next?"
    },
    {
      "link": "/images/shots/l/818386-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Inspecting the murder weapon in 3D."
    },
    {
      "link": "/images/shots/l/818387-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Investigating the local museum for clues. I wonder where the employees hide the pot..."
    },
    {
      "link": "/images/shots/l/818388-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "A fisherman witnessed the victim arguing with a suspicious man."
    },
    {
      "link": "/images/shots/l/818389-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The beginning of a new chapter."
    },
    {
      "link": "/images/shots/l/818390-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Conan and Hajime talking over the Detective Boys badge, which functions as a miniature walkie-talkie and a tracking device."
    },
    {
      "link": "/images/shots/l/818391-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Conan exploring a decrepit school."
    },
    {
      "link": "/images/shots/l/818396-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "In this mini game Conan rides his turbo-engine to the pier. Strategically placed patches of dirt and soda cans are there to delay him since there is a time limit."
    },
    {
      "link": "/images/shots/l/818410-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Dialogue options."
    },
    {
      "link": "/images/shots/l/818411-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The answer to this riddle must be written with the stylus."
    },
    {
      "link": "/images/shots/l/818412-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Combining two pieces of evidence in order to get a new clue."
    },
    {
      "link": "/images/shots/l/818413-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Unusually, this receptionist is very unfriendly."
    },
    {
      "link": "/images/shots/l/818414-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Information about every character you meet is stored here."
    },
    {
      "link": "/images/shots/l/818415-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "I'm sure there's a clumsy lie in every statement a suspect gives. I just need to find it."
    },
    {
      "link": "/images/shots/l/818416-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Private detectives have the habit of stalking people from the bushes."
    },
    {
      "link": "/images/shots/l/818417-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The library can be explored by a using this nifty map."
    },
    {
      "link": "/images/shots/l/818418-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "I can talk to only two persons here."
    },
    {
      "link": "/images/shots/l/818419-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "This guy barely escaped the explosion."
    },
    {
      "link": "/images/shots/l/818420-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Defusing a time bomb requires some good reactions."
    },
    {
      "link": "/images/shots/l/818421-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The game has a habit of testing our deductions skills often. Here it's a multiple choice with 4 options, but it can also ask us to choose from all the entries in the journal."
    },
    {
      "link": "/images/shots/l/818422-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Didn't expect to find this in the fridge, huh..."
    },
    {
      "link": "/images/shots/l/818423-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Investigating the murder scene."
    },
    {
      "link": "/images/shots/l/818424-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "This dossier collects all the evidence."
    },
    {
      "link": "/images/shots/l/818425-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "To conclude a case a flowchart must be filled with the right answers."
    },
    {
      "link": "/images/shots/l/818426-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "And here's how the overall picture looks."
    },
    {
      "link": "/images/shots/l/818427-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "The score and the game completion level."
    },
    {
      "link": "/images/shots/l/818428-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "Strange to find her in this place."
    },
    {
      "link": "/images/shots/l/818429-meitantei-conan-kindaichi-shonen-no-jikenbo-meguriau-futari.png",
      "caption": "This is how one moves around the island."
    }
  ],
  "cover": []
}