{
  "name": "MX vs. ATV: Untamed",
  "shortName": "mx-vs-atv-untamed",
  "description": "An update from <a href=\"https://www.mobygames.com/game/mx-vs-atv-unleashed\">MX vs. ATV Unleashed</a>, <i>Untamed</i> has some of the classic features along with some new ones as well. There are 250 cc and 550 cc bikes and four ATV models, but also monster trucks, offroad dune buggys and trophy trucks.<br><br>Players can pull off insane stunts and compete in six different racing series (Supercross, Nationals, Opencross, Supermoto, Freestyle and Rally) or in the X-Cross, a tournament of all the series wrapped into one, plus sponsorships can be acquired: good performances have the player receive better bikes. It also features Crash Camera, a super slow-mo breakdown of accidents and crashes, similar to <a href=\"https://www.mobygames.com/game/motorstorm\">MotorStorm</a>.<br><br>Some mini-games have been included as well, including ATV hockey, Monster Truck Smash and Tag to name a few. The online mode has the player compete against other competitors. The gameplay is very similar to the console systems, certain buttons for gas, brakes while the Wii remote can be used as well.<br><br>The DS and PSP versions are almost similar. While the DS has few vehicles and only has a championship mode unlike the many series in the major console versions, it contains ten exclusive tracks and three stadiums. The PSP version is almost similar, but has different series from the consoles: Race, One on One, Time Attack, Stunt Challenge, Stunt Race, Hang-Time, Combo Challenge, Flag Challenge. It also has the X-Cross tournament, but it is named the MX vs. ATV World Tour instead. Games can be played against friends using Wi-Fi.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Endgame Studios Pty. Ltd., Tantalus Interactive Pty. Ltd.",
  "released": "Dec 17, 2007",
  "alsoFor": "PlayStation 2, PlayStation 3, PSP, Wii, Xbox 360 | Combined View",
  "genre": "Racing / driving",
  "perspective": "1st-person, Behind view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/mx-vs-atv-untamed",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Endgame Studios Pty. Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Dec 17, 2007",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "THQ Inc.",
          "developer": "Endgame Studios Pty. Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Dec 17, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/215003-mx-vs-atv-untamed-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/215004-mx-vs-atv-untamed-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    }
  ]
}