{
  "name": "The Mysterious Case of Dr. Jekyll and Mr. Hyde",
  "shortName": "mysterious-case-of-dr-jekyll-and-mr-hyde",
  "description": "A series of mysterious murders take place in London, prompting an investigation by the local authorities. All the evidence points out to Dr. Jekyll and his connection to the sinister Mr. Hyde.<br><br><i>The Mysterious Case of Dr. Jekyll and Mr. Hyde</i> is a straightforward hidden object game based on the book by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,222329/\">Robert Louis Stevenson</a>. Most of the time, the objective is to find and click on all the items listed at the bottom of the screen, on locations filled with assorted paraphernalia scattered around the scenery. In some scenes, the goal is to find several instances of the same object. The hint button is a potion vial at the bottom-left that shows the position of one of the required items when activated. Extra hints can be collected as pairs of vials concealed on most scenes.<br><br>\nMini-games and puzzles appear on separate screens between locations, where the player has to flip cards to find matching pairs, identify sets of identical fingerprints, reassemble a shredded note, put clothes on a small mannequin doll and complete other similar challenges.",
  "publishedBy": "OG International Limited",
  "developedBy": "Joindots GmbH, Ocean Media LLC",
  "released": "May 03, 2011",
  "alsoFor": "Nintendo DSi, Nintendo Switch, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/mysterious-case-of-dr-jekyll-and-mr-hyde",
  "visual": "",
  "gamePlay": "Hidden object",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "OG International Limited",
          "developer": "Joindots GmbH",
          "ported": "",
          "country": " United States",
          "releaseDate": "May 03, 2011",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}