{
  "name": "Naruto: Path of the Ninja",
  "shortName": "naruto-path-of-the-ninja",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/naruto-path-of-the-ninja/adblurbs\">Ad Blurbs</a>)</h3><br><br><p style=\"margin-top: 0\">\n      Following the story line from the Cartoon Network television show, in \n      Naruto: Path of the Ninja players will be able to explore the Village \n      Hidden in the Leaves and the world of Naruto as you roam across forests, \n      fields, rivers and mountains. Along the way players will encounter \n      bosses and enemies that they must use their special techniques to \n      defeat. What’s your nindo?\n    </p>\n\t\t\t\t\t\t\t\t\t\t\t <p>\n      6 playable characters – Play as Naruto, Sasuke, Sakura, Shikamaru, Neji \n      or Rock Lee and as you travel through the various environments in the \n      game you will encounter all of your favorite ninja’s from the TV show!\n    </p>\n    <p>\n      Special formation combat system – Players must choose different \n      characters for battles based on who they feel has the best strengths to \n      defeat the enemy. Going one step further; by choosing individual \n      character stances, the team can build formations that will give bonuses \n      to the entire group’s attributes and abilities.\n    </p>\n    <p>\n      Original game for North America – All of the best elements of the NARUTO \n      Nintendo Game Boy Advance and DS Role-playing Games in Japan have been \n      brought together to create Naruto: Path of the Ninja, delivering a brand \n      new game for North America.\n    </p>\n    <p>\n      Train your ninja team to learn over 90 different jutsu!\n    </p>\n    <p>\n      Jutsu input and combination techniques – Utilizing the Nintendo DS Touch \n      Screen and button inputs, there are a variety of different ways players \n      can take their attacks to the next level. Characters can even combine \n      their jutsu techniques to create all new jutsu!\n    </p>\n    <p>\n      \n    </p>\n    <p>\n       \n    </p>",
  "publishedBy": "Tomy Corporation",
  "developedBy": "Tose Co., Ltd.",
  "released": "Oct 23, 2007",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "3rd-person (Other), Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/naruto-path-of-the-ninja",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Tomy Corporation",
          "developer": "Tose Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 23, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}