{
  "name": "Naruto: Ninja Destiny",
  "shortName": "naruto-ninja-destiny",
  "description": "<i>Naruto: Ninja Destiny</i> is a fighting game based on the popular Naruto franchise. The player has four playing modes at his disposal: multiplayer, fights against an AI opponent, fights against multiple AI opponents in a row (used to unlock most of the 15 characters) and the story mode. The latter is a series of fights based on the TV series.<br><br>The controls are similar to other fighting games: every character has a few basic moves and about ten powerful special moves which are performed by pressing more or less complex button combinations. Because the fighters belong to the &quot;ninja&quot; category they can teleport behind the enemy's back with a single button command - but this is not without costs. This and other special moves costs &quot;chakra&quot; which automatically builds up over time. Another unique gameplay element are the power-ups which are shown at the top of the screen. They can be selected with the stylus and have effects like refilling health or stopping the opponent's chakra regeneration. In every fight the player has six random ones at his disposal.<br><br>The European version features a shorter story mode and no voice acting.",
  "publishedBy": "D3Publisher of America, Inc.",
  "developedBy": "Dream Factory Co., Ltd.",
  "released": "Feb 26, 2008",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/naruto-ninja-destiny",
  "visual": "",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Tomy Company, Ltd.",
          "developer": "Dream Factory Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 14, 2006",
          "ean13": "4 904810 745211",
          "comments": ""
        },
        {
          "publisher": "D3Publisher of America, Inc.",
          "developer": "Dream Factory Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Feb 26, 2008",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}