{
  "name": "New Ch?gaku Eitango Target 1800 DS",
  "shortName": "new-chgaku-eitango-target-1800-ds",
  "description": "<i>New Ch?gaku Eitango Target 1800 DS</i> is an educational English language learning game based on the <i>Eitango Target</i> series of books by Obunsha. These books teach a common common set of English words in order to help students pass English exams. This game, specifically, is based on the <i>Ch?gaku Eitango Target 1800</i> book, targeted at a middle-school audience, which teaches 1800 common English words.<br><br>A variety of different modes are provided to let players study:\n<ul>\n    <li>Training: Players select a group of words, and are then presented audio recordings of words one at a time. Players must first select the correct Japanese translation, then then must write them down in English. This uses the DS's touchscreen and handwriting recognition.</li>\n    <li>Real Test: A more challenging test mode which runs players through a simulated exercise. This is only available after players have gained some mastery in the other modes.</li>\n    <li>My Training: A more customizable training mode. Players can create custom sets of English words, then run through training exercises on only the words in that set.</li>\n    <li>Word Machine: An interactive dictionary of all 1800 words.</li>\n    <li>Record: Shows players' progress through the other modes.</li>\n</ul>",
  "publishedBy": "IE Institute Co., Ltd.",
  "developedBy": "Now Production Co., Ltd.",
  "released": "Jan 22, 2009",
  "alsoFor": "",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/new-chgaku-eitango-target-1800-ds",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "IE Institute Co., Ltd.",
          "developer": "Now Production Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jan 22, 2009",
          "ean13": "4 582107 391602",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1040838-new-chugaku-eitango-target-1800-ds-nintendo-ds-screenshot.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}