{
  "name": "Okaeri! Chibi-Robo! Happy Richie ?s?ji!",
  "shortName": "okaeri-chibi-robo-happy-richie-sji",
  "description": "<i>Okaeri! Chibi-Robo! Happy Richie ?s?ji!</i> is the third game in the Chibi-Robo series and only released in Japan. You wake up as Chibi-Robo in a ruined building with only a minimal energy level left. Trying to escape from the room he's in you finally collapse from power outage, only to hear feint voices talking to you. When back on-line, you wake up in a small house and introduced to a person called <i>&quot;Telly&quot;</i>. The &quot;goal&quot; of the game is to clean the house you're in by vacuuming dust. The power required to perform your task is given by plugging into an outlet. The only thing blocking your chore is the length and size of your cord  and available energy for the house. This energy can be only be filled by collecting and compacting garbage. \nThe movements of Chibi-Robo are done by using the touchpad instead of the D-pad, like in <a href=\"https://www.mobygames.com/game/chibi-robo-park-patrol\">Chibi-Robo!: Park Patrol</a>. Whilst scavenging for trash, used to energize the house, enemies can attack Chibi-Robo depleting him of his energy, unless the player acts upon it, by fighting back with your plug cord or sucking them in with your vacuum",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Skip, Ltd.",
  "released": "Jul 23, 2009",
  "alsoFor": "",
  "genre": "Action, Puzzle",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/okaeri-chibi-robo-happy-richie-sji",
  "visual": "",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Skip, Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 23, 2009",
          "ean13": "",
          "comments": "retail release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}