{
  "name": "Osu! Tatakae! Ouendan",
  "shortName": "osu-tatakae-ouendan",
  "description": "'Osu! Tatakae! Ouendan' is a music-based rhythm game on the Nintendo DS. The premise revolves around a troupe of men dressed in black uniforms that act as a &quot;Cheersquad&quot; (or 'Ouendan'). Their job: Aid anyone who is in need of motivation whenever they cry out &quot;OUENDAN!!!&quot; When the cry is heard, these guys appear and dance to music in order to motivate the person to finish his or her task. <br><br>The Cheersquad's success depends on how well the player does. The game takes advantage of the system's touch screen by having players tap circles in time with the beat of the music. Other actions include tapping a stack of circles repeatedly, following a moving ball along a path by dragging the stylus on it, and spinning a wheel. Each successful action fills a power bar at the top of the touch screen and contributes to the score. This bar drains continuously and will take large hits if the player misses a beat or two. If the bar hits zero, the game is over.  <br><br>Ouendan contains 15 licensed songs with a level dedicated to each, and the songs are drawn from popular Japanese Rock. There are also 4 difficulty levels, 2 of which have to be unlocked through play. Each difficulty level alters the number of circles that need to be tapped, paths to trace, and wheels to spin. The timing of each is also changed, with easier difficulties giving more time to anticipate when to tap, while harder difficulties speed this up. A multiplayer mode is also featured, as well as a download &amp; play option that sends the tutorial level to DS's that don't have the game.",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "iNiS corporation",
  "released": "Jul 28, 2005",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/osu-tatakae-ouendan",
  "visual": "",
  "gamePlay": "Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "iNiS corporation",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 28, 2005",
          "ean13": "4 902370 512281",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/53921-osu-tatakae-ouendan-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/53920-osu-tatakae-ouendan-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/53919-osu-tatakae-ouendan-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Japan",
      "platforms": "Nintendo DS"
    }
  ]
}