{
  "name": "Pillow Pets",
  "shortName": "pillow-pets",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/pillow-pets/adblurbs\">Ad Blurbs</a>)</h3><br><br><p style=\"margin-top: 0\">\n      Based on the beloved children’s line of plush pillows from CJ Products \n      that easily transform into snuggly companions, the Pillow Pets game for \n      Nintendo DS invites you to jump, fly, buzz and explore Dreamland, the \n      imaginative world where the Pillow Pets characters thrive. Get to know \n      your charming pet’s personality as you customize him or her with hats, \n      glasses, shoes and more! When your favorite pal goes missing you must \n      set out on a journey to bring your lost pet home safely. But don’t fret! \n      Along the way you’ll meet cuddly friends and uncover tokens and rewards \n      that will make for an unforgettable experience! Whether playing alone or \n      side by side with friends, the Pillow Pets game for Nintendo DS creates \n      a nurturing and fantasy-filled adventure that can be enjoyed by boys and \n      girls of all ages!\n    </p>\n    <p>\n      <b>Features</b>\n    </p>\n    <p style=\"margin-top: 0; padding-left: 25.0px\">\n      • Collectables: Meet and collect up to 16 well-known Pillow Pets \n      characters including farm critters, sea creatures and jungle animals!• \n      Beautiful Lands to Explore: Venture into magical lands including Fantasy \n      Woods, Rainbow Valley and Slumber Land Castle!• Customization: \n      Accessorize your Pillow Pets from head to toe! Up to 40 accessories to \n      unlock from hats and glasses to shoes and more!• Rewards: Gather \n      tokens, unlock bonuses and garner prizes in each level!\n    </p>",
  "publishedBy": "GameMill Entertainment LLC",
  "developedBy": "1st Playable Productions, LLC",
  "released": "Oct 18, 2011",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other), Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/pillow-pets",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "GameMill Entertainment LLC",
          "developer": "1st Playable Productions, LLC",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 18, 2011",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}