{
  "name": "PokéPark: Asari Taikai DS",
  "shortName": "pokpark-asari-taikai-ds",
  "description": "<i>PokéPark: Asari Taikai DS</i> is a Pokémon-themed fishing game for the Nintendo DS. Its release is a unique one: instead of being given a full-retail release on a physical DS game card, it was only available through Nintendo DS Download Play at certain locations in Japan. As such, the game is deleted from the Nintendo DS system memory after 12 hours or when the system is turned off.<br><br>The game takes place on a river. Shadows of Pokémon are visible under the water. The player must cast their line near these shadows. The bobber will start bobbing when a Pokémon is hooked. When it is pulled underwater, the player must immediately press the A button repeatedly. If this is not done correctly, the hooked Pokémon will get away and the player must try again. If the player succeeds, a Poké Ball will come out of the water attached to the line. The player is redirected to another screen where the Poké Ball opens and reveals what Pokémon they caught, as well as its size, level, and rarity, plus the date and time. Up to five Pokémon can be stored at a time. The size, level, and rarity of the Pokémon determine the player's score. If the combined score of all five Pokémon ranks in the top 50 scores, it is sent to the DS Download Station to be displayed on the score list.",
  "publishedBy": "Pok&eacute;mon Company, The",
  "developedBy": "Pok&eacute;mon Company, The",
  "released": "May 10, 2005",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "Fishing",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/pokpark-asari-taikai-ds",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Pok&eacute;mon Company, The",
          "developer": "Pok&eacute;mon Company, The",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 10, 2005",
          "ean13": "",
          "comments": "Pok&eacute;Park (DS Download Play)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}