{
  "name": "Princess Isabella: A Witch's Curse",
  "shortName": "princess-isabella-a-witchs-curse",
  "description": "Princess Isabella returns from a ride to find her castle completely ruined and locked under an evil spell. While she was away, a wicked witch trapped the castle residents inside mirrors, shattered the glass and scattered the pieces. With the help of a fairy, the princess must rescue her people and restore the place to finally marry Prince Adam.<br><br><i>Princess Isabella: A Witch's Curse</i> is a hidden object game with adventure elements. The main objective is to collect several key objects from the castle grounds, to solve puzzles and free the castle folk. The castle can be explored in a typical point-and-click manner, where each location is represented by an static image of the scenery, and the player moves from room to room by clicking on the exit hotspots, usually placed over obvious and logical areas like doors and entrances. Some portions of the building are locked, and can only be accessed after solving one of the puzzles.<br><br>The objects can be found laying around in the background, or in some separate close-up views of the scenery. These zoom windows show another angle of the scene, with a list of objects to be found and collected at the bottom. Some of the collected items are stored in the inventory slots, from where they can be dragged and dropped on puzzles and other portions of the screen to interact with the environment. Mirror shards have to be inserted in one of the empty frames at the grand hall, and reassembled as jigsaw puzzles to liberate one of the captive souls. The rescued character usually unlocks a castle passage as a reward.<br><br>Each room has several puzzles that have to be solved to lift the curse and move to the next place. Some of the puzzles are self-contained mechanisms that can be solved through direct manipulation. Others block access to other parts of the castle, and require the use of inventory objects. After solving all the pending puzzles, the room is restored to its pristine condition.<br><br>One unique feature is the fairy assistant. She is the hint button, flying towards one of the required items when selected, and can also perform a series of special actions. She gradually learns new abilities that can be used to reveal hidden objects and solve puzzles. With the rock ability, she can break small containers like bottles and vases. The flame ability can be used to light something on fire, or attack an enemy. The wind ability blows away dust and other deposits, often revealing some obscured item. The water ability can be used to nourish plants. The hint option take some time to recharge after use, and becomes a skip option when playing one of the puzzles.",
  "publishedBy": "Destineer",
  "developedBy": "Gogii Games Corp.",
  "released": "Sep 03, 2010",
  "alsoFor": "Android, iPad, iPhone, Macintosh, Wii, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/princess-isabella-a-witchs-curse",
  "visual": "",
  "gamePlay": "Hidden object",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Destineer",
          "developer": "Gogii Games Corp.",
          "ported": "Beast Studios S.r.l.",
          "country": " United States",
          "releaseDate": "Sep 03, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/226963-princess-isabella-a-witch-s-curse-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/226964-princess-isabella-a-witch-s-curse-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/227673-princess-isabella-a-witch-s-curse-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    }
  ]
}