{
  "name": "Pucca Power Up",
  "shortName": "pucca-power-up",
  "description": "<h3>www.nintendo.co.uk (from <a href=\"https://www.mobygames.com/game/pucca-power-up/adblurbs\">Ad Blurbs</a>)</h3>Pucca is the niece of a humble noodle seller, and at just 10 years old she knows what she wants from life – to go out with Garu the young ninja! Cheerful, assertive and tenacious, Pucca will stop at nothing to make Garu her own – and you can follow their story in this cute, funny Nintendo DS platform game from Barunson Creative and Rising Star Games.<br><br>Pucca Power Up comprises six exciting chapters, during which you’ll play as Pucca and Garu too, and don’t think it’ll be a cakewalk - you’ll need your own ninja reflexes to triumph over the electrifying platform challenges that the game will provide.<br><br>When you’re in Pucca’s shoes you’ll be making haste to catch up with Garu as best you can in order to steal a kiss, all the while using iconic weapons and tools that players will recognise from the Pucca series of animated episodes. Whereas, walking in Garu’s tabi socks means the challenge is to evade, avoid and generally scarper away from Pucca, using awesome ninja skills - and shiny weaponry when required. Never was a quirky, mismatched love story so much fun!<br><br>As well as the main story, the game also features addictive and engrossing minigames like Kissing Garu and Jumping Off the Cliff which are sure to keep you entertained for hours.<br><br>Featuring a storyline and comedy high jinks direct from the Pucca creators, as well as a bunch of adorable characters from the series (including Master Su), Pucca Power Up for Nintendo DS is the definite article when it comes to crazy, cute ninja platform action in the palm of your hand!<br><br><ul><li>Play through six chapters of engaging platform action</li><br>\n<li>Encounter characters, tools and weapons from the series</li><br>\n<li>Play as Garu and Pucca – and learn new skills from Master Su</li><br>\n<li>Get hours of enjoyment from adorable themed minigames</li></ul>",
  "publishedBy": "UFO Interactive Games, Inc.",
  "developedBy": "Barunson Interactive Co. Ltd.",
  "released": "Sep 13, 2011",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/pucca-power-up",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Barunson Creative",
          "developer": "Barunson Interactive Co. Ltd.",
          "ported": "",
          "country": " South Korea",
          "releaseDate": "Dec 09, 2010",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Rising Star Games Ltd.",
          "developer": "Barunson Interactive Co. Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "May 13, 2011",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "UFO Interactive Games, Inc.",
          "developer": "Barunson Interactive Co. Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 13, 2011",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}