{
  "name": "Puzzle City",
  "shortName": "puzzle-city",
  "description": "<i>Puzzle City</i> contains elements of <a href=\"https://www.mobygames.com/search/quick?game=SimCity\">SimCity</a> and <a href=\"https://www.mobygames.com/game/tetris\">Tetris</a>. As the new Constructor Manager at Puzzle City, Inc., the player has to build cities by placing colored blocks (in shapes resembling those of <i>Tetris</i>), which arrive on a conveyor belt. Each color represents a kind of building (green for residential, yellow for industrial, blue for commercial, and so on), with different kinds of shapes. The player has to clear the tray, placing the blocks in the available locations on the city's map, or else it will become full and breaks. The blocks can be rotated (using the right mouse button) to better fit the map.<br><br>Each level has a collection of goals, usually filling a certain portion of the map (20% in the game's start) and constructing certain kinds of structures (like 2x2 residential blocks). Some maps have highlighted areas with specific colors to build on, and those must also be filled.<br><br>When 2x2 blocks of the same kind are built, the player earn power-ups. The main ones are the recycler, which changes the shape of a given set of blocks; the trash can, where the player can put unwanted pieces; and the bulldozer, which allows the player to destroy blocks already built. Those three, when earned, are added to specific counter. Other kinds of power-ups are accumulated below the conveyor belt, such as: the hammer, which breaks every set in the conveyor to one block sets; the spray can, which randomly recolors all sets in the conveyor belt; the dynamite, which makes all sets in the conveyor explode; the clock, which stops time for 3 seconds; the snail, which slows down the conveyor belt for a while, etc.<br><br>There are two play modes, Story and Untimed, and a total of 48 cityscapes.",
  "publishedBy": "rondomedia Marketing &amp; Vertriebs GmbH",
  "developedBy": "TechFront Studios, Ltd.",
  "released": "Jan 06, 2009",
  "alsoFor": "Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/puzzle-city",
  "visual": "Fixed / flip-screen",
  "gamePlay": "City building / construction simulation",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "rondomedia Marketing &amp; Vertriebs GmbH",
          "developer": "TechFront Studios, Ltd.",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Jan 06, 2009",
          "ean13": "4 032222 510049",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/377225-puzzle-city-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Austria  and Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/377226-puzzle-city-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Austria  and Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/377227-puzzle-city-nintendo-ds-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "DS Case",
      "country": "Austria  and Germany",
      "platforms": "Nintendo DS"
    }
  ]
}