{
  "name": "Ragnarok DS",
  "shortName": "ragnarok-ds",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/ragnarok-ds/adblurbs\">Ad Blurbs</a>)</h3><p style=\"margin-top: 0\">\n      The international MMO phenomenon comes to the Nintendo DS.\n    </p><br><br><p>\n      Throughout the world, the people of the major powers throughout the land \n      live in peace and prosperity, unaware that a great evil lurks on the \n      horizon. There is a clandestine group, under the guise of scholarly \n      research, plotting to resurrect a goddess whose time has long since \n      passed. To achieve this goal, they need two things; a vessel of flesh \n      and blood to house the spirit of the goddess, and the lives of every \n      living being offered up as a sacrifice.It is against the backdrop of \n      this coming chaos that Ares, an orphan from a small, forgotten village, \n      sets out to seek his fortune as an adventurer. At the start of his \n      journey, he encounters a beautiful young girl with mysterious powers \n      named Sierra, who has not only lost her memories about herself, but also \n      of the world around her. Together, they embark on an adventure that will \n      ultimately decide the fate of the entire world.\n    </p>\n    <p style=\"padding-left: 25.0px\">\n      <b>Features</b>• Flexible Character Development System - Characters \n      earn both Status and Skill Points each time they gain a level, and these \n      points can be allocated to customize their skills across a wide range of \n      different job classes such as Swordsman, Thief, and Merchant.• \n      Upgradable Weapons and Armor - Characters’ armor and weapons can be \n      upgraded by a blacksmith, or by affixing effect cards dropped by \n      defeated monsters. Blacksmith upgrades will improve an item’s overall \n      stats, while effect cards boost specific features.• Gameplay \n      Optimized for Touch Screen - All attacks and commands are performed \n      using the Touch Screen. Slash with the stylus to attack with your sword, \n      and circle or tap the intended target to unleash magic spells.• \n      Party-based Multiplayer - Players can take on the Mirage Tower with up \n      to 2 other friends via local wireless connection or Wi-Fi. With more \n      than 50 floors, randomly generated maps and completion conditions, and \n      the chance to obtain rare items, players can enjoy this feature long \n      after the main story has been completed.• Job Classes - Job Classes \n      are broken down into Low Level Jobs and High Level Jobs with two special \n      jobs unique to Ragnarok DS. A High Level Job can only be achieved by \n      following the corresponding development path from its Low Level Job.• \n      Upgrade Equipment - Customize your character with the single touch of \n      your stylus. Equip weapons, armor, and accessories you obtained simply \n      by tapping them with the stylus!• Quests - There are two kinds of \n      quests for players to tackle in the world of Ragnarok DS; scenario \n      quests that are necessary to complete in order to advance the story, and \n      optional side quests that can be completed at the player’s leisure. \n      Scenario quests will become available as you progress through the main \n      storyline of the game. Players will be required to complete scenario \n      quests in order to continue through the game. To engage in a side quest, \n      players can either go to the tavern in each city, talk with various \n      NPCs, or advance in a specific job class. Many side quests have various \n      prerequisites before they become unlocked, and many of them won’t be \n      available until after the main story of the game has been completed.\n    </p>\n    <p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p>\n    <p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit <a href=\"https://support.nintendo.com/servicesupdate\">support.nintendo.com/servicesupdate</a>.\n    </p>",
  "publishedBy": "XSEED Games",
  "developedBy": "GungHo Online Entertainment, Inc.",
  "released": "Feb 16, 2010",
  "alsoFor": "",
  "genre": "Action, Role-Playing (RPG)",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/ragnarok-ds",
  "visual": "",
  "gamePlay": "Action RPG",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "XSEED Games",
          "developer": "GungHo Online Entertainment, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Feb 16, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}