{
  "name": "Real Soccer 2008 3D",
  "shortName": "real-soccer-2008-3d",
  "description": "<i>Real Soccer 2008 3D</i> is the third 3D game in the Real Football series but the first one that is fully 3D with polygonal player models and stadia. Next to the new graphics the game features similar content and mechanics to the 2D version. The view is still from the side line like in the previous 3D versions but it features a lateral camera that slightly rotates. The replay system is also more advanced with it being possible to rotate the camera and watch the action from different angles.<br><br>The 3D version has the same game modes as the 2D version. This includes friendlies, cups and leagues as well as the new Road to 2008 and challenge modes. Road to 2008 involves qualifying for and competing in the Euro 2008 while the challenge mode is made up of a number of real life football scenarios where the player has to complete objectives.<br><br>The Nintendo DS version has some differences from the mobile version. It has a multiplayer mode but lacks the challenge mode. It also adds some extra gameplay features that make us of the DS functionalities. It is possible to use the microphone to yell at referee and thereby influence his decisions while the stylus is used on the touch screen when taking penalties.",
  "publishedBy": "Ubisoft Entertainment SA",
  "developedBy": "Gameloft Software Beijing Ltd.",
  "released": "Oct 12, 2007",
  "alsoFor": "J2ME, Symbian, Windows Mobile | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/real-soccer-2008-3d",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Ubisoft Entertainment SA",
          "developer": "Gameloft Software Beijing Ltd.",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Oct 12, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}