{
  "name": "Sea Monsters: A Prehistoric Adventure",
  "shortName": "sea-monsters-a-prehistoric-adventure",
  "description": "<i>Sea Monsters</i> is based on the National Geographic CGI documentary of the same name, where earth's underwater world from millions of years ago is portrayed as a dangerous environment with different kinds of predators keeping the ecosystem intact.<br><br>Players take command of six different prehistoric marine reptiles, each with their own skills and weaknesses. A large part is spent on exploration. The creatures need to hunt prey, avoid or defeat foes, unlock hidden challenges and eventually find a way to escape the dangerous waters.<br><br>Creatures are controlled through the stylus to move them around. They can dodge with a quick tap (DS) or a swing (Wii) and go into combat mode to lock on targets and attack. Next to regular attacks, the creature can dodge an incoming attack and a bite icon appears. Quickly select it and the next attack will be much stronger. Some monsters have special abilities, activated by tapping the sonar icon in the bottom left corner when it becomes visible. This allows them to swim stealthily, dig, break rocks or jump.<br><br>The creature's status is tracked through three parameters: health (hunger), stamina and oxygen. Health and stamina can be replenished by eating small creatures, while oxygen requires a regular trip to the surface. Creatures cannot dive deeper than fifty feet underwater. The bottom screen shows a large sonar. Dangerous monsters are bright red spots, food is green, collectible fossils are yellow (used to unlock new monsters) and portals are blue. Some fossils can only be found by defeating monsters or by completing challenges. Through their abilities, new monsters get access to new areas in the open sea, which serves as a hub. There are also a few wildcard fossils to move on to unlock any monster.<br><br>The Wii and DS version are almost completely identical, but the Wii version also contains a multiplayer mode where players can race against friends in five different challenge zones.",
  "publishedBy": "Destination Software, Inc.",
  "developedBy": "Atomic Planet Entertainment Limited",
  "released": "Oct 26, 2007",
  "alsoFor": "PlayStation 2, Wii | Combined View",
  "genre": "Action, Educational",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/sea-monsters-a-prehistoric-adventure",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Destination Software, Inc.",
          "developer": "Atomic Planet Entertainment Limited",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 26, 2007",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "White Park Bay Software Ltd",
          "developer": "Atomic Planet Entertainment Limited",
          "ported": "",
          "country": " France",
          "releaseDate": "Feb 22, 2008",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1046680-sea-monsters-a-prehistoric-adventure-nintendo-ds-screenshot.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/1046695-sea-monsters-a-prehistoric-adventure-nintendo-ds-screenshot.png",
      "caption": "Game start"
    },
    {
      "link": "/images/shots/l/1046696-sea-monsters-a-prehistoric-adventure-nintendo-ds-screenshot.png",
      "caption": "Touch a collected fossil piece to reveal an interesting fact"
    },
    {
      "link": "/images/shots/l/1046697-sea-monsters-a-prehistoric-adventure-nintendo-ds-screenshot.png",
      "caption": "Pause Menu"
    },
    {
      "link": "/images/shots/l/1046698-sea-monsters-a-prehistoric-adventure-nintendo-ds-screenshot.png",
      "caption": "Game Over"
    }
  ],
  "cover": []
}