{
  "name": "Sigma Harmonics",
  "shortName": "sigma-harmonics",
  "description": "Sigma is the teenage son of the wealthy Kurogami family. Though they are known to the public merely as the founders of a business empire, the Kurogamis have a secret. In their mansion in Tokyo, the Great Clock seals away evil spirits known as <i>ouma</i>, and the Kurogami family uses their sound magic to guard the clock. One day, however, the Great Clock's barrier is broken, allowing the <i>ouma</i> to escape. Able to travel through time, the <i>ouma</i> have gone back 50 years in the past and caused devastation to the Kurogami clan by instigating a series of murders, thus changing the family's situation in the present day. Sigma and his best friend, Neon Tsukiyumi, learn that if they can solve all the murder cases throughout all affected timelines, they can defeat the Greater <i>Ouma</i> and revert the timeline to normal.<br><br>The player controls both Sigma and Neon and uses the powers of both of them in different ways. In Sigma's gameplay segments, players use his sound magic to discover &quot;soul shadows&quot; that can replay events from the past. Sigma can then capture soundbites that are relevant to the murder mystery, and use them to try to properly deduce how the murders occurred. If Sigma does not reach the correct conclusions, the game continues, but the more wrong he is, the more difficult Neon's gameplay segment will be.<br><br>Neon is the one who handles combat, including the chapter bosses that are summoned after Sigma concludes his deductions. Neon can summon spirits and allow them to possess her, gaining different skills from each type of spirit. Battles take place in real time, and involve the player choosing skills to use from three decks of cards, which are each set on an individual timer. The available cards are determined through the current battle theme music, which the player-as-Sigma can choose. ",
  "publishedBy": "Square Enix Co., Ltd.",
  "developedBy": "Think Garage Co., Ltd.",
  "released": "Aug 21, 2008",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/sigma-harmonics",
  "visual": "",
  "gamePlay": "Cards / tiles, Japanese-style RPG (JRPG)",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Square Enix Co., Ltd.",
          "developer": "Think Garage Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 21, 2008",
          "ean13": "4 988601 005647",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1046061-sigma-harmonics-nintendo-ds-screenshot-title-screen.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}