{
  "name": "Smart Kid's: Mega Game Mix",
  "shortName": "smart-kids-mega-game-mix",
  "description": "<h3>ufointeractivegames.com (from <a href=\"https://www.mobygames.com/game/smart-kids-mega-game-mix/adblurbs\">Ad Blurbs</a>)</h3><b>THE NATIONALLY RECOGNIZED AND AWARD WINNING SERIES IS BACK TO ENGAGE YOUR IMAGINATION!</b>\n<br><br>\nThe first and only developmentally appropriate game for the Nintendo DS, Smart Kids Mega Game Mix is a diverse title filled with a nice mix of fun, creative, and skill building games that feature young kid’s favorite themes.  This wholesome title is a must have for the youngest gamer, whose collection of games feature casual and learning play at various skill levels.  It’s like carrying around a chest full of toys and games, which the whole family can enjoy!\n<br><br><b>SMART KID&#39;S MEGA GAME MIX Key Features:</b><br><br>\n<ul>\n<li>Fun for Boys and Girls – An assortment of mini-games specifically designed with young boys and girls in mind. This title combines features found in Smart Boy&#39;s Gameroom 2 and Smart Girl&#39;s Playhouse 2. </li><br><br>\n<li>Wholesome, Skill Building Mini-Games – 36 mini-games designed to enhance your child’s creativity, hand eye coordination, shape recognition, talents and more, this title will keep your little one occupied for hours!\n</li><br><br>\n<li>Voice Recording Function - Aimed at parents, you can record two messages directly into the game so when your children do well in an activity, a familiar voice will congratulate them on their accomplishment, building positive reinforcement and encouragement.</li><br><br>\n<li>Entry Point/Age Appropriate – Perfectly designed with the youngest gamers in mind, our title delivers on providing a fun, safe and creative environment that discerning parents, aunts, uncles and grandparents will approve of.  We are committed to providing a game that kids will love that also appeals to parents, who are looking for a positive entry point into the videogame market which is overflowing with inappropriate and sometime violent content.  </li><br><br>\n<li>Ease of Use with the DS – Using the unique features of the DS, your child can interact with the games using the stylus or their fingers, actively engaging and incorporating them into the world of learning and fun, either independently or with parental guidance.  The difficulty adjusts as your child improves, allowing the game to grow with your child. </li>\n</ul>",
  "publishedBy": "UFO Interactive Games, Inc.",
  "developedBy": "Starfish Kaihatsu Ltd.",
  "released": "Sep 29, 2009",
  "alsoFor": "",
  "genre": "Educational, Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/smart-kids-mega-game-mix",
  "visual": "",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "UFO Interactive Games, Inc.",
          "developer": "Starfish Kaihatsu Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 29, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1042858-smart-kid-s-mega-game-mix-nintendo-ds-screenshot-title-screen.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}