{
  "name": "Smart Girl's Playhouse Party",
  "shortName": "smart-girls-playhouse-party",
  "description": "<h3>http://ufointeractivegames.com (from <a href=\"https://www.mobygames.com/game/smart-girls-playhouse-party/adblurbs\">Ad Blurbs</a>)</h3><b>THE NATIONALLY RECOGNIZED AND AWARD WINNING SERIES IS NOW AVAILABLE IN ONE NEAT PACKAGE!</b><br><br>The first and only developmentally appropriate games for the Nintendo DS comes together in one compilation, offering young girls the chance to play all three award winning versions in one neat package. This wholesome title is filled with a diverse mix of fun, creative and skill building games that allows for causal learning play at all skill levels.\n<p>\n<br><br><br>\n<b>Smart Girl&#39;s Playhouse Party Key Features:</b>\n<p><br><br><ul>\n<li>\nFun for Girls – An assortment of mini-games specifically designed with young girls in mind. \n</li>\n<br><br><br><li>\nWholesome, Skill Building Mini-Games – With a combined total of 38 mini-games designed to enhance your child’s creativity, hand eye coordination, shape recognition, talents and more, this title will keep your little one occupied for hours!\n</li>\n<br><br><br><li>\nEntry Point/Age Appropriate – Perfectly designed with the youngest gamers in mind, our titles delivers on providing a fun, safe and creative environment that discerning parents, aunts, uncles and grandparents will approve of.  We are committed to providing a game that kids will love that also appeals to parents, who are looking for a positive entry point into the videogame market which is overflowing with inappropriate and sometimes violent content.  \n</li>\n<br><br><br><li>\nEase of Use with the DS – Using the unique features of the DS, your child can interact with the games using the stylus or their fingers, actively engaging and incorporating them into the world of learning and fun, either independently or with parental guidance.  The difficulty adjusts as your child improves, allowing the game to grow with your child. \n</li>\n<br><br><br><li>\nSimple and Engaging – With no complicated directions or video game functions to learn, your child can jump right in as soon as the package is opened.\n</li>\n</ul>",
  "publishedBy": "UFO Interactive Games, Inc.",
  "developedBy": "Starfish Kaihatsu Ltd.",
  "released": "Oct 19, 2010",
  "alsoFor": "",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/smart-girls-playhouse-party",
  "visual": "",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "UFO Interactive Games, Inc.",
          "developer": "Starfish Kaihatsu Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 19, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1042871-smart-girl-s-playhouse-party-nintendo-ds-screenshot-title.png",
      "caption": "Title screen / Game selection"
    }
  ],
  "cover": []
}