{
  "name": "Spac3 Invaders Extr3me 2",
  "shortName": "spac3-invaders-extr3me-2",
  "description": "<i>Space Invaders Extreme 2</i> is the follow-up/remix of the gameplay formula created in the original <a href=\"https://www.mobygames.com/game/nintendo-ds/spac3-invaders-extr3me\">Space Invaders Extreme</a>, but adding a few new features, some of which make specific use of the dual-screen qualities of the Nintendo DS as this title, unlike the first game, appears only on this system.<br><br>Like the first game, <i>Space Invaders Extreme 2</i> is a hectic modern revision of the classic <a href=\"https://www.mobygames.com/game/atari-2600/space-invaders________\">Space Invaders</a> formula.  A single cannon on the bottom of the screen moving left and right fires up against the flying alien invaders filling all areas of the screen.  Invaders appear in four colors and a neutral (white) color, with each color dropping a special weapon when four are destroyed in a row.  The weapons are identical to the previous game--the blue laser, the green spread shot, the red bomb, and the black shield.  The Roulette feature returns, and is now activated by destroying four black enemies and then four green ones.  A Roulette UFO will fly by and must be destroyed to activate the Roulette mini-game, which operates the same as the previous title.  The signature wild colors, electronic-style music, and energetic animated backgrounds return with new styles and animations.  Branching levels of varying difficulty also remain, but not on the Beginner difficulty.<br><br>Also like the previous game on the Nintendo DS, where gameplay occurred entirely on the bottom screen, <i>Extreme 2's</i> primary gameplay also occurs on the bottom screen.  However now, gameplay will often continue to the upper screen during boss battles and bonus Rounds.  Shooting a flashing UFO will cause the upper screen expand as a special event &quot;Round&quot; with various other attacking Invaders.  Successfully destroying all of these induces Fever Time, which supercharges the weapon and causes destroyed Invaders to drop yellow blocks worth large amounts of bonus points.  Essentially, bonus rounds activate in real-time and in the top screen rather than transitioning to a Bonus Round separate from the main game like the first <i>Space Invaders Extreme</i>.<br><br>A major new feature is a BINGO panel which operates like a Bingo game or Tic-Tac-Toe.  It is a 3x3 grid of colored boxes, each with another box inside.  The outer boxes are colored vertical columns of red, green, and blue, and the inner boxes are horizontal rows of the same colors.  Getting three panels lit up in a row vertically, horizontally, or diagonally activates Super Fever Time.  The panels are lit up completing Power-up Features, which involves destroying four enemies of a certain color in a row, then four others in a row of a different color.  For instance, one panel will be lit up by destroying four red enemies, then four blue enemies.  The first four destroyed light the outer box, the second four, the inner box.  <br><br>Time Attack Mode and VS Play have also been added to the game.  VS Play can be local, over the Wi-Fi connection, with Friends or against anyone, or locally with a single DS card using Download Play.  Fever items, Super Features, and Boss encounters remain a part of the gameplay in VS Mode.  Both players play against the same Invader formations, in a game of he-who-dies-last-wins.  Each player will see their gameplay on the bottom screen, and their opponent's on the top screen.  Handicaps can be set for more advanced players.\n",
  "publishedBy": "Square Enix, Inc.",
  "developedBy": "Project Just",
  "released": "Oct 20, 2009",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/spac3-invaders-extr3me-2",
  "visual": "",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Taito Corporation",
          "developer": "Project Just",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 26, 2009",
          "ean13": "4 988611 208182",
          "comments": ""
        },
        {
          "publisher": "Square Enix Ltd",
          "developer": "Taito Corporation",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Oct 02, 2009",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Square Enix, Inc.",
          "developer": "Project Just",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 20, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/235137-spac3-invaders-extr3me-2-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "United States",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/235138-spac3-invaders-extr3me-2-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "United States",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/235139-spac3-invaders-extr3me-2-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United States",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/468641-spac3-invaders-extr3me-2-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/468638-spac3-invaders-extr3me-2-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/468640-spac3-invaders-extr3me-2-nintendo-ds-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "DS Case",
      "country": "United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/468639-spac3-invaders-extr3me-2-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United Kingdom",
      "platforms": "Nintendo DS"
    }
  ]
}