{
  "name": "SpongeBob's Truth or Square",
  "shortName": "spongebobs-truth-or-square_",
  "description": "The Nintendo DS adaptation of SpongeBob's Truth or Square (based on the 2009 direct-to-TV movie of the same name) plays similarly to its home console cousins, except that gameplay is offered the same treatment as previous SpongeBob games developed by Altron.<br><br>After losing the secret Krabby Patty formula due to the excitement of celebrating the Krusty Krab's 'eleventy-seventh' anniversary, Spongebob must travel back to his Memory Lane (filled with some his most happiest moments ever including jellyfishing with Patrick, meeting Santa Claus and even meeting Sandy for the first time) along with an unlikely alliance from Plankton (who of course wants to keep the formula for himself) to become the happiest sponge that Bikini Bottom has ever known.<br><br>The gameplay takes a platforming approach where players need to help Spongebob reach the exit of each level, defeating a multitude of Plankton's menacing robots along the way. Spongebob has three types of attacks at his disposal: Puck Attack (which allows him to fire pucks at faraway switches and enemies from a distance), Spin Attack (allows Spongebob to directly attack enemies, as well as turning cranking mechanisms) and Hammer Attack (allows Spongebob to hit ground switches and defeat robots). The Nintendo DS stylus can also be utilised to carry out these attacks (hold and aim to use the Puck Attack, draw large circles around Spongebob to spin and tap anywhere to perform a Hammer Attack). The console's in-built microphone is also used to blow giant bubbles to make SpongeBob reach further heights, as well as clearing off volcano steam.<br><br>Levels also include Character Switches (power up disks which allows the player to briefly transform into one of Spongebob's buddies in order to activate a certain switch, such as Patrick who uses Spongebob as a mallet).<br><br>The levels include a variety of Happy Tokens (which are recorded on a bar on the Top Screen). Collecting a large number of these turns Spongebob into a muscular version of himself (SpongeBuff), making him more stronger. Happy Tokens can be used to purchase minigames, music tracks and even photo artwork from a Sales Fish (who can be found in Spongebob's home).<br><br>Spongebob's house (the central hub of the game) also has several functions: Play minigames by tapping the Jellyfish Net at the house door, touch the Stereo to access the Sound Test (in which additional music and sound effects are later added as you progress throughout the story), touch the photos near the Sales Fish to view awesome snapshots from the SpongeBob SquarePants cartoon, touch the bed to save your progress and even play multiplayer games by tapping the Conch Phone. The house can also be decorated by collecting several Happy Items (treasures found within bonus levels) throughout the levels.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Altron Corporation",
  "released": "Oct 26, 2009",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/spongebobs-truth-or-square_",
  "visual": "",
  "gamePlay": "Mini-games, Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Altron Corporation",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 26, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/368461-spongebob-s-truth-or-square-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/368462-spongebob-s-truth-or-square-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/368470-spongebob-s-truth-or-square-nintendo-ds-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/368469-spongebob-s-truth-or-square-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/368466-spongebob-s-truth-or-square-nintendo-ds-manual.jpg",
      "scanOf": "Manual",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/368467-spongebob-s-truth-or-square-nintendo-ds-manual.jpg",
      "scanOf": "Manual",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/368468-spongebob-s-truth-or-square-nintendo-ds-advertisement.jpg",
      "scanOf": "Advertisement",
      "packaging": "DS Case",
      "country": "Ireland  and United Kingdom",
      "platforms": "Nintendo DS"
    }
  ]
}