{
  "name": "Summon Night 2",
  "shortName": "summon-night-2",
  "description": "The sequel to the turn-based strategy RPG <a href=\"https://www.mobygames.com/game/summon-night\">Summon Night</a> continues a few years after the events of the original game. Summoners are now a much more common occurrence, and you now get casted as either a male or female apprentice summoner out to finish his/her training.<br><br>Besides your starting character (who defines the path you will take in the game) you also get a sidekick right from the start, and you get to choose a guardian creature that will further define your character's abilities and influence the dialogue choices you get to make.<br><br>Gameplay is the same as in the original, with a free-roaming &quot;world-map&quot; mode in which you explore towns and chat with NPCs for items and quests and a battle mode in which you are placed in an isometric tile-based map from which you issue orders to your character and all allies, and attempt to destroy your enemies by using your weapons or the magical abilities of the creatures you can summon into the battlefield.<br><br>The Nintendo DS release adds a quicksave feature and a dialogue back-log, the &quot;Summon Communication&quot; feature from the DS port of <a href=\"https://www.mobygames.com/game/summon-night\">the first game</a>, and a handful of new items and spells.",
  "publishedBy": "Namco Bandai Games Inc.",
  "developedBy": "Flight-Plan Inc.",
  "released": "Aug 07, 2008",
  "alsoFor": "PlayStation, PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/summon-night-2",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Namco Bandai Games Inc.",
          "developer": "Flight-Plan Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 07, 2008",
          "ean13": "4 582224 499076",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}