{
  "name": "Tecmo Bowl Kickoff",
  "shortName": "tecmo-bowl-kickoff",
  "description": "<i>Tecmo Bowl Kickoff</i> is a remake of the classic <a href=\"https://www.mobygames.com/search/quick?gamegroup=Tecmo+Super+Bowl+series\">NES titles</a> of the early 90's and features a no-holds barred style of football. It also features cinematic animations for certain events during a game such as punts, field goals, interceptions, QB sacks, touchdowns, etc.  Though it does not feature any license of professional teams or logos, it does model itself after the NFL with two conferences, the Wildcats Tecmo Conference (WTC) and the Bulldogs Tecmo Conference (BTC), with four divisions a piece (North, South, East &amp; West).<br><br>Players can also edit their teams including their name, uniforms, team colors, team logos, playbook and stats for their players.  They can also keep extensive stat track through five entire seasons of play of not only team stats but by individual player stats as well.<br><br>There are five different modes to choose from:<br><br><i>Quick Game</i> automatically sets up a game using their favorite team selected through their profile and a randomly selected opponent using default game options.  These options can be changed for time (3, 5, 10 &amp; 15 minutes) and whether the 2-minute warning will be on or off.<br><br><i>Season Mode</i> lets the player compete in a 17 week season in an attempt to win the Tecmo Bowl Championship and unlock bonus items to edit their teams and players.  In season mode the player can edit their players and trade them to other teams and view standings, records and league leaders.  Players can also choose to watch games or simulate them and view the results.<br><br><i>Preseason</i> is similar to the quick play, but allows the player to pick their opponents and choose the weather conditions of the game.<br><br><i>All-Star Bowl</i> lets the player choose from various pre-set and customized players in an All-Star game consisting of the two main conferences (WTC and BTC) and lets the player choose their weather conditions for the game.<br><br><i>Multi-play</i> lets friends compete head-to-head in a quick match using their favorite teams under conditions of the host or trade customized players or even customized teams.<br><br>The controls consist of both styles of D-Pad and the Stylus pen.  In offensive mode the player uses the D-Pad to move their player, the &quot;A&quot; button to snap the ball, choose different receiving targets, kickoffs and scuffles (where the player repeatedly presses the button to escape from opposing players trying to tackle them).  The &quot;B&quot; button is used to throw to receivers.  Likewise for the Stylus pen, the player taps and holds the screen to move their player and tapping and sliding the pen back and forth to scuffle.  To snap the ball, punt or kick a field goal the player taps the screen or tap receivers to change which they want to choose from and click the arrow button to pass the ball.<br><br>In defense, the player uses the &quot;A&quot; button to change players (can only be done before a play and can't be used during the play itself) or can be used to scuffle.  The &quot;B&quot; button is used to perform a diving tackle at a player in an attempt to stop quarterbacks, receivers, etc.  To use the Stylus pen, the player taps and holds the pen to move the player or tap other players to choose another.  To scuffle the player taps the screen and slides back and forth.<br><br>To select both offensive and defensive plays, the player can either use the Stylus pen to select from eight different plays (four for run plays and four for passing plays) or use the D-Pad in a combination with the &quot;A&quot; button for the run plays or the D-Pad and the &quot;B&quot; button for the passing plays.  Additionally, the player can use the &quot;X&quot; button to bring up punts and field goals options.<br><br>There are also &quot;Super Skills&quot; that can be obtained through the season mode depending upon how well they perform during the season.  When a player is falling behind late in a game, a selected player will have a ring of fire below them to indicate a certain &quot;Super Skill&quot; to even the playing field.  They consist of:\n<ul><li><i>Rocket Pass</i></li>: faster passing with increased catching.\n<li><i>Hot Potato</i></li>: a quick pass to a player close by.\n<li><i>Sack Evasion</i></li>: avoids sacks easier.\n<li><i>In the Zone</i></li>: where the selected team skills and attributes are raised.\n<li><i>Vertical Boost</i></li>: receivers can jump higher\n<li><i>Divine Save</i></li>: receivers can catch balls easier.\n<li><i>DB Deception</i></li>: gives the player ability to elude defensive backs easier.\n<li><i>Tug Boat</i></li>: lets the player gain extra yards while being tackled.\n<li><i>Power Run</i></li>: throws off the first tackler while dragging the second for extra yardage.\n<li><i>Lightning Dodge</i></li>: ability to run into the break path.\n<li><i>Super Juke</i></li>: lets the player fake two defenders easily.\n<li><i>Double Cutback</i></li>: makes a quick move in two different directions to throw off tacklers.</ul>",
  "publishedBy": "Tecmo, Inc.",
  "developedBy": "Polygon Magic, Inc.",
  "released": "Nov 18, 2008",
  "alsoFor": "",
  "genre": "Action, Sports",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/tecmo-bowl-kickoff",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Tecmo, Inc.",
          "developer": "Polygon Magic, Inc.",
          "ported": "",
          "country": " United States, Canada",
          "releaseDate": "Nov 18, 2008",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/138355-tecmo-bowl-kickoff-nintendo-ds-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "United States  and Canada",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/138353-tecmo-bowl-kickoff-nintendo-ds-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "United States  and Canada",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/138354-tecmo-bowl-kickoff-nintendo-ds-media.png",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United States  and Canada",
      "platforms": "Nintendo DS"
    }
  ]
}