{
  "name": "Telly Addicts",
  "shortName": "telly-addicts",
  "description": "<i>Telly Addicts</i> is a game for one or two people based on the UK TV series of the same name that was aired in the mid to late 1980's. The game follows the format of the television series in that there are six rounds of multiple choice questions all of which are based on old television programs, each correctly answered question scores a point and in the multiplayer game the player with the most points wins. The rounds in the game are:<ul>\n<li>Screen Test - Here the player is presented with six TV screens from which they must select three. After each selection a picture is revealed and an associated TV trivia question is asked.\n</li><li>Classic Clips - This shows a short video excerpt from a television program after which three related questions are asked.\n</li><li>Spotlight Round - here we have five questions which must all be answered within ten seconds\n</li><li>Reveal Round - This starts with a grainy picture that gradually becomes clearer, the clearer the tincture, however, the fewer points are scored.\n</li><li>Guess The Year - The player is shown a picture and is asked a question such as &quot;When did  this first appear on TV?&quot;, as an aid they are given the decade and just need to select the appropriate year. This is then followed by a couple of related trivia questions.\n</li><li>Randomiser - A spinner selects a category and the player must answer a related question.</li></ul>The game features the original presenter, <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,793631/\">Noel Edmonds</a> who introduces each round and each question and, of course, clips and pictures from many UK and US TV shows.<br><br>",
  "publishedBy": "Ubisoft Entertainment SA",
  "developedBy": "Route 1 Games",
  "released": "Nov 02, 2007",
  "alsoFor": "PlayStation 2, PSP, Wii | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/telly-addicts",
  "visual": "",
  "gamePlay": "Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Ubisoft Entertainment SA",
          "developer": "Route 1 Games",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Nov 02, 2007",
          "ean13": "3 307210 334930",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}