{
  "name": "Thrillville: Off the Rails",
  "shortName": "thrillville-off-the-rails_",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/thrillville-off-the-rails_/adblurbs\">Ad Blurbs</a>)</h3><br><br><p style=\"margin-top: 0\">\n      Thrillville: Off the Rails lives up to its name with 20 death-defying \n      rides so outrageous, they inspire the same word from every park visitor \n      who sees them: &quot;WHOA!&quot; Players build these incredible &quot;WHOA Coasters&quot; to \n      leap from one track to another, launch through the air like cannonballs, \n      blast through a burning rings of fire and more.\n    </p>\n    <p>\n      But the new fun doesn't stop there. Off the Rails features 34 playable \n      multiplayer minigames, 15 all-new theme areas, over 40 thrill rides, a \n      new story that ties together more than 100 missions, and social \n      interaction with park guest that's better than ever. The in-depth \n      conversations both advance the plot and suggest better ways to manage \n      the park. But is every guest to be trusted?\n    </p>\n\t\t\t\t\t\t\t\t\t\t\t <ul>\n      <li>\n        An entirely unique version built from the ground up to take full \n        advantage of the Nintendo DS touch-screen capabilities.\n      </li>\n      <li>\n        Use the stylus in innovative ways to develop roller coasters with the \n        flick of your wrist.\n      </li>\n      <li>\n        Play one of the 7 new minigames designed specifically for the Nintendo \n        DS:\n      </li>\n    </ul>\n    <ol>\n      <li>\n        Air Hockey - Use the stylus to move your paddle and knock the puck \n        into the other player's goal zone!\n      </li>\n      <li>\n        Donkey Derby - Use the stylus to shoot the balls into the holes. Score \n        three balls in a row and you'll have the option to block an opponent \n        or give yourself a boost! The more you score, the further your donkey \n        will travel!\n      </li>\n      <li>\n        Frantic Fishing - Use the stylus to drag and sort the colored fish \n        into their respective water tanks. Drag the rainbow-colored fish in \n        any tank to score big points!\n      </li>\n      <li>\n        Sparkle Pop - Use the stylus to throw darts at the balloons on the top \n        screen! Hit Usagi-san for big points!\n      </li>\n      <li>\n        Thrill Hoopz - Use the stylus to drag and throw the ball into the \n        Hoopz to score. Get the Gold balls into the net for big points!\n      </li>\n      <li>\n        Putt-A-Hole - Use the stylus to align the putter and then putt the \n        ball into the hole for a hole-in-one! Pink balls are worth big points!\n      </li>\n      <li>\n        Whack-a-Wombat - Use the stylus to whack the wombats. But beware of \n        the Evil Platypuses! They'll cost you points if you accidentally hit \n        them!\n      </li>\n    </ol>\n    <p>\n      \n    </p>\n    <p>\n      \n    </p>\n    <p>\n       \n    </p>",
  "publishedBy": "LucasArts",
  "developedBy": "DC Studios, Inc.",
  "released": "Oct 16, 2007",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/thrillville-off-the-rails_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "LucasArts",
          "developer": "DC Studios, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 16, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}