{
  "name": "TMNT",
  "shortName": "tmnt__",
  "description": "<i>TMNT</i> for PSP and Nintendo DS is an action game based on the 2007 animated film of the same name. The game's story loosely follows the plot of the movie, in which the four Ninja Turtles have grown apart and must now reunite to combat a new threat to New York. Images and clips (on the PSP only) from the film are used to illustrate the story between levels.<br><br>The game consists of 15 stages. In each, the player controls a specific turtle. The game is primarily a platformer, in which the turtles run and jump across rooftops and other environments to get to the end of the level. Jumping works by moving to a glowing hot spot and then pressing one of three buttons that launch a jump to the front, the left or the right (relative to the screen), corresponding to the goal spot. Jumps succeed automatically if the right button is used. Some situations where there are downward slides, ropes to swing on, or walls to climb require pressing a fourth button to charge the jump. Occasionally, another turtle will appear in a level and must be caught up to in a time limit. If successful, he hurls his brother further along the level which gains him a Family Bond. This can be used in the fight sequences of the game, which include fights against a number of goons as well as boss battles. In these, the turtles can use basic attacks, blocks, and various more powerful moves like a swing attack and a powerful charging move. The Family Bonds are used to summon another turtle for extra attacks.<br><br>Upon completion of a level, the player is awarded medals for completing goals. These include finishing the level in a short time, collecting all four of the letters T-M-N-T, gaining the Family Bonds and performing jump chains. Chains are created if the hot spot jumps are performed in quick succession. Getting all gold medals in a level unlocks bonuses. Levels can be replayed to improve the performance.<br><br>The game also includes a multiplayer component, in which players race each other across a level to see who can get to the end the fastest.",
  "publishedBy": "Ubisoft, Inc.",
  "developedBy": "Ubisoft Quebec City Studio",
  "released": "Mar 20, 2007",
  "alsoFor": "PSP | Combined View",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/tmnt__",
  "visual": "",
  "gamePlay": "Fighting, Platform",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Ubisoft, Inc.",
          "developer": "Ubisoft Quebec City Studio",
          "ported": "",
          "country": " United States",
          "releaseDate": "Mar 20, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1044711-tmnt-nintendo-ds-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/1044713-tmnt-nintendo-ds-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/1044714-tmnt-nintendo-ds-screenshot-options.png",
      "caption": "Options"
    },
    {
      "link": "/images/shots/l/1044715-tmnt-nintendo-ds-screenshot-map.png",
      "caption": "Map"
    },
    {
      "link": "/images/shots/l/1044716-tmnt-nintendo-ds-screenshot-master-splinter.png",
      "caption": "Master Splinter"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/650301-tmnt-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United States",
      "platforms": "Nintendo DS"
    }
  ]
}