{
  "name": "Tomodachi Collection",
  "shortName": "tomodachi-collection",
  "description": "<i>Tomodachi Collection</i> is a simulation game sharing many similarities with <a href=\"https://www.mobygames.com/search/quick?game=The+Sims\">The Sims</a> and <a href=\"https://www.mobygames.com/game/animal-crossing\">Animal Crossing</a>. The featured protagonist happens to be your own personally designed Mii interacting with several Miis that populate the city. The population of Miis cohabiting the city are either friends you collected by entering their friend codes, or randomly generated characters courtesy of the computer. Fortunately, the game allows easy transfer of all your friend Miis from the Wii to your Nintendo DS. <br><br>The object of the game is to simply live your virtual life. The game encourages you to make new friends and rewards each friend collected with new gifts and accessories like clothes, foods, and other special items that can be traded. The Miis can wander around having fun or stick to a routine of everyday tasks and errands. Completing tasks can earn money and open up new facilities for the player to interact with. Tomodachi Collection follows several calendar holidays, and additionally also has many special events like concerts, karaoke concerts, and gatherings. <br><br>",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Nintendo SPD",
  "released": "Jun 18, 2009",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/tomodachi-collection",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Nintendo SPD",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 18, 2009",
          "ean13": "4 902370 517804",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}