{
  "name": "TrackMania DS",
  "shortName": "trackmania-ds",
  "description": "The <i>TrackMania</i> series is now going portable with this Nintendo DS release.<br><br>Race with over 100 tracks by yourself or with your friends. The new modes exclusive to the game are Platform, in which you must navigate through complex levels without using too many retries, and Puzzle, in which you must create your own map with checkpoints and a limited number of building blocks to connect the pieces, and race to the finish, while the Race mode is left intact. The game includes three environments to race: Desert (the environment used in TrackMania Original), Rally, and Stadium (the environment used in TrackMania Nations).<br><br>Instead of complex racing simulators where you have to measure a correct speed to turn through narrow roads, this is an arcade-style racing game with high speeds (over 400 km/h!) and simple controls. All you have is accelerate, brake, horn and that's it! Of course, like it's PC counterparts, you can freely reset the track if you fall of the track, or if you want a better medal. There are three types of medals: bronze, silver and gold. You can either race with AI opponents or race by yourself. The main objective is to get to the finish line as fast as possible. The target time is given to you at the beginning of every track, depending on for which medal you are racing.<br><br>The game also includes a built-in map editor, which allows you to create a custom map with your stylus.",
  "publishedBy": "Atlus U.S.A., Inc.",
  "developedBy": "Firebrand Games and Entertainment Ltd., Nadeo SAS",
  "released": "Mar 17, 2009",
  "alsoFor": "",
  "genre": "Racing / driving",
  "perspective": "1st-person, Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/trackmania-ds",
  "visual": "",
  "gamePlay": "Puzzle elements, Tricks / stunts",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Focus Home Interactive SAS",
          "developer": "Firebrand Games and Entertainment Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Nov 14, 2008",
          "ean13": "3 512289 015493",
          "comments": ""
        },
        {
          "publisher": "Atlus U.S.A., Inc.",
          "developer": "Firebrand Games and Entertainment Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Mar 17, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}