{
  "name": "Tropix!",
  "shortName": "tropix",
  "description": "<i>Tropix!</i> is a unique blend of eleven different games, all set within a sunny island paradise. The game combines  many classic gameplay ideas in one title, delivering a large amount of variety and keeps the game experience fresh.<br><br>The eleven games are all linked to a central theme - collecting sand dollars to enable you to travel to new islands, buy toys and food for your Tamagotchi-style monkey, and unlock even more games to play.<br><br>Each mini game offers the player a different gameplay experience. These are some of them: <br><br>Puffer Popper<br>\nWith help from Crab the player must defend the sand castle by destroying bubbles as they snake towards the beach. <br><br>A classic and instantly playable concept, Puffer Popper requires the player to connect three bubbles of the same colour to win. Use the left and right joystick or directional pad to aim the beam, and press the action button to fire a bubble. <br><br>The game can be increased in difficulty through the addition of multiple Puffer fish and by potentially removing the players aiming beam. <br><br>Jungle Jump<br>\nJungle jump is a game of timing and skill. Use the left and right buttons on the joystick or directional pad to guide the Monkey through increasingly difficult jungle levels. <br><br>\nShell Game<br>\nThe shell game is both a game of skill and observation coupled with a way to win more Sand Dollars. Conceptually the Shell Game is extremely simple: three shells that swap, the user must pick the shell that hides the pearl.<br><br>Due to the high expense of certain shop items and the cost of purchasing new islands, the user can use the Shell Game to win the Sand Dollars required to make these large purchases. <br><br>Sandoku<br>\nThe classic favorite Sudoku makes the transition to Tropix effectively, with intuitive play.<br><br>Cascade<br>\nCascade is a casual concept. The game is a variation on the classic objective of connecting three of a kind. This type of game can be controlled exclusively via the joystick or directional pad with the addition of the action button to make selections. <br><br>The overall design is about linking these mini-games into a &quot;world&quot; where you buy things, look after a creature, travel around and explore. For casual gamers, Tropix is simple to play, and can be played in short bites or in long sessions.\n",
  "publishedBy": "RealArcade",
  "developedBy": "Robot Super Brain, LLC",
  "released": "Nov 04, 2008",
  "alsoFor": "Windows | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/tropix",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "RealArcade",
          "developer": "Robot Super Brain, LLC",
          "ported": "Engine Software B.V.",
          "country": " United States",
          "releaseDate": "Nov 04, 2008",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/544839-tropix-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "United States",
      "platforms": "Nintendo DS"
    }
  ]
}