{
  "name": "Vinter i Blåfjell",
  "shortName": "vinter-i-blfjell",
  "description": "<i>Vinter i Blåfjell</i> is a platform game based on the author <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,773979/\">Gudny Ingebjørg Hagen’s</a> Nisse universe that was made famous by the advent calendar series on public service TV station NRK in Norway. <br><br>The player takes on the role of the blue Nisse girl Turte who, together with her brother Twin, discovers that a Nisse girl with a red hat is hiding out in Blue Mountain. The ancient rule of Blue Mountain says: “A blue Nisse who takes a red Nisse into Blue Mountain must leave Blue Mountain and never come back”. So all the other blue Nisses, and especially Blue Mother and Blue Father, are horror-struck when Turte and Twin introduce the girl with the red hat. To get the blue Nisses to understand that all hat colours are just as good, the wise ruler Queen Mountain Rose asks to have a new Christmas cape made in a completely new colour - a blue colour with a bit of red in it. To create this they will need to collect red and blue berries that are spread across the levels in the game.<br><br>The platform elements are combined with collecting items, avoiding hazards and sometimes solve small environment based puzzles, for instance pulling a lever to get a platform to move.",
  "publishedBy": "PAN Vision AB",
  "developedBy": "Ravn Studio AS",
  "released": "Nov 11, 2011",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/vinter-i-blfjell",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "PAN Vision AB",
          "developer": "Ravn Studio AS",
          "ported": "",
          "country": " Norway",
          "releaseDate": "Nov 11, 2011",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/328282-vinter-i-blafjell-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Promotional",
      "country": "Norway",
      "platforms": "Nintendo DS"
    }
  ]
}