{
  "name": "WAS IST WAS: Versunkene Schätze - Das Abenteuerspiel",
  "shortName": "was-ist-was-versunkene-schtze-das-abenteuerspiel",
  "description": "A young kid arrives for a visit at his grandpa's castle, anticipating one of those grandparent visits that every kid loves to hate once reaching a certain age, especially if grandpa babbled something about a treasure hunt before and a cute present he's got ready for his grandchild. But this time it's different. Grandpa disappeared while treasure-hunting and left his grandchild with hints where and how to find him, so let the adventure begin.<br><br><i>WAS IST WAS: Lost Treasures</i> is the first in a series of educational video games by German publishing house Tessloff, aimed at reading children of seven years of age or above. The player starts the game by creating a boy or girl character, customizing its looks and naming it, and selecting the location of grandpa's castle on a map of Europe. After arriving in the castle one can freely roam the many rooms there, discovering in the process that he/she shall find his/her grandpa by travelling to 15 more or less famous locations all over the world, and solving the \nnumerous riddles there.<br><br>Not all of the playable locations are accessible right from the start, in fact the only one is the temple of Angkor Wat in the beginning. Before travelling there, however, the player has to earn a key card to gain access to a flying device which is done by successfully answering questions about the world region where the next target is located. Questions are not easy, so a visit to the castle's library may prove handy before trying to pass the knowledge test. <br><br>Travelling itself is designed as a little 3D action game where the player guides his flying device (a plane in the beginning) through an obstacle course, collecting fuel and money while doing so. Once having mastered the flight, the locations are designed as big isometric dungeons full of puzzles of all kinds waiting to be solved. At the end of each dungeon a master question is asked which, if answered correctly, will reveal the dungeon's trophy that can be collected and put in the home castle's treasure room. Every kind of dungeon puzzle solved can be trained in the castle later on, there's also a computer standing around there which gives access to a clothing shop holding new and fancier outfits for the player's character to buy and wear, or even new assets for improving the castle's look. <br><br>Besides the adventure mode described above, the game also offers its questionnaire gameplay stand-alone for one or two players.<br><br>\n",
  "publishedBy": "Tessloff Verlag",
  "developedBy": "Kritzelkratz 3000 GmbH, Wortspielmacher",
  "released": "Nov, 2008",
  "alsoFor": "",
  "genre": "Action, Educational",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/was-ist-was-versunkene-schtze-das-abenteuerspiel",
  "visual": "Isometric",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Tessloff Verlag",
          "developer": "Kritzelkratz 3000 GmbH",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Nov, 2008",
          "ean13": "9 783788 629014",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/177938-was-ist-was-versunkene-schatze-das-abenteuerspiel-nintendo-ds-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/177939-was-ist-was-versunkene-schatze-das-abenteuerspiel-nintendo-ds-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    },
    {
      "link": "/images/covers/l/177940-was-ist-was-versunkene-schatze-das-abenteuerspiel-nintendo-ds-media.jpg",
      "scanOf": "Media",
      "packaging": "DS Case",
      "country": "Germany",
      "platforms": "Nintendo DS"
    }
  ]
}