{
  "name": "Where's Waldo? The Fantastic Journey",
  "shortName": "wheres-waldo-the-fantastic-journey",
  "description": "<i>The Fantastic Journey</i> is based on the famous Where's Waldo series of children's books, where the reader has to find Waldo, who is hidden in various pictures in the middle of hundreds of people.\nThe videogame is very faithful to the book, and contains of course some new gameplay mechanisms.<br><br><i>Where's Waldo?: The Fantastic Journey</i> is a puzzle-solving and hidden objects adventure game, where the player have to find twelve ancient scrolls hidden throughout twelve different worlds. In each of these worlds, the player has to examine hundreds of static and scrollable pictures, to find Waldo but also some other characters and objects that are displayed at the bottom of the screen.<br><br>During the adventure, the player will meet with some famous characters from the Where's Waldo universe such as Wizard Whitebeard, Wenda and Odlaw. Woof the dog is a precious companion which will be able to give hints to find some objects or characters if the player gets stuck.<br><br>In tradition with many hidden-objects games, <i>The Fantastic Journey</i> comes with a set of mini-games to complete between the casual levels. The game includes both a single-player mode as well as a two players versus mode, with a set of power-ups to enhance the player searches or to block in many ways those of the opponent.<br><br>",
  "publishedBy": "Ubisoft, Inc.",
  "developedBy": "Ludia, Inc.",
  "released": "Sep 22, 2009",
  "alsoFor": "iPad, iPhone, Macintosh, Wii, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/wheres-waldo-the-fantastic-journey",
  "visual": "",
  "gamePlay": "Hidden object",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "Ubisoft, Inc.",
          "developer": "Ludia, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 22, 2009",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/744717-where-s-waldo-the-fantastic-journey-nintendo-ds-screenshot.png",
      "caption": "Title/Menu screen."
    }
  ],
  "cover": []
}