{
  "name": "Winx Club: Magical Fairy Party",
  "shortName": "winx-club-magical-fairy-party",
  "description": "<h3>Nintendo.com Description (from <a href=\"https://www.mobygames.com/game/winx-club-magical-fairy-party/adblurbs\">Ad Blurbs</a>)</h3><p style=\"margin-top: 0\">\n      Winx Club: Magical Fairy Party lets you create your very own fairy and \n      join the Winx Club. Set in Alfea School for Fairies, the girls sign up \n      for the celebrations committee and plan, decorate, and put on some of \n      the best parties Alfea has ever seen!\n    </p><br><br><p style=\"margin-top: 0\">\n      Through a series of creative and casual mini-games set in the school, \n      you will learn and practice magical skills with Bloom, Stella, Flora, \n      and the rest of the Winx Club, as you prepare for each seasonally-themed \n      event. Along the way you’ll have opportunities to put your new magic \n      skills to work as you try to undo the trouble caused by the Trix, who \n      are trying to put a real damper on any party plans.\n    </p>\n    <p style=\"margin-top: 0\">\n      As a new student at Alfea, you’ll quickly befriend the Winx Club, \n      volunteering to help them on the parties committee. Along the way you \n      can transform into Believix gear to use your Magic in mini-games that’ll \n      help you prepare for the events. As the school year progresses, you’ll \n      join the girls to review how the last event went and decide together on \n      the next event’s theme and timing, culminating in an unforgettable, \n      end-of-year dance … designed by you! \n    </p>\n    <p>\n      <b>Features</b>\n    </p>\n    <p style=\"padding-left: 25.0px; margin-top: 0\">\n      • Join the Club – Create a fairy, enroll in Alfea, foster a pet, and \n      earn your spot in the Winx Club!• Plan Seasonal School Events – Help \n      the Winx Club fairies with the parties they are planning by gathering \n      and placing decorations, planning your outfit, and designing to a theme.• \n      Fashionable Fairies – Customize the look of your fairy with a whole host \n      of outfits, pets, hairstyles, wings, and more! These include school \n      clothes and party outfits, that can reflect any event theme, and unlock \n      throughout progression.• Magic Mini-Games – Transform into Believix \n      gear and use your magical powers to play exciting, replayable mini-games \n      that help in preparing for an event. • Horoscopes &amp; Birthdays – \n      Start play sessions with a horoscope-like affirmation and celebrate your \n      fairy’s birthday - and your own - in the game!• Unlockable \n      Rewards – Throughout the game, players earn new outfits, pets and \n      decorations!• Trouble-Making Trix – Icy, Stormy and Darcy are at it \n      again, and it’s up to you and your Magic to make sure the parties go off \n      without a hitch!• Story Cutscenes – Detailed cutscenes present key \n      story elements featuring the player’s character, the Winx Club fairies, \n      and other key characters helping with party themes and planning.\n    </p>\n    <p>\n      \n    </p>",
  "publishedBy": "D3Publisher of America, Inc.",
  "developedBy": "1st Playable Productions, LLC",
  "released": "Oct 30, 2012",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/winx-club-magical-fairy-party",
  "visual": "",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "D3Publisher of America, Inc.",
          "developer": "1st Playable Productions, LLC",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 30, 2012",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1043352-winx-club-magical-fairy-party-nintendo-ds-screenshot-title.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/1043353-winx-club-magical-fairy-party-nintendo-ds-screenshot-main.png",
      "caption": "Main menu"
    }
  ],
  "cover": []
}