{
  "name": "Witch's Wish",
  "shortName": "witchs-wish",
  "description": "<i>Witch's Wish</i> is a light RPG game about a girl named Vicky. She wants to become a witch, but she is poor and her town has been divided with a large wall to separate the poor and the rich. She cannot reach the magic school because it is in the rich part of town. One day she witnesses the arrest of the witch Tanya. She helps her escape and in exchange Tanya teaches her the basics of magic. Tanya is also looking for the legendary witch Agnes to seal all magic in the world as she believes it is not helpful to mankind. Through different chapters Vicky goes through a linear story where she learns new forms of magic, talks to other characters and helps out the fellow people in town using her magic.<br><br>Vicky mainly has to cast the right type of magic to further the story. If spells are cast on people or animals they almost always have a cartoony effect. The bottom of the screen shows Vicky from an almost top-down 3D view as she can freely be guided through the environment using the control pad. She can search and collect items and talk to characters using touch. The top part of the screen shows a view of the current location as well as the dialogues.<br><br>Magic is cast using a magic board on the bottom screen. There are five different spells based around elements such as earth, fire, thunder, water and wind with three levels each. After selecting a spell the player has to trace the specified symbols through multiple actions, followed by a circle with a time limit. This is similar in concept to the rune drawing of <a href=\"https://www.mobygames.com/game/doodle-hex\">Doodle Hex</a>. When done successfully, the spell is cast. When it fails, it can be tried again. She can participate in magic battles based on using the strengths and weaknesses of the five elements.",
  "publishedBy": "Natsume, Inc.",
  "developedBy": "Runforest, Inc.",
  "released": "May 25, 2010",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/witchs-wish",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "TRYFIRST Inc.",
          "developer": "Runforest, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 10, 2009",
          "ean13": "4 562227 660062",
          "comments": ""
        },
        {
          "publisher": "Natsume, Inc.",
          "developer": "Runforest, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "May 25, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}