{
  "name": "Youda Legend: The Curse of the Amsterdam Diamond",
  "shortName": "youda-legend-the-curse-of-the-amsterdam-diamond",
  "description": "A tourist arrives at the Netherlands capital, and after registering at the hotel sets out to explore the city, stumbling upon an ancient mystery waiting to be uncovered.<br><br><i>Youda Legend: The Curse of the Amsterdam Diamond</i> is a hidden puzzle game with a minimal plot, set in the Dutch capital of Amsterdam. Most of the time, the objective is to search and click on all the objects listed at the left side of the screen, on scenes filled with assorted paraphernalia placed discreetly around the scenery. As it often happens in this type of game, some of the objects found are bizarrely out of proportion, with giant pencils and other strange sights regularly appearing on the locations. Some of the collected items, or pieces of them, are stored inside the trunk at the bottom of the list, to be used later to solve a puzzle.<br><br>Mini-games appear between the hidden objects screens, where usually the player has to manipulate some mechanism directly to solve a puzzle. In some locations, the goal is to use the stored inventory objects on parts of the scenery, dragging and dropping them from the tray at left side of the screen to a logical place on the screen.<br><br>A compass at the top of the list acts as the hint button, highlighting the exact position of one of the required items. It takes some time to recharge after use, but collecting the diamonds scattered around the screen speeds the process.",
  "publishedBy": "S.A.D. Software Vertriebs- und Produktions GmbH",
  "developedBy": "Youda Games Holding B.V.",
  "released": "Aug 29, 2011",
  "alsoFor": "Macintosh, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/nintendo-ds/youda-legend-the-curse-of-the-amsterdam-diamond",
  "visual": "",
  "gamePlay": "Hidden object",
  "setting": "",
  "release": [
    {
      "system": "Nintendo DS",
      "releases": [
        {
          "publisher": "S.A.D. Software Vertriebs- und Produktions GmbH",
          "developer": "Youda Games Holding B.V.",
          "ported": "Joindots GmbH",
          "country": " Germany",
          "releaseDate": "Aug 29, 2011",
          "ean13": "",
          "comments": "Purple Hills Budget Release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}