{"altername_name": [], "name": "Alien Storm", "overview": "This game is a “remake” of the Space Invaders (スペースインベーダー) game developed by Tomohiro Nishikado and released in 1978. It was originally manufactured by Taito in Japan, and it was later licensed for United States by the Midway division of Bally. To play with a single player you need to press the “1” key. To play with two players, press the “2” key. To start playing you need to insert coins. Use the “C” key on the keyboard to add 1 credit. This makes it possible to play with one player. Otherwise, by pressing the C key again, it will be possible to have two credits and play with two players. The players take turns, the first player first, and when their lives are finished, the second player enters. The game mode is simple: the player controls a mobile cannon that moves horizontally on the bottom of the screen, and must take down one by one the aliens that slowly approach the Earth. The approaching stages of the aliens to the World follow a unique pattern, a wide and orderly zig-zag that leads them slowly, but surely, to reach the bottom of the screen. When they reach the bottom side, the invasion is complete and the game ends. To move the cannon you need to use the joystick or the keyboard. To move the cannon to the left push the joystick to left or press the “A” key. To move cannon to the right, move the joystick to the right or press the “D” key. To shoot you need to use the fire buttor or “space” key. The player defends the Earth by facing hordes of aliens that follow each other incessantly with his cannon (one wave is exterminated, another one falls immediately). In the upper area of the screen, some “Mystery Ships” scroll from time to time, ie bonus ships that, if shot down, allow the player to increase his score much faster. The game ends when the aliens reach the bottom of the screen or when the cannon is destroyed. The cannon can be destroyed by enemy fire. They are “rays” that are periodically launched by the aliens towards the cannon. The cannon is partially protected by some immobile defensive bunkers which are gradually destroyed by the projectiles of the aliens or by the shots fired by the player himself. The player has three movable cannons (three lives or more depending on the settings), after the destruction of which the game ends. The player has an unlimited number of bullets but he/she can only fire one shot at a time. As the aliens are destroyed, the remaining ones move faster across the screen. The soundtrack - composed only of a series of tones - follows the ever-increasing rhythm of the game.", "platform": "Commodore 128", "release_date": "October 12, 2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Marco Spedaletti", "publishers": "itch.io", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/159757-alien-storm\n"}