{"altername_name": ["C128-Robots"], "name": "Attack of the PETSCII Robots", "overview": "Petscii Robots has been ported to the Commodore 128 computer. It takes full advantage of the 128K to give you full-color bit-mapped graphics, a great soundtrack, and enhanced disk features. It includes 14 maps, a live map on the 80-column display for dual-monitor play, 3 difficulty levels, and support for keyboard controls or SNES controller. Robots have taken over human settlements across a number of planets and it is up to you to infiltrate and destroy all of the robots. To do this however, will require a bit of strategy and your first task will be to case out the game environment and search everything to locate weapons, health kits, and passcards. The weaker hoverbots can be taken out by using the basic pistol weapon or alternatively a well placed time bomb will sort them out as well. The rollerbots are a lot more aggressive and stronger and will require a bit more thought and stronger weapons, such as EMPs and plasma guns, to finish off - just take care to stay out of the explosion range when using a plasma gun. The Evilbots are the most deadly and toughest to defeat. If you get in close range of these without preparing beforehand then you better run for your life as these bots will home straight in on you with a couple of hits being enough to finish you off. Once you kill off all the robots on the planet, you can finish the game map by locating the final transporter. There are 9 different game maps on offer with the same objective and features but requiring different approaches to destroy all the bots - providing multiple hours of total game play. But note that there is no built in save or checkpoint system on offer so if you do die then you need to restart the game map from the beginning and do everything all over again.", "platform": "Commodore 128", "release_date": "November 29, 2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "8-Bit Productions", "publishers": "The8BitGuy", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/159699-attack-of-the-petscii-robots\n"}