{"altername_name": [], "name": "Amo del Mundo", "overview": "Accept the challenge of the Master of the World. Cross the red line if you want to get a real taste of danger. Enter a zone of no return for many. You just need to dare! Recharging energy (pressing down) Robur \"The Conqueror\" is an evil genius inventor who has built the \"Espanto\", a vehicle capable of running, sailing, diving and flying. He is also endowed with a powerful weapon 200 times more powerful than any known weapon ... and with this he intends to become the Master of the World! John Storm, Washington's chief police inspector, has gotten himself an FBI survival kit and heads to the Robur base to try to stop him. In the middle of his dangerous mission he is discovered, captured and brought before Robur. This, in addition to telling him his plans to exterminate the earth, has destroyed in several pieces the electronic plan of the main circuit of the \"Scare\". John has managed to break free and get his special equipment to decode the plans. Now, he has to go through the 8 levels of the base in search of the pieces of the plane, decode them and disconnect the electrical equipment before time runs out, will he succeed? ... that only depends on your skill. Arriving at the teleportation platform (the one on the ground, activated by pressing down) We control a character who will have to go through 8 levels in search of the pieces of the plane. In each phase we will find dangers such as lava floors, defense robots ... We have three lives and an energy bar that we can recharge on platforms. The latter is essential since with the amount of defenses that each area has, our energy goes down at lightning speed. In each level there are 2 different types of shards. Some green ones that will rebuild 2% and red ones 5%. To play this game we have to have a quadrant of codes at hand because every time we take a piece, a code will appear at the bottom of the screen and we will have 15 seconds to find the correct number. If we are right, it will add a percentage and if we fail, it will disappear without adding anything. We have 20 minutes to finish the mission. The game has very colorful graphics although quite ornate. They wanted to put so many details on the screen that sometimes we don't see the enemies or their shots coming. It happened without pain or glory. I had this game in its day and it was one of those that \"got lost\" in a game exchange with a classmate. A pity because although it is not any wonder, it kept me entertained for a good season.", "platform": "Microsoft MSX", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Positive", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "2.12", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=YRCaX670LzQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/44880-amo-del-mundo\n"}