{"altername_name": [], "name": "Animal Land", "overview": "Enix kickstarted the whole mystery Japanese adventure game craze of the 80s with Portopia Satsujin Renzoku Jiken, which was followed up by two sequels, all three of which were helmed by star developer Yuji Horii. Lesser known is this game, Animal Land Satsujin Jiken (“Animal Land Murder Case”), despite following the same mold…except all of the characters are anthropomorphic animals. The story puts you in the shoes of a rookie canine shamus named Oidon, as he investigates the murder of Gonkichi, a fox and owner of a jewelry store. The story gets even darker when the case interweaves with the suicide a panda named Linlin. The game plays out similarly to all of the others of the era, as you select various commands to investigate crime scenes and quiz suspects. Through rather than the first person labyrinth you explore in the Famicom version of Portopia, instead here’s an overhead scene where you explore a complicated forest. This aspect that makes it stand out, of course, is the setting and the artwork. Due to the limitations (both resolution and palette) of the MSX, it looks quite a bit different than typical adventure games that appeared on the PC88, but the artwork itself is excellent considering its limitations, with a distinctive and appealing style. Human-like animals investigating crimes actually isn’t all that out of th ordinary for the Japanese audience – after all there was a cartoon earlier in the 80s known in English as Sherlock Hound, featuring a canine version of Sir Arthur Conan Doyle’s famous detective. (It’s well worth checking out, especially as some episodes were directed by Hayao Miyazaki in the earlier days of his career.) But the concept isn’t just used for stylistic purposes – all of the characters being animals like dogs, cats, foxes and pandas plays into the game’s shocking twist ending, which absolutely couldn’t be done in any type of murder mystery. (As a clue it’s sort of similar to the setup of the Dreamworks animated film Penguins of Madagascar, which was released nearly two decades later. The title of the game also gives a vague hint.) The game was never ported outside of its original MSX appearance, which is saddening, because Animal Land Satsujin Jiken deserves recognition for this alone.", "platform": "Microsoft MSX", "release_date": "1987", "game_type": "Released", "esrb": "", "developers": "Enix Corporation", "publishers": "Enix Corporation", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.33", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=57q9x1dHnxs&ab_channel=LordKarnov42", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82910-animal-land\n"}