{"altername_name": [], "name": "Arkos", "overview": "THE STORY Several centuries ago, long before the Atlanteans became little more than a legend, there was a small but thriving village, KARTES, whose people lived in harmony, enjoying the especially fertile lands he cultivated, as well as a thriving cattle that multiplied the colorful of their fields. In a polished stone, in the center of the village, rested the sacred axe of GRIX, which neither the oldest of the place remember having seen it stop shining even on the grayest and darkest days. According to tradition, it was an axe that was given to the people of KARTES by the gods as payment to a distant and hidden debt. His strange power endothed to the grounds where it was of an unusual fertility, being the secret of THE prosperity of KARTES. But the evil TAROX, the dweller of the swamps that was waiting for decades there were of being driven out of the village by their predatory instincts, had not ceased in his endeavor of seizing the sacred axe. For this purpose it was years experimenting, through alchemy and diabolical arts, to obtain, to obtain, final, a potion capable of modifying living organisms. So, I got transform the beings around them, changing their shape and size, molding them, in addition to magical qualities such as weightlessness or violent Instincts. The same TAROX, after ingesting a high dose of the potion, deranged by his ambition, he became a gigantic and almost invulnerable monster. With his army of immense beings, he attacked surprise the village of KARTES, seizing the sacred axe of GRIX. With the axe in his possession, well-guarded in the abandoned temple of ZINTOS, soon step to do-mining large stretches of the plain, taking advantage of the work of the transformed beings who obeyed him blindly. The inhabitants of KARTES went on to experience the most tragic and darkest time of their history: the once productive lands, became solar wasteland; The wells and watering swells became skewed ditches that provoked epidemics and impede irrigation; animals died to thousands of hunger and Thirst... The village of KARTES, peaceful for centuries, does not find the way to put end to his misfortune. Until I was born a boy, ARKOS, who seemed endowed with almost superhuman ha-ability and constancy. SIROS, the priest, teacher and patriarch of the village, saw in the a possibility of light in the dark corridor of fate. With an almost desperate faith, I train the young ARKOS in all arts of war, strengthening, at once, their intelligence and morals, preparing him, in short, for the terrible impact that the confront such creatures. Before we leave, under the warm influences of the full moon, he said: ARKOS, I haven't told you that you should face ex-traffickers and numerous Enemies. You must first cross the village that tarox built to this side of the swamps. Be cautious, be wary of doors and windows, beware of giants and mysterious holes. Don't forget to pick up objects that our people left as magic offerings when we went through millennia ago the plain and swamps to settle here, you'll need ALL to end your missionary. Surely TAROX was at the end of the village, stand firm and keep throwing at him the throwing darts I give you, until that you're done with him. When you get it, his henchmen, avid for revenge, will besieged to the end. Then climb on the back of ATOR, the bird, which will help through the swamps. Later, it descends to the grounds of the abandoned temple of ZINTOS, where the sacred axe is located. All are waiting for you outsources and sources of acid that would not stop spitting their poison until than the times re-satiated. And so many other dangers to which you'll have to face it. ARKOS, look at your people, you damned vile-mind ed the worst of destinations: hunger. You're his only hope, have faith and GET THE SACRED AX.", "platform": "Microsoft MSX", "release_date": "1987", "game_type": "", "esrb": "", "developers": "Arcadia Software", "publishers": "Zigurat Software S.L.", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=-UInVECqRXo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/44923-arkos\n"}