{"altername_name": [], "name": "Batten Tanuki no Daibouken", "overview": "The story takes place in a forest, where the evil Count Wolf has kidnapped all of the creatures, save for an elderly rabbit. A tanuki warrior from outside the land, trained in kung-fu just happens to be passing through, so the rabbit granny begs him to use his strength to find Wolf Castle and rescue all of the villagers. The game presents itself as a standard chop-socky side-scroller, as you pummel apes and flamingos and other woodland creatures, but it’s a bit more complex than, say, Irem’s Kung Fu Master. It’s not immediately apparent, but the game world is quite large and complex, reportedly containing over 400 screens. The entire world is laid out on a grid, with several horizontal paths that are positioned parallel to each other. As you run across the levels, you’ll find arrows that represent places where you can hop onto other areas. It’s not entirely clear when you’ve actually done this though, because there aren’t any indicators that you’ve hopped onto a different path unless you actually walk in a different direction and notice the change in scenery. Indeed, most other games that used this structure had things like warp doors, which at least made it clear when you’ve jumped somewhere else. There is an early item that will display an onscreen map, but it only shows your vague location as a tiny dot, and instead expects that you’ll map out everything on your own. You’ll need to find several other keys and items, power up the hero, and find the Wolf Castle before you can beat the game. The whole game is confusing, but made infinitely more difficulty because the action is very poorly implemented. The hero tanuki may be skilled in martial arts, but he’s still not very good at them, because his attacks have absolutely no range, making it hard to get in attacks without receiving damage at the same time. Foes spawn constantly and move at the same rate as the tanuki, making them impossible to outrun. It’s here where the game presents some comedy, as defeated foes are literally flung across the screen. Additionally, these baddies are apparently so thirsty for tanuki blood that they can be lured right into the many, many holes that litter the forest, sending them to their own Wile E. Coyote-style doom. You’ll actually be doing this a whole lot if you want keep your health up too, though falling into those holes will also instantly kill you. Technically there are no continues, but there is a password function that lets you pick up with your items intact. The theme song of the game is pretty catchy, if repetitive, and Technosoft apparently thought so highly of it that the package includes an audio tape with arranged version of its two tracks. (These were both included on Illusion: Tecno Soft Game Music Collection Vol. 1) Batten Tanuki no Daibouken is definitely one of those games where its wild concept is more interesting than the game itself, which doesn’t really capitalize on its premise and is painfully stereotypical of 1980s computer games. Alas, Technosoft later found their niche with shoot-em-ups like Thunder Force, and never revisited the concept. The idea of action hero anthropomorphs may have been more popularized by the Teenage Mutant Ninja Turtles a few years later, but darned if a karate tanuki isn’t a great idea for a character.", "platform": "Microsoft MSX", "release_date": "December 24, 1985", "game_type": "Released", "esrb": "", "developers": "Tecno Soft", "publishers": "Tecno Soft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=HMU-LbTez3U", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82912-batten-tanuki-no-daibouken\n"}