{"altername_name": ["The Karuizawa Kidnapping Guidance"], "name": "Karuizawa Yuukai Annai", "overview": "Karuizawa Yuukai Annai (軽井沢誘拐案内), which translates to \"The Karuizawa Kidnapping Guide,\" was the third and final adventure game developed by Yuji Horii that tells a comedic story with light erotic elements. Similar to the original version of the Portopia Serial Murder Case, the game was developed single handedly by Yuji Horii, including writing the game's scenario, designing, programming and even creating the ingame art. Enix published the title in May 1985 for the NEC PC-88 and ports for various Japanese computers followed shortly afterwards. A complete remake of Karuizawa Yuukai Annai was eventually released by Enix and later Square Enix for mobile phones in 2002. A second mobile remake was also created in 2005 that featured new artwork. The title has since been retroactively branded as part of a trilogy called Yuji Horii Mysteries which includes all the adventure games created by Yuji Horii. The story follows a young collage student named Shiro who is visiting his girlfriend Kumiko while she is vacationing with her sister, Nagisa, at their villa in the town of Karuizawa. However, one day Nagisa does not return home and the couple suspects that she has been kidnapped after receiving a mysterious phone call. With the local police unable to to find Nagisa, Kumiko and the player begin exploring Karuizawa themselves to gather information in order to find out what happened to Nagisa. Karuizawa Yuukai Annai has the player visiting various places modeled after real-word locations in Karuizawa through an Ultima-style overworld map. Once the player arrives at a landmark, the perceptive changes to a first-person viewpoint where the player uses verb commands listed on the side of the screen to interact with the environment and talk to characters, similar to Yuji Horii's Hokkaidou Rensa Satsujin. However, unlike the other adventure titles developed by Yuji Horii, Karuizawa Yuukai Annai has mild sexual content with the game featuring nudity and even commands for the player to \"kiss\" or \"hold\" certain characters. The game is separated into six chapters and during the final chapter the gameplay changes to that of a basic western-style RPG where the player engages in battles on the overworld map. In this section the player has a party of three characters (Shiro, Kumiko and Nagisa's friend named Asami) who can increase their states by winning battles and find items in treasure chests to use in battle. During battles the player can select various commands to attack enemies, including humorous actions such as a female party member flashing their underwear to weaken an enemy.", "platform": "Microsoft MSX", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Yuji Horii", "publishers": "Enix", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=DD3RTjsJvqY&ab_channel=%E3%83%92%E3%83%BC%E3%83%9B%E3%83%BC%E5%90%9B", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83024-karuizawa-yuukai-annai\n"}