{"altername_name": [], "name": "Post Mortem", "overview": "A ZX Spectrum programmer decides to write a new game about death called \"Post Mortem\". One night, while working on it, he is visited by death itself that claims him by electrocution. He goes to the Purgatory, where he learns that he must find three items to be able to reincarnate: a \"concentrated miracles\" pill, a videotape with his future recorded and a reincarnation certificate. Post Mortem is a Spanish adventure game with an icon-based interface similar to the one in Cobra's Arc. The screen is divided in five areas: - at the top of the screen there is a window for the illustrative graphics; - to the right of that there is a window for the collected items; - next comes the game title and the developer name; - in the middle of the screen there is another window for the text output; - and at the bottom there is a tray with all the icons. They are, from left to right: Three pairs of feet pointing to the left, upwards and right to go west, up/north and east respectively; A magnifying glass to look around; Two speech balloons with the words \"Sí\" and \"No\" (\"Yes\" and \"No\") to answer occasional questions; A \"Help\" flag as a on-line hint system; A text description of the keyboard controls: \"O - Left P - Right N - Interact; A \"STOP\" sign as a pause button. The player interacts with these icons by moving a animated mouse with the keyboard (O to move it left, P to make it go right) over the desired icon and selecting it by either pressing the SPACE bar or the N key. The game has several instantaneous death screens, with no hint of the danger ahead. Therefore, gameplay is basically a trial-and-error affair, without any form of saving progress.", "platform": "Microsoft MSX", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Genesis Soft", "publishers": "Iber Soft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/105291-post-mortem\n"}