{"altername_name": ["Zemmix 126", "재믹스 126", "Super Game World: 126 Games", "슈퍼 게임 월드 126합"], "name": "Super Game World 126", "overview": "This is an unlicensed compilation, and many games have been modified to remove or replace the original copyrights. Despite what the name may infer, this compilation actually contains 92 games. The discrepancy is because various games are listed more then once, but starting at a higher level and/or with extra lives. Move left or right off the screen to flip to the next screen. Unfortunately there is no screen number indicator, making it difficult to navigate for non-Korean speakers. In addition the patching of The Goonies seems to have gone wrong, and instead of starting you at more advanced levels, your vitality is reduced. The numbering of the King's Valley levels in the menus is also not correct (off by one). * Screen 1 01. Tank Batallion 02. Super Cobra 03. Video Hustler 04. Bomber Man 05. Galaga 06. City Connection 07. Penguin Kun Wars 08. Konami's Boxing 09. Zanac 10. Adventure of a small cat - Chibi goes on adventure 11. Spelunker 12. Kenja no ishi (The Stone of Wisdom) 13. Star Force 14. Magical Tree (extra lives) 15. Knightmare (stage 2) 16. Twinbee (stage 2) 17. Circus Charlie (level 2) 18. King's Valley (pyramid 2) * Screen 2 19. Ninja Princess 20. Doki Doki Penguin Land 21. The Legend of Kage 22. Formation Z 23. Castle Excellent 24. Twinbee 25. Yami no ryu ou Hades no monshou (Crest of the Dragon King Hades of Darkness) 26. Gyrodine 27. Issunboushi No Donnamondai (Small boy's Quiz) 28. Yie ar Kung-Fu 2 29. Star Soldier 30. Flicky 31. Elevator Action 32. Cabbage Patch Kids (extra lives) 33. King's Valley (pyramid 3) 34. Circus Charlie (stage 3) 35. Knightmare (stage 3) 36. Twinbee (stage 3) * Screen 3 37. Bull and Mighty's Slim Chance 38. Iga Ninpou Chou Mangetsujou no Tatakai 39. Seiken Acho 40. Thexder 41. Gulkave 42. The Goonies (low vitality) 43. Youkai Yashiki (Ghost House) 44. Arkanoid 45. Hyper Rally 46. Master Takahashi's Adventure Island 47. Knightmare 48. Tetris II 49. Comic Bakery 50. Cabbage Patch Kids (stage 2) 51. King's Valley (pyramid 5) 52. Pippols (extra lives) 53. Knightmare (extra lives) 54. Twinbee (stage 4) * Screen 4 55. King's Valley 56. Konami's Tennis 57. Konami's Ping Pong 58. Pippols 59. Moai no hihou 60. Magical Kid Wiz 61. Exerion 62. C-So! 63. E.I. 64. Exoide Z 65. The Protector 66. Sinbad 67. Mopi Ranger 68. Sky Jaguar (extra lives) 69. King's Valley (pyramid 6) 70. TwinBee (extra lives) 71. Knightmare (stage 4) 72. Circus Charlie (stage 4) * Screen 5 73. Alpha Squadron 74. Galaxian 75. Boogi Woogi Jungle 76. David II 77. Indian no Bouken 78. Mr. Do! 79. Car Jamboree 80. Yellow Submarine 81. King & Balloon 82. Sasa 83. Soukoban 84. Hyper Olympics 1 85. Ultra-man 86. King's Valley (pyramid 7) 87. Circus Charlie (extra lives) 88. Knightmare (stage 5) 89. King's Valley (extra lives) 90. King's Valley (pyramid 8) * Screen 6 91. MSX Baseball 92. Ski Command 93. Stepper 94. Pastfinder 95. Flipper Slipper 96. Turmoil 97. Safari X 98. Hyper Sports 1 99. Konami's Golf 100. Checkers in TanTan Tanuki 101. Alpha Roid 102. Yie ar Kung-Fu 103. Antarctic Adventure 104. King's Valley (pyramid 10) 105. King's Valley (pyramid 11) 106. The Goonies (low vitality) 107. The Goonies (low vitality) 108. The Goonies (low vitality) * Screen 7 109. Circus Charlie 110. Hyper Sports II 111. Road Fighter 112. Magical Tree 113. Hyper Olympics II 114. Moon Patrol 115. Go Classroom 116. Monkey Academy 117. Mr. Do vs Unicorns 118. Sky Jaguar 119. Cabbage Patch Kids 120. Kung-fu thai kun 121. Gomoku Narabe 122. MSX Soccer 123. The Goonies (low vitality) 124. The Goonies (low vitality) 125. The Goonies (low vitality) 126. The Goonies", "platform": "Microsoft MSX", "release_date": "1988", "game_type": "Unlicensed", "esrb": "Not Rated", "developers": "Screen Software", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151141-super-game-world-126\n"}