{"altername_name": [], "name": "Super Boy I", "overview": "Super Boy is a Super Mario Bros. clone. The gameplay is designed very similarly to the original game. The physics, however, are poorly programmed in comparison, and the items in the ? Blocks are completely random. Due to the older hardware, the scrolling is different to Super Mario Bros.. The scrolling moves in a very choppy fashion (Most, if not all MSX1 games had scrolling like this). The fireballs travel differently as compared with the ones from Super Mario Bros., and the Koopas also die in one hit which means that you can't kick their shells afterwards. Most of the time the area with the HUD can't be accessed, apart from the end of each level when you jump on the flag. Also notable is that this game has only four worlds, half that of Super Mario Bros. The time given for each level also reduces throughout the game, with the first two worlds having 280 seconds for each level, the third having 260 and the final world having 200. The ending omits Princess Peach (or an expy thereof) and instead replaces her with the message \"To be continued\", indicating that a sequel would be made. The graphics could be considered accurate given the limitations of the MSX1, with most of the graphics ripped from Super Mario Bros. and downgraded somewhat, with the exception of the title screen which is redrawn and Lakitu which has been replaced with a ghost. The music is interpreted from the original game, although the soundtrack has been cut down considereably (the game only has the overworld and underworld themes) and the compositions themselves are inaccurate. The sound effects are crude when compared with the original game.", "platform": "Microsoft MSX", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Zemina", "publishers": "", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/132869-super-boy-i\n"}