{
  "name": "Ganso Jajamaru-kun",
  "shortName": "ganso-jajamaru-kun",
  "description": "<i>Ganso Jajamaru-kun</i> is a remake of the NES platformer <a href=\"https://www.mobygames.com/game/ninja-jajamaru-kun\">Ninja Jajamaru-kun</a>. It includes new levels and bosses that stretch the gameplay in novel ways.<br><br>Lord Namazu Dayuu has kidnapped Jajamaru-kun's beloved Princess Sakura. This piratical lord is no laughing matter, despite his sadistically gleeful disposition, he possess an army of creatures drawn from Japanese folklore to prevent you from reuniting with your princess ever again.<br><br>The game is quite simple and plays, for the most part, much like its predecessor. Jajamaru-kun begins on the bottom of a three tiered horizontal field. On each level of this field there are two enemies on each tier. The tiers have weak brick points in that Jajamaru-kun can break by hitting them with his head while, a common trait for arcade heroes. Once a passage is made Jajamaru-kun can move through them as can enemies. To clear a level all enemies must be defeated, most enemies can be killed by having a shuriken thrown at them, the only weapon available without a power-up, some need to be stunned either by falling through a hole in a tier or by being jumped on. Enemy projectiles can also be canceled out by the shuriken. Being touched by an enemy projectile, or in a few cases an enemies body, will instantly kill Jajamaru-kun. After an enemy has been killed its spirit will ascend, you can grab this for extra points.<br><br>Each of these stages has a leader who will posses some special attribute and present a new sprite. After the level in which the leader appears he/she/it will show up in the following levels as a standard level enemy often a bit weaker. Each stage gives you two minutes to complete it, except bosses and special stages. When about one minute remains Lord Namazu will send an orb of fire onto the stage that will slowly home after Jajamaru-kun.<br><br>You start the game with two extra lives and three continues. More lives can be found in the game, or by accruing points.  <br><br>There are four levels in each game area, village, graveyard, castle and town, seaside and ship, and the hidden island. However it is not enough to kill all the enemies in a stage to progress to the next area. Each level has its a cherry blossom that will descend from the top of the screen at a certain point. If you should kill all the enemies before the blossom arrives or the blossom floats of the bottom of the screen you'll go onto the next level but have to return to get it later, in this case all the enemies will have returned. Collecting all four cherry blossoms will allow you to go onto a special stage and the area boss.<br><br>Each game area has one special stage. These stages use the familiar tiers but now they scroll upwards and are littered with traps and hazards; such as, wheels of fire, falling logs, spikes, conveyor belts, etc.. As the scrolling is automatic should Jajamaru-kun not keep up and fall off the bottom of the screen he will die, touching any deadly hazard will also dispatch our hero. Should the player reach the top of the tiers he will be confronted with a gate that his shuriken will open, this leads to a boss.<br><br>Each area boss is attacked in a unique boxed in area, sometimes with platforms. The final boss is the only area where Jajamaru-kun may throw his shuriken vertically. There are no power-ups in boss rooms.<br><br>The power-ups that can be found in the bricks between tiers wear out after a certain amount of time, with the exception of the frog. They will appear on the upper right hand corner of the screen so you know which ones you've picked up recently, getting the frog clears this list.<ul><li><i>Invisibility potion</i>: an invisible ninja is an unstoppable ninja. Once a ninja takes the potion you'll become an ninja outline and can go through enemies. Nothing can harm you, but that doesn't limit your ability to dispatch foes.</li><br>\n<li><i>Ninja Cart</i>: this is a small velocoped for ninja, one in this cart you'll be able to kill enemies by barreling into them, even though it doesn't make physical sense you can still jump in this cart.</li><br>\n<li><i>Big Shuriken</i>: this will make your ninja stars about as big as you are, easily defeating evasive enemies</li><br>\n<li><i>Long Distance</i>: this weapon upgrade will make your attacks go across the entire screen.</li><br>\n<li><i>Katana</i>: a fearsome sword, the katana can do away with any foe, regardless of if they have armor or are to low to hit with your normal attack. The katana also destroys incoming projectiles, however, this blade has a very limited range so be careful.</li><br>\n<li><i>Boomerang</i>: causes your shuriken to fly back at you, it wont harm you, but it is great for picking off foes that are weak from behind.</li><br>\n<li><i>Speed increase</i>: this spherical power-up increases Jajamaru-kun speed to the the peril of his enemies, and himself.</li><br>\n<li><i>Watch</i>: this item will give you more time.</li><br>\n<li><i>Extra Ninja</i>: this item will grant you an extra life, very rare! They do not count as a collected item.</li><br>\n<li><i>Inscribed Coin</i>: these coins available in white and black are worth varying amounts of points. They do not count as a collected item.</li><br>\n<li><i>Bombs</i>: these items look like two speed boost orbs, or the wheels of the cart, however, they are a trap. Jumping into these means instant death for Jajamaru-kun</li><br>\n<li><i>Trusty Frog</i>: Jajamaru-kun's noble steed, a humongous man-eating frog. Should you collect four power-ups instead of receiving the power of the fourth you will get to ride on your gigantic frog and eat all the enemies on the stage. This can be dangerous though if you have not yet gotten the stages petal as once on the frog it won't show up. There is no time limit on how long the frog stays, unless of course the time runs out entirely before you gobble up all the enemies. Once a stage ends you will have to repeat the item collection process to ride the frog again. Items in your collection carry over between stages so you can strategically pick a fourth on a stage where you need the frog.</li></ul>",
  "publishedBy": "Jaleco Ltd.",
  "developedBy": "Jaleco Ltd.",
  "released": "Apr 15, 1999",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/wonderswan/ganso-jajamaru-kun",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Beat 'em up / brawler, Platform",
  "setting": "",
  "release": [
    {
      "system": "WonderSwan",
      "releases": [
        {
          "publisher": "Jaleco Ltd.",
          "developer": "Jaleco Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 15, 1999",
          "ean13": "4 907859 110019",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/328525-ganso-jajamaru-kun-wonderswan-screenshot-title-screen-jajamaru.png",
      "caption": "Title screen. Jajamaru-kun astride his trusty frog."
    },
    {
      "link": "/images/shots/l/328526-ganso-jajamaru-kun-wonderswan-screenshot-ninja-meets-princess.png",
      "caption": "Ninja meets princess, wild hearts may be observed floating away...."
    },
    {
      "link": "/images/shots/l/328518-ganso-jajamaru-kun-wonderswan-screenshot-vertical-scrolling.png",
      "caption": "Vertical scrolling section, that lagre falling breadloaf is in fact a log. The chains of four teardrops are rotating fire whip."
    },
    {
      "link": "/images/shots/l/328522-ganso-jajamaru-kun-wonderswan-screenshot-first-area-boss-what.png",
      "caption": "First area boss: what at first looks like it will be slingshot turns out just to be something he'll throw at you, which is much more dangerous..."
    },
    {
      "link": "/images/shots/l/328521-ganso-jajamaru-kun-wonderswan-screenshot-angry-totoro-esque.png",
      "caption": "Angry Totoro-esque monster does not like Jajamaru-kun!"
    },
    {
      "link": "/images/shots/l/328523-ganso-jajamaru-kun-wonderswan-screenshot-the-graveyard-scene.png",
      "caption": "The graveyard scene, you'll need to find all four petals to progress."
    },
    {
      "link": "/images/shots/l/328527-ganso-jajamaru-kun-wonderswan-screenshot-a-trap-for-our-bug.png",
      "caption": "A trap for our bug-eyed hero! Lord Namazu Dayuu will claim the princess."
    },
    {
      "link": "/images/shots/l/328532-ganso-jajamaru-kun-wonderswan-screenshot-the-shinobi-take.png",
      "caption": "The shinobi take to the field."
    },
    {
      "link": "/images/shots/l/328534-ganso-jajamaru-kun-wonderswan-screenshot-one-may-use-one-s.png",
      "caption": "One may use one's head to break brick blockades."
    },
    {
      "link": "/images/shots/l/328536-ganso-jajamaru-kun-wonderswan-screenshot-if-they-fall-through.png",
      "caption": "If they fall through the floor enemies will be stunned. Ninja throwing star time!"
    },
    {
      "link": "/images/shots/l/328517-ganso-jajamaru-kun-wonderswan-screenshot-the-princess-thinks.png",
      "caption": "The princess thinks of you."
    },
    {
      "link": "/images/shots/l/328537-ganso-jajamaru-kun-wonderswan-screenshot-when-enemies-perish.png",
      "caption": "When enemies perish their spirits will rise free, grab them for extra points. As you can see one on the left is sky-bound while the little points over my head show I've also just nabbed one."
    },
    {
      "link": "/images/shots/l/328540-ganso-jajamaru-kun-wonderswan-screenshot-breaking-this-brick.png",
      "caption": "Breaking this brick cieling revealed a coin! That is worth a great deal of points."
    },
    {
      "link": "/images/shots/l/328543-ganso-jajamaru-kun-wonderswan-screenshot-bannana-french-toast.png",
      "caption": "Bannana? French toast? Carrot?! Not really sure what that is actually...."
    },
    {
      "link": "/images/shots/l/328546-ganso-jajamaru-kun-wonderswan-screenshot-a-bunch-of-different.png",
      "caption": "A bunch of different enemies + Mt. Fuji (?)."
    },
    {
      "link": "/images/shots/l/328547-ganso-jajamaru-kun-wonderswan-screenshot-invisible-ninja-power.png",
      "caption": "Invisible ninja power. To a ninja invisibility is invincibility."
    },
    {
      "link": "/images/shots/l/328548-ganso-jajamaru-kun-wonderswan-screenshot-old-man-hoard.png",
      "caption": "Old man hoard"
    },
    {
      "link": "/images/shots/l/328549-ganso-jajamaru-kun-wonderswan-screenshot-ack-jumping-umbrellas.png",
      "caption": "Ack! Jumping umbrellas."
    },
    {
      "link": "/images/shots/l/328550-ganso-jajamaru-kun-wonderswan-screenshot-no-way-out-when-time.png",
      "caption": "No way out! When time gets short, the wicked lord is sure to kill you with fire, better move fast, real fast."
    },
    {
      "link": "/images/shots/l/328552-ganso-jajamaru-kun-wonderswan-screenshot-jajamaru-kun-finds.png",
      "caption": "Jajamaru-kun finds a sword, with which he hacks his foes most sneakily."
    },
    {
      "link": "/images/shots/l/328554-ganso-jajamaru-kun-wonderswan-screenshot-spirit-cluster-boss.png",
      "caption": "Spirit cluster boss. ?&theta;&nu;?&tau;&omicron;&sigmaf; ? &psi;&nu;&chi;?!"
    },
    {
      "link": "/images/shots/l/328555-ganso-jajamaru-kun-wonderswan-screenshot-the-outer-edge-is.png",
      "caption": "The outer edge is formed of weaker spirits.Their incarnations will be of weaker foes."
    },
    {
      "link": "/images/shots/l/329250-ganso-jajamaru-kun-wonderswan-screenshot-the-cart-can-crush.png",
      "caption": "The cart can crush any foe, at high speeds."
    },
    {
      "link": "/images/shots/l/329251-ganso-jajamaru-kun-wonderswan-screenshot-collect-four-power.png",
      "caption": "Collect four power-ups and you'll get your ultimate weapon."
    },
    {
      "link": "/images/shots/l/329255-ganso-jajamaru-kun-wonderswan-screenshot-this-mighty-amphibian.png",
      "caption": "This mighty amphibian can devour any enemy whole."
    },
    {
      "link": "/images/shots/l/329262-ganso-jajamaru-kun-wonderswan-screenshot-infiltrating-the.png",
      "caption": "Infiltrating the lord's castle."
    },
    {
      "link": "/images/shots/l/329264-ganso-jajamaru-kun-wonderswan-screenshot-the-castle-cat-defends.png",
      "caption": "The castle cat defends his turf."
    },
    {
      "link": "/images/shots/l/329267-ganso-jajamaru-kun-wonderswan-screenshot-scaling-the-castle.png",
      "caption": "Scaling the castle wall. A doorway leads to another doorway... The wedges in the ground shoot out as spikes."
    },
    {
      "link": "/images/shots/l/329269-ganso-jajamaru-kun-wonderswan-screenshot-your-rival-ninja.png",
      "caption": "Your rival ninja is already here...."
    },
    {
      "link": "/images/shots/l/329270-ganso-jajamaru-kun-wonderswan-screenshot-he-can-easily-deflect.png",
      "caption": "He can easily deflect your throwing stars, you'll have to jump on him... which wont be easy with all that fire going around him."
    },
    {
      "link": "/images/shots/l/329271-ganso-jajamaru-kun-wonderswan-screenshot-good-to-see-somebody.png",
      "caption": "Good to see somebody else making that face."
    },
    {
      "link": "/images/shots/l/329275-ganso-jajamaru-kun-wonderswan-screenshot-an-aquating-stage.png",
      "caption": "An aquating stage, with balding penguins"
    },
    {
      "link": "/images/shots/l/329277-ganso-jajamaru-kun-wonderswan-screenshot-the-lord-wasn-t-in.png",
      "caption": "The lord wasn't in his caslte this boat will take you to his hideaway."
    },
    {
      "link": "/images/shots/l/329279-ganso-jajamaru-kun-wonderswan-screenshot-ice-patches-are-now.png",
      "caption": "Ice patches are now on the ground, if you look real hard you'll see them... but you'll find out soon enough in the game when you slide to your doom."
    },
    {
      "link": "/images/shots/l/329281-ganso-jajamaru-kun-wonderswan-screenshot-the-boss-of-the-boat.png",
      "caption": "The boss of the boat. This fellow does not look friendly."
    },
    {
      "link": "/images/shots/l/329284-ganso-jajamaru-kun-wonderswan-screenshot-hideaway-island.png",
      "caption": "Hideaway island"
    },
    {
      "link": "/images/shots/l/329289-ganso-jajamaru-kun-wonderswan-screenshot-sacred-artifacts.png",
      "caption": "Sacred artifacts, skeletons, mole people?"
    },
    {
      "link": "/images/shots/l/329291-ganso-jajamaru-kun-wonderswan-screenshot-if-you-don-t-start.png",
      "caption": "If you don't start running the conveyor belt will send you right into the flames."
    },
    {
      "link": "/images/shots/l/329293-ganso-jajamaru-kun-wonderswan-screenshot-you-have-to-risk.png",
      "caption": "You have to risk a lot to get out of this area. For some reason this diamond object is a switch, once the hatch above is open you can jump to the boss."
    },
    {
      "link": "/images/shots/l/329295-ganso-jajamaru-kun-wonderswan-screenshot-the-lord-waggles.png",
      "caption": "The Lord waggles his finger at you."
    },
    {
      "link": "/images/shots/l/329238-ganso-jajamaru-kun-wonderswan-screenshot-final-boss-namazu.png",
      "caption": "Final Boss: Namazu himself throws fire down on you. When it comes to rest on the ground the flames will cover three tiles."
    },
    {
      "link": "/images/shots/l/329239-ganso-jajamaru-kun-wonderswan-screenshot-should-namazu-defeat.png",
      "caption": "Should Namazu defeat you you will get the *Bad Ending*... But! Who is that! "
    },
    {
      "link": "/images/shots/l/329240-ganso-jajamaru-kun-wonderswan-screenshot-your-rival-ninja.png",
      "caption": "Your rival Ninja defeats the Lord with a head stomp and saves your sweatie."
    },
    {
      "link": "/images/shots/l/329241-ganso-jajamaru-kun-wonderswan-screenshot-they-ride-off-while.png",
      "caption": "They ride off while you're left to cry a river."
    },
    {
      "link": "/images/shots/l/329242-ganso-jajamaru-kun-wonderswan-screenshot-game-over-screen.png",
      "caption": "Game Over screen"
    },
    {
      "link": "/images/shots/l/329249-ganso-jajamaru-kun-wonderswan-screenshot-leaping-into-what.png",
      "caption": "Leaping into what is almost certain immolation Jajamaru-kun prepares to deal what may be the final blow... AIM BE TRUE!"
    },
    {
      "link": "/images/shots/l/329244-ganso-jajamaru-kun-wonderswan-screenshot-jajamaru-kun-you.png",
      "caption": "Jajamaru-kun! You've defeated the kidnapper Namazu!"
    },
    {
      "link": "/images/shots/l/329246-ganso-jajamaru-kun-wonderswan-screenshot-you-and-the-princess.png",
      "caption": "You and the princess make tracks."
    },
    {
      "link": "/images/shots/l/329247-ganso-jajamaru-kun-wonderswan-screenshot-the-lovers-ride-into.png",
      "caption": "The lovers ride into the sunset a top your trusty steed,"
    },
    {
      "link": "/images/shots/l/329248-ganso-jajamaru-kun-wonderswan-screenshot-el-fin.png",
      "caption": "el fin"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/292281-ganso-jajamaru-kun-wonderswan-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "WonderSwan"
    },
    {
      "link": "/images/covers/l/293585-ganso-jajamaru-kun-wonderswan-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "WonderSwan"
    },
    {
      "link": "/images/covers/l/293588-ganso-jajamaru-kun-wonderswan-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "WonderSwan"
    }
  ]
}