{
  "name": "Super Robot Taisen Compact 2 Dai-1-bu Chij? Gekid? Hen",
  "shortName": "super-robot-taisen-compact-2-dai-1-bu-chij-gekid-hen",
  "description": "After the One Year War (Mobile Suit Gundam), the Earth has returned to a state of partial peace. Following this, the Earth Federation decided to downsize the army. However, insidious forces both inside and outside our world are awakening, and the flames of war are fanning again. Under the name of hunting down the remnants of Zeon forces, Earth Federation forms the Titans, a special military group. Meanwhile, Zeon reforms itself into Neo Zeon (Zeta Gundam), on a mining asteroid known as Axis. On Earth, the former forces of Dr. Hell (Mazinger Z), as well as the Dinosaur Empire (Getter Robo) begin to rampage. From outer space, the Vega Empire initiates an invasion. Only the very few remaining battalions band together to combat these new threats, both on Earth or in its orbit. Nobody knew, however, that these events were a prelude to a conflict that would encompass the entire galaxy.<br><br>The second game in the Compact series for the WonderSwan, <i>Super Robot Wars/Taisen Compact 2</i> is known for its very large scenario. The game is divided into three parts, each released separately. This particular part deals with the conflict on Earth and follows the story of Ky?suke Nambu, the pilot of the Super Robot &quot;Alt Eisen / Alteisen&quot;. The game supports the use of the WonderSwan's internal memory to write a &quot;game cleared&quot; file, that can be used to transfer data from one part to the next. Doing so, players can expect additional features and bonuses. However, it is entirely possible to start playing all parts even without transferring the save data altogether.<br><br>In terms of new gameplay mechanics, <i>Compact 2</i> introduces support attacks and support defenses into franchise. Basically, when friendly units are adjacent to each other, the pilots can defend the unit or attack alongside the unit, depending on the order the player gives. Support abilities depends largely on the skill of the pilot in question. Skills can be customized after each mission and can replace existing ones, should the player choose so. ",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Tose Co., Ltd.",
  "released": "Mar 30, 2000",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/wonderswan/super-robot-taisen-compact-2-dai-1-bu-chij-gekid-hen",
  "visual": "",
  "gamePlay": "Tactical RPG, Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "WonderSwan",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Tose Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 30, 2000",
          "ean13": "4 983164 739039",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}