{"name": "Armor Attack II", "overview": "Armor Attack II is a continuation of the exciting and addicting arcade game made by Cinematronics in 1980. Like the original, this is a one or two player battle-action game where your jeeps (equipped with rocket launchers) defend war torn landscapes with 16 different terrains that are randomly chosen at the beginning of each level.<br><br><br><br>The play field is a top view of cities with road and building areas defined. Players (jeeps) and enemies (tanks) can only maneuver on the roads, however the enemy helicopter can go over buildings and roads. No shots by anything can go through buildings, as they are only valid over road areas. Debris left by tanks is sometimes destructive, so make sure to shoot them from a safe distance!<br><br><br><br>The object is to accumulate the maximum number of points possible. In a two player game, both players play simultaneously and neither player can shoot the other. The player(s) must avoid being shot or run over by the enemy tanks, and avoid being shot by the helicopter. If a player shoots a helicopter, the bonus level is incremented by 10 points. When the fifth helicopter is destroyed an extra jeep is awarded to the player who shot the helicopter the fifth time. (Bonus Levels: +10, +20, +30, +40, extra jeep and reset to zero). The player's turn is over when he/she gets shot by the tank or helicopter. In a two player game, the level does not reset and the player does not return (if he/she has any lives left) until both players are shot.<br><br><br><br>If a player shoots a tank once, there is a time limit to shoot the turret. If a player does not then shoot the turret, it will explode automatically and no points will be awarded.<br><br><br><br>Skill Levels<br><br><br><br>Each Skill Level starts the player at different points in the game (including the player's score):<br><br><br><br>Easy: On the 'Easy' Skill level, there are fewer tanks, they don't shoot as often, move much slower, the turrets follow you very slowly, and the helicopter doesn't shoot often.<br><br>Normal: The 'Normal' skill level is for players who are familiar with the game and features a good balance of difficulty and challenge.<br><br>Hard: On the 'Hard' skill level, there are many more tanks required to complete a level, they shoot much more often, move quickly, the turrets follow you immediately, and the helicopter shoots much more often as well. If you are able to get through a few of the more difficult levels, a second helicopter is brought out to further hinder you.", "platform": "Atari 7800", "release_date": "2013", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Robert DeCrescenzo", "publishers": "AtariAge", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.58", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73605"}