{"name": "Super Pac-Man", "overview": "t's a Bird...It's a Plane...No, it's Super Pac-Man!!!<br><br>The Monster Gang from Pac-Man is at it again! Who will stop their dastardly deeds?<br><br>Never Fear! Super Pac-Man is here to save the maze!<br><br>Super Pac-Man is a port to the 7800 of the arcade game of the same name. Pac-Man and the monsters from the original Pac-Man return, but this is no ordinary Pac-Man game! In Super Pac-Man you must eat the keys to open doors blocking tasty goodies that you need to snap up to clear the maze.<br><br>Chomp a Power Pellet to gobble up the Monsters like in classic Pac-Man or forego the mild-mannered munching with a Super Pellet and become the super-sized, super-fast, super-invulnerable Super Pac-Man, capable of smashing down the doors that block your passage!<br><br>All we have to say is that if Bob DeCrescenzo was writing games for the Atari 7800 \"back in the day\", the system surely would have been a stellar hit! Super Pac-Man is one of Bob's latest Atari 7800 creations, and another great arcade classic he's brought to the 7800.<br><br>Super Pac-Man has a unique style compared to most Pac-Man games--your goal in this game is to gobble up keys that open doors giving Pac-Man access to fruits and prizes he must devour, as opposed to dots. Pac-Man can eat Super Power Energizers which turn him into Super Pac-Man. Super Pac-Man is considerably larger in size, can zoom much faster, and can crash through any locked doors. Super Pac-Man can also pass through (over?) ghosts without dying.<br><br>Pac-Man fans will not want to miss Super Pac-Man on the 7800. Even the intermissions from the original arcade game are included!", "platform": "Atari 7800", "release_date": "2008", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Bob DeCrescenzo", "publishers": "AtariAge", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83200"}