{"altername_name": [], "name": "Area 51", "overview": "The plot of the game involves the player (Peterson) taking part in a STAAR (Strategic Tactical Advanced Alien Response) military incursion to prevent aliens, known as the Kronn, and alien-created zombies from taking over the Area 51 military facility. This game takes the player through several sections of the facility, including a warehouse and underground tunnels. The player is tasked, along with fellow STAAR members, to penetrate Area 51 and activate the nuclear self-destruct sequence. The player must kill all of the genetically altered soldiers and aliens without harming any allied STAAR team members (at the cost of one life point), however if nothing but three STAAR team members are shot, the Kronn Hunter will be started, taking the role of a Hunter, sent by the Kronn to eliminate the rebels. None of the actual aliens will appear until the office level. There are five types of different weaponry available to the player during the course of the game. While the player is only given a semi-automatic pistol in the beginning, weapon upgrades are available as targets throughout the game. The pistol can be upgraded to an automatic machine gun, a pump shotgun, and finally an automatic shotgun. The shotgun weaponry allows a greater field of error for targeting an enemy in able to kill it. Both the machine gun and automatic shotgun allow the player to keep the trigger pressed down to unleash rounds. If the player is hit by the enemy at any time, the weapon is downgraded back to the pistol. The player will also find grenades in crates and bonus rooms which, when used, destroys most on screen enemies at once. The player can hold a max of 9 grenades. In addition, yellow boxes and barrels marked with \"flammable\" warning symbols can be shot to cause fires or explosions that can harm enemies.", "platform": "Sega Saturn", "release_date": "November 20, 1996", "game_type": "Released", "esrb": "M - Mature", "developers": "Mesa Logic", "publishers": "GT Interactive", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.03", "wikipedia": "https://en.wikipedia.org/wiki/Area_51_%281995_video_game%29", "video_link": "https://www.youtube.com/watch?v=YLN4iIfOTVc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9243-area-51\n"}