{"altername_name": [], "name": "Atomic Runner Chelnov", "overview": "Atomic Runner, in its original arcade form was once set to appear for the Sega Saturn. It appeared at the Tokyo Game Show and various game stores in the Akihabara district of Tokyo in 1997, though was canceled for unknown reasons. A prototype has since been leaked onto the internet. Description: One windy day, there was an explosion at a nuclear power station, causing heavy doses of radiation to be poured over many people. One of these people was a coal miner named Chelnov. When he survived the deadly accident, he was possessed with abnormal powers. Having realized this, he decided to act in the cause of justice. He is determined to escape the Eastern Bloc country he called home and run and jump across the world to finish in the US. What distinguishes Chelnov: Atomic Runner from other platform games is its use of forced scrolling. This occurs when the screen moves continuously from left to right, forcing players to negotiate the game's many obstacles and enemies without controlling Chelnov's speed of progress. Enemies attack from left, right, above, and below, and Chelnov can switch the direction he's facing to attack enemies that are behind him. Some enemies in the game carry different types of weapons and power-ups, and when they are shot at, the power-ups drop to the ground and can be picked up. While the level design and enemy placement is identical in the later released Genesis (and subsequently Wii) version, the graphics have been significantly changed: now each level is based on a ancient human civilization and the enemies (including bosses) are replaced. Also all references to atomic explosions have been removed from the background story. Now Chernov is the son of a scientist. The evil Deathtarians, who claim to be the original population of the Earth and want to control this planet, murdered his father and abducted his sister. Chelnov takes a special suit made by his father, which give him super-human powers and make him an \"Atomic Runner\". The Deathtarians caught and imprisoned him, but he broke out of the prison and is now on the run...", "platform": "Sega Saturn", "release_date": "", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Data East", "publishers": "", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/Atomic_Runner_Chelnov", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90720-atomic-runner-chelnov\n"}