{"altername_name": ["Bubsy 3D", "Bubsy is 3D in Furbitten Planet"], "name": "Bubsy 3D: Furbitten Planet", "overview": "Bubsy 3D (also Bubsy 3D: Furbitten Planet or Bubsy is 3D in \"Furbitten Planet\") is a platform video game developed by Eidetic and published by Accolade for the PlayStation video game console. It is the fourth game in the Bubsy series as well as the first Bubsy game in 3D. A Sega Saturn version was in development for 1997, but never released. The game was released on November 25, 1996 in North America and in August 1997 in Europe. The game's complete name is a play on words in reference to Forbidden Planet, a 1956 sci-fi film. The game follows Bubsy, an orange bobcat and the central character of the Bubsy series, who must stop a race of aliens known as the Woolies from stealing all of the Earth's yarn by traveling across their home planet of Rayon and collecting rocket pieces and atoms in order to build a rocket ship and return safely to Earth. A Sega Saturn version, known as Bubsy III in development, was also planned and would have apparently been based on the original Sega 32X development models. It was stated to come out in Winter 1996, as noted on GamePro Magazine, but was then stated to be delayed to Spring 1997 on Accolade's official website, and eventually cancelled outright due to the failure of the PlayStation version. Currently, no prototypes of the Saturn port have resurfaced and very little info on the port exists (besides articles mentioning the game coming out on the Sega Saturn). https://bubsy.fandom.com/wiki/Bubsy_3D#:~:text=%20Bubsy%203D%20%201%20Gameplay.%20The%20objective,4%20Characters.%20%205%20Adversaries.%20%20More https://lostmediawiki.com/Bubsy_3D_(lost_Sega_Saturn_port_of_3D_platformer;_1996-1997)", "platform": "Sega Saturn", "release_date": "1997", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Eidetic", "publishers": "Accolade", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "2", "wikipedia": "https://en.wikipedia.org/wiki/Bubsy_3D", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149665-bubsy-3d-furbitten-planet\n"}