{"altername_name": ["Crows: The Battle Action For Sega Saturn"], "name": "Crows: The Battle Action For Sega Saturn", "overview": "Crows: The Battle Action is a beat-'em-up for the Sega Saturn. It is a 2D beat-'em-up based on the Crows manga series, where characters have super-deformed heads. Published by obscure developer Athena Co., it appears at first glance heavily inspired by Technos 'own hot-blooded Kunio/Nekketsu beat-'em-ups, going for River City Ransom's fighting style and super-deformed looks in particular. As it turns out, it's no coincidence; a look at the credits reveals that quite a few former Technos employees worked on it, including executive producer Teruo Ishikawa, the composers, and about half the graphics team. Most notably, the person in charge of the visuals was Kouji Ogata. Gameplay: The game's structure is linear, dividing the game into numerous short levels where you fight various types of hoodlums, cops and drunken salary men. Some areas also feature young couples sitting on benches or cleaning crews - they will mind their business as long as they're left alone, but hitting them will attract more cops or stir them into fighting back. Though it appears to be shown from a side-view, the stages are actually skewed at an angle, so heading North or South has the characters walking diagonally, which takes some getting used to. The soundtrack mostly consists of standard rock-oriented stuff. It supports the action well enough but only the intro theme really stands out, with its pounding, oddly creepy percussions and strong melodic line. While there is no story in-game aside from a text intro and a brief recorded speech before the credits roll, the levels and bosses are based on five story arcs from the manga, starting with the confrontation with the Front of Armament and ending with the struggle for the top among the new generation of Suzuran freshmen. There are two characters available initially, Bouya and his early rival Rindaman , a quiet loner with legendary strength. As you advance in the game you will unlock two more characters, whom you must first defeat: Ryuushin , the Front of Armament's vice-president when you first encounter him, and Tatsuya Bitou , the middle brother of the Housen. They do not join right after you beat them, but at later points in the story corresponding to their becoming allies in the manga. Crows fans will be disappointed that many of the most likeable among the series' massive cast of character are nowhere to be found such as Bulldog , Ebizuka trio ,Maruken and Kakuken . On the other hand, the final battle pits you against none other than Zetton on the school's rooftop, a scene from the manga. Some minor antagonists appear exclusively in two-player mode, as sub-bosses immediately preceding the main boss fights.", "platform": "Sega Saturn", "release_date": "December 18, 1997", "game_type": "Released", "esrb": "", "developers": "Athena", "publishers": "Athena", "genres": "Beat 'em Up", "max_players": "2", "cooperative": "No", "rating": "3.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11445-crows-the-battle-action-for-sega-saturn\n"}