{"altername_name": [], "name": "Darius Gaiden", "overview": "Darius Gaiden is a 1994 horizontal-scrolling shooter arcade game developed and published by Taito. The fifth entry in its Darius series, players control a starship named the Silver Hawk in its mission to destroy the Belsar empire before it wipes out the population of planet Darius. Gaiden adds several new features to the core concepts of its predecessors, including screen-clearing black hole bombs and the ability to capture mid-level bosses. The game has been ported to several consoles, including the Sega Saturn and PlayStation. Darius Gaiden is a horizontal-scrolling shooter video game. The player controls a starship named the Silver Hawk in its mission to obliterate the Belsar empire, which is plotting to destroy what is left of the human race and their new home of planet Darius. A second player can join in at any time. The game uses a non-linear level progression system where players can select whichever level they choose after completing the previous one. There are twenty-seven stages total, with the player only being able to play seven of them at a time. In these levels, the Silver Hawk must destroy constantly moving formations of enemies while avoiding their projectiles, as well as dodging obstacles. Enemies are made to resemble fish, crabs, seahorses, and other aquatic creatures. Levels conclude with a boss that must be defeated by destroying its weak spot, such as its head or mouth. The Silver Hawk begins the game with a forward-moving shot. Collecting colored emblems dropped by correspondingly colored enemies allows the player to power-up the Silver Hawk's abilities. Green emblems grant the player missiles, red emblems increase the length and power of shots, and blue emblems give the player a protective shield. Collecting additional emblems upgrades the player's weapons, such as a stronger shield or missiles that move forwards and backwards. The Silver Hawk also begins the game with three black hole bombs. Firing them creates a large swirling vortex that sucks in all enemies and projectiles, followed by lightning strikes that inflict massive damage on enemies. The Silver Hawk also has the ability to capture minibosses, which appear in the middle of most levels. This is accomplished by destroying the energy orb on its head and collecting it when it flies off. Captured minibosses ally with the player and fire their own weapons at enemies for a brief period of time, before they self-destruct.", "platform": "Sega Saturn", "release_date": "December 15, 1995", "game_type": "Released", "esrb": "E - Everyone", "developers": "Aisystem Tokyo", "publishers": "Acclaim Entertainment", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.96", "wikipedia": "https://en.wikipedia.org/wiki/Darius_Gaiden", "video_link": "https://www.youtube.com/watch?v=JrvDDh5vU58", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10810-darius-gaiden\n"}