{"altername_name": ["Ogre Battle: The March of the Black Queen"], "name": "Densetsu no Ogre Battle", "overview": "Twenty-five years ago Empress Endora conquered the entire continent of Zetegenia. Her reign proved to be tyrannical, and people of different social classes and positions began to long for a better future. Eventually, a resistance movement called the Liberation Army was formed. The protagonist (whose name and background are chosen by the player) takes command of the new army, and leads his allies towards a revolution. Ogre Battle has elements of a real-time strategy game and a tactical RPG. The player manages a large army consisting of characters belonging to a vast amount of different classes. These classes include military specializations as well as mythological creatures such as dragons, angels, hellhounds, undead trees, etc. Each class its own unique characteristics and abilities in battle. For example, vampires and werewolves can only be deployed when the battle takes place during the night. The player moves troops in real time on the tactical map. Individual battles between units are handled in a turn-based RPG style. The player is able to select general commands for the battle, as well as use powerful tarot cards for special techniques. Characters level up, change classes and grow stronger over the course of the game. The player can also purchase items in towns. The protagonist's reputation is affected by the player's decisions during the storyline. The player can make choices that may prove to be popular or unpopular with the nation in contact with the Liberation Army. In addition, every character has his or her own alignment, ranging from good to evil. Liberating towns with evil characters may lower the army's reputation. These and other choices affect the plot's development and eventually lead to one of the thirteen possible endings.", "platform": "Sega Saturn", "release_date": "November 1, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Riverhill Soft", "publishers": "Riverhill Soft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106996-densetsu-no-ogre-battle\n"}