{"altername_name": ["守护英雄"], "name": "Guardian Heroes", "overview": "Ages ago, the spirits of Earth and Sky waged war on each other. Neither could win, and eventually the Sky Spirits bestowed some humans with their powers, turning them into wizards and allies in the war. The Earth Spirits were banished into darkness; but the Sky Spirits feared the human wizards and cast them underground as well. Years have passed, and a powerful wizard named Kanon escaped from the gloomy prison and turned the human land into a puppet state trembling before his might. One legendary sword is said to bring an end to Kanon's reign. Four warriors - Han, Randy, Nicole and Ginjirou - retrieved the sword, but knights sent by Kanon are determined to take it away and destroy it at all costs. Aided by the renegade knight Serena, the four heroes must keep the world safe and protect themselves against the onslaught. Guardian Heroes is a hybrid of a side-scrolling beat-em-up and a role-playing game. The four initial player characters are distinguished by their attributes and abilities: Han is a strong fighter who cannot use magic; Randy is a sorcerer who can cast attack spells but is physically more vulnerable; Ginjirou is a ninja-type, agile character; finally, Nicole has weak attacks but can cast healing spells. The fighting mechanic is slightly deeper than in most other games of this type, with light and heavy attacks, special moves (executed the same way as usually in fighting games), magical attacks and the ability to block. Defeating enemies yields experience points, with which the player can upgrade the characters between levels, sharing them between various factors such as strength, speed, constitution and magic resistance. The game has a branching storyline that develops according to the player's selection of stages. There is also a \"Karma\" system that evaluates the player's actions depending on how he or she treats enemies or innocent people in the game world. Even in one-player mode there are always two controllable characters on screen - the player commands the other character by changing his \"mood\" - aggressive, cowardly etc. - of which there are six. On top of this, it is possible to play the game as a more traditional beat-em-up with up to six players (human or AI-controlled); in this mode it is possible to play as any character encountered during the main game mode.", "platform": "Sega Saturn", "release_date": "January 26, 1996", "game_type": "Released", "esrb": "T - Teen", "developers": "Treasure", "publishers": "Sega", "genres": "Beat 'em Up", "max_players": "4", "cooperative": "Yes", "rating": "4.24", "wikipedia": "https://en.wikipedia.org/wiki/Guardian_Heroes", "video_link": "https://www.youtube.com/watch?v=9eFOlIf6Hps", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/2267-guardian-heroes\n"}