{"altername_name": ["The Photograph of a Crime: Hankou Shashin: Shibarareta Shoujo-tachi no Mita Mono wa"], "name": "Hankou Shashin: Shibarareta Shoujo-tachi no Mita Mono ha?", "overview": "An idol group known as Otomegumi (乙女組) is staying at the western-style boarding house in a spa resort in Izu (伊豆), Japan. You, Takeshi Gouda (郷田 武史), as a professional photographer came, along with your team which includes Ryouichi Akada (赤田 良一), your editor, and Takuya Sasaki (佐々木 拓也), your young assistant, to make a photo album of that very idol group. As you arrive at the boarding house you meet with Otomegumi idol group consisting of Rei, Maki, and Shouko, as well as with some other suspicious looking characters on the premise. Due to a sudden storm, you decide to wait it out and use that opportunity to get to know everyone a little better. But the evening doesn't go as well as expected and some unpleasant words are exchanged with Seiji Tashiro (田代 成治), an idol group manager. Ryouichi had to step in a couple of time to prevent things from escalating, but by the time everyone went to bed it all seemed to have quiet down. Next morning, you, the idol group, Ryouichi, Takuya, and Chieko Naemura (苗村 千恵子) who is a stylist for Otomegumi idol group all went to hot springs for some photo session. The photos are going fine and things were about to wrap up when the distressing rumor about someone being dead back at the boarding house have reached you. You all pack your things and head back to the boarding house. There, you find the owners of the boarding house, Kyousuke Nakagawa (中川 京介) and his wife Reiko Nakagawa (中川 麗子), standing in front of a room of none other than Seiji Tashiro who was a troublemaker since the moment you met him. At closer inspection you soon realize it's a murder as he appears to have been stabbed with a knife. But who would have a reason to kill him? Suspects... motives... opportunities... anyone could be the killers, and to top it all, you cannot call the police as phone line appears to be dead. With the killer among you, what was to be a nice relaxing vacation is turning into a murder mystery that is far from being over. The game plays like a straight visual novel consisting of text over current background which is comprised on many photo stills to match the dialogue and emotion of the scene in question. Occasionally the player is presented with dialogue choices which may affect the current situation but there is no real branching in the main story, just different reactions by the people addressing you. Voice-acting is almost non-present and appears only in key dialogues between the player and the idols, and usually for no more than a single short sentence. In photo session player can take a limited number of photos but does not control camera movement, instead, camera moves up and down once and the player has the chance to take a photo or keep the movie to use on the next pose. Limited bonus contained in a package is an envelope containing an actual photo from one of the photo sessions in the game.", "platform": "Sega Saturn", "release_date": "June 14, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Imagineer", "publishers": "Imagineer", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107034-hankou-shashin-shibarareta-shoujo-tachi-no-mita-mono-ha\n"}