{"altername_name": ["Initial D: Koudou Saisoku Densetsu", "Koudou Saisoku Densetsu: Initial D"], "name": "Initial D", "overview": "Initial D: Koudou Saisoku Densetsu (頭文字Ｄ 公道最速伝説) is a 1998 racing game for the Sega Saturn tying into the Initial D media franchise. It was the only game in the franchise released on a Sega system; Sega themselves would later license the franchise for an on-going series of arcade and console games. Initial D, a popular long running manga series, has spawned not only an equally popular anime series and a live-action movie adaptation, but several video games over the years. The series' first appearance on home consoles occurred in 1998, with the release of Initial D for PlayStation and Sega Saturn. The series follows Takumi, an indolent teenager who, after delivering tofu for his dad's business in the early hours of the morning, finds himself to be something of an expert in the art of drifting down mountain roads. This in turn leads to him and others racing each other on a variety of Japanese mountains – perfect video game fodder. The main guts of the game is the Story Mode which sets up a series of races via some FMV clips and static CG images. There is no voice acting in either of these which is immediately jarring and something that instantly stands out when played today. The music deserves a mention also. Anyone who has even a basic knowledge of Initial D will know that it is defined by not only fast paced drift racing, but an equally high energy Eurobeat soundtrack. Inexplicably, this is missing entirely from the game. The music used sets the atmosphere well, but fans will notice the change and will lament what feels like a missed opportunity to add to the authenticity of the game.", "platform": "Sega Saturn", "release_date": "June 25, 1998", "game_type": "Released", "esrb": "", "developers": "Genki", "publishers": "Kodansha", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3.54", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90869-initial-d\n"}