{"altername_name": ["Junclassic C.C. & Rope Club"], "name": "Jun Classic Country Club & Rope Club", "overview": "Junclassic C.C. & Rope Club is a golf game released for the Sega Saturn & the Playstation One consoles. The game features 2 different courses each of them with 3 different routes. Golf is a precision club and ball sport in which competing players (or golfers) use many types of clubs to hit balls into a series of holes on a course using the fewest number of strokes. Golf is defined, in the rules of golf, as \"playing a ball with a club from the teeing ground into the hole by a stroke or successive strokes in accordance with the Rules.\" The Japan Golf Tour is a prominent golf tour. It was founded in 1973 and as of 2006 it offers the third highest annual prize fund out of the regular (that is not for seniors) men's professional tours after the PGA Tour and the European Tour. However since the early 1990s, the growth in prize money has not kept pace with that on the two larger tours. Official events on the Japan Golf Tour count for World Golf Ranking points, and success on the tour can also qualify members to play in the majors. The Gene Sarazen Jun Classic Country Club has been a golf tournament on the Japan Golf Tour from 1977 to 1999. It was played at the Jun Classic Country Club and the Rope Club in Tochigi prefecture . Laid on a gently rolling hill of Southern Nasu Highlands.Designed by Japanese architects, Tadashi Sasaki and Susumu Miyazaki under the supervision of legendary Gene Sarazen. As you may know, Sarazen is an inventor of sand wedge, and of course, there are many various bunkers on this course. Fairways are spacious and long, and many small and big ponds serve as hazards as well as bunkers. Rope Club is a sister course of Jun Classic Country Club and was designed by Tadashi Sasaki under the supervision of Gene Sarazen. A parkland course with long and spacious fairways. Varied bunkers,many of them are beach bunkers are placed here and there.", "platform": "Sega Saturn", "release_date": "December 18, 1997", "game_type": "Released", "esrb": "", "developers": "T&E Soft", "publishers": "T&E Soft", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.8", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90895-jun-classic-country-club-rope-club\n"}