{"altername_name": ["機動戦士ガンダム ギレンの野望", "Kidou Senshi Gundam: Gihren no Yabou: Kouryaku Shireisho"], "name": "Kidou Senshi Gundam: Giren no Yabou", "overview": "Gihren's Greed is a tun-based strategy set in the Gundam universe. The game follows a One Year War between Zion Dukedom and United Nations. The war lasts 150 turns for the player where player can either try to achieve scenario victory or complete victory over the enemy. There are two story based campaign where player can play on either side of the conflict. The battlefield uses hexagonal grid where player can produce or move units, conquer cities or attack enemy forces on ground, in the air, and even in space. The battlefield is split into two maps; a world map that lets player conquer all the continents, and space map which focuses on the battle in planet's orbit. Battles take place simultaneously and player can switch between two maps at any point during the game. Units consist of tanks, planes, spaceships, and most importantly, mobile suits which can battle both in space and on the planet. On either side the player has access to all his generals and commanders, and just as some ace pilots, they will often comment on the situation when engaging in combat. The map doesn't feature fog-of-war, but enemy units outside the scope of your own are not visible. The game effectively removes trial-and-error style of gameplay where player may try to attack an enemy until the random battle turns in his favor by performing all battles at the end of each turn rather than at the moment of attacking the enemy. So in a way, each turn is plan of attack rather than an array of individual skirmishes. Terrain limits movement to ground forces, making tanks move faster on the roads than through forests or over mountains. Having multiple units surrounding enemy will result in additional fire support to your troops and will deal more damage to the unit that you are attacking or is attacking you. Game manuals is split in two parts; first half is typical gameplay tutorial, while the second part contains an illustrated scenes and list of some key military operations in One Year War from Gundam universe.", "platform": "Sega Saturn", "release_date": "April 9, 1998", "game_type": "Released", "esrb": "", "developers": "CRI", "publishers": "Bandai", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107064-kidou-senshi-gundam-giren-no-yabou\n"}