{"altername_name": [], "name": "Kururin Pa!", "overview": "Kururin Pa is one of a pair that were released on the Saturn - the second game Shingata Kururinpa was a slightly improved version of this the original, but they are still both enjoyable games in their own right. I tend to rate how well they play as one player or two (human) player games depending on how complicated they are - this is definitely a little more advanced than Tetris, or Panic Bomber and comes across as a sort of hybrid of those two games. Panic Bomber was unfortunately and inexplicably never ported to the Saturn so this is probably the closest concept you'll get to it. Basically, to get rid of blocks on your level, you have to connect as many of the bomb fuses that drop together as possible, to form links. Then blow them up with bombs that fall. Problem is, you can't just use the bombs that drop, you then have to wait for the fire balls to drop for the bombs to explode. If your opponent is quicker than you, you'll end up with what look like snowmen's heads dropping all over your side of the screen causing you all sorts of issues. This is what I mean when I say that most of the decent split screen puzzle games play completely different to the rest. People just manage to come up with original ideas and place them over an unoriginal format. This is certainly not the best two player puzzler on the Saturn but if you can perhaps get it cheap enough it's really good fun with two humans. The one player game on this I find less enjoyable because it's far more complicated than others and it's great to see which of your real life friends has more wits about them than you.", "platform": "Sega Saturn", "release_date": "February 26, 1996", "game_type": "Released", "esrb": "", "developers": "Sky Think Systems", "publishers": "Sky Think Systems", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90903-kururin-pa\n"}