{"altername_name": ["linda 3 - kanzenban", "リンダキューブ 完全版", "Linda Cube: Perfect Edition", "Linda^3 Kanzenban"], "name": "Linda 3 Kanzenban", "overview": "Linda³ Kanzenban started it’s life as a PC Engine game developed by MARS. It was later ported by Alfa System to the Playstation and then to the Saturn, both of which featured updated graphics and anime cutscenes. The Saturn version includes content that was censored in the Playstation version of the game due to explicit violence and gore. The Saturn version also featured a 24-track soundtrack CD with three karaoke tracks. Linda is a really weird game. It’s the juxtaposition of cuteness and gore that’s so bizarre… and cool! The game is set in Neo Kenya, a doomed world waiting on an inbound impact from an asteroid called Grim Reaper. The occupants of the world begin evacuating but WON’T SOMEONE THINK OF THE ANIMALS? won't someone think of the animals? Out of nowhere, a mysterious Ark appears vaguely resembling the one in the Christian bible. On that ark is a monolith giving the instructions to gather two of every animal. You play the game as Ken, who finds himself and his girlfriend Linda chosen as the two to spearhead the project and pilot the ark to it’s destination. Linda³ lives up to it’s exponential title by offering three different scenarios to play, all in different timelines where various things are different for Ken and Linda. The first two scenarios offer a serious story, while the third is downright parody of the game’s setting and plots in the other scenarios. The first scenario finds Linda kidnapped and rendered amnesiac by his apparent evil twin, who is dressed in… a Santa outfit? Yeah, a Santa outfit. Linda³ santa clone The second scenario, Ken and Linda are attacked on their wedding night and Linda loses her left arm. It’s okay, though, because she gets a replacement arm… by Doctor Hitler! Linda³ hitler doctor The third scenario finds Ken waking up from a coma (induced by a banana!) to find out he and Linda are already married. The Saturn version of the game has an additional fourth scenario! It’s a time attack mode that’s hard as balls to complete unless you know the game well. The gameplay in Linda³ primarily centers on fighting animals until they are weak and capturing them. You have eight game years (or 32 seasons) to complete your goal of gathering all of the animals required to finish the game. Ken and Linda can be assisted by animals once they’re captured. Gameplay is pretty standard, menu-driven JRPG fare otherwise, complete with cuter than Dragon Quest sprites for most of the animals. Male animals can be used to make weapons, female animals can be used to craft armor. The stats of both depends on the animal used to create them. In addition to becoming leather fodder, animals can also be used to feed and heal the main characters. Linda³ artwork As you collect animals and register them in the ark, you gain stat bonuses, new abilities and beast forms for Ken and Linda. The beast forms can be chosen in battle to give specific statistical or terrain bonuses. Shops in town offer quite a wide range. How many RPGs have black markets, furniture stores, a banking system, an incubator service, a vivisectionist, trappers, bounty hunters, cage matches, dog fighting, and a veterinary service? Insane. Seasons progress, giving you access to different animals and food to encounter. As time marches on, the populace of the world packs up and moves out. You ultimately end up exploring a mostly empty world if you allow enough time to pass. Entire towns can become abandoned. You really get a sense of a world being evacuated, which is fantastic. Should you fail to complete your task in time, Ken and Linda will be left on the planet to die. If the artwork above or below looks familiar, it might be because the game’s character designer was Tatsuyuki Tanaka. He’s been involved with loads of classic anime movies and series like Akira, Bubblegum Crisis, and Nadia: The Secret of Blue Water. He’s got that classic 80s anime style.", "platform": "Sega Saturn", "release_date": "June 16, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "AlfaSystem", "publishers": "ASCII", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.58", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114366-linda-3-kanzenban\n"}