{"altername_name": [], "name": "Madden NFL 98", "overview": "Madden NFL 98 is the second game in the series to appear on PlayStation and Saturn. It is based closely on the previous year's edition, but with the usual updates, revisions and several new features. Compared to versions on other platforms, the 32-bit console version comes with its own graphics engine and selection of teams, modes and options. The game includes the 30 teams of the 1997 NFL season, the 1997 All-Madden team and 85 classic teams from NFL history, spanning 1960 to 1996. All the team's home stadiums plus the Pro Bowl stadium in Hawaii and the Super Bowl stadium in San Diego are available. Further teams and stadiums can be unlocked via secret codes. Returning playing modes from the predecessor are Exhibition, Season (including Playoffs and Super Bowl, based on the 1997 NFL schedule) and Tournament (8 or 16 player single elimination). Added to these are the new Custom Season and Fantasy Draft. Custom Season allows players to customize the NFL divisions and thus the schedule with all available teams, including the classic teams. Fantasy Draft is a custom tournament mode for four or eight teams. Players create their own teams by giving them names and then drafting players. The tournament consists of a round-robin round followed by semi-finals and finals. The option of creating and trading players also returns, and can be made more realistic by employing salary caps and trading deadlines within a season. During a game, the same graphics style employed by the previous year's game is used: polygonally-rendered 3D stadiums with players, ball and referees as 2D bitmaps. The camera can be toggled between several perspectives, with most returning from the predecessor, but some being replaced by new ones.", "platform": "Sega Saturn", "release_date": "August 26, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Tiburon Entertainment", "publishers": "EA Sports", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.86", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10869-madden-nfl-98\n"}