{"altername_name": ["Rockman X4"], "name": "Mega Man X4", "overview": "Mega Man X4, originally released in Japan as Rockman X4 (ロックマンX4?), is a video game developed by Capcom. It is the fourth game in the Mega Man X series and the second game in the series to be released on the Sega Saturn and PlayStation. The two versions were released simultaneously in Japan on August 1, 1997. A North America release followed sometime thereafter, while Europe received only the PlayStation version on October 13, 1997. Taking place in the 22nd century, the Mega Man X series is set in a society populated by humans and intelligent robots called \"Reploids\". A military taskforce called the \"Maverick Hunters\" is implemented to suppress the uprising of \"Mavericks\", Reploids that begin to exhibit dangerous and destructive behavior. Mega Man X4 follows two such hunters, Mega Man X and Zero, as they become involved in a conflict between the Hunters and a Reploid army called the \"Repliforce\". Mega Man X4 is an action-platform game in the same vein as other installments in the series. The player completes a set of eight stages in any order while fighting enemies, gaining power-ups, and winning the special weapon of each stage's boss. Unlike previous games in the series, Mega Man X4 allows the player to choose between the two protagonists at the beginning of the game: X, who uses traditional, long-range attacks; or Zero, who wields a short-range sword. Critical reception for Mega Man X4 has been generally positive. Critics praised the ability to play as either X or Zero, a concept many found to expand upon the then perceived exhausted gameplay formula of the Mega Man X sub-franchise during the 1990s. In addition to its console versions, the game was released on Windows worldwide in 1998 and 1999 and on Japanese mobile phones in 2011 and 2012. It was also included on the Mega Man X Collection, a compilation released in North America on the PlayStation 2 and Nintendo GameCube in 2006. Mega Man X4 was made available on the PlayStation Network as part of the PSOne Classics line on September 2, 2014 in North America and December 17, 2014 in Japan.", "platform": "Sega Saturn", "release_date": "August 1, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Capcom", "publishers": "Capcom", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.10", "wikipedia": "https://en.wikipedia.org/wiki/Mega_Man_X4", "video_link": "https://www.youtube.com/watch?v=Z-8Jf07KIlU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10875-mega-man-x4\n"}