{"altername_name": ["Rockman 8: Metal Heroes", "Mega Man 8"], "name": "Mega Man 8: Anniversary Collector's Edition", "overview": "Mega Man 8: Anniversary Edition (more known as Mega Man 8, known in Japan as Rockman 8: Metal Heroes) is a side-scrolling action platformer developed and published by Capcom for the Sega Saturn and PlayStation on January 1997. It is the eighth installment of the original Mega Man series (and the sequel to Mega Man 7). The only official installment of the series for 32-bit consoles, Mega Man 8 introduces a brand new art style (the second complete change in the series) and cutscenes detailed in animated full-motion video. The game commemorates the 10th anniversary of the series and is the last titled game in the franchise for 11 years (before Mega Man 9). Set in the year 20XX, the game takes place shortly after the events of Mega Man 7 (in which the humanoid robot hero Mega Man defeats both the evil roboticist Dr. Wily, for the seventh time, and new-found rival Bass). Two mysterious forces battle in outer space before crash-landing down to Earth, causing Mega Man (who was battling Bass at the time) to investigate. When he reaches the crater, he sees Dr. Wily (flying away with a mysterious purple orb) and a mysterious damaged robot to send back to Dr. Light for repair. When Dr. Wily sends a new group of Robot Masters to combat Mega Man, our hero must battle Dr. Wily's forces while investigating the connection between the purple orbs and the damaged robot. Because the PlayStation version was rushed to be released a month before the Sega Saturn version, the Sega Saturn version received some bonus additions, most notably access to special material (such as official artwork and sound test mode) and two new mini-boss battles (Cut Man from the original Mega Man and Wood Man from Mega Man 2). The PlayStation version of the game was later released (in North America only) as part of the Mega Man Anniversary Collection compilation for the PlayStation 2 and GameCube on June 23, 2004 and the Xbox on March 15, 2005. An unofficial 8-bit \"demake\" of Mega Man 8 was finished in 2010, coinciding with the release of the deliberately-retro Mega Man 10. More information can be found here. Shortly after the game was released, Capcom began porting the game for the Super Nintendo Entertainment System, with the intent of selling it to those who have not purchased one of the two 32-bit consoles. Not wanting to make a half-hearted attempt, they ended up making an original Mega Man game (exclusively for Japan in its original run) using most of the assets from Mega Man 8 (including two of the game's bosses, Tengu Man and Astro Man), titled Rockman & Forte. -Gameplay The gameplay is similar to the previous games, but with some additions. The main priority is the player picks a level and fights the end boss; Mega Man will earn a weapon for defeating the boss. Rush also returns with some special abilities. Also returning from Mega Man 7 is the item store. Like Mega Man 7, only four robot masters are available at the start. After the player beats the first four, the other four will appear. The weapons earned from the first four robot masters play a big role in the other four levels; for example, in Search Man's stage, the thunder claw that was earned from Clown Man, is used to get through spiked gaps by using the thunder claw to grab on to metal poles and swing to the other side. Rush returns in Mega Man 8, this time with new abilities. Old abilities like Rush Marine and Rush Coil have been retired, but new abilities are introduced. Each new ability can be earned by defeating the mid bosses in some of the game's levels. The first new ability is Rush can transform into a motorcycle - Mega Man can hop on, shoot projectiles, and run at high speed. The other is Rush will drop a random item for Mega Man, which can be a health item or ammunition for Mega Man's weapon. Rush can also fly up in the air and drop health or ammunition items for Mega Man. The last new ability is Rush can fly up in the air and aid Mega Man in battle by dropping missiles on enemies.", "platform": "Sega Saturn", "release_date": "January 17, 1997", "game_type": "Released", "esrb": "E - Everyone", "developers": "Capcom", "publishers": "Capcom", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.06", "wikipedia": "https://en.wikipedia.org/wiki/Mega_Man_8", "video_link": "https://www.youtube.com/watch?v=X_vEnrvJsWY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5999-mega-man-8-anniversary-collectors-edition\n"}