{"altername_name": [], "name": "Rampo", "overview": "Rampo is an interactive movie which uses pre-rendered backdrops and live actors much in the veins of The 7th Guest, without the puzzle-solving part. The game features Edogawa Rampo, a Japanese mystery novel writer, as a protagonist and is based on the movie with the same name which was released a year earlier. In real life, Edogawa Rampo (江戸川 乱歩) is a pseudonym of Hirai Tarou (平井 太郎), a Japanese novelist who wrote mystery fiction in the early-to-middle of 20th century. Having a writer's block and still under influence that your work has been banned from publishing due to the level of disturbance portrayed, with your editor, Yokomizo Seishi, pressing you to write your next piece, you just can't wrap around your head to make it happen. So you get up from your writing desk and head to do the landlord business and pick up the rent from the occupants. The place is man-exclusive, there is no women allowed, yet you secretly find out someone has been bringing a woman and not just to talk to. What may have started as debauchery will soon turn your life around when it reveals a much bigger mystery than you bargained for. The game is played in 1st-person perspective where you can turn left or right, or move forward and backward. Moving forward in closed locations will often end up in zooming certain objects and occasionally pick them up if they are of any importance. Picked up objects can be viewed in your inventory and used in certain locations or during dialogues. Movie is not free 3D movement, but instead uses pre-rendered cutscenes for every movement animation. Characters will often cycle through their dialogues unless there is a time where you can inquire about some item from your inventory. Yokomizo Seishi, your editor, will accompany you and will often provide comments when you won't be able to go to certain areas or if you try to do weird things (i.e. try to go outside without a reason, or try to unlock someone else's room without a proper cause). Occasionally your protagonist will also speak, at which moment the picture will be frozen (there is no idle movements of characters or animate objects in the areas when you're talking or just standing still).", "platform": "Sega Saturn", "release_date": "February 24, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "System Sacom", "publishers": "Sega Enterprises", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107150-rampo\n"}