{"altername_name": ["Stakes Winner: GI Kanzen Seiha Heno Michi"], "name": "Stakes Winner: GI Kanzen Seiha e no Michi", "overview": "Stakes Winner is a horse racing game. Races can be entered by one or two players and involve eight horses struggling for victory; each of the eight horses (in the order which the game presents them in: White Heat, Hot Sand, Euro Union, Asian Hope, Brave Lady —the sole female one—, Be Silent, US Fighter, Sky Dancer) given for selection is characterized by three parameters (named «abilities» in-game): speed, stamina, strength, all measured in stars from a minimum of one to a maximum of five. Rival horses are not available for selection to the player: their names are, for instance, the ominous- or hilarious-sounding «Mr Devious», «Red Vision», «Sunk Star», «HelpMe», «OhMygod», «Nutseater». The names are also differentiated by being written all in capital letters the latter ones, normally the former. Before the beginning of the race, while horses approach the starting point, the name of the circuit, course plan, prize money and circuit time record are displayed. During the race, the indicators on the screen are: the course plan (with a moving coloured circular indicator representing the position of each contender), the chronometric indication of time, the horse's energy bar with a line composed of three segments beside it: a red one (that means the horse is in its full strength), a yellow and a blue one (denoting lack of strength); a representation of the horse's face, which portrays its, more or less fatigued or strong status and how intensely it is running.", "platform": "Sega Saturn", "release_date": "December 6, 1996", "game_type": "Released", "esrb": "", "developers": "Saurus", "publishers": "SNK", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91435-stakes-winner-gi-kanzen-seiha-e-no-michi\n"}