{"altername_name": [], "name": "The Sacred Pools", "overview": "The Sacred Pools is an unreleased FMV game by Sega planned for release in 1997. The game was a new arrival to the FMV market that was pushed as an “erotic thriller” for older audiences. With a reported budget of 2-3 million dollars, Sega’s new division SegaSoft aimed to expand the experiences available on Saturn, PC, Macintosh, and PlayStation. The Sacred Pools is a strange, ambitious misfire that could only come from a 90s FMV game. Some things surprisingly hold up. The video footage you see is well-shot and the set design and costumes are something to behold — the multi-million dollar budget really shows. In the press, SegaSoft toted the game’s VNRS technology (“Virtual Navigation in Real Space”), which allowed seamless 3D movement in FMV environments. There is not much information about VNRS but you can see a crumb of it in gameplay. There are hardly any cuts in Sacred Pools. When you have to make a turn, the camera follows your POV. It often does feel like 3D. The focus of the game is exploring the mazes littered across the world. You get few clues as to where you should go, and you’ll often end up at a dead end, lost, face-to-face with an enemy. You watch the camera trudge down the wrong way and then watch it reverse. The mazes make the game feel extraordinarily slow at times. Although The Sacred Pools made a legendary debut at E3 1996, the press panned the game for its quality and it was quietly pushed aside to never be heard from again. Prototypes for the game were dumped via Gaming Alexandria on October 31, 2022.", "platform": "Sega Saturn", "release_date": "", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "SegaSoft", "publishers": "Sega", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=TEhqbATj-mA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166744-the-sacred-pools\n"}