{"altername_name": [], "name": "Virus", "overview": "It is the 22nd century. Human beings have long reached outer space and traveled to other planets. But they could not find happiness, and soon their only source of feelings became the \"Cyber Net\", a virtual world where people could experience simple emotions such as love or hatred. One day, a deadly virus was discovered in the Cyber Net. A special unit called Blue Metal was sent to annihilate the virus. But something went wrong, and the members of the unit were killed. Serge Shadix survived, but his brother Leon never came back. This accident made Serge join a force called STAND (Special Team for Alert to Network Destruction), which specialized in cybernetic crimes. Will Serge be able to solve the mystery and discover the secret of the virus? Virus is an adventure game with elements of a shooter, similar in concept to Snatcher, but with much more developed and frequent combat. During the adventure portions of the game, the player views locations and talks to characters from first-person perspective, interacting with the environment by selecting command icons from a bar on the bottom of the screen, and then moving the cursor on the screen to select the object to interact with in a point-and-click fashion. The game has many more puzzles than most other Japanese-style adventures; most of them are logic- or memory-based, though a few require the player to explore the environment and use inventory items. The protagonist often enters and explores first-person 3D dungeon-like areas, where he can physically move around and also encounter enemies. Battles take place on a separate screen; the hero fights by aiming at enemies and shooting at them in real time. Each action in combat costs action points (AP); once the main character's AP bar is depleted, he cannot perform actions until it refills gradually or until the player uses an AP-restoring item. It is also possible to use shields and various offensive items during combat. Weapons and items can be bought in stores. Many boss battles require the player to locate the enemy's weakpoint and attack it.", "platform": "Sega Saturn", "release_date": "August 22, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Hudson Soft", "publishers": "Hudson Soft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107344-virus\n"}