{"altername_name": [], "name": "Voice Fantasia S: Ushinawareta Voice Power", "overview": "The hero of this game is a young man who enjoys playing video games (don't we all?..). One fine day, he rents a new game; after firing it up, a princess appears on the screen, calling for help. A moment later, a demonic hand reaches to the hero and pulls him into the TV! The hero is teleported into an alternate world, a kingdom that is a mixture of medieval and modern day-like environment. This world is in danger, and only those who have the magical \"voice power\" can save it! The hero meets the young female magician named Whip and the princess of the country, Fret; together, they must stop the evil and figure out a way for the hero to go back to his world. Voice Fantasia might look like an RPG, but in reality its gameplay is much closer to the adventure variety, the RPG elements reducing to a mini game-like status. Most of the gameplay here is dedicated to exploring the world, talking to characters, and acquiring and using items needed to advance the story. The infrequent turn-based battles are dictated by the story. Three girls join the party, and are able to use \"voice powers\", which are in effect attacks of various properties. There is no experience system of any kind. There is also a mild \"dating simulation\" element in the game. The player is able to buy presents for the girls, invite them for dinner, etc. When staying at the hotel, those anime-style fantasy characters are replaced by video footage of real voice actresses. The player is able to talk to them and ask a variety of questions.", "platform": "Sega Saturn", "release_date": "July 25, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Japan Media Programming", "publishers": "ASK Kodansha", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107305-voice-fantasia-s-ushinawareta-voice-power\n"}