{"altername_name": ["Wachenroeder", "Wachenroder"], "name": "Wachenröder", "overview": "Wachenröder is a strategy RPG that was released in the late years of the Sega Saturn, and probably the last of its kind. It met with poor sales - in part due to the system's declining popularity - and was soon to be forgotten by the public in spite of its initial critical acclaim, which made an already unlikely localization impossible. It's very upsetting that such a game would tank, because the guys behind it were kind of a dream team. It brought several major figures together including Yasuyuki Ueda and Yoshitoshi Abe (of Serial Experiments Lain fame), art deco-anime artist Range Murata (popular for his work on Last Exile), established composers Satoshi Miyashita (Wings of Thunder) and Takayuki Negishi (Tengai Maykou IV) as well as the founding member of the legendary progressive rock band King Crimson, Ian McDonald, as surprising and unlikely as it may sound. The game is set on the foggy and highly socially stratified Edward Island, and follows the misadventures of Lucian Taylor. His younger sister is bed-stricken due to a pollution-related sickness that has made her extremely light-sensitive, and his irrational guilt about this state of affairs - \"Why am I the healthy one?\" - pushes him to devote himself to her well-being. However, her eventual death forces him on a quest of vengeance around the desolated lands to find Sword Emperor Duran, who he holds responsible for being the manager of hazardous water treatment facilities. The plot doesn't wander into epic battles and maintain a touching and introspective tone, supported by superb hand-drawn artworks, as well as an overall oppressive feeling through unusual cutscenes featuring scale models by a trio of experimented modelists - Takayuki Takeya, Fujita Yasuo and especially Kito Eisaku, who also designed the Nerve Tower of Sting's first person dungeon RPG Baroque which was released around the same time as Wachenröder in 1998.", "platform": "Sega Saturn", "release_date": "August 6, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "TNS", "publishers": "Sega Enterprises", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.79", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33381-wachenroder\n"}