{"name": "Apocalypse", "overview": "A futuristic 3D space shooter.<br><br>You are tasked with destroying a race known as the Rakonans. They have taken over a number of planets and it is your job to destroy the Rakonan colonies on these planets to an extent that they cannot survive and the planet is then 'sterlised'. It can then be re-colonised by the original inhabitants.<br><br>Upon starting the game your craft descends to the planet surface and the battle begins. There are plenty of things to destroy, mainly on the ground, but from time to time you will come under attack from flying saucers and other things in the sky. You are initially based on the ground, but it is possible take off and fly your craft around in the air. However your craft's energy is drained much quicker when flying so to recharge the energy levels you need to return to ground level and stay still for a while.<br><br>Your craft is protected by shields and they can take a number of hits before they are finally destroyed. Shields can be recharged by moving your craft away from enemy fire. Once the shields have been destroyed one single enemy shot will finish you off.<br><br>As you progress around the landscape you will encounter buildings and objects, all of which can be destroyed. However some don't need to be, for example there are small houses which can be flattened but these are harmless so you don't really need to worry about them too much. You should pay more attention to the other objects that fire back at you - these need to disposed of as soon as you see them.<br><br>When you have destroyed enough objects on the planet to sterilise it the mission will end. You will then be presented before the Royal Guild of Spacing who will assess your performance. You will also end up here when your game ends. There are nine planets to sterilise and at the start of the game only one is available so you have to complete each of the planets in order to gain access to the next one.", "platform": "Acorn Archimedes", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Gordon Key", "publishers": "The Fourth Dimension", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/74594"}