{"name": "Boogie Buggy", "overview": "Boogie has arrived at Dodge City only to find that the Evil Monster Lord has taken control and has set about converting power-ore into evil-ore. He is using this to turn all the good in Dodge City into evil. As his power increases he starts to turn Dodge City into a stronghold for creatures of the darkness and other evil monsters and is plotting to take control of Bumper World.<br><br>It is up to Boogie to put a stop to these evil plans. To do this you must travel across Dodge City counteracting the effect of evil-ore in each zone, you must also destroy each of the evil Ore Conversion Plants before finally coming face to face with the Evil Monster Lord himself.<br><br>There are two types of level in the game, The Ore Conversion Plants - viewed from the side, and the City locations - viewed from above.<br><br>In the City locations, the object is to collect all the pieces of evil-ore (of which there are 10) and then drop them down a manhole, then move around the level and collect the next piece of evil-ore and then drop that down a manhole. The process is repeated until the level is cleared of evil and is then good again.<br>There are many bonuses to collect throughout the levels. In addition to the evil-ore there are plasters which will reduce your damage percentage, make sure you collect these at every opportunity as it is very easy to get Boogie damaged. Other pick ups include extra lives, turbo boosts, and bonus points.<br>There's also a chainsaw which will become attached to the front of Boogie and is very useful for disposing of evil monsters, and banana skins which will send Boogie sliding about for a few seconds.<br><br>The Ore Conversion Plant levels are a bit more straight forward, you start at the bottom of the screen and you must guide Boogie to the top of the screen to destroy the Ore Converter. This is achieved by reaching the polarity switch, and reversing it and then make your escape before everything blows up. When all the zones have been completed you will then enter the mine in the heart of the city and face the Evil Monster Lord and must defeat him to complete the game.", "platform": "Acorn Archimedes", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "The Fourth Dimension", "publishers": "The Fourth Dimension", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.44", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79760"}