{"name": "Conqueror", "overview": "In Conqueror, you are in command of one or more tanks on a battlefield against a set of computer-controlled opponents. Each battle level gives you greater numbers and more powerful tanks against increasingly menacing opponents with up to fifteen tanks on each side.<br>In each game you can choose between either having American and British, German or Russian forces, against one of the other two. Each Power has four types of tank - one light, two medium and one heavy - all based on geniune Second World War machines.<br>Conqueror is played in real time on a three-dimensional scrolling landscape with trees, houses and rivers (similar to Zarch).<br><br>Arcade game:<br>The first game consists of a series of battles with your group of tanks against the computer-driven ones. The first combination at level zero is an Amencan Chaffee - fast and light - against a Panzer III which is less powerful.<br><br>Attrition game:<br>You have a standard set of tanks - two light, two medium and a heavy - but the computer starts off with an inferior selection. In each successive battle, the computer's selection becomes more and more potent.<br><br>Strategy game:<br>In this you can choose the tanks you require from a fixed budget, and the computer does likewise. When you win a battle the budget increases. Within this game there are other options such as use of spotter planes and artillery fire which can be bought at the cost of some tank power.<br><br>At all levels you can choose between manual or automatic tank strategy, In the former you control where the tanks on your side go; in the latter this is controlled by the computer but you can override it.<br>Tactical control is via the map, you select a tank and click the position you want it to move to.", "platform": "Acorn Archimedes", "release_date": "1988", "game_type": "Released", "esrb": "", "developers": "David Braben", "publishers": "Superior Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.8", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=R2IEfkj117U", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/81711"}