{"name": "Destiny", "overview": "Destiny is a Doom/Quake style first person shooter and exploring game. The player, armed with a variety of weapons, wanders through landscapes inhabited by assorted enemies, shooting everything in sight and trying to find the exit.<br><br>There is no strict limit to the amount of ammunition you can carry for each weapon. Rather, as the total weight of your equipment increases, so the speed at which you move decreases. And since the heavy items are generally the weapons, rather than their ammunition, you soon choose your favourites and abandon the others in favour of extra speed.<br><br>The use of weight affects other aspects of the game, too. As you carry more, you take more damage from falling long distances and the lower you float in deep water.<br><br>There are underwater passages, too, leading from one above-ground section to another. There will often (in deep water) be two different sets of currents to drag the player around - as happens in real life, the surface flow may be in a completely different direction to what's happening lower down.<br><br>Other secret areas are hidden beyond death-defying leaps, crawl spaces and the usual variety of disguised, pressure-pad activated, or time-locked doors. In one or two cases, the areas are not strictly secret - but these are usually very heavily guarded.<br><br>The player has a Quake-style \"Mouse-look\" available. Alternatively (or additionally), there is an \"auto-look\" option, which changes the viewing angle up or down depending on the gradient of the corridor, making it much easier to blast baddies at the bottom of a staircase whilst standing at the top, and ensuring that your guns are always pointing somewhere useful.", "platform": "Acorn Archimedes", "release_date": "1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Rob Templeman", "publishers": "Tau Press", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.7", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79790"}