{"name": "Morph", "overview": "Morph is an arcade adventure with 15 levels. In order to complete a level you will have to solve a number of puzzles, and the ultimate objective is to find the magical gem. Once you have found it, you need to pick it up and use it, then you will be transported to the next level.<br><br>On your way to obtaining the magical gem you will encounter all manner of obstacles which will try to prevent you from reaching your objective. Throughout the levels you will discover different objects which will be needed to solve the puzzles which will in turn allow you to progress further into the levels.<br><br>Puzzles can be anything from opening a door with the right key or having to find a specific object to carry out a specific task.<br><br>There are also pickup objects which include food, weapons and other items to help you through the quest. You can only carry a certain number of items at one time. These are stored in your pockets. You can only pick up items when you are the main character. When you have morphed into a different creature you cannot pick up items.<br><br>You can only change into other creatures that you have collected the morph for. Morphs are scattered about the levels so watch out for them as by turning into those creatures you then gain certain special abilities. For example if you morph into a cat then you can jump much further than when you are the normal character. There are eight different characters in total.<br><br>Watch out for other creatures as some will try to kill you while others will help you in your quest. The game also uses passwords, so you can skip early completed levels.", "platform": "Acorn Archimedes", "release_date": "", "game_type": "Released", "esrb": "", "developers": "The Fourth Dimension", "publishers": "The Fourth Dimension", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80079"}