{"name": "Powerband", "overview": "Powerband is a Formula 1 racing game with three race modes: Fun, Practice and Championship.<br><br>In Fun mode your car can survive any amount of damage and you can also drive backwards down the track. Also when you enter the garage certain special options are available: A super-powered engine and super-sticky tyres.<br><br>Practice mode allows you to race properly, but before each one you go round the track to get a lap time which affects your starting position on the grid. Each track has its own fastest-time records and if you make it your name will be added to the list.<br><br>When playing in a Championship you are presented with a new sub-menu page with just the garage and race options from the original screen available, but with the addition of load, save and quit icons.<br>After the qualifying lap for position on the grid comes the first race - there are 10 on circuits chosen at random from the 16 available.<br>As you prepare for each new race, you're given a brief rundown and map of the circuit you're about to tackle.<br>The other main options on the menu screen are the Airport and the Garage. The former is used to change your track selection: Some tracks are easier than others, for exampe Hockenheim in Germany has long straights and few tight corners, whereas Suzuka in Japan has lots of alternating turns. At Monte Carlo and Detroit there are tunnels.<br>The garage lets you alter six aspects of your car's performance. There are seven types of gearbox, including an automatic for beginners, three engine tuning levels, three types of tyre, front and rear aerofoils, and steering ratio.", "platform": "Acorn Archimedes", "release_date": "1991", "game_type": "Released", "esrb": "", "developers": "The Fourth Dimension", "publishers": "The Fourth Dimension", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "1.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80098"}