{"altername_name": ["Mr. Robot"], "name": "Mr. Robot and His Robot Factory", "overview": "Mr. Robot and His Robot Factory is a platform game created for the Atari 8-bit family by Ron Rosen and published in 1984 by Datamost. It was ported to the Apple II and Commodore 64. The music for the Atari 8-bit version was composed by Gary Gilbertson using Philip Price's Advanced Music Processor. Robert McNally performed the Apple II translation. The gameplay is similar to that of Miner 2049er. The player controls a humanoid robot that must traverse all of the platforms in a factory filled with ladders, conveyor belts, and other gadgetry. The robot is moved with either the keyboard or a joystick, and can make it walk side to side, climb up and down, and jump, collecting the white power pills from the platforms in the process. The player begins with four robots, and loses one if it falls too much or touches any of the fireball enemies. When one of the pulsing white rings scattered around the level is collected, the robot becomes temporarily invulnerable and can safely touch the fireballs, destroying them. In each level the player begins with 100 units of energy and loses units at a rate of about one per second, making quick completion of each level important. When the energy runs out, the player loses a robot. Points are granted in 10 point increments as the robot advances through the level. Collecting a ring earns 100 points, as does collecting the small musical note at the beginning of the level that turns off the game's sound effects. Dispatching a fireball is worth 500 points. Completing a level earns 100 points per unit of energy remaining on the screen. Later levels include bombs and magnets. There are a total of 22 levels, not counting the 26 customized levels.", "platform": "Apple II", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Datamost", "publishers": "Datamost", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Mr._Robot_and_His_Robot_Factory", "video_link": "https://www.youtube.com/watch?v=42PcRJs31jg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/89363-mr-robot-and-his-robot-factory\n"}