{"altername_name": [], "name": "2003: A Space Oddity", "overview": "The on-screen instructions are quite amusing in explaining that due to a strange combination of weeties, milk and sugar you have materialised in another time and dimension (which relates to the cassette inlay design, showing a space ship approaching a black hole that presumably could manage three at a time). It goes on to tell you that on your way to earth you will encounter all sorts of monsters and nasties, and to be honest, you are likely to be grabbed by the ghoulies. The title includes the word 'Oddity' and that's just what this game is. It manages to combine some of the elements of a Star Trek game with that of a text/graphics adventure. The object, as stated, is to get back home and deepest space is treated a bit like a haunted manor house in a traditional adventure. There are doors in space, stairways going up and down, forcefields (which kill) and alien space ships which may or may not be empty. The top half of the screen contains the display, although it would hardly be accurate to describe this as graphics in the accepted sense - another of the oddities. It is actually a multicoloured panel containing description of options open along the lines of: WEST - FORCEFIELD; NORTH - ALIEN S/S; EAST - DOWN. Below is a second panel with a crude space scene in blue and white with hides drawings depicting simple outlines of what has been described above. Stargates, when they appear, are attractively animated. The lower half asks what you want to do. Heading for an alien ship results in your being told that there is an alien inside, what do you want to do-Goin- Leave - or Help. Help will tell you what's in there and how strong it is. If you go in you may combat the alien mentally or with a laser or you may run. Heading for doors offers you the option of going in or listening. Travelling through a stargate sends the screen into paroxisms of colour flashes before re-establishing the normal screen.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Chris Fayers", "publishers": "dk'tronics", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.97", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79987-2003-a-space-oddity\n"}