{"altername_name": ["Desert Patrol"], "name": "3D Desert Patrol", "overview": "The object of 3D Desert Patrol is to reach the safety of a road some distance ahead (depending on difficulty level). The player is behind the controls of a tank and can drive forward, steer left and right and fire. Mine fields must be successfully navigated with the aid of a sensor and enemy tanks can be avoided or destroyed. There are five levels of difficulty. You are looking out of your tank at the desert ahead. There are four distinct, strategic types of area and these are shown by the mine- field indicator. When this indicator is RED a minefield is directly ahead, when flashing RED you are in a minefield. MAGENTA means you are running parallel with the mines and CYAN away. When the indicator is GREEN you are clear of the minefield hazard but open to attack from enemy tanks. Near a minefield you are not open to attack as enemy tanks keep clear of these dangerous areas. KEYS 5,7,8 direct you in the direction of the cursor arrows, 0 fires a shell. You are given 50 shells at the start of the game. If an enemy tank approaches too close it will fire and destroy you. You may either shoot a tank or avoid it by turning away until it is out of your line of vision and your camouflage makes you invisible. You must reach safety by reaching the road. Your distance indicator and your compass will help you find the right direction to travel. Your primitive equipment will only register a change in distance if you are headed 20 degrees of the correct heading or 90 degrees of the opposite direction.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Derek C. Baker", "publishers": "CRL Group", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.45", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=P7lmqRN87N8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118388-3d-desert-patrol\n"}