{"altername_name": [], "name": "3D Monster Chase", "overview": "You are trapped within the three floors of a subterranean maze. Your task is to search for the missing keys whilst avoiding the monsters guarding them. Each time that you find a key and return to your starting point, a bomb is active, you have a limited time in which to defuse it. There are 5 skill levels, level 5 being the hardest. There are seven keys to be found. Key one has to be found first, then returned to your starting place. Immediately that is done the bomb starts ticking. If you do not find the bomb in time then you will lose a life, if you find the bomb in time, you will then have to return to your starting place. Now you have to find key one and then key two before returning to your starting place. Then again you have to find the bomb. Now you have to find key one, then two, then three. etc., etc., etc. At the top of the screen you will see a radar screen which shows your position (solid white dot) and the monsters position (flashing white dot), use this to help avoid the monsters. You start the game with a limited number of grenades, which if used at the correct range will destroy a monster (the number of grenades you have are shown on the top left of the screen). There are three floors to the maze, you always start of Zeta floor. The keys and the bomb can be on any floor. When you are wandering around the maze you may occasionally see a key with a higher number on than the one you are looking for. You can only pick up the keys in numerical order. The floors to the maze each have names:- Zeta, Alpha & Delta. To change floors you will have to find the lifts. A Red coloured lift will take you down. A Blue coloured lift will take you up. When you find a lift, you will see the blue or red colour at the bottom of the picture. If you do not wish to use the lift, just turn away. If you wish to use the lift, move forward. The lift is then automatic.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Dave Noonan", "publishers": "Microbyte", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.72", "wikipedia": "https://en.wikipedia.org/wiki/3D_Monster_Chase", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92916-3d-monster-chase\n"}