{"altername_name": ["720°"], "name": "720°", "overview": "720 Degrees, or 720°, is a 1986 skateboarding arcade game by Atari Games. It has a unique timed structure that requires the player score points in order to keep the game going. The game's name comes from the \"ultimate\" trick, turning a full 720° (two complete circles) in the air after jumping off a ramp. 720° has the player controlling a skateboarder ripping around a middle-class neighborhood. By doing jumps and tricks, the player can eventually acquire enough points to compete at a skate park. The game begins with the player controlling a skateboarder skating around a middle-class neighborhood using common objects as ramps for jumps. The player begins with a number of \"tickets,\" each of which granting admission to one of four skate parks, or \"events,\" in Skate City, the \"hub\" between the parks. When a park is entered, one ticket is expended. The player gains additional tickets from earning points. Whenever the player isn't in an event, a bar counts down the time remaining until the arrival of deadly, skateboarder-hungry killer bees. Once the bees arrive the player still has a small amount of time with which to get to a park, but the longer the player delays this the faster the bees become, until they are unavoidable. Getting caught by the bees ends the game, though on default settings the player may elect to continue his game by inserting more money. Reaching a park with a ticket gives the player the chance to earn points, medals and money with which to upgrade his equipment, and resets the timer. The player is constantly racing to perform stunts, both in the events and in the park itself, in order to earn the points needed to acquire tickets. Thus, the player’s score is directly tied to the amount of time he has to play the game. In order to win, the player must complete a total of sixteen events through four hubs, a difficult task.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Tiertex", "publishers": "Erbe Software", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/720%C2%B0", "video_link": "https://www.youtube.com/watch?v=k5w6KnYbCRM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78452-720\n"}