{"altername_name": [], "name": "Acro Jet", "overview": "The player flies a BD5J, a small agile jet. The player has to complete a series of eight stunt courses and routines with the jet. For example, in one set, the player has to fly the plane around a series of pylons. In another, the player must fly a figure eight. Stunts get harder as play progresses. Some game parameters, such as weather, are configurable. There are ten acrobatic events which can be played by up to four players at four levels of difficulty. In all ten events the player must fly over a series of obstacles. In the Pylon Race, the player has to fly around pylons and land safely. In the Slalom Race, the player has to fly a 'figure 8'. In the Ribbon Cut, the player has to break two ribbons. In the Inverted Ribbon Cut, the player has to perform the same stunt, flying the plane upside down. In the Ribbon Roll, there are two ribbons in a row and the player has to fly under one and complete a full roll and then fly under the second ribbon. In the Under Ribbon Race, the player has to perform a slalom by flying in sequence under three ribbons. In the Under Ribbon Loop, the player has to fly under a ribbon, which is then followed by a loop and a pass over the same ribbon upside down. In the Spot Landing event, the player has to fly up to 2,000 feet (610 m) and land as close as possible to a marked spot on the runway. In the Flame-Out Landing event, the player must perform the same stunt without the engines running. In the tenth and final event, the Cuban Eight, the player needs to make a half-loop over a ribbon, followed by a half-role, a second half-loop, and must finish up by flying under the first ribbon again. An instrument panel at the bottom of the screen contains several read-outs, these include an altitude meter, a compass, an artificial horizon and a vertical velocity meter.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "MicroProse Software", "publishers": "MicroProse Software", "genres": "Flight Simulator", "max_players": "4", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102113-acro-jet\n"}