{"altername_name": [], "name": "Aeon", "overview": "Aeon is an action-adventure with platforming elements for the Sinclair ZX Spectrum. It was published by Sunteam in 2018. Game info: What we have here is a new way of making a Spectrum game! We have a storyline and we are getting a story told as we are playing the game. There is nine (YES: 9 ..!!) tap files, and five of these contains a constant loading of screens that tells the story, while four of them contains games. It works this way: You load tap 1, and when it is finished loading the story screens, the last screen will tell you to reset the Spectrum and load tap 2. Tap 2 contains the first part of the game, and when completing this you are told to load tap 3 that contains screens and story etc etc… We are following the Goldenstark family and the story is set on the planet Aeon. In each of the four parts of the game we are playing with different characters from the family. In the first part we have landed on Aeon and we control Jesper Goldenstark in his space suit. Running and jumping in a space suit is not very easy and this has been put into the gameplay. Jesper moves slow so the timing of jumping and passing enemies has to be very accurate to succed. In part two we are controlling a spaceship seen from bird perspective and the object is to find nine survey spots to check these for crystal deposits. There is a lot of dust tornadoes in this area that has to be avoided. In part three we have to go up, up, up and up on different towers and install dishes on each screen, and the biggest problem here is construction robots throwing out garbage of the windows, but also keep an eye on incoming UFO’s. Part four offers a good old platform game with a lot of running and jumping and enemies to avoid. The game comes for free with the free online magazine “ZX Spectrum Gamer” issue 5 apr 2018. Game design, graphics, programming: Paul Weller AY music and sound effects: Sergey Letyagin", "platform": "Sinclair ZX Spectrum", "release_date": "2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Paul Weller", "publishers": "Sunteam", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=61NokcFhAE4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153583-aeon\n"}