{"altername_name": [], "name": "Alien Swarm", "overview": "The Swarm are avowed to destroy the earth at any cost and you are the last line of defence in this battle of overwhelming odds. The swarm attack in three waves each wave more deadly than the last. Wave one consists of 50 Doodlebugs which attempt to Ram you with their highly explosive warheads. They attack in passes of 50 Invaders to start with, and continue to attack until all is lost. After each Pass or loss of laser ship you are given a Data Upgrade which informs you of your score, the Hi-Score, wave number, pass number, how many Invaders that remain in the wave and how many laser ships you have left (you are given three to start with). You are also shown how many points each Invader is worth. The points vary in accordance with the speed of the pass. In pass 1 they equal 10 points each, Pass 2 they equal 20 points each etc. To commence battle again just press the (ENTER) key, but be warned that if you have not wiped out all 50 invaders by the 10th pass you will lose a laser ship for every pass thereafter. However you are given a free laser ship every time the `score' clocks round. The `score' clocks round at 25000 points. So for scores over 25000 the display reads 00000/1 for a score 0f 50000 points the display on the data upgrade would read 00000/2. A score of 27500 points would be displayed as 02500/1. When you have blasted all 50 doodlebugs you ate shown the data upgrade for Wave 2. The wave Two display presages the appearance of 30 luserbugs. Each laserbug is loaded with an unlimited supply of Inter-galactic Sonic bombs which carry a deadly nuclear warhead. These bombs are dropped indiscriminately and any contact with them is fatal. The laserbugs strategy is to attack in groups of three and it is advisable to destroy these deadly creatures as soon as possible, because each pass sees a massive increase in speed. A laserbug will continue to attack until all Invaders are destroyed. Provided you have blasted all 30 Laserbugs out of existence you are given the data upgrade for Wave 3. Wave three!!! If you are skilled enough to reach the third wave you will have to face the `SWARMERS'. These sit behind force fields laying eggs which hatch into the most deadly of weapons. These become homing bombs which seek you out, high energy bombs which explode to form a deadly shrapnel fallout and `dreaded eyes' which hover above you and unleash a bolt of energy which travels at Superhuman speed. Squadrons of `SWARMERS' attack in turnand each Squadron is faster than the last. You have to be quick and agile to save Earth from these, the most evil of Aliens.", "platform": "Sinclair ZX Spectrum", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Titan Programs", "publishers": "Titan Programs", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=yXhs7ijlPFE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78851-alien-swarm\n"}