{"altername_name": [], "name": "Alien", "overview": "Alien is a slow-moving but suspense-heavy game that uses very simple black and green graphics, with a little extra color for some text and for the location of the characters. An omniscient menu driven game, the player is put in charge of all of the crew members of the Nostromo. The game starts with one of the crew members being killed by the alien, which mirrors the death of Kane when he gives birth to the alien in the movie. The player moves the characters around on a map-grid representation of the ship as they search for the alien. Littered around the map are various objects that are useful such as nets, incinerators, pistols, and oxygen tanks. The player can order one of the crew members to pick up such objects and use them when needed. The game is challenging in that, based on the current situation, the emotional status of your crewmen could change. The emotional status can range from confident, stable, uneasy, shaken, hysterical, and broken. This means that the crew members will not always obey your orders and can be frozen by fear or unwillingness to enter a hazardous situation. Ordering characters to pick up weapons can positively affect their emotional status and they are more likely to follow orders. Sending a character off alone can negatively effect their emotional status causing them to perform poorly. Furthermore, like in the film, one of the crew members is secretly an android and he will turn on the other crew when the player least expects it. When the crew is reduced to three there is the option of self destructing the ship and escaping in the Narcissus.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Concept Software", "publishers": "Bug-Byte Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.88", "wikipedia": "https://en.wikipedia.org/wiki/Alien_(1984_video_game)", "video_link": "https://www.youtube.com/watch?v=A6NVttxy_nI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29740-alien\n"}