{"altername_name": [], "name": "Alphabet Games", "overview": "The program gives practice in using the alphabet in various ways. In each game, you can choose whether to work in capitals or small letters. All these games make use of double size letters as well as the normal Spectrum typeface. Playing the games. 1. Random Rats The screen is invaded by rats of various colours, more arriving every few seconds. A white block, which is your gun, moves back and forth across the bottom of the screen. When the letter shown on the block is pressed, a bullet is fired. You have ten shots and, if the printer is attached, you will be given a printed certificate with your marksman- ship rating at the end of the game. If capital letters are used, this game can be used as a simple keyboard familiarity game. If small letters are chosen, then the player has to match the small letter to its capital and look for that capital on the keyboard. 2. Invaders Invading spacecraft, each bearing a letter, drop from the top of the screen. You must press the matching letter on the keyboard to stop the invader from landing. The final score is given, a certificate printed and you meet the invaders' leader! Like RANDOM RATS, this game can be used simply for keyboard familiar- ity or, by choosing lower case letters, the player can practice matching small letters to capitals. 3. Alphagaps This game prints the alphabet on the screen and then removes 10 letters. When a question mark appears in one of the gaps, the letter missing from that particular gap must be pressed. This gives a gentle introduction to alphabetical order.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Blackboard Software", "publishers": "Sinclair Research", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133148-alphabet-games\n"}