{"altername_name": [], "name": "Apulija-13", "overview": "Tucked inside his spacecraft, gliding through a dark, icy and lifeless immensity, corporal Jonlan thinks again to the last look he gave to his comrades while leaving from the Zanklé Rebel outpost, towards a mission as vital for the cause of the Rebels as dangerous for his own life. He had volunteered himself for carrying it out. Some of the best Rebel secret agents had paid with the extreme sacrifice in order to gain the necessary information, and this weighed on him, the veteran of many battles, like a heavy burden. Jonlan’s destination: Apulija-13, a small rocky planet in the constellation of Cancer, hosting a base where sinister military experiments are being conducted by Omni Corporation. A menace to the Rebels, that’s for sure, but also an unprecedented opportunity to definitely turn the tide of the conflict to their side. By infiltrating inside the base pretending to be an Omni inspector, Jonlan’s task is to steal the plans of the fearsome mass destruction weapons the evil conglomerate is working at, and at the same time to sabotage the base beyond repair by placing an explosive charge in the power generator. Time passes… Apulija-13 is near. Bringing abruptly his attention back to the present, Jonlan tunes in the base radio frequencies in order to ask for the authorization to land, but the command console’s loudspeakers only emit static noise. Nothing comes up on the video screens. Jonlan tries other frequencies, but to no avail… until, for just a handful of seconds, some strange, rapidly moving shapes make their appearance on the smooth, cold surface of the display. A shout is heard: ‘They’re here… here they come… aaaarrghhhh…’ Gunshots, more cries. Then the signal breaks. The Rebel leader hesitates. Although many times he already escaped a seeming unavoidable end, he wonders whether, under such uncertain circumstances, it would be wise to carry on with his mission. His doubts are swept away by a powerful bio-psionic energy ray, coming from an unknown part of the Omni base, hitting the spacecraft with a terrible force. The automatic landing procedure does not start. Jonlan deactivates the autopilot and overrides it with the manual controls, but the spacecraft’s nanoreactor has been damaged and the engines are losing thrust. The small planet’s surface comes nearer… The corporal puts his feet on the dusty ground of Apulija-13. He has managed to arrive there alive, but his ship cannot take off without a new nanoreactor. Walking through the airstrip, towards the base entrance – which doors are wide open, while the red lights flash in a frantic way – he can perceive in the distance, among the craters scattered on the horizon, grotesque forms with a vague human appearance menacingly moving… towards him.", "platform": "Sinclair ZX Spectrum", "release_date": "2013", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Alessandro Grussu", "publishers": "Alessandro Grussu", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Pfq7ZTC0Cnw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144109-apulija-13\n"}