{"altername_name": [], "name": "Aquanoids", "overview": "Year 2298, at the dawn of the XXIV century; when humanity has achieved important technological and social achievements, achieving let everyone care about the welfare of all their members and the ecosystem in which they live, being able to eradicate the human behavior negative instinctual acts such as hatred and violence by genetic and neuro-surgical means (after much fighting for a absolute change of mentality and as a consequence of thousands and thousands years of suffering bloody and stupid wars motivated by their own stupidity of man), although it had not yet managed to end all petty crimes such as theft or careless petty theft, even as new scientific investigations have been initiated. Without, However, the clearing of the seas and seabed from waste, non-recyclable materials and debris that man himself, consciously or unconsciously, has been spewing into the ocean for centuries. An evil that many scientists and engineers have dedicated part of their lives to finding solutions to repair this ongoing environmental damage. Among them, a highly qualified team of people from the Institute Tecnológico del Mar based in the city of San Francisco, California, had created a series of robots with a high AI coefficient, programmed to remove any residue from the seabed human, who have been named Aquanoids. The ecosystem of these seas has suffered greatly over many decades, however both underwater fauna and flora have managed to stay with difficulty in balance, despite the constant contamination. These underwater robots have been especially designed and manufactured to withstand the high pressures of large depths, only being able to reach a maximum of 3,500 meters below sea level. They are carefree with humans and even constantly ironize their attitude, making jokes and telling anecdotes about his relationship with them, but when It is about preserving the seabed from the hand of man, it is they deliver 100% in their work. They are self-sufficient and possess a autonomy of up to five weeks of operation, thanks to some specific high power generators for them.", "platform": "Sinclair ZX Spectrum", "release_date": "2015", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Neil Parsons", "publishers": "Neil Parsons", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=j0J2oCBz9Oc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144135-aquanoids\n"}