{"altername_name": [], "name": "Arkos", "overview": "ARKOS THE HISTORY Several centuries ago, long before the Atlanteans soon became More than a legend, there was a small but prosperous village, KARTES, whose people lived in harmony, enjoying the especially fertile lands that cultivated, as well as a prosperous livestock that multiplied the color of their fields. On a polished stone, in the center of the town, rested the GRIX sacred ax, which not even the oldest of the place remembered having seen stop shining even on the darkest gray days. According to tradition, it it was an ax that was given to the people of KARTES by the gods as payment to a distant and hidden debt. His strange power endowed the grounds where he was of unusual fertility, being the secret of the KARTES prosperity. But the evil TAROX, the dweller of the swamps that made decades being driven out of the village by his predatory instincts, he had not given up on his endeavor to seize the holy ax. For this she was years experiencing, through alchemy and diabolical arts, to obtain, at In the end, a penis capable of modifying living organisms. So, he got transform the beings that lived around him, changing his form and size, giving them, in addition to magical qualities such as weightlessness or violence instincts The same TAROX, after ingesting a high dose of the pima. Deranged by his ambition, he became a gigantic and almost invulnerable monster. With his army of unbelievable beings, he attacked the village by surprise. KARTES, seizing the holy ax from GRIX. With the ax in his possession, well guarded in the abandoned temple of ZINTOS, it soon came to dominate great extensions of the plain, taking advantage of the work of the beings transformed who blindly obeyed him. The inhabitants of KARTES went through the darkest and most tragic time of their history: the formerly productive land became vacant lots; the wells and watering turned into muddy ditches that caused epidemics and prevented irrigation; animals died of thousands of hunger and thirst ... The people of KARTES, peaceful for centuries, could not find a way to put end his misfortune. Until a boy was born, ARKOS, who seemed endowed with an almost superhuman skill and constancy. SIROS, the old man, teacher and Patriarch of the village, I saw in him a possibility of light in the dark corridor of destiny. With almost desperate faith, I trained young ARKOS in every arts of war, while strengthening their intelligence and morale, preparing him, in short, for the terrible impact that the face such creatures. Before leaving, under the warm influences of the full moon, he said: \"ARKOS, I have not told you that you will have to face strangers and numerous enemies. You must cross, first of all, the village that TAROX built to this swamp side. Be careful, be suspicious of doors and windows, take care of giants and mysterious holes. Don't forget to collect the objects that our people left as magical offerings when they crossed the millennia ago. Plain and swamps to settle here, you will need ALL to finish your mission. TAROX will surely be at the end of the village, stand firm and do not stop throwing the throwing darts that I give you, until to finish him off. When you get it, his minions, avid for revenge, will they will lay siege to the end. Then get on the back of ATOR, the bird, who will help to traverse the swamps. Later, it descends to the grounds of the abandoned temple of ZINTOS, where the sacred ax is found. They wait for you strange enemies and sources of acid that will not stop spitting their venom until you shoot them repeatedly. And so many other dangers to which you must face. ARKOS, look at your people, vilely condemned to the worst of destinations: hunger. You are their only hope, have faith and GET THE AX SAGRADA.\"", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Arcadia Software", "publishers": "Zigurat Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=UBVrpQuRMgM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133292-arkos\n"}