{"altername_name": ["The Ashes"], "name": "Ashes", "overview": "Playing as England or Australia, you must win a Test match. If you don't know the rules of cricket, this probably isn't the game for you. Suffice it to say that there are ten venues in which to play the match - five in England and five in Australia. Each pitch has its own characteristics and suits different types of play. The teams are made up of six batsmen, one all-rounder, a wicket-keeper and four bowlers. Three types of bowling are permitted: fast, seam/swing and spin. Teams may be named as you wish, although the computer already holds the names of some already. The toss takes the form of alternating the names ENGLAND and AUSTRALIA on screen and stopping at random. The winner of the toss can then elect to bat or bowl first. Field placement is done by showing the outline on black and the possible positions in purple. There are more positions than you have in your team, of course, the idea being to say yes or no to each in turn until all eleven team members are where you would ideally like them. The field then turns green and ready for play. For each over a ball must be selected (players 8 to 11). A ball is specified by its line and length and entered as a two-digit number. The batsman has seven types of stroke, from defensive through to off-drive. A stroke is played by pressing the appropriate key for the type of play desired while the ball is bowled. The path of the ball from bowler to batsman is shown so that the batsman has a few seconds to decide what shot to play, and then the path of the ball after batting is also shown. A captain may declare if he wishes. Weather may interrupt play, and rain is likely to alter the characteristics of the pitch.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "C.J. Dunn", "publishers": "CCS", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=uN0PDbrOD1s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150066-ashes\n"}