{"altername_name": [], "name": "Atrog", "overview": "After the time of great rains, the Khun people settled in a vast extension of territory of the great plains, where, after a great collective effort managed to establish and prosper thanks to the fertile lands and the abundance of game provided by an extensive forest next to snowy mountains. As the years passed, the Khun people attained great power, and He was even respected by all the tribes in the nearby territories. As usual, with winter approaching, the warriors of the Khun people head to the Holy Mountain in order to make offerings to the God Irkal, guardian of his people. Near the Holy Mountain they suffer a brutal attack by the barbarians Krull, a savage tribe from the East that had sown terror in all the territories through which they had passed. Few warriors survive after the savage fight; those who survived were able to arrive and warn the town in advance of the imminent looming danger. At such a warning, the diminished Khun people were forced to march towards the inhospitable lands of the North, where they survived with great difficulties in an atmosphere of resentment and resignation. The elders taught and trained the youth for years in the difficult art of fighting. Out of all of them stood out a young warrior named ATROG. After long hours of decision, he was chosen for his revenge. town against the barbarians Krull, and at the same time, recover the Sacred Stones that were given by the Gods to the Khun people for their custody and veneration. The time has come to complete the revenge, your hard training will not it will have been in vain. THE GAME: \"\"\"\"\"\"\"\" The game consists of three phases: The village, the forest, the fortress, which They will load sequentially as we finish the previous one, has a smooth scroll up-down and right-left that we will go observing with the demands of our protagonist. Our protagonist you can move up, down, left, right and their respective diagonals, you can defend yourself with punches, kicks, blows to the neck and the deadly blows. In each of the phases our hero will have to eliminate all the rull enemies, with an incredible ability not to be slaughtered. Our energy will decrease with each blow we receive and we will have of three initial lives that will be added to those that we receive during the game. DRIVING \"\"\"\"\"\" For the management of our hero we can use the joystick or the keyboard, if we do it with the latter, our keys will be the following: Q - Up Down O - Left P - right ESP - Fire ESC - Pause Defensive moves: Without the fire button pressed. Our protagonist will walk up, down, etc. depending on the key pressed. Offensive movements: With the fire button pressed. - Left or right, depending on whether we are on the right or left and we will kick and punch. - Upstairs, we'll hit the neck. - Down, we will deliver the fatal ax blow. The ax is our indispensable weapon although we will not start with it from beginning of the game but we will achieve it by passing the first phase. When we have the ax we must use it well since we will not always have it, to get it we will have to hit them in the neck to our enemies.", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Alberto Herraiz de Olmo", "publishers": "Zafiro Software Division", "genres": "Beat 'em Up", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=a7ywgaDu_2s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133515-atrog\n"}