{"altername_name": [], "name": "Auf Wiedersehen Monty", "overview": "The player controls Monty as he travels around Europe collecting money in order to buy a Greek island - Montos, where he can safely retire. Gameplay is in the style of a flick-screen platform game, similar to many such games of the 1980s such as Technician Ted and Jet Set Willy. Some screens (such as those representing the Eiffel Tower and the Pyrenees) bear some relation to their real-life counterparts but most are just typical platform game screens. Auf Wiedersehen Monty contains many interesting features and peculiarities for the player to discover. Examples include being suddenly attacked by a bull's head in Spain after collecting a red cape (presumably a reference to bullfighting), a car being dropped in one of two places on entering a screen representing Düsseldorf in West Germany, a chef's hat found in Sweden (a reference to the Swedish Chef of Muppets fame; also, the two rooms representing Sweden are subtitled Bjorn and Borg), and a record in Luxembourg that when collected makes Monty breakdance to the game's title music (this may be a reference to Radio Luxembourg). It is possible to get to areas of the game more quickly by flying from an airport using air tickets which can be collected throughout the game. Some parts of the game can only be reached in this manner. As well as money, there are other miscellaneous objects to collect in the game for points. This was important as you need a certain number of points to get to Montos. These are often particular to the country Monty is visiting (such as berets in France). Bottles of wine or a glass of beer in West Germany cause Monty to briefly become drunk and his control to become slightly erratic leading to a reversal of controls, repeated jumping or Monty climbing any ladders or drainpipes he encounters.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Peter Harrap", "publishers": "Gremlin Graphics Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.39", "wikipedia": "https://en.wikipedia.org/wiki/Auf_Wiedersehen_Monty", "video_link": "https://www.youtube.com/watch?v=LGmkoEFc0lw&t=8s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29738-auf-wiedersehen-monty\n"}