{"altername_name": ["Regreso al Futuro Parte III"], "name": "Back to the Future Part III", "overview": "Marty's in big trouble. Having returned to 1955 to try and stop the evil Biff from changing the future for his own benefit with the aid of a stolen sports almanac, he and Doc Brown have managed to do just that. But when the flying DeLorean with Doc inside is hit by lightning and disappears, Marty is left stranded in 1955. His troubles are far from over. Seconds after the Doc's disappearance, Marty receives a letter from him - dated 1885. After being catapulted back to the old West by the lightning bolt, Doc has decided to settle down there as a blacksmith, explaining that he's quite happy there and wants no help from Marty. Also included in the letter are specific instructions on how to find the DeLorean (which Doc has hidden in a disused mineshaft) and use it to get Marty back to 1985. But when Marty and Doc return to the mineshaft to recover the DeLorean, they discover, in the nearby graveyard, a headstone with Doc's name on it - dated just a few days after his letter to Marty! Realising he has to save the Doc before he is killed, Marty uses the DeLorean to travel back to 1885... Now it's up to you, in the roles of both Marty and Doc Brown to save the day and return everyone safely to their own time. It's not going to be easy, thanks to the appearanee of Buford \"Mad Dog\" Tannen, the first in the long line of the evil Tannens of Hill Valley! He's been gunning for Doc since he arrived - and now he's gunning for you too. BACK TO THE FUTURE PART III is split into four sections, which you play one after the other. Each section represents a famous scene from the movie - so if you've seen the film, so much the better. The sections get progressively harder, with the final section, in which you must get back to 1985 once and for all, the toughest of the lot. But don't worry - we'll give you some help along the way. You may pause the game during any of the sections by pressing the 'H' key, and pressing it again to continue.", "platform": "Sinclair ZX Spectrum", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Probe Software Ltd.", "publishers": "Image Works", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Back_to_the_Future_Part_III_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53548-back-to-the-future-part-iii\n"}