{"altername_name": ["Bargain Basement"], "name": "Bargain Basement!!!", "overview": "Get your carrier bags at the ready folks for the craziest sale on earth is about to begin. Our hero, 'Money' just can't resist going shopping using his 'Excess Card', especially if there are bargains to be had. For instance, he has only just heard about a new bargain basement at Harridges the world famous department store. Now he can snap up bargains all year, and buy birthday presents for his mates 'Cash' and 'Credit'. You have to help him charge around the basement, on an insane spree, buying up objects as you go. Make sure you spend over 5 of the credit limit (displayed on the top right of the screen) without going over it. If in danger, you can swap items for cheaper bargains once five items have been bought. On the way you may bump into some of Money's friends and gain an extra life, but beware he also has his enemies, disguised as bargains, who want to end the spree and close the account! You should also look out for the four figures of the til combination, picking them up as you go. You'll need these for paying the bill. Having discovered the four numbers you must hunt for the check-out area. If you find it, a new screen will appear showing the keyboard layout of the cash register. Tricky as it may be however, you must guess the right combination. The display will flash when you do. However, you can only be successful if you are within five percent of your credit limit and finish before the card expires at the end of the year. So, good luck, and see if you are good enough to ring a 'change' in the bargain basement! - Happy bargain hunting...", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Andrew Pollard", "publishers": "Sparklers", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117983-bargain-basement\n"}