{"altername_name": [], "name": "Barry McGuigan World Championship Boxing", "overview": "Barry McGuigan World Championship Boxing is a British 1985 computer game for 8-bit home computers released by Activision and later re-released by Mastertronic for the Amstrad CPC, Commodore 64 and ZX Spectrum. Released as Star Rank Boxing in North America. Designed by Doug Barnett and developed by Troy Lyndon. The player controls a boxer as he boxes his way to the top, earning purse money along the way, progressing up the world rankings until fighting Barry McGuigan himself. Players can create a boxer and customize his style, race, hair and shorts. The player could also choose his next opponent, either at the same ranking, below or above, each with their own lead up time to the fight. The longer the player had until the fight the more time could be spent in the gym, allocating training weeks to the following activities: Weights, sparring, road work, heavy bag or light bag. Each of these activities had a benefit on the boxer's stamina, strength and endurance. Roadwork for example helped with endurance, whilst weights and heavy bag helped with strength. Before deciding which opponent to fight, a summary is shown of each detailing his attributes. Looking at these the player can then decide if he wishes to take the opponent on. Picking an opponent who is above you in the rankings will progress you quicker up the rankings and earn you more money, however this is risky as they are stronger fighters. Some opponents could be beaten quite quickly, whilst others required several rounds of boxing to defeat. Whilst boxing the following moves can be employed: Cross, block, body punch, jab, hook and uppercut. At the end of each round a summary is given of points scored and the feeling of the audience as to their excitement levels.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "GameStar", "publishers": "Dro Soft", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "https://en.m.wikipedia.org/wiki/Barry_McGuigan_World_Championship_Boxing", "video_link": "https://m.youtube.com/watch?v=ymhZmreV7lc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78114-barry-mcguigan-world-championship-boxing\n"}