{"altername_name": [], "name": "Battlecars", "overview": "Battlecars is a vehicle combat video game released for the ZX Spectrum in 1984. It is based on Games Workshop's miniature wargame, Battlecars. Battlecars is a car-dueling video game for the ZX Spectrum. The game is set in 2084 in a future where road accidents have been eliminated by technology, and the world is relatively bloodless; however, people now entertain themselves by drivers using 20th century automobiles in violent, gladiatorial contests. Image depicting two different players engaged in Battlecars gameplay on the same screen. Screenshot of Battlecars gameplay. In the game, up to two players battle each other or the computer with vehicles that use an assortment of armor, weapons, and other components including missiles, mines, machine guns, lasers, oil, and smoke. Players can fight their cars on a racetrack, in an arena (the Autodrome), or on the streets of Slug City. On the racetrack, players navigate through a narrow circuit, competing primarily against rough terrain and a clock. The Autodrome is a bare arena where two cars can focus on battling each other. Slug City is a townscape where cars could battle each other on narrow streets. A player can play against the computer or a second player in either the racetrack or Autodrome; however, players can only play each other in Slug City. Except for when racing on the racetrack, the primary goal of the game is to find your opponent and destroy their car. Players can take advantage of gas stations and service garages to obtain fuel or repairs, but using either makes a player vulnerable to attack from their opponent. A notable gameplay element at the time of the game's release in 1984 was that cars would realistically \"drift\" when they tried to turn at a high rate of speed. When playing a game, players are presented a screen that shows the area in which they are driving their car, a map of the entire venue, the current speed and fuel of their car, any damage it receives, and information about available weapons. When there are two players, each player has their own playing screen on the computer monitor. The game is played using twelve keys on a keyboard to control each car and its weapons. The game has eight car configurations from which players could choose. Battlecars also comes with a program, Designer, which allows players to customize the vehicles they want to use in battle.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "EDOS", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Battlecars_(video_game)", "video_link": "https://m.youtube.com/watch?v=gepv3DUFyYE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92634-battlecars\n"}