{"altername_name": [], "name": "Bazooka Bill", "overview": "Bazooka Bill is a side scrolling combat game created by Melbourne House (Australia) in 1985 for the Commodore 64. It was also ported to the ZX Spectrum. The game starts off with a soldier known as Bazooka Bill on a mission to rescue General Douglas MacArthur who has been kidnapped by a nasty revolutionary faction. Gameplay[edit] The player can use punches, a throwing knife, machine gun, flame thrower, and later a bazooka. This game color-codes the enemies depending on which level of the stage they are on: All of the foot soldiers wear white on the bottom, blue on the middle platform, with yellow helicopters on the top. In level 1 the first enemies in this game are some motorcycle helmet/ninja soldiers and helicopters above, and there's so many of the motorcycle helmet/ninja soldiers. They run by so fast that the player doesn't have enough time to react to them, taking the player character's health meter down as they bump past him. The level switches itself by replacing the motorcycle foot soldiers with elite soldiers. The game also gives the player a throwing knife. Bill can throw it taking out a group of enemies regardless of whether the blade actually hits them. The flamethrower works the similar to the knife, but only by going in a straight line. A machine gun that works just like the foot soldiers and elite soldiers. A bazooka, showing up only in stage 2 acts as a smart bomb and clears the entire screen leaving the player to run around in silence for 2 seconds. Also, as strange as it seems, every weapon that Bazooka Bill uses makes his arms big in an attempt to give the player the idea of what he is using. The entrance to level 2 is an airbase called \"Clark Airbase\" where elite soldiers run and kick the player character in the backside and run off, then the player character takes to the air. The player touches down and arrives at level 2 (Leyte Island). Here, the player character is attacked by natives and rolling boulders, and they follow this color coding too. Later in the level are commandos, trucks, and tanks. The entrance to level 3 (Mindano Island) has foot soldiers that have been equipped with flails. Then the player character takes to the air again but here in this island there are new enemies: kamikaze dogs. The entrance to level 4 (Corregidor Island) is an airport with the elite soldiers, and then the player character takes to the air once more. Then in Corregidor Island there are all the enemies except for the dogs and this level has the bazooka.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Melbourne House", "publishers": "", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Bazooka_Bill", "video_link": "https://www.youtube.com/watch?v=hUAx8dwTD84&t=83s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78470-bazooka-bill\n"}