{"altername_name": [], "name": "Billy Bong", "overview": "BILLY BONG ========== Featuring:- Multicoloured Animated Graphics Realistic Tunes and Sound Effects High Score Table Full Display Mode Five Levels of Play Five Screen Layouts Cast of Thousands (well 11 actually-see us on the cover!) G'day Sport! I am BILLY BONG. I sure am havin' trouble with some aliens that is fiercer than a pack of Dingo's. I was out walking wiv me sheila in the Outback, when this 'ere Flying Saucer came out of the bush. At first I thought it were a hoard of pommie tourists, but as they got closer they looked more like joey's. I took a swill of amber brew, a bite from me tucker, and set to wiv me boomerang. How about some help Cobber? Even a pommie is better than nothing (just!!). Move BILLY BONG using the following controls:- THE KEYBOARD:- Key'Z'............................................. move LEFT Key 'X' .......................................... move RIGHT Space Key .......................... Throw boomerang Billy may move up/down using the moving platforms. Monsters may be killed by knocking them off a level into the lake using the boomerang. When thrown, the boomerang will spin off in the direction Billy is moving. Eventually it will return to the position it was thrown from, unless of course it hits anything. Extra points are gained by cutting a vine holding an apple with Billy's boomerang. There are ten different types of aliens and five screen layouts to overcome. You have 3 lives to gain as HIGH a score as you can. The top five scores are recorded in a High Score Table. WATCH OUT FOR ACID RAIN! GOODLUCK!", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "J. Stephen Culley", "publishers": "MC Lothlorien", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=-oLhndGO0x4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102572-billy-bong\n"}