{"altername_name": [], "name": "Black Planet", "overview": "It is coming to the end of the 21st century, and the planet Earth has spread its empire to a fairly large portion of the galaxy. However, because any progressive society requires the transfer of goods, etc. by trade, and because of the vast distances involved and the inherent criminal mind, policing the spaceways is a difficult task. Certain criminal elements have set their base on a secret black planet (the planet has no sun) from where they operate to prey on traders. You are Starmagon of the Galactic Patrol whose job it is to rid the spacelanes of these interstellar muggers. Since the pirate planet has no sun, its detection in the wastes of space is virtually impossible but this strength is also its weakness. The pirates themselves also have difficulty in finding their base and any contact by hyper-radio or other system can be detected. In order to find their planet, a special device known as the KEY was invented. The device was then dismantled and placed on seven secret planets. The pirates know how to get on and off these planets with safety. Your spy network has found the locations of these planets and now all you have to do is visit them and obtain the seven pieces of the KEY in order to destroy the black planet. You will, of course come under attack as you travel since the pirates have heard of your intentions. You will also need to survive the seven adventures awaiting you on the secret planets. If you success in getting all seven parts of the KEY, your ships computers will automatically put you in orbit around the black planet. Good luck.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Barry G. Cornhill", "publishers": "Phipps Associates", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KclXtXdPDss", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102982-black-planet\n"}