{"altername_name": ["Bloody Paws"], "name": "Bloody Paws", "overview": "The first rays of the morning sun came through the open window of her room, waking him up. Half asleep, he reached over the unmade bed, searching feel the soft touch of her scented skin on your hand. Groping forward on the Sheets, while murmuring sweet words, the ones she liked the most, went all over the bed length without finding it. He opened his eyes, and looked around the room. Her clothing was still where she had left it the night before, but she had disappeared. Bloody got up and left the bedroom. He walked down the hall, calling to her; but did not answer nobody. He went to the kitchen, only to find it empty. - Why didn't you tell me that you would get up so soon today? This is not like her, he thought. A pleasant fragrance hung in the air. Bloody recognized her at once. It was the perfume that She had bought him to celebrate her wedding anniversary. She had insinuated it days before and he had gone to buy it quickly. It was very expensive, but what was money compared to the happiness and love that existed between they ? When he handed it to him, he feigned surprise. Then they sprayed him and they celebrated together. Without knowing why, he went to the bathroom, where he discovered the smashed jar. Suddenly, a current of air closed the door with a loud bang. He opened it and went out. The door the entrance was open, forced. Someone had entered and had taken his beloved Samantha. That explained the broken jar on the floor. More and more furious he went through the door and, going down the stairs, reached the street. He noticed something. A sweet, familiar scent came from the east. Now he could search for it and he would. I dont know He would stop until he found her and to whom he had dared to do this. And when you found ...", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "G LL Software", "publishers": "G LL Software", "genres": "Beat 'em Up", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112907-bloody-paws\n"}