{"altername_name": [], "name": "BraveStarr", "overview": "New Texas, great arid planet, is where Kerium Secum is located. This substance, the most important of the universe, is what makes the Earth work. Since its discovery in New Texas have gone there many treasure hunters waiting to be made rich But there have also been characters with worse intentions ... Soon one such Tex Hex and his cohort of evildoers took possession of the territory, sowing terror. Tex is under the influence of Stampede, spirit dating back to the time when New Texas was inhabited only by dinosaurs. What Stampede intends to do is give life to the bone remains scattered throughout and send it back to the arid surface. For this you have to squeeze the magic of the Indian elder Shamen. Stampede has captured Shamen and has him arrested. The good-natured Sheriff, Bravestarr, educated precisely by Shamen as a child, has decided to pursue Tex Hex, destroy Stampede and rescue Shamen. Since you embody the Sheriff, your mission is simple: rescue Shamen and free all of Texas from the clutches of Stampede. If you enter the bars and other buildings of Fort Kerium you can get information and solve puzzles that will eventually lead to you decisive encounter with Stampede. The information is not easy to get, so you must change objects collected by money with which you can bribe people. Go to the indicated places on the map that is on your rocket and explore the entire planet. Look especially for amulets, left by your enemies that will increase your shooting power, or freeze time for seconds. During the nine days that your search will last, the Sun will rise and become many times. Be careful with the bombs that will send you for a ride.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Probe Software", "publishers": "Erbe Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "2.81", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/55659-bravestarr\n"}