{"altername_name": [], "name": "Bridge Player", "overview": "This program allows you to play the game of bridge without having to find three people to play with. It does not use prepared hands: instead the hands which you will see result from random shuffling, which is why you will have to wait a few moments for each new hand to appear. Although it is not a bridge tutor it will provide enjoyable and useful practice, particularly for beginners and intermediate players, in both bidding and playing the cards. On each hand, unless you elect for option 2 (see below), you will be South and your hand will be displayed as if you were holding the cards. Using the Acol system you will then be able bid your own hand, with the computer bidding the other three hands. Once the bidding is complete North and South's hands will be displayed and you will be able to play the hands as declarer, with the computer playing the opponents' hands. All legal bids are allowed including doubling and redoubling. If, by mistake or design, you enter an illegal bid it will not be accepted. Similarly during the play of the cards you can play any card which you are legally entitled to play but a revoke or the purported play of a card not held is not accepted. To assist the declarer, the computer will make a small 'beep' whenever a defender makes a ruff i.e. trumps another suit led. You do not have to bid the hand if you do not want to. Option 2 allows you to see all four hands and then decide what contract to play in and who is to be the declarer. Thereafter you will be able either to play the hand as before (i.e. playing only the declarer's and dummy's cards) or to play all 4 hands yourself. Whichever option is selected the computer will always display (in addition to the 2 or 4 hands, as appropriate) the sequential hand number, who was the dealer, the vulnerability of North/South and East/ West, any part score and (once these are known) the contract and who is the declarer. In addition, once you have started to play the hand the number of tricks won by North/South and East/West will be shown as well as the cards played to the previous trick.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "CP Software", "publishers": "", "genres": "Board Game", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/103386-bridge-player\n"}