{"altername_name": [], "name": "Bruce Lee", "overview": "Bruce Lee is a platform/beat 'em up hybrid, in which the player controls Bruce Lee. The plot involves the eponymous martial artist advancing from chamber to chamber in a wizard's tower, seeking to claim infinite wealth and the secret of immortality. There are twenty chambers, each represented by a single screen with platforms and ladders. To progress, the player must collect a number of lanterns suspended from various points in the chamber. Most chambers are guarded by two mobile enemies; The Ninja, who attacks with a \"bokken stick\" and The Green Yamo, a large unarmed warrior, visually styled as a sumo wrestler but attacking with punches and \"crushing kicks\". On platforms with sufficient graphics support, Yamo's skin is actually pictured as green, though in cover art he has a natural human skin tone. A multiplayer mode allows a second player to control Yamo, or to allow two players to alternately control Bruce. If the player playing Yamo is inactive for a certain time, the computer takes over. The Ninja and Yamo are also vulnerable to the screen's dangers, but have infinite lives so they always return; whereas Yamo is consistently identified as a single person, one version of the manual implies that each reappearance of the ninja is a new individual, replacing the previous one. Later chambers include more hazards such as mines and moving walls, as well as a \"comb-like\" surface that has an electric spark racing along it. Skillful walking, climbing, ducking and jumping are required to negotiate them. On the twentieth screen, Lee finally faces the evil Fire Wizard.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "L.T. Software", "publishers": "Americana Software", "genres": "Beat 'em Up", "max_players": "2", "cooperative": "No", "rating": "4.66", "wikipedia": "https://en.wikipedia.org/wiki/Bruce_Lee_%28video_game%29", "video_link": "https://www.youtube.com/watch?v=kCtnnzOiZIU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29686-bruce-lee\n"}