{"altername_name": [], "name": "Cheril in Cadaverion", "overview": "The Evil Witch Soraya, simply put, hated Cheril. Specially after she had gained her Goddess status (see previous game “Cheril the Goddess“), when Soraya cried in anger and envy for four days straight. She just couldn’t stand Cheril, and spent long sleepless nights thinking about something really awful to do to her. Finally, she conceived a truly evil plan. Rigoberto Brioso was an incredibly beautiful wizard. She used to take long walks playing his lire along the paths in the gardens of his mansion, and stopped only to watch the sprinklers and let the birds come and land on his golden curls. That’s why Cheril accepted immediately when she received an invitation for a walk alongside the famous Wizard, listening to the beautiful sounds of mockingbirds and the chant of the unicorns. Or something. Nevertheless, when she arrived to their date, she felt something was going incredibly wrong… She was in an old, decrepit, dark mansion and the handsome wizard prince was nowhere to be seen. Then she heard the evil laughter of Soraya: – I’ve set a time bomb in each floor of this mansion, which will activate once you enter, so you better run unless you want yourself turned into a pile of pudding! Cheril was immortal, but not invincible: a violent explosion would not kill her, but would tear her in pieces, and living in such a condition wasn’t a very nice perspective. So she decided to RUN for her “entireness”. But awe! All the chambers were locked! luckily, the mechanism was simple and all she had to do was push around the statues to make them fit in their pink bases. Simple, but time consuming. And time was scarce…", "platform": "Sinclair ZX Spectrum", "release_date": "2013", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "The Mojon Twins", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144648-cheril-in-cadaverion\n"}