{"altername_name": ["Cheril the Goddess"], "name": "Cheril da Goddess", "overview": "In the Temple of the Big Cucumber, Prince Chicken (who was famous for his studies of the arcane, for being a proud intelligent man and for having a foot slightly larger than the other), awaited a very special delivery: “arogas”, a sustance capable of increasing his inner power to a “Master of the Universe” level. With such power, he would be so strong that, only by thinking bad of somebody, he could make it explode. And that rocks big time. Meanwhile, and thanks to having had so many adventures, Cheril had learned how to fly and throw energy balls made of concentrated “bad will”. There was a proble, thought: it took quite a lot of energy to produce such skills, so much that they ended draining her vitality! So, investigating in the slums of Little Olimpo (province of Badajoz), she learned about Prince Chicken and the delivery of arogas he was waiting. So she was decided: she would sneak by all possible means inside the Temple of the Big Cucumber to intercept the delivery, so she could acquire such a big power for herself so flying and firing power balls wouldn’t drain her vitality. That way she could finally take over the work, and, specially, submit Eleuterio, the Very Serious Monkey, her nemesis. To achieve such an objective, she learned she had to activate the three Sila-Tsikl elemental tri-force shrines by means of breaking them with the Sacred Talismans – such a thing would make the temple lock to appear so she could actually open it. Using the temple key, which she had to find as well. So many things!", "platform": "Sinclair ZX Spectrum", "release_date": "2012", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "The Mojon Twins", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144660-cheril-da-goddess\n"}