{"altername_name": [], "name": "Contact Sam Cruise", "overview": "The game is made in the style of a 1930s detective movie and Sam needs to solve a murder. Play takes place in a scrolling two-dimensional environment consisting of part of a city in the United States. Although the player is given considerable freedom to explore the game-area the solution to the game is a linear progression through various puzzles. The main character is usually given hints on how to complete the next stage via in-game phone calls. Players are able to enter buildings (although the view remains outside the building with Sam visible through the windows - there is no cutaway), switch lights on and off, open doors and collect money (by somersaulting onto the bills blowing down the street). Sam can also don disguises for various parts of his mission and at times will also have to evade police - for example by pulling out building fuses to cut the lights at the start of the game when he finds a dead body. Sam carries a limited amount of money in dollar bills and this ticks away slowly with the game ending if Sam's money-level reaches zero. If Sam finds himself arrested by the police he is taken to a police station and deposited in a cell for a period of time before being released on bail which will reduce the amount of money he has. Sam can also find himself bodily picked up by gangsters and hurled from the top of a building (one of the favoured method of disposal by the gangsters in this game). Although this will not kill him, he will become unconscious and have been mugged (i.e. lost more money) when he comes to. Sam also has a limited number of first aid packs (depicted as red crosses on the screen display) that are used-up if he is shot by gangsters. If these run out the game ends.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "", "developers": "David Reidy", "publishers": "Microsphere", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.62", "wikipedia": "https://en.wikipedia.org/wiki/Contact_Sam_Cruise", "video_link": "https://www.youtube.com/watch?v=kgvMFl3qdl8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73152-contact-sam-cruise\n"}