{"altername_name": [], "name": "Dark Transit", "overview": "It is in the year 2173 Humanity expands beyond the solar system and discover how to travel interstellar with the most modern plasma engines. Now it's possible to reach the closest system in Proxima Centauri in \"relativly\" short period. Still Humans can not survive for such a long travel, because of that scientists designed special group of genetically modified cyborgs, half organic human, half machines. We call them \"Kappas\" like Japanese folklore Monsters as they look like one of those when they wear huge mining suits, but they are the only one's that can reach the new worlds. Every Kappa have the double personality, one is the AI precise and rational and the other one is more \"organic\" emotional, so it's kind of normal when you see a Kappa that are talking to himselves, or having the double thoughts about certain things. Sometimes this can even lead to malfunctions or even unexpected deaths, but still they will do their job's and more likely they will do it well. Kappa's jobs become mostly interstella mining procedures as the greedy companies also expands beyond the solar system and those are the ones that invest the most in better engines, equipment and new modern Kappa's modifications but always they expect the returns from their investments and if the Kappa fail once in his mission it will be most likely euthanized on his return. Most recently a few companies loast the contact's with some mining post's, there are some rumors that possibly Alien UFO's attacked and destroyed them, however the International Space Agency (ISS) still doub that something like that happened as we still officially never etablished contact with other civilizations, and because of that ISS will put all the blame only on Kappa's malfunctions... Those far and unsafe regions in Proxima Centauri we call DARK TRANSIT and fewer and fewer Kappa's return from there. Kappa 33975 was doing his every day job on the mining rig in the relatively safe area on the Proxima 1a when he recieved the SOS call from mining post 353 on Proxima 3b ...Message was short and it says \"We are under attack\". Kappa immediately informed the company about that and recieved a message in a few days that said \"Kappa 33975 go and visit the area, investigate what happened and return back safe. Over and out\" Kappa 33975, now it's your turn to visit the DARK TRANSIT...", "platform": "Sinclair ZX Spectrum", "release_date": "January 1, 2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Sasa Bjedovic", "publishers": "Goliat eXperience Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=jU79OTbr9H4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158167-dark-transit\n"}