{"altername_name": [], "name": "Don't Buy This", "overview": "Five games submitted to Firebird for evaluation (and potentially marketing) were collated in this collection, and as the title suggests, they are not of the highest quality. The games are called Race Ace, Fido 1, Weasel Willy, Fido 2 and Fruit Machine. The packaging is decidedly self-depreciating, with the cover photo upside down. The two Fido games involve running around a maze avoiding birds and flattening moles - both are much the same. The other titles feature an assortment of simple ideas, unusual control systems and limited gameplay. All these games are single player. All can be played with the keyboard, some can be played with a joystick. Race Ace: This game is billed as providing high speed motor racing action. The game consists of a single convoluted track around which the cars race. The player decides on the speed - which is actually how fast the game runs, and the number of laps (minimum of three). When the game starts the player is behind the field of other racers. Gameplay is relatively simple as the only controls available to the player are for steering, braking and aborting the game. Steering is controlled by the Z and M keys which turn the players car clockwise / counter clockwise by 90 degrees at a time. Fido 1: Fido is a dog. There are moles in his garden and he must stop them digging holes. To do this the player must walk Fido on top of the moles, sit him down beside them and make Fido wag his tail. The tail hits the moles on the head and kills them, scoring points in the process. While Fido is sitting down he's bigger than when he's walking, this makes him vulnerable to low flying birds. Contact with a bird costs a life. There are only three action keys, walk left/right and wag. Weasel Willy: Weasel Willy starts in a field around which is a wall. The objective is to walk Willy around the field avoiding contact with the wall or any of the randomly placed trees. Once Willy has started walking in any direction he will keep on walking until the direction is changed, a bit like Centipede. If Willy walks long enough in any field he is transported to another field where there are more trees to avoid. The game continues through ever more complex fields until the player runs out of lives at which point a high score may be recorded. The movement keys for this game must be defined before each game starts. Fido 2: Puppy Power: This game is essentially the same as Fido 1 with the added improvement that Fido can now move up and down as well as left and right. Also there are far more low flying birds to avoid. Fruit Machine: The game starts the player with £1. All spins of the reels cost £0.10p. The machine has four reels and the game has hold, nudge and gamble features.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Firebird Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102882-dont-buy-this\n"}