{"altername_name": [], "name": "Druids Moon", "overview": "Druids Moon brings back Tommy Astle, the hero from one of Charles'earlier games, Werewolf Simulator. We learn that Tommy has always had an interest in the magic and culture of the Druids. Now, with an intense feeling of being called by someone or something, he has travelled into the depths of the English countryside to learn his fate. He is staying at an olde worlde inn at Aven-bury. It is here that we join him at the start of an adventure that may well change his whole life. Mapping is not quite so devious as in Werewolf Simulator, but you must still take care to explore the terrain with pencil and paper at hand. Exploring the surrounding roads and woods, you realise that there is more to Avenbury than first meets the eye. The number of locations is not very large, but it is what you do in these locations that is going to be vitally important. As with other games from the same author, useful items are not obvious, you must actively look for them. The first location is a good example: There are many useful things just lying around or within view, but you must SEARCH, EXAMINE, LOOK IN and LOOK UNDER everything you can think of to find what is there. The program is written using Incentive's Graphic Adventure Creator and has the usual limitations of graphic design and parser. With that in mind, the graphics are an improvement over earlier adventures and the parser will accept sufficiently complex commands to make life a little interesting. The amount of descriptive text is limited but still sets the scene adequately. The atmosphere is more in the mind than on the screen and builds quite nicely to the climax, which has a nice twist. There can be no comparison between the elegant operation of something like Jinxter or Knight Ore and Druids Moon, but then there is a great difference in price. GAC games are still fairly common and represent much of the bread and butter for our adventure appetites. Long may they be so. Never released on its own, it was only released as part of a Top Ten Software compilation named Bogies Pick 3.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Alternative Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149618-druids-moon\n"}