{"altername_name": [], "name": "Dun Darach", "overview": "One day Cuchulainn was travelling home from a battle with the Connachta with his companion Loeg the charioteer. On the way, they stopped off at an inn and Loeg was persuaded to help a beautiful young woman named Skar whose chariot was damaged. Cuchulainn took refreshment at the inn and on leaving realised Loeg was missing. He later discovered that Skar is a sorceress and ally of the Connachta and had taken Loeg to the timeless Secret City of Dun Darach in retribution for the death of Prince Amhair. Cuchulainn went on a long search for the mysterious city and eventually discovered it and entered Dun Darach to find Loeg. Dun Darach is an arcade adventure with interface and presentation nearly identical to Tir Na Nog or Marsport based on collecting objects, solving puzzles based on word puns or lateral thinking and interacting with other characters wandering through the city. The animation is in the same standard as Tir Na Nog, although there is no parallax scrolling. Since the game can take many hours to complete, there is support for saving its state to cassette tape. Dun Darach improves over its predecessor in that other characters can give short hints to the player, rob him, and confiscate his belongings if he carries stolen goods. The player can also now buy, steal and sell goods from the many shops in the city, bet at a casino (Iomain Ludum) and even deposit money at a bank with daily compound interest. The city of Dun Darach is large and consists of different quarters with shops and the current time of the day is indicated by torches in the wall and by the greetings of characters. There is a \"blank\" area in the centre of the city in Iomain, the pleasure quarter; this was originally intended to be a brothel called \"Lady Q's\" and would have opened into a whole red-light district (this was censored and all that remains is a sign saying \"Forbidden\"). Cuchulainn can move north, south, east and west with the player \"rotating\" the view using the keyboard and then having Cuchulainn move left or right on the screen, so only one side of the street is visible at once.", "platform": "Sinclair ZX Spectrum", "release_date": "December 18, 1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Greg Follis", "publishers": "Gargoyle Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.29", "wikipedia": "https://en.wikipedia.org/wiki/Dun_Darach", "video_link": "http://www.youtube.com/watch?v=K2znQXP08qI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33221-dun-darach\n"}