{"altername_name": [], "name": "Dungeons of Gomilandia", "overview": "Gominolo suddenly realized that the invading army had withdrawn. - \"Perfect! I have won! I am an ace throwing stones!\" Happy and proud, he ran down the stairs of the tower to speak to the King and wait for his reward. Upon arrival, everything looked calm and the monarch on his throne, quiet, very still. He went to speak to him but did not receive an answer. He got closer, and when he touched him he crumbled like a house of cards... but it was bones instead. Suddenly ropes appeared from all over, tied him up, and the enemy monarch appeared from the shadows. - \"You thought you had won and we were only keeping you entertained. You want a reward and you will have it. The best of all. Your own dungeon, the same one that no one has ever left alive.\" The ground opened under Gominolo, and he fell into an abyss. Upon reaching the ground he was in an infinite room dominated by a strange creature climbed on a column, with his eyes covered by a bandage, long white hair and a column on his back at the ends of which seemed to rest a raven and red monster blood. - \"I am the personification of this dungeon, created to be judgment and jail at the same time. Only the righteous, the innocent and those who show that they deserve it will come out of it. Find a key and open the door of each dungeon. Reach the end and get your freedom, but hurry up! Time is short and it will judge you himself if you stay still.\" Gominolo ran to a key on the floor and opened the door at the end. What was behind it? Another room with another key and another door! How many would there be? No one knows, no one has EVER seen it.", "platform": "Sinclair ZX Spectrum", "release_date": "2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "retroworks", "publishers": "Retroworks", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/145828-dungeons-of-gomilandia\n"}