{"altername_name": ["J&E 1 Especial: Elecciones Generales"], "name": "Elecciones Generales", "overview": "Elecciones Generales is a game in Spanish where you play the leader of a political party in the run-up to a general election. It consists of two separate programs: a pre-election stage which takes place over 16 weeks, and an election stage which covers the last week of the campaign. The pre-election stage focuses on improving your reputation, and most importantly getting the money to fund your campaign. You can hire a limited number of staff, and send them to different parts of Spain to drum up support. You can build headquarters, buy advertising, arrange loans from banks, conduct polls in various regions, or spy on the other parties. After choosing any three options, the week is concluded with a TV news broadcast giving information about the campaign of all four political parties, and then a financial report for the week. The stage concludes after 16 weeks, and your progress may be saved to be read by the next program. The election stage differs only slightly from the pre-election stage. There's no time for building headquarters, but instead there are rounds of political rallies, which can be advertised in newspapers, on radio or even on TV if you pay enough. At each rally, you are asked whether you are for or against various political ideals. Your answers will persuade or dissuade the viewers from voting for your party. Audiences from Barcelona will have different opinions on these topics than one from Madrid, so it is important to give different lies to each. Once again, only three actions can be completed in a day, and the events are summarized by a TV broadcast. At the end of the week, the final poll numbers are revealed to determine whether you become El Presidente, or El Hobo.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Juegos & Estrategia", "publishers": "Juegos & Estrategia", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144231-elecciones-generales\n"}