{"altername_name": [], "name": "Emilio Sanchez Vicario Grand Slam", "overview": "It can be said that Emilio Sánchez Vicario was born with a racket under his arm. At the age of seven, he released his first racket, a gift from his arm, and since then his progression has been really meteoric: among his many young successes, a European sub-championship of players under the age of sixteen can be highlighted and, undoubtedly, his \"number\" 2 \"of the junior world ranking. His debut in the difficult professional world was also rapid, in October 1982, when he was only seventeen years old, and from then on his victories began in Grand Prix tournaments: Kitzbuhel, Bordeaux, Bastad, Madrid. Up to totalize move absolute victories in singles tournaments. But, as if that were not enough, he has also brought home twenty-five Grand Prix tournaments in doubles (Monte-Carlo, Hamburg, Barcelona ...), as well as two victories in Grand Slam tournaments (Paris and New York), without forgetting of the silver medal that, partnering with Sergio Casal, got in the Olympic Games in Seoul. Within our country we all know that it is the best. His four national titles in singles and his six seasons as undisputed number one of our Davis Cup team endorse it. But Emilio is also a champion outside the courts. With his sympathy and spontaneity, he has won over half the world, and we were able to see him in Zigurat on the occasion of the presentation of the videogame to the press. Emilio spent a good time in front of the computer disputing a bitter encounter with the programmers, which did not work out too well (heh, heh ...), but did not hesitate a moment to challenge us to a game of the real ones. No comment...", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Fernando Rada Briega", "publishers": "Zigurat Software S.L.", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "2.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/54173-emilio-sanchez-vicario-grand-slam\n"}