{"altername_name": [], "name": "Escape from the Planet of the Robot Monsters", "overview": "Escape from the Planet of the Robot Monsters is an arcade game developed by Atari Games in 1989. The game is based loosely around the campy science fiction B movies of the 1950s. It was ported for most major home computer platforms of the time. According to the introduction, Planet X is a synthetic industrial planetoid whose most notable feature is the research laboratory of the buxom and brainy Dr. Sarah Bellum. Evil aliens called Reptilons invade the planet, capture the good doctor, and force the rest of the humans to manufacture a robot army to take over the Earth. Escape From The Planet Of The Robot Monsters is a one or two-player game in which the players must rescue Dr. Sarah Bellum from Planet X, where her research facility has been taken over by the evil Reptilons. The game is played from an isometric perspective where players control their avatars using Hall effect joysticks on the arcade version. The player must shoot their way through a series of simple maze-like levels, releasing the human hostages along the way. Levers must be found and thrown to activate the escalators which allow access to new areas. Gems can be collected to increase the power of the player's ray gun, and food lockers may be broken into for a health boost. At the end of each level the play switches to an isometric auto-scrolling sequence in which the player controls his character in a small spaceship, and must steer left or right to navigate through a maze of obstacles. If the player reaches the end of this sequence they will progress to the next level.", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Teque Software Development Ltd.", "publishers": "Domark Limited", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.83", "wikipedia": "https://en.wikipedia.org/wiki/Escape_from_the_Planet_of_the_Robot_Monsters", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91788-escape-from-the-planet-of-the-robot-monsters\n"}