{"altername_name": ["The Escape from Hodgkins' Manor"], "name": "Escape from Hodgkin's Manor", "overview": "... When you had first started out on your paper-round, the evening air had been warm and friendly but as the hours passed and the sun began to lower itself into the soft dark clouds of twilight, you had begun to notice a slight chill in the air and wished now that you had taken your Mum's advice and worn your jacket after all. With a backward glance over your shoulder to the grey-haired old man who ran the local shop, you slung the empty bag over your left arm and mounted your trusty bicycle. Swerving to avoid Mrs Jones' black tabby, you quickly sped off in the direction of home and a plate of steaming hot chips and peas ... your favourite! Sons moments later as you were about to pass the residence of the infamous Basil Hodgkins, a scientist of no ill-repute and local big-wig, a large grey object hurtled over the fence and lodged itself in the front spokes of your trusty bike. There was a load \"CLANG\", followed by a screech of tires and, just before you found yourself hurtling over the high metal gate that was the only way into HODGKINS' MANOR, you caught sight of a large crow-bar sticking between the spokes of the front wheel of your cycle. For a second or two all was peaceful, then what had been a steady upwards movement turned into a rapid downwards one and the hard ground surrounding the house loomed up before your very eyes ... these you quickly closed! As your head cleared and the first pangs of pain began to course through your body, you realized that you had landed, and glancing around you saw that you were now on the \"inside\" of the gate and spread all around you were the gardens of HODGKINS' MANOR. Can you escape from the confines of the manor, or will you be doomed to be the ONLY paperboy in captivity? NOTES: This game will accept all the standard commands such as EXAMINE, GET, DROP, IN, OUT and WAIT along with the following abbreviations ... Z=WAIT, X=EXAMINE, G=GET and DR=DROP. The game will also accept such commands as RAM SAVE and RAM LOAD. Use these to store a game-position to memory, but always use the more normal SAVE and LOAD to store a more permanent record onto tape.", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Jonathan Scott", "publishers": "Zenobi Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/169147-escape-from-hodgkins-manor\n"}