{"altername_name": ["The Fast and the Furious"], "name": "Fast 'n' Furious", "overview": "Fast 'n' Furious and Thunderceptor were originally published as part of this compilation and they were not sold independently. The two games have mutual characteristics as the strategic element present in their gameplay, 5 different phases to complete, a top-screen 3rd person view and both being side-scrolling shooting games. Another transversal characteristic can be seen during their gameplay when the use of weaponry seems to be jammed. It's an automatic behaviour of the game which alternates the use of weaponry: when the player is crossing some field of obstacles his fire-power is turned off, when enemies are nearby it will turn itself on. The story of Fast 'n' Furious tells that the player is a flying carpet mechanic who is making some extra bucks by working as a freelance USA (an Undercover Security Agent) for the Military. In his most recent secret mission he has to disguise himself as a merchant and fly across the desert to successfully deliver some important documents to a Military base which is also located at the end of it. His means of transportation is a flying carpet provided with some sort of fire-power. During this dangerous mission he'll face many \"fly-boys\", serpents, packs of monsters and obstacles and also he may pick many collectible objects during his journey, which will serve as trading items at the end of each level: instead of traditionally having to destroy a big boss the player can choose to play a sub-level where he has to figure how to make business with a merchant by giving him the items he wants. If the player manages to discover which items are of interest to the merchant, they will be traded by a portion of vitality. Depending on his success his vitality will be proportionally restored. As for Thunderceptor, the year is 2021 and humanity has already colonized Jupiter's moon Io when an unknown bacterium disease kills approximately 7.000 colonists. The survivors are heading for Earth bringing with them the mortal bacteria endangering the human species with contamination. Your job is to prevent them from reaching our planet. Thunderceptor is a traditional arcade sci-fi shooting game with all its action going on in open space. Many dangers lie ahead as the swift spaceships which usually come in pairs, the spaceship carriers which will first launch fleets of interceptors and secondly will launch intelligent missiles, and the usual Bosses characterized by humongous Battleships, present at the end of each level. It combines in parallel to Fast 'n' Furious's gameplay, moments where the player has to avoid being crushed by several types of obstacles and moments where the player confronts the mentioned different types of infested spaceships. Between each level, the player goes back to the screen of the interface of the game, where he can generate saving points, configure his ship, observe the statistics panel, take a look at his awarded medals and start the next level. This game has a more defined strategic element present in its gameplay than Fast 'n' Furious not only because a proper configuration of the ship will be the key to succeed on the next level, but also because a bad configuration will certainly guarantee a failure. There are 3 ship attributes (shield, normal faser and super faser) which the player can configure. They have to be properly managed during the gameplay after they were configured otherwise the game will become increasingly more difficult. The allowance to create save points between each level also increases the strategic element of the game, giving pause to the player to decide which is the best option for the next level.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Ernieware Productions", "publishers": "Go!", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119427-fast-n-furious\n"}