{"altername_name": [], "name": "Fighting Warrior", "overview": "Hot on the heels of Exploding Fist comes Melbourne House's Fighting Warrior, yet another beat 'em up in true Exploding Fist style. Fighting Warrior actually has a scenario which places you way back in the early Egyptian empire. You are a bit annoyed about the Pharoah's decision to bury your loved one alive as a sacrifice to the Gods. Acting as any mere near indestructible fighting machine would, you decide to rescue the Princess Thaya from the grisly death that awaits her. To reach the temple where the princess is imprisoned, you have to cross a desert beleaguered with a host of creatures conjured up by the Pharoah's court magician. You come across mythological demons, warriors and what can only be described as fighting gargoyles, each doing their best to block your way. As you progress the magician's resolve to stop you becomes greater, and he creates progressively more vicious opponents to replace those that you've vanquished. Along your quest to free the one you love various objects will present themselves in your path. Left there for centuries, they possess mysterious mystical powers. To use them you'll need to employ some alternative thinking and it's best to be sure that the magic they contain is good. Evil magic may bring great harm to you. Once you've fought your way across the burning desert and entered the temple where you beloved is about to be sacrificed, your quest is not finished. A showdown with the court sorcerers follows. Sapping your strength and endurance they will do deadly battle and the only way to release the princess is to destroy them. Having done so, the path is free your quest is over once you've unbound your loved one. You are armed with a sword and start each combat sequence rejuvenated with your life force, represented by a row of chevrons along the bottom of the screen, replenished. During combat each hit from your opponent reduces your chevron supply. Similarly, the beast or warrior you are up against has a row of chevrons and the first one to run out loses land dies). To complicate matters a little, you also have to watch out for the occasional magical arrow which comes whining across the screen from right to left. If you don't duck or jump in time, and are hit by an arrow, two chevrons-worth of life force is lost. Fighting controls are accessed through joystick or keyboard using an understandably similar concept to Fist. The control keys or joystick used alone allow movement in four directions: jump, duck, back off and advance. Your repertoire of aggressive moves is a little simpler than in Fist. Pressing the fire button or key in conjunction with a direction gives you access to an upper strike, mid strike or lower strike. You win ten points for every successful hit on your opponent and it's possible to collect a bonus score for making a very quick kill. Extra bonus points can be won by releasing some good magic from a pot and of course there's a hefty bonus available when you complete the game. As you progress along the scrolling landscape you fight in front of new scenery - all suitably Egyptian, full of pyramids, palm trees and the like. Not just violence for its own sake (or saki?) this time there's a quest in there as we", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Studio B", "publishers": "Erbe Software", "genres": "Fighting", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=2TPuZTvHaNs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45734-fighting-warrior\n"}