{"altername_name": [], "name": "Fighter Pilot", "overview": "If you have ever hesitated over buying a flight simulation program on the grounds that it will be too slow to make an interesting game, Fighter Pilot will probably change your attitude (or should that be altitude)? This simulation moves at 802 knots (at sea level, full reheat) and can create total panic at a moment's notice! The game allows one player to control a jet fighter plane in several modes, which include landing, taking-off and air-to-air combat. Your machine is a McDonnell Douglas F15 Eagle with 2 Pratt & Whitney F 100-PW-100 turbofan power plants, and the program writers claim that the simulation is as realistic as limitations of the computer allow. When loaded you are presented with a menu; 1) Landing Practice 2) Flying Training 3) Air-to-Air Combat practice 4) Air-to-Air Combat 5) Blind Landing 6) Cross Winds & Turbulence 7) Skill levels 8) Control selection. Before we take a look at the options more closely, let's examine the aircraft's equipment. In the centre of the instrument panel is the Artificial Horizon, showing the roll angle and pitch angle. An aircraft symbol rotates to show wing angle relative to the ground, and a moving tape in degrees indicates whether the aircraft is flying nose up or nose down. When it's blue you're flying nose up, when it's yellow, nose down. To the left of the AH is the speed indicator in knots. To the right is the Altitude in feet and below is the VSL - Vertical Speed Indicator, which gives rate of climb or descent in feet per second. Below the airspeed instrument are the flaps, and below the AH is the engine thrust indicator, a bar scale running from 0% to 100% with a red section for reheat. This boosts the engine but uses up much more fuel. There is also a radar and compass with beacon selection, and an ILS/ Flight Computer. The Instrument Landing System offers runway approach guidance or it can be switched to Flight Computer to show your precise ground position from any beacon within a 6 mile radius. It also indicates the altitude of an enemy aircraft when in combat mode. The remaining instruments are a fuel gauge and beneath it, the undercarriage indicator, showing up or down. To control your aircraft there are fifteen control keys, although fortunately these are not used all at once! Joystick left, back, forward and right is controlled by the cursors (or by a joystick!) and CAPS SHIFT/Z moves the rudder left and right. Q/A increases or decreases engine thrust, W/A puts the flaps up or down, U raises and lowers the undercarriage, B puts the brakes on and is indicated on the instrument panel as a red light. N selects the next beacon and M switches the cockpit view to a map. SYMBOL SHIFT switches between ILS and Flight Computer, and finally zero fires the guns when in combat mode, which is selected by pressing G. Back to the menu: Selecting Landing Practice immediately positions you at 1700 feet and 6 miles from touch down with the undercarriage down. In Flying Training you are on the end of the runway and ready to take off. Air-to-Air Combat Practice positions you two miles behind an enemy aircraft and you catch up, select combat mode and open fire when he appears in your sights. The enemy will not fire back - at least, not until you opt for straightforward Air-to-Air Combat. In this scenario you must defend four airfields; you are scrambled, must locate the enemy with your radar and engage. He will lock on to you when there is less than a mile and 5000 feet altitude difference between you. Four strikes from him is fatal. If you break off the enemy will pursue his mission once again, and you may find the airfield damaged. The remaining option, Blind Landing, renders your viewscreen useless, and forces you to land on instruments only. There are three skill levels, Trainee/Squadron Leader/Ace to choose from. Kempston, Sinclair, AGF/Protek joysticks or keyboard are selectable. The display through the windscreen is fairly simple, green ground, blue sky. The other features are the runways of the four air bases named BASE, TANGO, DELTA and ZULU. These are seen in full, correct perspective with centre lines, distance markers and end lights. Additionally, you can see enemy aircraft as you approach, also in full perspective. The tape is accompanied by very clear instructions and technical details.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Digital Integration", "genres": "Vehicle Simulation", "max_players": "1", "cooperative": "No", "rating": "4.14", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=09cvB6ywiFA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45736-fighter-pilot\n"}