{"altername_name": [], "name": "Firelord", "overview": "Firelord is an action-adventure game released in 1986 for ZX Spectrum, Amstrad CPC and Commodore 64 by Hewson Consultants. The player controls the knight Sir Galaheart, who must explore the cursed kingdom of Torot on a quest to recover the four charms of eternal youth. The Evil Queen has tricked the Dragon into parting with the sacred Firestone and used it to curse the kingdom with ghostly apparitions and deadly fireballs, and will only relinquish it in exchange for the four charms. Galaheart is initially defenceless and must quickly find an enchanted crystal in order to defend himself against the cursed apparitions the Evil Queen has flooded the kingdom with. He must then explore the kingdom, destroying apparitions and looking for clues to the location of the four charms. Galaheart can trade with various inhabitants for spells, information and items or attempt to steal them - being caught attempting to steal during trading leads to a \"trial\" in which the player has to attempt to stop on \"innocent\" rather than \"guilty\" with three successively faster alternating arrows. Items can only be stolen if the player has sufficient items to trade for them in the first place. Extra enchanted crystals can be found scattered around the kingdom and the player can use these as initial trading items. Galaheart has a constantly depleting energy level which is sapped further by contact with the apparitions and which can be restored by collecting food, \"trading energy\" which is depleted during trading and can be restored by collecting trading tokens and weapon energy which is depleted by firing and can be restored by collecting small crystals. Galaheart has an initial allocation of lives which can be lost by running out of energy, colliding with a fireball or being executed after being caught stealing. Extra lives can be found scattered throughout the kingdom. Most collectible items are of a fixed type, but some cycle through the available options allowing the player with careful timing to collect the powerup most needed at the time. When the game ends (either through successfully returning the Firestone or losing all the lives) the player is ranked in a pseudo-mediaeval ranking from serf through various English titles of nobility up to the ultimate accolade of \"Firelord\". In order to achieve the highest ranking, the player must successfully steal the Firestone rather than trading the four charms for it, however it is only possible to steal the Firestone if the player has the four charms available to trade to begin with as with any other attempted theft.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "", "developers": "Stephen J. Crow", "publishers": "Hewson Consultants Ltd", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.22", "wikipedia": "https://en.wikipedia.org/wiki/Firelord_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53432-firelord\n"}