{"altername_name": [], "name": "Fireflash", "overview": "Fireflash is a missile defence game where the main goal is to protect a base from continuous extraterrestrial attacks and a subsequent invasion. The base has as defences two turrets located longitudinally at each extremity of the screen which emit horizontal laser beams, and four anti-missile platforms distributed from the centre to the laterals where the laser turrets are located that fire anti-craft missiles. The first ones are specific for short-range defence and the second ones for long and medium-range. The management of both types of fire-power must be differentiated: the laser turrets shouldn't be excessively used because they might became overheated and therefore temporarily non-operational, and as for as the anti-missile platforms take some time to be reloaded, it might be necessary to alternate their use. In the subsoil there are respectively four supply channels connected together by a main artery leading to the anti-missile platforms allowing them to be reloaded. If any channel is damaged its respective platform will become non-operative. If the main artery is damaged the dependent platforms could also become inactive. The attacks either will come from bombs that will fragment themselves in multiples if not destroyed in time; from spaceships that can escape from the range of the laser turrets and may decimate the entire surface of the base; and finally from an atomic bomb that if not destroyed in time will annihilate the entire base allowing an extraterrestrial mother-ship to invade the planet, ending the game. If the nuclear bomb is intercepted the invasion is aborted and the player has passed the level.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Kevin Flynn", "publishers": "Abacus Programs", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119468-fireflash\n"}