{"altername_name": [], "name": "Fist II: The Legend Continues", "overview": "CENTURIES have passed since the tournaments of the Grand Masters. The once mighty Warriors of the Exploding Fist have been betrayed and defeated,their fighting techniques lost beneath the rubble of their temples. The land is blighted, the crops withered, creatures of the night infest the rivers and forests. The people are enslaved, ruled by an evil Warlord from his volcano fortress. Guarded by mercenaries and warriors, protected by natural and man-made barriers, this stronghold has been seen by no man who has lived to tell of its horrors. But at night, around the fire, the village elders speak furtively of bottomless pits, of walls of fire, of caverns of purest night and choking gases, of endless underwater labyrinths, and of the unnatural creatures that dwell therein. And the village elders tell of one who is yet to come, who will seek the Warlord out and free the land from tyranny. Such a one would needs be a direct descendant of a Fist Master, who had acquired the fighting skills of his ancestors and learnt the secret paths to inner harmony. For, say the elders, legend has it that, before their destruction, the Fist Masters wrote the secret of their combat prowess upon scrolls, and scattered them throughout the land. There are rumoured hidden shrines and temples, too, where meditation may strengthen mind and body. If one were to seek the scrolls, and absorb their arcane knowledge, if one were to fight well and bravely against the Warlord's warriors, if one were to conquer his inner self and master the power of the Exploding Fist - why, then the source of evil would be destroyed and the people freed. But, shrug the elders, looking deep within the flames, does such a one exist...", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Consult Computer Systems", "publishers": "Erbe Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.14", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53849-fist-ii-the-legend-continues\n"}