{"altername_name": ["Phantomasa III: Fundamentally Loathsome"], "name": "Fundamentally Loathsome", "overview": "Phantomasa is a Robot. She lives with his father and creator, Julius Gepetus, who earns his money as a installer of doors in the open country, and is an amateur inventor. He lives alone in a small shed in the middle of the forest of Mnor, in the province of Badajoz (from the Parallel Universe). At first, Gepetus designed Phantomasa so she could serve him as a housemaid, but he ended caring about her and growing her up as his own child. One day, while they were sartando en la corchoneta, suddenly they heard a terrible noise. In a blink of the eye, a whole bunch of horrid buggy monsters were appeared out of nowhere: the evil Zenutrostidan Percenambapeck from the Fourth Galaxy. Phantomasa didn’t know what to do. She was paralized and couldn’t do anything about the monsters kidnapping his poor father. In a sudden, she heard a quiet whispering in her left ear, and then recognized her own voice. It was our own Universe’s Phantomasa, cheering her. “You are a raider robot! You have plenty of strength! Activate your breasty rainbows!”. Then Phantomasa (the one from the Parallel Universe) pushed and pushed from the inside, and felt the heat in her breast. Rainbow waves destroyed everything in sight! Now she felt capable. She would go through the four dimmensions, one by one, gathering in each the Onedons (small coin-like devices with an embossed 1) she needed to get to the next one. Once she got to the fourth dimension, the job was luring the Great Bicho Among Bichoes to the Daimos Ainama Ranger Securemtaidaimaidasu deadly trap, to crush it. Then she would save the Universe. And Gepetus, while she was at it.", "platform": "Sinclair ZX Spectrum", "release_date": "2011", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "The Mojon Twins", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150918-fundamentally-loathsome\n"}