{"altername_name": [], "name": "Gift from the Gods", "overview": "Set in the Palace of Mycenae in Ancient Greece, it follows the trials and tribulations of Orestes who, under the directions of the Gods Zeus and Apollo, must avenge the murder of his father, Basileus Agamemnon. Orestes must fulfill his destiny by trial in the Labyrinth beneath the palace and find the solution to the puzzle, or perish in the attempt. Hidden in 16 special rooms are objects, known as Euclidian shapes, geometric designs based on triangles, circles and squares; six of which, when correctly positioned in the Guardian’s Chamber, reveal the exit. Orestes has some help from his sister Electra, who has been imprisoned in the Labyrinth, and she can guide him to where the shapes are hidden, but Orestes has to decide himself what shapes he must take to the Guardian’s Chamber. Illusionary creatures created by the Demi-Gods try to sap Orestes’ strength, but in certain rooms, life-giving water drips from the roof, replenishing energy and stamina. The Demi-Gods have also created illusory Euclidian shapes as which sit beside the real ones, and although these do not fool Electra, she isn’t always around to help. The other problem is his mother, Clytaemnestra, who has learned of his task and has entered the labyrinth to kill Electra. Orestes is able to walk or fly and protect himself with a sword. Whether it really ‘knows’ is another matter, but depending on the circumstances you are able to walk, fly or fight all from the four directions of the joystick", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Denton Designs", "publishers": "Ocean Software Ltd.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=MPtoqpirGK4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78500-gift-from-the-gods\n"}