{"altername_name": [], "name": "Gilbert: Escape From Drill", "overview": "Gilbert is feeling very pleased with himself. A jolly spiffing summer zipping about all over the Earth has left him feeling like a Super Hero. Unfortunately, the rest of his fellow Drillians are not quite as happy. In fact, they are green (and slimy) with envy. Talk, talk, talk. Rabbit, rabbit, will Gilbert never shut up about his time on Earth? Luckily, even Gilbert has to stop for breath and just as things are getting back to normal a telly-gram (!) arrives from earth to invite Gilbert back to do a new series. That's done it. The Drillians can take no more. They decide that the only way to avoid another winter of Gilbert's bragging is to stop him from getting to the Tyne Tees Television Studios and signing his contract. The Millienium Dustbin has certain important parts removed (well wouldn't you class the tollet as important?) and spread about the planet of Drill. The Drillians remain tight lipped about it (not easy when you have a mouth the size of Gilbert's!) but being jolly sporting types, they give him a chance of finding some clues to the whereabouts of the missing pieces. All Drillians love a good video game so they decide that if Gilbert can beat their favorite arcade game they will give him a clue. It all sounds very easy to a being with a brainbox the size of Gilbert's until he realizes that he must reach Earth within 24 hours otherwise the contract will be given to another Superstar. You are in control of Gilbert (most unusual, you had better make the most of it!) He can walk, jump, float and swim around Drill (but not all at the same time, I hasten to add) and can protect himself from the various weirdo creatures that will try to stop him by snotting at them (YUK!). (NOTE: snotting has no effect underwater). If he snots away enough creatures on one screen he will see the HOVERJELLY which may drop an item of food when snotted which can be picked up by running Gilbert over it. Gilberts supply of snot is limited but can be replenished by entering a Milk Bar in the city.", "platform": "Sinclair ZX Spectrum", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80356-gilbert-escape-from-drill\n"}