{"altername_name": [], "name": "Gryzor", "overview": "Infiltrate the Alien Rebel's headquaters in Konami's smash coin-op game for your home computer. Negotiate the electric force field and then overcome wave upon wave of fanatical guerillas as you make your way inexorably towards their base. Split second timing and nerves of steel are a must for this exciting fun packed program with all the features of the arcade original. The Durrs from the Planet Suna have infiltrated Earth's defensive forces, have set up a strong hold in an uncharted region of our planet and have assembled an atmosphere processing plant (APP) which gives them the facility to control the planet's weather conditions. Their plan is to bring about another ice age and thereby take over Earth and all its resources. You are Lance Gryzor, a member of the federation for Earth's defences (FED). Having discovered the evil intention of the Durrs, you must infiltrate the strong hold; make sure your way through the fortification, past the androids and into the heart of the complex to destroy the APP. You will encounter many dangers and numerous weapons systems together with deadly tunnels and awkward mazes. As you get to the heart of the complex, you will find that the APP has already started its dastardly work and if you manage to pass the ice region you will then encounter a labyrinth of pipes and ducts, only then you realise the danger has just begun. For the aliens incarnate will reveal themselves and you will be pitted against the most deadly foe ever known to man! There is only one man who could ever hope to accomplish this mission his name ... Lance Gryzor!", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Ocean Software", "publishers": "Erbe Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.7", "wikipedia": "https://en.wikipedia.org/wiki/Contra_(video_game)", "video_link": "https://www.youtube.com/watch?v=KT5sZxc0R3s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53579-gryzor\n"}