{"altername_name": [], "name": "Gunpower, Treason and Plot", "overview": "GUNPOWDER TREASON AND PLOT Load In 48K Mode There's lots to do in this game, where you take the place of Guy Fawkes, the daft bloke who tried to blow up James I and his Parliament in London on November 5th way back in 1605 (the date which was later to become known as Bonfire night). Fawkes and a few others were later executed (which is why we burn a Guy on the bonfire) after being caught under the Palace of Westminster just before lighting the fuse to set the gunpowder off and blow them away. But that's more than enough history, what about this game? Well, the object of Gunpowder, Treason And Plot is to take the part of Guy himself and actually succeed in his original task. To do this you must collect several items necessary to complete your mission which include a fuse, three barrels of gunpowder and a candle (to light the fuse). However, nothing's cheap these days and before you buy anything you'll need to collect coins in all of these items. Coins can found all over the game's setting, which is, need less to say, London town. To purchase these offending items you must find and enter different shops e.g. 'The Blacksmiths' and the 'Store'. But you can only carry one barrel of gunpowder at any one time, so remember to find the Estate Agents and rent the house on the first screen by standing on the keys and pressing fire. If you have enough money, you will pick up the keys, allowing you to enter the house at will and store the gunpowder there. Put all barrels of gunpowder (and fuse- wire etc.) into the cellar on the right in your accommodation and things will be set up. After blowing up parliament, you have to make your escape to France by going to the extreme left of the harbor where a ship will be waiting to take you to safety. During the game you can purchase things like vaccine (to make you immune to the Black Death clouds), and by entering inns, pubs or cafés you can purchase food to replenish lost energy. You can also pawn some items if you don't have enough money to buy gunpowder etc. Just go tho the shop with the three balls outside. All this must be done by 12 o'clock. (You start off at 4 o'clock). Remember to steer well clear of anything that moves. Including horsemen, foot soldiers, merchants, bats, out of control rolling wheels and, believe it or not, 'black clouds'. Apparently, Guy is susceptible to bouts of fatal depression! Baddies can only be avoided by running away or jumping over them. There is a life gauge on the screen so as soon as it starts getting low head for a pub or shop and get some food or drink. (Hint: Try making a location map - you'll find it's easier than wandering aimlessly.) CONTROLS: Keyboard Controls: O: Walk left P: Walk right Q: Jump/exit screen upwards or enter building A: Exit screen downwards (shown by arrows) or leave building M: Collect money, buy something, usesomething or drop something", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Adrian R. Shaw", "publishers": "Redwood Designs", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=6UWgClmkP9E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371258-gunpower-treason-and-plot\n"}