{"altername_name": [], "name": "Hard Cheese", "overview": "Hard Cheese is a variant of Mr. Do!. The style as much as the gameplay are identical. The player commands a sort of bulldozer that furrows paths in it's way as long as he drives and the path is yet untouched. This vehicle is armoured with a weapon that emits a deadly green flash, so dangerous that it could also destroy the bulldozer. Between each firing a certain period of time is required to reload the weapon.. At the centre of the screen in the beginning of each level, there's a figure rejoicing itself about the misfortune of the player. It spawns clones of himself to be thrown against the player. As long as a certain number of this clones aren't destroyed by the player, this figure will continue to reproduce itself for an indeterminable number of times although the number of creatures present at the same time is limited. When this number of killings is achieved, this figure will transform itself into a giant cheese and its minions no longer will be able to reproduce themselves. The level will be completed when all of them are destroyed. This cheese as much as the other objects resembling soda cans, can be useful only to acquire points. It's not fundamental to collect them to pass a level. The player can use the fruits present in the screen which resemble apples to crush his enemies. The gravitational and weight principles are applied to its practice. But beware when enemies are shot down by a green spark, because they could turn into more heavy fruits, which could be dangerous to the player if at the time of the shot he is located at an disadvantageous position.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Eugene Farrell", "publishers": "ABC Soft", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=82g4kMDXW5M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29705-hard-cheese\n"}