{"altername_name": [], "name": "Horace Goes to the Tower", "overview": "Horace, whilst drunk and pining for the fame and the wealth of the old days back when he was a well known computer game star, gives in to the evil councils of that rotten old egg, Dizzy, and stars in some games on the Commodore 64 – a really obscure business. He really needed the money. Tragically, not only did the C64 games not lead to a revival of Horace’s Spectrum career but the C64 games, which he’d hope so desperately would be unnoticed by all, were announced to all and sundry in the gutter press! “Horace sells out in C64 shocker” went the headlines, to Horace’s utter dismay. Suddenly, no one in the street would look at him. The ZX Spectrum so-called mascot starring in C64 games! That’s a shock! He felt like Katie Price, only without the placky tits, but with a brain. He was so miserable that he didn’t even wait for the coppers to come and arrest him, instead going to the nearest nick by choice and giving himself in. The police handcuffed him and put him in the Tower of London, telling him that the next day he’d be beheaded. “Oh well, at least when I’m dead my suffering will be over”. “It bloody won’t be”, said a voice, and Horace whirled around to see the ghost of Sabre Man standing in the corner of the room. Horace jumped back in terror, and Sabre Man continued “There’s a special corner of gaming Hell reserved for sellouts, and that’s where you’re heading, and you’ll spend gaming eternity”. He paused then added “whooo-ooooooooooooo” to bring home just how scary Horace’s post death future was going to be. “I-I’ll escape from gaming Hell”, said Horace, “that’s what I’ll do. I will escape and then I’ll get to gaming Heaven somehow”. “No chance”, laughed Sabre Man, taking the same sadistic delight in Horace’s plight as he had when he’d witnessed thousands of kids spending their hard earned pocket money on that crappy excuse for a game Sabre Wulf, “There’s about as much chance of someone escaping from gaming Hell as there is of Joefish getting his lazy bottom in gear and finishing Buzzsaw.” “Actually, there is a way to help both of us. If you escape from here, and burn the master copies of your C64 games, and the master copies of other sell-out games, then you won’t go to gaming Hell”. “Fecking wow!”, cried Horace in delight, and he jumped up and ran to the door. He tried to open it, but it was locked, being a prison cell and all. “I’ll agree to open the door if you agree to find and burn the master copies of my two C64 games, Sabre Wulf and Underwurlde so that I’ll be freed from gaming Hell too”. “Fair enough”, nodded Horace, and the door disappeared and Horace exited the screen (no scrolling here, it’s a Speccy game!) and emerged into the corridor. Jumping over the first fatally deep gap between the floating platforms (if they had those in real prisons then they wouldn’t be over populated!) Horace began his mission…", "platform": "Sinclair ZX Spectrum", "release_date": "2011", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "The Mojon Twins", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/147604-horace-goes-to-the-tower\n"}