{"altername_name": [], "name": "Hyper Sports", "overview": "The gameplay was much the same as Track & Field in that the player competes in an event and tries to score the most points based on performance criteria, and also by beating the computer entrants in that event. Also, the player tries to exceed a qualification time, distance or score in order to advance to the next event. In Hyper Sports, if all of the events were passed successfully, the player advances to the next round of the same events which are faster and harder to qualify for. The events changed to include these new sports: Swimming - Swimming speed is controlled by two run buttons, and breathing is controlled by the action button when prompted by swimmer on screen. There is one re-do if a player fouls due to launching before the gun, but only one \"run\" at the qualifying time. Skeet shooting - Selecting left or right shot via the two run buttons while a clay-bird is in the sight. There are three rounds to attempt to pass the qualifying score. If a perfect score is attained then a different pattern follows allowing for a higher score. Long horse - Speed to run at horse is computer controlled, player jumps and pushes off horse via the action button, and rotates as many times as possible via run buttons (and tries to land straight up on feet). There are three attempts at the qualifying score. Archery - Firing of the arrow controlled by action button; the elevation angle is controlled by depressing the action button and releasing at the proper time. There are three attempts at passing the qualifying score. Triple jump - Speed is controlled by the run buttons, jump and angle are controlled by action button. There are three attempts at the qualifying distance, and player fouls if first jump is after the white line. Weight lifting - Power used to lift weights is controlled by run buttons, while shift of weight from lifting up to pushing above the head is controlled by action button. There are two attempts at the qualifying weight. Pole vault - Speed to run is preset by computer, while release of pole and body movement is controlled by the action button. Player continues attempting the increasing heights until he/she fouls out (by missing base at the bottom or by knocking off horizontal bar with body at the top). The third foul disqualifies the player. (This event did not feature on the ZX Spectrum version.)", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Imagine Software", "publishers": "Imagine Software", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Hyper_Sports", "video_link": "https://www.youtube.com/watch?v=_Aj2TlLDk4s&t=804s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29714-hyper-sports\n"}