{"altername_name": ["I of the Mask"], "name": "I, of the Mask", "overview": "Welcome to the Space Trials on Planet Newgamma III. This is your most important mission. Keep your translator on at all times - no confering during the qualifying bout, you know the consequences. Many of you will already be skilled or qualified pilots, fighters or strategists. But do not be too confident because here we only take the best, and when we say the best, we mean by OUR standards. For those not familiar with A4A PACK JET SUITS, the controls are not difficult. A few earth minutes running and it will become second nature. In low gravity, the effects of your suit are boosted and you will take flight. Your laser is attached to your belt, pointing forwards. This leaves your hands free to use your JET-SUIT controls. All instruments are projected onto a Head-Up Display onto the bottom of the inside of your helmet. When tilted, the area of map will expand to fill your whole visor. The maze contains 32 universes. Each universe has 3 crystals at its entrance. A single shot at the chosen crystal will activate it. One crystal will transport you to another universe which is located nearby. One crystal will bean you to another part of the maze, and one will reveal a robot mechanism. There are enough robot parts throughout the maze to create at least one complete robot. You require the Robot to escape from the maze. Each robot component must be bombarded successfully 3times to render it harmless. The robot parts must be collected in the correct order - feet first. When you finally collect the Mask and it appears on your Robot, you will have won the game and become, Of The Mask.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "", "developers": "Spaceman Ltd", "publishers": "Electric Dreams Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/55539-i-of-the-mask\n"}