{"altername_name": [], "name": "Knightmare ZX", "overview": "Anyone familiar with the original MSX Knightmare game will feel at home with this conversion, which is similar, lacking only a few of the weapon gems from the original. Although an eye sore, our hero's Magic helmet grants the ability to resurrect after death, granting a limited number of lives with which to complete the Quest. More lives are rewarded for high scores, or collected directly by picking up Kingly Chess Jewels, hidden as ground icons. Some ground icons are hidden, being unearthed only after a player shoots them. Shooting ground icons multiple times reveals their Jewel, ready to be collected on contact. Collecting a Chess Jewel activates useful powers to aid our hero, like freezing time (Queen), Killing Enemies (Knight), Granting lives (King) or Granting points (Rook). Since high scores yield extra lives, never underestimate the need for collecting points. Like ground icons, Bridge scenery is also occasionally hidden - something to consider if you think finding icons is only about treasure hunting... Aphrodite has also scattered useful Magic and Weapon Gems. Gems generally float down screen towards the player and can be collected on contact. Shooting gems transforms them from one type of power into another. A careful player can cycle through the gem powers by shooting them, before collecting the one that he wants. Weapon gems grant bonus points, twin arrow firepower or flaming arrow power to make our hero more formidable. Similarly, magic gems grant bonus points, bullet protection (shield) or protection from enemy contact (transparency) if collected. Popolon's Quest is compulsory, like his Love for Aphrodite. The scenery will neither stop nor idle for our hero, being compelled, as he is, to put one foot in front of the other towards his Love. So avoid getting trapped between descending scenery, if you wish to preserve your good looks! The enemy is many and varied, some fast, some slow, some firing, some killing only on contact. Not all enemies die when shot. Some are more dangerous when attacked, and best left alone. Nevertheless, all enemies can be killed in some way or other. Death, unpleasant though it is, grants at least one advantage. As he phases from the Beyond, back to the world of the living, Popolon is temporarily rendered invulnerable to both bullets and enemy contact. Such invincibility can prove useful, after death, if a player is quick... At the end of each level, on the steps of the Gateway to the next, awaits an Overlord... Each Overlord is different, but all must be vanquished before our player can proceed - none can be avoided... Good Luck!", "platform": "Sinclair ZX Spectrum", "release_date": "2012", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Climacus", "publishers": "Climacus", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150308-knightmare-zx\n"}