{"altername_name": ["ZX Larry"], "name": "Larry", "overview": "ZX Larry is inspired by Leisure Suit Larry in the Land of the Lounge Lizards, which is the first game in Al Lowe's Leisure Suit Larry series, largely inspired by the text adventure Softporn Adventure, though with a greatly enhanced script containing more humorous descriptions and dialogue. The gameplay in ZX Larry has been changed a bit – The original game was a third person game where you controlled Larry with a text parser to input commands for interaction with a graphical environment. This version is seen from first person view, and you have a menu with commands, a menu with the stuff you collect, a menu with text when talking to other people, and all this is controlled with a cursor that is K-mouse compatible, but also can be controlled with keyboard or joystick. Progress is achieved by collecting various items and figuring out which of those may be essential for conquering the hearts of the several female characters appearing in the game. The game allows the player to access most of its locations (a bar, a casino, a convenience store, etc.) from the very beginning, with only a few key ones being barred due to the lack of a crucial item. Moving between some of the locations can only be done by cab. Paying for those trips, as well as procuring some of the items, requires the player to manage Larry's finance by gambling at the casino. Progress is tracked through a set amount of points, awarded for advancement or minor actions. There are several ways to die in the game, most presented in a humorous fashion. The game contains adult situations and semi-implicit depictions of sex.", "platform": "Sinclair ZX Spectrum", "release_date": "February 27, 2019", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Rafał Miazga", "publishers": "Bumfun Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=NKMgxlSUWV8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126410-larry\n"}