{"altername_name": [], "name": "Laserwarp", "overview": "I AM THE MASTER. It is your task as a supposedly competent fighter pilot to resist my takeover of your pathetic universe. I really don’t think that you will fare any better than the Ogladians or the Skrall, but that’s your decision. I have decided to warn you in advance of what you are going to meet so you can start panicking now. My attackers will come at you in nine waves: Whirling Dervishes Ramships Space Mines Interstellar Pogos Galactic Spiders Cosmic Spinners Homing Droids Hyperspace Chickens The Master You will be shown at each stage what you can and must destroy, but I will always send indestructable forces as well (which can obviously only be avoided). I will allow you 4 lives. Up to level 9 if you lose a life you will recommence at the stage you died, i.e. The same number of aliens will be around, and your time limit is the same. So that you cannot relax at all you will have a time limit on every screen. Once this limit is passed, your score will begin to decrease VERY rapidly. On screen 9, (MY screen) as you die the screen is reset to the start, i.e. My ship is repaired (if damaged) your time is zeroed and there is NO LIMIT to the number of attacking forces. Because I realise you will never succeed in wiping out wave after wave of my forces, you will initially be able to start at any point. However, this will be for practice only and you cannot defeat me unless you start with the Whirling Dervishes and defeat all other forces thrown at you. From my study of your culture I understand that Earthlings require rewards for their efforts, regardless of how puny they are. For this reason a \"Hall of Fame\" has been included in our battle, and this will appear once you are defeated. If your score exceeds 5000 points a code consisting of four digits or numbers will appear on your battle screen. This code should be sent with your score to Mikro-gen to be included in the £100 per month competition, details of which are included. This will mean instant fame as I understand Mikro-gen will also be publishing this \"Hall of Fame\" each month in the computer press. So - I have issued my challenge - the rewards are high for those of you prepared to accept (if you dare) although I still don’t think you will be able to defeat me, THE MASTER.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Chris Hinsley", "publishers": "Mikro-Gen Ltd", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/121969-laserwarp\n"}