{"altername_name": [], "name": "Laserbirds", "overview": "Laserbirds is a brand-new commercial homebrew game for the ZX Spectrum The origin of the so-called Ornithoids is unknown and tramples over our sciences. Despite some popular outcry in favour of the new species, their countless number and radioactive toxicity make coexistence in our environment impracticable. Though little we know about these beings, we have uncovered that they are in fact belligerent. They possess good memory, hearing, and adaptability. Added to their offensive through deadly beams, they can teleport themselves across short distances - among other skills never dreamt of. It is best not to underestimate them, for when they feel outsmarted, they will behave like nothing ever seen in the natural world. Little by little they're becoming the masters of all Earth, but it's in the highest altitudes where they paradoxically seem to become more vulnerable. We know also that they're able to count up to four. Even if none of this sounds useful by now, that's all we are able to tell you. Communication was impossible. Their quasi-indestructibility challenged our capabilities to design this defensive action. Duty comes to summon you in the last minute to assure our survival. There will be no parley and there will be no glory. Traitors and defectors shall be punished severely; this is our hour of need, the apex of a calamity. There will be no time for anything but bravery beyond the gates of this hangar. Embrace your fear! REQUIREMENTS The present version of Laserbirds was designed for the classic ZX Spectrum 48K/ZX Spectrum Plus. It won't work properly in 128K models. It's functioning on clone equipment also cannot be guaranteed. Furthermore, it also works on the new ZX Spectrum Next as long as in 48K mode and refresh rate set at 50 Hz.", "platform": "Sinclair ZX Spectrum", "release_date": "2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Teknamic Software", "publishers": "Teknamic Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=mqHPvOe7BlM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129063-laserbirds\n"}