{"altername_name": [], "name": "Liberator (P.J. Software)", "overview": "I climb a tree and wait for one of the soldiers moving through the forest to pass by me. A little while approached one with an aspect of alien officer. Fall on him. I took his gun from him and forced him to tell me what was happening. So I find out that the occupation has been fast and effective: no land military center had detected anything abnormal on their radars until it was too late: all resistance had been sweeped away and only small disorganized groups trying to resist the invader. I also knew that the defense of the enemy headquarters had been organized on three levels, each of which was defended by a different type of soldier: those on the surface, trained to fight under any atmospheric situation, and dressed in a traditional way so as not to lift suspiciousness, they were accompanied by dogs ready to end any rebel. The second level occupied the sewage network, where invaders well adapted to darkness patrouled incessantly through the galleries. Further down still was the great control complex where the central computer had been installed and all the equipment was stored; the defense of this enclosure was in the hands of automated robots. Controlling each level, and preventing passage to the next, were the link transmuters, armored structures, that with an accurate shot at their only weak point, they would launch us to the next level, but if they fail, they would strike back, re-sending us to the place of departure. At the end of the last level the great brain that directs the invasion was located, without which the troops would become disorganized and could be easily defeated. At that moment I saw clear my mission, I should get into the deepest of the enemy headquarters and destroy it. To achieve it, he had the powerful rapid-filling submachine gun and unlimited ammunition that he had just taken from the enemy, and some items disseminated by the change that would provide help such as living replacement, increased shooting power, number of shot, destruction of all enemies in sight and food, but these unfortunately were toxic to humans.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Carlos Coronel", "publishers": "P.J. Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=GffZSY6C62M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158976-liberator-pj-software\n"}