{"altername_name": ["Manchester United"], "name": "Manchester United: The Official Computer Game", "overview": "Lots of famous things come from Manchester, don't they? (The Manchester Ship Canal for one.) it's a happening sort of town. More flares were sold there last year than straight trousers, for example. (Yes, it's that trendy!) in fact, just about the only people in Manchester who don't wear flares are the footballers, and that's only because wearing shorts is part of their job (they wear flares in their private lives, most of them). LiKe I said, it's a happening town. It's also got a rather happening football team (well, it's got two football teams, but we don't talk about 'the other one'). Not in this review anyway). As anyone who knows anything about anything will already know (phew!), Manchester United has had a pretty spectacular history (rather neatly outlined in the front of this game manual in fact). The high (and low) points were during the 50s (when footballers wore flares too!), with the remarkable victories and then tragic deaths of 'Busby's Babes', the Man U team made up of the finest young footballers of the period. The nation was rocked. And, as it 'appens, the nation's being rocked by footie this year too, which causes a bit of a problem as far as we're concerned. There are so many soccer games about it's becoming a bit of a nightmare rating them all - they're just all so similar! Or should I say, most of them are very similar - Manchester United (the computer game) is quite a different kettle of fish. For a start, it's one of those rare beasts - the half management/half arcade game, firmly split into two loads which you can play together or separately if you prefer. In management-only mode, both teams are controlled by the computer, and you just sit there twiddling your thumbs (in true management style, ho ho) while your decisions to train, buy new players or whatever are tested on the pitch. In arcade-only mode you have an okayish but unspectacular footie sim. It's only when combining the two that you get the true flavour of the game. Anyway, let's play it. Boot up the management load and you're faced with a rather pretty pic of a footballer and various icons dotted all over the place. Access any one with the cursor and you get a rather neat fade effect before being dropped into either a further set of sub-options, or a typical management-style list - you now get the chance to do something to modify your team's performance. How about mucking about with the make-up of the squad (starting off with a fully-fit team, you gradually suffer injuries and suspensions as the league progresses) by changing positions and buying or selling players? Or what about upgrading their training schedule (not too harsh though, or they'll get tired, demoralised and injury prone)? You can set game difficulty levels and match time, keep an eye on progress charts (and the front page of the local paper for info on your own popularity!) or check on the league and how future opponents are doing too! It all works very smoothly indeed and is well presented (or as well presented as masses of lists can be!). But for all that it's just a management game. You may hate them. Be warned. Then there's the arcade section. Now to be honest this isn't the best footie sim we've ever seen (but then nor is it the worst). In fact, it's very much along the lines of of the Speccy version of Kick Off (if you remember that). An overhead view, with fat, blobby graphics and a few programming discrepancies, it plays very fast indeed, the ball bouncing around all over the place. Fun, but not that much like the real game, I reckon. So what's the verdict? Well, if straight arcade footie is your bag there have to be better choices, but it the player manager combination appeals and. or you're a big fan of the team themselves you could do a lot worse. (I have to say though that both this and the various Liverpool games seem like slightly strange moves to me - after all, aren't you going to get a game that sells very well in its home town but does dismally in London or wherever, where Spurs, Chelsea or Arsenal fans will probably burn down the shops where it's sold? No? Oh well, that's all right then. Just a thought.)", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Fred O'Rourke", "publishers": "Krisalis Software Ltd.", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149921-manchester-united-the-official-computer-game\n"}