{"altername_name": [], "name": "Maritrini, Freelance Monster Slayer", "overview": "After experiencing the sweet taste of success, Maritrini woke up one fine day in a mess of bed sheets and with the biggest hangover she could remember from her thirty five years of age. Dazed by the remains of alcohol in her system and the persistent smell of cigarettes which polluted the whole house, she collapsed over a chair in the kitchen in front of a rusty coffee mug. She still kept some signed books and the pictures taken during the filming of “Maritrini, Monster Slayer“, her most famous TV series, from which she still had recognition by the cashiers in the supermarket. However, since the series director Paul Duran was admitted to the Central Hospital with a bandaged face due to a sprained eyebrow (that’s what the medical report assured, at least) for eight weeks, everything changed for Maritrini. After such time, somebody who claimed to be the series director, but who didn’t look like Paul at all, fired Maritrini instantly. The young enterpreneur, far from feeling discouraged, started a refresher course about “how to manage your own business”, became self-employed and added a small sign in her mailbox: “Maritrini: if you have a vampire after you I will turn it into poo“. The catchphrase was her friend Dani Alamenasbarriel‘s original idea. Dani was a genius in marketing and avertising. That very morning the telephone rang. She looked for it amoung a bunch of paper sheets, pillows and plastic dishes covered with orange snacks until she finally found it. She answered and recognized the mysterious voice of her (new?) former boss at the other side of the line. He was somewhat alarmed and frightened. His daughter, his ONLY daughter, had been kidnapped by an evil organization which experimented to genetically modify human beings and turn them into monsters. An evil organization? Maritrini had never heared talking about something like that. When she tried to learn more about the whole matter from her former boss, the communication was cut. What was happenning? Somebody was trying to fill the city with blood scukers, zombies, amorphous beings? She didn’t recall Duran talking about a daughter… ever! Anyways, the only one able to solve this mystery is Maritrini herself, and Paul Duran is positive about that.", "platform": "Sinclair ZX Spectrum", "release_date": "2012", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "The Mojon Twins", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150560-maritrini-freelance-monster-slayer\n"}