{"altername_name": ["Mariano the Dragon"], "name": "Mariano the Dragon: Capers in Cityland", "overview": "Mariano the Dragon: Capers in Cityland is a 2D platform game starring Mariano the Pink Dragon. Five of his friends have been locked by the Tetrarca Pachin Poi Poi on the planet Cityland and he has to rescue them. These friends are all characters by other games from The Mojon Twins or the developers: Chost-Embustes from the Chost-Embustes series, Horace from Horace Goes to the Tower, Nanako from the Nanako series, Phantomasa from the Phantomasa series, and Sgt. Helmet from the Sgt. Helmet series. They were all hired for a job, but messed up. To complete the game Mariano needs to finish their tasks and correct their mistakes. The game consists of a single, large level formed by a large amount of single-screen rooms connected both horizontally and vertically using the flip-screen mechanic offering a large amount of freedom. Mariano starts with 80 health and has no means of attack, so he has to avoid hazards and enemies. The main actions are moving around and jumping. There are many platforming sections to complete. Each friend is locked up in a different cell and five keys of different colours need to be found to open them. This can be done in any order. The corresponding key is only provided after that character's task has been completed. Completing a task often requires locating and picking up a specific item first. For Nanako you need to find her green boots and use them to defeat ten Karakasa enemies. For Sgt. Helmet a disk needs to be found to send plans of an enemy fortress using a computer terminal. Horace had to paint fifteen cans red and Mariano can do this once he has found a bucket of red paint. The Chost-Embustes were hired to rid a cave of ghosts. Mariano needs to collect five traps as well as the dematerializer and then head to the caves to trap five ghosts. Finally, Phantomas was meant to collect ten shooting stars as a source of energy. These can be found all over the level. Once a task is completed the key is provided right away.", "platform": "Sinclair ZX Spectrum", "release_date": "2008", "game_type": "Homebrew", "esrb": "", "developers": "The Mojon Twins", "publishers": "Computer Emuzone", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113202-mariano-the-dragon-capers-in-cityland\n"}