{"altername_name": [], "name": "Masterchess", "overview": "Mikro-Gen version (different from Mastertronic version) [This is a slightly altered version of the Psion/Sinclair Chess] Load the program in the usual way. There are two parts, a BASIC loader and the main part in machine code. Do not turn off your tape recorder until yousee the chess board displayed on the screen. The first question you will be asked is Play / Colour / Setup. Answer P, C or S. A reply of C allows you to select the type of piece used in the graphic display, and set up the colours used for the board, pieces and surround. You will be prompted for subsequent input. There are two types of piece: outline and block. The default is black and white squares for the board, with green and magenta block pieces. The surround is white ink on blue paper; these are our preferences. If you are using a monochrome television, we have found the best colours are green and magenta for the board, with white and black block pieces. Experiment for yourself to obtain the display which suits you best. Answering S to the initial question allows you to set up the board position. You will be presented with a line of inputs which will be recognized by this routine, and one of the centre squares of the board will flash for a few moments. You may move the flashing square with the cursor controls. Pressing Delete will remove any piece that was on that square. Entering the letters K, Q, R, B, N or P will insert the appropriate piece at the current square (you will be asked for its colour and whether or not it has already moved). C will clear the board completely; this is mainly of use when setting up chess problems. Finally, X is used to exit to the game part of the program. At this point you can select the colour, the computer's playing level and decide whose turn it is to play (the reason for this is that you can adjust the board from the middle of the game). The final, and probably the most important, option is P; play. You will be prompted for your colour and the level of play. The levels are from 0 to 9, with 0 being lightning chess, and therefore the easiest. The lower levels reply to your move rapidly, but the highest ones can take a considerable time. Whichever colour you choose to play, you will be playing from the bottom of the screen. Moves are input by entering the co-ordinates of the square from which you wish to move, followed by those of the square you wish to go to; eg. e2e4 to move the king's pawn forward. A scrolling record of your most recent moves is maintained on the left of the screen. If you make a mistake in entering a move, the delete key enables you to re-enter it. Castling is performed by entering the king's move only; eg. e1g1 or e1c1. You will not be allowed to make an illegal move. There are several other options at move time. Entering R requests the program to recommend a move. This move will be calculated at the present level. L allows you to change the level of play. Use Z to copy the screen to the ZX printer (if you are in block graphics mode, the display will temporarily change to outline graphics while this is done). T is used to save the current game on tape. Finally, entering an X sends you to the opening prompt. You can then go on to the setup routine to correct an erroneous move, make alterations, change sides, etc., if you wish. Note that the program incorporates an opening book, but if you enter the game via the setup routine this is disabled. Also note that you will be asked if you want a queen or knight when you promote a pawn. The game has been written to play in an interesting manner, and with as many features as we could fit onto the screen; we hope you enjoy it.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Mikro-Gen", "publishers": "Mikro-Gen", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=XWUra9bqZfo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150150-masterchess\n"}