{"altername_name": ["Max Pickles Part III: El Precio del Poder"], "name": "Max Pickles Part III: The Price of Power", "overview": "After retrieving a great quantity of gigant diamonds from the mine, Max became billionaire. Besides undergoing aesthetic surgeries and buying exotic cars, he built a luxurious mansion. One day he lost the keys of his mansion, while he had left all the traps and security measures activated. He foresaw no other alternative than breaking in somehow, and disable security, with the added inconvenience of his enhanced musculatory complexion, product of many gym hours, which has took away part of his agility. Your mission is to help Max to get trough a nearby subterranean cave, get to the cellar, and then try to access the mansion itself to disable the alarms from the Control Center itself. Structure and concepts ---------------------- - The pathway to the Control Center is represented by 12 screens-levels in which one single exit is present. - Max got 9 lives and a bar representing his energy, which decreases with every contact with enemies and also as time passes. This bar is refilled when the screen is passed. - There are special enemies which make Max to lose a life by contact. They must be eliminated by throwing an object to them, which is present in the screen. - Also, there are dangerous chasms which must be avoided by Max if he does not want to lose a life. - Max will score points for each defeated enemy, and also, according to the remaining energy when passing each screen. - Max can climb ladders, and pick up objects just passing over them. To use an object he must press the Down key. - Max must learn, in painful way, the location of numerous traps.", "platform": "Sinclair ZX Spectrum", "release_date": "2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "WORLD XXI SOFT INC.", "publishers": "WORLD XXI SOFT INC.", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127651-max-pickles-part-iii-the-price-of-power\n"}