{"altername_name": ["Max Pickles Parte I: El Castillo Embrujado"], "name": "Max Pickles Part I: The Haunted Castle", "overview": "By the end of the 80's decade, the world was suffering deep social, economic and political changes. None of this was relevant for Max Pickles, a punk with a particular personality and appearence, but with big ambitions, amazing agility, and a great desire of getting rid of bullying about his persona. One day, it came to his knowledge the existence of a secret map, detailing the exact location of an abandoned diamonds mine. This map is supposedly hidden in the interior of a huge medieval castle where strange phenomena take place, probably related to the ghosts of former dwellers. Max found in this story the opportunity to make fortune and thus get respect and social validation. Your mission is to help him to retrieve the map of the diamonds mine, from the interior of the haunted castle itself, and flee from such horrible place. Structure and concepts ---------------------- - The castle is represented by 12 screens-levels in which one single exit is present. - Max got 3 lives and a bar representing his energy, which decreases with every contact with enemies and also as time passes. This bar is refilled when the screen is passed. - Max will score points according to the remaining energy when passing each screen. - Max can climb lianas and chains, and activate objects just pushing them with direction keys. In the case of trampolines, they must be activated with the Down key, while the normal jump remains available by pressing Jump key. - Max must learn, in painful way, the location of numerous traps. They will force Max to restart the screen, but they won't make him lose lives.", "platform": "Sinclair ZX Spectrum", "release_date": "2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "WORLD XXI SOFT", "publishers": "WORLD XXI SOFT", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127649-max-pickles-part-i-the-haunted-castle\n"}