{"altername_name": [], "name": "Meteor Storm (Quicksilva)", "overview": "Excerpt from the \"Book of the Falurian Empire\". \"Meteor Alert, Meteor Alert.\" The speaker grill grates onto the command deck of the Thalcian Spacer forcing me to look up from the twinkle of lights on the console in front of me. I curse under my breath. My calculations are almost complete. I check the scanner, there is something not right about the formation of the Meteors. Fear creeps over my body like a Balcoan Slimer; that meteor storm is being driven at me ... I am in this sector investigating the find of an ancient artifact, of the People of Sphere, locked in a Trans-dimensional field. I was almost ready to break it from the Field when the Meteor storm arrived. I swing into the attack chair, strap myself in ready for some fast manoeuvres. Chunks of rock bombard me from all directions, my hands fly over the controls as I shift the Spacer to fire at the nearest rock. I gasp in surprise; the rock has a Photo-Thrust unit built into it. Space burns brightly before me as the beam from my X-ray laser slices into the rock, shattering it into pieces. Then I see the reason behind the storm: Xxkraan Raiders, the aliens from Andromeda seeking dominance over the Falurian Empire. The saucer of a Xxkraan Raider twists at me, guiding the storm of Meteors at me. I fire, the X-ray beam slits open the saucer, it explodes in a dazzling pyrotechnic display. Immediately I am surrounded by a horde of meteors seeking to grind my Thalcian Spacer to nothing. I jab the hyperspace button. Reality twists in on itself, for a moment my body is turned inside out, then I'm back in Real Space ... The meteors move back at me, my teeth clench as I send more destruction lancing out from my X-ray laser ... A Xxkraan Raider appears in the gap between the jagged rocks, I turn and fire ... I thrust at another cluster of rocks, distant stars reflect from the metal of the Photo-Thrust units embedded in the meteors. I fire again, the Xxkraan must not gain the knowledge left by the enigmatic, long dead People of Sphere ... The rocks converge then diverge around me, I spread a network of X-ray beams round my Spacer. A Saucer moves in ... Debris tumbles about as I fight for survival, and for the knowledge of the \"People of Sphere\" ...", "platform": "Sinclair ZX Spectrum", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "John Hollis", "publishers": "Quicksilva", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KvXhpZVbxzM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/55593-meteor-storm-quicksilva\n"}