{"altername_name": [], "name": "Michel Futbol Master", "overview": "Michel is, as we all know, the real star of Real Madrid and the Spanish national team. He is an idol now. But in his day he also had his idols: Vicente del Bosque and Italian Antognioni, among others, were the figures in which he was reflected to get where he is right now. That's why Michel wants, through this video-game, to give encouragement to all those kids who are just starting to play football: \"I would say to a guy who starts watching the game, because I think it's quite stimulating to play soccer. that way and one more way to approach learning to play it. When I was a child, I did not have a computer, but I did have the \"madness\" to cut players' cards and play football with them. Now you have the opportunity to do it with a computer, which is much more fun ». Apart from everything, Michel as a professional has his own business card: four consecutive consecutive league champions, two UEFA Cups, a Super Cup, a League Cup, a Copa del Rey, two times a European Cup semifinalist and , in addition, indisputable holder of the Spanish selection as much with Miguel Muñoz as with Luis Suárez. This is just the sports record of a great player. But Michel is not only the best in the field. It is also outside. Smiling and accompanied by Ricardo Gallego appeared through the offices of DINAMIC oozing kindness and good humor. The first point of the itinerary was to see the game that, as he told me later, he thought it was fantastic because of his performance and because he managed to get close to the sport of football, which in his opinion is really difficult. Here we show the skill tests or SUPERSKILLS, which impressed him and Gallego, who did not stop joking at any time. In short, an experience that MICHEL himself has found very pleasant and we are sure that all of you will like it.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Dinamic Software", "publishers": "Dinamic Software", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/52414-michel-futbol-master\n"}