{"altername_name": [], "name": "Mickey Mouse: The Computer Game", "overview": "The wicked witches of the North, South, East and West have stolen Merlin's magic wand and given it to the awfully 'orrible Ogre King. Using its power they will, between them, rule Disneyland! The Ogre King has used the wand to cast a sleeping spell over the land. He then broke the wand into four parts and gave each witch a piece to guard. The wizened witches have moved into the four tallest towers of Disney castle and banished all of the drowsy Disney characters. They are each using the pices of wand they guard, along with some enchanted water they also stole from Merlin, to fill the castle with hideous monsters. This water is the key to Disneyland's salvation. Merlin had one bottle of water hidden and this he gave to Mickey Mouse to use to defend himself as he rescues the wand. The water must be used sparingly or it will run out. Mickey starts his search for the wand at the bottom of each of the four towers. The only way to go is up! On his way to the top Mickey will encounter the witche's gruesome guardians. Squirting some monsters with the enchanted water pistol will turn them into potion bottles or special magical bonuses. Some monsters, however, only respond to a sharp tap on the head with Mickey's rubber mallet, although this often causes them to split into two smaller monsters! If Mickey collides with a meany he loses more of his precious water, but it can be replenished by collecting the potion bottles. When Mickey reaches the top of the tower he will find fireballs being hurled at him by the witch.* If he can reduce the witch to a pile of bones by throwing mallets at her, he can collect the piece of wand she was guarding. Once all four pieces are retrieved Mickey has to face the fiendish, flying 'orrible Ogre King! Squirting him 15 times with the pistol defeats him, but that's not easy. If Mickey doesn't succeed at first, he can try, try again. If he fails a third time the game is over and Mickey will have to return to the bottom of tower one!", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Ben Daglish", "publishers": "Gremlin Graphics Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.14", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/55135-mickey-mouse-the-computer-game\n"}