{"altername_name": ["Campo Minado"], "name": "Mined-Out", "overview": "That star of stage and silver screen Bill the Worm is trapped. Who can forget his outstanding performances in \"Worm without a cause\", \"Worm Kong\", \"The Worm of Dracula\", \"The Worm with the Golden Gun\", \"Gardeners World\". The very famous Bill the Worm is trapped in the Mine Fields and harvest time is still three months away. The very famous Bill the Worm is dormant, sleeping away the hours, waiting to be rescued; surrounded by death dealing mines which are poised ready to explode. \"Oh no, poor Bill, oh Bill we're coming.\" cry the Damsels. The Damsels, a host of starlets all cloned from Bill's favourite leading lady; the glorious Nora Mudroe; have lept forward into the hearts of a million cinema goers and also unfortunately into the heart of the Mine Fields and now are as trapped as Bill the Worm. The Minefields lay before you, ominous, quiet, expectant. A cloud passes in front of the sun and a shadow races across the fields like a shroud. The mines wait for your final fatal footstep to fall, chuckling to themselves. The tension mounts indeed it is this very suspense which drives the mines insane, poor creatures. Your mission lies before you: A worm to rescue and maybe a handfull of damsels along the way. You edge nervously forward with sweat pricking your forehead... Bill snores on regardless dreaming of the famous cabbage scene from \"Snow White and the Seven Worms\" where Snow White (played by Nora) and he fall into the heart of a cabbage and the image fades to soft focus which is replaced by waves falling on a rocky shore, except in Bills dream there are no waves or soft focus...", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Ian Andrew", "publishers": "Quicksilva", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "2.83", "wikipedia": "https://en.wikipedia.org/wiki/Mined-Out", "video_link": "https://www.youtube.com/watch?v=VqFWdqaoQPw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53557-mined-out\n"}