{"altername_name": [], "name": "Moggy", "overview": "In the forest of the canutos, beyond the snow-covered peak of Jhijhamabad, in the North of the Country of Noronstronski, the balls of the village of Mu, near Kónrad, celebrated a great party. The music played merrily among the trees, the scents of the punches and the great banquet permeated the atmosphere, deeper and tastier as the night progressed. Among the merrymaking, the evil sorcerer Hibön, greedy Tetrarch of Boro, Goro, Sé and Pa, was about to carry out his evil plan: In order to achieve more magical power, he intended to use the vital energy of the bowls, rich in rays, sparks and ectoplasms. He had chosen the best occasion: the bolotes, drunk and submissive, wanting to party, would offer no resistance. Like Pied Piper, he would coax them to \"follow the party elsewhere\", and that was precisely what he did. Forming a huge caravan, the bolotes submissively left the Canutos forest in the direction of the dominions of Hibön. Moggy, the soul of the parties, had not had them all with him that night. Something apart from the merrymaking, slept a monkey that had taken too early. The elixirs of Fairies and Spirits danced in his gut, and he still burned on his lips the smoke of all the herbs of the ravine he had smoked when he awoke disoriented, perhaps unveiled by the thunderous silence that had taken over the valley. Staggering, and without much control over his movements, he was horrified to find that in the distance, too far away, a hunched figure was guiding the entire population of Mu towards a dark horizon. Trying to focus with his reddened eyes, he soon recognized Hibön. It could not mean anything good, so, as he could, he set off to rescue his companions.", "platform": "Sinclair ZX Spectrum", "release_date": "2005", "game_type": "Released", "esrb": "", "developers": "Anjuel", "publishers": "Computer Emuzone", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72155-moggy\n"}