{"altername_name": [], "name": "Monsters in Hell", "overview": "Monsters in Hell is a clone of the classic arcade game Space Panic. The actual gameplay is restricted to a single scenario consisting of several floors connected by many ladders. There are many different creatures walking around, and more of them are constantly being spawned by a warlock situated in the upper-left corner of the screen. The story of the game puts the player directly in the pits of Hell heated by its consuming flames down below, with the mission to cleanse the place of its unholiness. His holy powers are constantly being drained by the forces of evil that reside here, even more so when successfully hit by the warlock's minions. The player has to make use of his magic hammer to create holes in the ground, so that the minions can be trapped there. Depending on their strength, they may die as a result of the fall. Although the player's vitality is being constantly drained even if he is located in a safe spot, the Holy forces are constantly providing new crucifixes located at random places, which allow the player to restore his vitality completely. While the player is destroying the Warlock's minions, new and stronger ones are being spawned. The stronger the creature, the farther it must fall in order to be destroyed. The strongest ones will only die when falling directly into the unholy flames below. One of the differences between this game and Space Panic is that the player does not need to hit the head of monsters with his magic hammer to make them fall through the trap; he just has to dig a strategically placed hole and wait for the creatures to be trapped in.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Martin Lewis", "publishers": "Softek", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Monsters_in_Hell", "video_link": "https://www.youtube.com/watch?v=j6CWpoUicv0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144487-monsters-in-hell\n"}