{"altername_name": [], "name": "Monty on the Run", "overview": "Monty on the Run is a computer game created by the software house Gremlin Graphics and released in 1985 for the Commodore 64, ZX Spectrum, Amstrad CPC and Commodore 16, written by Peter Harrap for the ZX Spectrum with music by Rob Hubbard. On the run from the authorities after his intervention in the Miners' strike, Monty the mole must escape from his house and head for the English Channel and freedom in Europe. In traditional platform game fashion, along the way he needs to collect various objects and solve puzzles to complete his escape. Before the game, five objects must be chosen to form Monty's Freedom Kit. Choosing the wrong items will leave the player unable to pass certain screens. This also acted as an anti-piracy measure, since the objects were only given numbers onscreen meaning the player had to refer to the accompanying manual. The final screen sees Monty boarding a ferry to France. This was then the starting point for the follow-up Auf Wiedersehen Monty. The game has a sense of British surrealness similar to Manic Miner and Jet Set Willy - in gameplay it is more similar to the latter. Enemies patrol every screen, water is deadly to the touch and Monty runs the risk of being squashed by the many pistons. A remake, titled Monty's Great Heart-pounding Escape (モンティのドキドキ大脱走? Monti no Doki Doki Dai Dassō) was created for the Family Computer Disk System in 1987 by Jaleco.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Peter M. Harrap", "publishers": "Gremlin Graphics Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.36", "wikipedia": "https://en.wikipedia.org/wiki/Monty_on_the_Run", "video_link": "https://www.youtube.com/watch?v=4Nm1CTH4dgQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78512-monty-on-the-run\n"}