{"altername_name": [], "name": "More Tea, Vicar?", "overview": "Cast your mind forward, if you will, to the year 16384 AD. Decades of drought on Earth have turned farmland and plantations alike into parched wilderness and arid desert. With hundreds of billions of mouths to feed across the solar system, the floors of planet Earth's oceans have been given over almost entirely to the production of food. Space is at a premium, and there is little room for anything seen as a luxury item. Rationing has been introduced for many items, while others, such as tea and coffee, are almost impossible to source. Divided by bickering governments, the United Planets, the successor to the UN, has been noticeably inept as the situation spirals out of control. Bureaucrats accept bribes, governments prevaricate, oppositions posture and arguments and accusations are batted to and fro across the debating chambers of the world. Fortunately, the Reverend Wayne Fleet of St Leonard's Chapel near the Sea of Tranquility, part-time farmer, gun runner and smuggler, has a substantial plantation on the red planet, on which he grows his illegal genetically-modified tea plants. Each year he is able to produce hundreds of tons of low grade yet highly sought-after Earl Grey tea which he is able to sell on the black market to the highest bidder. All this while preaching the gospel to audiences across the solar system, and beyond. The Reverend Fleet's activities make the authorities deeply uneasy. This illicit tea cannot be easily taxed, it is not rationed, and is beyond the control of authorities around the galaxy. In a fit of pique, the powers-that-be finally pass their first successful resolution in many years. Tea smugglers are declared outlaws and a bounty is placed upon the head of known traffickers. Your task is to deliver your \"message\", and no small quantity of tea, to the heavily defended colonies of the solar system. Run the gauntlet of the authorities' defence systems, and destroy the master ship guarding each one. Destroying a complete wave of hostile ships will reveal a bonus icon. Collect this item for a power-up. Power-ups include extra firepower, a rear-mounted laser cannon, a missile, an outrider and temporary invulnerability.", "platform": "Sinclair ZX Spectrum", "release_date": "2012", "game_type": "Released", "esrb": "Not Rated", "developers": "Jonathan Cauldwell", "publishers": "Cronosoft", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165003-more-tea-vicar\n"}