{"altername_name": [], "name": "Olympimania", "overview": "Automata, never laggards for a bit of topicality, have taken the noble sporting event known to the sane world as the Olympics, and turned it into a travesty of running, jumping and swimming. The Piman, having recovered from his drunken binge in Pi-Eyed and the bouncing balls of Pi-Balled, has taken himself in hand and is going for gold. Olympimania offers the average armchair pimaniac not three, not four, but an astonishing FIVE events in which to compete. The Pijump, Alpiskiing, Steepichase, the Pitathalon and, for a soggy finish in the Olympi pool, the Butterpi. The game takes the form of a platform game (of sorts). In all but the last event, each screen contains four layers. Along each the Piman, suitably attired for the particular event, must travel, jumping over obstacles, avoiding the faster competitiors by jumping and letting them pass underneath, and thus finish the screen. A following screen offers more hazards. Should the Piman achieve a high score (per frame) and get a bronze, silver or gold medal, he may mount the winners' rostrum. Between each event, there is a screen set in a crowded auditorium with the rostrums in the centre. Medal winners get to take their places, failed Pimen dash over the rostrum to collapse in a fit of tears and ground thumping on the other side, while the crowd behind applaud. The game is compatible with the Currah Microspeech unit which offers amplified sound and an intoning voice saying, 'On your marks, get set, GO!' It also announces the name of each event in which the Piman is about to take part. The Pijump involves jumping over hurdles while avoiding another jumper and an overflying bird. In ski-ing there are fir trees and the same other mad competitor. Steepichasing sees him mounted on a prancing horse with fences to jump and another rider. In Pitathlon he has to leap weight lifters and then compete against other swimmers in the Butterpi. Unfortunately the Piman's swimming lane is monster infested, but he may dive under them once per length. It's all quite silly and charming.", "platform": "Sinclair ZX Spectrum", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78011-olympimania\n"}