{"altername_name": [], "name": "Omega Dimension", "overview": "Si alguna vez viajas a la extensa cordillera del Himalaya no te extrañas si entre los escarpados picos encuentras un bonito valle repleto de... ¡¡¡¡INGENIOS MECANICOS!!!! Es el laboratorio del Profesor Locaten, nuestro genial y sabio viajero espacial, que ha encontrado en las alturas el lugar idónea para desarrollar sus peculiares inventos y comunicarse con los amigos del planeta Freak mediante el poder de transtelepatía que poseen las enigmáticas Hermanas Cósmicas. Pero, he aquí que el destino ha querido poner a prueba, una vez más, la fuerza de los deseos humanos, permitiendo que el Profesor Locaten y la bien dotada Hermana Cósmica Omega se enamoren locatamente. Desventurada suerte han corrido puesto que cada una de las Hermanas Cósmicas vive en su propia dimensión y, ya lo reza el poema: «Mira que es estar de pega que el terrícola Profesor haya encontrado su amor en la Dimensión Omega» Existe un solo lugar en el Universo donde es posible comunicar la Dimensión Omega con la Terrenal y nuestros amigos han decidido encontrar esa puerta, ya que nada debe impedirles materializar su amor transtelepático. Pero, otra vez, el destino cruel va en su contra, porque ha dispuesto que la puerta que une las dos dimensiones se encuentre en el lugar más indómito y peligroso de la Tierra: LA ZONA TENEBROSA. Una región dominada enteramente por las perversas huestes del intemporal y malvado Tenebrosus. En villano que, hace milenios, arrasó la fructifera raza cavernícola de los Balunga, cuando habían alcanzado un elevado grado de civilización. Y, más tarde, asoló la ciudad de Immaculate Garden, que había sido creada para el recreo de la alta sociedad de la época, convirtiéndola en un lugar ruinoso por donde pasean los asquerosos monstruos fétidos de Tenebrosus.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Positive", "publishers": "Positive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/145590-omega-dimension\n"}