{"altername_name": ["Pedro 2 - Pedro v strašidelnom zámku"], "name": "Pedro v strašidelnom zámku", "overview": "Pedro in the haunted castle is the name of the second part of the arrival of the intrepid adventurer Mexicana Pedro. The game loosely follows on from the previous part. One day, Pedro, bored by the long idleness, learned about an interesting ancient legend. It talked about a spooky castle in the Carpathians and its terrible owner, the knight Krapo. The knight, who was a follower of black magic, decided to help the evil spells gradually control the entire surrounding landscape. In the end, he succeeded, but he had to pay dearly for it. From that day on, every night he turns into a vampire who needs to drink human blood. That's why small children started to get lost around the castle as often as possible. Many daredevils tried to break into the castle and end this monster's bloody rampage. Knight Krap, however, with the help of his powerful spells, turned them all into various poseable princes, who became the eternal guardians of his castle. The legend ends with the words that the castle can be freed from the curse only by a brave person who frees all these miscreants and finally defeats Krapo himself, who is hiding in the highest tower of the castle. Pedro didn't need to joke. In a few days, I will be walking through the main castle gate full of expectations. However, as soon as he crossed the threshold, the gate slammed shut and Pedro became a prisoner of the haunted castle.", "platform": "Sinclair ZX Spectrum", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Gold Storm", "publishers": "Ultrasoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://cs.wikipedia.org/wiki/Pedro_v_stra%C5%A1idelnom_z%C3%A1mku", "video_link": "https://www.youtube.com/watch?v=0zXlnUwznt8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165819-pedro-v-strasidelnom-zamku\n"}