{"altername_name": [], "name": "Pentacorn Quest", "overview": "All the worlds were created for certain things to be desired by everybody and yet only a few graced can make it. For example, soda chickpea in dehydrated and dusty world of Sek-Anoh, or in the Earth itself, Johansson's breasts. Here, everything revolves around some Acorns. I know, in your world you feed them to the pigs, but in mine, they are the source of great power, made of pure gold and awfully special. Moreover, they were the reason why, a long time and a half ago, a war was declared between two opposing forces: Light and Darkness. At the end the thing was not very clear. But, while they attacked each other, the amusing Golden Acorns disappeared. In the mess, all they blamed each other; some of them were accused of making a broth with them, others suggested sending them to hell, and the mayority, decided to enroll in a course Paint and Sheet Iron. But with the passage of time, an ominous rumor, originated in the whispers of the most sordid piers, began to gain strength: Some ventured to say the Acorns had been deposited on The Crack. A winding wound that fractured the great gulf fixed in the world, full of nasty critters. One crappy and perfect place to keep a treasure. No mother would have hiden it better! Why were there the Golden Acorns, not matter much. People would shrug: \"Why not?\". Get them would provide incredible riches, power, and who know what else. However, the greatest adventurers who have tried to achieve them, have failed: All returned with a terrible smell of feet. Now it's your turn. Are you going to end up like everyone else? Or will you might reach the glory.", "platform": "Sinclair ZX Spectrum", "release_date": "2015", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "NightWolf", "publishers": "NightWolf", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150436-pentacorn-quest\n"}