{"altername_name": [], "name": "Phaeton", "overview": "Scientific discoveries and technological progress never made people more moral. In the 24th century humanity faced the same threats of crime and war as ever. They were just more serious as new technologies enabled more efficient mass destruction. A powerful terrorist organisation managed to create highly radioactive isotopes of heavy elements, never synthetized before. Turning them into weapons could mean only one thing: total annihilation. A nuclear blackmail became real. The isotopes were placed in abandoned spacebases, caves and old ruins, guarded by unmanned drone ships. All the radio contact to the area had been cut off, so any remotely controlled aircraft couln't intrude the terrorist hideout. On the other hand, any human that would enter the area, would almost instantly die due to high radioactivity levels. When all seemed lost, a secret counterplot was revealed. It involed a human pilot entering the death zone in an experimental aircraft and stealing the isotopes from terrorists. The aircraft name is PHAETON. The mythical Phaeton was son of Helios, god of Sun, who rode a fiery chariot in the skies. Just like Phaeton was born of Helios, your ship was born of studies of helium, the most stable element in the universe. Just like the atom of helium has two electrons, spinning aroung the nucleus, your ship has two satellites spinning around central unit. They create a protective field to separate the human pilot from deadly radioactivity. You have been selected for the mission of retrieving the isotopes. Good luck, you will need it.", "platform": "Sinclair ZX Spectrum", "release_date": "2010", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Rafał Miazga", "publishers": "Rafał Miazga", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150889-phaeton\n"}