{"altername_name": [], "name": "Pirate Captain Creed: Adventure on Halloween Island!", "overview": "In the distant corners of the ocean, where legends meld with the dancing waves, emerges Halloween Island, a realm shrouded in mist and secrets. In this magical place, the brave young Captain Creed confronts the ancient curse of Captain Miller, a daring pirate whose soul was imprisoned in pumpkins by Halloween's spell. The story begins when Creed, determined and fearless, lands on the haunted island, guided by the wisdom of Lolo, Miller's loyal old companion. Together, Captain Creed and Lolo embark on an epic quest: to find the 18 pumpkins housing Captain Miller's soul fragments and uncover the 18 treasures that this legendary corsair hid on the island. However, their journey is fraught with perils. Pirate crabs, crazy snakes, and the terrifying winged creatures called cocopiñas lurk in the shadows, while ancient temples filled with deadly traps challenge their wit and courage. To break free from the island's curse, Creed must vanquish the 97 little monsters infesting every corner. Each victory brings him closer to his goal: finding the lost treasures and the enchanted pumpkins. Every defeated foe is a step toward freedom, and every trap avoided is a triumph over the dark fate lurking on the haunted island. With the roaring sea as their soundtrack and determination shining in their eyes, Creed and Lolo venture into this realm of darkness and wonder. Once their mission is complete, Creed and Lolo must seek the pirate flag marking the spot from where they can escape the island. On Halloween Island, where magic intertwines with reality, the fate of the young captain and the ancient pirate spirit hangs in the balance of time, ready to write a new chapter in the tale of haunted seas. Will Creed and Lolo unravel the mystery, find the lost treasures, the enchanted pumpkins, and free the island from the dark spell? The answer lies in the brave hands of Captain Creed, who will confront the darkness with courage and determination.", "platform": "Sinclair ZX Spectrum", "release_date": "2023", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Furillo Productions", "publishers": "Furillo Productions", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373899-pirate-captain-creed-adventure-on-halloween-island\n"}