{"altername_name": [], "name": "Pssst", "overview": "Pssst is a single screen game. The plant grows from a plant pot at the bottom centre of the screen, and the spray cans containing three different pesticides are located on ledges on each side of the screen. Bonus items such as fertilizer and spades appear on unoccupied ledges which will increase both the players score and the plants growth rate, however as the alien insects also appear from the ledges, and bonus items can only be collected if Robbie is not holding a can of pesticide, it is a risk to collect them. There are three types of alien insect, and three types of pesticide which will either kill, stun, or have no effect on the insects. Robbie can only carry one type of pesticide at a time, and in the early stages of the game the kill pesticide can be carried at all times, however later stages have more than one type of insect on screen at once, making the choice of pesticide more tactical. As the plant grows it will sprout leaves which increase the growth rate, yet also make it more vulnerable to the insects. Once the plant reaches a predetermined height, it flowers and the player moves to the next level. When the insects make contact with the plant they will stick to it, making it shrink until it dies. If the plant shrinks beyond the section where the insect is attached, the insect is released, but it may immediately reattach lower down, depending on its movement path. A life is lost if the plant dies or if Robbie makes contact with an insect. The death graphic for both Robbie and the insects is the same as the enemy explosion used in Jetpac.", "platform": "Sinclair ZX Spectrum", "release_date": "June 1, 1983", "game_type": "Released", "esrb": "", "developers": "Ultimate Play The Game", "publishers": "Sinclair Research Ltd.", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "4.32", "wikipedia": "https://en.wikipedia.org/wiki/Pssst", "video_link": "http://www.youtube.com/watch?v=d7EOsYpHfw4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/17386-pssst\n"}