{"altername_name": [], "name": "Quazatron", "overview": "In Quazatron, the player-controlled droid (KLP-2 \"Klepto\", from the Classical Greek κλεπτω, steal) attempts to destroy all the other robots in the underground citadel of Quazatron and subsequent locations. Klepto is maneuvered across individual levels of Quazatron, which can be navigated between via a system of lifts. Levels may include floors at different heights, ramps, information points, recharge points and patrolling robots. It is Klepto's aim to destroy all the other robots, whereupon the lighting on that level is deactivated. This can be done by damaging them with a ranged weapon, by ramming into them and/or causing them to fall from a height, or by a successful grapple attempt. Each robot has a two-character identifier which provides information about its parts and role. 'X' denotes a menial robot, 'U' for utility, 'R' for repair, 'B' for battle, 'L' for logic, 'S' for security and 'C' for command. The number is a ranking system, with lower numbers denoting better parts. '9' is a 'device', '8' or '7' for a drone, '6' or '5' for a robot, '4' or '3' for a droid, '2' or '1' for a cyborg. This ranking also determines the robot's security rating from Epsilon to Alpha. Security rating determines the level of access from information points. In addition are several special identifiers; 'OO Medic Droid', 'A1 Automaton', 'ST Programmer' and 'AB Andrewoid'. (The last two being plays on Steve Turner & Andrew Braybrook's names.) The grapple system in Quazatron: To grapple another robot, Klepto must make contact with it with the grapple activated. This initiates a sub-game in which both parties must light sections at the centre of a circuit board using a limit number of power supplies. Should Klepto win, the player may attempt to salvage parts from the destroyed enemy, with a more dominating victory providing less damaged equipment.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Graftgold", "publishers": "Hewson Consultants", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.86", "wikipedia": "https://en.wikipedia.org/wiki/Quazatron", "video_link": "https://www.youtube.com/watch?v=LeIbvankrPI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30171-quazatron\n"}