{"altername_name": ["Rainbow Islands: The Story of Bubble Bobble 2"], "name": "Rainbow Islands", "overview": "Following the events of Bubble Bobble, Bubby and Bobby set out to defeat the \"Dark Shadow\" and rescuing the Rainbow Islands. The Dark Shadow is the entity responsible for the events in Bubble Bobble. The game is set on a chain of ten islands, each one with a different theme. Each island provides four rounds of game-play, and once these are complete the player moves to the next island in the chain. In each round the player must get to the top before the sea level rises and kills them. The islands get progressively more difficult, with enemies moving much faster on the later ones. These are depicted on a map screen before the start of each island. Players can release rainbows that act as both weapons against the enemies and as a makeshift platform. By jumping on them, they fall down beating any enemies below it. Collecting power-ups increases the player's speed, the speed of the rainbows and how many are spawned. If players take too long in a level, water will start to rise up from the bottom of the stage. Like Bubble Bobble before it, the game has multiple endings. To get the \"True and Happy\" ending you must find and complete the three secret islands (although most consumer versions of the game completely lack the secret islands). These islands are not visible until all 7 big diamonds are collected. To get a big diamond, the player must collect seven different-colored small diamonds on the island and finish the round. The small diamonds are found by destroying enemies by dropping a rainbow on them from above or destroying them with various special items. After collecting the small diamonds, a word \"NICE\" will appear. If the small diamonds are collected in the correct order, you will get to a secret room at the end of each island, which in turn gives you a permanent power up. One of the features which sets this game apart from many others (and has no doubt been responsible for the game's popularity) is its 'hidden depths'. While initially appearing to be quite a simple game, Rainbow Islands in fact has a vast number of secrets for the player to discover, including secret levels, secret power-ups and riddles. Because of these elements, completing the game properly requires a large amount of dedication from the player. The scoring system also has secrets, which allow vastly higher scores to be achieved than normal.", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Graftgold", "publishers": "Ocean Software", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.46", "wikipedia": "https://en.wikipedia.org/wiki/Rainbow_Islands:_The_Story_of_Bubble_Bobble_2", "video_link": "https://www.youtube.com/watch?v=W3fYDU07jdk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/29736-rainbow-islands\n"}