{"altername_name": ["Ramire the Vampire", "Ramire the Vampire"], "name": "Ramiro el Vampiro", "overview": "Ramire, the Vampire is a game starring Ramire, a 500 year-old vampire. He lives in the wastelands of Transilvania and has a daughter Minna the Slaughter. The game consists of two chapters that can be selected right away from the main menu: «Ramire the vampire ain’t got a break!« and «Ramire gets back the Zaphire«. They have similar gameplay, but a different environment. It is a 2D platform game with single-screen rooms connected both vertically and horizontally offering room for exploration. In the first chapter where red is a dominant colour Ramire needs to steal the Rapture Treasure for his daughter because he forgot her deathday. It is locked up in a treasure chamber that can only be opened with magic. Ramire's friend Twitch the Witch will perform the spell to open it, but she wants the legendary German Talisman, an old jewel that has been split up in four parts. Ramire needs to collect the four parts and each one is hidden in a crypt filled with enemies and traps. Each crypt is owned by a different character: Hwang the Fang (a fellow vampire), Elegant Giant, Barf the Dwarf and Grant, the Servant. In addition Ramire cannot be exposed to the sun. Twitch gives him a Rearm Charm that protects Ramire for 32 seconds before it needs to be recharged in the shade. Ramire can freely explore and jump. As soon as he enters the sun a timer starts ticking down. He starts with 50 lives and additional ones are provided by collecting crosses as treasure. Ramire has no means to attack, he can only avoid enemies. In the second chapter where yellow is a dominant colour Weevil the Evil is introduced. It is a devil who used to own the German Talisman until Ramire stole it. In retaliation he kidnaps his daughter. He only wants to let her go if Ramire splits up the talisman again and puts each section in a shrine in one of his chambers. Similar to the four characters of the first game there are now four additional characters that are unhappy and guard the chambers. They are Weevil's minions who did not got paid and rise up. They are Jim Taylor, the Sailor (Weevil's driver), Fritz Barker the Banker (the account), Raiden the Dead Maiden (the housekeeper) and Dappen the Misshapen. To defeat them Ramire needs to activate a security device installed by Weevil near the entrance of each of their chambers.", "platform": "Sinclair ZX Spectrum", "release_date": "2013", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "1985 Alternativo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151056-ramiro-el-vampiro\n"}