{"altername_name": [], "name": "Ramon Rodriguez", "overview": "Ramon closed his eyes, rubbed them with his fists and opened them again without being able to believe what he saw. It was in a dark cavern full of ramifications and poorly lit by crackling torches. Suddenly, she noticed that she felt some coldness and a scream escaped her realization of the clothes she wore. Not that he was too punctilious with those details. He used to wear slim-fitting trousers, a \"Mad Max\" jacket, tons of leather, veneer, and chains everywhere. But now he was just like the guy who had plucked playing poker with the help of his \"colleagues.\" The only detail he still had of his normal appearance was the imposing punk crest, which was almost a half-meter long, which stiffened and crowned his head. He began to shiver with cold and fear, He did not like being in his underwear in that desolate place. How the hell would he have gotten there? Suddenly, out of the tunnel before him came the oddest bug he'd ever seen; It looked like a huge python snake, but instead of jaws it had a lovely organ keyboard that began to chatter, releasing a music of the most flippant. The animal was approaching with, apparently, bad intentions. Ramon ran in the opposite direction, but the monster was eating ground. Then the ground sank under his feet and fell through a deep gulf. As he fell, he caught sight of an immense subterranean lake of strange color and at some point of it a small raft. Desperate (he could not swim) he began to wave his arms like a bird. \"Raise your arms, Ramon,\" he heard himself shout. You can fly, Is the most natural in the world. The bump was on purpose, but nothing broke. The raft was carried by the current at great speed. From somewhere on the roof began to rain spears that Ramon dodged moving as he did when he wiggled the skeleton at Cuco's Pub, but luckily he managed to grab hold of a huge building that was coming from nowhere. But how on earth would he have gotten there? Ramon began to climb rather parsimoniously, but increased his speed when a gigantic horn began to chase him with huge jaws. Suddenly he found himself in front of a metal door. He opened it and closed it hurriedly behind him, and as the creature knocked on the door, he heard a countdown. \"Two, one, zero ...\" She suddenly felt the room, Which by the way was plagued with computers and strange control gossip, was climbing at breakneck speed. He looked through a panel and realized where he had fallen: he was on a space shuttle! Ramon exclaimed, desperate again, what was happening to him? How the hell would he have gotten there?", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Jose Carlos Arboiro Pinel", "publishers": "Erbe Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53938-ramon-rodriguez\n"}