{"altername_name": [], "name": "Rampage", "overview": "It seemed like any other day at the Greaseburger Fast Food Emporium — but three unlucky customers were to get something even nastier than usual in their Big Mucks. If only the company's Research Division hadn't accidentally shipped some of the experimental food additives... A wave of nausea, a foul aftertaste, chronic indigestion: everything was normal until George, Lizzie and Ralph ripped out of their clothing and into designer fur and scales. Life isn't fun as a fifty-foot gorilla, Lizard or Wolfman — and soon everyone's going to find out how angry they are! Up to three people can play, each controlling a different monster. In a desperate battle for survival, you climb the skyscrapers and smash the walls with your fists, searching for edibles — anything from goldfish bowls to the occasional tasty human — that appear behind the shattered windows. Grabbing inedibles such as toasters, TV's and potted cacti will inflict some damage on you, though. Each player's stamina is indicated by the energy bars at the top of the screen. Damaged buildings will eventually collapse into rubble, but leap off when the foundations start to give way — getting trapped in the falling masonry will weaken you. The nation's military might is also bent on your destruction, so try to avoid (or punch) the troops who fire from the windows, and the gunship helicopters that are constantly circling overhead. You can also punch — and be punched by ­ your fellow monsters. If you lose all your energy, you revert back to human form and, hiding your nakedness as best you can, shuffle off-screen in embarrassment.", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Catalyst Coders", "publishers": "Activision", "genres": "Action", "max_players": "3", "cooperative": "Yes", "rating": "4.2", "wikipedia": "https://en.wikipedia.org/wiki/Rampage_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53937-rampage\n"}