{"altername_name": [], "name": "Rasputin", "overview": "You must destroy the Jewel of the Seven Planets which is the power source of the Spirit of Rasputin. To reach the Jewel you must neutralise the eight spells that have been cast in Rasputin's name. To neutralise the spells, traverse the courtyard of your dark side and enter the nether world of the Seven Planets, crossing from dimension to dimension by means of the spells cast by the Lord of Chaos to prevent the escape of Rasputin's spirit, which is threatening to cross the barriers of time. You have the magic power of your sword and shield, but their power wanes like a candle every time you use their might. Find the stones with the mark of Rasputin and by stepping on them you will absorb their power into your sword and shield. Absorb the power of all the stones in a dimension and the wrath of Rasputin's mind is revealed in the form of a creature from the dark side. Destroy this creature and it will be transformed into a spell-stone inscribed with a rune of power. These runes were cast by the Lords of Light to aid you in your quest and may be absorbed into your soul upon contact. The most important spell is that of \"the Eyes of Heaven\". This spell will protect you from the spirit of Rasputin's Evil Eyes and allow you access to the boxes that neutralise the eight spells cast in Rasputin's name. But the power of the Lords of Light will only protect you if the colours of the dimension are in harmony with the spell. Step on these boxes to reverse the spells cast in Rasputin's name from the Dark Side to that of the Light. Until you achieve the Quest, you are lost in the eternity of time, your life force being drained by the creatures of the nether world.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Firebird Software", "publishers": "Firebird Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82779-rasputin\n"}