{"altername_name": [], "name": "Rescue Lander", "overview": "The city is been bombarded by meteors. It could be the prelude to an alien invasion so do your best to save as many souls as possible. Fly your rescue lander through the city and beyond collecting as many men, women and children as you possibly can. Collect 3 pockets of people per screen to advance to the next level, but be careful, don’t land anywhere other than on the landing platforms, everything else will damage your ship. Don’t run out of fuel either as that will cost you a life. The idea is simple, but the levels get progressively more difficult. Your lander will fall towards the ground if you do not apply thrust, gravity is your enemy. Keys are 'Q' to thrust and 'O' to move left and 'P' to move right. (Also Kempson and Sinclair joystick compatible) You get about one minute before running out of fuel, if the fuel gauge registers empty your ship will be destroyed. While this might not be an issue in the early levels it can become more of a problem later on. Any remaining fuel will count towards a bonus upon completing each level. Once you have saved three pockets of people from the level the landing platform on the right side of the screen will change colour indicating you can advance to the next level. Simply land on it to advance and receive a bonus for any remaining fuel you have left. Please don't expect cutting edge graphics, or speaker pumping background music. The plan was to produce a game that looks like it might have hit the shelves in 1983. Special thanks to Jonathan Cauldwell who created and continues to update AGD.", "platform": "Sinclair ZX Spectrum", "release_date": "February 22, 2015", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "T.D.F micro-visions", "publishers": "T.D.F micro-visions", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=tFjXAnYTuBo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84843-rescue-lander\n"}