{"altername_name": [], "name": "Retroinvaders", "overview": "They said it would bring about a new era of peace and prosperity... The wormhole took just 34 years to create, with technology from 7 advanced alien civilizations. Long trip F.T.L. (Faster Than Light) trading missions were no longer necessary. Their worlds were our worlds; ours were theirs... They called it \"The Unity\", they called it \"The Peace\"... ...then they attacked... That same network of wormholes, set up for trade and peaceful exchange, was turned into a weapon. Nobody saw the warheads sent through until it was too late. Retaliation was impossible - the wormhole had been hijacked to allow only one way traffic. Swarms of enemy craft soon followed, on a one way mission, to decimate all that was left of us. That was then, 48 years ago... Life on this cindered rock has been brutal and hard for the handful of us still here. We have lived here in secrecy and fear, building... We have worked hard to put together your craft, to reconstruct the planet defense system and hard to crack the ID codes needed to allow you to travel back up through the wormhole complex. Our plan will be sudden and swift. We will take them by surprise. Expecting no resistance, they left minimal forces throughout the wormhole complex, with mother-ships stationed between each major galaxy. You will have to be fast to destroy them though. If too many enemies escape, they will overwhelm our planetary defenses, long before you ever see their mother-ships. We only have the ID codes to send one craft through at a time, so the odds are against you. Since they can not travel backwards through the wormholes themselves, you will take each mother-ship by surprise. This should allow you to at least fire a few shots before they activate their surrounding defense drones. But don't get smug - each mother-ship is coated with energy absorbing armor. It will be up to you to find and target their weak spots... Your mission then is simple: Destroy the enemy, destroy their mother-ships, and take those warheads back to where they belong... ...then we can talk about \"Peace\"...", "platform": "Sinclair ZX Spectrum", "release_date": "2011", "game_type": "Homebrew", "esrb": "", "developers": "Climacus", "publishers": "Climacus", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151150-retroinvaders\n"}