{"altername_name": ["Reveal"], "name": "Reveal", "overview": "Your objective, as a member of the Planetary Liberation Force is to travel to a series of alien worlds, freeing them from the darkness that has beset them. At the outset of each level, the world you must free is shown briefly before it is blacked out. Take careful note of this, as you will not get another look at the entire level until it is completed. By travelling over the square sectors that make up each chequered world you can illuminate it. When all the squares have been illuminated, the exit square for that level flashes and must be reached before the time limit expires to teleport to the next world. Counters at the bottom of the screen display time remaining and how many squares still need to be revealed to complete the level. To make things more difficult, some squares are 'dead ends' and unlit squares beyond cannot be reached unless an alternative route is found. Another problem is represented by the marauding aliens that patrol each level intent on destroying your work. While patrolling each planet they black out the squares you have uncovered, making it necessary for you to return and uncover it again before the level can be completed. If you come into contact with an enemy a life is lost. Similarly, if you become trapped on a 'dead end' square, your only alternative is to commit suicide. As the game progresses, more alien enemies are introduced and the hidden paths for each level become more difficult to negotiate. Points are awarded for revealing squares, with a bonus given upon the completion of each level, and additional points awarded for time remaining.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Mastertronic Ltd.", "publishers": "Mastertronic", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "1.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113340-reveal\n"}