{"altername_name": [], "name": "Rex Hard", "overview": "Creator Javier Fafula intended to distribute his game in UK and contacted several local publishers. Finally Hewson bought the rights to distribute it through their budget label, but never published it. Al fin estaba allí. Había invertido todo su patrimonio, heredado de su tio Iquitos, en financiar el viaje, pero al fin estaba en la Amazonia Peruana. Aún cansado por el largo viaje, Rex revisaba su escaso equipo; no le habían dado mucho por la vieja hacienda. Las gotas de sudor recorrían su frente y un cigarrillo pendía de sus labios. El calor axfisiante y los mosquitos formaban una densa nube alrededor de la lancha, pero Rex parecía ajeno a todo ello, su mente sólo pensaba en aquel viejo texto recogido de un arcón de época colonial y en la fabulosa aventura que sin duda le esperaba. Con gesto mecánico sacó aquel texto que aunque deteriorado por el tiempo, era bastante elocuente... \"Llegué al Perú, mes de febrero de 1546, do serví en pos de la tarea que V.M. habíame encomendado. En llegando a la zona que los naturales conocían como Valle de Tzchatal, nos topamos con una corriente y osbedecien a la autoridad del capitán y piloto Lope Aguirre, montamos tiendas y descansamos. Aquella misma noche al cuarto de la prima, dieron con nosotros indios que gustaban comer carne humana, muertos dos tercios de cristianos y huídos los naturales, decidimos cruzar el rio y descubrimos un paso entre la maleza que nos llevó a más grandes males. Hallámosnos en un poblado indio, do descubrimos tres objetos que eran custodiados por estos indios de particular apetito. En cruzando un puente de palos y traviesas fue muerto el adelantado Diego de Luna, por lo que quedamos en número de cuatro. Sin duda se trataba del poblado que según los naturales, custodiaba la entrada del Templo de Tchtalt, do decian hallabase un Sol de metal dorado de alto una vara y tres arrobas de peso. Acabándose el puente nos topamos con una edificación por la que subimos perseguidos por los indios, en llegando arriba el piloto usó la pirámide y abrióse el suelo, cayendonos en un subterraneo a modo de catacumba do brillaba una gema con simpar brillo, corrimos por un secreto pasadizo, saliendo frente a una torre con dos entradas una Norte y otra Sur. En la Norte nos acontecimos de que había un mecanismo que abría una puerta en un monte cercano. Tras ver una construcción con agua que los nativos tomaban como como mágica, el capitán Lope Aguirre nos apremió coger un medallón que apenas veíase en un extenso edificio. Tres llegamos al monte en cerrándose la puerta, quedándose Fernando de Montoya preso de los salvajes. Tras saltar un rio de fuego, pasamos al llamado Templo Tzchtalt, allí otro mecanismo, pusimos el medallón y abrióse un camino que que nos permitió al piloto y al servidor de V.M. cesárea cruzar el fuego, puesto que el flamenco que nos servía de intérprete pereció en las llamas. Una vez llegados a una pequeña isla, vimos un edificio, que presumiase importante al ser ampliamente custodiado. La sapiciencia del piloto le hizo dejar el cristal tallado en un soporte. Tras dejar la gema que quemábale la mano en un agujero en la roca, salió de ella un rayo como de Sol que acabó con el valiente piloto y rebotó el cristal. El rayo de origen presumiblemente diabólico, hizo aparecer el Sol del que hablaban los naturales, pero mi mala suerte hizo que acabandose mi destreza y fuerzas hubiere de huir, tras desaparecer el maléfico rayo sin poder cargar tan preciado objeto...\".", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Javier Fafula", "publishers": "Mister Chip", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151176-rex-hard\n"}