{"altername_name": [], "name": "Rock Star Ate My Hamster", "overview": "Rockstar Ate My Hamster is a management strategy computer game developed by Codemasters in 1988 and originally released on their full-price Gold label for the Amstrad CPC, ZX Spectrum, Commodore 64, Amiga and Atari ST. The game was written by Colin Jones, later to become known as author/publisher Colin Bradshaw-Jones. The name of the game was inspired by a 1986 Sun headline - 'Freddie Starr ate my hamster', which served as a focal point for mid-1980s tabloid culture and helped further the career of the comic in question. The game is almost entirely menu driven with options that allow the player to decide what the band does next. The player's first task as manager is to pick musicians for the band (see below), and then whether they should buy them brand new equipment, second hand equipment or get some dodgy gear off the back of a lorry. ZX Spectrum screenshot Once in the main game, the options presented are as follows: Practice - Lock the band away for up to 5 days so they can practice. The music of the band is also presented, gradually increasing from atonal noise to actual music. (Songs are generated on the fly by the software.) Gig - Go on tour. This is the primary source of moneymaking in the game. Publicity - Organise a publicity stunt that can make the band more famous, but can also trigger events that kill a band member. Gifts - Buy the band some gifts to keep them sweet, otherwise they may make some rather costly ultimatums. Record - Once the band gets a recording contract, this option appears and allows them to record an album. Release - Once the album's recorded, this option releases it along with any singles. Along the way, the player also has to decide: Whether or not to play a charity gig. Some of the charities that contact the band are real and others fake. The band could end up with negative publicity if they ignore a genuine charity or get duped by a bogus one. Whether or not to accept a sponsorship deal. To shoot a Music video and who will direct it, the location and the theme of this project. The player has the options to select from a range of choices, each with a cost value. Expensive directors and locations or less costly ones. As with the parody nature of the game director names lampoon real life directors. A selection choice of a high level (most expensive) director is named Steven Cheeseburger (Steven Spielberg). There are many others fitting with the theme of recognizable but legally distinct names. Which recording contract is best for your band. What to do if a little organisation in Taiwan is pirating your records. The player decides if they should do nothing, sue them, buy them out or \"send in the heavies\". Releasing an album or single makes them eligible for the charts. A Top 10 Singles & Albums charts (depending on what you have released) gets displayed on screen every Sunday. The other bands in the Top 10 are also parodies of other rock bands.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Codemasters", "publishers": "Codemasters", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "4.2", "wikipedia": "https://en.wikipedia.org/wiki/Rock_Star_Ate_My_Hamster", "video_link": "https://www.youtube.com/watch?v=np6pqkbTplM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30442-rock-star-ate-my-hamster\n"}