{"altername_name": ["Rockman (Alligata)"], "name": "Rocman", "overview": "In times gone by, when knights were bold and crusaders roamed the land, the French (not satisfied with Golden Delicious and Citroen carts) held the treasured Holy Grail. In an attempt to keep this relic of the Last Supper, hey stashed the wooden wonder deep within the Caves of Sabhatez in central France. Now around this time Richard the Lionheart and a few trusted companions had booked their summer holidays in Jerusalem (apparently it's very nice at that time of year). On their way back, with holiday souveniers of the treasure in Solomon's temple in hand, they decided to stop a few (k)nights and put up tents in a little field near Toulouse - next to the Caves Of Sabhatez! But the French king wasn't too happy with all these foreigners using his favourite holiday spot as a camp site. He was so incensed that, with the Pope's blessing, he sent French troops to move these sword-swingers on and protect the ancient remains. A great bloody battle arose with both sides taking heavy losses. And when all the excitement had subsided, both the Englishman's treasure and the Holy Grail had disappeared without a trace. Hundreds of years passed, and the chalice was treated as little more than an ancient legend - till recently, when a wealthy Middle Eastern king sent a message out to archaeologists worldwide with the news that a reward lies waiting for any Indiana Jones-type character who can find the Holy Grail after all these years. For the lucky man… not the usual holiday for two in Hawaii or a flight on Concorde, but the hand in marriage of the king's delectable young daughter and, of course, half of the kingdom. Only one person comes forward for this 'challenge of the century', a loner of whom we know nothing, Rocman. In the game you are the fearless mercenary making your way through subterranean caverns and caves in a search for the Holy Grail. As all adventurers know, keys and scrolls must be collected at every opportunity so you can roam through unexplored underground areas, avoiding the guards scattered throughout the mysterious hollows. And on your quest through the labyrinthine structure you'll come across 12 ancient goblets, which must be gathered to form a magic shield. Only with this do you have any hope of finally taking hold of the Holy Grail and the King's only daughter…", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "magic team", "publishers": "magic team", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=8kEs0EyGG9A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112559-rocman\n"}