{"altername_name": [], "name": "Roland's Rat Race", "overview": "Roland Rat, TV AM's furry little superstar extraordinaire, has got problems. It all started when Roland got up, late for work and not exactly feeling on top of the world. As if being late wasn't bad enough, Roly finds out that his rather decrepit car won't start. Disaster! Still, there's always the shortcut through the London sewer system, which Roly knows so well from his lurid past life as a city rat. He'll make it to the telly studios before nine o'clock, don't you worry. Being late is, however, the least of his problems. A highly disreputable bunch of nasties have kidnapped Roly's friends. Yes, you've guessed it, Errol the hamster and Kevin the gerbil are in deep trouble. Out of the goodness of his heart, Roland decides to set out and rescue Errol and Kev. To do this, he has to find the key to unlock the door to the nasties' secret hideout. However, before he can unlock the door, Roly has to actually assemble it! Pieces of the hideout door have been left lying around the sewer network, careless of the baddies, eh? Unfortunately, due to the fact rats ain't that strong, Roly can only carry one bit of the door at a time. Whenever he collects a piece he has to fit it into place before he can pick up another. Worse still, there are pairs of wellies trotting around the place that weaken Roland each time he runs into them. Fortunately though, Roland is armed with his Instant Stic-O-Matic glue gun that can eject globs of glue with deadly accuracy, c piece of equipment that is definitely not to be sniffed at. It can be used to temporarily stop the wellies in their tracks and can bring Roly himself to a halt with a badly aimed glob. If our furry friend's energy should run out, then it's curtains for him and his mates. Throughout the sewer there are apples and hamburgers which Roland can eat for extra energy, but these are in limited supply and must be eaten strategically. A few glue packs are also lying around conveniently, to boost Roly's supply. Way down in the darker depths of the sewer there runs a regular train service which Roland can catch through timely use of his glue gun. If he's not careful, though, he'll end up getting run over and lose a lot of energy in the process. Once Roland's assembled the door and opened it to release his chum, only worms and electrically charged areas stand between him, his pals and freedom. But at this point, Roly can't use his glue gun! When Errol and Kev have been saved, the trio are transported to the surface and the game starts over.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "", "developers": "Denton Designs", "publishers": "Ocean Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "1.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90302-rolands-rat-race\n"}