{"altername_name": [], "name": "Sabre Wulf", "overview": "Sabre Wulf a 1984 action-adventure game by Ultimate Play the Game and the first game of the Sabreman series. The player, as Sabreman, navigates a 2D jungle flip-screen maze aiming to reconstruct an amulet and escape. The maze is divided into 256 edge-to-edge screens filled with colourful flora and enemies that spawn randomly. Ultimate released the game for the ZX Spectrum in 1984 at an above-average price to combat piracy. The game's premium packaging became a company standard. Ultimate, a developer known for its secrecy, had finished Sabre Wulf‍‍ '‍s sequels in advance of its release, but withheld them for marketing purposes. They were swiftly released the same year. Ultimate hired outside developers to make Sabre Wulf ports for the BBC Micro, Commodore 64, and Amstrad CPC platforms, and the game was subsequently included in multiple compilation releases, including the 2015 Ultimate and Rare retrospective Rare Replay. Reviewers lauded the game's graphics and found its gameplay similar to Ultimate's previous release, Atic Atac, though preferred Sabre Wulf. Reviewers also noted the game's difficulty. It was recommended in several gaming publications and won \"Best Maze Game\" in the 1984 Crash Reader Awards. Sabre Wulf was a financial success and reached the top of the format charts. It was listed in multiple lists of top Spectrum games. It introduced the Sabreman character, who has recurred throughout Ultimate and Rare intellectual properties, and the Sabreman game series.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Ashby Computers and Graphics", "publishers": "Ultimate Play the Game", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.29", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=15SFEHDvjns", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/17366-sabre-wulf\n"}