{"altername_name": [], "name": "Salamander", "overview": "Salamander (沙羅曼蛇 / サラマンダ Saramanda), retitled Life Force (ライフフォース Raifu Fōsu) in North America and in the Japanese arcade re-release, in Europe known as Life Force: Salamander, is a scrolling shooter arcade game by Konami. Released in 1986 as a spin-off of Gradius, Salamander introduced a simplified power-up system, two-player cooperative gameplay and both horizontally and vertically scrolling stages. Some of these later became the norm for future Gradius games. Salamander was followed with a sequel in 1996 entitled Salamander 2. The first player controls Vic Viper and the second player takes the reins of debuting spacecraft Lord British, which is sometimes referred to as \"Road British\" due to the ambiguity of Japanese-to-English romanization. The game features six stages which alter between horizontal and vertical scrolling. Players are allowed to continue from where they leave upon death instead of being returned to a predefined checkpoint as per Gradius tradition. There are no continues in Salamander's single player mode; however, in the two-player mode, players are given two continues. The number of continues can be changed through DIP switches. The player gains power-ups by picking up capsules left behind by certain enemies, as opposed to the selection bar used in other Gradius titles. However, the Japanese version of Life Force keeps the selection bar. Many of the power-ups can be combined. For example, an option fires a second (or third) salvo of missiles or ripple/plutonic lasers if these power-ups have been option. The ripple and laser, however, are mutually exclusive. The only power-up that can survive the ship's destruction are the options. Upon the ship's destruction, the options float in space for a brief time before disappearing; the new ship can grab and retain them if they get to them first.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Andrew J. Glaister", "publishers": "Erbe Software", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.36", "wikipedia": "https://en.wikipedia.org/wiki/Salamander_%28video_game%29", "video_link": "https://www.youtube.com/watch?v=j0gOq-2jRlM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92137-salamander\n"}