{"altername_name": [], "name": "Sam Slade Robo-Hunter", "overview": "It's Christmas and Sam Slade's faithful robot assistants Hoagy and Stogie have bought him a state of the art Virtual Reality system, (the ZX Ripovotron 3000), bundled with a brand new game entitled \"Escape From The Planet of The Robot Robo-Hunter Hunters\". The clueless duo believe that they've purchased a bargain, having obtained the system for a fraction of the recommended retail price from a mysterious figure on the street. Little do they know that the game is actually a trap devised by an evil, self proclaimed cyborg tech-genius known as Noel Skum. Having slowly become more and more roboticised while also becoming increasingly involved in a number of dodgy dealings and nefarious schemes, Noel believes it is only a matter of time before he ends up on Sam Slade's bounty-hunting radar and has decided to pre-empt such an eventuality. When Sam puts on the VR headset he immediately becomes trapped within the virtual world and must fight for his life for real. Eventually realising what has happened, Stogie patches Hoagy into the system in an attempt to assist Sam, but Hoagy's inferior AI fragments, causing the robot to appear in-game in a number of locations as a levitating head and also have some of his memories manifest, such as that of Sam's Robo-Meter, Cutie. It transpires that Noel Skum has also patched himself into the system remotely, in order to direct the game's virtual droids and generally keep an eye on things. To escape from the digital realm, Sam must search for and defeat Noel's robotic avatar, thus completing the game and destroying Noel in both worlds.", "platform": "Sinclair ZX Spectrum", "release_date": "2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Malcolm Kirk", "publishers": "Monsterbytes", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167695-sam-slade-robo-hunter\n"}