{"altername_name": [], "name": "Sgt. Helmet: Training Day", "overview": "Shortly before his infamous adventure in Khartadmocia (where he was sent to rescue 40 rescueable damsels) – about a couple of weeks earlier -, Sgt. Helmet was rolling snots with his pinky while feeling incredibly bored and disatisfied with the training methods used in his base. Mind you, he was a proud member of the top-3 thoughtest people on Earth alongside Chuck Norris and Katheleen Turner, and, in his opinion, jumping trampolines using jumping flip-flops and rolling under barbed wire in the mud was kind of depressing. That’s why fellow warriors Sgt. Pepperpot, Col. Miguel and Alm. Adamant designed an all-new training field for their good fellow Sgt. Helmet so he could properly train for an always possible, upcoming war or rugby match. The very day Jimmy the Lemur, his own pet, became of age (do the math: 15 lemurean years equal 4 dog years), the fellow warriors had something for Helmet: he got his eyes blindfolded, his lips rouged, and dressed with a cute blue taffeta blouse with matching skirt. Then he was told “we are sending you to a suicide mission to Kartadmocia – but before you have to pay us a little favor: set five bombs in the Defence Ultra Large Level computer, the DULL, and the come back to the base. Like?”. Still astonished, while inspecting the field maps about the location of the DULL computer, Helmet answered “Like”. Then, Helmet kissed Jimmy goodbye while he was putting out the last candle in the cake, carefully folded the taffeta clothes and put them back for more important commitments, put on his military boots (one marked with a red tag, other with a green one, so he would not be confused on which to put in each foot) and namesake helmet, and got ready for the mission!", "platform": "Sinclair ZX Spectrum", "release_date": "September 24, 2013", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "The Mojon Twins", "publishers": "The Mojon Twins", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=EidLloFsvqY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151294-sgt-helmet-training-day\n"}