{"altername_name": [], "name": "Shinobi", "overview": "ENJOY FRANTIC oriental action in this Ninja beat-em-up. Search for kidnapped children and dispose of marauding thugs with blows from feet, fists and shuriken stars. Classic SEGA coin-op thrills! One hot summer's day, everything began to go wrong. As the most famous graduate of a secret oriental Ninja school, you had been invited back to the annual graduation ceremony and prize-giving. Having enthralled the junior classes at the assembly with your tales of international ninjiing, you were just about to move on to handing out prizes to the seniors when there was a flash of Dark Ninja Magic and Bwah Foo made an unscheduled appearance. Few of the pupils realised who Bwah Foo was, but within a ninja-second you had identified him and realised that this once-illustrious graduate of the Ninja school had turned to the Dark Ways. Transfixed by Bwah Foo's Holding Magic, you were unable to move a muscle oven twitch a tendon as Bwah's henchmen led away the entire junior class. Then the evil Foo issued his personal challenge to you. With one mighty bound he somersaulted onto the speech-giving platform and thrust his face in front of yours. \"Why if it's not Joe Musashi\", he sneered, \"Old Goody - Two Shurikens himself. Well, well, well.\" (Clearly the quality of teaching on the Dark Side has slipped abominably, you thought to yourself, as Bwash Foo ranted on in clipped baddie-speak, the like of which was normally reserved for second-rate pantomimes is seaside towns.) \"... well, well, well. It's gold I want\", Foo continued, \"all the gold in the School's coffers. And if I don't get my gold by Wednesday evening I'll kill every last member of the Junior Class and THEN you'll be sorry.\" And with a maniac crackle and a flash of green Ninja Magic, he was gone.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "", "developers": "Virgin Games", "publishers": "Virgin Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Shinobi_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53913-shinobi\n"}