{"altername_name": [], "name": "Silkworm", "overview": "Nuclear arms were outlawed by a series of international treaties after the fourth great war, and now civilisation has returned to low-explosive weapon systems whith high delivery rates. War has almost gone 'green'. Weight of numbers, together with very high firing rates, goes partway towards making up the shortfall in power occasioned by the ban on nuclear weapons. But even though the generals have been provided with an incredible number of tanks, planes, choppers, mines and field guns to play with, they are not at all pleased. They are in fact, well unhappy. The commanders of the One Continent Alliance have joined forces to show the political leaders that they have power - all the land, sea and subterranean forces of the Alliance have rebelled and a military coup looks inevitable. Our planet is only just clinging to its path through the solar system, having been set wobbling like a top by the energy released in the last of the nuclear wars. Should the generals succeed in seizing power they will return to the nuclear technology of war, and Earth will almost certainly be sent spinning off its orbit into the wastes of space, as yet another nukewar begins. One small hope for the future of Earth remains. A group of weapons, scientists working on advanced helicopter and land-vehicle protects remains loyal to the people, rather than the military. If drivers and pilots can be found for the prototype vehicles in loyal hands, an attempt to fight through the waves of advancing troops could be staged. There's a very very small probability that a skilled pilot or driver could take out all the generals. Those odds would be improved if a driver AND a pilot could be found. Earth's chances of survival hang on a thread, a thread so gossamer fine that it could be made of silk. Realising this, the weapons scientists codenamed civilisation's last stand Operation Silkworm. Step forward hero, read the briefing and take the controls...", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Random Access", "publishers": "Virgin Games", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "4.12", "wikipedia": "https://en.wikipedia.org/wiki/Silkworm_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53911-silkworm\n"}