{"altername_name": [], "name": "Sim City", "overview": "SimCity is an open-ended city-building computer and console video game series originally designed by developer Will Wright. It is published by Maxis (now a division of Electronic Arts). The game was first published in 1989 as SimCity, and it has spawned several different editions sold worldwide. The ongoing success of SimCity has also sparked the release of many other spin-off \"Sim\" titles, including 2000's The Sims, one of the best-selling computer games In SimCity, the player is given the task of founding and developing a city, while maintaining the happiness of the citizens and keeping a stable budget. In SimCity 2000, SimCity 3000 and SimCity 4, the player is allowed to alter the terrain of the city before building on it. The player must define development zones, each having limits on the kind of development that can occur there. Development of the zones is not performed directly by the player, but happens when certain conditions are met, such as power supply, adequate transport links or acceptable tax level. The residential zones, in green, provide housing for Sims; the commercial zones, in blue, provide shops and offices; and the industrial zones, in yellow, provide factories, laboratories and farms. There are three different densities in the game: low density for small buildings, medium density for low to mid-sized buildings, and high density for anything up to large tower blocks. Developed in Orinda, California, SimCity's game mechanics are heavily based on 20th-century California development. For example, players start from an undeveloped greenfield, cars are the default form of transportation, earthquakes happen, zoning separates residential, commercial, and industrial land uses, and one can enact policies such as declaring one's city a nuclear free zone.", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Probe Software Ltd.", "publishers": "Infogrames", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "4.4", "wikipedia": "https://en.wikipedia.org/wiki/SimCity", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/52989-sim-city\n"}