{"altername_name": ["Sky Ranger"], "name": "Sky Ranger", "overview": "The game puts the player in a dystopian society where the skies are uncontrollably ruled by machines created once by civilization to be their safe keepers. At that time crime in the streets was so abundant that the best way to fight it was through a vigilant eye in the sky, with special machines prepared to combat crime from above. Robotic instruments knowing, practising and ultimately being the Law itself. In time crime was erased, the city lowered the defences and minor offences started to be equated with serious crimes. This apparent malfunction was the result of a direct conflict of machines having total access to all of the archives of the existent Law, past and present, part of it unaccustomed and to be reformed, and its uncontrolled unbalanced practice. The machines became obsessed and started to track every possible tinny transgression ultimately impersonating their nemesis with dictatorship and constant persecutions. Once trustingly called the Watchers, now the menace to be fought. That's where the player begins the game as a special air force, a ranger of the skies equipped with the last helicopter technology trained to be an Ace, a Watcher's hunter. Like in a 1st person flight simulator, the game takes place while flying around the city in a vector graphic environment, where the player has to worry about finding the next point of fuelling, not colliding with the buildings or entering into the heavy clouds that may cause problems for his tech equipment. The player will be given codes when he overcomes a level, when the Watchers start to become his prey.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Microsphere Computer Services Ltd.", "publishers": "Microsphere", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113251-sky-ranger\n"}