{"altername_name": [], "name": "Smuggler's Cove", "overview": "THE STORY The year is 1 753. Two miles off the North Cornish coast, huge waves pound the latest victim of the notorious Doombar. the Cutter captained by the ruthless pirate Black Beard. For many years he had terrorised and plundered the commercial shipping operating out of Bristol, but at last the sea itself had dealt out a just retribution. As top agent for the Royal Duchy, you are of course well aware of the rumours of a hidden hoard of Black Beards treasure and the terrible tales of those who have tried to find it. It is said that most are never heard of again, and that those that do return, do so dreadfully deteriorated in both mind and body. Until now you have discounted such rumours as nonsense, but the morning after the wreck you find the cutter's log washed up at Daymer Cove. It indicates clearly that the entrance to the cave system was used extensively by smugglers some years ago. Thinking that this might be the location of the fables treasure, you climb through the hole high in the cliffs which is the only known entrance. As you enter, you slip and fall twenty feet to the cave floor There is now no way you can get back to the entrance, so you decide to search for the treasure and another way out The Ship's log also contains some words in it, which may be of use on your journey. These are: 'LOOK', 'INV', 'N', 'E', 'S', 'W, 'U', 'D', 'TAKE', THROW, 'HIT'. 'SCORE'. 'SAVE'. 'LOAD'. The main object of the adventure is of course, to escape back to the surface with the treasure. but you only score maximum points by using the best route GOOD LUCK!", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "John R. Keneally", "publishers": "Quicksilva", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/xJWgdnqcyLc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148525-smugglers-cove\n"}