{"altername_name": ["Sooty and Sweep"], "name": "Sooty & Sweep", "overview": "\"Izzy Wizzy let's get Bizzy!\" There's always trouble when Matthew goes out. This time he has left Sooty in charge until he returns. Unfortunately Sweep has been up to his old tricks and not only left his dirty old bones all over the house but has left the door to the garden open and all the creepy crawlies have got into the house. Sooty and Sweep will be in big trouble if they don't clear up all the bones by the time Matthew gets back. Luckily Sooty has his magic wand out and Sweep his water pistol (in the two player game). They decide to find all the old bones and ask Soo to help collect them. As Sooty and Sweep collect the bones they give them to Soo who puts them in the basket. Some of the bones have been left in the most awkward places and Sooty must be very careful when he tries to get them. The creepy crawlies that are in the house will try to catch Sooty and Sweep. They can be avoided by jumping over them or stunning them with either Sooty's magic wand or Sweep's water pistol. Around the house there are useful items to help Sooty and Sweep:- Keys - for locked doors. Sticky Buns - which attract all the bugs in a room. Magic Boxes - for re-charging Sooty's wand. Bottles of Water - for re-filling Sweep's water pistol. One player:- You can be either Sooty or Sweep. Just move the pointer to who you want to be. Two player:- Player one is Sooty and player two is Sweep. Each player has a separate score and is out to get a higher score than the other. You can do this by snatching bones off each other or throwing Custard Pies ... splat! ... and the other player will drop the bone.", "platform": "Sinclair ZX Spectrum", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Enigma Variations", "publishers": "Alternative Software", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95508-sooty-sweep\n"}