{"altername_name": [], "name": "Sophia II", "overview": "Two years after the defeat of the evil sorcerer Yojar, the small Autonomous Principality of Xixerella, administrated in the name of the Emperor by princess-magician Sophia, is one of the most prosperous parts of the Empire. Thanks to the policy of peace and tolerance promoted by Sophia, several philosophical and religious creeds coexist in Xixerella. One group in particular, the Society of the Inner Light, is widespread. It ostensibly aims to strenghten individual well-being through group meditation practices. After some time however strange rumors begin to circulate about what goes on in the tall tower, built by the members of the Society as their seat. Word has it that occult rites are performed there, with human beings turned into monsters, and that lethal machinery watches the place against intruders. Besides, cases of people mysteriously disappeared some time after joining the Society are reported. One night, a guard patrol stumbles upon a horrendous and hostile creature, a sort of enormous red spider. Reinforcements are called and the soldiers, not without effort, manage to capture the beast and bring it before Sophia. She immediately senses an evil aura coming from the creature. Getting to work at once, she creates a spell that, once cast upon the monster, turns it into its original shape: a Society member who had disappeared that night. Questioned by Sophia, the man reports that he does not remember anything, except taking part to a collective rite performed by the Society in the tower. Further investigations carried out by secret agents infiltrated by Sophia inside the Society reveal the truth. The Society is nothing but a gigantic front, behind which an obscure entity known as Grim Reaper hides. He exploits the life force of people, to boost his might, as well as to build and supply energy to deadly fighting machines, which he plans to unleash in order to take over the whole Empire. Under his influence, Society members lose their humanity and are consumed, sometimes up to their death. Sophia then decides to wear her robes again and turn to action. An all-out attack is out of the question – Imperial forces would risk to be annihilated. Sophia will have to penetrate the tower crossing a dungeon and an underwater passage, finally confronting the Grim Reaper face to face. Once again, the fate of Xixerella and the Empire falls upon her shoulders.", "platform": "Sinclair ZX Spectrum", "release_date": "2019", "game_type": "Released", "esrb": "Not Rated", "developers": "Alessandro Grussu", "publishers": "Alessandro Grussu", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151391-sophia-ii\n"}