{"altername_name": [], "name": "Sophia", "overview": "The Empire is a large political entity stretching over many lands, populated by different peoples. For years, peace and justice have been assured under the rule of the current Emperor. But now, the Empire is under a major threat: Yojar, an evil sorcerer coming from another dimension, has invaded it. Not only he occupied three major regions with his minions; he also scattered several tokens of power there. They appear as giant skulls and act as beacons of influence from their maker – if they stay for a long enough time, they will allow Yojar to enter our world, and then he will be unstoppable. The brave Imperial troops are unfortunately unable to withstand the assault of Yojar’s forces. The Emperor summons his ministers and together they take a decision: since conventional weapons cannot fight magic, it must be fought with other magic. An emissary is sent to the Territory of Xixerella, a small, partially autonomous community nested among the mountains on the western fringe of the Empire, where the most powerful wizards of the kingdom can be found. In Xixerella, magic has been practiced exclusively by women for centuries. It is based upon an ancient wisdom which core is the notion that the Universe, while being one, is driven by the contrast between opposite principles: light and dark, old and young, heat and cold, soft and hard, and so on. Traditionally, only women are allowed to fully master the tremendous power which can be unleashed by learning this doctrine in its deepest aspects. The future wizards are selected a few months after they are born, as soon as the signs of their power appear; for example, they can push objects much heavier than them without touching them, or light fires out of nothing. About one out of every twenty girls shows this power. After a long and strenuous training, they become able to project deadly bolts of energy, temporarily protect themselves from any sort of physical or psychic damage, and even to fly! The emissary explains the situation to the High Master of Xixerella and her inner circle of wizards, and tells them that His Majesty has requested a member of their Order to infiltrate the enemy lines, repel Yojar’s evil army and save the Empire, and possibly mankind, from being enslaved. Then Sophia, a young and promising wizard, stands up from her seat and volunteers for the mission. Despite the High Master’s attempts to make her recede from her proposal, fearing that, notwithstanding her vastly superior ability in the use of magic, her young age and lack of experience could harm her, Sophia is irremovable. The emissary is impressed by Sophia’s determination and, in the name of the Emperor, officially designates her as the last hope of the Empire. Later, he brings her to the first occupied area.", "platform": "Sinclair ZX Spectrum", "release_date": "2017", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Alessandro Grussu", "publishers": "Alessandro Grussu", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151390-sophia\n"}