{"altername_name": [], "name": "Space Disposal", "overview": "The amount of space junk floating around has become a major concern, especially the huge amounts that manage to get through planetary atmospheres without burning up. This debris is largely ignored by the planets responsible and so out of this mess grew a new lucrative industry. Space Disposal Corporation was set up to clear away unwanted and potentially dangerous space waste for those planets rich enough to pay for its services. Travelling around systems can be a huge drain on resources, but this is where SDCs technicians came to the rescue. By collecting and harvesting the junk, enough power can be generated not only to drive the collection ships, but also to pay the fees for inter-planetary portal transport. As a new pilot, you are given four planets to clear. Your ship can withstand collisions with the planet surface and foliage, but cannot take hits from moving hazards like meteors or rouge cleaner droids. You have quad-laser canons that can be used to destroy any moving hazards. Some planets opted for a cheaper alternative cleaning operation prior to calling SDC. This usually involved a pack of cleaner droid manufacturing pods being dropped onto the planet. Unfortunately, contaminated waste interfered with their circuits and the droids are left to roam about without actually removing any debris. Many droids are unpredictable, changing directions randomly, so be careful. These droids are self-repairing and any hit will destroy the current unit, however, the pods will generate a new replacement straight away. It is useful to locate these pods, as destroying droids can be useful, despite them being re-generated. The pods cannot be destroyed. By collecting all junk from one planet, enough power will be created to allow the blue portal to be activated, allowing you to travel to the next designated planet. Once all four planets have been clear you will be allowed to enter the final portal for transport back to SDC. Any SDC pilot will learn that his laser canons are not weapons but mechanisms to manipulate the environment. By destroying a droid it will be regenerated in its pod, by blasting a meteor it will clear the way long enough to move, but more meteors are always on the way. Keep this in mind.", "platform": "Sinclair ZX Spectrum", "release_date": "2011", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Paul Jenkinson", "publishers": "Paul Jenkinson", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151392-space-disposal\n"}