{"altername_name": ["Speccy Bros"], "name": "Speccy Bros", "overview": "Guide Nick through the snowy kingdom, conquering each screen by killing the enemies that inhabit it. Hang around too long, and the dreaded \"Pumpkin\" man will arise to harass our hero. Enemies are killed in two ways: Either by rolling them, or squashing them. To roll an enemy, turn him into a snowball by first throwing snow on him. While being covered, the enemy will remain trapped and motionless for a brief duration. When completely covered, while resembling a snowball, the enemy can be rolled by pushing him with fire held down. The enemy will then roll down screen until he had no where left to roll, before dissipating. While in motion, rolling enemy snowballs may squash other enemies encountered. Enemies squashed by rolling snowballs, will yield useful pickup items. The value and use of such items depends on the enemy squashed and upon how many such enemies were squashed at a time. Anyone skillful enough to squash all the screen enemies in one go, will be rewarded huge cash bonuses!!! Aside from squashing other enemies when rolled, trapped enemy snowballs are also useful for reaching hard to reach places. Our hero can stand on Snowballs, just as he can stand on other in-game platforms. Snowballs can also be stacked, to a limited degree - something that \"might\" prove handy if looking for a safe place at the end of the game (hint, hint). Within the game, you will also encounter 3 enemy bosses. As in the original arcade game, rolling trapped enemy snowballs at them will do them more damage than merely throwing pelts of snow. Conquer all that this snowy wilderness can throw at you, and you may just meet your true love again. Good Luck!", "platform": "Sinclair ZX Spectrum", "release_date": "2012", "game_type": "Homebrew", "esrb": "E - Everyone", "developers": "Climacus", "publishers": "Climacus", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113343-speccy-bros\n"}