{"altername_name": ["Sptting Image"], "name": "Spitting Image: The Computer Game", "overview": "Spitting Image is a video game released in 1989 featuring characters from the Spitting Image puppet show. It is a one-on-one fighting game programmed by Walking Circles and published by Domark. According to the game's pre-amble, a prophet has determined that within the next seven years, there will be a world war which is instigated by a \"mysterious leader\"; so terrible that the Italians have already surrendered and so violent that the Swiss will be involved. To avoid this fate, six world leaders have agreed to duke it out - the winner being the undisputed ruler of the world. The player chooses one of six world rulers: Margaret Thatcher from the United Kingdom, Ronald Reagan from the United States of America, Mikhail Gorbachev from the USSR, Pope John Paul II, Ayatollah Khomeini and PW Botha from South Africa. The game selects a random opponent and the player's character travels to the country of the world leader to duke it out in a best of three fight. Elizabeth II adjudicates and comments on the fights, appearing in a postage stamp at all times. Being launched on an 8-Bit gaming platform, the fights are two dimensional with the characters being limited in moves they can perform. The characters can attack on the ground or in the air through jumping and each has special moves - Khomeini can land damage by using his beard as a third fist while Thatcher can headbutt opponents. Each character can call an aide twice in a fight to assist them. This aide typically throws some sort of projectile in the melee which has a specific arc so a seasoned player can avoid the attack. After all five opponents have been defeated, the player has to fight the \"mysterious leader\". Elizabeth announces that the mud wrestling equipment from Prince Philip's last party is still available and the fight takes place in the dark as someone switches out the lights. Mud occasionally stains the screen and the only clue as to the whereabouts of the player's opponent and the player's character are their eyes. If the player is able to beat the \"mysterious leader\", it is revealed that all this was a ploy for John Rambo to take over the world and the game ends. There is also a two-player mode available where the opponents can do combat at any of the six main game locations (non-story mode).", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "", "developers": "Domark Ltd", "publishers": "Domark Ltd.", "genres": "Beat 'em Up", "max_players": "1", "cooperative": "No", "rating": "3.12", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78342-spitting-image-the-computer-game\n"}