{"altername_name": [], "name": "Spoof", "overview": "Once upon a time there was a little house in a little village near a town in a tiny country on a tiny planet in one heckuver massive universe. In the house there lived the Ning family. Yaw Ning - 'The tired one', the master of the house was sick up and fed with his mundane existence in his little world. Dro Ning, his wife - 'The nagging one', was sick up and fed with her husband and Mo Ning and Complay Ning, the children, were sick up and fed with each other. Eventually, something snapped, and one Sunday morning, Yaw decided he was going to go out and find himself an adventure. \"I'm sick up and fed with my mundane existence,\" he said, mending the thing that had snapped - his belt. \"I'm going out to find myself an ADVENTURE,\" \"Well just don't come home drunk,\" shouted Dro, as the door slammed behind him. A couple of hours later, Yaw was moaning about his life to the landlord of his local, The Dragon Inn, whilst supping his favourite pint, Dragon Ale, when a drunk came staggering in crying and sobbing. \"Oh Woe. Oh Woe.\" he said. \"Oh Woe what?\" asked the Innkeeper. \"Oh Woe the Magic Dragon.\" \"I thought it was called 'Spoof'.\" \"Who cares what it's called - it's back.\" \"Oh Woe. Oh Woe,\" everyone in the inn moaned. \"What dragon?\" asked Yaw. \"Oh surely you've heard of the legend of Spoof The Magic Dragon?\" the innkeeper said, winking at the other customers. \"No? Well, the legend says that when King Froggo returns to our land, the Magic Dragon will return also to avenge old wrongs.\" \"We need an adventurer,\" the drunk shouted. \"I'm here,\" shouted Yaw. \"I'll do it. I'll kill the dragon.\" \"Well, before you go, you'll need a swig of this,\" said the innkeeper, pulling down a bottle marked \"ADVENTURE ALE\". He poured a glass for Yaw. As Yaw drank the strange brew, a weird feeling came over him. \"What's this weird feeling coming over me?\" he asked. What indeed? Meanwhile, far, far away in another world, YOU are looking into your VDU and wishing that you too could be a REAL adventurer. Suddenly, there is a blinding FLASH and you realise that the weird feeling that YAW is experiencing, is a merging of your two existences into one. You and Yaw are one. You are standing outside the Dragon Inn. The sound of riotous laughter from the inn invades the air around you. You ignore it and go into the village square...", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Runesoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://youtu.be/qGB_8pXEbPQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148554-spoof\n"}