{"altername_name": [], "name": "Spy vs Spy", "overview": "Spy vs. Spy was a game first published by First Star Software in 1984 for the Atari 8-bit family, Commodore 64 and Apple II computers. It was a two-player, split-screen game, based on MAD Magazine's long running cartoon strip, Spy vs. Spy, about the slapstick antics of two spies trying to kill each other with improbably complex and elaborate traps and weapons. It was later ported to a much wider range of platforms including the ZX Spectrum, Acorn Electron, Atari ST, BBC Micro, Commodore 16, MSX, Amstrad CPC, Amiga, Master System, Game Boy, Xbox, Game Boy Color and Nintendo Entertainment System, which was emulated on the Game Boy Advance. A remake with a retro version was also released on iOS in 2012. The object of the game is to collect various secret items in a briefcase and exit the building through a door to the airport before the opposing player, or before the timer runs out. While searching for the items, traps can be laid to take out the opponent (or the player themselves, if careless). Each spy has a personal countdown timer which depletes by 30 seconds upon each death. The arena is an embassy, constructed from a series of interconnected rooms laid out on a grid pattern. Higher levels have more rooms, and therefore a larger play area. As well as hand-to-hand combat (achieved by wiggling the joystick or directional pad left and right or up and down when the spies are in proximity to each other) the spies can place traps on the furniture and doors which occupy the playing area. These traps are triggered when a spy searches a piece of furniture for an item or opens a booby trapped door, resulting in a cartoon style animation showing the subject being shot, blown up, etc, and floating up to heaven as an angel. The game is an example of the broad \"trap-em-up\" genre, which also includes games like Heiankyo Alien (1979), Space Panic (1980), and Lode Runner (1983). Strategy is introduced by limiting the quantity of each trap a spy can use, and by allowing the traps to be triggered by either spy. Some pieces of furniture also contain 'remedies' which match up to specific traps - these allow a trap to be defused, but can only be fetched one at a time.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "", "developers": "First Star Software", "publishers": "Beyond", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/77981-spy-vs-spy\n"}