{"altername_name": [], "name": "Star Wars", "overview": "The officialy licensed conversion of the world famous arcade game landed on the ZX Spectrum right at the tail end of 1987. The arcade version of Star Wars had been a phenomenon with it's fast moving vector graphics and sterio sound, not to mention the full cockpit sit down version. Domark released Star Wars for the Sinclair Spectrum and those clever guys at Vector Grafix (who would also develop The Empire Strikes Back on the Speccy) handled the conversion. The game was loosly based around the movie, with three main levels to contend with. As the game started up you were treated to a nice rendition of the Star Wars theme tune - the style of music was the now familiar ZX Spectrum 'synth sound' that really pushed it's humble beeper to the max. As in the arcade game, you could choose your level of skill by pointing your X-Wing cross hairs at the Easy, Medium or Hard level Death Stars and pressing fire. The game would begin and you were flung straight into action on the first stage of the game. Your X-Wing fighter was fitted with quad lasers and defensive shields which could absorb nine hits from the enemy before you were blown into smithereens. As most of you will know, the first stage of Star Wars was basically shooting down enemy tie fighters (and fireballs they would shoot at you) as they weaved around the starry backdrop of deep space. Lasting long enough put you into stage two. Stage two had you flying over the surface of the dreaded deathstar, shooting gun emplacements and towers whilst avoiding enemy fire and crashing into the surface and the aforementioned towers. Weaving your way across the surface would lead you to the final, and probaly most exciting stage.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Vektor Grafix", "publishers": "Domark Ltd.", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.12", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/77980-star-wars\n"}