{"altername_name": [], "name": "Starglider 2", "overview": "Starglider 2 is a 3D space combat simulator published in 1988 by Rainbird as the sequel to 1986's Starglider. It was released for the Amiga, Atari ST, MS-DOS, Macintosh, and ZX Spectrum. Instead of the wireframe graphics of the original, Starglider 2 uses flat shaded polygons. The game features open, continuous gameplay without levels or loading screens after the game had started, despite taking place across an entire planetary system. The player can fly through space, enter a planet's atmosphere, explore the surface, and penetrate subterranean tunnels in one seamless movement. The goal of Starglider 2 is to destroy an enemy space station with a neutron bomb, and the majority of the gameplay consists of collecting parts for the bomb, or fulfilling other prerequisites (e.g. finding the nuclear professor capable of constructing the bomb, or trade goods for the bombs necessary to destroy the shield generators protecting the space station), while fighting off enemy spacecraft, and delivering collected items to depots inside planetary tunnel systems. The various objects needed to complete the game are distributed across the many planets of the solar system, as well as in the intervening space (e.g. asteroids and space pirates), or even in the atmosphere of the gas giant planet. The flight model is arcade-style as opposed to realistic, as the game features no inertia; the spacecraft banks like an aircraft to turn, in air, outer space, and underground; and it is possible to hover. In addition, the game features many graphic display options, including the ability to eliminate roll, or view the game from outside the cockpit from a non-chase-camera, making it difficult to fly but allowing the player to view the polygonal model of the spacecraft. The construction of the shield generators and the space station itself progresses continuously over the course of the game, and failure to destroy the space station before construction was complete will result in loss of the game (the space station would be used to destroy the player's home planet). Successfully destroying the space station will not end the game, despite treating the player to a spectacular explosion and congratulatory text; instead, it will simply reset the construction of the space station, and the player can again begin attempting to gain possession of another neutron bomb with which to destroy the station.", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Argonaut Software", "publishers": "Rainbird Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.83", "wikipedia": "https://en.wikipedia.org/wiki/Starglider_2", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114484-starglider-2\n"}