{"altername_name": [], "name": "Starglider", "overview": "Starglider is a 3D video game released in 1986 by Rainbird. It was developed by Argonaut Software, led by programmer Jez San. The game was inspired by Jez San's love of the 1983 Atari coin-op Star Wars. It is a fast-moving, first-person combat flight simulator, rendered with colourful wireframe vector graphics. The game takes over the surface of the occupied planet Novenia, and it is the player's goal to rid the world of the mechanised Egron invaders. To this end the player is equipped with a high-performance AGAV fighter aircraft, which is armed with lasers and television-guided missiles. Starglider was originally developed by Argonaut Software for the 16-bit Commodore Amiga and Atari ST machines. Rainbird also commissioned Realtime Games to produce 8-bit versions for the Amstrad CPC, Amstrad PCW, and ZX Spectrum (128k, with a cut-down 48k version without sampled speech or special missions), and also for the IBM-compatible PC running in CGA. Solid Images were commissioned to produce versions for the Commodore 64 and Apple IIGS. Most versions included then-novel sampled speech, from Rainbird employee Clare Edgeley. Starglider was packaged with a sci-fi novella by James Follett, describing the game's background story, in which the Egrons effortlessly blitz Novenia despite the planet possessing a previously impenetrable network of utterly deadly defense satellites. The Egrons defeat the system by disguising their battleships as a flock of intergalactic migratory birds, the Stargliders (of the title). The defense satellites had been programmed not to fire on these birds (which migrated between planets regularly) and hence did not recognise the Egron battleships as enemies, allowing the Egrons to reach the surface unopposed. You pilot the only existing example of a prototype fighter craft, initially armed only with lasers, as the TV-guided missiles require an enormous amount of energy to launch and control, which can only be gained by induction as your craft skims over areas with high-tension power conduits.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Realtime Games Software", "publishers": "Rainbird Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.58", "wikipedia": "https://en.wikipedia.org/wiki/Starglider", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30009-starglider\n"}