{"altername_name": ["Stunt Car Racer 128K"], "name": "Stunt Car Racer", "overview": "Stunt Car Racer is a racing video game developed by Geoff Crammond. It was published in 1989 under the MicroPlay label of MicroProse in the United Kingdom and by MicroPlay in the United States. The game differs from other racing games in that the races take place on an elevated race track, with nothing to stop the player from accidentally driving off the side. Most race tracks in the game have gaps in them which will cause serious problems to the driver if he or she fails to clear them. If this occurs then the player's vehicle is hoisted back onto the track (by a nearby crane) which costs valuable time. Turbo can be used to make a car go faster, but it can only be used for a limited amount of time in each race. The single-player game consists of a league table which is split into four divisions of three drivers each, making a total of twelve racers including the human player. There are two racing tracks in each division making it a total of eight tracks in the game. The tracks in division four (the first division) are easy, but the tracks get progressively more difficult and dangerous with each division. The player's objective is to reach, and subsequently win, division one. There are four races in a season, and each driver will race the other two drivers in both of the tracks in the division. Each race is run over three laps. Two points are awarded to the winner of each race and one point is awarded to the racer with the fastest lap time. At the end of each season, the top racer of each division is promoted to the next higher division while the driver in last place will be relegated. Damage to the player's car occurs when the player lands too hard on the track after driving over a crest too fast, crashes into a wall, falls into a gap in the track, or hits the opponent's car. If the damage, which is indicated by a crack in the frame at the top of the screen, reaches a certain level the vehicle is deemed to be wrecked and the driver will lose the race instantly. A particularly hard crash will also make holes representing structural damage appear in the frame above the windshield. Holes remain on the car for the rest of the season and increase the rate at which the crack in the frame advances.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Geoff Crammond", "publishers": "Micro Style", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.8", "wikipedia": "https://en.wikipedia.org/wiki/Stunt_Car_Racer", "video_link": "https://www.youtube.com/watch?v=Cu-_F7cvQhk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92641-stunt-car-racer\n"}