{"altername_name": ["100 Rutinas C.M.", "Supercode III"], "name": "Supercode 3", "overview": "Supercode III is the finest toolkit available for any computer in the world. Its like has not been seen before. It consists of one hundred and fifty two (yes, 152!) purposewritten state-of-the-art machine code routines, compact andalmost all relocatable, accessed by a powerful BASIC program.The routines can be called either from BASIC or from machinecode, either within your program or as direct commands. And, ifyou have a ZX Interface One, you will be able to transferSupercode 3.5 to Microcartridge as easy as 1-2-3 (no programchanges of any sort at all, the program does it all for you) forthe ultimate in convenience (if you don't have an Interface One,all the rest of Supercode's features are still there for you). Congratulations on purchasing Supercode III ! It will giveyou countless hours of pleasure. And there is an added bonus: asyou have purchased this copy after 31st December 1984 you arethe owner of Supercode III with its Version 3.5 operatingsystem, which gets the very best out of Supercode and is agreat improvement (both in speed and in friendliness) over itspredecessor 3.0. You can confirm that you have the very latestversion by checking the colourful Screen you get while loadingthe program: it will say 'Version 3.5' on it. The routines in Supercode 3.5 (which is Supercode III withthe Version 3.5 Operating system) can be broadly classifiedunder two headings:- a) UTILITIES give your programming far more flexibility thanyou would have imagined possible as a BASIC programmer. Indeed,Supercode 3.5 begins where the Spectrum ROM left off! Theroutines include a variable speed TRACE, ON ERROR GOTO, ON BREAKGOTO (the last two can make your program breakproof andcrashproof), SUPERCATALOGUE, several types of RENUMBER (the fullversion being able to handle all GOTOs, GOSUBs, RESTOREs, LISTs,LLISTs,LINEs etc and highlights calculated arguments), BlockMoves and Deletes, Line Moves and deletes, Program CompactingRoutines (such as REMkill,Line Contract,Number-VAL\"\" converter)Variable Search+List+Replace, Program scrambling routines, anultrafast random number generator, a SCREEN$ compactor/expander,all the routines you will ever need for Channel, Network, Datafile and Microdrive manipulation, diagnostics, Tape HeaderReader, Program Editing aids like Amend and the Case Converters,and much more besides.... b) SPECIAL EFFECTS of all sorts are to be found withinSupercode 3.5. Every conceivable scroll, in high (pixel) or low(character) resolution, up/down/left/right/diagonal, the wholescreen or a user-definable window, with selectable wrap-around,scroll-off, ripple/shutter effects, with or without attributes.Also, instant changes or swaps of INK, PAPER, BRIGHT, FLASH;instant filling, saving, exchanging, overprinting, merging andinverting of screens, 'impossible' border effects, five soundgenerators (simulation of whistles,horns,bells,laser zaps,etc ),a screen interrogator (useful for finding what is where on ascreen, say for detecting collisions in an arcade game) and sovery much more..... Any of these routines incorporated in yourown programs could make you into an overnight machine codearcade/adventure game programmer, with the colossal speed of Z80machine code at your disposal. Yes, Supercode 3.5 could wellrepay your investment hundreds or thousands of times over. Clearly, Supercode 3.5 is in a class of its own, with over FOURTIMES AS MANY ROUTINES AS ANY OF ITS CURRENTLY AVAILABLECOMPETITORS. It incorporates many features never previouslyavailable to home microcomputer users.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Freddy A. Vachha", "publishers": "CP Software", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150507-supercode-3\n"}