{"altername_name": [], "name": "Tai-Pan", "overview": "The year is 1841 . . . The traders of Britain, Europe and America are sailing the waters of east in search of their fortunes. Twenty years earlier the Emperor of China had decreed that the purchase of China's goods could only be paid with silver bullion. The demand for Tea, Silk and Jade was causing a massive balance of trade deficit almost bankrupting the Trading Nations. Then a lone ship \"The Vagrant Star\" under the construction of The East India Company sailed to Canton with a cargo of illicit contraband. The Chinese traders bought the cargo and paid for it in silver bullion. A way had been found to reduce the deficit. Over the twenty years the trade in contraband grew so much that the revenue from its sale outstripped the need for silver bullion to buy legitimate goods. Trade was once more balanced. The independent traders began to amass great fortunes and fleets of ships and the leader formed their own trading companies and began to monopolise the trade. The chinese named these men Tai-Pan (Supreme Leaders) and the greates of these was THE TAI-PAN. The waters of the China seas were hostile, with both weather and pirates taking their toll of the traders ship and profits. The weather held its own dangers; at certain times of the year TAI-FUNG (Supreme Winds), known to the traders as Typhoons became terror incarnate. There was a little or no escape form the raging winds, the driving rain and waves in excess of hundred feet. Ships were thrown off course, battered to pieces on the merciless, hazardous coastline or just swept under, never to be seen again. As trade between the many ports in the China seas was increasing all the time, the merchants used the natives and their towns as safe havens from the terrible storms and scondary trading posts between Europe and the Far East. . . Now the stage is set for you to make your fortune and become the Merchant Prince . . . THE TAI-PAN.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Sentient Software", "publishers": "Ocean Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53895-tai-pan\n"}