{"altername_name": [], "name": "Techno Cop", "overview": "A dangerous crime stopping adventure... You're a Technocop, a member of the most elite crime fighting force in the country called the ENFORCERS. Your mission is to capture, at any cost, ruthless criminals who paralyse the city unless you stop them. Before you start on your journey you are equipped with the latest crime fighting equipment. At your disposal are a computer wrist watch, a high power criminal radar locator, a snare net gun, and a .88 magnum pistol and you will be driving the force's newest high speed pursuit-and-destroy vehicle - the VMAX twin turbo interceptor. You're on your way to thwart the operations of a sinister organised crime empire known throughout the world as Death on Arrival (D.O.A.). Speed down treacherous highways, encountering attacking D.O.A. cars. Use the extensive weaponry built into your car to destroy them. Depend on your criminal locator to tell you there is a crime in progress, giving you the time needed to arrive at the scene in order to apprehend a vicious criminal. Rush to the scene to make it, but don't lose control of the car and avoid getting hit by attacking D.O.A cars! Once there your crime computer shows you the face of a wanted D.O.A. criminal on the screen. Your assignment, as you leave your car to enter the building where the criminal was last reported seen, is to capture him dead or alive as instructed by the crime computer. Using your criminal radar locator and computer wrist watch, you carefully search through a maze of dilapidated interiors of the building to find the culprit. Just getting around in the building is tough enough, with broken floors to fall through if careless. Worse yet, D.O.A. thugs abound, eager to wreak havoc on your search. Be careful! Once you've successfully completed that assignment, get back into your VMAX and drive on to your next assignment.", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Gray Matter", "publishers": "Gremlin Graphics Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82780-techno-cop\n"}