{"altername_name": [], "name": "Terrahawks (2014)", "overview": "Not to be confused with the 1984 game by CRL, this is an unofficial conversion of the old Philips VideoPac G7000 game of the same name (which was also released on the Odyssey2 as Attack of the Timelord). It was developed and released by Gary James in 2014. Game description: The player has just attracted the attention of Spyrus the Deathless, the Timelord of Chaos, and his only defense is his Time Machine's laser cannon. The Timelord will now send his fleet of Time Ships to destroy the player. In this space shooter the player controls the Time Machine horizontally with the directional stick and shoots its laser with the action button. The Timelord's Time Ships have four kinds of weapons to assault the player, and they will be introduced in the game's first four levels. In the first level, the Time Ships will shoot missiles, which travel in straight lines toward the bottom of the screen. In the second level, the fleet will also use antimatter mines, which will follow the player's Time Machine movements. In the third level, the fleet will also use annihilators, weapons that will go straight to the bottom of the screen, and then try to hit the player from the sides. In the fourth level, the Timelord will also send Nucleonic Time killers, robot-piloted destroyers which can anticipate human actions. The game has 256 stages of progressively increasing difficulty, with faster and better armed enemies. Each level is beaten after all Time Ships are destroyed. The player scores 2 points for each missile destroyed, 4 points for each antimatter mine, 5 points for each Time Ship, 8 points for each annihilator and 16 points for each Time killer destroyed. The Timelord appears at the start of each level, but his transmission can be jammed by starting the game pressing 0 (zero). This way he'll not reappear each time the player destroys a fleet of his Time Ships.", "platform": "Sinclair ZX Spectrum", "release_date": "2014", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Gary James", "publishers": "Self-Published", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163427-terrahawks-2014\n"}