{"altername_name": [], "name": "Terrorpods", "overview": "Terrorpods is a 1987 shooting game with simple business simulation by Psygnosis. Originally developed for the Amiga and Atari ST, it was later ported to the Commodore 64, ZX Spectrum, Amstrad CPC and MSX. It casts the player as an industrial spy in a science fiction future, assigned to halt an evil Empire's production of fearsome war machines called Terrorpods. To win the game, the player must manage colonies with specialised industries to produce a Terrorpod of their own, while fighting off enemy forces like in a traditional shooting game. The appearance of the Terrorpods was conceived from a rejected design by Psygnosis cover artist Roger Dean for the Martian fighters in Jeff Wayne's Musical Version of The War of the Worlds The player views the action in Terrorpods from the cockpit of his DSV (Defence Strategy Vehicle), which consumes fuel as it travels around the game world. On the world are ten colonies, which the player must defend and trade minerals with. The enemy forces comprise destructible Terrorpods and Spoilers roaming the world, and an indestructible mothership which hovers overhead and periodically shoots at the player. The player's prime objective is to set up resource trading between the ten colonies, building up their mineral resources so they can each build one-tenth of a Terrorpod. There are five minerals: fuel, \"detonite\", \"quanza\", \"zenite\" and \"aluma\". The former four are used for fuel and weapons, and the latter is required to build Terrorpod parts. Colonies tend to specialise in the exportation of a single mineral, which the player can buy for cheap. To profit, the player must sell the cheaply bought resources to another colony. To contact a colony for trading, the player must dispatch his \"trading drover\" vehicle or drive there in the DSV. The drover is useful because, unlike the DSV, it does not consume fuel when travelling. Spoilers steal minerals from colonies, and can be shot down with a phaser cannon which consumes very little fuel. Terrorpods will attack colonies, and can be repelled but not destroyed with the phaser. To destroy the Terrorpods, the player must use missiles, which require precious detonite to work. Once the player has taken aim at a Terrorpod, the lines making up the crosshair will shift around for a few seconds, and the player must realign them for a successful hit. If a colony has been destroyed by a Terrorpod, the player can repair it with their mineral-consuming energy beam. The game ends when the player has gathered all the parts to build a Terrorpod.", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "", "developers": "Melbourne House", "publishers": "Melbourne House", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93869-terrorpods\n"}