{"altername_name": ["That's the spirit"], "name": "That's the Spirit", "overview": "An early adventure game published by The Edge for the ZX Spectrum that was written by Simon Lipowicz and Andrew Blazdell. The year is 1996, and the Government has gone too far. Since the formation of the World Council the people had had to put up with a lot, but it really was going too far to rename every city in the world. I mean, it may not have been too bad if some bright spark hadn't noticed the fact that most cities were beginning to look the same - and like New York in particular. But to then decide to call every city \"New York\"? Hum, that was weird. The government explained in a 40-page booklet the advantages of this move, about how conversation would be simplified (as in, \"Hi! Where you going?\" \"New York!\" \"Well, that's great, so am I. Let's go together.\") Road sign posting was greatly clarified, true, and rumour had it that both Birmingham and London were now almost easy to negotiate in a car. And there were philosophical connotations too; for now New York was just another way of saying \"everything\" or \"anywhere\", which an appendix to the Government's 40-page booklet described as a major step forward in world unity and peace. It also solved approximately 42 other problems that no one could remember anyway. But now things had gone too far. It had been called the \"second prohibition\". The Government had decided on a strictly \"no spirits\" rule in every New York world wide. This, as you can imagine, has caused great problems for us, the city law enforcers - we have enough difficulty trying to grasp the concept, let alone the offenders. Some of use blame the Canadians for even mentioning the possibility that Norway would win the song contest - they've won the global New York song contest every year since. So here I am, a new kind of Spirit chaser in what some reckon was the original New York. Inflation has wreaked havoc, and rumor has it that it just materialized and is held up with its lady on Liberty Island. This could be bad news, the philosophical connotations hardly being touched upon in the Government's 40-page report; New York is in danger and as we are well aware New York is now all we've got ... Shouldn't be too much trouble on the streets these days, nothing substantial anyway. Maybe a few rogue grannies who escaped the age round-up a few years back. And maybe a few break-dancers, discarded nuclear generators, unused micro computers ... you know, the usual stuff. I'd feel a lot surer of my task if I could remember where I'd left my Electronic Detector of Ghostly Entities ... that'd fry the little creeps.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "The Edge", "publishers": "The Edge", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112759-thats-the-spirit\n"}