{"altername_name": [], "name": "The Warlock's Treasure", "overview": "The Evil C.Snicliar, warlock from Cambridge has just died from electrocution at the wheel of his car. His treasure can be found, in the form of gold and shares, scattered about his three story castle (with basement). Clues to a four digit number may also be found which, when used in the right spot, can give you access to the warlock's treasure chest. The aim of the game is to search the castle, find the clues, and put them together in the right place to win the treasure chest. You start the game on the ground floor of the castle, with a map showing your position in the bottom right. The area is split into 6x6 squares with 4 rooms occupying the corners of the level and corridors connecting them. One of the squares contains a staircase which allows you to move between floors. The square that you occupy may be searched, and this may uncover treasure (gold or shares), a key (needed to open some doors), a lamp (needed to look at some dark squares) or a trap which may reduce your strength. Each of the rooms also contain furniture such as desks, chairs and statues. Some of these objects, such as clocks, pianos and bookcases, may also be opened to reveal further treasure, traps, or occasionally a hint. Monsters will be encountered from time to time. In the main house, they will not be found unless you activate a trap which wakes them up. If you descend the stairs to the cellar (which is like one big room filled with objects), then they will appear here and throughout the rest of the house. When encountering a monster, you may retreat, or try to attack the monster with a number of punches. Hitting the monster and being hit by one will reduce your strength from an initial value of 100. If your strength reaches zero, then you lose the game. The game has three difficulty modes corresponding to different strength monsters. There are four hints that need to be found, each of which is the digit of a pass-code. In your searches, you will eventually find where to combine the hints. If you enter the wrong code here, you will lose the game. But after entering the correct numbers in order, you have one final challenge. This is basically a game of Mastermind, where you must guess another 4 digit number within a small number of attempts. After each attempt, your are given feedback about the number of correct digits and correct digits with the correct position. Successfully guessing the code will win you the treasure chest and the game.", "platform": "Sinclair ZX Spectrum", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153861-the-warlocks-treasure\n"}