{"altername_name": [], "name": "The Sentinel", "overview": "The Sentinel, released in the United States as The Sentry, is a puzzle video game created by Geoff Crammond, published by Firebird in 1986 for the BBC Micro and converted to the C64 (by Crammond himself), Amstrad CPC (with a cross-compiler written by Crammond), ZX Spectrum (by Mike Follin), Atari ST, Amiga (both by Steve Bak) and PC (by Mark Roll). It was among the first games to feature solid-filled 3D computer graphics on home computers. While it ran acceptably fast on 16-bit computers, it was slow on 8-bit machines such as the C64, where the next view took up to three seconds to be precomputed. Despite this, the game retained a dedicated base of fans, some of whom were able to modify their computers to enjoy it better (for example, by using a CMD SuperCPU in a standard 1-MHz 6502 Commodore 64 to achieve CPU clock speeds of 20 MHz). The game itself can be best described as an \"energy management\" game. It has a first person point of view and features ten thousand playfields. Its uniqueness caused it to be labelled \"the first virtual reality game\". The PC port supported VGA graphics and incremental lighting. This version, however, has very poor audio capabilities, since it can only use the PC speaker. The Amiga port features a sampled soundtrack by David Whittaker. A preview of a nonexistent sequel called Monolith appeared in 1995 in the Italian video game magazine The Games Machine as an April Fool's Day prank. In 1998, the real sequel called Sentinel Returns was released for the PC and PlayStation; a freeware unofficial Sentinel clone called Sentry was also made available for PC the same year. In 2006, two more unofficial clones (Zenith and Sentinel) were released.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Software Creations", "publishers": "Firebird Software", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.45", "wikipedia": "https://en.wikipedia.org/wiki/The_Sentinel_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53427-the-sentinel\n"}