{"altername_name": [], "name": "The Prayer of the Warrior", "overview": "Limited to 80 copies and exclusively available through a Spanish crowdfunding platform, this is the first official release of The Prayer of the Warrior, a game made available on a cassette tape with a box and a colour manual. The original game was made in 1991/1992 for ZX Spectrum, Amstrad CPC and PC to be published by Zigurat, but was eventually never released. While since 2003 both the Spectrum and CPC versions have been recovered and improved by the community, this ZX Spectrum release in Spanish is the only official version of the game made available with the help of the original authors. Even though it has no music and has a number of known bugs it is released exactly in the same state it was meant to be published in the 90s, as the original authors did not want to interfere with the original choices and design. In this 2D fantasy game the player controls a warrior who is humanity's last hope against the army of the evil king Arihman who has brought darkness to the world. The game is divided into two chapters (El bosque de Aqueron and La morada de Arihman) with an intro and an outro. The character is guided through a game world of single-screen rooms that are connected horizontally and vertically offering a large amount of free exploration. The warrior starts with three lives and there is a health bar as he can take multiple hits. He navigates platforms, can jump and attacks enemies with an axe. Objects in the environment can be destroyed and there are many hazards and traps such as spikes suddenly appearing. Enemies often keep respawning endlessly without a means to stop them permanently. Some items can be picked up to restore health. A chapter ends with a boss but in the first chapter to face it a large number of vases need to be destroyed. This builds up the image of a vase in the bottom left side of the screen and once all vases have been destroyed and the image is complete, a talisman appears in the inventory and the boss can be faced to end the stage. The second chapter has a different environment, palette and gameplay. There are other items to collect and a torch is used as often only small parts of the environment can be lightened while the rest of the screen remains dark.", "platform": "Sinclair ZX Spectrum", "release_date": "1992", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Zigurat Software S.L.", "publishers": "Zigurat Software S.L.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151563-the-prayer-of-the-warrior\n"}