{"altername_name": [], "name": "The Custard Kid", "overview": "The Custard Kid starts in the main corridor on the first floor. His objective is to locate the 12 custard recipes. These are spread throughout the custard factory and are in different locations each game. Each of these recipe rooms depicts a scene from the factory. To succeed in his quest he should stock up with food and custard detectors. Food is essential to increment the milk level. This milk level decreases with time and upon contact with any 'nasties': including the dreaded 'Custard Monsters'. Custard detectors, once activated, act like 'Geiger Counters', beating more quickly the closer 'KID' gets to a recipe. They have a limited lifespan - so use them carefully! Detectors and food are located in magenta (and occasionally cyan) rooms. These rooms are entered via the same coloured door and require a key. Fortunately magenta keys are liberally spread throughout the main corridors and 'KID' should have no trouble finding some. He must watch out for the 'Custard Monsters' and Guards which lurk in many of the chests. If they catch 'KID' 'Custard Monsters' will wear him out: wereas the Guard will send 'KID' into 'Custardy'. If you are lucky 'KID' may find some money with which to bribe the Guard, or spoons and forks to turn the Monsters into jelly or ice cream (a really satisfying experience). Having stocked up with food and detectors 'KID' should venture from the yellow to a green corridor (via a green door) and activate a detector. With a bit of luck he will soon locate a recipe room. This may require him going into a white corridor (via a white door) or through an intermediate room. When 'KID' has found all the recipes on the first floor he should locate a stairway up to the next level and repeat the process until all 12 are found. The limit of 16 items that 'KID' may carry will require some strategic planning. He will also find that the factory is very large and either a good memory or mapping is required. The game ends when all 12 recipes are found or when the milk level reaches zero. The milk level decreases with time or upon contact with any moving object.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "", "developers": "", "publishers": "New Generation Software", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102580-the-custard-kid\n"}