{"altername_name": [], "name": "The Sandman Cometh", "overview": "THE SANDMAN COMETH Or rather he’s here, if you’ve bought the program. Most forewards begin by telling you that you’ve Just bought the biggest and best piece of software ever written. Well I reckon this game’s pretty neat, but I’m biased. I’m one of the guys that wrote it! This is an “adventure” type game, but its very different from any other adventure you’re ever likely to see. Despite a very corny line in humour at some points, the theme has a serious side. Not so much a computer game, more a total philosophy! The adventure takes you through a series of dream sequences each containing clues and logic puzzles. It has a tendency to ‘tighten up’ on you, by which I mean that the game starts to get harder as you progress. The object is to locate the Hourglass of Infinity, and by so doing conquer your dream. It took five of us over a year to get this together, and we’ve tried to make it as pleasant to use as possible. After all games should be fun, even if they may be difficult. We’ve laid down some amazing surprises, so be prepared for anything. Above all else, the message of the program is to keep an open mind about everything and remember that anything may be important. There is a competition in the program. The prize is a weekend for two in Paris. (The kind of city dreams are made of.) More details are given further on in this booklet. The Sandman Cometh was conceived on the principle that our dreams are a method for sorting our previous experiences into perspective and for setting ourselves up to handle our future ones. The substance of those dreams is the very fabric of childhood, of learning, of exploration, of our hopes, fears and wishes. Be master of your dreams and .....Oh, what the hell, just run the program, you’ll get the idea!", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Star Dreams", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148496-the-sandman-cometh\n"}