{"altername_name": ["La Armadura Sagrada de Antiriad", "Antiriad"], "name": "The Sacred Armour of Antiriad", "overview": "The Sacred Armour of Antiriad is an action game published by Palace Software in September 1986 for Amstrad CPC, Commodore 64 DOS, TRS-80 and ZX Spectrum. In North America, the game was published by Epyx as Rad Warrior. The original game came with a 16-page comic book created by graphic artist Daniel Malone. The game is notable for being one of the earliest examples of the Metroidvania genre, being developed without knowledge of and concurrently with Metroid. The Sacred Armour of Antiriad is a mixture of platform and maze game. The player controls Tal who, at the start, is simply a man dressed in a loincloth with thrown rocks as his only weapon. Later, he can find the legendary \"Antiriad\" armour and wear it to activate his status panel at the bottom of the screen which shows both Tal and the suit's strength, his remaining lives and in-game messages among other things. The game-environment is full of dangerous creatures and the minions of the mysterious overlords. Tal can defend himself from these hostile beings by throwing rocks at them when out of the suit and by using the suits beam-weapon capabilities once he has located and installed the necessary equipment to the Antiriad armour. Tal also needs to find and collect additions to the armour in order to allow it to fly, shoot etc. Tal can use the suit to explore the game area but will occasionally need to leave it to collect power re-charges for the suit, should it come under too-much attack (the suit cannot be destroyed but its power can be depleted). In 2086, civilization destroys itself in a nuclear Armageddon, as two factions who both develop an anti-radiation battlesuit completely immune to conventional weapons go to war against each other when diplomatic peace talks break down. In the following millennia, the survivors develop into a hardy but peaceful race, living a quiet agricultural existence. One day, mysterious alien forces emerge from an old volcano containing a prewar military base and attack, quickly conquering and enslaving the new breed of humans, and forcing the populace to work in mines. Many rebel against the mysterious overlords and one of these rebels, Tal, is instructed by his elders to seek-out a legendary armoured suit - the Sacred Armour of Antiriad (the last word being a corruption of \"anti-radiation\"), which is in fact one of the prewar battlesuits whose development originally instigated the diplomatic crisis that started the nuclear war. This armour is rumoured to render the wearer impervious to attack and, with its help, Tal hopes to defeat and overthrow the alien rulers of Earth. However, the armour requires other equipment to be added to it in order to make it function fully. These include anti-gravity boots, particle negator, pulsar beam, and implosion mine. The last add-on is the most important as it is the one needed to destroy the volcano the enemy uses as its base.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Palace Software", "publishers": "Hi-Tec Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/The_Sacred_Armour_of_Antiriad", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53434-the-sacred-armour-of-antiriad\n"}