{"altername_name": [], "name": "The Castle", "overview": "For your nerve in entering his domain, a wizard condemns you to remain there forever, unless you can gather six treasures which have been hidden. The treasures must be put in a certain unstated room. As the wine begins to clear from your brain you start to see that it might not have been such a wise thing to do. All that bragging about your exploits in the Gr'n Xanth wars would be the death of you one day - and from the look of this place that time might be right now! \"Easy\", you'd said, \"All i need are my brains and a lift up to the castle. I'm more than a match for your fairy stories. All those stories about travelers who have never returned - hah! If there is any treasure to be found then I'm the man to do it\". The locals had muttered into their mugs about \"fools rush in...\", which had got your temper up to the extent that you made your rash bet. Of course you hadn't really meant that they should take you up on it right there and then, but of course there will always be some fool who just happens to have a coach and horses ready and waiting round the corner... You look round the dismal throne room and shake your head in disbelief - the dank smell of the dripping stone walls, the slime on the floor that surrounds the pools of water has a peculiar sheen to it - almost as if it were trying to move towards the heat of your body. You remember how no amount of whipping would drive the horses any closer than a mile to the castle and how you'd had to walk the remaining distance yourself. You jump as a wisp of mist curves round the door to the east. It curves and moves almost as if alive, and seems to beckon you towards it. From the distant clock tower you can hear the bell tolling eleven times. One hour to go before the witching hour and you're alone (or are you?) in the castle. The mist slowly starts to get thicker. Still, you've been in worse scrapes than this before now. You look around again and spot a chest on the other side of the room. You move over towards it - after all someone might have been decent enough to leave a bottle of something - and from the looks of things, you're going to need a good stiff drink over the next few hours...", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Chris Cannon", "publishers": "Bug-Byte Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122227-the-castle\n"}