{"altername_name": [], "name": "The Fourth Protocol", "overview": "The Fourth Protocol is an interactive fiction computer game based on Frederick Forsyth's 1984 spy novel The Fourth Protocol. The detective-style gameplay resembles contemporary menu-driven adventures such as The Vera Cruz Affair, and later titles such as Yes, Prime Minister and Floor 13. The game was released in 1985 by Hutchinson Computer Publishing, a subsidiary of the publishing house Hutchinson. It was designed by John Lambshead and Gordon Paterson, and the programming was credited to the Electronic Pencil Company Ltd. The game was released for the ZX Spectrum in July 1985, with the Commodore 64 release following one month later, and the Amstrad CPC conversion in 1986. The game was split into three parts, and large sections of the programming were outsourced to others: Andrew Glaister (program conversion Spectrum, parts one and two), Dave Jones (programming Spectrum, part three), Ray Owen (graphics Spectrum, part three) and John Gibbons (programming C64, part three). The IBM PC version was developed for the Electronic Pencil company, by a developer named Brian Mallett. The PC version was written in 8086 assembler and used CGA graphics in 4 colour mode. The PC version was ported from the Z80 and 6502 versions. The PC version did not use DOS, but booted up from its own floppy disk. The game comprises three sections - The NATO Documents, The Bomb and The SAS Assault. In order to get into the last two, the player must solve a riddle which is derived in the previous section. Macintosh-like icons were used to assign watchers and navigate, and finally text-based interaction was in the third section.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Electronic Pencil Company Ltd", "publishers": "Hutchinson Computer Publishing", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/The_Fourth_Protocol_(video_game)", "video_link": "https://www.youtube.com/watch?v=Fs-sJiMokKg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73084-the-fourth-protocol\n"}