{"altername_name": [], "name": "The Journey", "overview": "\"THE JOURNEY\" is a real-time text adventure with graphics, in which your guest is to seek out the legendary WHITE SHIP of the ELVES and be carried to a distant land where your true destiny as an adventurer may be fulfilled. But be warned the world of \"THE JOURNEY is full of great danger and its inhabitants need to be handled with care! On your journey through the lands of the BLACK WARLOCK and beyond. you will meet many creatures. Some of these, like yourself, have their own lives to lead and are free to roam the adventure world. They are capable of performing all the actions that you can perform more, or less, according to their own individual characteristics. They may be friendly to you, indifferent, or decidedly hostile-and this will often depend on how you conduct yourself. You should know that unless you make the right friends, you cannot hope to complete the adventure. Some of them for example, may have powers that you don't possess. but will be unwilling to help unless you have first won their respect. Similarly, they will talk to you only if they like you and what they say may be of value ! You will also encounter the WARLOCK'S guardians. These creatures have but one aim to guard the WARLOCK and his lands fiercely. They may guard routes. mysterious treasures, or magical objects - but you will discover this only after disposing of them in a suitable manner! It is up to you to make the correct deductions about the objects you find, the places you visit and the people you meet. in order to complete the quest. In each location you will be presented with description of the place, objects, characters present. and the permitted exit routes. (Sometimes this will be preceded by a graphic illustration this may be cleared by pressing any key.) At the bottom of the screen the question \"WHAT NOW!\" will be displayed, inviting you to participate. After about 20 seconds (unless you have begun to type an instruction), this will be withdrawn briefly while the other characters are each given the option of performing some action. Notice that most of the time you will be unaware of what they have done - unless they are in the same location as you-but you will of course have to deal with the consequences! As long as \"WHAT NOW?\" is displayed, you are free to type in your instructions, which appear in lower case letters at the bottom of the screen. Pressing \"ENTER\" will result in your instructions being carried out, after which the characters will take their turn. If then, a 20 second interval has passed, they get another go! To pause without any interaction or action taking place, type any letter when indicated by the prompt \"WHAT NOW\" and do not enter. ENTERING COMMANDS The solution to \"THE JOURNEY\" depends on your ability to learn how to survive in its world, and to make the correct deductions about the situations you encounter. Guessing the precise vocabulary used in the program plays no part in this, and full list of recognized commands is given below. Nevertheless, there is some flexibility in the verbs: \"attack\", \"kill\", \"hit\", etc. will all be understood and interpreted as \"fight\", for example. If you find yourself persistently entering commands which are not in the list, you may be confident that you are on the wrong track!", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Temptation Software", "publishers": "Temptation Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168065-the-journey\n"}