{"altername_name": ["El Jugador de Ajedrez", "The Chessplayer"], "name": "The Chess Player", "overview": "The Earth hung in the void, turning on its axis, basking in the sun. Thus far in its life the Earth had suffered no major discomforts; the odd Ice Age or two, pin pricks here and there from Man's bombs. When it was still young it remembered the near miss it had with a comet and when still younger could vaguely recall the days before the moon drifted in from the depths of space to join in a dance with Earth. Life was good, and providing Man was careful the Earth looked forward to a long, peaceful middle age. This golden age for the Earth unfortunately ended yesterday. Some murky distant planet orbiting an ancient sun in a forgotten backwater of the Universe had given birth to a supremely malevolent and extremely intelligent Cyborg: The Chess Player. Evil beings abound in the Universe, as indeed do good, but most evil beings are content to dominate the weaker by conventional means: bombs, plagues, micro-wave ovens and so on. The Guardians of Right throughout the Universe can generally cope with this, they know where they stand, the subjugated people know who's who and what's what and get on with digging out the Uranium deposits. The Chess Player, however, is another kettle of octopi entirely. Worse than any average Evil Being, he is truly nasty and unpleasant. The Chess Player chooses to toy with planets before destroying them; playing chess with the race he wishes to conquer. And now The Chess Player is hanging just above the thick atmosphere of the Earth and snickering to himself. The Earth knows it only has a slender hope of survival and that is if the Chess Player can be beaten. The Chess Player plucks a satellite from its orbit and chews on it absent-mindedly while looking over the Earth. Then he leans forward, thrusting his head into the atmosphere and calls for a challenger in a voice which shakes the Earth. He leans back and pulls a board from Dimension X, sets it out before him then waits for a challenger to come forward ...", "platform": "Sinclair ZX Spectrum", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Martin Wren-Hilton", "publishers": "Investronica S.A.", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=osk2k5mKNk0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/55661-the-chess-player\n"}