{"altername_name": ["Los Tesoros Perdidos de Tulum"], "name": "The Lost Treasures of Tulum", "overview": "Coatlicue was revered as the mother of the gods and was represented as a woman wearing a snake skirt. She has sagging breasts, which symbolize fertility, and a necklace of hands and human hearts that represent life. Her husband was Mixcoatl. She was living on Coatepec hill, where she was doing penance, as she was in charge of sweeping. Once, while she was sweeping, a beautiful plumage fell from the sky, which she collected and placed in her bosom. When she finished sweeping, she looked for the feather she had stored, but couldn't find it. At that moment, she became pregnant from the god Huitzilopochtli (God of the Sun). That mysterious pregnancy offended her four hundred other children (the Centzon Huitznáhuac star gods) who, instigated by their sister Coyolxauhqui (goddess of the Moon), decided to kill their disgraced mother, but Huitzilopochtli, Coatlicue's newborn son; He killed his sister Moon and brothers star gods, thus defending his mother's life. So far everything normal, according to Aztec legends, but our protagonist Juanín Joe Díaz, found an old parchment, when he studied in Mexico, in one of the tombs he was exploring in a city far from this valley. In this parchment a strange story was narrated telling that Coatlicue fled the Tollan-Xicocotilan valleys and it gave clues that she went and hid in the Tulum temple, which at that time was known as Zamá (which in Maya means dawn), helped by his son Sol and persecuted by the spirit of her daughter Moon. He got so impressed by this legend that he decided to follow the indications from the parchment to access the area of Tulum where apparently Coatlicue's rooms were located. Once inside he found himselft trapped, and the the only way to get out would be by taking the jewels left behind by Coatlicue, with the help of the SUN god, and avoiding the attacks of the Star Gods and the curses of the Moon Goddess. Will you be able to help Juanín Joe to escape from the Tulum temple?", "platform": "Sinclair ZX Spectrum", "release_date": "2020", "game_type": "Homebrew", "esrb": "", "developers": "", "publishers": "Retroworks", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130377-the-lost-treasures-of-tulum\n"}