{"altername_name": [], "name": "Time Out", "overview": "The game consists of killing the various enemies that appear on the screen and dodging the bombs that throw some from windows and balconies. In order to kill them you have a weapon, the which, the more you shoot, the better it will respond. You will have to endure what you can until the \"good luck\" message below, change to \"activated lightning\". At that time you will have to decide if you go to the right or the left. If you do not choose the right path, after a few screens \"bad road\" will appear and You will have to retrace your steps in search of the lightning that will transport you to another time. Pepe has finally invented the time machine, he is so happy that he jumps for joy. But it happens Notice that there is a loose screw in the cabin. Open the door and start fixing it. In that moment comes the cleaning woman who, without looking at Pepe, pushes the door with bad milk and Pepe is locked inside. The woman continues with her work, pressing without wanting a huge button red in the center of the machine. Pepe is released without control in time. Once in the west and having realized what happened to him, remember that the machine, when sending someone to over time, within ten minutes it emits a return beam to the shipping time in a 25 Kms radius. But what Pepe doesn't know is that the machine is not going well because of that screw poorly adjusted, and does not return you to your Era without first having passed through other areas in time. When you are willing to go in search of lightning, it turns out that it is discovered by some inhabitants of that time that, seeing his clothing, without a word and knowing that in the West he used to say that of \"shoot first, ask later\", they start shooting incessantly to bring him down. Less bad that Pepe is very farsighted and always carries a gun for security Citizen With that he manages to defend himself against his aggressors.", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "New Frontier S.A.", "publishers": "Zafiro Software Division", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=JVOtKjufAY8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113422-time-out\n"}