{"altername_name": ["Travel with Trashman"], "name": "Travel with... Trashman", "overview": "Trashman wants to travel the globe, but doesn't quite have all of the cash he needs. His plan is to earn enough money, by cleaning up trash at each city he visits, to eventually complete the round-trip. Travel With Trashman is a sequel to Trashman, but with very different game-play. You play as a trashman, who starts out at London with 250 pounds. At each city, he can either choose to spend money to travel to one of three nearby destinations (e.g. Madrid, Paris or Munich from London) or accept a job to collect trash in one of the country stereotype themed mini-games. These games all have a similar format: picking up trash earns Trashman money, sitting still slowly decreases money, and bumping into one of the on-screen moving obstacles may either kill him, or result in a fine, depending on the game. After travelling to a new city or completing a job, a \"news flash\" scrolls along the bottom of the screen, celebrating Trashman's arrival or his cleaning up the city. The game is finished once each of the cities has been visited and its sub-game completed. There are 14 cities in total, each (apart from London) with its own mini-game. These include: - Madrid: Collect all of the thrown roses at a bull-fight while being chased by a bull. - Paris: Catch all of the escaped frogs from around an out-door cafe. - Munich: Gather all of the empty steins in a pub as they are emptied, while avoiding waitresses. - Moscow: Pick up rubbish while avoiding Russian guards. - Jerusalem: Acquire all of the tissues dropped by visitors to the \"wailing wall\". - Benares: Take the discarded shoes of worshippers bathing in the Ganges river. - Hong Kong: Round up the rubbish as it is dropped on Chinese New Year. - Alice Springs: Snag the fleeces of some jumbucks as they're sheared by some Aussie cobbers. - Samoa: Harvest coconuts as they ripen and fall from the trees, but avoid being hit. - Chichen Itza: Dispose of the trash dumped by tourists examining the Mayan temple. - New Orleans: Secure the money thrown by the crowd at the marching musicians. - Sao Paolo: Reap rice after it is raked into the ground by farmers. - Kanyu: Avoid the witch-doctor while collecting beads thrown by the villagers.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "New Generation Software", "publishers": "New Generation Software", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78704-travel-with-trashman\n"}