{"altername_name": [], "name": "Vega Solaris", "overview": "Vega Solaris is a game programmed for ZX Spectrum computers by Carlos García Cordero and Fernando Sáenz Pérez. The game was finished in 1989, although Dinamic, the company that was going to distribute it initially, published it in the Micro Hobby magazine in its numbers 104, 105, 106 published at the end of 1986 and in its special number 5. In the end the game was unpublished and so far we have not been able to have it available. 20 years later we can enjoy it thanks to its authors, who have kindly made it available to us, Horace , who was in charge of locating them and inviting them to the MadriSX & Retro 2005 party where all the work of 'rescue' of the game of a game was done Cassette tape of the time, by Juan Pablo from SPA2 and José Manuel from El Trastero del Spectrum . The argument is simple. According to the synopsis in MicroHobby number 104, page 39: 'A recondite planet is the scene of a duel between two totally different beings: a human and an extraterrestrial. Both want to find the pieces that make up the symbol of VEGA SOLARIS. Only one can get it. ' As the text points out, the objective of the game is to complete the impossible figure (Escher style), symbol of Vega Solaris, before your opponent. The symbol of Vega Solaris is formed in turn by four other figures (also impossible) distributed in a world with several scenarios, which include a jungle, caves and a temple, and are distributed among dozens of screens. There are two characters in the search for this symbol: a human and an extraterrestrial (they should be recognized for their appearance). This is precisely one of the attractions of the game, since it can be played against another player or against the machine. As seen in the following figure, the screen is divided into two panels that correspond to each character; the left panel is that of the human and the right is that of the extraterrestrial.", "platform": "Sinclair ZX Spectrum", "release_date": "1989", "game_type": "Released", "esrb": "", "developers": "Eclipse", "publishers": "Eclipse", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104592-vega-solaris\n"}