{"altername_name": [], "name": "Volcano: The Action Game", "overview": "The object of Volcano is to escape from an erupting - well, volcano. The game is quite different because it involves many different elements across forty screens above ground and 290 below. In a sense it is a giant graphic adventure, where you control your man, guiding him around the streets of the threatened town, seeking useful objects from the buildings. Falling molten rocks are shown as red blobs which appear on the map scapes, while rivers of red lava slowly engulf the roadways, making your task increasingly difficult. Generally you must escape o reach a boat and flee the natural wrath behind you. There are several maps of the town, with an animated character which you control. There is the medieval city with its various precincts, the commercial section and shopping section; below the city there exists a maze of underground passages which are shown in wire frame 3D. Back above ground, your route to freedom is blocked by dangerous marshes and jungles, and even before leaving the city you may encounter riots and get killed. Useful objects are things like dynamite for blowing rocks out of the way or matches which will enable you to see your way underground. Food is also essential to keep up strength, which wanes rapidly. Movement control is by left/right rotation and forwards below ground, with four way movement above ground. Whilst perambulating below the surface, it is well to remember that above ground the volcano is still erupting, blocking the town's streets with debris. Volcano has a random element built into the program so that, except for the first three screens, dynamite, lava, rocks, food and ropes will rarely appear in the same place twice. Scoring is done by time alive.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Computer Magic", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "0.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104286-volcano-the-action-game\n"}