{"altername_name": [], "name": "Vradark's Sphere", "overview": "Vradark’s Sphere: exciting adventures are waiting for the hero! The ancient castle where just ruins left Became a home for the greatest evil yet The Death Messiah Vradark sits on the throne His words are poison killing everyone. The dungeon used for cherishing old kings Now keeps his power deadly for human beings. The deepest tomb hides the Sphere of all spheres That prisoned power, sins, and all his darkest fears. Let spirits rest in peace, save us from close death, Be brave enough to fight till your last breath! Take Sphere from this place so cold, Make Vradark useless with your heart of gold. Destroy his plan and pave the path to light, So we could see again the future very bright! The ancient Evil cursed the used-to-be cheerful lands and the souls of their hard-working citizens with engrossing darkness. The villainous necromancer Vradark now lives amidst the ruins of a royal castle. Somewhere in its depths, he captured the legendary Sphere that brings light and joy. Take the path of a brave sorcerer who wasn’t afraid of challenging the merciless villain. Power, bravery, and intellect will be your faithful companions in this exciting logic game! Use a magic staff to lighten your path to the lowest floors of a demolished castle. You can’t fully trust your eyes — evil Vradark alters the corridors to make you confused. Go through the randomly generated underground levels, find the hidden Sphere and return to the cursed lands. Bring back the light for good! Sneak and run, kill the monsters and seek the chests with useful loot to keep your health and mana replenished. Remember, fortune favors the bold!", "platform": "Sinclair ZX Spectrum", "release_date": "2018", "game_type": "Released", "esrb": "Not Rated", "developers": "SaNchez", "publishers": "Sanchez Crew", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166592-vradarks-sphere\n"}