{"altername_name": ["J&E 3: OTAN Alerta! & War Zone"], "name": "War Zone", "overview": "War Zone is a strategy war game for one player who must fight and defeat another army controlled by the computer over a 3 x 3 area made up of 9 x 10 grids. The area is made up of plainlands, roads, hills and woodland and affects the movements and use of each players army. Each army is made up of Artillery, Infantry and Tanks and the total number can be selected between 15 and 150 pieces. If a player manages to take over the other players home sector with no enemy troops inside, or there is a ratio of 3:1 of troops then the game is won. Each player takes it in turns to move or use as many troop pieces as they want with a choice of eight commands which are inputed with the keyboard with END used to allow the other player to make their moves. Each type of troop have different attributes, with Artillery being slow moving and used for hand to hand combat and long range firing, Infantry being fast moving and used for hand to hand combat and scouting with terrain not making any difference, and finally Tanks being slow moving and used for hand to hand combat and medium range firing. Plainlands have no effect on movement, roads increases movement, hills decreases movement but increases firing, and woodland decreases movement and there is no firing. As the troops move around the area, hand to hand combat is initiated when a troop is next to an enemy troop, firing can be used if an enemy troop is in range and there is only one shot for each troop a go, and finally an air attack can be used but only one is available per go. Also on the screen are mines which need avoiding and if any troop moves outside the area then they are shot for desertion.", "platform": "Sinclair ZX Spectrum", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Steve P. Thomas", "publishers": "CCS", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104144-war-zone\n"}