{"altername_name": ["Warlord (Interceptor Micro's)", "Warlord (Interceptor Software)", "Warlord (Interceptor Micro's)"], "name": "Warlord (Interceptor Micro's)", "overview": "Set in the middle of the first century AD. Onward and ever northward pushed the Roman legions, led by the feared Vespasian. The Celtic hillfort tribes, unprepared for this type of conflict, were conquered one by one. All resistance was pushed aside. Then, abruptly, at the Scottish border, the Roman advance faltered and was halted by the intervention of a warrior tribe, led by a powerful Northern Warlord. Every attempt to break into the Scottish heartland was met with savage opposition. Quietly and secretly, at first, the gods of both sides took a hand in the struggle, to force a conclusion. The intensity of the fighting soon escalated, as did the involvement of the gods, until such was the ferocity of the conflict, that open warfare between gods was imminent. Fearing the world's destruction from a direct confrontation the gods declared a truce and an alternative solution was agreed upon. A champion from each army would be transported, through time and space, to one of the Celtic Otherworlds. The side whose champion returned to the real world first, would be declared the victor. The Romans chose their finest centurion, the Celts their Warlord. You take the role of the Celtic Warlord. You must find the way back to the real world before the Roman, who is equally determined. Arrayed against you are many strange puzzles and creatures only dimly remembered from the Old Religion. You must be wary, the possibility of divine intervention also remains. Prepare yourself for the greatest battle of your life.", "platform": "Sinclair ZX Spectrum", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "David M. Banner", "publishers": "Interceptor Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Cm4dQ75vl3o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/121366-warlord-interceptor-micros\n"}