{"altername_name": [], "name": "Xen", "overview": "Far away in the constellation of Alpha-Centauri, the Xenon race once lived in peace. Now however, their gentle world has been invaded by the evil armies of Argon. Long ago their planet, Xen, was protected by the Xenon Space Defence Corps, but superior enemy forces have devoured its finest men and arms. Now one crack fighter, Peladus is the sole survivor of that fighting force. If the people of Xen are to avoid permanent enslavement by the Argon dictatorship he is their only hope. Swarms of enemy space craft come in to attack, some faster and more manoeuvrable than others. You have control of Peladus' fighter, which can be moved to the left and right, forwards and back. They attempt to destroy your fighter by using kamikaze tactics, flinging their craft into yours. Contact with them means a loss of one life. Your fighter has three lives, the number of lives remaining to you is registered on the right hand side of the screen. Be careful not to get caught in the blast as an enemy craft explodes, as this can take out your own fighter. Such blasts can be avoided by flying your space tighter backwards. Ten points are awarded for every enemy ship wiped out. Both ground and spaceborne forces must be defeated before your mission is accomplished. By careful aiming, using the on screen sight, the pink ground based installations of the enemy can be taken out. For each of these destroyed, 100 points are awarded. When six bases have been devastated, the tighter receives an extra life to carry on in battle. The number of bases destroyed is indicated on the left hand side of the screen. Before your mission is finally accomplished, four zones have to be liberated; the Outer Platforms, the Fields, the Desert, and the Inner Platforms. Only then can the people of Xen truly call themselves free once more.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Mark Rivers", "publishers": "Super Sparklers", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=kNBhrsEmNt4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104078-xen\n"}