{"altername_name": [], "name": "Xenon", "overview": "From the moment that Captain Xod's face appeared out of the static on the communicator, you knew he was in trouble. As the only other Federation ship in the sector you had to go to his aid. You need to fight your way through sixteen zones, collecting essential supplies for the fleet. At the end of each sector you have a chance to refuel and restock but only after you have defeated the most vicious alien you have ever seen. A strategic vertically scrolling shoot-em-up. You have the option of swapping between two very different craft, to suit the challenge facing you at the time; either a ground-based saucer or well-armed, and faster fighter aircraft. A fast-moving, thinking man's shoot-em-up. GAMEPLAY You have to negotiate four sectors, each divided into four zones. You have a choice of two craft, which you can change between at will. You have a ground craft, capable of eight-way movement, and a faster jet fighter. You need to select the appropriate craft to negotiate the obstacles facing you and be prepared to change between them rapidly. Certain of your opponents are ground-based and some are altitude. You need to be in the correct craft to shoot the alien that you are facing. Certain weapons can only be collected and used by the fighter craft. You can only use the ground craft on the ground. You cannot land on the top of buildings. You need to fly over these in the fighter. Shooting the aliens and their weapon emplacements reveals power cells. Collect these by moving over them, to give your craft extra power.", "platform": "Sinclair ZX Spectrum", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Icon Design", "publishers": "Melbourne House", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "https://en.wikipedia.org/wiki/Xenon_(video_game)", "video_link": "https://en.wikipedia.org/wiki/Xenon_(video_game)", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53847-xenon\n"}