{"altername_name": [], "name": "Yabba Dabba Doo!", "overview": "Help poor old Fred to build a home and to woo the house-loving Wilma in this multi-screen all-action arcade adventure. After all, it should be EASY to stick a few rocks together..... shouldn't it? Here's your chance to play a part in the formation of history. Help Fred build his house and win the heart of Wilma thus paving the way for Bedrock as we know it today. The first screen consists of a desolate landscape with boulders that will enable Fred to build his dream house. Smooth, round rocks are ideal building materials, whilst jagged rocks will prove a hindrance. Putting the roof in place will require a visit to Dino-Hire. Fred must also be mobile, so help him find a car so that he can venture further afield to find more rocks and hopefully run into Wilma at the same time. Watch the red heart at the corner of the screen the harder it pumps when he meets Wilma, the more chance of success he has in persuading her to become his caveperson. SLIDING SCALES - The top scale represents Fred's energy level - the more he runs the lower his energy becomes but the more he sees Wilma will increase his energy. BUILDING THE HOUSE - First clear the site by taking all flat rocks and drop them in the tip. If you place a rock in the right place on the plot a section of the house will appear. The house is finished when the chimney is put on the roof. BUILDING THE ROOF - Fred needs to hire a dinosaur with a scaled back in order to place the roof on the house but can only enter Dino-Hire when he has enough money to pay for the hire of a dinosaur. So Fred must go to work at the quarry to earn some money. A $ sign will appear on the screen when Fred has earned enough. Having completed the building of the house and provided Fred has had enough successful encounters with Wilma she will fall in love and follow him home.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "", "developers": "Taskset", "publishers": "Quicksilva", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/55901-yabba-dabba-doo\n"}