{"altername_name": [], "name": "Yie Ar Kung Fu II", "overview": "Lee Young goes through three sections of a level to face its boss. Along the way, he meets up with ninjas. The power-ups Lee can acquire are oolong tea to replenish health, and lo mein for temporary invincibility. Lee can only carry three oolong teas at a time. The game also features a two-player modem, in which Player 1 controls Lee while Player 2 has the choice to play as either Yen Pei, Lan Fang or Po Chin, making Lan Fang the first ever playable female character in a fighting game (predating Chun Li in Street Fighter II by five years). Characters: Lee Young: The main protagonist of the game. His moves mimic those of Oolong from the arcade game. His father was the star in the NES and MSX versions of Yie Ar Kung-Fu. Yen Pei: Yen Pei wears a purple robe and is also known as Emperor Yie-Gah. His red braid is so large, he uses it in similar fashion as Chain's chain whip. Lan Fang: Lan Fang wears a blue dress and has short hair. Like her predecessor, Fan, she throws steel fans at Lee. Po Chin: Po Chin is large and wears a brown outfit with a smiley face on it. He attacks with gas clouds. Wen Hu: Wen Hu wears a green outfit and a metal mask to cover his face. When he battles, Wen Hu throws his mask at his opponent as it zooms around like a mosquito. Wei Chin: Wei Chin is bald and wears green pants. He attacks with a boomerang. Mei Ling: Mei Ling has long hair and wears a red dress. Similar to the Yie Ar Kung-Fu hidden character Bishoo, Mei Ling throws daggers at Lee. Han Chen: Han Chen wears a red robe and hat that covers most of his face. When he attacks, he throws smoke bombs. His appearance is said to resemble a Chinese zombie. Li Jen: Lee's final opponent, Li Jen wears a white robe and has an uncanny resemblance to Flash Gordon's Ming the Merciless. Li Jen's area is surrounded by a thunder storm and Lee must avoid the lightning to attack Li Jen and save China.", "platform": "Sinclair ZX Spectrum", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "James Software", "publishers": "Imagine Software Ltd.", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2.58", "wikipedia": "https://en.wikipedia.org/wiki/Yie_Ar_Kung-Fu_II", "video_link": "http://www.youtube.com/watch?v=TFIAkjDp5P4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32868-yie-ar-kung-fu-ii\n"}