{"altername_name": [], "name": "Yogi Bear", "overview": "Grim tidings from Jellystone Park, folks! Yogi's little pal Boo-Boo has been bearnapped by a mean hunter, planning to make some loot by selling him to a circus. Boo-Boo is locked in a cage near the hunter's cabin... somewhere in Jellystone. Only Boo-Boo's fearless and faithful friend Yogi can save him. Step into Yogi's paws, scour Jellystone and snatch Boo-Boo from the clutches of the hunter. It won't be easy. Running around Jellystone is a tiring business and Yogi's energy is quickly sapped. The energy meter at the bottom left of the screen shows Yogi's 'go' going down. He'll need to find plenty of food along the way - especially delicious picnic baskets left lying around by careless campers. But if he finds some fishermen, he may be able to pinch a fish or three from their hooks. Yogi also loses energy fast when chased by enemies, buzzed by bees, bowled over by frogs, birds and geysers and whenever he hides from pursuers disguised as a bush (yes, seriously, a BUSH! This is a really smart bear, folks!). It's a long and tricky trail through Jellystone. Watch the Boo-Boo-ometer at the bottom of the screen. It tells how far Yogi is from his imprisoned pal. Each part of Jellystone poses different problems - rivers to jump, lakes to cross, sharp-fanged snakes, angry campers, furious fat ladies, a mean-minded moose, hot-tempered hunters and, of course, Ranger Smith who chases Yogi as a matter of principle! Yogi's too nice a bear to fight back but he may be able to lure his pursuers into trouble. Yogi's not the only one who can fall down holes or plunge into rivers and lakes! As well as being full of crazy critters, Jellystone also has some mighty strange caves. Yogi will have to use them from time to time. Trouble is, when he goes in one, you never know where he's going to come out! It may be nearer to Boo-Boo or it may be further away. Even if Yogi finds Boo-Boo, he'll have to grab the key to the cage. It's by the evil hunter's cabin and to get it Yogi has to cross some funny shaped stepping stones. If he hops on them in the wrong sequence, the hunter's bear alarm goes off and Yogi's in real trouble. How can Yogi know the right sequence? Well, luckily Boo-Boo has left a trail of toffee apples (can you believe this?!) which a clue stuck to each. As yogi collects them he builds up the clues that will tell him the right sequence of stepping stone shapes to step on. Of course, if Yogi misses some clues on the way, he'll have to use guesswork and bears aren't well known forguessing right! Time is running out for Boo-Boo. When Yogi starts his mission of mercy, it is January. When December comes, Yogi has to hibernate and Boo-Boo will never be rescued. So Yogi has to free Boo-Boo as quickly as possible and as the seasons change and hibernation gets nearer, things start looking bad for Boo-Boo.", "platform": "Sinclair ZX Spectrum", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Dalali Software Ltd", "publishers": "Piranha", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/Yogi_Bear_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/53845-yogi-bear\n"}