{"altername_name": ["Pro Pinball"], "name": "Zipper Flipper", "overview": "Zipper Flipper (originally released as Pro Pinball) is a pinball game. There is one table and two flippers. The theme for the table is 'Fruit Machine'. Around the table are pockets corresponding to symbols on a fruit machine. landing in these scores between 5 and 50 points depending on the symbol. There are also two round bumpers that score 25 points per hit. On the right of the table is a wall of coloured bricks. Whenever a ball hits this wall it knocks out a brick. Eventually enough bricks have been removed for the ball to enter the chamber beyond. This is where the 'Fruit machine' element comes into play. Within the chamber are three switches. The ball rests on one of these switches and, while it's there, the player can move one of the three reels on a fruit machine display by pressing the 'FIRE' key. These reels multiply the scores of the bonus pockets. Landing in a pocket with the same symbol as the right hand reel scores the value of that pocket. If both the right hand reel and the centre reel are the same then landing in that pocket scores 4 times the pocket value. If all three reels show the same symbol then landing in that pocket scores 9 times the pocket's value. The player gets five balls per turn, after 10,000 has been reached another ball is awarded. Flipper control is somewhat unusual. There are two flippers, both pointing towards the bottom of the screen. Using keys on the left of the keyboard causes the flippers so swing up to the left, clockwise, and keys on the right cause the flippers to swing counter clockwise.", "platform": "Sinclair ZX Spectrum", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "R.E.D. Sunshine", "publishers": "R.E.D. Sunshine", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=aRvnuJ7M_VI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115269-zipper-flipper\n"}