{"altername_name": [], "name": "6180 the moon", "overview": "6180 the moon is a puzzle platformer where you control the moon. The Sun is gone and the moon visits different planets and stars (Earth, Venus, Mercury, Sun) to find it back. There are five worlds in total with ten levels each. At certain moments the story is furthered through conversations in short sequences. To complete a level you need to move to the right over platforms to reach an exit gate. The platform mechanics remind of VVVVVV. When the moon drops off a platform through the bottom of the screen it reappears at the top. This speed increase can be used as a slingshot mechanic to cross gaps or to dodge spikes. There is an amount of gravity however. The moon can jump fairly high an when it breaks through the top, it has enough speed to reappear through the bottom at largely the same height. This curve needs to be used as well to complete puzzles. More complex levels are split up with checkpoints represented through white squares and there is an unlimited amount of allowed retries. Next to the platforms and the spikes, additional gameplay elements are introduced gradually. There are temporary blocks that can be used once to bounce and then disappear. Other blocks appear and disappear with a time interval. Small drops of light, left behind by the Sun, can be used once to perform a dodge jump in mid-air after an initial jump. After completing the main levels all of them can be replayed reversed, making a total of 100 levels. Controls are limited to three keys, to move left and right and jump, and the space bar to perform the dodge jump.", "platform": "Nintendo 3DS", "release_date": "June 29, 2017", "game_type": "Released", "esrb": "", "developers": "PokPoong Games", "publishers": "Turtle Cream", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=p1jGjAwAny0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165764-6180-the-moon\n"}