{"altername_name": ["Shingeki no Kyojin - Jinrui Saigo no Tsubasa CHAIN"], "name": "Attack on Titan: Humanity in Chains", "overview": "Based on the hit “Attack on Titan” anime and manga, players will defend the three Walls from invading Titans as a member of the elite Scout Regiment with their omni-directional mobility gear and blades. Based on the upcoming Japanese remake of an earlier Attack on Titan game, Humanity in Chains will be the first Attack on Titan game to reach North American shores, and will release exclusively on the Nintendo eShop for Nintendo 3DS in early 2015 with the original Japanese audio and English subtitles. The features for Attack on Titan: Humanity in Chains include: Story Mode: As a member of the elite Scout Regiment, defending the outer walls from the Titans will push players to their very limits to save humanity. Enhanced Titan AI behavior will sap every ounce of ability from players as they make a last stand for the human race. Familiar Characters, New Customizations: Eren Jaeger, Mikasa Ackermann and others will be familiar faces for players as they pick their favorite Scout member to defend the Walls. Several new additions will join the Scout Regiment, customizable with costumes, weapons and voices. Online Co-op Mode: Defend the outer walls with up to three friends in the all-new online co-op mode with ranking and leaderboards. Fresh Look: Updates to the UI, improvements in gameplay balance and support for the Circle Pad Pro and the C Stick on the New Nintendo 3DS XL take Humanity in Chains to the next level.", "platform": "Nintendo 3DS", "release_date": "December 5, 2013", "game_type": "Released", "esrb": "M - Mature", "developers": "Spike ChunSoft", "publishers": "Atlus", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.3", "wikipedia": "https://en.wikipedia.org/wiki/Attack_on_Titan:_Humanity_in_Chains", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73228-attack-on-titan-humanity-in-chains\n"}