{"altername_name": [], "name": "Cars 2", "overview": "Cars 2 is a racing game based on the Disney and Pixar movie. As a C.H.R.O.M.E. (Command Headquarters for Recon Operations & Motorized Espionage) agent, the player can participate in various events, using one of the many characters from the Cars franchise. The game has a mission mode, which is made of different missions accessed when the required clearance level has been reached. Clearing missions will award the points necessary to unlock higher clearance levels. The races play in a manner similar to Mario Kart games: while racing, the player can use a number of maneuvers such as drifting, jumping, driving backwards or on two wheel, as well as use a turbo using energy, or the 'In the Zone' turbo, which will be in effect as long as there is energy remaining. Some tracks allows the use of weapons (spy gadgets) to take down competitors. Such weapons include missiles, machine guns, and oil patches. The game modes, which also make up the mission mode's levels, include a regular race mode, a battle race mode that allow the use of spy gadgets, the hunter mode in which the goal is to eliminate waves of enemies, the attack mode in which a fleeing foe must be eliminated before time runs out, a survival mode in which batteries must be collected in order to avoid the game-ending satellite beam, a multiplayer battle arena mode in which the player who scores the most hits wins, and the disruptor mode, a multiplayer base-defense game. The game includes awards such as badges and new characters to unlock. It also includes an online multiplayer mode.", "platform": "Nintendo 3DS", "release_date": "November 1, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Firebrand Games", "publishers": "Disney Interactive Studios", "genres": "Racing", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Cars_2_%28video_game%29", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96634-cars-2\n"}