{"altername_name": [], "name": "Christmas Wonderland 3", "overview": "Christmas Wonderland 3 is a game which will be enjoyed year after year by all aged 5 to 105! It’s crammed full of fabulous HOG scenes, lots of truly superb puzzles for players of every ability, and Santa’s Interactive Advent Calendar. In this sensational Christmas game, Mike and Emma are in the Classroom on the last day of school when they notice an Ad about a Christmas Treasure Hunt at the Mall. They get Mom to take them to the Mall after school and lo and behold, they find the 5 Golden Keys which wins them 1st Prize, the trip of a Lifetime to go to the North Pole. They meet Santa Claus in his Grotto in the Mall Atrium, then they use the Golden Keys to open the Magic door and are whisked away on an amazing Train Journey on board the Wonderland Express. They get to the North Pole and have to work out how to get from the Town to Santa’s Workshop and Stables. The Kids find a map on a notice board near to a huge Christmas Tree and see that they need to take the Ski lift to get to Santa’s place which is on a hill nearby. When they get to his house, Santa is rocking in his chair on the porch. He takes them to the workshop where they meet his helpers who are all hard at work making Toys and wrapping presents. Santa takes the Kids to his house and gives them a shopping list of last minute things which are needed from the Town. They meet Rudolph and other reindeer in the Stables then ride a Skidoo down to the Town. On the way, they stop by a Princess’s magnificent Ice Palace, Next, they pass by a Church with a Nativity display on the snow and on the street there are Kids playing and skating on a Frozen pond. They do some shopping at a festive Christmas Market then go to the Post Office to get some sacks full of mail for Santa. They take everything back up to Santa and by now it’s Christmas Eve. The reindeer need feeding and then they are hitched up to the harness while the Sleigh is getting loaded with presents to take all over the World. The Kids fly on Santa’s Sleigh over roof tops and towns and eventually fly into the kids’ neighborhood where they land on the roof of the house of one of their friends. The next stop is the Kids’ house, so Mike and Emma say goodbye to Santa, tiptoe upstairs, while Santa comes down the chimney into the living room as usual. Soon it’s Christmas morning and before the kids go to see if Santa has left anything nice for them, there is a BIG... BIG... SURPRISE waiting!", "platform": "Nintendo 3DS", "release_date": "November 21, 2013", "game_type": "Released", "esrb": "E - Everyone", "developers": "Virtual Playground", "publishers": "Microvalue", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165794-christmas-wonderland-3\n"}