{"altername_name": [], "name": "Color Zen", "overview": "Color Zen is a puzzle game about combining items to turn the game area into a single colour. A typical level is filled with objects with different colours. The pulsating ones can be dragged into another one to combine them, filling all the available background with that colour. By doing that with multiple objects the entire area can be cleared. There is a catch however as the final colour needs to be the one of the area's border, already shown at the start of the game. That way, the challenge is focused on combining the colours in the correct order. Later levels add additional game elements. Dotted shapes can be tapped to toggle a shield, preventing them from being affected by a colour fill. There are also black shapes. When an object is dragged into a black one, it disappears, without spreading its colour. As the objects can be flung with a swipe next to dragging them, the player also has to watch out not to bump into a black objects accidentally. Certain levels have spikes that are used to make a shape disappear. Unlike a black object, a single spike can be used multiple times. The mobile game is free-to-play with additional levels as in-app purchases. The complete game offers five large themes, split up into multiple chapters and levels unlocked gradually. Each theme has slight changes to the visuals or the gameplay. Next to Classic, Seasons introduces levels with seasonal colours. The Reflection levels have a mirror design where the player's action are mirrored with another object on the other side of the screen. The two other themes are Serenity and Nature. There are 460 levels in total. For the mobile version not all of them were available at the original launch (only Classic and Nature), but released in packs afterwards (Serenity, Reflection and Season respectively).", "platform": "Nintendo 3DS", "release_date": "June 5, 2014", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98896-color-zen\n"}