{"altername_name": ["Disney Magic Castle 2", "Disney Magic Castle - My Happy Life 2"], "name": "Disney Magical World 2", "overview": "Live your dream life in Disney Magical World 2 alongside fan-favorite Disney characters! Adventure with Elsa and Olaf from Disney Frozen, dance with Disney Princesses, soar with Mickey in Magical Dream parades, and more, while snapping photos to share your memories. The magic is in your hands, so use your wand to solve a ghostly mystery along the way! Explore six different Disney-themed worlds from classics like Disney Frozen, Disney The Little Mermaid, and Walt Disney Lilo & Stitch. You can harvest a field with Winnie the Pooh, fish with Donald Duck, mine with the Seven Dwarves, explore ghost-filled dungeons for treasures, and more! On your journey, you’ll discover the magical town of Castleton, where you’ll live amongst classic Disney characters. Shop with Daisy, Minnie, and others to build and buy hundreds of Disney-themed items. You can customize amazing outfits and even decorate your dream home and Café. Ready to make a memory? Then dance at the Enchanted Ball or throw a Café Party with your new Disney friends! Live the life of your dreams on an adventure in the world of beloved Disney characters Discover more than 100 Disney characters! Explore 6 connected Disney-themed worlds from classics like Disney Frozen, Disney The Little Mermaid, and Walt Disney Lilo & Stitch Snap photos anytime to collect and share memories of your Disney life and adventure! Harvest a field with Winnie the Pooh, explore ghost filled dungeons for treasures, fish with Donald Duck, mine with the Seven Dwarves, and more to find materials to create thousands of amazing items! Invite Disney Princesses to the Enchanted Ball and dance with them Experience Magical Dreams—special parade-like Disney-inspired events Customize your look from hundreds of Disney-themed outfits Decorate your dream home and Café with hundreds of different items and furniture Invite Disney friends to be part of your Café Party dance shows Celebrate birthdays and seasonal events with your Disney friends", "platform": "Nintendo 3DS", "release_date": "October 14, 2016", "game_type": "Released", "esrb": "E - Everyone", "developers": "Bandai Namco Games", "publishers": "Nintendo of America", "genres": "", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Disney_Magical_World_2", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/97073-disney-magical-world-2\n"}