{"altername_name": [], "name": "Dragon Ball Heroes: Ultimate Mission", "overview": "Dragon Ball Heroes: Ultimate Mission is a card-based fighting game that is a portable-port of the arcade game Dragon Ball Heroes. It was released in Japan for the Nintendo 3DS handheld gaming console on February 28, 2013. Its sequel, Dragon Ball Heroes: Ultimate Mission 2, was released in 2014. The game recreates the interface of the Dragon Ball Heroes arcade game via the touch panel. The player assembles a deck of five cards for battles. As the player uses the touch stylus to create a card formation on the bottom screen, the battle unfolds on the top screen. Actions, such as the Charge Impact, are done so that the player can intuitively do them with their hands on the portable device. The game includes a scouter function, which uses the 3DS' camera to take a picture of someone's face in order to check their power. This allows the player to earn Zeni and other items. Scan someone with a high power level and Great Ape Vegeta will appear as a boss fight, and tag up with friends to take him on. Scanning special QR codes allows the player to fight special bosses, such as Beerus or Super Saiyan God Goku from the 2013 movie Dragon Ball Z: Battle of Gods. In the story mode, the player moves around what is called the Ultimate Map and experiences the story from the Saiyan Saga up through Dragon Ball GT, with the most famous scenes from the series recreated for the game. By completing missions, more cards are obtained in the game.", "platform": "Nintendo 3DS", "release_date": "February 28, 2013", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai Namco Entertainment", "publishers": "Bandai Namco Games", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.88", "wikipedia": "https://dragonball.fandom.com/wiki/Dragon_Ball_Heroes:_Ultimate_Mission", "video_link": "https://www.youtube.com/watch?v=qjPqg_uF5WY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73987-dragon-ball-heroes-ultimate-mission\n"}