{"altername_name": [], "name": "Fantasy Life Link!", "overview": "Fantasy Life is a role-playing life simulation game, in which players can choose from any of the twelve jobs known as \"life classes\".[1][2] Gameplay centers upon the player taking on various tasks given to them and choosing one of twelve Life classes.[3][2] Upon achieving various goals such as completing tasks in the game, buying a new house, or decorating said house, players will gain \"Bliss points\" that will unlock additional features like larger storage, or the ability to expand your home.[4] Players are able to customize several aspects of their character.[5] As the game progresses players have the ability to unlock several new areas,[6] as well as playable characters that can join them on their journey and help them fight monsters.[citation needed] Playable characters include King Erik's daughter Laura and Port Puerto governess Olivia, as well as several Life class specific characters that will unlock after the player has reached a certain class level.[citation needed] Players choose from one of twelve classes,[7] each of which has its own \"Life Master\" that will assign tasks and award points to the player, allowing them to rank up within their Life. Each rank gives the player the ability to perform additional tasks and will give Life bonuses (additional vital stat points and abilities) to the player. As the player masters each Life class they gain the ability to more easily produce and access materials on their own, as opposed to purchasing them via a storefront. Players can level up through the ranks of each life class; starting out as a Fledgling and ending with the Legend rank. If the player has the Origin Island DLC, a new rank called the Creator (or God in Europe) rank is added.", "platform": "Nintendo 3DS", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/103682-fantasy-life-link\n"}