{"altername_name": [], "name": "Fate Kaleid Liner: Prisma Illya", "overview": "Fate/kaleid Liner Prisma Illya is a 3DS game published by Kadokawa Shoten in 2014 based on the anime series. It was originally supposed to come out in 2013 with first anime, but was delayed so much that it came out alongside the second season. The game came in regular and limited editions. The game is an arena fighter where the player alternates between melee attacks and light ranged attacks depending on proximity. Then, there are the elemental and class cards. These are much stronger attacks and will take much larger chunks of health of enemies. Class Cards are even stronger and are useful in finishing a damaged foe. There are 100 different cards in total but, the player can only take 10 cards into a battle and most of them are single-use in battle with a couple having multiple uses. Opponents, on the other hand, tend to have infinitely replenishing elements so, players have to use their cards carefully. The main game's story has the player have to find the 7 Class Cards around the city in 7 nights but, they can go to up to 3 locations in a night. There are 7 locations in total and the next Class Card's location is indicated on the map. Going to other locations will trigger either dialogue, battle with other characters or 3 random elemental cards. To get a Class Card, the player has to go to that location and fight the Class. There are four characters, all based on characters from the series. They generally play the same. They are the following: Illyasviel von Einzbern (Only one unlocked at the start) Miyu Edelfelt Rin Tohsaka Luviagelita Edelfelt In addition to single player, there is a local multiplayer option where up to 4 players can play as the 4 characters and fight it out using the rules from the single player.", "platform": "Nintendo 3DS", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/103684-fate-kaleid-liner-prisma-illya\n"}