{"altername_name": ["FIFA 12"], "name": "FIFA Soccer 12", "overview": "This version of FIFA 12 is designed for touch based mobile devices. In addition to single matches it features four basic game modes: leagues, cups, practice arena and penalty shoot-out. There are thirty leagues and twenty one cups to compete in. In both leagues and cups the player can either choose to play the matches himself or to simulate them. Some team management options exist. The player can pick a formation and a starting eleven as well as kick takers and team styles. Team styles include for example playing with counter attacks, zonal marking and attacking full backs. The iOS version of the game also features a manager career mode that is not available in the Android version. In addition to these game modes there are also daily challenges where the player joins a match at a certain stage and has to succeed with a task, for example scoring with a free kick. The game is entirely played with touch controls. A d-pad is used for moving the players around and three context sensitive buttons are used for actions. In offence these are sprint, pass and shoot while in defence they are slide, switch and sprint tackle. For simple manoeuvres the player simply taps the buttons, but for more complex actions it's possible to make swipes from the buttons. For example to make a finesse shot, the player presses the pass button and then makes an upwards swipe. Other actions that can be performed by making swipes include chips, crosses and through balls. In addition to the buttons there are some other ways to do actions. A skill move can be done by double tapping the screen, while forward runs for players without the ball can be done by making swiping motions along the pitch. It is also possible to make passes by tapping the player that should get the ball. The iPad version of the game features an option to use one or two iPhones as controllers through a bluetooth connection. For this to work the player has to download a separate app for the iPhone.", "platform": "Nintendo 3DS", "release_date": "September 27, 2011", "game_type": "Released", "esrb": "", "developers": "Electronic Arts Canada", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95085-fifa-soccer-12\n"}