{"altername_name": [], "name": "Final Fantasy", "overview": "The world is veiled in darkness. Winds don't blow, the seas are stormy, and the earth rots. All people can hope for is that the ancient prophecy will be finally fulfilled. \"When the world is veiled in darkness, four warriors will come...\" And indeed, they come - the four characters you have previously chosen. Their first quest is to free a princess from the evil knight Garland, and then the real journey begins. Final Fantasy is played with an adventuring party rather than with a single character. Before the game starts, the player chooses four characters from six different classes: Fighter, Thief, Black Belt, White Mage, Red Mage, and Black Mage. He also gives the characters names. In the game, the party walks around in a top-down world, visits cities, caves, palaces and other places to buy equipment, rest and get hints and new quests, and fights baddies when they are encountered. Final Fantasy uses a turn-based combat system. In battle, the player gives each character in order a command (attack a particular enemy, cast a spell, use an item, or try to run). Then the characters and the enemies act in a random order. Attacked enemies and party members lose hit points, dying when they reach zero HP. When all the enemies are defeated, living party members receive experience, eventually gaining a level and improving their stats when enough experience is accumulated. Slain party members can be revived in towns for a price. Spells are bought in cities in special shops. The spells are divided into two categories - white magic and black magic. White Mages can only use white magic, Black Mages can only use black magic, and Red Mages can use both. Casting spells in battle uses up Dungeons & Dragons-style spell slots, which, like hit points, can be restored by resting in inns. This is the Japanese-only remastered Nintendo 3DS version from Nintendo eShop.", "platform": "Nintendo 3DS", "release_date": "January 21, 2015", "game_type": "Released", "esrb": "Not Rated", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.58", "wikipedia": "https://en.wikipedia.org/wiki/Final_Fantasy", "video_link": "https://www.youtube.com/watch?v=TVKECNwdZbA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127198-final-fantasy\n"}