{"altername_name": [], "name": "Fishdom H2O: Hidden Odyssey", "overview": "A marine biologist called Jennifer wants to design and maintain large aquariums, hoping that one day she will be able to do it professionally. To raise the money necessary to buy expensive equipment and decorations, she dives to collect lost valuables scattered on underwater wrecks. Fishdom H2O: Hidden Odyssey is a hidden object and the sequel to a previous tile matching title. As the biologist, the player has to buy new fish, plants and other items to customize an aquarium, shown as the main game screen. The equipment available to purchase is organized on three tabs at the bottom, for types of fish, decoration and comfort. The shop items can be bought and placed anywhere on the aquarium with the mouse. Each new addition increases one of three meters at the top right, measuring the quality of the fish, beauty and comfort. The goal is to completely fill them to earn a star and unlock the next aquarium. The money required for the shopping is acquired in the hidden object sections. After clicking the dive button, Jennifer swims to a shipwreck, where every item collected is converted in some cash. These locations are random separate screens where the player must find several objects. Most of the time, the goal is to find and click on all the items from a list at the bottom of the screen, within a time limit. The time restriction can be turned off in the options menu. Some variations of gameplay occur: in Collectables, the objective is to find repeated instances of objects of the same type; in Gold Rush, the goal is to collect all the objects made of gold as fast as possible, before time runs out; in Quick Eye, the player has to find one of three items listed at the bottom, on ten turns, with some seconds added to the timer after each object is found. The hint button is a jar filled with seahorses at the bottom-right. Clicking on it releases one of the creatures, that swims towards one of the required objects. Seahorses can be found hidden on the screen, and can be collected from the scenery for extra hints.", "platform": "Nintendo 3DS", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98945-fishdom-h2o-hidden-odyssey\n"}