{"altername_name": [], "name": "Freakyforms: Your Creations, Alive!", "overview": "Using the stylus on the touch screen, players build their own custom creatures, called \"formees.\" No drawing skills are needed, so players of all ages can give it a try. Young players can make their creatures from simple geometric shapes, while players with more artistic abilities can challenge themselves to create more intricate and detailed creatures. Then they can customize the color and the look, and add eyes and a mouth. Players can even add wings to make their creatures fly or giant bouncy legs to make them hop along. The creative combinations are endless. Once the formee is assembled, it comes to life and is able to explore its environment. As players use their characters to investigate their world, their formees munch on food and lay eggs that can be broken open to collect coins for buying items or parts. Players can even open a treasure box and unlock the ability to redesign elements in the game world. Don't like puffy, white clouds? Make them purple with pink polka-dots or black and spiky. The more pictures that a player makes, the larger the game world grows and the more areas there are to explore. Players will also accumulate more shapes and formee parts to make even more interesting characters. For example, wings, wheels and engines can be unlocked, along with fun accessories like hats and ties. Formees can explore beyond the world that players create. People who activate the StreetPass™ feature can also wirelessly swap characters with other players. Additionally, players can make a QR code of their creatures and trade or collect them with others.", "platform": "Nintendo 3DS", "release_date": "November 10, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Asobism", "publishers": "Nintendo", "genres": "", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "https://en.wikipedia.org/wiki/Freakyforms:_Your_Creations,_Alive!", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79419-freakyforms-your-creations-alive\n"}