{"altername_name": ["Gunslugs 2"], "name": "Gunslugs II", "overview": "Gunslugs II, the sequel to Gunslugs, is a fast-paced run-and-gun platformer where a team of commandos have to take on the evil Black Duck Army. Running, jumping and gunning you have to take out hundreds of enemies through seven stages, each consisting of two sub-levels plus one boss level, plus one special level. Each sub-level have three also randomly generated forts that you will have to enter, fight through and finally cause to self-destruct before the chopper at the end of the level will fly you out and onto the next one. Killing enemies or breaking crates will often drop coins, ammo or health pick-ups. There are also weapon pick-ups strewn around the levels. Every now and then you will encounter shops where collected gold can be exchanged for armor or permanent ammo capacity upgrades. Gold is persistent over playthroughs, though not game modes. Inside the forts you will encounter captive commandos, who when freed will swap out your character bringing along full health and their own fully charged personal weapon. Every stage a new commando is introduced, along with a new weapon, for a total of seven. Rescuing a new commando will permanently unlock and cause him or her to be available on further plays even on earlier stages. Occasionally defeated enemy vehicles will be left behind for you to commandeer. These have an infinite amount of high-powered weapons, however they cannot jump and thus cannot traverse some obstacles in the levels. In addition to the story mode there is an arcade mode where you cannot save or continue, as well as randomly generated daily challenge levels, both added post-release.", "platform": "Nintendo 3DS", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98957-gunslugs-ii\n"}