{"altername_name": ["Imagine: Fashion Designer 3D", "Girls Fashion 3D: Mezase! Top Stylist"], "name": "Imagine: Fashion Designer", "overview": "Hold your head up high and work that look - because Nintendo 3DS is about to host your dream of becoming a member of the international fashion pack, a muse to other designers, and example for stylists everywhere to follow: Imagine™ Fashion Designer 3D has arrived! Taking advantage of the amazing features of the Nintendo 3DS system, Imagine™ Fashion Designer 3D allows you to enjoy unique styles in 3D, with fabrics so sumptuous they seem almost touchable. With revolutionary new design tools you can let your imagination run free – so throw out those predefined patterns and create your own completely original designs. Options for asymmetric hems? Check. Precise control over every part of each garment you make? Check. Customised fabric? Check, or rather, ‘click’ - as you can snap a photograph of your prospective pattern using the outer cameras of the Nintendo 3DS system, ready to apply to your clothing designs in-game! The limits are only defined by what you can imagine, fashion designer... Sashay your way through over 50 missions, and if you’ve got what it takes, you’ll be working your look book up to international style status - outfit the stars and you could see your creations in the news when they’ve been snapped by the paps at premieres or when they take centre stage on fashion magazine covers. Build the wardrobe of your dreams, making the all-important decisions when creating your own designs from scratch, but don’t forget the business side: manage that budget, sell your unique designs, and buy new things to add to your ever-increasing closet. Created with the help of those in the know, the game features real tips and challenges written by fashion journalists - over the course of your wild career you’ll rediscover vintage looks, feel the joy of basics, work a wide variety of awesome accessories and style it up with six of the real-life trends of 2012! But any good stylist knows that the fashion business is about connections with other people too. In this title you can unlock rare items via StreetPass when you pass other budding designers in real-life, share your favourite creations with friends wirelessly, send rare items to your best friends as gifts, or even take on another designer in a style challenge via Local Play! So start thinking about the fabulous frocks and amazing accessories you’ll make, because Imagine™ Fashion Designer 3D is your portal to a wonderful world of style, only on Nintendo 3DS. Create an amazing wardrobe of your own designs with the revolutionary design tools Take on over 50 fashion missions and gain international renown Unlock exclusive items via StreetPass. Share and send items, or challenge your friends! Use the outer cameras of the Nintendo 3DS system to snap pattern designs to use in-game", "platform": "Nintendo 3DS", "release_date": "November 25, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Lexis Numérique", "publishers": "Ubisoft Entertainment", "genres": "Education", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95057-imagine-fashion-designer\n"}