{"altername_name": [], "name": "Inazuma Eleven", "overview": "Inazuma Eleven is a role-playing sports video game for the Nintendo DS developed and published by Level-5. It was released in Japan in August 2008, and was localized in English in 2011. The game was also included in an compilation for the Nintendo 3DS, Inazuma Eleven 1-2-3: Endo Mamoru's Legend, which released in Japan in December 2012. Players can scout out other members of the school they want to add to their team, either by name/criteria, or by a 'connection map', which grows bigger the more players obtained from it. They can then locate them on the overworld and challenge them to a battle, which, if won, adds them to their party. Also, by talking to Nelly in the clubroom, players can recruit people from the various teams they have beaten in the main story. There are nearly 1000 playable characters to collect, each with their own unique design, stats and abilities, but only 100 can be contained in a player's party at once. The other part of the game is the football matches themselves. Players control their team with the stylus, moving players and passing between teammates. Running into an opponent initiates a command duel, where the player can do things like dodge an opponent's attempt at a tackle, slide-tackle to take the ball away, or attempt to score a goal. The result of any of their players' actions in a duel are determined by their form, which is decided by their stats (Kick, Body, Control, Guard, Speed, Stamina, and Guts), the player's element (either Wood, Air, Earth or Fire, which work in a 'rock-paper-scissors'-like fashion), and the total number of players participating in an action.", "platform": "Nintendo 3DS", "release_date": "January 29, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Level-5", "publishers": "Level-5", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "4.19", "wikipedia": "https://en.wikipedia.org/wiki/Inazuma_Eleven_(video_game)", "video_link": "https://www.youtube.com/watch?v=IzddjiQNvjU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/20582-inazuma-eleven\n"}