{"altername_name": [], "name": "Inazuma Eleven Go Galaxy: Supernova", "overview": "Inazuma Eleven GO Galaxy is the third game of the Inazuma Eleven GO series and the sixth installment of the Inazuma Eleven series. There are two versions of the game, named Big Bang, and Supernova. Youths' soccer world championship, Football Frontier International Vision 2 (FFIV2) is held, thus Inazuma Japan is announced. However, to represent Japan, elected are players never before seen! Many of these never before seen players have never played soccer before, but have participated in sports such as boxing, rhythmic gymnastics, basketball, track and field, or have never played sports before. What on earth will happen to Inazuma Japan!? Info On the 30th of March 2013, there was a trailer showcasing GO Galaxy, presenting characters such as Tenma, Tsurugi and Shindou in the representative team of Japan, Inazuma Japan, to compete in the Football Frontier International Vision 2 (FFIV2), a new worldwide tournament which will be held to decide the best youth soccer team in the world. On one of the scans, it says \"Where are our friends of Inazuma Eleven GO 2?!\", which means the characters such as Nishizono Shinsuke, Kirino Ranmaru, Nishiki Ryouma or others supporting characters won't be seen that much, as they weren't chosen to be part of the Japan team. However, Shinsuke will automatically join Inazuma Japan after the Asia preliminaries of the FFIV2 while others have to be chosen. On August 26th, the second trailer of Inazuma Eleven GO Galaxy Big Bang/Supernova was shown at the Level-5 Vision. The video introduced many new things to the series, such as completely new and unseen characters, a new feature called the \"Soul\" which is used by the members of Earth Eleven, and several new hissatsu. On November 15th, another trailer of Inazuma Eleven GO Galaxy Big Bang/Supernova was released on the official site. The trailer showcased new hissatsu's, Big Bang and Supernova plotlines, and further information regarding Souls. It also showed the scout characters and other features from the past games.", "platform": "Nintendo 3DS", "release_date": "December 5, 2013", "game_type": "Released", "esrb": "", "developers": "Level-5", "publishers": "Level-5", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "3.62", "wikipedia": "https://en.wikipedia.org/wiki/Inazuma_Eleven_GO%3A_Galaxy", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104624-inazuma-eleven-go-galaxy-supernova\n"}