{"altername_name": ["Inazuma Eleven 1-2-3!!: The Legend of Endou Mamoru"], "name": "Inazuma Eleven 1-2-3!! Endou Mamoru Densetsu", "overview": "The game contains the plots of the first three Inazuma Eleven games, starting off by following the protagonist of the three games, Endou Mamoru, a second year student at Raimon. He has dreams of competing in the Football Frontier, but with an unenthusiastic Soccer club and the looming threat of the club being closed due to inactivity, his chances are looking dim. That is, until he plays a match against the intimidating Teikoku Gakuen, a match which changes the Raimon Soccer Club forever. Afterwards, following the events of Inazuma Eleven 1, Endou and his team return to Raimon to find their school in ruins. In the wake of this destruction is the mysterious Aliea Gakuen, a supposedly extraterrestrial force spreading chaos and destruction throughout schools across Japan with the aim to make humans submit to their will. With a new coach in toe, Endou and the Inazuma Caravan head out in search of Japan's strongest players in hopes of creating the world's strongest team to take down the alien menace. And in the conclusion to Endou's legendary story, the Football Frontier International is coming up, and Coach Hibiki calls various soccer players to the Raimon grounds. After testing the players, Inazuma Japan is born, the team representing Japan. After conquering the Asian preliminaries, the tournament begins, but it seems that not all is right. What are the dark secrets of the FFI association? And who is the mysterious team that is eliminating teams left and right?", "platform": "Nintendo 3DS", "release_date": "December 27, 2012", "game_type": "Released", "esrb": "", "developers": "Level-5", "publishers": "", "genres": "Role-Playing", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104622-inazuma-eleven-1-2-3-endou-mamoru-densetsu\n"}