{"altername_name": [], "name": "Jewel Quest Mysteries: The Seventh Gate", "overview": "Jewel Quest Mysteries: The Seventh Gate is the third in this Jewel Quest spin-off series. Marco, an old flame of Emma Pack is helping Rupert and daughter Natalie uncover new jewel boards in Ancient Greece. But when all three go missing Emma desperately finds herself going an a dangerous mission to locate her loved ones before a volcanic eruption consumes an ancient lost city. The Seventh Gate plays like the previous two games in this mainly hidden object series. Emma needs to visit all locations on the map screen. In each location you are given a list of objects to find. When each item is found it will disappear from the list. When every item is found the level will be completed. Three gold coins that are collected in a location provide a hint as to where an item can be found. A timer displayed shows the amount of time you have in order to complete a chapter. Bonus points are awarded for completing a location quickly. Certain activities have to be completed in each area before progress can be made such as finding a jewel board shard that allows you to play a jewel board in typical Jewel Quest fashion, solving a puzzle and using an item in your inventory to fix or manipulate an onscreen object. For the latter the inventory stores a number of items that can only be used in a specific location. In terms of puzzles every chapter provides some sort of logic puzzle. Emma's journal provides tips on how to complete these. For the jewel boards jewels collected in each location provide extra currency to buy power-ups to use in jewel boards. In between chapters you get a scrolling screen where you must locate as many specified items as possible in order to get more jewels. Once this is all done you can move onto the next chapter.", "platform": "Nintendo 3DS", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95061-jewel-quest-mysteries-the-seventh-gate\n"}