{"altername_name": ["Kābī no Suikomi Dai Sakusen", "Kirby’s Blowout Blast"], "name": "Kirby's Blowout Blast", "overview": "Kirby is ready for action in a whole different dimensionthe third dimension! Have a blast inhaling foes and blowing them away in 3D environments across 25+ stages. Inhale enough enemies and you can launch one huge Blaster Bullet capable of wiping out a troop of Waddle Dees. Now's your chance to battle iconic bosses like Kracko Jr and King Dedede in 3D! Inhaling multiple enemies to launch Blaster Bullets is a great way to pump up your score and go for a bronze, silver, or gold star. Another way to score big is to rack up a combo by continuously firing at enemies without missing. Or you could always just collect coins as you jump across platforms. As you progress, you'll unlock EX stages, which provide a tougher challenge to master. Celebrate your victories by tapping a Kirby series amiibo figure to build a statue in the plaza that plays new music! *Inhale enemies to launch Blaster Bullets and take out groups of enemies in a 3D space *Obtain a bronze, silver, or gold trophy while shooting for a high score *Face down beloved Kirby series bosses like Kracko Jr and King Dedede *Unlock EX stages and master them for an even tougher challenge Alt description: Kirby’s Blowout Blast is based on Kirby 3D Rumble, which is a mini-game in Kirby: Planet Robobot. The game follows the same mechanics as the original Kirby game, Kirby's Dream Land, meaning there is no copy ability, like in future iterations of the series. The main difference in Kirby’s Blowout Blast is the introduction of the 3D environment, which changes the gameplay around. For instance, Kirby can now spit enemies he has swallowed in several different directions, with the introduction of a small arrow to indicate the direction Kirby will spit the enemy out. Even though the game is fully playable in 2D, the use of the 3D gimmick gives the world a much greater sense of depth, and can sometimes help with the gameplay, just like it happened in Planet Robobot. Each completed stage awards the player with bonus points, depending on how fast the stage was finished, how many enemies were killed, if all coins were collected and if damage was avoided. A gold ranking (or higher) will unlock the EX versions of the corresponding world, and since there are initially five worlds to beat, obtaining that rank in each single world will double the game’s length, making 10 worlds available. Kirby themed Amiibo work with the game, unlocking several cosmetic extras. Other extras are also unlocked by having Kirby Planet Robobot.", "platform": "Nintendo 3DS", "release_date": "July 4, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "HAL Laboratory", "publishers": "Nintendo", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.38", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=QTl0cJ0mlX4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/85119-kirbys-blowout-blast\n"}