{"altername_name": ["Kirby, Mas: En el Reino de los Hilos", "Keito no Kirby Plus"], "name": "Kirby's Extra Epic Yarn", "overview": "Kirby's Epic Yarn is a platform video game developed by Good-Feel and HAL Laboratory and published by Nintendo for the Wii video game console. It is the tenth installment of the Kirby series and was released in October 2010 in Japan and North America and in February 2011 in Australia and Europe. It is the first entry in the Kirby series on a home console since 2003's Kirby Air Ride and its first home console platform game since 2000's Kirby 64: The Crystal Shards. The game follows Kirby, who has been transformed into yarn and sent to Patch Land, a world made completely out of fabric. He must help Prince Fluff by collecting seven pieces of magic yarn that are used to stitch Patch Land together in order to stop the game's antagonist, Yin Yarn. Kirby's Epic Yarn utilizes a unique craft-based visual style; the game's characters and environments consist entirely of yarn, fabric, and other craft materials. Unlike most games in the Kirby series, Kirby is unable to inhale or fly, instead relying on the ability to morph into other objects, such as a parachute, a car, and a submarine, as well as larger objects such as a tank and a steam train. The third game developed by Good-Feel in tandem with Nintendo, Kirby's Epic Yarn was originally proposed by Madoka Yamauchi, who came up with the idea of a \"world of yarn\" as a video game. It began development as \"Keito no Fluff\", a game starring Prince Fluff as the main protagonist, before the starring character was eventually switched to Kirby. The game's graphical style was created via digital images of real-life fabrics which were placed over polygons. The game's music was composed by Tomoya Tomita. Before the game's release, Kirby's Epic Yarn won numerous awards at E3 2010 including Game of the Show from GameSpot. It was released later that year to largely positive reviews, receiving an Editor's Choice award from IGN, who ranked it as #95 in their \"Top 100 Modern Games\". As of April 2011, it has sold 1.59 million copies worldwide. It was re-released digitally via the Wii U eShop in Europe and Australia on May 21, 2015, in North America on July 28, 2016, and in Japan on August 9, 2016. A spiritual successor to Kirby's Epic Yarn titled Yoshi's Woolly World was released in 2015 for the Wii U. A port of the game for the Nintendo 3DS entitled Kirby's Extra Epic Yarn was released on March 8, 2019.", "platform": "Nintendo 3DS", "release_date": "March 8, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Good-Feel", "publishers": "Nintendo", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.54", "wikipedia": "https://en.wikipedia.org/wiki/Kirby%27s_Epic_Yarn", "video_link": "https://www.youtube.com/watch?v=9ULevW6cP_s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114534-kirbys-extra-epic-yarn\n"}