{"altername_name": ["Mario & Luigi RPG1 DX", "Marion & Luigi Superstar Saga + Bowsers Schergen", "Mario y Luigi: Superstar Saga + Secuaces de Bowser"], "name": "Mario & Luigi: Superstar Saga + Bowser's Minions", "overview": "Save Princess Peach's voice, the Beanbean Kingdom and ... Bowser?! The game that launched the Mario & Luigi series returns looking better than ever before. In this renewed classic, Mario and Luigi journey to the Beanbean Kingdom with Bowser to restore Princess Peach’s voice. Control Mario and Luigi simultaneously, making use of their unique Bros. Moves to solve puzzles and emerge victorious in action-packed battles. Pay heed to the enemy’s patterns and time your reactions right to land satisfying counterblows. Included in this remake is the Minion Quest: The Search for Bowser mode, which tells the story of the game from the perspective of Bowser’s minions. Recruit characters to grow your own Minion army as you fight to locate your missing leader! Features: * Mario and Luigi have access to different techniques, known as Bros. Moves, necessary for solving puzzles on their adventure. Switch between the two characters at will to pave your way and progress through new areas. * Time your button presses to skillfully dodge enemy blows, land devastating counters, and inflict increased damage in battle. Utilize Bros. Attacks that dish out massive damage! * In the brand new mode titled Minion Quest: The Search for Bowser, become the unlikely hero, Captain Goomba. Journey together with ShyGuy, Boo and other familiar Baddies. * The Minion Quest storyline takes place during Mario & Luigi’s classic adventure. Find out what really transpired behind-the-scenes! * Compatible with amiibo figures from the Super Mario series, including Mario and Luigi amiibo figures. Also coming soon are brand new Goomba and Koopa Troopa amiibo. The Goomba, Koopa Troopa and Boo amiibo figures will each have read/write compatibility.", "platform": "Nintendo 3DS", "release_date": "October 5, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "AlphaDream", "publishers": "Nintendo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.33", "wikipedia": "https://en.wikipedia.org/wiki/Mario_%26_Luigi:_Superstar_Saga#Remake", "video_link": "https://www.youtube.com/watch?v=AfmkuzPLnv8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/87848-mario-luigi-superstar-saga-bowsers-minions\n"}