{"altername_name": ["Monster Hunter 3G", "Monster Hunter 3 Ultimate Data Transfer Program"], "name": "Monster Hunter 3: Ultimate", "overview": "Monster Hunter 3 Ultimate utilises the functionality of the Nintendo 3DS to provide players with a truly intuitive hunting experience. The touchscreen allows players to quickly access in-game books, weapons, field maps and mini games while the 3D visuals of Nintendo 3DS, powered by the latest iteration of Capcoms MT Framework, deliver a unique and stunning world for players to explore. Taking advantage of the portability of Nintendo 3DS, players can exchange their guild card that contains all their hunters information with other players via StreetPass. Players can experience the world of Monster Hunter alone or in four player local play using Nintendo 3DS. Finding nearby hunters to adventure on quests with is now even easier via the local Nintendo 3DS search feature. Wii U players will be able to enjoy the hunt with Nintendo 3DS players via a local wireless connection. Gamers that own both a Wii U and Nintendo 3DS can take advantage of the inter compatibility of save data between the two consoles, taking the hunt from the living room wherever they go. -Expansive Monster Hunter world equipment and weapon upgrades, challenging monsters and over 200 quests to tackle make this latest offering the most expansive in the series so far. -Utilise 3DS functionalities The touch screen provides easy access to in-game books, weapons, field maps and mini games. -3D visuals The beautiful world of Monster Hunter, powered by Capcoms latest iteration of the MT Framework, appears visually stunning and unique for players to enjoy on 3DS format -Dont hunt on your own Connect with up to three friends in four player local play via the Nintendo 3DS or online via the Wii U. Wii U players can also link up with Nintendo 3DS players over a local connection. -Search for fellow hunters! Use the local 3DS search feature to find other hunters in your location. -Take the experience with you wherever you go Share your save data between your Wii U home console and the Nintendo 3DS, allowing the Monster Hunter experience to be truly portable. -Meet your companions Never feel alone in the vast world of Monster Hunter with the aid of your two companions, Cha-Cha and Kayamba, who will assist you on your quests. -Exchange your information Share your guild card with fellow hunters via the Nintendo StreetPass function.", "platform": "Nintendo 3DS", "release_date": "March 19, 2013", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "3.98", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14679-monster-hunter-3-ultimate\n"}