{"altername_name": [], "name": "Monster Shooter", "overview": "Monster Shooter is a top-down shooter in the vein of classic action-shooter titles like Smash TV or Total Carnage. Players take the role of a relatively benign alien who just happens to be pretty versatile with a large assortment of weapons. The alien ends up, by way of general bad luck, stuck on hostile alien worlds where he must, essentially, shoot his way through hordes of alien octopuses to escape. The shooter gameplay is built with an aim assist which allows for faster and smoother gameplay than the much older Smash TV style. A mild RPG-style experience and perks system backs the basic gameplay in a unique way. Players earn experience quickly, and can add perks to their character, such as increasing the rate of fire of the weapons, making reloads faster, improving health, etc. Unlike a traditional RPG (or similar game), these perks are not permanent and do not carry over after a level is finished. In this way, players can tweak their character every level to what may be specifically beneficial at the time. If a player wants to specify speed for a level, they may. If they want to emphasize health, they may. Players may earn money by completing levels or by picking up money during gameplay, and this can be used to purchase weapons, weapon upgrades, items, and a few permanent perks. Money is also earned by gaining rank in the game through the completion of various achievement-like Missions. The player is given three of these at a time, and competing each one works toward building ranks. These Missions are typically number-based, i.e. kill 100 of a certain enemy, kill 500 enemies with a certain weapon, use an item 50 times, etc. There is a variety of weapons including the default SMG, a shotgun, an electric gun, rocket launcher, grenades, mines, etc. The primary game is a story mode with 60 levels, and a survival mode which may be played on any of the three planets. Weapon upgrades carry over to Survival mode.", "platform": "Nintendo 3DS", "release_date": "November 15, 2012", "game_type": "Released", "esrb": "", "developers": "Gamelion Studios", "publishers": "Gamelion Studios", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99315-monster-shooter\n"}