{"altername_name": [], "name": "Monster Strike", "overview": "Monster Strike has been compared to competitor Puzzle & Dragons and other freemium puzzle games in that the player battles waves of monsters to collect them, fuse them, and evolve them and earn gold and other items through gameplay to get stronger monsters, and build a list of friends with monsters to use as well. What sets it apart is that rather than being a tile-matching video game, the player aims and flicks their monsters around on a field, similar to billiards/pool, bumping off of walls and enemies to perform damage. Colliding the currently in play monster with any of the allied monsters activates Bump Combos (友情コンボ, Yūjō Konbo, \"Friend Combos\") that set off explosions, energy beams, or projectiles to perform damage on opponent monsters. Every turn, numerous counters on enemy monsters count down to launch various attacks that deal damage or add hazards to the field. Player monsters often have other unique passive abilities to counter these hazards, or may have passive abilities that cause greater damage to particular kinds of enemy monsters. Some monsters also have gauges that when it is launched at the right time, it activates a secondary gauge ability as well as slightly increases their attack strength. Each of the player's monsters also has its own counter, which allows the player to activate the monster's Strike Shot (ストライクショット, Sutoraiku Shotto) attack to perform more damage. The final battle of each Quest Mission features a Boss monster that has a moving critical hit point. Monster Strike also offers co-operative play for up to 4 players. Quests in the game are divided into Solo and Co-Op and then Normal and Event. Event Quests are only available for limited periods of time and often feature rare monsters that are powerful or that can be used in the Ascension of other monsters. Completing the levels of a quest awards the player monsters, catalysts, and coins. In Normal Quests, for completing the penultimate level in the quest, players are awarded a rare catalyst and for completing the final level, they are awarded an Orb as well as unlocking a Bonus Level featuring the experience-increasing or high-selling turtle monsters. A Mission Log is also given to players to reach certain goals in Quests to win other Catalysts, Orbs, or experience-increasing monsters. A third set of Quests are available in the Temple of Heroes. Clearing any of these awards the player Ableberries (わくわくの実, Wakuwaku no Mi, \"Exciting Fruit\") that gives one of the player's monsters an additional stat bonus. Initially, only certain Hatcher monsters could have an Ableberry. Later, the ability for rare Event Quest monsters to have Ableberries was added, but only if the player has Max Luck on two copies of the same monster. A Tower of Champions event is also occasionally run in Japan, providing an increased challenge for players to win rare monsters and prizes. A similar event was held in the North American version of the game for Christmas 2015. Each monster has its own HP, Attack, and Speed statistics. The player's three monsters' HP and their friend or helper's monsters' HP are combined for a total HP. Attack determines how much damage the player's monster does to enemy monsters and Speed determines how fast (how much distance) the monster travels in a single turn. These values are increased by fusing monsters together to gain experience, or using special stat-only increasing monsters. There is also a Luck (ラック, Rakku) value, symbolized by a four-leaf clover, that determines the possibility of obtaining bonus prizes at the end of a Mission. Luck can only be increased by fusing two of the same monsters together, or monsters in the same evolutionary line; fusing two Red Smydras or a Red Drake and a Red Smydra will both cause Luck to increase. An additional Luck Skill was added to the game, allowing certain monsters to either have a critical hit or a shield to prevent damage on one turn. After raising a monster to its maximum level, the player can Evolve (進化, Shinka) them through the use of Evolution Catalysts (進化アイテム, Shinka Aitemu, \"Evolution Items\"). Players can also Ascend (神化, Kamika) their monsters into even more powerful forms through the use of other monsters with specific Luck levels. Divination (獣神化, Jūshinka) is a combination of the two evolutions, giving the monster a second tier to their Strike Shot and a second slot for an Ableberry. The game also features Hatchers (ガチャ, Gacha) that the player spends either Friend Points (earned through choosing another player's monster to complete a level) for fairly common monsters or Orbs for rarer monsters. The main Hatcher cycles through a series of different sets of monsters that have an increased availability, with the rarest found during the Legend Series (獣神祭, Jūshinsai) events. The Friend Hatcher is sometimes used for giving out rare Event monsters for collaborations, such as with Line Corporation and Weekly Shōnen Jump in Japan. The Japanese edition of the game has also featured a special Hatcher to commemorate the release of Godzilla requiring special Godzilla Sharls to use it. Collaborations have also been made with Lawson's convenience store chain, Monster Hunter Big Game Hunting Quest, Bakusō Kyōdai Let's & Go!!, Game Walker, Parasyte, Teenage Mutant Ninja Turtles, Rebuild of Evangelion and Ultraman. The game has an in-game store to purchase Orbs that are used to continue lost Missions, expand the number of the player's available saved monsters, restore Stamina used to play Missions, or use them in the game's Hatcher to earn powerful and rare monsters.", "platform": "Nintendo 3DS", "release_date": "December 17, 2015", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "4.3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104715-monster-strike\n"}