{"altername_name": [], "name": "NASCAR: Unleashed", "overview": "NASCAR: Unleashed is a racing game based on the US stock car racing sports event. Rather than a true simulation, it espouses realistic control, driving, and physics for much more hectic and over-the-top arcade racing, complete with many typical arcade racing features such as boosting and drifting, and the like. It has several features from both simulator-style racing games (e.g. NASCAR 09) and from arcade racing games (such as Burnout). Authentic NASCAR tracks are present in the game, but most \"break out\" from the track and into the surrounding city area, hence the \"Unleashed\" aspect. Pit lanes remain and are important for vehicle repairs and obtaining Slingshot boosts. A 15-driver \"All-Stars\" list of NASCAR drivers and their cars is present in the game, though all control identically. Drafting (lowering air resistance, and increasing speed by driving behind other cars) is also present. Besides drifting and boosting, the game features wild arcade-infused physics which often see cars barrel-rolling through the air, and collisions are rampant. Cars can be wrecked and players will routinely create Rivals, who become much more aggressive opponent racers. Should the player be wrecked, he has the ability to perform a Payback wreck on the Rival. The boost meter is filled through extremely aggressive driving, slamming other cars, wrecking other cars, drifting, and drafting. Filling the boost meter gives the player the ability to use a Slingshot boost to race quickly around opponents, and the time limit on a boost tends to depend on the skill of a player to maintain the car around obstacles, walls, and other cars. Challenges routinely present themselves during each race. Completing challenges adds to the boost meter, and are occasionally part of secondary race challenges. An in-race challenge may be as simple as reaching a certain position in the race or destroying obstacles on the tracks, or may require a bit more attention, such as creating Rivals or performing successful drifts. The included game modes are: Championship - The standard career mode with three tiers of difficulty where the player progresses through several races with the goal of finishing within a specific place such as placing in the top 12 or top 5. Each track features two secondary challenges such as creating a set number of Rivals or performing a set number of Drifts. Can be played by one or two players. Quick Race - Simple races that can be performed on any track, or in small, player-created career-style modes. Only tracks unlocked in Championship mode can be used, and this mode can be played by one or two players. Time Trials - The standard, basic Time Trial mode of a typical racing game. The player only races against the clock, but there are several checkpoints available where boosts (Slingshots) can be obtained.", "platform": "Nintendo 3DS", "release_date": "November 1, 2011", "game_type": "Released", "esrb": "E - Everyone", "developers": "Firebrand Games and Entertainment", "publishers": "Activision Publishing", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3.9", "wikipedia": "https://en.wikipedia.org/wiki/NASCAR_Unleashed", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/76310-nascar-unleashed\n"}