{"altername_name": [], "name": "Neko-Tomo", "overview": "\"Neko Tomo\", the latest work of the \"Tomo Series\" familiar from \"Kuma Tomo\", is now available on Nintendo Switch and Nintendo 3DS! Healing, healing, encouraging, and encouraging. Would you like to become a family of cats who can \"warm\" whenever they meet? Enjoyable life with cats \"Cat activity\" Let's have a fun life \"Cat activity\" with two special cats who can talk and come to our house. There are lots of fun games that you won't get tired of playing every day, such as chatting, playing cards, playing cards, playing cards and playing balls in the room, territory patrol, fishing, cooking, gardening, etc. You can make the cats fashionable, take pictures, and upload them to Nyanstagram. Tell me the words \"Talk\" Please talk and tell me about you, such as your name and what you like. Cats remember the words they teach and talk, so the more you teach, the more familiar you become. The cat's voice is full voice! Your name and the words you teach will be read aloud. A full year's worth of \"everyday story\" that allows you to chat after the 365th date is also included! As the \"Kizuna\" level goes up, you will also have an emotional story with the cats! The family level will go up through communication with the cats. As the level goes up, the cat will give you gifts, make rice, and provide hospitality. You can also enjoy the moving story of deepening the cats and Kizuna. There are a lot of points to play with! There are more than 450 clothes that can be dressed up, about 100 furniture that can be dressed up, more than 90 cat play tools, and a large volume of fish that can be caught and plants that can be grown!", "platform": "Nintendo 3DS", "release_date": "November 21, 2018", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai Namco Games", "publishers": "Bandai Namco Games", "genres": "Life Simulation", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/145586-neko-tomo\n"}