{"altername_name": [], "name": "Noitu Love: Devolution", "overview": "The sequel to Noitu Love takes place one hundred years after the events of the first game where Noitu Love dealt with the madman Darnacus Damnation and his army of Grinning Darns in an attempt to turn all people to monkeys through technology called Evomatics. After his defeat, the body of Darnacus was never found and Doppelori, a cyborg clone of Lori, Noitu Love's helper, was kept imprisoned. The sequel stars Xoda Rap (Paradox spelled backwards) as the protagonist. She receives a call about an army of grinning robots threatening Omicron City. Just like the first game, Noitu Love 2: Devolution is a fast side-scrolling game. Players guide Xoda Rap to find the evil mastermind behind the attack. The main character can no longer transform into different shapes through the Evomatics device. Instead, a mouse-based targeting system is introduced. Xoda is controlled through keyboard keys while the mouse is used to guide a cursor for aiming and shooting. There are basic punches, air attacks, wall jumps and temporary shields. Special moves include an upwards wheel attack and powerful dives to the sides of the screen. Xoda can also grab enemies in the air and use a charged attack. Matching the game's speed, Xoda can build up combos by attacking multiple enemies at once, as long as she does not touch the ground. While playing, Xoda receives information from Dr. Almond through an intercom, much like Lori in the first game. Each level comes with different bosses that require a strategic approach. Certain areas also have Xoda fly a floating device. Health can be replenished and expanded through power-ups. At the end of each level, the player is ranked based on time, score and the amount of kills. After finishing the game, new difficulty modes, new enemies and an option to watch the records become available. Also, two more playable characters can be unlocked, of which one is Doppelori. She has completely new moves and a very different playing style. Unlike the first game, the sequel is not freeware but sold as a digital download for $20.", "platform": "Nintendo 3DS", "release_date": "September 15, 2016", "game_type": "Released", "esrb": "", "developers": "MP2 Games", "publishers": "MP2 Games", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/100374-noitu-love-devolution\n"}