{"altername_name": ["Onna no Ko to Misshitsu ni Itara ○○shichau Kamoshirenai."], "name": "Onna no Ko to Misshitsu ni Itara shichau Kamoshirenai", "overview": "Kōhei Fujimaru has started having strange dreams lately; dreams where one of his cute female classmates is locked in a room, and he is there only as a spirit who helps them escape. What's more, these dreams seem to be having an effect on the real world, subtly changing things around him when they take place. At the same time, the annual year-end school festival is fast approaching, and Kōhei can't decide which girl he wants to ask out! Onna no Ko to Misshitsu ni Itara ○○shichau Kamoshirenai. (loosely, \"If you're locked in a room with a girl, you might end up ○○ing.\") is a visual-novel style \"gal game\" combined with \"room escape\" style adventure game sequences. In the dream sequences, the player must help one of the girls escape a room or other situation; however, they cannot interact directly with either the girl or the environment, instead indirectly assisting in one of several ways. The main mode of interaction is by entering the name of an object to draw the girl's attention to it -- for example, \"wastebasket\" to throw away an empty can, or \"curtain\" to open a shower curtain. There are also sections where the player can blow into the microphone to send a gust of wind -- for example, to blow a dangling spider out of the way. Certain sections also allow the player to use the 3DS gyro to look around the room for different objects -- or just to get a better view of the girl they're ostensibly helping out. Between the escape sections, the game plays out like a standard visual novel. At certain points there are decisions that lead to several different endings.", "platform": "Nintendo 3DS", "release_date": "March 15, 2012", "game_type": "Released", "esrb": "Not Rated", "developers": "Intense! Interactive", "publishers": "D3Publisher", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=btq-83N7IYw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128600-onna-no-ko-to-misshitsu-ni-itara-shichau-kamoshirenai\n"}