{"altername_name": ["Gyakuten Saiban 5"], "name": "Phoenix Wright: Ace Attorney: Dual Destinies", "overview": "Eight years since he last stepped into the courtroom, Phoenix Wright makes his triumphant return in Phoenix Wright: Ace Attorney - Dual Destinies, exclusively available in Nintendo eShop on Nintendo 3DS. When an explosion rocks the courts, its up to the Wright Anything Agency to bring the hammer of justice down on those responsible in an adventure filled with all the swerves, shenanigans and stepladders that the Ace Attorney series is known for. The quirky gameplay of previous Ace Attorney titles is back in force: investigate crime scenes to uncover clues with the Nintendo 3DS Touch Screen and go head-to-head with lawyers and law-breakers in the courts. Presented in full 3D for the first time ever, the series trademark over-the-top character reactions come bursting to life in exciting new ways, while retaining the feel of the previous titles 2D artwork. Joining Phoenix are young Attorney Apollo Justice and newcomer Associate Attorney Athena Cykes, who brings her own tricks to the courtroom. Her Mood Matrix can highlight the emotions of a witness, giving a whole new perspective on witness statements. Use the device to analyse witnesses moods as they testify - unearth the hidden feelings behind their words and challenge their testimonies to unravel the truth! Crime scenes are now simpler to snoop around, and evidence easier to analyse than before. Ensure that no evidence goes undiscovered by adjusting the viewpoint to get a good look at every scene, and zoom right in on any suspicious areas. Plus with the ability to review your conversation history, youll never miss any vital clues witnesses might give away. -Join a cast of memorable characters and continue the eccentric story of Ace Attorney -The Ace Attorney series steps into full 3D for the first time, with courtroom and investigation action brought to life in three dimensions -Judge witnesses feelings as well as the facts to uncover hidden truths with the new Mood Matrix feature -Analysing evidence and catching crooks is more intuitive than ever, thanks to an improved interface", "platform": "Nintendo 3DS", "release_date": "October 24, 2013", "game_type": "Released", "esrb": "M - Mature", "developers": "Capcom", "publishers": "Capcom", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.10", "wikipedia": "https://en.wikipedia.org/wiki/Phoenix_Wright:_Ace_Attorney_%E2%88%92_Dual_Destinies", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/20588-phoenix-wright-ace-attorney-dual-destinies\n"}