{"altername_name": ["Pocket Monsters Sun", "Pokémon Sole", "Pokemon Sun", "Pokémon Sol", "Pokémon Sonne"], "name": "Pokémon Sun", "overview": "Pokémon Sun, along with Pokémon Moon, marks the start of the seventh generation of the Pokémon franchise. The game takes place in the Alola region, an archipelago whose culture, geography, and native wildlife are based on those of Hawaii. A number of Alola's native Pokémon have never been seen before, bringing the series' total number of Pokémon species to over 800. As usual for a new pair of Pokémon games, Sun and Moon boast a number of new and improved features. HMs are now replaced by Ride Pokémon, which are unlocked over the course of the story and can be called upon at any time to provide transportation and clear obstacles. Hyper Training allows players to boost their Pokémon's individual values, hidden values that impact a Pokémon's potential for stat growth and are otherwise immutable. The new Battle Royal mode pits four trainers against each other in a free-for-all fight where the goal is to score the most KOs while trying not to let one's own Pokémon faint. A group of islands called Poké Pelago allow the player's Pokémon to play and collect items while they aren't in the active party, and each island can be upgraded to provide more and better rewards. Lastly, a location called the Festival Plaza acts as the multiplayer hub, and combines features from prior games' Join Avenue and PSS systems.", "platform": "Nintendo 3DS", "release_date": "November 18, 2016", "game_type": "Released", "esrb": "E - Everyone", "developers": "Game Freak", "publishers": "Nintendo", "genres": "Adventure", "max_players": "4", "cooperative": "Yes", "rating": "4.26", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Sun_and_Moon", "video_link": "https://youtu.be/Iylfh-7uQkc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/69662-pokemon-sun\n"}