{"altername_name": ["Pokemon: Rumble World", "Minna no Pokemon Scramble", "Pokémon Rumble World"], "name": "Pokémon Rumble World", "overview": "Control cute Toy Pokémon and have exhilarating battles in Pokémon Rumble World! This downloadable game for systems in the Nintendo 3DS family is packed with Pokémon that you can battle and befriend. You can collect 719 species of Pokémon: all the ones that have appeared in the video games up through Pokémon Omega Ruby and Pokémon Alpha Sapphire. When you defeat one of the wild Pokémon you meet in a stage, it sometimes becomes your friend. Even Mega-Evolving Pokémon will join the battles, a first for a game in the Pokémon Rumble series! Befriend as many Pokémon as you can: as you collect more species of Pokémon, your Adventurer Rank goes up. As your Adventurer Rank goes up, the shop will offer more products, and stages will feature stronger Pokémon. It's not just Pokémon that will appear in Pokémon Rumble World. Your Mii character will also appear in your game, as well as the Mii characters of players you pass! It's the first time in the Pokémon Rumble series that Mii characters have joined in to interact with Pokémon and have adventures together. Your story is set in the kingdom of toys, and the adventure starts when the king summons you. He explains his frustration at having only one Pikachu. In contrast, a mysterious magician has captured several Pokémon! So the king asks you to show that magician a thing or two by collecting lots more Pokémon, and he lends you his Pikachu to get you started on your adventures. Depart from the castle town via a hot-air balloon to get to different areas where wild Toy Pokémon await! It's fun to connect with other friends playing Pokémon Rumble World. Players can visit your castle town via StreetPass. Connect your Nintendo 3DS system to the Internet, and Mii characters of faraway players will visit you. They can even provide support for you in future battles in a variety of ways. Poke Diamonds are meant to make your adventures even more exciting and easy. With Poke Diamonds, you can get hot-air balloons, clothes for your Mii character, extras that provide more fun in your game play, and more. In addition, Poke Diamonds can be used to continue playing in a stage after your Pokémon's HP runs out, as well as to re-inflate hot-air balloons that have become deflated after use. You can acquire them in various ways, including at the beginning of the adventure and when you speak to Mii characters who come to the castle town via StreetPass. You can also purchase Poke Diamonds at the shop in the castle town via Nintendo eShop.", "platform": "Nintendo 3DS", "release_date": "April 8, 2015", "game_type": "Released", "esrb": "E - Everyone", "developers": "Ambrella", "publishers": "Nintendo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.65", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Rumble_World", "video_link": "https://youtu.be/IIg7COqNE5o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/69660-pokemon-rumble-world\n"}