{"altername_name": ["Pokemon Picross"], "name": "Pokémon Picross", "overview": "This entry in Nintendo's Picross series has players solve the eponymous puzzles, also called nonograms, to form an image of an object or creature from the Pokémon universe. The usual rules of picross apply, but are also supplemented by the special abilities of the Pokémon available within this game. Every time a puzzle is completed, its corresponding Pokémon is captured and can be used in subsequent puzzles to provide special powers, including automatically fixing the first few mistakes the player makes, revealing several squares when the puzzle starts, and hinting at which row to work on next. Picrites are a form of currency introduced in the game. With them, players can unlock new areas, increase the number of support Pokémon they can use per puzzle, and bypass the cooldown times assigned to Pokémon abilities. An energy meter limits the number of squares a player can fill in before they need to take a break, and Picrites can be used to fill the meter, increase the max energy, and eventually remove the meter entirely. Although Picrites can be earned for free by finishing the daily training mode, earning achivements, and solving the main puzzles, additional Picrites can be purchased through the Nintendo eShop. There is a purchase limit of 5000 Picrites, at which point no more money can be spent on the game, and additional Picrites can then be obtained for free in batches of 1000 at a time. There are over 600 puzzles in the game. The basic, main set of puzzles is grouped into several different areas that can be traveled to.Sometimes, the player can earn a mural piece by completing a main puzzle under specific circumstances, which will unlock a new mural puzzle. These puzzles don't cost any stamina to play, but support Pokémon cannot be used on them, and they do not award any Picrites. However, full completion of a mural board will unlock Primal Groudon or Primal Kyogre. Lastly, every main puzzle has a Mega Picross variant with more difficult clues to work out.", "platform": "Nintendo 3DS", "release_date": "December 3, 2015", "game_type": "Released", "esrb": "E - Everyone", "developers": "Jupiter", "publishers": "Nintendo", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78613-pokemon-picross\n"}