{"altername_name": [], "name": "Putty Squad", "overview": "Putty Squad is a remake of the 1994 SNES game Putty Squad. It has more modern graphics and sound, but still closely resembles the original game in overall design. Just like the original game the player controls the blue character Putty through different levels where he has to free red characters that have been taken prisoner by invading forces. The game is played as a side-scrolling platformer, but at a slower pace with more focus on exploration and puzzle elements to juggle different abilities to reach the captured characters, even though there are many enemies present. To complete a level all other blobs need to be freed and then the area can be exited through a door. As an amorphous blob, Putty has a number of abilities. He can stretch in the four major directions to reach items or move up platforms. He can also jump and flatten himself completely to avoid enemies. He has different types of attacks that can be upgraded throughout the game, ranging from a simple punch to electrical shocks and darts. Not all available abilities are available right away, they are upgraded or become available by collecting stars in levels. There are different types of items and these can be absorbed to use them at a later date. These are restored in a bar on the right side of the screen where they can be selected. Putty can for instance launch rockets, throw bombs, activate a shield, or call in a pod that provides free movement anywhere in the level for 30 seconds. He is also able to inflate and then use an hot air stream to scale heights, but only for a limited amount of time.", "platform": "Nintendo 3DS", "release_date": "November 29, 2013", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "System 3", "publishers": "Maximum Games", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "3.8", "wikipedia": "https://en.wikipedia.org/wiki/Putty_Squad", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95151-putty-squad\n"}