{"altername_name": [], "name": "Rage of the Gladiator", "overview": "Rage of the Gladiator is a single player, first-person combat game based on skill, strategy, and timing along the lines of the classic Nintendo franchise Punch-Out Instead of a plucky up-and-coming boxer, players enter the shoes (armor) of a deposed prince in the land of Avalance, blamed for the murder of his father, the King. He must fight for his freedom and retribution in a Roman-style arena against a horde of monsters and madmen. The story is told through cutscenes and a first-person narrative. The game is played in a manner largely identical to Punch-Out with the exception that it is entirely first-person rather than 'over the shoulder' 3rd person as in Punch-Out. Players face off against a single opponent (referred to as a 'boss') at a time over three difficulty levels. These difficulties operate as the different circuits of the aforementioned Nintendo classic, but feature the same line of foes and with an additional character per higher difficulty. The player does not move around the arena, but must carefully monitor and respond to the opponents in order to deliver successful attacks. This involves learning opponent attack patterns, dodging, and attacking successfully. Upon reaching higher levels, players are not simply treated to a 'harder' version of the same opponent as before--enemies tend to feature new attacks and new patterns entirely, which requires the player to modify what they had learned on lower difficulties. Players can dodge or jump over attacks, or hold up a shield which blocks many energy attacks. The bosses, or enemies, cover a variety of mythical Greco-Roman themes and other fantasy creatures, ranging from an apparent Orc to a Minotaur and a Beholder. Perhaps curiously in a game with overall Greco-Roman themes, the player's \"tutor\" (also an opponent) is of an East Asian characterization. There are a few other human-like opponents as well. Each character has it's own very distinct design and style of fighting, though the same basic concept defines the gameplay throughout--learn the attacks, counter appropriately.", "platform": "Nintendo 3DS", "release_date": "September 19, 2013", "game_type": "Released", "esrb": "T - Teen", "developers": "Ghostfire Games", "publishers": "Gamelion", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/96619-rage-of-the-gladiator\n"}