{"altername_name": [], "name": "Rayman and Rabbids Family Pack", "overview": "The Rayman and Rabbids Family Pack for Nintendo 3DS bundles together two Rabbids games - Rabbids Rumble and Rabbids 3D - and the already classic Rayman title, Rayman Origins. Rabbids Rumble -------------------------- Rabbids have escaped from your cartridge! You must collect them throughout seven worlds full of mini-games and bring the complete collection back, one battle at the time. Collect over 100 delirious Rabbids: Capture and collect over a hundred Rabbids with unique and delirious combat abilities. Train your collection of Rabbids to make them stronger and test them in battles. Challenge your friends: Play intense and hilarious one-on-one battles with your friends, mixing strategy and Rabbids' humour. The battle continues in the street: Share scores, gain training bonuses, and unlock new Rabbids with other players you cross thanks to the StreetPass feature. Complete your collection with SpotPass: With new, rare Rabbids, downloadable every week on your Nintendo 3DS, complete your collection thanks to the SpotPass feature. Experience the augmented Rabbidity: Interact with the Rabbids in new mini-games that will see them surging from your floor, flying around you, or fighting on your kitchen table! Rabbids 3D ------------------ Rabbids are bwaaack and this time they have an infallible plan to invade the human world: conquer history through the Nintendo 3DS! When they stumble into a history museum and discover time travel through their Time Washing Machine, you can bet your booty that human history is about to become a major mess. Get ready to explore and mess up with time travel in their first platform adventure, exclusively on 3DS. Teleport your Rabbids in time and make a mess out of it: Plunge into the past and revisit the greatest periods of history, like the prehistoric age or ancient Egypt. Rabbids invade the Nintendo 3DS in their first platform adventure game: Make your way through delirious and colourful 2D/3D stereoscopic worlds, kicking enemies and breaking blocks in 60 levels divided in four different time periods. Customise your bunnies: From Napoleon to the Three Musketeers, unlock figurines of your favourite characters and pimp your bunnies with over 40 historical costumes. An adventure for everyone: Rabbids get everyone addicted: its 2D/3D side-scrolling representation makes it easy to pick up, providing instant fun for kids, and the usual laugh out loud slapstick humour that adults love has never been so... bwaaah! More modes for more fun: Three unique game modes - Story Mode, Time-Attack, and Challenge Mode - provided added replay value. Rayman Origins ------------------------- When the Glade of Dreams is overrun by \"nefurrious\" Darktoons, the Fairy Council hastily invokes Rayman to save the day; but the hero of light isn't quite all there. To help him, Rayman teams up with his best friend, Globox; together, the world's most hilarious team of heroes will need to restore peace to the Glade, or watch as their beloved home vanishes like a bad dream... Rebirth of a platforming legend: Rayman Origins brings back many of the classic characters, revived in their original 2D form, as well as a whole new world of characters and environments. Unique approach to 2D art: A rich world with over 100 characters and six unique worlds created by some of the video game industry's most reputed artists and animators. A vast playground: Rayman Origins includes over 60 levels of 2D platforming gameplay designed for all ages and playing styles. Variety of gameplay: Rayman Origins is a platformer at its core, but it has elements of many game genres. Rayman and Globox gain unique abilities as they progress through the adventure, including swimming, diving, and the sensational \"HairlyCopter\". The game also features many elements of action, adventure, shooter, and beat 'em up gameplay. StreetPass functionality: Taking advantage of StreetPass, you can share your progression, number of collectibles, time played, unlocked achievements, and avatar with others. Epic boss fights: A giant pink monster with hundreds of eyes; a possessed, mountainous golem; an evil daisy-come-carnivorous plant - Rayman Origins will put players to the test with these and many more challenging boss battles! Unique approach, unique game: Rayman Origins was created by Michel Ancel with a small team of artists and developers to produce not only high-quality graphics and gameplay, but a creative and unique experience.", "platform": "Nintendo 3DS", "release_date": "October 3, 2014", "game_type": "Released", "esrb": "", "developers": "Ubisoft", "publishers": "Ubisoft", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/98353-rayman-and-rabbids-family-pack\n"}