{"altername_name": ["Nintendo presents: New Style Boutique"], "name": "Style Savvy: Trendsetters", "overview": "Style Savvy: Trendsetters is a fashion simulation game which primarily involves selecting clothing pieces for customers as per their needs and being a fashion superstar. The game's city is accessed from an ever-expanding map, allowing players to access their apartment, purchase new clothes and accessories from the Exibition Hall, change their hairstyle and makeup, purchase new furniture, access their store, participate in competitions and access various locales with the purpose of activating certain events between characters. One addition to this sequel is the introduction to various choices of men's fashion. The game also makes use of the various Nintendo 3DS features. An in-game screenshot function is supported, allowing players to take photos of a scene from the top screen at any time, saving the image as a 3D or 2D screenshot. These screenshots can then be exported to the SD card and can be viewed via the Nintendo 3DS Camera software. AR Photo Op is an additional mode which utilises the ? AR card packaged with the system to take augmented reality photographs using characters and props from the game. The Nintendo Network allows players to connect to the Fashion Plaza, where they can create and access others' Web Shops. A player's Web Shop allows them to customise the front of their store and create three outfits to sell to others, garnering additional money in-game. StreetPass is utilised to exchange Stylist Cards, which contains personalised information about your character and offers a link to the player's Web Shop. Using the Nintendo 3DS wireless local play, players can compete with up to three other players in a Wireless Fashion Show which pits players against one another to create an outfit that best matches a particular theme or style.", "platform": "Nintendo 3DS", "release_date": "September 27, 2012", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo SPD", "publishers": "Nintendo", "genres": "Construction and Management Simulation", "max_players": "4", "cooperative": "No", "rating": "3.71", "wikipedia": "https://en.wikipedia.org/wiki/Style_Savvy:_Trendsetters", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12704-style-savvy-trendsetters\n"}