{"altername_name": [], "name": "Sumico", "overview": "Sumico is a math based puzzle game. The game is played on a board full of hexagonal tiles with numbers and operators on them and the player's task is to link these together so that new numbers are created. This is done by making swipes between adjacent numbers and operators. To progress in the game the player has to reach specific targets. So for example to reach a target of 5 the player can swipe 3 + 2. However, the more steps used in an operation the more points the player will score. Therefore the player instead might choose to swipe 3 x 2 - 1 and get more points. By doing operations in multiple steps it's possible to create chains which is necessary to get a higher rating on some levels. As operations are made tiles are removed from the board until no more operations can be made. Therefore it's important to plan ahead so that all operators aren't used up. Once all targets have been reached more tiles will be dropped onto the board and new targets will be introduced. The game has two modes: campaign and endless. Campaign consists of levels that are beaten by reaching a certain number of targets. For each level the player will get a star rating depending on how well he has performed and can then move on to the next level. The campaign is divided into stages and to advance to the next stage a certain number of stars has to earned. Endless, as can be expected, goes on until there are no more operations to be made and the aim is to get as high score as possible. Here the player can choose which operators to include in the game with multiplications, divisions and squares being optional. There is also a junior mode which disables negative targets and an educational mode where actions follow the Order of Operations.", "platform": "Nintendo 3DS", "release_date": "December 18, 2014", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99449-sumico\n"}