{"altername_name": [], "name": "Swords & Soldiers 3D", "overview": "Swords and Soldiers takes the classic real-time strategy formula and refurbishes it into a side-scrolling game. The game features three scenarios: Vikings, Aztec and Chinese, each with a different difficulty level. Each \"race\" features its own specific units, a building and spells. Throughout the story campaign the player unlocks these for use. In skirmishes everything is available, but the player must research them in the game using a simple tech tree. There are also challenges available and multi-player. The game mechanics are remarkably similar to a RTS game. The player harvests gold from gold mines using a non-combat unit, researches technology to build better units and spells, and uses those to gain map control. Units will automatically walk towards the enemy camp once created, so a steady flow of units will stream from both sides of the map and will clash somewhere in the middle. The aim for the player is to tilt those melees into his advantage by creating the right units to counter enemy units and cast spells to buff friendly units or maim enemy units. There's a large variety in units per race, giving each race its own tactics. Vikings are strong, can be healed, can quickly regenerate mana, and their largest unit, the catapult, is far-ranged. Aztecs, on the other hand, have less health and regenerate mana slowly, but they can sacrifice units to regain mana, as well as poison, imprison or dominate enemy units. The Chinese use explosives which make their ranged units more powerful and in addition they have a monkey that can skip past enemy units to attack the rear guard.", "platform": "Nintendo 3DS", "release_date": "May 16, 2013", "game_type": "Released", "esrb": "", "developers": "Circle Entertainment", "publishers": "CIRCLE Entertainment", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/99452-swords-soldiers-3d\n"}