{"altername_name": [], "name": "Symphony of Eternity", "overview": "There's been a coup d'etat in the Kingdom of Eashtend. A traitor, Lady Safiro, takes control and kills most of the royal family with only the young princess being able to escape. Meanwhile a young hero along with his golem companion is searching for Regratlute, a legendary and powerful weapon. While exploring a forest they come across a young girl being attacked by a pack of wolves. The girl claims she is the princess of Eashtend and joins the party. They then decide to find Regratlute and use it to rid Eashtend of the traitor. Symphony of Eternity is a traditional Japanese-style RPG with turn based combat. The game world consists of towns and battle areas such as dungeons and the player moves between these on the world map. There are no random battles and the player can always see the enemies and try to avoid combat. The combat is round based and for each round each character can make one action. The player can choose between using a standard attack, using a skill (such a spell or special attack) or using an item (such as potions). Standard attacks are physical while skill attacks can be either physical or magical and require magic points. By attacking the same enemy in succession the player can make combinations and thereby increase the damage inflicted. There's also a break option. Each character has a break gauge and when it is filled up the character can interrupt the combat and launch an extra powerful action. Enemies come from different tribes and for each tribe some weapons and skills are more effective. Each enemy also has an weakness for certain magic elements such as fire, water, earth etc. For each battle the player earns experience and eventually the characters will level up. When levelling up the character earns a merit point which can be used to strengthen abilities. For every ten merit points allocated to an ability, it's level goes up with one. There are ten abilities in total: physical attack, magic attack, accuracy, critical hit rate, physical defense, magic defense, evasion, resistance, speed and reduced usage. Merit points can also be increased from items and equipment. Both equipment and items can be bought in stores in the villages. Equipment can also be made. Made equipment is more expensive but have more merit points which to some extent can be freely allocated by the player. Characters can also be equipped with tablets which allow them to use different skills and gain special effects. Alt Description: This is old skool gaming at it's finest. A mix of nostalgia and playability, held together by some excellent modern additions. A young man and a golem travelling around the world seeking a legendary weapon, one day rescue a girl from an attack by monsters.The girl tells them she is a royal princess, and that her family has been destroyed in a coup. She says she wants to travel together with them. But where is the legendary weapon they seek? This is the start of their journey, and of their intertwined destiny! Exciting Story The quests of the hero ranging across the whole world, a coup in the kingdom... these are just some of the many events and interactions which make up this epic story.There is an amazing outcome waiting for you, too! Quirky characters A whole range of lively, comical and emotional characters make their appearances in the game. Don't miss their appearances as they fight, each with their own purpose! Enjoy flashy battles The characters use many and various skills. You can enjoy a variety of flashy and engaging battles. The controls are simple and easy to learn, too! Comfortable playing If you like simplicity, you'll love the auto-battle system featured in this game.Everything can be controlled smoothly from the touch screen. Enjoy comfortable, stress-free play! Beautiful graphics The game features high quality WVGA graphics, and also supports output to a high-definition monitor. Immerse yourself in the beautifully-rendered world of the game.", "platform": "Nintendo 3DS", "release_date": "October 5, 2017", "game_type": "Released", "esrb": "", "developers": "Kemco", "publishers": "Kemco", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/100376-symphony-of-eternity\n"}