{"altername_name": [], "name": "Taiko no Tatsujin: Don to Katsu no Jikuu Daibouken", "overview": "Taiko no Tatsujin: Don and Katsu's Space-time Adventure (Japanese: 太鼓の達人 どんとかつの時空大冒険, Taiko no Tatsujin: Don to Katsu no Jikū Daibōken) is the 2nd Taiko no Tatsujin game released for Nintendo 3DS. It was released in June 26, 2014. It is also the first Taiko no Tatsujin game to be released in Korea. In winter 2020, Don and Katsu's Space-time Adventure, along with Dokodon! Mystery Adventure, were re-released on Nintendo Switch as part of Taiko no Tatsujin: Rhythmic Adventure Pack. Don and Katsu's Space-time Adventure was re-titled with the generic Rhythm Adventure 1 name in the US and EU release of this re-release. The core gameplay of the game is the same as its predecessors on Nintendo DS and 3DS systems. The costumes in this game are back to being in two parts, more akin to the DS games. Like its predecessor, Little Dragon and the Mysterious Orbs, it features a main story mode which contains RPG elements. Likewise, some of its featured songs have extra tracks. It is also the first Taiko no Tatsujin game which employs paid DLC (downloadable content) and QR codes to unlock extra elements such as songs, costumes and characters. Finally, it is the first game of the series to implement the StreetPass mechanic, where communication occurs between two 3DS systems when they pass by each other.", "platform": "Nintendo 3DS", "release_date": "June 26, 2014", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai Namco Entertainment", "publishers": "Bandai Namco Entertainment", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/Taiko_no_Tatsujin#Taiko_no_Tatsujin:_Don_to_Katsu_no_Jik%C5%AB_Daib%C5%8Dken", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104768-taiko-no-tatsujin-don-to-katsu-no-jikuu-daibouken\n"}