{"altername_name": ["Kuma-Tomo"], "name": "Teddy Together", "overview": "Become best friends with a teddy bear brought to life in Teddy Together, only on Nintendo 3DS family systems. Take care of a special teddy bear who can talk, walk and play games in a title that’s ideal for parents and children to play together. Who hasn’t dreamed of their favourite toy coming to life? After being delivered to your house, along with a mysterious key, Teddy springs to life and starts to talk! You can give Teddy a name and enter your own to start your newfound friendship. The tale of Teddy Together advances a bit each day as you learn more about the teddy’s purpose and the mysterious key. This curious little bear is particularly interested in learning more about friendship, and often asks questions like, “What do you do for fun?”, “How do you make friends?”, and “What’s your favourite food?” Teddy will remember your answers and talk to you about them later on, forming a unique relationship between you and Teddy, as the answers are always just between you two. You can also introduce Teddy to your friends and family by handing them your Nintendo 3DS family system. Your friends and family can give answers that Teddy will remember and even mention later on. Teddy loves to eat too, and you can play fun minigames via the Touch Screen to prepare a range of meals to feed Teddy. If the food is too hot, you’ll have to blow into the microphone to cool it down! Teddy can be a bit of a messy eater at times, so a little light cleaning might be needed after a meal. Teddy also loves to take baths! You can dress Teddy up with a big range of tops, hats, shoes, accessories and more, plus different fur colours to unlock too, making each player’s bear even more unique to them. You can get clothes, special lollies that unlock new fur colours and seeds that can be planted in the garden using in-game coins, which are earned through playing or by tapping a compatible amiibo (sold separately) once per day. Make friends with a teddy bear that comes to life and help them learn more about friendship in Teddy Together, only on Nintendo 3DS family systems!", "platform": "Nintendo 3DS", "release_date": "July 1, 2016", "game_type": "Released", "esrb": "E - Everyone", "developers": "Akira", "publishers": "Nintendo", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73347-teddy-together\n"}