{"altername_name": ["The Thieves and the 1000 Pokemon"], "name": "The Thieves and the 1000 Pokémon", "overview": "The gameplay in The Thieves and the 1000 Pokémon boils down to simple resource management. The basic gameplay loop is, the player chooses a stage to play in, chooses Pokémon to take into that stage (which may or may not be bookended by story cutscenes), and then proceeds to wield those Pokémon to get past a handful of challenges in the stage (which usually requires losing some of those Pokémon). The player's \"resources\" are Grass-, Fire-, and Water-type Pokémon, in the form of the three species of Kalos starter Pokémon, Chespin, Fennekin, and Froakie. The player starts the game by choosing which of these Pokémon they will play with; this Pokémon is the group's \"leader\" during the game, and this is the species that the player will initially have as a resource, starting at 50 Pokémon. On the bottom screen before a stage is selected, the player can choose to search for friends (なかまを　さがす) by either receiving them from StreetPass data or by using the Nintendo 3DS's Play Coins. The Pokémon received from a given player by StreetPass will match the leader that that player originally chose in their game, while those received by exchanging Play Coins match the leader that the player originally chose. Play Coins can be exchanged in groups of 5, 10, or 15 coins, and the rate of exchange both varies depending on the amount exchanged (more coins makes a better deal) and on the number of stages the player has completed (ranging from as few as 20/50/90 Pokémon to as many as 75/160/255 Pokémon). There is no other way to gain friends, and since challenging and completing a stage means losing the Pokémon that were sent into it, this may force the player to spend several days completing the game. The challenges within a stage take three forms. One is a straightforward battle with a Pokémon guarding the way, one is a sneaking challenge which may turn into a battle if failed, and one is clearing passive obstacles. At any time in any of these challenges, the player may leave the stage, which will leave any Pokémon that are still usable at that spot in the stage; multiple groups can be left at different spots in this fashion. The next time the player plays that stage, just before reaching a spot where a previous group was left, the new group will reunite with the old group and they will join forces. By reuniting with old groups, it is possible to exceed the limit of Pokémon that can normally be brought into the stage, but each species will always be limited to 333 Pokémon (any extras will leave the stage and be lost). Including the nominal leader, this makes it possible to have 1,000 Pokémon in any stage. In a battle challenge, the player must defeat enemy Pokémon in a brawl in order to advance. A pair of opposed gauges at the bottom of the top screen measures the relative progress of the player and enemy sides. If the enemy's gauge pushes the player's all the way down to the left, the player loses, but if the player pushes their gauge all the way to the right, they win. The player influences the battle by sending Pokémon from their side into the battle, while the enemy's side may also be joined by reinforcements. Depending on the battle, the enemy may be reinforced by different species at different times throughout the battle. The progress for both sides in the battle is influenced by the type effectiveness between them. The prevailing type on a side is generally determined by the type of the last Pokémon that was sent into it. At the beginning of a battle, an approximately even group of Pokémon from each type in the overall group is automatically sent in; this group's type is dominated by the leader Pokémon's type. After a battle is won, some of the Pokémon the player sent into the battle will be lost and leave the stage. In a sneaking challenge, the group spots a guard and can attempt to sneak behind it while it is facing towards the screen. The player holds the X, Y, or A button to direct either the Chespin, Fennekin, or Froakie to sneak past in a group, and the challenge is only passed when all Pokémon have made it past. As a button is held, the group starts slow and gradually moves faster, and if the button is released, any Pokémon who still haven't crossed will immediately withdraw to the starting position. Occasionally during the challenge, the guard will perk up and turn around to check behind it, and if any Pokémon are visible when it is looking behind it, the challenge will devolve into a battle (involving all Pokémon in the group, including those that had already made it across). If, after turning around, the guard sees no one, it will advance its position towards the group's starting position; if the guard advances close enough in this manner, it will spot the group and the challenge will devolve into a battle. In an obstacle-clearing challenge, the player is faced with a passive obstacle and must send Pokémon from the group against it to clear it out of the way. The player's progress is measured by a gauge at the bottom of the top screen, but unlike a battle, the obstacle never \"pushes back\". Also unlike a battle, all Pokémon that are sent against an obstacle will leave the stage when the challenge is completed. As with battles, the types on each side influence the player's progress. At the beginning of an obstacle challenge, an approximately even group of Pokémon from each type in the overall group is automatically sent in; this group's type is dominated by the leader Pokémon's type, but otherwise the prevailing type is usually that of the last Pokémon sent in. Occasionally when sending Pokémon into a battle or against an obstacle, a Pikachu will also jump in as a bonus. Pikachu do a large amount of Electric-type damage with a critical hit. Pikachu may also appear when gathering new friends from StreetPass, but this too is purely random; Pikachu is never a regular part of the player's group. Completing stages also increases the number of Pokémon the player can hold onto outside of stages. The capacity for each type of Pokémon starts at 100 and gradually grows until it reaches a maximum of 999.", "platform": "Nintendo 3DS", "release_date": "June 5, 2014", "game_type": "Released", "esrb": "", "developers": "Marvelous AQL", "publishers": "Nintendo", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/78306-the-thieves-and-the-1000-pokemon\n"}