{"altername_name": [], "name": "Toy Defense", "overview": "Toy Defense is a 2D, top-down tower defense game. It consists of three scenarios split up into multiple levels unlocked gradually. Typical for the genre, a level is completed by surviving a number of waves. The single-screen maps consist of different paths that allow enemy troops to approach from different directions and simultaneously. Their goal is to infiltrate your headquarters, removing health points until none are left. The player has a limited amount of spots to position towers. There are four types of towers available: a battery gun, a flame thrower, a tank and an anti-air cannon. They each have a certain cost through money gained by destroying enemies. Each tower has its own health and experience level. A tower needs to be repaired gradually or it is destroyed permanently. Redundant ones can also be sold. When the individual experience meter is full, it is possible to upgrade that tower for money. There are multiple and different upgrade options tied to a persistent upgrade system outside a battle. Money is not carried over across missions, but stars are earned as a second currency. These stars can be spent to unlock and upgrade several skills through a skill tree for each of the four units. Once a skill is unlocked, it can be used in a mission but still needs to be purchased. Upgrades provide faster firing, more damage, and more armour, but also introduce skills such as repairing all towers in one go or reviving destroyed ones. Enemies include troops, armoured vehicles, tanks and flying bombers. After completing a battle, a number of experienced towers can be selected to take them along to the next battle. The game is played in real-time, with two buttons to either pause the game or to fast-forward it next to the regular flow of time. There are some differences between the versions across platforms, but usually it is a free-to-play game with in-app purchases to unlock two of the three scenarios and to buy additional stars.", "platform": "Nintendo 3DS", "release_date": "February 25, 2016", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Circle Entertainment", "publishers": "CIRCLE Entertainment", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124943-toy-defense\n"}