{"altername_name": [], "name": "Unholy Heights", "overview": "Unholy Heights is a strategy game in which the player takes control over Satan himself. He has settled down and opened an apartment block for monsters. This part of the game is typical hotel management: potential tenants come looking for a room and, if accepted, pay a regular rent. This rent can be reinvested into furniture for the individual rooms to increase the tenant's satisfaction or become more attractive for stronger/richer monsters. Certain furniture types may also increase the tenant's combat statistics. The rent can be adjusted which has a direct influence on the satisfaction. The personalities of each tenant should be taken into consideration while expanding, e.g. certain monster types dislike each other. On the other hand, male and female tenants of the same type may result in result and offspring. The second big aspect of the game is combat against adventurers which try to steal Satan's gold. This can be prevented by knocking on the tenants' doors and send them to fight. Here it is important to keep the monsters' statistics into consideration, e.g. ranged attackers should not be sent to the frontlines (which is determined by the order they are sent out). The attacks are wave based, i.e. the attackers stand in line and only two opponents fight each other in melee until one is out. Damaged monsters can be ordered to return to their room. Because monsters leave for work, they may not be available. Most attacks are initiated by posting a quest on the job board. Those are not only a source of income, but are also required for game progression. It starts with one floor and four apartments, but eventually the player has to manage four floors with overall 16 rooms. Some attacks start without player intervention. The PlayStation 4 version introduces some minor changes such as more save slots, a quick tenant overview and the possibility to name the tenants' children.", "platform": "Nintendo 3DS", "release_date": "", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150087-unholy-heights\n"}