{"altername_name": ["Yo-Kai Watch 2: Mentespectros", "Youkai Watch 2: Shinuchi"], "name": "Yo-kai Watch 2: Psychic Specters", "overview": "Get wicked and complete the ultimate YO-KAI WATCH experience. The strange but friendly troublemakers, Yo-kai, are back in a time-traveling adventure, and this time their mysterious world is packed with exclusive quests, Wicked Yo-kai to befriend, new areas to explore, and a revamped Blasters action co-op mode* featuring new bosses. As the cause of life's troubles, Yo-kai are hiding everywhere! Explore the seaside town San Fantastico and the sleepy village Harrisville in search of these mischievous beings. Then travel 60 years into the past with Hovernyan to ensure the Yo-kai Watch Model Zero is created and your timeline is preserved! Battle online or via local wireless to earn in-game rewards for your adventure. Or take control of a Yo-kai in Psychic Blasters, a revamped 4-player action mode! If you own the YO-KAI WATCH 2: Bony Spirits or YO-KAI WATCH 2: Fleshy Souls game, you can transfer save data from your Nintendo 3DS family system to YO-KAI WATCH 2: Psychic Specters and pick up where you left off. Prepare yourself for the deepest and most immersive Yo-kai experience yet! * Embark on an epic adventure in Springdale with more than 350 Yo-kai to discover and befriend * Assemble and summon your team of 6 Yo-kai from your Yo-kai Watch to battle troublemaking Yo-kai, solve people's problems, and fight to end a civil war between competing Yo-kai factions * Travel back in time to discover the origin of the Yo-kai Watch and meet Classic Yo-kai from 60 years ago * For the first time, befriend Yo-kai from the Wicked Tribe as well as Boss Yo-kai and other Yo-kai exclusive to this ultimate version * Discover exclusive quests, such as the secret pasts of Darknyan, Dame Dedtime, and Whisper * Hop on the Hexpress train and explore new locations, including a Yo-kai amusement park, hot springs, and kabuki theater * Team up in an expanded version of the Yo-kai Watch Blasters local co-op mode, with powerful new bosses to defeat * Challenge your friend's team over the Internet or local wireless in 2-player multiplayer battles * Transfer game data from YO-KAI WATCH 2: Bony Spirits or YO-KAI WATCH 2: Fleshy Souls to YO-KAI WATCH 2: Psychic Specters and play from where you left off * Connect with YO-KAI WATCH 2: Bony Spirits or YO-KAI WATCH 2: Fleshy Souls to YO-KAI WATCH 2: Psychic Specters to unlock exclusive dungeons, stronger bosses, and special gleaming Yo-kai", "platform": "Nintendo 3DS", "release_date": "September 29, 2017", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Level-5", "publishers": "Level-5", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Yo-kai_Watch_2", "video_link": "https://www.youtube.com/watch?v=FmMKwJwQP8E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91465-yo-kai-watch-2-psychic-specters\n"}