{"altername_name": ["Yo-Kai Watch Blasters: Escuadron del Perro Blanco", "Youkai Watch Busters: Shiroinutai"], "name": "Yo-Kai Watch Blasters: White Dog Squad", "overview": "Join Jibanyan and his Blasters team in action-packed battles to stop the masterminds behind a series of Yo-kai shenanigans. Take down enemy Yo-kai and Big Bosses using skills and Soultimate Moves with up to 3 other friends. As you tackle missions, befriend new Yo-kai to amplify your team's awesomeness. Train with Sgt. Burly to become the strongest Blasters team there is! As you complete missions, gather Oni Orbs and items to level up or forge equipment to power up your team. Some missions, bosses, and Yo-kai are exclusive to each version. Trade Yo-kai between versions to collect them all! You can befriend all friend Yo-kai from all versions of the YO-KAI WATCH 2 game, boss Yo-kai, plus the all-new Usapyon, Blizzie, and more. Link save data with a version of YO-KAI WATCH 2 to befriend special Yo-kai. Uncover new sides to the story as well as new Yo-kai, bosses, and missions with a post-launch software update! - Team up for action-packed local and online multiplayer for up to 4 players - Strategize with different battle roles: Attacker, Healer, Ranger, and Tank Yo-kai - Embark on a journey with more than 400 new and returning Yo-kai to discover and befriend - Complete missions for items and Oni Orbs to forge equipment and level up - Experience different Yo-kai, missions, and bosses depending on the version you play - Get one of three special Yo-kai by linking data with a version of the YO-KAI WATCH 2 games: Befriend Jibanyan S with YO-KAI WATCH 2: Bony Spirits, Komasan S with YO-KAI WATCH 2: Fleshy Souls, or Komajiro S with YO-KAI WATCH 2: Psychic Specters. - Unlock the two new Oni Crank-a-kai and Lucky Crank-a-kai for even more chances to get hard-to-find Yo-kai or items. QR Code patterns and Passwords will offer you in-game coins that you can use on the Crank-a-kai.", "platform": "Nintendo 3DS", "release_date": "September 7, 2018", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Level-5", "publishers": "Nintendo", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Yo-kai_Watch_Blasters", "video_link": "https://www.youtube.com/watch?v=78BFg4OlNIw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115183-yo-kai-watch-blasters-white-dog-squad\n"}