{"altername_name": [], "name": "Youkai Sangokushi", "overview": "In the sunset under the ocean, the both teams (one are Whisper, Jibanyan, Komasan and Venoct, and another one are Kyubi, Hovernyan and USApyon) are staring to each other, and begin attacking a team with some interesting results: Jibanyan trying to uses Paws of Fury on the Hovernyan team, but failed and fought himself on mid-air. He tried to get the enemy's ship, but was fall into the underwater of the sea and sucked into the hole. Whisper team saws the Hovernyan team fires several arrows at them and escapes. Komajiro calls Komasan to escape, but he once saws arrows and mistaken as an ice cream, and trying to jump out of the boat, but fall into the underwater of the sea. Hovernyan team fires several rockets at Whisper team, but Whisper uses fan to change to direction of the rocket and fired at the Hovernyan team, causing them to panic. In an yellow void, an unknown voice saying that will choose a Yo-kai to be the true hero. And the scene cuts to a main character wakes up and finds out that the events was a nightmare. After a cutscene, the player's Yo-kai have to head to the shop and a cutscene will occur (where the unknown voice reveals the hint), then have to head to the school's library. Jibanyan and Komasan are on library and found the mysterious book. They're attempting to read the mysterious book, but a purple flash occurs and USApyon saws that Jibanyan and Komasan are sucked into the book almostly. At first, USApyon ignored them and Jibanyan shouts for his help. USApyon trying to save them, but he accidentally tripped a book and falls to the book, sucking all of the three Yo-kai in process. After finished sucking, the book automatically closes and falls to the ground, and the icon on the cover flashes with the purple aura.", "platform": "Nintendo 3DS", "release_date": "April 2, 2016", "game_type": "Released", "esrb": "", "developers": "Bandai Namco Entertainment", "publishers": "Bandai Namco Entertainment", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/145647-youkai-sangokushi\n"}