{"name": "Elite", "overview": "Elite is a free-form space trading and combat simulation, commonly considered the progenitor of this sub-genre. The player initially controls a character referred to as \"Commander Jameson\", starting at Lave Station with 100 credits and a lightly armed trading ship called Cobra Mark III. Most of the game consists of traveling to various star systems, trading with their inhabitants, gaining money and reputation. Money can also be gained by other means beside trading; these include undertaking military missions, bounty hunting, asteroid mining, and even piracy. As the player character earns money, he becomes able to upgrade his ships with enhancements such as better weapons, shields, increased cargo capacity, an automated docking system, etc.<br><br>The game utilizes pseudo-3D wire-frame graphics; its world is viewed from a first-person perspective. It has no overarching story, though a race known as Thargoids play the role of antagonists: their ships will often attack the player-controlled ship, forcing the player to engage in space combat. Combat is action-oriented, taking place in the same environment as the exploration. The player must use various weapons the ship is equipped with, as well as manoeuvre the ship, trying to dodge enemy attacks. The player can also choose to attack neutral ships; doing so will decrease the protagonist's reputation, eventually attracting the attention of the galactic police.<br><br>Elite is notable for its expansive game world, consisting of eight galaxies and 256 planets. The player is free to travel to any of these planets, provided his ship has enough fuel for the trip (the ship's fuel capacity is limited for a journey to the distance of seven light years).<br><br>The Acorn Archimedes version, ArcElite (1991), written by Warren Burch & Clive Gringras and regarded by Stuff magazine as the best conversion of the original game, added intelligent opponents who engage in their own private battles and police who take an active interest in protecting the law. As well as such gameplay enhancements, the version also exploited the more modern hardware by using polygon mesh graphics in place of the wire-frames. The game world no longer seems to be centered around the player; freighter fleets with escorts go about their own business, pirate formations patrol lawless systems looking for cargo to loot and mining ships can often be found breaking up asteroids for their mineral content. Unlike the mythical Generation Ships of the original, rare occurrences of other non-pirate entities mentioned in the manual really can be found in the Archimedes version: geometric formations of space beacons; hermits living among the asteroids; abandoned ships towed by police (although Dredgers and Generation Ships are confirmed not to exist in Archimedes Elite). The Archimedes version of Elite was originally written to be a space trading game called Trojan - however the obvious similarities eventually meant that to avoid a potential lawsuit Trojan had to become an official Elite conversion.", "platform": "Acorn Archimedes", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "David Braben and Ian Bell", "publishers": "Acornsoft", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "3.71", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/47417"}