{"name": "Pushy", "overview": "The objective of the game is to remove all of the blocks on each level, on the first level  there are 3 purple blocks and 3 green blocks. To remove these blocks you have to push them together into a row of 3 and then they will disappear, when all blocks have disappeared the level is complete. The blocks have to be removed in blocks of 3 which are all the same colour.<br><br>You can push the blocks around the screen, however there are 6 different types of blocks, and when you push them them they will act as follows : the grey ones will only move one space at a time, the purple and red ones will move until they hit a wall or another block and the green, blue and orange ones will bounce off any walls and blocks just once before they stop. If you are in the firing line when they are moving you will get squashed and a life is lost.<br><br>The monsters wander around the screen and any touch with them is fatal, however you can easily dispose of them by pushing any block over them and they will be flattened, but beware as after a while they will come back to life.<br><br>Bonus tokens appear randomly throughout the level; these include extra lives, points and invincibility. The levels are against the clock and when the time expires a special monster called Dougie will appear and he will hunt you down The only way to dispose of him is to squash him with a moving block.<br><br>you also have a ball which you can throw at the monsters to dispose of them, this ball does not work on Dougie.<br><br>When you throw your ball it will stay in the place it landed so you will have to go and retrieve it so you can use it again. If you push a block which is directly next to another block it will be automatically moved to another place on the building site, this can be very useful to get the blocks together if you have got stuck. Unfortunately the block will end up in a random place so you could get lucky or be even worse off than you were before.", "platform": "Acorn Archimedes", "release_date": "1997", "game_type": "Released", "esrb": "", "developers": "The Fourth Dimension", "publishers": "The Fourth Dimension", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80101"}