{"name": "Warlocks", "overview": "A platform shoot-em-up featuring a reincarnated knight who was tasked with freeing the world of Lylvania from the tyranny of 3 demented Warlocks.  The game set over ten large levels. The early levels are reasonably linear, but they soon become larger, requiring much exploration. Hidden rooms and caves can be found, containing extra lives, magical power-ups and level warps. Other features of this game are smooth parallax scrolling, thunder and lightning, rain, animating backdrops, stunning 256 colour graphics and great sound effects and music.<br><br>This game has been reviewed in:<br><br>Acorn Computing, Christmas Special December 1993 (with coverdisc demo)<br>Archimedes World, January 1994<br>Acorn User, February 1994<br>Acorn Action, Spring 1994<br><br>The game requires 1Mb of ram and RiscOS 2 or higher, but as it uses some minor video trickery, it will not work properly on VIDC2 machines without a software VIDC patch. It is compatible with the standard Acorn joysticks.<br><br>To enter the first hidden room, on level one after the second drop, walk left as far as you can and through the wall. This room continues past the water-fall, where you must stand on a chest and jump into the wall next to it to gain access to the third hidden part. When climbing the ladder out of the hidden room, walk into the far archway to be transported to the next level.<br><br>Many other hidden rooms are spread throughout the levels.<br><br>The levels are:<br><br>1 - The Forest<br>2 - The Graveyard<br>3 - The Waterfall<br>4 - The First Encounter<br>5 - The Giant Forest<br>6 - The Caves<br>7 - Skull Island<br>8 - The Volcano<br>9 - The Second Encounter<br>10 - The Castle", "platform": "Acorn Archimedes", "release_date": "October 23, 1993", "game_type": "Released", "esrb": "", "developers": "Network 23", "publishers": "Network 23", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=Xrc0LwX_Y0g", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/32242"}