{
  "name": "Getter Love!! Panda Love Unit",
  "shortName": "getter-love-panda-love-unit",
  "description": "<i>Getter Love!!</i> is a dating sim where a high school student and his friends are having a competition to see who will get a girlfriend first. Because of that and unlike other dating sim games you will have to face up to three human or CPU players to win the heart of the girl (or girls) you set your eyes on.<br><br>Game Start, Battle, Ranking and Memories are what the menu options include. \n<ul><li><b>Game Start</b> is the option from where you can access all the major  single and multiplayer modes.</li><ul><li>&quot;N&quot; - the main story mode of the game where you play against 3 CPU players. </li><br>\n<li>&quot;VS&quot; - same as the previous mode but opponents can be either human or CPU players.</li><br>\n<li>&quot;VS&quot; - players will only be able to go for a certain girl that is decided at the beginning of each game</li><br>\n<li>&quot;VS&quot; - players can go for any girl but there is a set time limit</li></ul><li><b>Battle</b> is where you can practice mini-games found in the main story and compete against other players.</li><br>\n<li><b>Ranking</b> allows you to see statistics like how many times you have beaten the game with each girl, the fastest time you took to beat the game, etc.</li><br>\n<li><b>Memories</b> is the place where you can view all the special events and endings you have seen during the game.</ul><b>Gameplay:</b> After selecting a name and a character, from the 8 available, you'll be given a &quot;relationship head-start&quot; for a random girl. The game will then take you to a screen where each of the 4 players can select an action before a turn starts. An action can be viewing the dates you have, finding out each girl's interests or selecting a destination and initiating the turn. By doing that you will be transported to a 3D depiction of the map where you will view random events for all 4 players. Events are usually triggered when you find a girl at the location that you visited the given time and from there you can talk with that girl and if your relationship experience with that girl is high you can give her gifts and ask her for dates. When all players' events are over the turn ends (1 day passes) and the same procedure is repeated until the girl's love meter is high enough for you to express your feelings for her.",
  "publishedBy": "Hudson Soft Company, Ltd.",
  "developedBy": "Hudson Soft Company, Ltd.",
  "released": "Dec 04, 1998",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/n64/getter-love-panda-love-unit",
  "visual": "Isometric",
  "gamePlay": "Board game",
  "setting": "",
  "release": [
    {
      "system": "Nintendo 64",
      "releases": [
        {
          "publisher": "Hudson Soft Company, Ltd.",
          "developer": "Hudson Soft Company, Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 04, 1998",
          "ean13": "4 988607 001216",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/299918-getter-love-panda-love-unit-nintendo-64-screenshot-title-screen.jpg",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/299919-getter-love-panda-love-unit-nintendo-64-screenshot-your-friends.jpg",
      "caption": "Your friends"
    },
    {
      "link": "/images/shots/l/299920-getter-love-panda-love-unit-nintendo-64-screenshot-menu.jpg",
      "caption": "Menu"
    },
    {
      "link": "/images/shots/l/299921-getter-love-panda-love-unit-nintendo-64-screenshot-the-available.jpg",
      "caption": "The available characters you can select from"
    },
    {
      "link": "/images/shots/l/299922-getter-love-panda-love-unit-nintendo-64-screenshot-selecting.jpg",
      "caption": "Selecting an action before a turn starts"
    },
    {
      "link": "/images/shots/l/299923-getter-love-panda-love-unit-nintendo-64-screenshot-a-turn.jpg",
      "caption": "A turn starts and all &quot;competitors&quot; and girls are shown here"
    },
    {
      "link": "/images/shots/l/299924-getter-love-panda-love-unit-nintendo-64-screenshot-one-of.jpg",
      "caption": "One of your friends visiting a location"
    },
    {
      "link": "/images/shots/l/299925-getter-love-panda-love-unit-nintendo-64-screenshot-chances.jpg",
      "caption": "Chances of meeting a certain girl at a certain place are increased if that girl likes the place"
    },
    {
      "link": "/images/shots/l/299926-getter-love-panda-love-unit-nintendo-64-screenshot-something.jpg",
      "caption": "Something missing from the face?"
    },
    {
      "link": "/images/shots/l/299927-getter-love-panda-love-unit-nintendo-64-screenshot-fortunately.jpg",
      "caption": "Fortunately some reactions are shown the proper way. Well, maybe not so fortunate this time"
    },
    {
      "link": "/images/shots/l/299928-getter-love-panda-love-unit-nintendo-64-screenshot-a-girl.jpg",
      "caption": "A girl's measurements"
    }
  ],
  "cover": []
}