{
  "name": "Kyojin no Doshin Kaih? Sensen Chibikko Chikko Daish?gou",
  "shortName": "kyojin-no-doshin-kaih-sensen-chibikko-chikko-daishgou",
  "description": "You, a small child, were happily playing your favourite game <a href=\"https://www.mobygames.com/game/kyojin-no-doshin-1\">Kyojin no Doshin 1</a> when mom told you to go to sleep. Reluctantly you comply. Yet sleep is the last thing you will be doing, for as soon as the lights go off and your head hits the pillow you are transformed into a shadow child and whisked to another world. In this world the Doshin Expo 1996 is being held, and it's main attraction is going to be the execution of Doshin himself for crimes against the Bardo Islanders! Say it ain't so! <br><br>All is not lost, however, you have the chance to save your yellow hero. His strength has been sapped by the Expo's eternal night, however, you can give him the energy he needs to grow by &quot;tinkling&quot; on him, more specifically you will have to fill your smiling heart shaped bladder with love &quot;tinkle&quot;.<br><br>To obtain this you must speak to women who run pavilions at the expedition. They will give you tasks to do in <a href=\"https://www.mobygames.com/game/kyojin-no-doshin-1\">Kyojin no Doshin 1</a>. You will have to swap game cartridges to do these tasks. As you complete these tasks you will be treated to segments of an animation called &quot;More Than Giant&quot; which explain how Doshin was captured and served with his horrible sentence.<br><br>Go &quot;tinkle&quot; on Doshin, help him grow and break free, there may be villainous female bikers, and so called &quot;Island Nurturers&quot;, that rule the eternal night, looking to do him in but you can overcome!",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "",
  "released": "May 17, 2000",
  "alsoFor": "",
  "genre": "DLC / add-on",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/n64/kyojin-no-doshin-kaih-sensen-chibikko-chikko-daishgou",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo 64",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 17, 2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}