{
  "name": "Madden NFL 2001",
  "shortName": "madden-nfl-2001__",
  "description": "<i>Madden NFL 2001</i> is another yearly update in the long-running football series. The version for PlayStation and Nintendo 64 comes with its own selection of teams, modes and options, refined from the <a href=\"https://www.mobygames.com/game/playstation/madden-nfl-2000\">previous year's iteration</a>. Compared to <a href=\"https://www.mobygames.com/game/windows/madden-nfl-2001\">other</a> <a href=\"https://www.mobygames.com/game/ps2/madden-nfl-2001___\">versions</a>, it has the largest number of modes, but less graphical fidelity and a lower number of selectable teams.<br><br>Players can select from the 31 teams of the 2000 NFL season and the 1999 All-Madden team on both consoles. The PlayStation version adds 31 All-Time franchise teams and 101 Classic NFL teams, from 1960 to 1999. Available modes include exhibition games, season, franchise, custom league (four to eight players), tournament (for 4, 8 or 16 players in single or double elimination), practice, and situation (set up any possible game situation to play). A new addition is called Two-Minute Drill: up to ten players compete for points by trying to perform spectacular plays within a two-minute time limit. Exclusive to the PlayStation version is the Great Games mode, allowing players to relive classic matchups from NFL history. The Great Games must be taken on in order and winning one makes the involved teams available for selection in other modes. As usual, player creation, drafting and trading as well as custom play creation is included in the game as well.<br><br>The previous year's Madden Challenge reappears in a new form called Madden Cards, resembling a collectible card game. The game includes a list of 100 challenges organized in five different levels. These include making certain plays or play combinations, beating teams under certain conditions (e.g. at home and in the rain), avoiding fumbles, sacks and penalties, et cetera. Completing a challenge gains the player tokens (how many depends on the difficulty level played at) which can be spent to buy a number of randomized Madden Cards. There are a total of 296 cards in the game (differing in rarity) which are collected in the in-game card book. Unwanted cards can be sold to regain half the tokens paid. It is also possible to trade cards with other player profiles and it is even possible to wager cards in two-player games. The cards have a number of different effects: most unlock classic players as well as hidden teams and stadiums. Others can be activated for different gameplay effects: making the game harder or easier or enabling gags such as teleporting players or putting the camera inside the ball.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "EA Tiburon",
  "released": "Sep 05, 2000",
  "alsoFor": "PlayStation | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/n64/madden-nfl-2001__",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo 64",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "EA Tiburon",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 05, 2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/5704-madden-nfl-2001-nintendo-64-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Nintendo 64"
    },
    {
      "link": "/images/covers/l/76708-madden-nfl-2001-nintendo-64-media.png",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Nintendo 64"
    }
  ]
}