{
  "name": "Midway's Greatest Arcade Hits Volume I",
  "shortName": "midways-greatest-arcade-hits-volume-i",
  "description": "A collection of classic Arcade titles:<br><br><b>Spy Hunter</b> - Weapons-based racer where as a spy you must chase the bad guys through the never ending streets of the city, using rockets, guns, oil slicks and smoke screens to take out the many enemies along the road.<br><br><b>Joust</b> - While riding an ostrich, you must knock out the other players on the field to advance to the next level.<br><br><b>Defender</b> - Much like Space Invaders, you fly a spacecraft out to stop an invasion of aliens on Earth. Unlike Space Invaders, you move up and down as well as left and right while the enemy fly down to grab humans of the planets surface.<br><br><b>Robotron</b> - Out to save the last human family, move your way through the play field while taking out the many robots that lay in your path before you.<br><br><b>Sinistar</b> - Mankind's last hope, you must shoot down asteroids while picking up items to increase your ships power before the battle with the Sinistar.<br><br><b>Rootbeer Tapper</b> - The only non-shooter title, prepare drinks for waiting customers, then slide them across the tables to them to clear the area.",
  "publishedBy": "Midway Home Entertainment, Inc.",
  "developedBy": "Digital Eclipse Software, Inc.",
  "released": "Nov, 2000",
  "alsoFor": "",
  "genre": "Compilation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/n64/midways-greatest-arcade-hits-volume-i",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo 64",
      "releases": [
        {
          "publisher": "Midway Home Entertainment, Inc.",
          "developer": "Digital Eclipse Software, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov, 2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}