{
  "name": "Spider-Man",
  "shortName": "spider-man-",
  "description": "<i>Spider-Man</i> is the first 3D game to star the popular web-slinger.  It is loosely based on <i>Spider-Man: The Animated Series</i> and <i>Spider-Man Unlimited</i> and features some of the voice cast from each and similar character designs.<br><br>Peter Parker is attending a demonstration of the reformed Dr. Otto Octavius's new invention when an imposter Spider-Man steals the device.  Spider-Man must work to clear his name and uncover the sinister motives behind the device's theft.<br><br>This game features appearances not only by most major Spider-Man characters, but cameos by numerous other characters from the Marvel Universe, such as the Human Torch, Punisher, Daredevil and Captain America.<br><br>Spider-Man's webs are greatly emphasized.  He can use them both for navigational purposes, like swinging or ziplining, and for offensive and defensive combat, such as tying up a villain, coating his fists with web for extra oomph, or building a protective shield.  His web supply is limited though and he must find new cartridges or risk running out.  The wall-crawling powers are also prominently features.  Spider-Man can cling to any wall or ceiling.  This is used for basic environmental navigation and for stealth as there are many sequences where you crawl over the heads of unsuspecting thugs, or drop down and catch them off-guard.<br><br>Combat is based around Spider-Man's ability to jump, kick, punch and web.  By combining these with direction and in various combinations, Spider-Man is able to throw objects such as furniture, hurl web balls, yank enemies into melee range and follow up with a flurry of hits, among other things.  There are a number of boss-battles as well, all of which are puzzle-based.<br><br>Missions vary from the fairly common fight-your way-to-the-goal or find-the-key-that-unlocks-the-door types to races to catch some or evade them or just trying to avoid the police.<br><br>There are several side goals in addition to the main mission including multiple unlockable Spider-Man costumes and numerous hidden comic book covers to find.",
  "publishedBy": "Activision Publishing, Inc.",
  "developedBy": "Neversoft Entertainment, Inc.",
  "released": "Nov 20, 2000",
  "alsoFor": "Dreamcast, Macintosh, PlayStation, Windows | Combined View",
  "genre": "Action",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/n64/spider-man-",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Nintendo 64",
      "releases": [
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "Neversoft Entertainment, Inc.",
          "ported": "Edge of Reality, Ltd.",
          "country": " United States",
          "releaseDate": "Nov 20, 2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/179467-spider-man-nintendo-64-screenshot-title-screen.jpg",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/179468-spider-man-nintendo-64-screenshot-main-menu.jpg",
      "caption": "Main menu."
    },
    {
      "link": "/images/shots/l/721970-spider-man-nintendo-64-screenshot-here-instead-movie-cutscenes.png",
      "caption": "Here, instead movie cutscenes a slide show is shown."
    },
    {
      "link": "/images/shots/l/721971-spider-man-nintendo-64-screenshot-black-cat-is-with-spider.png",
      "caption": "Black Cat is with Spider-Man."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/145118-spider-man-nintendo-64-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Nintendo 64"
    },
    {
      "link": "/images/covers/l/309214-spider-man-nintendo-64-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Nintendo 64"
    },
    {
      "link": "/images/covers/l/167329-spider-man-nintendo-64-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Nintendo 64"
    }
  ]
}