{
  "name": "Super Robot Spirits",
  "shortName": "super-robot-spirits",
  "description": "<i>Super Robot Spirits</i> is a one-against-one fighting game featuring big robots from the <i>Super Robot Wars</i> game series and anime TV series. The background story is basically about an mysterious force attacking Earth and the robot pilots battle it out to determine who fights the evil robots in the end. How the story plays out in detail depends on which of the seven characters is used in story mode. The selectable characters are the protagonists' mecha from the series <i>Daitarn 3</i>, <i>Dancougar</i>, <i>G Gundam</i>, <i>Dunbine</i>, <i>Xabungle</i> and <i>Voltes V</i> plus the R-1 from <a href=\"https://www.mobygames.com/search/quick?game=Shin+Super+Robot+Taisen\">Shin Super Robot Taisen</a>. By meeting certain conditions while playing, three more characters can be unlocked, including one that makes its debut in this game.<br><br>The gameplay itself follows the genre standards: both opponents can perform a set of standard and special attacks (the latter executed with certain button combinations). Every hit causes the energy bar to go down and whoever runs out first, loses. When a timer runs out, the one with the most energy left wins. Each fighter also has a second energy meter which can be used to perform especially powerful attacks. The robots also can fly which changes the available attack range. The playing modes are story, vs (two players), 64 (same as story mode without the story), Guts (fighting one opponent after another until the energy runs out), time attack (defeating opponents in a short time) and training.",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Banpresoft Co., Ltd., VertexEG",
  "released": "Jul 17, 1998",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/n64/super-robot-spirits",
  "visual": "",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "Nintendo 64",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Banpresoft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 17, 1998",
          "ean13": "4 983164 730777",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}