{"altername_name": [], "name": "After Dark Games", "overview": "After Dark Games is a spin-off from the successful After Dark screensaver collections. It features the following eleven original games: Hula Girl: A \"timed\" game of sorts (the screen moves upward and you can't leave the visible area), Hula Girl features none other than a girl with a hula hoop. Grab the cola, cupcakes, ice cream, and hula-hoops while avoiding spiders, broccoli, frogs, and mean sisters. Each platform you land on grabs you one point, but watch your yukk-o-meter! Fish Shtick: Unscramble the letters before the clock reaches 0! Collect as many points as you can and get a high score! One point for four-letter words, two for 5-letter words, three for 6-letter words, etc. Roof Rats: Get everyone off the roof and leave yourself with as few rooms remaining as possible. Eliminate rooms by putting two-or-more of the same colour together and double-clicking. Each person has their own number of floors that they can jump off of. The grannie has to be on ground level, the rat can jump off of 1 floor, the dog - 2 floors, the pogo-boy - 3 floors, the boxing kangaroo - 4 floors, the buff man - 5 floors. Solitaire: No twists here, just a simple game of Klondike. Roger Dodger: You control a glowing orb that needs to collect power-ups (green) and then make its way to the pulsing green gateway. Avoid red things; they'll kill you! Zapper: Standard trivia; yes-or-no questions. Every time you get three-in-a-row correct and your time will increase, as well as the jackpot (third) point level. Mowin' Maniac: Can you say Pac-Man? That's all this game is: a variant with a lawnmower theme. Bad Dog 911: Using six letters, create as many words as you can before time runs out! Every \"real\" word will move the scaffolding closer to you, but the clock is ticking! When it's half-past and you haven't gotten the scaffolding yet, you die! Toaster Run: Ah, the little toaster that was the first in a series of infamous screen savers. Now the little toaster is on a mission to gather all the toys and put the child in bed. Hitting an object causes the toaster to lose power; bread increases it. Watch out for the TV! The static really hurts! Foggy Boxes: Dots in disguise. Unfortunately, you can only play against the computer. MooShu: The classic game of MahJongg, carried all the way from China! Select two tiles of matching design that are free on either the left or right and they disappear! Win by removing all the tiles.", "platform": "Apple Mac OS", "release_date": "1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Berkeley Systems", "publishers": "Sierra On-Line", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.36", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129638-after-dark-games\n"}