{"altername_name": [], "name": "Assassin's Creed: Brotherhood", "overview": "Assassin's Creed: Brotherhood is a 2010 historical action-adventure open world stealth video game developed by Ubisoft Montreal and published by Ubisoft. It is the third major installment in the Assassin's Creed series, a direct sequel to 2009's Assassin's Creed II, and the second chapter in the 'Ezio trilogy'. The game was first released on the PlayStation 3 and Xbox 360 in November and December 2010, and was later made available on Microsoft Windows in March and June 2011. The story is set in a fictional history of real world events set in two time periods, the 16th and 21st centuries. The main portion of Assassin's Creed: Brotherhood takes place immediately after the plot of Assassin's Creed II, featuring 16th-century Assassin Ezio Auditore da Firenze in Italy and his quest to restore the Assassin order, and destroy his enemies: the Borgia family. Intersecting with these historical events are the modern day activities of series protagonist Desmond Miles, who relives his ancestor Ezio's memories to find a way to fight against the Assassins' enemies, the Templars, and to prevent the 2012 apocalypse. Assassin's Creed: Brotherhood is set in an open world and presented from the third-person perspective with a primary focus on using Desmond and Ezio's combat and stealth abilities to eliminate targets and explore the environment. Ezio is able to freely explore 16th-century Rome to complete side missions away from the primary storyline. The game introduced a multiplayer component to the series, portrayed as a Templar training program. The game received critical acclaim along with multiple awards including a BAFTA award for Best Action Game. It was followed in November 2011 by Assassin's Creed: Revelations, a direct sequel that served as a conclusion to Ezio's story and continued the story of Desmond Miles.", "platform": "Apple Mac OS", "release_date": "March 22, 2011", "game_type": "", "esrb": "M - Mature", "developers": "Ubisoft Montreal", "publishers": "Ubisoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7859-assassins-creed-brotherhood\n"}