{"altername_name": [], "name": "Braid", "overview": "Braid is a puzzle game disguised as a 2D platformer. The player controls Tim during his search for a princess he has known and lost. Although the objective appears to be rather straightforward at first, the meaning and the motives become much more implicit and are interwoven with the mechanics during the course of the game. From a main hub, Tim can eventually access six worlds that consist of different areas. The start of each world reveals a part of the Tim's background and emotions, rather than progressing a storyline. The second to the sixth world can be entirely explored without solving all the puzzles. Difficult situations can be ignored and revisited later. When all worlds have been completed, the first one becomes available and brings closure to the story. The game's concept is entirely based around time manipulation. Tim cannot die permanently as the player can rewind time at any moment and usually for any length, even all the way back when an area was entered. While rewinding, the music is synchronized in a similar fashion. Rather than a gimmick, rewinding is an essential element to solve the puzzles. The different worlds give a spin to the mechanic by introducing clones as the player collaborates in a parallel reality with a past version of himself, time can be affected through the movement direction, and Tim can create a circular area to cause time dilation. Certain items, enemies and parts of the scenery are immune to time manipulation or behave in a very different way. Puzzles require close examination of the environment and the behaviour of different items and enemies. As such, the game is entirely about solving the puzzle theoretically by applying the game mechanics and then using trial and error to executive it and discover possible flaws in the proposed logic. This also brings limited replayability to the game. A world is solved by collecting the puzzle pieces. These need to be arranged and eventually show a picture related to the game's story. There is no filler in the level design, meaning that every platform, item or game element (except for a few enemies) has a specific purpose to solve a puzzle. Fast times can be tracked in a separate speedrun mode. The later released Windows and Macintosh versions are identical, but come with a level editor.", "platform": "Apple Mac OS", "release_date": "May 20, 2009", "game_type": "", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14827-braid\n"}