{"altername_name": [], "name": "Castle of Dr. Brain", "overview": "Castle of Dr. Brain is an educational video game released in 1991 by Sierra On-Line. It is a puzzle adventure game. The object of the game is to successfully navigate the puzzles Dr. Brain has set up in order to become the mad scientist's assistant, a position Dr. Brain had advertised in the local classified section. To enter the castle, the player must play a game of memory at the front gate. Inside, the player must solve puzzles within the hallways and rooms of the castle. There are also three mazes in which the player must guide an elevator between and among different floors. Many of the puzzles require skill in mathematics and logic, but the game requires knowledge in a broad range of subjects. One puzzle requires the player to solve a cryptogram, and the penultimate level deals primarily with astronomy. In a rather surreal level, the player must put together a jigsaw puzzle which, when completed, becomes a room through which the player passes to go to the next level. Castle of Dr. Brain features a point-and-click mode of gameplay and three levels of difficulty, which the player can change at any time. The player can also change the pointer from a hand, which will interact with puzzles, to an eye, which will give information about an object, occasionally leading to clues to help solve puzzles. Typically, pointing the hand or the eye at an object that isn't a puzzle will give a joke about it. The game also features Hint Coins, which the player earns by solving puzzles and can use for assistance on puzzles they are having difficulty with.", "platform": "Apple Mac OS", "release_date": "1991", "game_type": "Released", "esrb": "", "developers": "Sierra On-Line", "publishers": "Sierra On-Line", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "4.33", "wikipedia": "https://en.wikipedia.org/wiki/Castle_of_Dr._Brain", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92870-castle-of-dr-brain\n"}