{"altername_name": [], "name": "Critter Crunch", "overview": "Critter Crunch is a puzzle game about Biggs, a creature that has a long, stretching tongue, enabling it to grab other creatures from afar, with an unending hunger. Biggs has to grab the creatures with his tongue and spit them out at larger creatures, which can eat them. If there is an even larger creature above those two creatures, the larger creature will swallow them up immediately, resulting in something called a food chain, which gives the player more points. When a smaller creature hits another, larger, creature, the larger one swallows. After two creatures, the larger ones will eventually explode. If you make one creature eat another and give the larger one to an even larger one, the larger one will explode. Biggs also has a son, Smalls. He must provide for his son by barfing. In cooperative mode, the second player plays as Smalls. The speed of coming creatures increases by stage, and if the creatures reach the bottom, where Biggs and Smalls are staged, it'll be a game-over. In single-player mode, filling up the hunger meter will clear a stage. In the first stages, creatures range from normal sizes and types: small, medium, and large. Later on, they start to range from things like bombs, which explode on combo-impact. As stages vary, background environments change as well--from lush forest environments to dark caves. Multiplayer modes, which include cooperative and competitive, are endless, and adventures and puzzles have an ending. The goal is to finish up the creatures or beat a high score before the creatures reach the bottom of the screen, resulting in a game-over.", "platform": "Apple Mac OS", "release_date": "September 11, 2012", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14880-critter-crunch\n"}