{"altername_name": [], "name": "Defender's Quest: Valley of the Forgotten", "overview": "Defender's Quest: Valley of the Forgotten is an indie Tower Defense game. Unlike many other tower defence games it is set in a fantasy setting and uses heroes as \"towers\" instead of structures. The player character is a female librarian named Azra (all character names, as well as appearances can be edited) who was thrown into the titular Valley of the Forgotten, which is referred to as The Pit\" in the game, after contracting a dangerous plague. But not only surviving the fall but also the plague Azra is now trapped in the Pit. Next to other survivors, the Pit is host to a number of dead plague victims, which have turned into invincible (and very Zombie like) revenants. While normally invincible, Azra has the unique ability in drawing other character into the so called \"half world\", where they can hurt those revenants. Unfortunately, while being in this \"half world\", the character cannot move from their positions and only attack in a radius around their position. And this is what constitutes the tower defence mechanic. On her Journey through the Pit, Azra meets new friends and foes, discovers the true origin of the plague and what has happened in the pit ... The gameplay is classic tower defence with a litte bit of RPG mechanics thrown in. The game has six different types of heroes (towers), which each again can be recruited up to six times. Those heroes, as well as Azra, can gain levels through XP. With each new level a skill point is available for distribution amongst several different stats, spells and abilities. The heroes can also equip a weapon and armor each to improve their combat prowess. Next to XP, each combat rewards the player with \"scraps\", which act as local currency to buy equipment and recruit new heroes. The game does not have any random element in its battles. But each battle comes in four different difficulties and can be replayed at any time to gain the higher rewards with a more experienced party. Beating a level without any damage to Azra gives special bonuses like extra money or unique items. After completing the game, several challenges are open to the player as well as a new game+ with increased difficulty.", "platform": "Apple Mac OS", "release_date": "", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24112-defenders-quest-valley-of-the-forgotten\n"}