{"altername_name": [], "name": "Jump Raven", "overview": "Jump Raven is the second title released by Cyberflix. The game is set in New York in an undefined period in the 21st century. All wildlife appears to be extinct as man has scorched the entire earth with war. Before it was too late, all animals' genetic code has been stored in biodiversity pods to bring them back safely when the ecosystem has recovered. However, a gang steals the pods and the Environmental Security Agency (ESA) brings in bounty hunter Raven to return them and preserve the animals' future. Building on the technology of Lunicus, in Jump Raven the character Raven uses a hovercraft to move around the city. The game starts in a command center where the player can read up on the events that led to the global disaster, outfit the vehicle with different types of weapons, and interview candidates for the position of co-pilot in the hovercraft (Nikki, Chablis, Limbaugh, Thrash, Lark or Dogstar). Their in-game comments bring a different atmosphere to the gameplay. While flying, there are three boroughs to search for pods: The Bronx, Brooklyn and Manhattan. The hovercraft can be moved around, it can switch between a hover and a fly mode, and players need to aim and fire weapons. As that is too much for the player to handle, tasks can be delegated to the AI co-pilot. When the pods have been found, a boss character guarding the exit needs to be taken out. While playing, the game area takes up only half of the screen. The rest is reserved for incoming video messages (including taunting opponents), general options, weapon selection, a radar, a compass, and basic statistics about ammo, fuel, shields, the pods and cash. While searching the cities, targets such as jets, sleds, helicopters, tanks and armoured cars need to be engaged. When low on fuel, shield power or weapons, the fuel truck, weapons lady (in a helicopter) and the repair bay can be visited.", "platform": "Apple Mac OS", "release_date": "1994", "game_type": "Released", "esrb": "", "developers": "Cyberflix", "publishers": "Paramount Interactive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Jump_Raven", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133830-jump-raven\n"}