{"altername_name": [], "name": "LIMBO", "overview": "Limbo is a side-scrolling puzzle platformer set in a sinister, monochromatic world. The player controls a protagonist simply known as the The Boy, who is said to enter the world Limbo in search of his sister. However, the story as a whole can also be seen as a metaphor for the search for companionship and getting around in a new environment. Not a single clue is given at the start, there are no cut-scenes and the game starts right away. In that world filled with hazards and danger, his means are few and he is extremely vulnerable. Only two buttons are used, a feeble jump and one to perform an action, combined with movement. This allows him to explore the world and hang on ledges, slide down slopes, push objects, pull levers, and cling to ropes, but the player has to make most of what is present in the environment to get by, often with physics-based elements. The gloomy world has a dusty filter showing the game through misted glass, and no vivid colours are present. It is divided into 24 chapters that seamlessly flow into each other, only from the level selection in the main menu can be derived where a new chapter starts. The world is rendered in 2D but with different layers of depth in the scenery. It moves from a forest to an abandoned city and eventually an industrial zone. The player faces three kinds of challenges. There are obstacles where The Boy simply needs to find a way to progress, there are dangerous creatures that hunt him down and try to kill them, and finally there is a gang of children who band together to ward off the intruder and set up traps for him, with a touch of Lord of the Flies. Encounters with other humans are however brief and rare. These account for most of the horror moments, of the psychological kind, with other unnerving sequences like when the player is forced to use the corpses of other children as a bridge. Music and sound effects are minimal and there are no on-screen elements referring to health or other statistics. Every single misstep, often with gruesome consequences, is fatal. In the same vein the boy cannot jump from great heights or jump very far. When dead, the game immediately reloads before the current puzzle. Most of the encounters are centered around puzzles and these are sometimes based on timing or speed when being chased. Other elements serve only for setting the scene, when The Boy gets to ride a boat to cross a lake (he cannot swim and drowns immediately) or finds the corpses of the people who did not make it in Limbo. Most of the game elements are discovered through experimentation, like the effects of a glowing worm that attaches itself to The Boy's head, changing the flow of gravity, or what happens when a giant spider captures him. There is only a single path through the levels and generally there is only a single solution to a problem.", "platform": "Apple Mac OS", "release_date": "December 21, 2011", "game_type": "", "esrb": "T - Teen", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Limbo_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/15257-limbo\n"}