{"altername_name": [], "name": "Majesty: The Fantasy Kingdom Sim", "overview": "Majesty: The Fantasy Kingdom Sim is a real-time strategy game which, unlike other games in the genre, does not have the player directly control his units. Instead, all \"heroes\" are recruited from their respective guilds and as of that moment, their will is their own. The player, the eponymous \"majesty\", can direct heroes by placing bounties on areas and specific enemies to motivate heroes. Some heroes like rangers are more keen on exploration, while rogues believe in the rule of gold. All heroes level up with combat experience, thereby increasing their statistics. Wizard's towers and certain temples allow the player to cast certain spells independently from spell-casting heroes. Some guilds and temples are mutually exclusive, and can not be present on the map under the player's ownership at the same time due to their respective heroes' rivalries. The only resource in the game is gold, and is gathered through tax collectors who patrol the player's buildings, through heroes' purchases in buildings such as marketplaces and blacksmiths, and by discovering treasure chests on the map. The storyline follows the player as the new king of the fantasy kingdom of Ardania in the quest to reunite the once large state and reclaim it from monsters and evildoers. Missions range from the typical seek-and-destroy type to rescuing certain characters, and there is a random map generator available in single- and multiplayer in which tasks, map types and monster strength can be set at will. The main singleplayer campaign is split to regions, and the final mission of each region requires all prior relevant missions to be completed first. The final mission can only be accessed by finishing the entire rest of the campaign.", "platform": "Apple Mac OS", "release_date": "2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Cyberlore Studios", "publishers": "MacPlay", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/132451-majesty-the-fantasy-kingdom-sim\n"}