{"altername_name": [], "name": "Nancy Drew: Shadow at the Water's Edge", "overview": "This adventure game takes place in Kyoto, Japan, at the site of a beautiful Japanese inn, the Ryokan Hiei. Nancy teaches English to young students while friends Bess and George attend a convention. When an encounter with an angry ghost startles Nancy and scares other guests away, she begins investigating a mysterious death which occurred at the inn five years ago. Nancy Drew: Shadow at the Water's Edge has a colorful 3D atmosphere and characters. Some parts of the game are intended to give players a sense of foreboding and, therefore, have haunting music and darker scenes. Conversations with the in-game characters trigger other events, puzzle-solving opportunities and additional character questions. Puzzles are varied and numerous. Some are based on cultural pastimes like sudoku and pachinko. Others include number puzzles, or image manipulating puzzles. Like in Message in a Haunted Mansion, the game includes a clock since the time of day influences when some events or conversations will occur. Players will also take part in crafting (origami and calligraphy) and cooking a Japanese meal. The game plays similarly to other releases in the series with a point-and-click interface. Icons are placed at the bottom of the screen for inventory, a journal, a cellphone which doubles as a camera, a to-do checklist and other game mechanics. There is a bonus system that awards achievements to those who are the most thorough detectives. Previously given to Preorder customers as a \"digital special edition\", these achievements come in the form of additional material like mini-games for Nancy's cellphone or outfits for her phone avatar.", "platform": "Apple Mac OS", "release_date": "October 19, 2010", "game_type": "Released", "esrb": "E - Everyone", "developers": "Her Interactive", "publishers": "Her Interactive", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/110703-nancy-drew-shadow-at-the-waters-edge\n"}