{"altername_name": [], "name": "Poker Night at the Inventory", "overview": "Hidden in a back alley lies a secret club, known as The Inventory. Here, assorted video game characters hang out to relax, chill, and play cards. You gain access to this exclusive club, and get to play against some famous faces: Tycho of Penny Arcade and Penny Arcade Adventures, The Heavy from Team Fortress 2, Strong Bad from Homestar Runner and Strong Bad's Cool Game for Attractive People and Max from Steve Purcell's Sam & Max comic series. A key feature of the game is the characters' banter between each other. They will chat with other players, bluff, taunt and worry when they think they're in trouble. Poker Night at the Inventory is, at its core, a simulation of Texas Hold 'em Poker. You play against four opponents (Tycho, The Heavy, Strong Bad and Max) and attempt to beat them in a game of Poker. As the game is played in Hold 'em style, each player is dealt two cards. The remaining cards are used by everyone to make their hand, but you don't know what they are. Based on the cards you have, as well as the cards that get revealed through a round, it's up to you whether to gamble, bluff or fold. Just because you have a poor hand doesn't mean that you will automatically lose - you can trick your opponents into thinking that you've got something much better, causing them to fold first. As you win games, you'll unlock new themed card decks and poker tables, which can be selected from the in-game options. Occasionally, one character will put their special item up as a buy in rather than their standard wad o' cash. If you make the character go bust when they've bought in with their special item, you obtain it for yourself and can use it in Team Fortress 2.", "platform": "Apple Mac OS", "release_date": "November 22, 2010", "game_type": "", "esrb": "", "developers": "Telltale Games", "publishers": "", "genres": "", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10127-poker-night-at-the-inventory\n"}