{"altername_name": [], "name": "Prince of Persia (2008)", "overview": "Prince of Persia once again resets the timeline of the series and marks the start of a new trilogy with the Prince on the search for Farah, his donkey, which is loaded with treasures beyond imagining. But after an sandstorm he falls down into a canyon and meets Elika, a princess with magical powers. She's being hunted by the army of her father and has to make her way to the temple beneath the tree of life. But they come too late. After a brief fight against her father, he breaks the seal and by doing so unlocks the prison chamber that was kept closed by the powers of the Tree of Life. The inhabitant of that prison? Ahriman - God of Darkness. Creator of the darkness of space and the first to unleash envy and hate. Back in the days he was not satisfied with keeping only one half of the universe and after a fierce battle against his brother Ormazd, God of Light, he almost won. In a last attempt Ormazd successfully lured Ahriman into the Tree of Life, condemning him to a thousand years of pain. But Ahriman was only waiting. Waiting and planning and now that he is free, he and his minions are beginning to claim back what they lost and the only two people on the world to stop them are the Prince and Elika. The basic gameplay remains the same as in the previous trilogy with the Prince engaging in sword fighting, wall climbing, spike dodging, puzzle solving, and more, in his quest to save the world. But opposed to the previous trilogy, the Prince neither can rewind time nor has to fight multiple enemies at a time. Instead he and Elika only face one, strong enemy every time and if the Prince is about to die because of a miscalculated jump or anyhing similar, she uses her powers and sets the Prince back to the beginning of the jumping puzzle. That is not the only thing she does. By command of the player, she also helps in fights, allows him to jump further distances by giving him a little push in the back in mid-air and shows which way to go next. Elika is also the key to bring the Tree of Life back to full strength. But to do so, she needs so-called \"Seeds of Life\" that are scattered all around the levels. If the player has collected enough of these, Elika will also become stronger. Besides the enemies being stronger, more intelligent and having more special abilities, the fights play similar to the previous iterations of the series with the Prince slashing away at enemies with his sword or his gauntlet in to produce powerful combos. The gauntlet also allows the prince to slide down from solid rocks safely to the area below. The game features Quick Time Events when an enemy got a hold on the Prince and uses a cel-shaded and heavily stylized look for the characters.", "platform": "Apple Mac OS", "release_date": "March 1, 2009", "game_type": "", "esrb": "T - Teen", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/15699-prince-of-persia-2008\n"}