{"altername_name": [], "name": "Qasir al-Wasat", "overview": "Qasir Al-Wasat: A Night in-Between is a stealth action game with puzzle elements. It is set in Syria in the 12th century where a frail, invisible creature is summoned from a different existence by a sorcerer for an infiltration and assassination mission. He needs to assassinate three targets to recover their weapons. When three types of poison are collected, the being will be free to act on its own, away from the sorcerer's influence. The game is played from a top-down perspective with a slight fisheye lens effect. The character is invisible to the human eye, but can still be spotted through sound and visual elements such as blood that sticks to its form or water rippling when it travels through a pool. Water can also be used to wash off the blood and regain full invisibility, which is defined through a percentage. The guards' awareness is shown through a question or exclamation mark above their head, and they will chase the creature as long as it is shown. A single hit is lethal. Movement can be done running or at a much slower pace to remain undetected. Killing is done with a slash, but poison can also be used with a limited amount of it available. By pausing a level map can be accessed to view the environment and important marks such as the target. Puzzle elements are for instance introduced through keys that need to be taken from specific guards to open doors. There are also many avoidance puzzles through traps. Some puzzles are much more complex and are played out in a separate screen where items and gears need to be manipulated with clues through visuals and sound. Many rooms in the game are secret and optional, and the story is often furthered by overhearing conversations and the creature's own thoughts.", "platform": "Apple Mac OS", "release_date": "July 1, 2012", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10729-qasir-al-wasat\n"}