{"altername_name": [], "name": "Shank 2", "overview": "Shank 2 is the sequel to Shank and just like the first game it is a 2D side-scrolling platformer based around fighting multiple enemies at once, combined with jumping and climbing platform elements. After the events of the first game Shank travels to a country with a South American setting in search of Linda, the woman who raised him at the orphanage. The country is ruled by Magnus, who was elected after promising to deal with the illegal cartels. He has a weak heart however and Linda appears to be the only one who can provide him with a viable transplant, so he kidnaps her. The events start when Shank's bus is halted and due to his fights against Magnus's minions the locals think he joins their rebellion. Combat is based around chaining attacks together, using revolvers, knives, a shotgun, a chainsaw, a baseball bat, grenades, mines, and more. Offensive attacks combine melee combat with long-ranged attacks, and always with a cartoon-like, over-the-top sense of violence and gore. The block ability from the first game has been replaced by a roll maneuve tot dodge incoming attacks. Entirely new is a counter action. When enemies attack a red exclamation mark appears above their heads. When timed correctly it is possible to grapple them, prevent the attack, and counter with an instant kill. The type of counter attack is different for each type of equipped weapon. Shooting has been made more fluent and it is now possible to switch weapons mid-air or more quickly in the middle of a combo. Weapons can no longer be traded in during levels. It is defined at the start of the game (with a number of weapons that need to be unlocked) and the gear load-out can now be changed after death. Sometimes it is possible to use or activate items in the environment to take out many opponents at once. There are also items such as turrets, decoys, and even a wild boar that can be introduced to hinder the enemy. Next to the main Campaign story mode with two difficulty levels there is a Survival mode with the goal to survive as long as possible fighting waves of enemies on one of three levels. Survival can be played in offline and online multiplayer for two players, replacing the local cooperative campaign multiplayer mode from the first game. The multiplayer mode introduces 16 different characters each with their own abilities, health bonuses, items discounts and damage modifiers. The characters can also be unlocked for the Campaign mode. During the game different types of rebel intelligence can be collected and these can be viewed in a separate gallery.", "platform": "Apple Mac OS", "release_date": "February 19, 2013", "game_type": "", "esrb": "M - Mature", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/15995-shank-2\n"}