{"altername_name": [], "name": "Sid Meier's Colonization", "overview": "Sid Meier's Colonization is a strategy game which puts you in the role of Viceroy of the New World. You are sent by your King and country to establish colonies in the newly-discovered Americas that lie to the west. You face many of the same challenges that faced colonial organizers of the time-competition from other Old World powers, strange native cultures, the problems of establishing profitable trade programs, and the problems of organizing an army from a rag-tag band of colonists. The game begins with the European discovery of the Americas (1500) and continues until approximately the time of the American Revolution (1800). In the beginning of the game you are given a trading/exploration ship and a small group of colonists. You have no knowledge of what lies ahead of your ship, so you must explore until you find a suitable spot to lay down your first colony. As your colonies grow larger and larger, you inevitably encounter native populations and are confronted with competing imperial powers from the Old World. Each of your colonies is populated by a number of colonists, who you can assign to various tasks. Some chop wood, mine for ore and collect plants outside the colony, some others stay inside to turn those raw materials into more valuable cargo - such as rum (made from sugar), coats (made of furs) or hammers (made of lumber). Hammers which aren't a cargo you can sell, but represent the speed with which you construct new buildings in your colony. Some colonists are specialists, and thus are more effective at a certain job.", "platform": "Apple Mac OS", "release_date": "1995", "game_type": "Released", "esrb": "", "developers": "MPS Labs", "publishers": "MicroProse Software, Inc.", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129769-sid-meiers-colonization\n"}