{"altername_name": [], "name": "Skylanders: Spyro's Adventure", "overview": "Skylanders: Spyro's Adventure is the first video game in the Skylanders series. It is a video game that is played along with toy figures that interact with it through a \"Portal of Power\", that reads their tag through NFC and features the voices of Josh Keaton, Dave Wittenberg, Darin De Paul, Joey Camen, Audrey Wasilewski, Keythe Farley and Kevin Michael Richardson. Skylanders Spyro's Adventure was published by Activision and developed by Toys for Bob. It was released on October 12, 2011 in Australia for the PC and October 13, 2011 on other consoles. The game was released in Europe on October 14, 2011, in North America on October 16, 2011, and it was released in South America (including Brazil) by Neoplay on December 15, 2011.[1][2] Japan eventually finally saw a release of this game, being handled by Toys \"R\" Us and Square Enix and was released for the Wii, PlayStation 3, Nintendo 3DS and the region has also received a unique Wii U port exclusively (instead of having an Xbox 360 release), being released on July 12, 2013, which was nearly two years after its release in the western regions, thus making this the first Spyro game to be released in Japan in almost 10 years, since Spyro Orange: The Cortex Conspiracy.[3] It is also the final Japanese release of Spyro the Dragon series to be owned by Vivendi SA (Formerly Vivendi Universal). Activision announced that as of June 3, 2012, the game had been the top selling console and handheld video game worldwide for 2012.[4][5] As of March 31, 2012, Activision has sold over 30 million Skylanders toys, and sales are expected to exceed $500 million by the end of the year.[6][7] A direct sequel, Skylanders: Giants, was released in 2012 for the Nintendo 3DS, PlayStation 3, Wii, Wii U, and Xbox 360. This is the only Skylanders game to be released on PC.", "platform": "Apple Mac OS", "release_date": "October 16, 2011", "game_type": "", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/16093-skylanders-spyros-adventure\n"}