{"altername_name": [], "name": "Space Colony", "overview": "In the future, mankind expands through the galaxy, and corporations race to exploit every planet they can. You are the employee of Blackwater Industries (\"Putting profit before people.\") given the task of running a series of off-world colonies. You must manage both the base and the personnel which inhabit and run this base. This task is complicated by the fact that the colonists are all rejects from society, and will cause problems of one sort or another. Space Colony is both a strategy game and a personality management simulation; it can be described as Stronghold and The Sims combined, put in space. You will have to set up resource harvesting, resource processing, recreation facilities, tourist facilities, military installations, and such to keep your colonists happy/productive, defend the base, and make money. The colonists have a shift cycle, how long they will work is directly affected by how happy they are, so it pays to have a good base. What makes this game distinct is that each colonist has a unique personality. There are around twenty colonists which will populate your base in one mission or another. Each colonist has personal likes and dislikes, some are social, others will pick fights; you have to achieve a balance. There are a number of game modes, Career Mode, Galaxy Mode, Sandbox Mode, and you can play user-created maps. In individual missions, you will have to compete against rival corporations or aliens for domination of the planet you are exploiting. Once you have stripped the planet bare, you will move on again, and start the process over again.", "platform": "Apple Mac OS", "release_date": "2004", "game_type": "Released", "esrb": "T - Teen", "developers": "Firefly Studios", "publishers": "Aspyr Media", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Space_Colony_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151978-space-colony\n"}