{"altername_name": [], "name": "Starflight", "overview": "A long time ago, a great empire comprised of Humans, Velox, Thrynn and Elowan ruled the stars. The Empire's currency was an energy source called Endurium. But something happened and this empire is no more. Furthermore, the small colony world named Arth has forgotten this heritage and technology. A thousand years have since passed and the people of Arth have rediscovered archaeological evidence of their empire. Using these discoveries, they create spaceships and form the Interstel corporation to govern the fleet. It's time to take the first steps back into space... but could it be the same enemy that destroyed the Empire still exists? Starflight is a space exploration game with role-playing elements. The game is completely non-linear, allowing the player to venture to any star system and explore any of the vast amount of available planets. The main plot is advanced by following cryptic clues either received as transmissions at the initial spaceport, or obtained as a result of successful communication with various alien races populating the universe. The player must first form a crew, assign their positions and customize the spaceship before blasting off from spacedock. Besides the captain of the ship, a science officer, a navigator, an engineer, a communicator, and a doctor have to be assigned to the ship. The player can choose between Humans, Velox, Thrynn, Elowan, and Android races when creating the characters. Each profession usually has a racial counterpart with the highest proficiency in it. Except Androids, members of every race can be trained in their skills by spending the game's currency. In the starting location the player can also acquire better weapons, armor, and shields for the ship, as well as outfit it with cargo pods. Terrain vehicle can be customized as well.", "platform": "Apple Mac OS", "release_date": "1990", "game_type": "Released", "esrb": "", "developers": "Binary Systems", "publishers": "Electronic Arts, Inc.", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129773-starflight\n"}