{"altername_name": [], "name": "Star Trek Online", "overview": "Star Trek Online is a MMORPG set in the Star Trek universe. The game takes place 30 years after the events in the movie Star Trek: Nemesis (2002) and builds upon the destruction of the Romulan homeworld Romulus portrayed at the beginning of Star Trek (2009). With the Romulans being crippled and even at the point of extinction, the Klingons seize the opportunity in 2382 and start conquering the Romulan sector, leading to a strained relationship with the Federation. In 2399 the band snaps and the Khitomer Accords, the sole reason for 106 years of peace, are broken. Now the current game date is 2409 and war rages in the Alpha Quadrant with the Federation fighting against the Klingons, an again-strong Dominion, the Borg and several other enemies. At the start of the game, the player creates a Federation character and can choose from nine different races including Trill, Andorian and Vulcan. The ability to create a member of the Klingon Empire like a Gorn or an Orion becomes only available after reaching level 6 (of 50) as a member of the Federation. This limitation takes into consideration that the Klingon Empire is focused on Player-vs-Player-Combat either against themselves or members of the Federation in combat-arenas or in space with only a handful of quests being available to Klingon players. Besides that difference, the gameplay remains the same on both sides. The game is divided into two parts: Space and Land. Right from the start of the game, the player has full control over his own star-ship from a 3rd-person point-of-view allowing him to traverse the space between the sectors and the star-systems on a tactical map as well as take part in full-blown space battles. The player always directly controls the movement of his ship and has full control over its speed, weapons, shields and energy-allocation making the battles very tactical, although not as complex as in the Star Trek: Starfleet Command series. In addition the player has access to special abilities depending on which of the three classes (science, engineering or tactical officer) the player chose for his character. He can also employ help from up to three bridge officers who themselves have special talents. NPC bridge officers also beam down with the player to planets, stations and such if he's not in a team with other human players. Land battles are fought in real-time (again from a 3rd-person perspective) but are more stationary and play more like combat in other MMOs than the space battles. Although flanking an opponent gives a bonus to damage, using abilities is the main way to success and experience points. Each enemy whether killed in space or on the ground grants experience points and advances both the player and his bridge officers in rank (which function as levels). This way the player and his officers earn skill points to be distributed among the several different skill trees, unlocking new abilities for both ground and space or improving existing ones. The player always has full control over his bridge officers. He alone decides their armor and weaponry, which skills they level up and if they are worthy to be promoted to a new rank. This is also the case for his ship which he can outfit with better gear, change the appearance of or replace with a completely new one once he's reached specific ranks and unlocked access to new ship classes. Each star system in the game is its own instance while the overall tactical map is hosted on one server. Once a player enters a system, he'll automatically join other players already there and be brought up to speed regarding the current status of their quest (if there is one). Once the objectives - usually a combination of space and ground battles - are completed, the players return to the tactical map and can get their reward right away through the use of the communicator instead of flying back to the quest-giver. Typically new quests are also obtained this way.", "platform": "Apple Mac OS", "release_date": "March 11, 2014", "game_type": "Released", "esrb": "T - Teen", "developers": "Cryptic Studios", "publishers": "Cryptic Studios", "genres": "MMO", "max_players": "4", "cooperative": "Yes", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Star_Trek_Online", "video_link": "http://www.youtube.com/watch?v=x6EOcxMaI7o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/21935-star-trek-online\n"}