{"altername_name": [], "name": "Sunless Sea", "overview": "Sunless Sea is a nautical exploration, survival and trading game with roguelike elements set in an alternate version of 19th century London. It has sunk below the surface and is now a subterranean archipelago surrounded by a large ocean, known as the Unterzee. The game is set in the same Victorian steampunk environment of Fallen London and borrows a lot of lore, but now as a game of strategic exploration instead of a pure RPG. At the start a past for the protagonist can be constructed, but it can also be determined at a later time. The captain can be a poet, a street urchin, a war veteran, an ordained priest or a philosopher. It determines a specific crew member, the starting amount of Echo (the main currency) and an extensive bonus for one of the main skills: veils (evasion), pages (knowledge), iron (damage), hearts (healing and morale) and mirrors (deception and perception). In addition a light-class steamer is provided as a first boat along with zailors (crew members), a mascot and a starting level for all skills. Crew member roles include a cook, a gunnery officer, a surgeon, a chief engineer, a first officer etc. The next step is choosing an ambition, which determines the winning condition for the game. You can choose to become a venerated explorer (fullfillment), acquire a mansion and retire (wealth), discover your father's bones and bury them (your father's bones), establish a settlement where you rule (a private kingdom), or travel beyond the map's edge (the uttermost East). The rest of the story, past and development is based on the choices made during the game. Starting in Fallen London the goal is to explore with the ship and survive. Important parameters to track include the engine temperature, the amount of fuel (and tanks) left, hunger (and supplies), terror (zailors' morale), hull status and hold capacity. A Zee Bat can be sent out to search islands and report back. While exploring the lights can be turned off, which raises the terror meter, but reduces the chance of attracting monsters. Repairs can be done at ports, but also en route at the cost of supplies. Most of the information, actions and the many story fragments are grouped together in the Gazetteer. It offers an overview of the ship's contents in the hold (goods and curiosities), a journal and a detailed overview of the officers. When docked it offers access to the story elements, various shops and the shipyard. In main locations the cities and surroundings can be explored, new recruits can be hired, upgrades can be acquired and trade is possible. All of this is shown through text and images in the Gazetteer. While exploring the ship's speed can be determined and it is controlled through keyboard keys. Various ships and creatures are encountered that can be avoided or be battled. Through exploration experience is gained and entries in the logbook are triggered. Many locations can be discovered. Actions and challenges become available that further the story and these are all presented through text and options in the Gazetteer. Some of these only expand the story, while others provide new opportunities and rewards. Other ships can also be docked for similar events. During fights (which can also be avoided) a versus screen is shown with statistics such as health and crew (for ships) for both sides. There are different attack options, but these are only available if the opposition is illuminated sufficiently. The distance between the two parties also plays a role. Combat is turn-based. Selected actions are queued up and then both sides perform them in succession, simultaneously, as each type of action consumes an amount of time. Actions include attack, various types of illumination such as flares, setting the water on fire by spending oil or narrowing the distance, using various forms of evasion, and miscellaneous ones such as quick repairs or observation to study the enemy. Each action has advantages and drawbacks and many influence illumination of your ship and the enemy, which is one of the most important parameters during combat. It also possible to disengage and escape from the fight. The results of actions are shown through a log on the right with some visual effects. Loot, food and knowledge can be gathered for additional items or trade. To survive the player carefully needs to manage the various resources and exploration options. The map is randomly generated for each session with only a few major shorelines in fixed positions. In the same way the story is not fixed and is it based on different fragments that are weaved together in different ways. It is possible to leave behind a legacy and pass on information, weapons, money, crew members, the chart or skills for the next adventurer. It is also possible to ignore the initial ambition and explore other opportunities and secrets instead.", "platform": "Apple Mac OS", "release_date": "February 6, 2015", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24946-sunless-sea\n"}