{"altername_name": [], "name": "The Sims 3: Pets", "overview": "In Pets, there is a new town called Appaloosa Plains. The new town comes with every building in the base game, as well as new stores and shops. In the Limited Edition, the town also comes with a pet store.[5] The expansion comes with new rabbit holes, as well as old rabbit holes with new designs. Every pet will have its own special needs. Sims can also play with laser pointers for playing with cats. Unicorns, if found, in the game are magical and can be added to a sim's household. They can set things on fire, teleport, curse or bless sims. They can breed with both unicorns and horses.[6] Sims up into their teenage years can ride horses. Dogs can swim in swimming pools, but they can not drown, as pets can only die by old age. A user can have up to 6 pets in one household. This also extends the maximum amount of sims in a household from 8 to 10. There are new professions for sims such as \"Horse Handler\". Pets also comes with wildlife, but they cannot be added to households.[7] There are also ways for sims to interact with their pets. Players can use their horses as a form of transportation. Sims can adopt and bathe pets. They can also have dogs and cats go around town and sniff for collectables. These collectables can be sold or stored in terrariums.[8] Pets can learn skills. Cats and dogs can learn to hunt, dogs can learn to locate collectibles, and horses can learn racing and jumping. There are over a hundred breeds of dogs and cats. Players may have a poodle with short hair, or you may also have a Poodle with Dalmatian spots.[9] Pets can meet, fall in love and reproduce. They can try to have puppies, kittens, or foals, and will also have family trees. Players can adopt horses and train them to run in races. The PC version will be bundled in a package with the base game as The Sims 3 Plus Pets.", "platform": "Apple Mac OS", "release_date": "October 18, 2011", "game_type": "DLC", "esrb": "T - Teen", "developers": "", "publishers": "", "genres": "Life Simulation", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/16039-the-sims-3-pets\n"}