{"altername_name": [], "name": "Through the Looking Glass", "overview": "This is one of the first Macintosh games released and was created in-house at Apple. It was announced at the computer's launch and was featured in the original brochure, but its release was delayed until a couple of months later. The packaging is quite unique. Since this is an Alice in Wonderland themed game, the packaging is meant to look like Lewis Carroll's famous novel. It opens like a book to reveal the 400K floppy disk inside. The game is a chess game of sorts. The board is viewed with a depth-perspective so that pieces and squares appear smaller the further away they are. At first, 6 chess pieces are lined up at front of the board and you choose which piece you want Alice to take on the moves of. Once the game starts, Alice (seen from a behind-view) must capture all pieces on the board. All pieces will hop around in arcing moves above the board and you as Alice must click on squares that are valid to move to according to the abilities of the piece you chose at start. If you are captured, your score decreases, and increases based on the value of pieces taken. A perfect score of 999 is only possible if you allow all the pawns to become queens before capturing them. There is an options screen if you hold your mouse pointer over the score. The Cheshire Cat appears on-screen and you can alter the game speed, flip the board upside-down or activate holes to appear randomly on chess board which capture any piece unlucky to be on that square. The game disk also contained some extras such as fonts and a maze generator game called Amazing.", "platform": "Apple Mac OS", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Apple Computer", "publishers": "Apple Computer", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150937-through-the-looking-glass\n"}