{"altername_name": ["Wizardry VI: Bane of the Cosmic Forge"], "name": "Wizardry: Bane of the Cosmic Forge", "overview": "It is said the the Cosmic Forge is a magical pen possessing an enormous power: whatever is written with it instantly becomes true. A group of explorers ventures into the castle that where the king, the queen, and the wizard who created the pen used to dwell. Nobody knows what has been happening there for the last hundred years, since nobody dares to enter the haunted castle. As the heroes step in, the doors behind them close forever. They are left alone to discover the truth about the Cosmic Forge and the drama that occurred between the castle's inhabitants. Bane of the Cosmic Forge is the sixth entry in the Wizardry series. While retaining the basic premise of creating a party of up to six adventurers to roam first-person dungeons and fight enemies in turn-based combat, this installment contains numerous enhancements and new features. It is the first game in the series to feature full color graphics and a mouse-driven interface. Combat options are more detailed, with precise weapon moves (such as thrust and bash) available. Magic is divided into six different schools, the spellcaster's powers increasing if he or she concentrates on one of them. Picking locks or disarming traps by thief-like classes is done actively by participating in a simple minigame. Characters can learn skills unique to their class when leveling up. These skills range from weapon proficiencies to field abilities that can be used outside of combat.", "platform": "Apple Mac OS", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Sir-Tech Software", "publishers": "Sir-Tech Software", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Wizardry_VI:_Bane_of_the_Cosmic_Forge", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151862-wizardry-bane-of-the-cosmic-forge\n"}