{"altername_name": [], "name": "Yoot Tower", "overview": "The quasi-sequel to Sim Tower, Yoot Tower is a building simulator that lets you build towers in such exotic locales as Kegon Falls (underground tourist resort), Waikiki (paradise destination) and Tokyo (the complete arcology). The player starts on a empty plot of land and must develop it into a successful and profitable venture by inserting rooms of different kinds (from shops to condominiums) and connecting them to transport systems, all according to their requirements. When a player fulfills a certain condition (such as the number of tenants), a VIP visits the building, and if his impression is favourable, the rating goes up, unlocking more rooms and facilities to expand the tower. The goal is to reach the ultimate level, and place an attraction (such as a chapel or a baseball field) on the top floor. There are several rooms to expand your tower, usually starting with stores and restaurants plus hotel rooms (which provide daily income), expanding to offices, condominiums and apartments and other tenancy rooms. However, all these rooms need extra support in the form of facilities such as restrooms, vigilance rooms, as well as convention centers to attract more visitors or simply please your tenants. They must be always happy, or you risk seeing them leave if they aren't happy with the time it takes to move between locations or if there's too much noise. One of the key aspects in the game is balancing the transport system - elevators, stairs and escalators. There are thee kinds of elevators: Simple, Express or Service. Simple elevators provide floor-to-floor operation (although you can choose not to stop at a particular floor), Express work in 15 floor intervals and Service are used only by stores and general tower staff (security and cleaning). More than one elevator can be added to a shaft, but each shaft has a limit on the floors it can cover. Stairs and escalators do the same function: short travel between floors, but while escalators are used for commercial areas, stairs are used for residential and office blocks.", "platform": "Apple Mac OS", "release_date": "November 24, 1998", "game_type": "Released", "esrb": "E - Everyone", "developers": "OPeNBooK9003", "publishers": "Sega of America", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Yoot_Tower", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133842-yoot-tower\n"}