{
  "name": "A Slow Year",
  "shortName": "a-slow-year",
  "description": "<i>A Slow Year</i> is described by the author as a chapbook of game poems. It is a collection of four games, one for each season, and although the player can interact directly, its focus is on observation. It was originally created for the Atari VCS (Atari 2600) with the constraints of that system. Each game forms a game poem of one kilobyte, and the game was later adapted for the PC.<br><br>The game was originally released in two editions: for the Atari as a boxed, limited edition with a hardcover book and a cartridge, and for the PC with a paperback book and a disc to run the game on PC through a custom Atari emulator. At a later time the PC version was released digitally as a download with an e-book. The book is about 150 pages and contains essays about the commonalities between videogames and poetry. It also has 1,024 haiku poetry generated by a computer, and an introduction to the game, the inspiration and its history, and a how to play section. The digital edition has a new preface and an interview.<br><br>The four games are accessed simultaneously and the player can switch between them at any moment through a button of key. Further interaction is done through the joystick or four keys on the keyboard, as well as the red button or the space bar. No further instructions are provided and it is up to the player to figure out the meaning. All games are played through the first-person perspective and have a goal that can be achieved or a gameplay mechanic that can be mastered. Spring shows a rainy pavement along with lightning and thunder. Summer is about following an aimless twig in the water and an interaction closes your eyes. Autumn shows a tree with falling leaves in gusts of wind. Winter is about staring out of the window while drinking coffee.",
  "publishedBy": "",
  "developedBy": "",
  "released": "2010",
  "alsoFor": "Macintosh, Windows | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/a-slow-year",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": []
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/293925-a-slow-year-atari-2600-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Promotional",
      "country": "Worldwide",
      "platforms": "Atari 2600, Macintosh and Windows"
    }
  ]
}