{
  "name": "AtariAge Holiday Greetings 2007",
  "shortName": "atariage-holiday-greetings-2007",
  "description": "This is the 2007 holiday cartridge from <a href=\"https://www.mobygames.com/search/quick?company=AtariAge\">AtariAge</a>. This year the cartridge, dubbed <i>Stella's Stocking</i>, contains five games.<br><br><b>Stay Frosty</b>:<br>\nYou are a snowman at the North Pole. One of the Christmas lights on Santa's barn, where he stores the reindeer dust that makes reindeer fly, has shorted and started a fire. You have to put out the fires but be careful because if your temperature goes up, you'll start to melt and get all wishy-washy.<br><br><b>Elf Dash</b>:<br>\nYou are Holly the Elf. Santa is on his way, the warehouse is locked up and the year-end blowout starts in ten minutes. Suddenly, Ben the Elf bursts in and says Mrs. Claus demands that the decorations be changed for the party. He hands you a list. Great! These things are scattered about the warehouse. You need to guide Holly about to gather the needed things in time or its stable cleaning for Holly.<br><br><b>Cold War</b>:<br>\nThis, quite simply, is a snowball fight between snowmen. Grab you snowball, take aim and knock his block off.<br><br><b>Grandma's Revenge</b>:<br>\nGrandma got run over by a reindeer so now that she's recovered, she's out for revenge. Guide Grandma about the screen in her car to run over the reindeer.<br><br><b>Tossing Cookies</b>:<br>\nIt's Christmas Eve and the reindeer have flown off. As if that wasn't bad enough, it is a stormy night. You, as Santa, must guide your sleigh about, gathering the magical cookies that make the reindeer fly, while avoiding lightning. You then use these cookies to lure the reindeer back to the North Pole.",
  "publishedBy": "AtariAge",
  "developedBy": "",
  "released": "Dec 15, 2007",
  "alsoFor": "",
  "genre": "Action, Compilation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/atariage-holiday-greetings-2007",
  "visual": "",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "AtariAge",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Dec 15, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}