{
  "name": "Atlantis II",
  "shortName": "atlantis-ii",
  "description": "The lost city of Atlantis is under attack! Wave after wave of Gorgon vessels are approaching, each armed with weapons capable of destroying a part of the city. You are in charge of the command posts at the edges of the city and need to defend it from the invaders. The various Gorgon craft will keep flying by on the screen in varying numbers and in different flight patterns. At first they fly high in the sky but then progressively lower. If an enemy makes it low enough before you destroy it, it will use it's weapons and destroy one of the buildings in Atlantis. As you progress in the game, the enemy craft will keep increasing in speed. The game ends when all remaining buildings in the city have been destroyed.<br><br>Sounds familiar? It should. <i>Atlantis II</i> is an altered version of <a href=\"https://www.mobygames.com/game/atari-2600/atlantis\">Atlantis</a> When <a href=\"https://www.mobygames.com/search/quick?company=Imagic\">Imagic</a> ran the Defend Atlantis contest, they wanted to find the top four highest-scoring players and invite them to Bermuda for a grand finale shoot-out for cash prizes. The top two-hundred fifty contestants would get snorkeling sets and the top one-thousand contestants would get t-shirts. Unfortunately, more than four people maxed out the score on <i>Atlantis</i> so, to break this tie, all of these maxed-out scorers were sent snorkeling sets and t-shirts as well as a modified <i>Atlantis</i> game called <i>Atlantis II</i>. The modified game is faster, scores lower per hit and the score font is different.",
  "publishedBy": "Imagic",
  "developedBy": "Imagic",
  "released": "1982",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/atlantis-ii",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "Imagic",
          "developer": "Imagic",
          "ported": "",
          "country": " United States",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/501937-atlantis-ii-atari-2600-screenshot-the-game-looks-the-same.png",
      "caption": "The game looks the same except for the score font and lower scores."
    }
  ],
  "cover": []
}