{
  "name": "Bomb on Pixel City",
  "shortName": "bomb-on-pixel-city",
  "description": "<i>Bomb on Pixel City</i> is a 2D arcade bombing game with gameplay similar to <a href=\"https://www.mobygames.com/game/vic-20/bomber__\">City Comber</a> and <a href=\"https://www.mobygames.com/game/canyon-bomber\">Canyon Bomber</a>. This Atari 2600 version was inspired by the 2011 iOS game <a id=\"deb8c6fe5413bf7f87817836bdc23e4b6\" href=\"https://www.mobygames.com/search/quick?game=Bomb+on+Pixel+City\">Bomb on Pixel City</a>, which was a tribute to the Atari 2600 system, by the same development group and is described as a remake.<br><br>The game consists of ten levels that are each fixed, single screen environments. The player controls a plane bomber near the top of the screen and needs to destroy buildings below by dropping bombs on them. Each successful hit is rewarded with points. Successive hits are rewarded through combos.<br><br>The plane only moves in one direction, but the player can determine the speed by moving left or right. When the plane disappear on one side of the screen it wraps around and appears on the other side, but slightly slower, so the pressure increases to flatten the buildings before the plane hits one of them.<br><br>The player needs to watch out for birds that suddenly appear and steam launched upwards from pipes. There are also trees that can optionally be bombed and hospitals that need to be avoided. The game is available in NTSC, PAL and SECAM as separate versions.",
  "publishedBy": "Hozer Video Games",
  "developedBy": "Gamopat Studio",
  "released": "2012",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/bomb-on-pixel-city",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "Hozer Video Games",
          "developer": "Gamopat Studio",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2012",
          "ean13": "",
          "comments": "cartridge version (mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}