{
  "name": "Condor Attack",
  "shortName": "condor-attack",
  "description": "During an intergalactic war. a timewarp was created and mankind was warped back into the past. Now mankind is stuck in the stone age and it just so happens they start getting attacked by Amazon condors. Also of concern are other enemies of mankind that traveled back in time with them, the Nirobean Spiders and the vulcanian bats. Being the only one who has a futuristic weapon (a galactic disintegrator)  that survived this timewarp, it's up to the player to repel these menacing creatures and hope the few surviving scientists are able to find a way back into the future.<br><br>Players control the galactic disintegrator mounted on the Earth's slidable firebase. The firebase's size depends on the difficulty setting selected, with the larger size being the harder difficulty as it's easier for the opponents to hit it. Players fire the disintegrator and earn points for each enemy they destroy. The smaller enemies always earn three points for each one destroyed while the larger enemies points will increase for each wave the player shoots through. There are nine different waves with the last wave earning the player 99 points for each large enemy destroyed.<br><br>The player starts with six firebases and can earn extra bases for each 1,000 points scored,",
  "publishedBy": "Ultravision Inc.",
  "developedBy": "",
  "released": "Nov, 1982",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/condor-attack",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "Ultravision Inc.",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov, 1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/905655-condor-attack-atari-2600-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/905657-condor-attack-atari-2600-screenshot-gameplay.png",
      "caption": "Gameplay"
    },
    {
      "link": "/images/shots/l/905656-condor-attack-atari-2600-screenshot-a-different-wave-of-aliens.png",
      "caption": "A different wave of aliens"
    }
  ],
  "cover": []
}