{
  "name": "Elevator Action",
  "shortName": "elevator-action",
  "description": "You are Agent 17 (codename: &quot;Otto&quot;). Your mission is to secure all top secret documents from a security building and escape in the getaway car, located in the basement of the building.<br><br>Enemies spies are scattered throughout the 30-floor building and they have only one mission: execute Agent 17 at all costs. There are several ways in which Agent 17 can kill them:<ul>\n<li>Shooting them with his gun.</li>\n<li>Kicking them by jumping onto them.</li>\n<li>Shooting a light on the ceiling while in an elevator, dropping the light onto one of them.</li>\n<li>Crushing them with an elevator.</li>\n</ul>Whenever a light has been dropped, the hallways will be dark for a short period of time, making the enemy spies harder to see. The same holds true for hallways that are already dark.<br><br>While Otto is in an elevator, he will have complete control of it by moving up or down. Agent 17 can still get killed if he's already in an elevator if a bullet's trajectory is aimed at it.. When Otto is not in an elevator, it will move from floor to floor automatically, even when enemy spies are in it. Otto is able to leap over the elevator gaps, but he must be as close to the edge as possible without falling off in order to make the jump safely. If there is an elevator cable in the way, however, it will block him, causing him to fall. <br><br>Just because the game is called <i>Elevator Action</i> doesn't mean that elevators are the only means of travel. There are also escalators which you can ride up or down, useful if you want to avoid gunfire and don't have time to jump.<br><br>Otto must go into the rooms with red doors to collect the top secret documents. If he tries to get to his car without getting all the documents, he cannot escape and must go back and collect the remaining documents. Once he has all the documents and drives away, he then proceeds to the next building.<br><br>If Otto takes too much time to collect the documents, the alarm will go off, and he will have trouble controlling the elevators, which will take time to react. Bad guys will be especially aggressive. The alarm doesn't go off when Otto loses a life, it only resets after finishing a building. Besides ducking, bad guys may also drop themselves and lay flat on the floor. It's virtually impossible for Otto to shoot bad guys when they do this. Also, Otto cannot duck when in an elevator.",
  "publishedBy": "CGE Services Corporation",
  "developedBy": "Taito Corporation",
  "released": "Aug 11, 2001",
  "alsoFor": "Amstrad CPC, Arcade, Commodore 64, FM-7, Game Boy, MSX, NES, Nintendo 3DS, Nintendo Switch, PC-88, PlayStation 4, Sharp X1, SG-1000, Wii, Wii U, Windows, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/elevator-action",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Shooter, Stealth",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "CGE Services Corporation",
          "developer": "Taito Corporation",
          "ported": "Atari, Inc.",
          "country": " United States",
          "releaseDate": "Aug 11, 2001",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/244393-elevator-action-atari-2600-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/244394-elevator-action-atari-2600-screenshot-starting-location.png",
      "caption": "Starting location"
    },
    {
      "link": "/images/shots/l/244395-elevator-action-atari-2600-screenshot-going-down-an-elevator.png",
      "caption": "Going down an elevator past an enemy agent."
    },
    {
      "link": "/images/shots/l/244396-elevator-action-atari-2600-screenshot-i-see-the-item-i-must.png",
      "caption": "I see the item I must collect."
    },
    {
      "link": "/images/shots/l/244397-elevator-action-atari-2600-screenshot-jumping-down-at-the.png",
      "caption": "Jumping down at the lower levels."
    },
    {
      "link": "/images/shots/l/244398-elevator-action-atari-2600-screenshot-duck.png",
      "caption": "Duck!"
    },
    {
      "link": "/images/shots/l/244399-elevator-action-atari-2600-screenshot-down-at-even-farther.png",
      "caption": "Down at even farther levels, I see another item I must collect."
    }
  ],
  "cover": []
}