{
  "name": "Ghostbusters II",
  "shortName": "ghostbusters-ii___",
  "description": "The UK-produced adaptation of <i>Ghostbusters II</i> contains three action scenes based on the film:<br><br>In the first scene, the Ghostbusters must collect slime samples from the sewers. One Ghostbuster is being lowered into a shaft on a cable and must collect the samples at the bottom. On the way down, many ghosts will try to stop him. Some of them try to saw off the cable, others deplete his courage upon touching him. He can destroy them with proton beams or bombs or employ a shield so they can't touch him. Weapon power-ups and elixirs that restore courage can be found on ledges in the shaft and can be reached by swinging. Several parts of a slime scooper must also be collected in this way before the samples can be collected.<br><br>In the second scene, the Ghostbusters have animated the Statue of Liberty via the slime and with her help must travel to the Museum of Art. Lady Liberty automatically walks to the right and can use her torch to shoot at the many enemy ghosts in her way. Her slime supply drains constantly however. Defeated ghosts drop slime, which can be collected by sending out the little people at Liberty's feet to pick it up and return it so the supply can be refilled.<br><br>In the third scene, the Ghostbusters confront big bad Vigo in the museum, seen in isometric view. First, all four of them have to be lowered into the museum on ropes, their speed controlled via joystick movements. Dropping too fast can stun them and take them out of the following fight. In the fight, the player can switch between the four guys at any time. Goals are to defeat Janosz, carry away baby Oscar before Vigo can enter him (Janosz will come after Oscar if he's still alive) and finally catch Vigo in the crossfire of two proton beams.",
  "publishedBy": "Salu Ltd.",
  "developedBy": "Activision, Inc.",
  "released": "1992",
  "alsoFor": "Amiga, Amstrad CPC, Atari ST, Commodore 64, MSX, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/ghostbusters-ii___",
  "visual": "2D scrolling, Isometric",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "Salu Ltd.",
          "developer": "Activision, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/70077-ghostbusters-ii-atari-2600-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/70078-ghostbusters-ii-atari-2600-screenshot-swinging-on-a-rope.png",
      "caption": "Swinging on a rope..."
    },
    {
      "link": "/images/shots/l/70079-ghostbusters-ii-atari-2600-screenshot-watch-out-for-ghosts.png",
      "caption": "Watch out for ghosts!"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/129142-ghostbusters-ii-atari-2600-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Atari 2600"
    },
    {
      "link": "/images/covers/l/129143-ghostbusters-ii-atari-2600-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Atari 2600"
    },
    {
      "link": "/images/covers/l/129144-ghostbusters-ii-atari-2600-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Atari 2600"
    }
  ]
}