{
  "name": "Rainbow Invaders",
  "shortName": "rainbow-invaders",
  "description": "<i>It's the year 3006, and the evil “Rainbow Invaders” from the planet “Pacco”, are headed to Earth! They look like the ridiculous aliens depicted in 1980’s arcade games, but are extremely dangerous and their goal is to exterminate all humans! You command a fleet of spaceships and you must defeat all of the Invaders to save Earth! Good luck!</i><br><br>This game is inspired by the game <a href=\"https://www.mobygames.com/search/quick?game=Space+Invaders\">Space Invaders</a> but with a twist. Yes, there are rows of invaders moving across the screen then moving down, firing as they go. Yes, your ship moves left and right at the bottom of the screen, firing up. Yes, an enemy ship will travel across the top of the screen. But there, the similarities end. For one thing, there are no shields to hide behind. Your ship does have a shield you activate by pulling back on the joystick but be warned, it drains all your energy so when you use it, after it is gone, you cannot move or fire for a second.<br><br>Also, the aliens are not dropping just electric shots. They also drop any of sixteen Special Shots. Some of these will help you, most will hinder you.<br><br>The Special Shots do the following:<ul>\n<li>Your ship's movements and shots become faster. Duration: ten seconds</li>\n<li>Your ship's left/right movements are inverted. Duration: until you grab a different Special Shot or lose your current life.</li>\n<li>Your ship's movements and shots become slower. Duration: until you grab a different Special Shot or lose your current life.</li>\n<li>Enemies do not fire. Duration: ten seconds</li>\n<li>Inavders' electric shots descend at maximum speed. Duration: until you grab a different Special Shot or lose your current life.</li>\n<li>Invaders' electric shots track your ship. Duration: until you grab a different Special Shot or lose your current life.</li>\n<li>Invaders stop moving. Duration: five seconds</li>\n<li>Invaders move very fast. Duration: one second</li>\n<li>All shots, your and the invaders, become invisible. Duration: ten seconds</li>\n<li>If you shoot at an invader or the enemy ship and miss, a randomly generated invader could appear. And your “Shoot Abort” option, wherein when you shoot again the last shot disappears, is temporary disabled. Duration: thirty seconds</li>\n<li>Your ship freezes. Duration: one second</li>\n<li>Invaders’ electric shots follow a random path. Duration: until you grab a different Special Shot or lose your current life.</li>\n<li>Your shots follow a random path. Duration: until you grab a different Special Shot or lose your current life.</li>\n<li>Your shots don’t stop when they hit an enemy but continue straight to the top of the screen, killing any enemies it hits. Duration: five seconds</li>\n<li>A randomly chosen invader blinks. If you don’t blast it immediately, every few moments a new invader is randomly generated. Duration: thirty seconds</li>\n<li>A randomly chosen invader blinks. If you don’t blast it before the bonus expires, your ship will explode. Duration: ten seconds. Meaning you have ten seconds to shoot that invader or lose a life</li></ul>",
  "publishedBy": "AtariAge",
  "developedBy": "",
  "released": "Jun 10, 2006",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/rainbow-invaders",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "AtariAge",
          "developer": "",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jun 10, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/245548-rainbow-invaders-atari-2600-screenshot-initially-loaded-screen.png",
      "caption": "Initially loaded screen"
    },
    {
      "link": "/images/shots/l/245549-rainbow-invaders-atari-2600-screenshot-level-1-in-progress.png",
      "caption": "Level 1 in progress"
    },
    {
      "link": "/images/shots/l/245550-rainbow-invaders-atari-2600-screenshot-enemy-shots-now-track.png",
      "caption": "Enemy shots now track me."
    },
    {
      "link": "/images/shots/l/245551-rainbow-invaders-atari-2600-screenshot-enemies-stopped-moving.png",
      "caption": "Enemies stopped moving. I meed to shoot all I can before this wears off."
    },
    {
      "link": "/images/shots/l/245552-rainbow-invaders-atari-2600-screenshot-starting-level-2.png",
      "caption": "Starting level 2."
    },
    {
      "link": "/images/shots/l/245553-rainbow-invaders-atari-2600-screenshot-i-was-hit.png",
      "caption": "I was hit."
    }
  ],
  "cover": []
}