{
  "name": "Saboteur",
  "shortName": "saboteur_",
  "description": "<i>You are Hotot, a cybernetic life form from a serene planet in a distant galaxy. Unfortunately, even in a galaxy far far away not everything is as peaceful as it first seems, for Hotot has discovered an alien missile base hidden on his planet. Manned by strange blue aliens, these evil intruders are using your planet as a launching site for their deadly warhead which is posed to destroy the galaxy's power source. With the help of the birdlike Gorfons, you must destroy the warhead, and prevent the destruction of the galaxy! Good luck Hotot. You are the Saboteur.</i><br><br>On the first screen, you are trying to prevent the Qotile construction robots and Yar slaves from completing a missile. You will be helped by the Gorfrons. While the Qotile construction robots and Yar slaves will build up the missile, the Gorfrons will steal pieces to lower it. Beware of the Master robot on the top catwalk as it will try to shoot you and the Gorfrons to prevent your interference. After you finish the Rocket Construction Site, it is off to Warhead Assembly.<br><br>In Warhead Assembly, you must destroy the warhead parts on the conveyor belt. There is just one little problem; the conveyor belt is protected by a field. The good news is that the Master robot's energy is on the same frequency so what you do is shoot the Master robot and the shot will then head for the conveyor belt. Of course, the Master robot isn't just standing there, letting you bounce shots off him. He has released a security drone that bounces around the screen trying to hit you.Also, the Master robot will hurt you if you touch him. If you destroy the parts before time runs out, you will advance to a harder round. If not, you must destroy the warhead one-on-one.<br><br>In the Warhead Showdown, you must destroy the warhead with a shot. Of course, the warhead isn't gonna stand for that as it has an impressive defense matrix that will try to hold you off. If you take to log to destroy the warhead, it will escape into space. Whether you destroy it or not, you will then return to the Rocket Construction Site at a harder level.",
  "publishedBy": "AtariAge",
  "developedBy": "Atari, Inc.",
  "released": "Mar 20, 2004",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-2600/saboteur_",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari 2600",
      "releases": [
        {
          "publisher": "AtariAge",
          "developer": "Atari, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Mar 20, 2004",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/244454-saboteur-atari-2600-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/244455-saboteur-atari-2600-screenshot-get-ready.png",
      "caption": "Get ready"
    },
    {
      "link": "/images/shots/l/244456-saboteur-atari-2600-screenshot-i-need-to-try-to-keep-the-robots.png",
      "caption": "I need to try to keep the robots from completing the missile"
    },
    {
      "link": "/images/shots/l/244457-saboteur-atari-2600-screenshot-i-need-to-try-to-destroy-the.png",
      "caption": "I need to try to destroy the parts for the warhead"
    },
    {
      "link": "/images/shots/l/244458-saboteur-atari-2600-screenshot-i-failed-and-the-missile-launched.png",
      "caption": "I failed and the missile launched. Now I will have to try to destroy the warhead."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/260914-saboteur-atari-2600-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Atari 2600"
    },
    {
      "link": "/images/covers/l/260913-saboteur-atari-2600-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Atari 2600"
    },
    {
      "link": "/images/covers/l/260915-saboteur-atari-2600-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Atari 2600"
    }
  ]
}