{"altername_name": [], "name": "10 Out Of 10 Maths Algebra", "overview": "The INNOVATIVE 10 out of 10 Series. These highly acclaimed suites of programs are a revolutionary step forward in educational software. They ALL use a unique system of automatically recording children's progress as they play and learn. This is just one of the many features which sets the 10 out of 10 Series in a class of its own. Each package contains SIX expertly designed educational games covering TEN essential areas of a child's education. All packages cover a wide age range and subjects are available for all children from three to sixteen years of age. As children learn from the games their progress is automatically recorded in 36 Y specific challenges the National Curriculum Attainment Targets of these areas are optionally displayed on screen in subject-based packages. All the programs are designed in Britain to be fun for single players or groups and the assessment system can monitor the progress of up to 4000 children with no input from parent or teacher needed. Watch them, join in the fun or leave them and return later to check their progress. You're in control! For children 6 to 16 years old. Covering many areas from Attainment Target 3 of the National Curriculum the 10 out of 10 Maths (Algebra) package is packed with subjects, levels and activities to challenge all children from Key Stage 1 right up to Key Stage 4. Following sequences, interpreting graphs, solving equations and numerous other algebraic skills have never been so much fun. This is the fun way to practice and become fast and proficient with the manipulations needed for high examination marks.", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Darryl Kiley", "publishers": "10 Out Of 10", "genres": "Education", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368613-10-out-of-10-maths-algebra\n"}