{"altername_name": ["Curse of the Azure Bonds: A Forgotten Realms Fantasy Role-Playing Epic Volume 2", "Advanced Dungeons & Dragons: Curse of the Azure Bonds: A Forgotten Realms Fantasy Role-Playing Epic, Vol.II"], "name": "Advanced Dungeons & Dragons: Curse of the Azure Bonds", "overview": "Outside of the town of Tilverton, the party of heroes has been ambushed, captured and cursed with five azure markings called \"bonds\". These bonds have dangerous magical powers that can take control of the heroes at the most inopportune times. They must now search for the source of the bonds, and free themselves from the curse. The second in the Gold Box series of role-playing games, Curse of the Azure Bonds is a sequel to Pool of Radiance. The gameplay is nearly identical to that of the predecessor and other Gold Box games. Following the AD&D rules of role-playing, the player creates a party of characters (up to the maximum of six). Two new character classes (Paladin and Ranger) are added to the four basic AD&D classes Fighter, Thief, Mage, and Cleric, which were available in Pool of Radiance. Exploration takes place in pseudo-3D environments, from first-person view. Battles (random as well as pre-set) take the player-controlled and enemy party to a top-down battle screen. Commands are issued in turn-based fashion, and the player-controlled characters can freely navigate the battle field. There is also an overview \"world map\" that allows instant traveling between cities.", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Strategic Simulations", "publishers": "Strategic Simulations", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.4", "wikipedia": "https://en.wikipedia.org/wiki/Curse_of_the_Azure_Bonds", "video_link": "https://youtu.be/knJCvdVEUrs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71908-advanced-dungeons-dragons-curse-of-the-azure-bonds\n"}