{"altername_name": ["Amidar500"], "name": "Amidar", "overview": "Amidar is a 1982 arcade game by Konami that is now converted for the Amiga 500. This is an attempted 1:1 port for Amiga 500, it requires 1MB memory FEATURES: - original visual & sounds - faithful enemy behaviour & speed & increasing difficulty - 50 frames per second (PAL) even on a 68000 A500 - all levels & bonus levels - original intro - joystick controlled (port 1) or keyboard controls (arrows + space) - can run directly from shell or from whdload (fast machines/complex configurations) CONTROLS: - joystick directions/arrows: move player - space/fire button: start game - P/second button: pause - F10 (or quitkey): quit (and save scores) HOW TO PLAY: - avoid enemies - eat all dots (odd levels) to complete level - paint all zones (even levels) to complete level. You cannot start painting from an unpainted zone - if cornered use jump to get past the enemies - fill all 4 corner regions to get a temporary \"power state\" where you can kill the enemies - after a while, the white thief (aka tracer) will start following you. Don't wait too long! CREDITS: - Jean-Francois Fabre (aka jotd): code and gfx/sfx conversion - Andrzej Dobrowolski (aka no9): music/sfx conversion - Frank Wille (aka phx): sfx/module player - meynaf: random routine - eab forum: useful advice & support - Superjustinbros: sprite rips https://www.spriters-resource.com/arcade/amidar - konami: original game :) Experience this recreated 1982 arcade game Amidar500 is a free ROM for the Amiga 500 gaming console, developed by user jotd666. In this faithful 1:1 port of the 1982 arcade game, you get to move around a fixed rectilinear stage of varying sizes and divisions, with the goal being to visit all spots of the grid. Amidar500 is one of the first games in the “grid capture” subgenre of maze puzzles, together with Pac-Man 256 or Santa’s Rats Issue. Not only do you have to visit all spots of the stage but you also have to survive by evading all enemies on-screen. Revisit a genre classic!. As a ROM file in the Amiga Disk File (ADF) format, Amidar500 doesn’t run on its own. You’ll need either an actual Amiga 500 console or a supported emulator like FS-UAE or WinUAE. Similarly, you can use the Amiga Explorer to interface an Amiga system to a PC. It’s not a troublesome requirement since the emulators are free and helps in the faithful recreation of the 1982 game. Like Pac-Man, there are different enemies in the game that use different movement patterns to create a challenging gameplay experience. As you progress, more varied enemy compositions try to prevent you from completing your quest. Aside from the enemies, the game also gets increasingly hard because of its increasing gameplay speed. To balance it out, you can jump past enemies and there are various power-ups available to help you. Of course, as an old video game, it also has no progress-saving mechanism. When you die, you start all over again. You can slowly adapt to the game difficulty, though. Also, as an accurately-remade Amiga game, the graphics are dated and the music uses a chiptune sound that was characteristic of the time. Still, players looking to relive the old-school game will definitely get what they’re looking for. A worthy treat for retro gamers. If you’re a gamer looking for an authentic old-school experience, Amidar500 fits like a glove. Its 8-bit graphics, chiptune music, and unforgiving lack of a progress-saving mechanism really capture what it’s like to play video games at the time. The only drawback is that it has a slight lack of convenience, requiring an emulator or a console to play the game. Highly recommended.", "platform": "Commodore Amiga", "release_date": "January 1, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Jean-François Fabre (JOTD)", "publishers": "JOTD", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161247-amidar\n"}