{"altername_name": ["Amiga Games 1"], "name": "Amiga Spiele 1", "overview": "The Amiga Spiele 1 is a Markt & Technik compilation of three low-budget games developed in Germany that were never released elsewhere. The following games are included: 1) Wikinger As the name suggests, Wikinger is a strategical conquest game taking place in Northern Europe around 900 A.D.. The initial choice to be made is how many human players shall participate, the number ranges from five people down to zero with the latter option boiling down to watching five computer-controlled players battle it out. Of course, there are precisely five nations to choose from that are in desperate need of a leader, namely Iceland, England, Sweden, Denmark, and Norway. As the goal of the game is to conquer as much land as possible, Iceland is, for geographical reasons, by far the hardest nation to succeed with, where Denmark is the easiest. Every nation starts the game with one single staging post that controls 10 villages. From this point forward, the most important thing is to raise some viking armies to conquer new lands which will increase the people count and, thus, the player's income. Not later than the first meeting with foreign armies, the player should have built up a working economy that will exemplarily enable him to equip his armies with weaponry and boating, build new staging posts that will harden his defense, or buy additional wheat to compensate for bad harvests. The latter combined with a low tax rate will significantly increase the young nation's head count. 2) Gölzy's Bliff (aka Bliff) Bliff is a simple billiard adaption with one cue ball, one other ball and one pocket. Goal of the game is to pot the other ball using the cue ball which gives the single player mode a decent feeling of minigolf, a feat also amplified by the different loadable tables that come with the game. There is a two player hot-seat mode, too, where every player has to pot the other player's ball. Furthermore, the player can design his own tables and save them to disc, thus being able to share them with fellow players. 3) Quadriga Quadriga is a computer adaption of the popular strategy game Connect Four. Two players are to assign stones to a 7x7 board with each player's goal of connecting four of them horizontally, vertically or diagonally, while hindering the other player in doing so. The game can be played by one or two human players with the artificial intelligence of the possible computer player coming with five different IQ's. It is even possible to let two computer players battle it out, testing whether the higher difficulty levels really play better than the lower ones in the process.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Gölzy", "publishers": "M&T Software Partner International GmbH", "genres": "", "max_players": "5", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167107-amiga-spiele-1\n"}