{"altername_name": ["Astérix: Operation Hinkelstein", "Astérix: Le Coup Du Menhir", "Asterix: Operation Getafix", "Astérix: El Golpe Del Menhir", "Asterix: El Golpe del Menhir"], "name": "Astérix: Operation Getafix", "overview": "There must have been many fans of the Asterix comics who waited with baited breath for the arrival of Asterix: Operation Getafix. And devoted admirers they have to be, for this game doesn’t offer the most sophisticated gameplay in the world. Asterix is best played in the spirit of remembering the rosy times of childhood, when Asterix was the greatest resistance hero since Rin-Tin-Tin. All the wonderfully named characters, such as Vital Statistix and Cacofonix the musician are present and correct. The druid Getafix has been well and truly stoned (by a passing missile, of course). He needs a beverage to bring him down to earth, and as Asterix, that level headed Gaul, your job is to find the ingredients that make up this hair of the dog. Troll your way merrily through ye olde Gallic village, through the forest and even the Roman fort to find the elusive elixir. Not an easy trek through the ancient world, as perils dog every move. Wild boars and flying fish may knock you down, and the worst ancient hazard of all - Romans! Fisticuffs with the crusaders takes courage and daring. Biff them hard enough and they will fly skyward. Asterix is a fun game with cheerful colours and graphics. Unfortunately, the sounds are limited, the best part being the quirky intro music - is it supposed to be Gallic? To be played with a cheeky grin and school uniform.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Coktel Vision", "publishers": "Coktel Vision", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71419-asterix-operation-getafix\n"}