{"altername_name": ["Grenslim"], "name": "Attack of the Green Slimey Space Scum", "overview": "\"Attack of the Green Slimey Space Scum\", aka grenslim by Don Christie for Amiga OS4.x. * Use the right & left arrow keys or joystick left/right to move your ship. * Press the space bar or joystick button 1 to fire normal missiles. Press button 2 on the joystick or joystick up(with no buttons pushed) to fire mega missiles. * When using the keyboard press the X key to fire mega missiles. You start off with 150 mega missiles and they can grow to 300. Just touch the green falling missile box with your ship to get more mega missiles. Mega missiles increase slowly during normal game play. Hint: Hold down the space bar to fire continuously and tap the X key to fire mega missiles only when needed. Mega missiles fire a volley of more missiles and a faster fire rate than regular missiles. You will want to have a good store of mega missiles in the higher levels of the game. Mega missiles will come down more often in the higher levels of the game. * Use the left Alt key to turn on your shields(use sparingly). Your shields start out at 100% and drop fast as you use them. Just touch the falling shields with your ship to increase your shields, 100% is max. Your Shields grow slowly during normal game play. Shields stop enemy ships and enemy missiles from destroying your ship. Try to stay above 50 % Shields in the higher levels you will need them. The Shields will come down more often in the higher levels of the game. * Shooting enemies closer to the bottom of the screen gives more points. It takes 2 hits to kill an enemy. Extra life at 400 points.", "platform": "Commodore Amiga", "release_date": "July 3, 2009", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Don Christie", "publishers": "", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167017-attack-of-the-green-slimey-space-scum\n"}