{"altername_name": [], "name": "Balkanski Konflikt", "overview": "Balkan Conflict is a management/strategy game for the Amiga, developed by L&M Magic Factory Group and published by Kon Tiki in Serbia in 1992. Balkan Conflict was created under the influence of daily political events in the so-called Yugoslavia. At the beginning of the game we go back a couple of years ago, at the time of the dissolution of the Communist Party. The first post-war (WW II) multiparty elections are scheduled in Serbia, and your task as President of the newly formed political party is to win the elections. After inauguration party (of course, if you win), you will be presented with a decision: the computer will prompt you for the new anthem of Serbia. While playing the anthem and the flag climbs the mast, prepare another floppy disk. In the beginning of the second part of the game, you're still a part of Yugoslavia, but a series of events causes destruction of the country. Serbia is alone against all secessionist republics and everything depends on you: whether you will or will not change the course of the history. With the careful management of foreign policy towards the former republics of Yugoslavia, neighboring countries, the US, Russia and members of the EC, it will depend on you if you will gain their support or not. In addition, you must take into account the political and economic problems within the country. After secession, the new Armies will appear represented with the flag of the country they belong to. With the left mouse button you get the possibility to operate your army: Attack, Defense and background operations. Conquering all territories will not result in winning. Final challenge is to be recognized by the United Nations, which you will need to win not by arms, but with clever politics.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Released", "esrb": "", "developers": "L&M Magic Factory Group", "publishers": "Kon Tiki", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "3.4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/74597-balkanski-konflikt\n"}