{"altername_name": [], "name": "Bob's Bad Day", "overview": "The reason why Bob's having a bad day is that his head has become detached from his body, and they've been hurtled off into different places. To retrieve his body, he must progress through 50 levels, then a further 50 to escape before he can be put back together. Gameplay involves the character being on a rotating landscape with a set number of coins placed all over it. By rotating the joystick, the player moves the landscape so that Bob moves over the coins and finds the exit. The levels include many spikes, contact with which causes the loss of coins; if the player has no coins when contact is made, it's game over. Some level designs are fiendish, with lots of corridors and alleyways, teleports, and bricks to break through (by building up enough momentum). There are a host of special 'power-ups' across the level as well. The simplest ones (and the first ones the player will meet) change the direction of gravity, causing the player's character to automatically 'fall' to the left when not in motion. Others include a sticky mode where Bob stops bouncing (unless the player presses the fire button), a heavier-bounce mode, and a very useful one allowing the player to 'thrust' Bob around, ideal for reaching precariously-placed coins. Once the player reaches level 51 a further twist is added - Bob's body starts in a separate point of the level, and this must also be coaxed to the exit. The view always centers on Bob's head until this is in the exit. Some sections can only be completed by combining the two and learning the body's differing properties, knowing that a move which benefits one can drag the other off course.", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "The Dome Software", "publishers": "Psygnosis", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.29", "wikipedia": "", "video_link": "https://youtu.be/fsnpW_14sHo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71884-bobs-bad-day\n"}