{"altername_name": [], "name": "Castle Danger", "overview": "This is an Amiga port of Castle Danger - a board game made about 20 years ago by Matt Worden for the PC. All assets are taken from the original and converted to the Amiga format to give the game the same look and feel. I wrote the whole game code from scratch. I also added something that the PC version lacked - single player mode. Writing it was the biggest challenge of it all and most time consuming. A new version was released that has an improved single player AI. Castle Danger is a one or 2-player, turn-based strategy game. Each turn, a player gets to add another piece to their side of the board, move their pieces, and shoot cannonballs at their opponent. Who will hit the other's King first? The game supports hotseat (2 players on the same computer), NetPlay (remote computers connected through the internet or other TCP/IP network), and play-by-email (through the game save/load functions). The game board (shown below) consists of a 9-by-7 grid of squares. The middle column on the board is an impassible river. The Blue player's pieces will all be located on the left half of the board, and the Red player's pieces will all be located on the right half. The two wedge-shaped items in the middle outer squares (one blue, one red) are called \"Portals\" ... this is where new pieces will be introduced to the game. The King is the piece that needs to be protected throughout the game. Each player gets only one of these, and when it is hit by a cannonball, the game is over. Wizards add moves for the player to use each turn. A player starts with 3 moves/turn, and gets an additional 3 moves/turn for every Wizard they have on the board. Builders can add and remove Walls from the board. Since cannonballs cannot pass over Walls, Builders can be used to build up protection for the King (and the other pieces too). Cannons fire cannonballs at the opponent. Wherever the cannonball lands, Fire is added to the game board, replacing whatever piece had been there. Cannonballs can fly over any piece on the board, except for Walls. The game is over when a King gets hit by a cannonball. Walls are added to (and removed from) the game board by Builders. Walls provide protection from cannonballs. Fire is left behind wherever a cannonball hits. The Fire lasts through just the opponent's turn, then disappears. Pieces cannot move onto a square that holds Fire.", "platform": "Commodore Amiga", "release_date": "June 30, 2022", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "jcksbk", "publishers": "Public Domain/Freeware", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=RFSxP3No9Nw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163632-castle-danger\n"}