{"altername_name": [], "name": "Cattivik: The Videogame", "overview": "Cattivik: The Video Game is a Platform game, developed by Digiteam and published by Idea, which was released in Europe in 1992. It is difficult to describe Cattivik: Mankind does not know much about him. He resembles a black droplet with little paws and an evil grin. He is a kleptomaniac and can be found burgling houses of the rich at night. Not content with collecting treasure, Cattivik also enjoys mucking its proprietors to a level of insanity. He is evil - that is for sure! In Cattivik – The Videogame ten houses are waiting to get robbed by our black blob. The proprietors are expecting you, so guards, bloodhounds and grandpa in a wheelchair with a rifle at the ready are posting. Being evil, our black bean has fancy traps at his disposal: Motorized mice, slippery bananas, super-glue, oil stains and bombs to name but a few. A level is cleared once you got rid of the proprietors leaving you a couple of seconds to collect treasure. Once you have cleared a house you are presented a bonus game. Great animation of the characters with lots of comical touches. Background scenery is a bit dull using a palette consisting mainly of grey colours. Scrolling can be a bit slow. Music is represented with jazzy title tune and in game tune. Lots of nice sound FX. Unforgiving gameplay makes Cattivik difficult to get into. Once Cattivik’s inventory of traps has been explored, interest wanes despite new weird characters appearing in each house. On the other hand, it is great to play an evil character for a change. Despite difficult gameplay Cattivik is worth checking out for its animation and comical evil main character.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Released", "esrb": "", "developers": "Digiteam", "publishers": "Idea Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ATUotYXTykk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71645-cattivik-the-videogame\n"}