{"altername_name": [], "name": "Center Court 2", "overview": "Written in Blitz Basic 2. Coding, graphics & sound by Gernot Fritsche. CENTER COURT 2 is a previously unreleased game that was planned for commercial release in 1997. It is the successor of CENTER COURT and CENTER COURT 97 / BLITZ TENNIS. In 1996/1997, coder Gernot Fritsche wrote this sequel to CENTER COURT in Blitz Basic 2 and had the game 99% complete, with only some minor elements lacking (i.e. English translation was mostly incomplete; minor gameplay elements were missing, as was a titlescreen). Development was abandoned, however, as the game had grown too big (~10MB HD space) for release on floppy disk in the ailing Amiga market, and with the author's interest in using his Amiga 1200 having evaporated the game was forgotten......at least until 2012, Gernot Fritsche received some emails from Python1 on EAB enquiring whether a sequel to CENTER COURT had ever been planned. This prompted the author to dig out his old A1200 development machine, and after heroic multi-party work was able to recover the contents from a failed HD there. Gernot tested the game out under emulation and quickly set about completing the coding of the game for final release. Within days he had achieved his objective by adding a couple of missing key game elements (100% English translation, titlescreen) and cutting the game size in half on HD by removing several unused graphics files. On 21st July, 2016 - after almost 20 years in the making - coder Gernot Fritsche released CENTER COURT 2 to the world for the first time on the English Amiga Board.....and, as they say, the rest is history! Game supports 4-player joystick adapters for gameplay (i.e. doubles matches).", "platform": "Commodore Amiga", "release_date": "2016", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Gernot Fritsche", "publishers": "Public Domain/Freeware", "genres": "Sports", "max_players": "4", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=FpTt13pHpSQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155463-center-court-2\n"}