{"altername_name": [], "name": "Centerbase: Science-Fiction Simulation", "overview": "Centerbase is a business simulation with many similarities to reLINE's earlier Oil Imperium. Four landlords compete for the money of tenants in a city of the future. The city is divided into four sectors, each of which houses six lots for apartment houses to be built on. Tenants not only require appropriate housing, but also water, food and energy supplies. These can be bought at the stock market, but must otherwise be acquired from food factories, water and power plants by completing different action sequences. New lots can be acquired by buying them from the opponents (who will usually only sell when they are in financial trouble, though) or by sending a robotic attack force to occupy them. Robots can also be used to collect the energy, food and water resources, thus avoiding the action sequences. Besides the legal options of buying and selling lots, robots and resources, building apartments and setting rent levels, various shady activities are also possible. Robots can be sent on sabotage missions, bar patrons of the Sky Dim bar can be hired to steal goods or spread rumors about competitors (possibly suspending their stock market activities), and money can be won (or lost) by gambling in the Casino. Some common but unpredictable events include natural disasters (which can damage or destroy buildings and apartments) and attacks by space pirates (which result in another action sequence). The game can be played by one to four players. If less than four human players are available, the computer controls the remaining landlords. Different winning conditions can be set at the start of the game: from having the most tenants within five years of game time to total domination by controlling every lot in the city.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Released", "esrb": "", "developers": "reLINE Software", "publishers": "Reline Software", "genres": "Construction and Management Simulation", "max_players": "4", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73804-centerbase-science-fiction-simulation\n"}