{"altername_name": [], "name": "Citadel of Vras", "overview": "Once upon a time, near the outer galactic rim, lived a race of Old-Ones who discarded their physical forms and went to live among the stars. The secrets of the Old-Ones are reputed to be held in the Talisman of Truth, located somewhere in an edifice known as the Citadel of Vras. You play a band of adventurers who starts on Nigris, a moon of Vras. Your aim is to keep the Talisman out of the clutches of the space pirate Sarkov who has just over-run the citadel. Citadel of Vras is a turn based science fiction themed role-playing game, inspired by The Bard's Tale . At the start of the game, you define your party of five adventurers from six possible races, each with pre-defined statistics (Weapon Skill, Intelligence, Constitution, Dexterity and Luck). The races also have differing psychic abilities, which may be acquired with increased experience. Once the party has been defined, the space station can be explored. Exploration occurs in a first person 3D maze. There is no air in the station, so spacesuits must be worn to prevent loss of health. Scattered around the first level are a shop, selling weapons, shields, compasses, light sources and lock picking devices. There is also a bureau of advancement which will level up your characters when they receive enough experience, and also train them in psychic skills. Eventually you will encounter monsters. These may be Greeted (occasionally resulting in no combat), Attacked or Retreated from. Retreat only seems to be useful for fixed encounters. On selecting attack, each of the players in turn are asked if they wish to Attack, Defend, or use a Psychic skill. After choosing each player's response, a round of combat is played out, with each player and each monster getting an attack in turn. Psychic skill (such as the Denk Mentat skill Illusions or the Jedi Knight skill Panic Fear) may cause the opponent to flee or miss rounds of combat. Winning an encounter will result in the party gaining experience points, gold and perhaps an item. The game consists of nine different levels on a 20x20 grid, with generally only one or two important squares per level. Ladders between levels are only one-way. At each level, the difficulty or the number of the opponents tends to increase for each combat encounter, as do the rewards for victory.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Megadisc", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/131210-citadel-of-vras\n"}