{"altername_name": [], "name": "Colonial Conquest II", "overview": "Colonial Conquest II is a strategy game set in space, totally unrelated to the old SSI game. Instead, its main inspirations are said to be the shareware game Conquest, which dates back to the Amiga's earliest years, and Sid Meier's Civilization. As a small group of refugees from the vast space empire, you have recently settled in an uninhabited sector, building your first base, when you find that the vicinity is already populated by a warlike breed of sentient machines. The machines move from planet to planet with their mothership — sometimes building settlements to produce more warships, sometimes conquering human settlements. The main screen presents you with a number of solar systems with planets suitable for settlement. Clicking a system reveals a screen not dissimilar to Civilization's city view, where you place buildings and order construction of ships (as soon as you have built a spaceport). Each colony must produce enough energy and food to supply the colonists, whose numbers will grow if there is an adequate surplus. Those colonists not involved in food production may produce resources using mining robots – or may be converted to scientists or soldiers (if you have built a barracks and have enough energy left). Other structures in the colony are granaries, housing, greenhouses, universities, power plants (solar, fission or fusion), hospitals and ground defences. Since only 28 buildings can be erected on one planet, you must choose carefully what to build as your colony grows, or tear down old buildings to make place for others. With only one planet to begin with, your typical course of action is to build a spaceport and construct a colony ship, loaded with up to four of your existing colonists. As they arrive on a new planet, you can choose to establish a colony if the environment looks good; some planets have lots of grass land for population growth, others have mineral resources while some consist of mostly desert or ice. There are special structures to melt ice or irrigate desert, but building these cost resources. A large number of space ships may be built, from small fighters to large destroyers and battlestars. The warships will fight other spaceships or destroy ground defences, while colony ships and troop transports carry humans. The latter is necessary to conquer a planet owned by the enemy. You can also construct spy satellites to send to other systems, where they will indicate if there are buildings on the ground or if there are ships in orbit, so that you don't have to send a group of unarmed colonists into the arms of the machines. Installing stargates in the orbit of a star allows instantaneous travel between systems, at the cost of energy. If the machines invade a human planet, they destroy unnecessary structures and put the humans at work to supply the resources needed to construct machine soldiers and their ships. Their mothership moves around from system to system and is immensely stronger than any human ship. Though your colonists have left the Empire behind, some less rigid imperial bureaucrats will sometimes contact you to offer to buy your food surplus or sell used warships. Discovering life on your new colonies also grants you a bonus in the shape of ships or resources. If you dedicate some of your colonists to research, you will reach higher tech levels, unlocking new kinds of ships and structures, including interplanetary cannons, space scanners and anti-spy disturbers. The research is doubled if you build a university on your planets.", "platform": "Commodore Amiga", "release_date": "August 1, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Christian Mumenthaler", "publishers": "Public Domain/Freeware", "genres": "Strategy", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=8ZgrlkMr6FE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161995-colonial-conquest-ii\n"}