{"altername_name": [], "name": "Creepy Crawlies", "overview": "This is a solid unofficial Amiga port of Centipede. It's quite the endurance test. What you see in the screenshots is pretty much the whole game. Since the gameplay doesn't change much and there doesn't appear to be a final level, Creepy Crawlies may become exhausting after a while. The player controls a small Ship. It is moved around the bottom area of the screen, and your aim is to fire darts at a segmented centipede advancing from the top of the screen through a field of mushrooms. Each segment of the Centipede becomes a mushroom when shot, shooting one of the middle segments splits the centipede into two pieces at that point. Each piece then continues independently on its way down the screen. If the centipede head is destroyed, the segment behind it becomes the next head. The centipede starts at the top of the screen, traveling either left or right. When it touches a mushroom or reaches the edge of the screen, it descends one level and reverses direction. The player can destroy Mushrooms (a point each) by shooting them, but each takes four shots to destroy. At higher levels, the screen can become increasingly crowded with mushrooms due to player/enemy actions, causing the centipede to descend more rapidly. On later levels, you have Fruit pieces which you need to shoot, in addition to the Centipede in order to clear the level, and there is a Flying Wasp which bounces in and out of the screen, along with Enemies what place more Mushrooms on the screen, moving in a downward motion, you can kill these as well.", "platform": "Commodore Amiga", "release_date": "2000", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Frank Schönlau", "publishers": "Frank Schönlau", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=un9e4FTHwfY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/89366-creepy-crawlies\n"}