{"altername_name": [], "name": "Dan Dare III: The Escape", "overview": "In Dan Dare III, Virgin's latest addition to the saga, Dan faces his toughest challenge yet. The Mekon has made things pretty rough for him. Dare has been taken prisoner and moved to a satellite from where the Mekon intends to sublimate the entire race of the Earth thanks to his armies of Treens – products of his unsuccessful Treenisation experiments. But Dan quickly escapes and finds a spaceship which should get him back to Earth. But before he can make it work, he must locate 50lbs of fuel in a catacomb of corridors, chambers and shafts. Dan is initially armed with a plasma rifle, a single power shield and handy jet pack. If he can fight his way to the stores computer on the first level he can order from a plethora of weapons stock as long as his credit holds out including extra lives, nuke bombs, homing missiles. But all cost. Once Dan is armed, he selects each weapon by pulling down on the joystick, the current selection being shown by its particular icon. The icons are clear and obvious, contrasting sharply with the small graphics of the characters and selection of each icon takes place during play so an element of real time swapping is inherent. While the music is pleasant yet unmemorable and sound effects are too limited, the scrolling most certainly is poor. It jerky and slow. Probe Software, who are responsible for the game, have a better reputation for graphics then this especially after having made such a good job on the Spectrum, Dan Dare on the Amiga is therefore an enigma – jerky scrolling coupled with reasonable graphics and underused sound make for a game which will be forgotten easily, unless you buy it in which case it will be remembered for its mediocrity.", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Probe Software", "publishers": "Virgin Mastertronic", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://it.wikipedia.org/wiki/Dan_Dare_III:_The_Escape", "video_link": "https://www.youtube.com/watch?v=IK62NSaE75s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/65706-dan-dare-iii-the-escape\n"}