{"altername_name": [], "name": "Dark Castle", "overview": "Dark Castle is a 1986 computer game for the Macintosh published by Silicon Beach Software, later ported to various platforms, where it was published by Three-Sixty Pacific. It was designed and illustrated by Mark Pierce and programmed by Jonathan Gay. Dark Castle is a platform game where a young hero named Duncan tries to make his way to the evil Black Knight, dodging objects as well as solving occasional puzzles. The game is notable for its use of sampled sounds to great effect. A sequel titled Beyond Dark Castle was released in 1987. A second sequel, Return to Dark Castle, was announced in 2000, though it was not released until March 14, 2008. The game opens with a vista of the castle with storm clouds in the distance. The opening notes of Bach's Toccata and Fugue in D minor play and are followed by thunderclaps. The title along with the programming and development credits are shown on this screen. Movement within Dark Castle is typical for most platformers. Duncan can run, jump and duck, and can throw a limited supply of rocks at his enemies. More rocks can be found in little bags along the way, as well as bottles of an elixir that provide a one-time antidote to bites of the numerous rats and bats found around the castle. To defeat the Black Knight, Duncan needs to pull several levers which topple him from his throne. To aid Duncan, a magic shield and the power to hurl fireballs can, fortunately, be found within the Dark Castle. The game begins in the Great Hall, where the player can choose from four doors. The large center door leads to the Black Knight. One other is marked with the shield, and the remaining two mysteriously alternate between the fireball course and a more troubling path. The game can be played at three different skill levels, the hardest \"Advanced\" level containing more enemies and a few extra surprises.", "platform": "Commodore Amiga", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Silicon Beach Software", "publishers": "Mirrorsoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Dark_Castle", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73925-dark-castle\n"}