{"altername_name": ["Air Duel: 80 Years of Dogfighting"], "name": "Dogfight: 80 years of Aerial Warfare", "overview": "Flight simulations have been covered from every single angle since the birth of computer games, and most of them have been released by Microprose. Dogfight is a step in a new direction for the company that prides itself on the most accurate simulations around – an arcade sim! No, not an arcade game, an arcade sim. Essentially, they have just taken out all the difficult flight controls of their usual titles, and shoved a little more emphasis on action. Rather than sit through a million mission briefings, spending all that time choosing armaments and then actually trying to find the enemy, Dogfight sticks you in the middle of battle in any of six historical scenarios using any of 14 different planes from a Sopwith Camel to a Sea Harrier. You can choose to go one-on-one with an equivalent plane, take on up to five different computer controlled aircraft at once or take part in 12 different mission backdrops. It all sounds quite packed, yet it scores badly. Why? Basically the most important option is missing. How on earth can you have a game called Dogfight and not include a two-player option? The PC version allows for two players, using linked machines, so why not the Amiga? So, what do you have? A standard flight sim with more combat than most. The controls are strangely sluggish on all machines (regardless of plane types, although the older fighters tend to handle better). The game is slowed down even further by the fact that when you change views, it has to load them in. For a game that is supposed to be action based, you sure do have to sit about a lot!", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "", "developers": "Vektor Grafix", "publishers": "MicroProse", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Dogfight_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/64954-dogfight-80-years-of-aerial-warfare\n"}