{"altername_name": [], "name": "Don Don Land", "overview": "Don Don Land was our first (and only) real push to make something original and sellable, without copying graphics from other games. The concept came from the first Doraemon game on the PC Engine, where you had to dig holes in the ground to drop enemies in while collecting a certain number of items in the level. We wanted to make something similar, but also something that looked and sounded like it was on a Japanese console. Back then, the influence from Japanese games on western computers was slight - console games were colourful and polished and felt arcade-like. This is what we were after. We spent many hours drawing the graphics, directing the programming and virtually chaining sunteam_phil to the computer to try and get some music from him. We were quite hopeful - the makers of AMOS seemed keen to market games created with their programming language. In our youthful spirits, we even visited EA and Thalamus to show them what we had done so far. But in hindsight, we were certainly overreaching. Our constant bugbear - the speed of AMOS - was again a killer for the gameplay, the graphics were never as good as we could have made them (our skills being better suited to side-view games rather than overhead), and forcing poor sunteam_phil to use samples from console games for the music was detrimental to its quality. Despite all that, there is a cool little game in there somewhere. The downloadable ADF is not a complete, final version and can be prone to odd glitches and crashes, but is mostly playable. The F-keys will allow you to cheat by giving you various power upgrades, and also skipping levels.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Sunteam", "publishers": "", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=1X8AGIFryjE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162278-don-don-land\n"}