{"altername_name": [], "name": "Donald Duck's Playground", "overview": "Donald Duck's Playground is an Educational Multi-Type game, developed and published by Sierra Entertainment, which was released in 1986. Here’s yet another cute little thing. You control a lovable character who’s irritable, yet lovable quack that goes by the name of Donald Duck! Donald wishes to help his nephews out. They are building a perfect playground in the park (they’ve got a tree house, a fortress and a space rocket). In order to get them more equipment for the park, Donald must earn money doing odd jobs. There are four things Donald can do. He can sort packages at the airport. Different packages are moving past him on the conveyor belt and he needs to pick up the correct one and throw it in the correct cart. Next job is in the toy-store. Donald needs to sort toys on shelves using the later, but there’s a train on the way and if the shelves aren’t secure everything can fall off. Now we come to my favorite… It’s the fruit catching/sorting part time occupation. Donald must catch the fruit and place it in the correct box. If the fruit isn’t caught or is placed incorrectly you won’t get paid (and Donald gets angry). And last, but by no means least is the work at the train switchboards. You’ll see where the train is and get a message where you should guide the train. You have six switches to do this. In other aspects the game is more than solid for its time (great graphics, good sound, cute idea, lovable hero, etc.). Now go and build that perfect playground for the wee ones.", "platform": "Commodore Amiga", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Walt Disney Computer Software", "publishers": "Sierra On-Line", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.8", "wikipedia": "https://en.wikipedia.org/wiki/Donald_Duck%27s_Playground", "video_link": "https://www.youtube.com/watch?v=YGJ9LyIokvk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/64956-donald-ducks-playground\n"}