{"altername_name": ["Official Advanced Dungeons & Dragons Computer Product: Dragons of Flame: A DragonLance Action Game", "AD&D: Dragons of Flame", "Dragons of Flame: A DragonLance Action Game", "Advanced Dungeons & Dragons: Dragons of Flame"], "name": "Dragons of Flame", "overview": "Dragons of Flame is a Role-Playing game, developed by U.S. Gold and published by SSI, which was released in 1989. SSI continue their series of AD&D releases with Dragons of Flame, an action game (like Heroes of the Lance, the first release) set in a mythical world. It's 300 years since the gods abandoned the people of Krynn and as a result, Takhisis, the Queen of Darkness, has awakened some dragons and created an army of Draconians. Once her armies are victorious, she'll be able to rule the land. All that can stop her is a bunch of companions – led by your very own self. The character portraits are all good and while the overhead and side views are basic, they're quite reasonable – at least the sprites respond quickly to key presses. Sound is limited to a few spot effects and these are nothing to write home about. It's simple stuff so it's easy to get into. It's also easy to play and with a bit of application shouldn't take too long to complete. That said, it's not too easy and the difficulty tuning has been set about right. It's definitely an action game and the role-playing elements that creep in give it a nice bit of variation on a straight hack 'n' slash game. Dragons of Flame is definitely enjoyable to start with, but the sheer number of enemies that have to be dealt with takes the edge off the excitement and the whole thing starts to get a shade on the repetitive side. Still, it's certainly a nice easy game to get into and works well as an introduction to the sort of things that happen in 'real' role-playing games.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "U.S. Gold", "publishers": "Strategic Simulations", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Dragons_of_Flame_(video_game)", "video_link": "https://www.youtube.com/watch?v=NKfVJZT-7Rg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/65032-dragons-of-flame\n"}