{"altername_name": [], "name": "Eureka Maths 6ème/5ème", "overview": "With the EUREKA collection, discover the wonderful worlds of knowledge! EUREKA software is a new generation of software based on the most advanced research in computer science and educational sciences. From a captivating scenario, they develop a pedagogy active and lively based on reflection and personal work. An interactive and user-friendly range: - incorporating high-performance tools (calculator, word processing, logbook, electronic calendar, etc.) - aids adapted to each question asked, documentation sheets (Album of Worlds) - very easy to use: everyone has their work windows and its tools as it sees fit. - A personalized follow-up: permanently displayable success rate, personalized graphic assessments the software adapts to the level of the user, allows him to progress more quickly in the event of success or offers him reinforcement tests in case of difficulties. - Each software includes thousands of questions, very varied exercises, games. Numerous graphics, music and digitized sounds: with the EUREKA collection! aim for performance. Visit the 5 regions of MATHEMATICA, accumulate points, discover the clues that will allow you to progress more quickly towards final success. You will cover the essentials of the program in each of these areas: - Arithmetic: 6/5: whole numbers, decimals, relative numbers / proportionality / fractions/percentages / metric system / area calculations and volume/comprehension of utterances. 4/3: relative and rational numbers / powers / fractions / percentages / opposites and inverses, etc. / intervals / number sequences / square roots / solving complex problems. Operations: operations on relative and rational / complex expressions including powers and roots / rapid mental calculation / approximations, order of magnitude, various evaluations... Equations, graphs and functions: 6/5: algebraic notations/equations with one unknown/fractional literal expressions various graphic representations/proportionality tables/statistical distributions/means/re, tre orthonormal. 4/3: equations with 2 unknowns / development, development and factorization of algebraic expressions / inequalities / io remarkable antities / various diagrams / statistics / frequencies linear / affine applications / vectors / introduction to probabilities. Geometry: 6/5: polygons (parallelograms, triangles, etc.) circles, discs, arcs / secants and mudflats / symmetries / perimeters, areas, volumes / prisms and cylinders / angles / planes in space. 4°/3°: projections/distances in the plane and space / triangles / medians, bisectors, mediators, etc. / Pythagorean and Thales theorems/Chasles relation/spheres/pyramids / angles inscribed at the center / sine, cosine, tangent/ translations, vectors, rotations. - Logic: Puzzles and logic games/implementation of algorithms.", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Alain Laurent", "publishers": "Génération 5", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368062-eureka-maths-6eme5eme\n"}