{"altername_name": ["Fire & Forget II: The Death Convoy"], "name": "Fire & Forget II", "overview": "John Torofex, security consultant for the International Peace Conference in Megapolis has been tipped off that a group of ruthless mercenaries are on their way to the centre of the city intent wreaking havoc and murdering the conference delegates. Your help Is required - pronto! The villains must be stopped on the roads before they get to the conference centre. Luckily you’ve just had the Thunder Master II serviced, so you’re ready tor action. Obviously, coming from behind, you’ll meet the mercenary minions first. Get rid of these as soon as possible as it’s the head of the convoy that you really want. The onslaught is made up of five convoys, killing one leader will transfer you onto another street with another set of vehicles. As you make your way through the convoy, you’ll encounter many types of enemy vehicles, from Jeeps to tanks, and every one must be dispatched. Most can be cleared using your normal blasters, but some particularly tough ones will need a missile up the rear if they’re to make way. The all-important commodity of fuel can be picked up along the way, as can any extra missiles, lives and kerosene cans (for flight) which you may like to chuck in the boot. Graphics is not very convincing 3D perspective with smooth scrolling landscapes and reasonable sprite animation. Pity there’s no option to turn the naff background music off but there are suitable crunching effects with a few screeching sounds. Fire And Forget II: The Death Convoy is simplistic fun that won’t hold the player’s attention tor very long. If you like a pick-up-and-play blaster, this is just the job.", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Titus France", "publishers": "Titus France", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=7yK5QUixM4E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/66742-fire-forget-ii\n"}