{"altername_name": [], "name": "Fun School Specials: Spelling Fair", "overview": "Fun School Specials Spelling FAIR Now the fun really begins! The range of Fun School Specials has been developed to help children with specific areas of learning Following the success of Fun School 4 parents and teachers have been asking for software which would focus on subjects like spelling maths and creativity skills in much greater depth. The aim of the Fun School Specials is to complement children's school work. All comply fully with the National Curriculum syllabus. SPELLING FAIR helps children master basic techniques of spelling and grammar All the programs are set in a colorful, noisy fairground, incorporating the essential \"fun\" element that has enabled the Fun School series to achieve sales of more than 430,000 packages in the UK alone. It encourages children to discover the delights of plural similes suffixes, prefixes and homophones. Also on disc is a 300-word dictionary containing carefully selected words which frequently cause children difficulty, including some specially chosen to help dyslexic children. COCONUT SHY Knock down the coconuts to delete unwanted letters and form words which match the definition oven TEST YOUR STRENGTH Use the hammer to bash the gong and learn about unusual plurals fox-foxes) MECHANICAL GRABBER Discover suffixes and prefixes, including general word formation and inflectional endings (eg grab grabbing, not grabing) HAUNTED HOUSE Bring fun characters to life while getting to grips with homophones like there their and caught court WORD JUGGLE Click on letters, moving them around to make up words to the delight of the juggler on his wobbling monocycle CIRCUS WORDS: Make human cannonball come to life while using new and familiar words to complete crosswords", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Europress Software", "publishers": "Europress Software", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368537-fun-school-specials-spelling-fair\n"}