{"altername_name": [], "name": "Fun School Specials: Merlin's Maths", "overview": "Now the fun really begins! The range of Fun School Specials has been developed to help children with specific areas of learning. Following the success of Fun School 4, parents and teachers have been asking for software which would focus on subjects like spelling, maths and creativity skills in much greater depth. The aim of the Fun School Specials is to complement children's school work. All comply fully with the National Curriculum syllabus. MERLIN'S MATHS encourages pupils to learn the basics of counting, decimals, fractions, volumes and much more while retaining the fun element common to all Fun School programs. Brilliant graphics and eye-catching sequences reward children as they progress from level to level. There are six activities and each game has three levels. Help screens can be called up at any time. What this program contains CRYSTAL CONFERENCE: The knights of the round table help with counting, subtracting and fractions. Get the sums right and watch them enjoy their banquet. PERFECT POTIONS: Answer equations correctly and see the puny knight turn into a hero. This teaches the basics of subtraction, division and addition. DECISIVE DATA: Many aspects of data handling in the National Curriculum are incorporated in a game that shows how to use bar charts and averages. BROKEN BATTLEMENTS: Counting, adding and division are needed to build a castle wall and keep out the invaders. MAGIC MACHINE: Uses a novel way of teaching functions to National Curriculum guidelines. WEIGHTY WEAPONS: Learn about weight and multiplication as you help Merlin sort through old weapons in the dungeons. All games have three levels of difficulty and a unique reporting system for recording the child's progress", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Europress Software", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368524-fun-school-specials-merlins-maths\n"}