{"altername_name": [], "name": "Fun School Specials: Paint And Create", "overview": "fun School Paint & Create. Now the fun really begins! Dear Parent. Learning can be fun-at least it can if you get the right balance of educational content and pure entertainment. Our ten years' experience of producing educational software, including the phenomenally successful Fun School range, have given us the edge. We have listened to your demand for more specific subjects such as maths, spelling and creativity, and address this with this new, specialized range of Fun School packages. Each program has been finely tuned by teachers and educationalists to ensure it meets the requirements of the National Curriculum, but will still provide children with hours of mind-boggling fun as they discover new and fresh ways to learn. So, you can be sure that your child is achieving the right standard for his or her age, and making the most of the time spent at the keyboard. We hope you and your child enjoy using this Fun School package! Does your child know how to use a computer keyboard? The National Curriculum contains clear guidelines on the importance of Information Technology to every child's education. You need to ensure your child meets these requirements and give them all the encouragement you can. Fun School Paint and Create has been designed to meet these needs, including introducing your child to keyboard and mouse skills, and ensuring they have the right amount of fun and enjoyment while they learn. Choose from five entertaining activities-drawing, painting, making music, creating jigsaws and greetings cards. See tangible results they can be proud of when you print out their creations. Help them exercise their creative talents in a fun and imaginative way.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Europress Software", "publishers": "Europress Software", "genres": "Education", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368525-fun-school-specials-paint-and-create\n"}