{"altername_name": ["Galaxy Force II"], "name": "Galaxy Force", "overview": "Galaxy Force II is an expanded version of Galaxy Force. It adds two additional levels, the old levels are revised (expanded and re-balanced) and the four missiles can be fired with a single button press. You are strapped into a spaceship to take on six dangerous settings, ranging from a pleasant garden to hostile fire and tough ice. You will have to fly freely before cutting through tunnels and canyons, and finally destroying an alien base. Your energy read out starts at 1200 and decreases as shots hit you, or you make contact with a wall or blockage. You have infinite cannons and guided missiles to help you along. You can get regular energy recharges and power upgrades, by shooting and then collecting their carrier pods. At the start of the game, the player may select any one of five planets: Megaleon (Man-Made world): This is default start level. The first half consists of combat in open space, slowly approaching a fortress inside the planet. Enemies include fighter ships, with the only obstacle being an orbital construction site. Ashutar (Volcanic world): Here, the player must traverse through two fortresses. Malkland (Plant world): Obstacles here include a fast growing plant which entangles your ship. Like Ashutar, two fortresses must be traversed. Sara (Desert world): The player here must avoid tornadoes and surface-to-air fire. Orthea (Cloud world): This stage contains large formations of enemy fighters. Two fortresses must be traversed. A sixth and final planet may be accessed only once the other five have been overcome: Hyperspace (Final): This is the stronghold of the enemy forces.", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Dementia", "publishers": "Activision (UK)", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Galaxy_Force_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91876-galaxy-force\n"}