{"altername_name": [], "name": "Gnome", "overview": "Gnome is a Platform game, developed by Vision and published by Linel, which was released in Europe in 1991. Game that follows the classic ‘pick up a bunch of objects to advance to the next level’ style, but adds a few interesting twists of it’s own. Unfortunately, they’re not very well implemented and the game ends up playing like a below average PD game. What’s the game like, then, and why does it fail at being addictive? Well, read on, and it will all be revealed. In Gnome, you control a gnome (well, duh!) who’s mission it is to pick up as many diamonds as possible. However, the twist is that these diamonds aren’t scattered about the single screen levels from the start, but have to be created by the gnome. This is done by throwing a mushroom seed on the ground, and waiting for the seed to grow into large mushroom, which will eventually pop and reveal a diamond. Should you fail to pick up a certain number of diamonds within a time limit, you lose a life. To help you, you can buy loads of cool stuff from a shop after every second level. The goodies include speedup potions, enemy slowdowns, extra life, and a bunch of other stuff. So far, so good, then? Well, no. You see, by buying these upgrades, you’re making the game incredibly easy. What should have been a frantic hunt for diamonds turn into simply waiting for the mushrooms to pop, while avoiding the occasional slow moving wizard or horned monster. The level design is incredibly bland, and the levels themselves offer no challenges or obstacles at all. The only thing that’s challenged by this game is your patience. This is a pity, because this game might have been a very addictive game if it had been playtested properly. The graphics are simple, but pleasant enough, and the music is nice. But the game isn’t worth your money, so don’t buy it. If you can find it for download on one of the legal adf archives, you might want to have a go at it, though...", "platform": "Commodore Amiga", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Vision", "publishers": "Amiga Fun", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bTtx7IF8WcY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/69046-gnome\n"}