{"altername_name": [], "name": "Gridiron!", "overview": "It's fourth and goal on the two with ten seconds left in the game. The crowd is roaring as you approach the line and scan the defense. It's no good... something's not right. You decide to call an audible... that speacial play you've been saving for a moment like this. The center snaps the ball. You hand off to the halfback who sweeps right spins and fires a bullet back to you in the end zone. The scoreboard lights up as the crowd goes wild... TOUCHDOWN!! Welcome to GRIDIRON!, the most realistic football game ever created for a personal computer. Designed for one or two players, GRIDIRON! offers you five levels of play from Practice all the way to Pro. There has never been a football game more playable than GRIDIRON! You have the kind of control you'd expect only on a real football field. You can set up a play, look at the defense, change your mind and then call an audible. When the action starts, things happen fast! On offense you control the ball carrier, on defense you control any player you choose. The other players execute the play you selected. GRIDIRON! is comprehensive and flexible as well. Using the Player Draft you can set the speed and strength for each player on both offense and defense. You can use any of 40 plays in the standard Playbook, or modify them to create your own unique plays using the powerful Play Creation Utility, our electronic chalkboard. You can even save your plays and teams on disk for future games! Our digitized audio will transport you into the stadium with the crowd roaring, the referee blowing his whistle, the linemen hitting on the line of scrimmage and the Quaterback calling the count. GRIDIRON! is more than a game. It is a simulation where the only limits are your skill and imagination. Bethesda Softworks is credited with the creation of the first physics-based sports simulation, Gridiron!, in 1986 for the Atari ST, Commodore Amiga and Commodore 64/128. Early games scored respectably in the gaming press. Electronic Arts was working on the first John Madden Football at the time, and hired Bethesda to help finish developing it. At the same time, they acquired distribution rights for future versions of Gridiron!", "platform": "Commodore Amiga", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Bethesda Softworks", "publishers": "Bethesda Softworks", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/94288-gridiron\n"}