{"altername_name": [], "name": "Herman Educational Adventure", "overview": "An educational games collection from F1Software, created by Dean Wood and released in 1997. Introducing HERMAN and his collection of fun and educational games. This game is designed to run from RAM, so anyone with a standard A1200 can take a peek at the program. The full version can ONLY be run from hard drive, so remember that this is just for fun. The full version has a total of 10 games, the demo only has 2. GAME 1 PICTURE PUZZLE (NOT AVAILABLE ON THE DEMO) With this game you start off with a Full screen size Picture that is mixed up, there is a box with the picture in it to show you what the complete picture should look like just move that box around to make the picture the same as the one in the box. If you want to load a different picture then just press the right mouse button and a selector will appear, here you could select a picture or exit to either Hermans Adventures or the Menu System. GAME 2 CARDS (NOT AVAILABLE ON THE DEMO) With this game you are given so much money in the bank, select how much you want to bet with and then just press High or Low to the card thats there, EG - 5 Hearts you could press High hoping for a higher card. There's not much else to say about this game just play it and see how much fun you can have. GAME 3 NAUGHTS AND CROSSES (NOT AVAILABLE ON THE DEMO) This game has been around for a long time, you should know this one but if not here goes, you play against Herman taking it in turns to place either a cross or nought in the playing area, if you can get a three placement line you win. GAME 4 MUSIC (NOT AVAILABLE ON THE DEMO) If you like music this is for you, you get a keyboard to play samples from with or with-out music. There's five music tracks to select from and 25 samples, with the samples you can play them up or down in speed, so select say track 3 and sample Mushy Mushy then play your sample from the keyboard to the beat of the music track. GAME 5 MATCH-IT (NOT AVAILABLE ON THE DEMO) With this game you use the arrow keys to move Herman to the word then press the return key then move the word to the picture that matches the word. The only way to get out of this game is to complete a level and then you will get a selection box come onto the screen, then using the space bar you can either exit or carry on. GAME 6 COUNTING (THIS IS AVAILABLE ON THE DEMO) This game is fun, you are asked how many EG - Hermans are there, you count the Hermans and enter your selected number and press return if you get it right you carry on if not you are shown how many there are then you carry on from a new display, again as with Game 5 the only way out it to complete a level and the you will get a selection box come onto the screen, the using the space bar you can either exit or carry on. GAME 7 LETTERS (NOT AVAILABLE ON THE DEMO) With this game you are on a Time limit, you have to look out for each word that's given then using you mouse click the number below the letter to make the word that's been given complete. If you can beat the time limit to complete the box letters at the bottom of the screen you will get a fanfare. GAME 8 MEMORY (NOT AVAILABLE ON THE DEMO) This is a cool game just try to remember the colours that are given in turn each time, each time you get it right you light up a window in the houses. To exit this game point and click Hermans Face. GAME 9 PAIRS (THIS IS AVAILABLE ON THE DEMO) Match up the small pictures that are hidden and try to get a score of 15. This game is hours of fun. GAME 10 VOWELS (NOT AVAILABLE ON THE DEMO) With this one just keep pressing the number buttons that match the amount of vowels on the screen at the time, if you keep getting them right every time then Herman will every so often jump for joy. It's basically familiarization with the vowel letters.", "platform": "Commodore Amiga", "release_date": "1997", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "F1 Software", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164892-herman-educational-adventure\n"}