{"altername_name": [], "name": "Hero's Quest: So You Want to be a Hero", "overview": "So you want to be a hero? Then just pop into the Adventurer’s Guild, and study the notice board. There you will find offers of both honours and rewards, providing you are prepared to venture into the forest of Spielburg and risk all. Played in the usual Sierra adventure-style mode, Hero’s Quest is classified as a Role Playing Game, but it has all the characteristics of an adventure as well as an RPG. Before commencing, a character must be set up. You’re offered a choice of Fighter, Magic User, and Thief as your personna. The play progresses very much along the lines of a Sierra-style adventure, with just a little more emphasis on the acquisition of scrolls, potions, and weaponry. Until you meet up with something nasty in the forest, that is. Fighting can be exhausting work, and you will need a few pieces of silver for a good night’s rest, not to mention the odd spell or two that you are short of! Make sure you never fail to search your victim’s body after his demise, for he may be carrying a fortune on his person! Sound effects and music accompany many of the scenes and animated sequences. Most are a delight, and the animation is often quite humorous. Because of the different character settings that can be achieved, together with random events, Hero’s Quest is unlikely to play the same way twice over. And fighting will take on a whole new dimension if you can throw a few nasty spells at your opponent rather than simply beating it to death! Coming on five disks for the 1 Meg Amiga, Hero’s Quest is yet another high quality game from Sierra that is certain to give hours of fun and enjoyment.", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Sierra On-Line", "publishers": "Sierra On-Line", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.1", "wikipedia": "https://en.wikipedia.org/wiki/Quest_for_Glory:_So_You_Want_to_Be_a_Hero", "video_link": "https://www.youtube.com/watch?v=jnDe04HSP_4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40989-heros-quest-so-you-want-to-be-a-hero\n"}