{"altername_name": ["Hexen II: Hammer of Thyrion"], "name": "Hexen II", "overview": "Amiga port of uhexen2 aka Hexen II: Hammer of Thyrion. Like the in the original, the world of Thyrion was continuously conquered by the demon brothers known as the Serpent Riders. After two of them were defeated, the oldest and most powerful of the three, Eidolon, is the only one that stands between slavery and liberation. A lone hero must first defeat his generals, the Four Horsemen of the Apocalypse, and finally bring the fight to Eidolon himself. Hexen II is the third game in the Heretic and Hexen series. Like its predecessors, it is a medieval fantasy-themed first-person shooter. Similarly to Hexen, the player can choose between different character classes - Paladin, Crusader, Assassin, and Necromancer (four as opposed to three in Hexen). These characters have different parameters and abilities, compelling the player to use different fighting styles when controlling them. The Paladin has high vitality and focuses on melee weapons; the Crusader is a defensive character who eventually acquires healing abilities; the Assassin gains access to a critical strike skill when sneaking on enemies; and the Necromancer is physically vulnerable but is eventually able to restore his powers from fallen enemies. Each character has access to four unique weapons during the course of the game. The player character travels to four stylistically distinct areas (medieval European, Mesoamerican, ancient Egyptian, and Greco-Roman). Each area is composed out of interconnected stages. Switch-manipulating and item-procuring puzzles must be usually solved in order to advance. It is often required to travel between stages several times in order to complete these tasks. Enemies do not respawn when the player re-enters an area. A new feature in the game compared to its predecessors are its role-playing elements. Each character has attributes which increase when the character gains experience by defeating monsters. Characters' hit points and mana are extended gradually and permanently when leveling up. They also gain new abilities at specific levels. Weapons can be powered up by acquiring Tomes of Power, unlocking alternate (usually more damaging) firing patterns for them. Since the ranged weapons in the game are magical, they deplete the player character's blue or green mana bars when used. Like health, these can be restored by finding appropriate recovery items.", "platform": "Commodore Amiga", "release_date": "2016", "game_type": "Unlicensed", "esrb": "Not Rated", "developers": "BSzili", "publishers": "", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368883-hexen-ii\n"}