{"altername_name": ["Advanced Dungeons & Dragons: Hillsfar: A Forgotten Realms Action Adventure", "AD&D: Hillsfar"], "name": "Hillsfar", "overview": "Players start their game by creating a character. The game provides three choices: players may select a pre-made character, create their own, or import characters from previous Strategic Simulations Dungeons & Dragons computer games, such as Pool of Radiance and Curse of the Azure Bonds. When creating a character, players may determine the character's race (dwarf, elf, human or gnome), character class (cleric, fighter, magic-user or thief), and alignment. Various characteristics of the new character, such as strength and intelligence, are assigned a random value by the computer. There are two aspects to the game: arcade action, where the player performs tasks (expressed as mini-games) such as searching for treasure and traveling between locations, and adventure, where the player completes quests. The choice of character class affects the available quests, with three for each class. While the quests need to be completed in a set order, \"what you do in your time off is up to you\", and thus the player is free to explore other aspects of the game. The game is presented in three modes. When traveling, the scene is presented using a side-on view; once in the town of Hillsfar, the game converts to a \"bird's-eye view\" of the map; a first-person perspective is employed within the caves. Interaction is handled through what Leslie Fiser of Compute! magazine described as a \"bump interface\", which allows the player to trigger interaction with objects by bumping into them.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Westwood Studios", "publishers": "Strategic Simulations", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Hillsfar", "video_link": "https://www.youtube.com/watch?v=Sa8qQNtszHg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/41326-hillsfar\n"}