{"altername_name": ["Human Killing Machine", "HKM: Human Killing Machine"], "name": "HKM", "overview": "In today’s moral climate, it seems that more and more people are living by the rule ‘kill or be killed’. Some people are taking the idea to the extremes, plunging into danger just to prove that they’re really hard and a lot stupider than all the other guys. Kwon is one such person. Filled with the need to demonstrate the power of his homeland, he decides to travel the world doing battle with all manner of opponents. First off it’s away to Russia and to the majestic city of Moscow... to kick seven colours out of the Russians starting with the nearest Kremlin guard and then his dog. After those little Russian confrontations it’s off to Amsterdam for a bit of... WHOARR! KNOWORRAMEAN! But Kwon’s reputation has spread and one of the... er... young ladies (ahem) tries to knock him stupid. Once you’ve got rid of her, there’s her friend to deal with. Next comes the holiday atmosphere of Barcelona, where Kwon decides that Miguel the bullfighter isn’t doing the best job of beating the horned brute, so he leaps in the ring, smashes Miguel unconscious and then deals with the bull. Well after a beating a bull, Kwon is well away. Nothing can stand in his path... can it? As soon as I saw the naff loading screens, I thought that things were starting to go a bit awry. That’s when the game came on - oh dear. The sprites on the Amiga version are large enough, but the animation leaves a lot to be desired. All it amounts to is a few basic moves and actions, none of which are particularly realistic. This is an incredibly weak program and one of the worst fighting games I’ve ever seen.", "platform": "Commodore Amiga", "release_date": "1988", "game_type": "Released", "esrb": "", "developers": "Tiertex", "publishers": "GO! Media Holdings", "genres": "Fighting", "max_players": "1", "cooperative": "No", "rating": "2.38", "wikipedia": "https://en.wikipedia.org/wiki/Human_Killing_Machine", "video_link": "https://www.youtube.com/watch?v=TG3P23K3J7M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/69678-hkm\n"}