{"altername_name": [], "name": "Hollywood Hustler", "overview": "I don`t know the time, but it`s late. Seems like I've been walking these streets for ever. A sign up ahead reminds me that I`m still on Sunset. Sunset Boulevard, that legendary pathway that runs through the glamour and the sleaze, the dreams and the nightmares of Hollywood. As I stop at a street corner, the spicy aroma of Mexican food hits me from a late-night diner opposite. The depressing drone of Mariachi music mingles with the hum of a neon sign from a poker club next-door. A sudden gust of wind snatches at a letter in my hand. It`s been one of those days, you know the sort i mean. I should`ve known from the moment I woke that today was going to be a bummer.. with a capital B! I switched on the radio to hear a warning that the Santa Anas were due to hit town. What was it that crown prince of L.A novelists Raymond Chandler said about times when those damned desert winds blow? \"Anything can happen.\" And sure enough today it did... in spades! I rolled into work like any normal day. I drive one of those goofy tour buses over at Universal Studios. Candy-striped contraptions, full of starry-eyed families from hometown USA and eager groups of oriental tourists pointing expensive cameras. \"Okay folks, now we`re gonna relive that great scene from The Ten Commandments and cross the Red Sea....\" Don`t ask me why, but today, instead of waiting as usual for the waters of the mechanized back lot sea to part, I drove straight on. Moments later, amid bizarre scenes of angry baptized passengers and water-spouting cameras, I was being dealt my cards. An instant career-move - farewell the land of Dreams and money, hello Welfare! Armed with a final pay-check, I drove to my local bar and proceeded to get drunk. Still despite my bad luck, at least I knew that waiting for me at home was my faithful ever-loving babe, Barbie. With that uplifting thought, I downed a final beer and headed back to our apartment, a cheap but cheerful pad in one of Hollywood`s less glitzy neighborhoods. However, on arriving there was no sign of Barbie, only a folded note with my name on the front. Funny, no kisses. I opened it. The first words were something about being confused, the rest you can read between the lines! Like great philosophers throughout the ages, I sat and contemplated my life, the crumby state of my existence. Jobless, and now babeless! I had to start making some decisions, like cosmic and big. So I did, I hit the bottle again! Just as the rye was running dry, there was a knock at the door. My heart skipped a beat. I thought, \"it`s all been a mistake, she`s back.\" But no, it was just a repo man bearing yet more good news. Seems I was behind on my car. He gave me some papers and I gave him the keys. Considering how things were going, fair exchange I guess. Anyway, back to my lonely street corner. With liquor-misted eyes, I look around at the glimmering lights of Hollywood, trapped like a moth in the even brighter flame of the surrounding metropolis of L.A. Los Angeles. Some folks call it the city of Lost Angels. Now I was one of the lost...", "platform": "Commodore Amiga", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Dave Keen", "publishers": "Desert Star Software", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/131264-hollywood-hustler\n"}