{"altername_name": [], "name": "Horror Zombies from the Crypt", "overview": "Why do they bother? Companies trying to do ‘scary’ horror games. I mean They sure as hell don’t scare anybody and nine times out of ten they’re decidedly mediocre anyway. This is certainly true of the awesomely below-average Horror Zombies from the Crypt, a game that supposedly pays homage to the classic horror flicks of yesteryear. In it you play a hapless hero who stumbles into a creepy mansion in the dead of night (oh yes, because that sort of thing happens all the time) and then has to try and escape. Naturally this unlikely scenario manifests itself into a scrolling arcade adventure with the baddies all extras from various generic cinematic shockers. You’ve got zombies, vampires, frankensteins stumbling about after you… it’s all quite predictable really. The basic object is to avoid these meanies (or, better yet, kill them with your throwing knives), explore the various levels, collect keys and objects, unlock doors... you know the sort of thing. There are some vague platform elements - many items of furniture can be climbed and jumped on, and in some cases moved about. If anything, Horror Zombies is best compared to something like The Addams Family - although this can’t dare to hold a candle to Ocean’s classic platformer. Here the action is stunted, slow and unexciting. There’s very little to hold your attention, and the rather gratuitous death sequence (your head blows up unconvincingly), little effort has gone into trying to make the game anything like the horror movies it’s supposed to be a tribute to. It’s not totally unplayable, but it lacks imagination, hasn’t been very well put together and as a result comes across as one of the most mediocre games we’ve seen in a good few months. Buy something else instead.", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Astral Software", "publishers": "Millennium Interactive", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.07", "wikipedia": "https://en.wikipedia.org/wiki/Horror_Zombies_from_the_Crypt", "video_link": "https://www.youtube.com/watch?v=pwTtxbe2lHs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/69515-horror-zombies-from-the-crypt\n"}