{"altername_name": [], "name": "Hostile Breed", "overview": "Following the success of Apidya and Sim Ant, insect-related games are back in vogue, or so it would seem. And Palace’s release is no exception, pitching you against hordes of insect-nasties in a deep-space moonbase, but it has a few other elements which make it something more than just another blast-em-up. Hostile Breed combines all the excitement and action of a shoot-em-up with the strategy elements you’d expect to find in a simulation. The chief element of strategy centres on the base complex where you find yourself on the receiving end of a massive invasion. The eight-legged moonbase has just been through an earthquake which has cracked the walls. Insect aliens are pouring through these breaches by the dozen, heading towards the control room. If they get there, all hell will break loose, and your game will be over. In short, Hostile Breed is an eight level shoot-em-up, but it’s laid out in such a way that you can get to any level whenever you like. The control centre is a vital piece of the jigsaw, and devoted shoot-em-up fans might at first find this a bit too much for them to handle. The ‘in-between’ scenes and the death-screen are pleasing, but not great, while the in-game sprites are vaguely cartoon-like. The sound effects are raunchy enough, but there are quite as many as you’d probably like to give you the real atmosphere. You have to hand it to Palace, Hostile Breed is not your ordinary shoot-em-up. If you want a bit of ‘think’ and your ‘shoot’ and you’re opposed to mind violence (but not plain ol’ everyday violence), go for it. You’ll enjoy it.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Palace Software", "publishers": "Titus France", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ox74Y9naHrg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/69517-hostile-breed\n"}