{"altername_name": ["Grand Prix 500 2"], "name": "Hot Rubber", "overview": "This is the original Microids title, which was exclusively used with the releases for the French game market. Released outside France under a different title, Hot Rubber by Titus UK. Grand Prix 500 2 is your standard bike racing scenario, featuring a handful of riders racing hell for leather around the most famous courses of the world, pausing only to collect medals and shake champagne all over each other. I must admit, I’m a very big fan of bike racing games. From Team Suzuki to Super Hang On, I always have my eye out for a new one. This is quite definitely the most appalling one I have ever seen. It’s completely unplayable in every respect, with a useless two player mode and some of the smallest player windows ever seen. You begin as always on the starting grid and at this point things look really good. The graphics are fine and detailed and everything looks fairly realistic. Then the light turns green and the other riders hit the horizon in about three hops. Push forward to get moving and you hit this game’s big problem. Rather than have you at the centre of the screen with the road swinging around as you change lanes, the programmers obviously decided that that was too much hassle, and opted for the other side of the coin, which involves the road being centred and the sprite of the bike moving around unrealistically. The result of this is that it’s impossible to judge corners correctly, and as for overtaking - forget it. This is one useless game. Even as a budget title, it just isn’t worth the disk it’s recorded on.", "platform": "Commodore Amiga", "release_date": "1991", "game_type": "Released", "esrb": "", "developers": "Microïds", "publishers": "Microïds", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.12", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=gxNokgXXm44", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71910-hot-rubber\n"}