{"altername_name": [], "name": "I Puzzi", "overview": "A very smell point-and-click adventure. Everybody loves graphic adventures, especially point-and-click ones. Though it's very short, only four locations, I PUZZI (a possible English translation for the name of the game could be \"The Stenches\") can be considered a real graphic adventure. It was conceived as a demonstration of potentiality of a graphic adventures engine planned by the (4)Seasons Team. The engine was made to behave like the famous Ron Gilbert's SCUMM system at first, but then TYN has decided to transform it in a hybrid system in order to adapt it either to adventure or platform kind of game. It's the birth of JODIS, a system for adventures which can be played with a joystick. The adventures begins in the city of Puzzi, little nice brown bear with a big nose and a particular digestion that forces them to a continuous and disagreeable flatulence. Like the famous little people known as The Smurf - created by the brilliant hand of the Belgian comic-strip artist Peyo (aka Pierre Culliford) - I PUZZI live in a beautiful village where the houses have the form of a mushroom. Their chief is the Grande Puzzo, who is not olny the eldest but also the tallest among the Puzzi (he's taller than a three-stage building). In fact, nobody knows how much tall he is. His silhouette fades beyond the clouds or, to be exact, the toxic clouds of gastric exhalations produced every day from the population. The adventure begins at the eve of the birthday party for the Grande Puzzo. Puzzo, the protagonist of the adventure, has to find an original gift in order to show his affection to the Grande Puzzo.", "platform": "Commodore Amiga", "release_date": "1991", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "4 Seasons Soft", "publishers": "", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=QOK4qFbJi-w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162212-i-puzzi\n"}