{"altername_name": ["Indiana Jones and the Last Crusade: Das Graphic Adventure"], "name": "Indiana Jones and the Last Crusade: The Graphic Adventure", "overview": "Indiana Jones and the Last Crusade: The Graphic Adventure is a graphic adventure game, originally released in 1989 (to coincide with the release of the film of the same name), published by Lucasfilm Games (now LucasArts). It was the third game to use the SCUMM engine. The plot closely follows, and expands upon, the film of Indiana Jones and the Last Crusade. As the game begins, Indiana Jones has returned to his college, after reclaiming the Cross of Coronado. He is approached by businessman Walter Donovan, who tells him about the Holy Grail, and of the disappearance of Indy's father. Indy then travels to some of the places seen in the movie, such as Venice and the catacombs, after meeting fellow archeologist Elsa Schneider. In the process he finds his father held captive in the Brunwald Castle, after passing through the mazelike corridors, fighting and avoiding guards. Then Elsa's double role is revealed when she steals the Grail Diary from Indy. After escaping, father and son pass through Berlin to reclaim the Diary and have a brief meeting with Hitler. Then they reach an airport, from where they intend to seek the Valley of the Crescent Moon, by Zeppelin or biplane. There are many action scenes, involving fists, and the biplane sequence above Europe, pursued by Nazi planes. Several key elements of the movie—such as the Brotherhood of the Grail, Indy's friend Sallah, and the Venice water chase and the desert battle scenes (except for small hidden references)—were not included in the game. Last Crusade was one of the most innovative of the LucasArts adventures. It expanded on LucasArts' traditional adventure game structure by including a flexible point system - the IQ score, or \"Indy Quotient\" - and by allowing the game to be completed in several different ways. The point system was similar to that of Sierra's adventure games, however when the game was restarted or restored, the total IQ of your previous game was retained. The only way to reach the maximum IQ of 800 was by finding alternative solutions to puzzles, such as fighting a guard instead of avoiding him. This countered one common criticism of adventures games, whereby since there is only one way to finish the game, they have no replay value. Some of the alternative fights, such as the one with the Zeppelin attendant, were very difficult to pass, so the maximum IQ was very difficult to acquire. The game was released in May 1989 simultaneously with the movie. It was available for DOS, Amiga, Atari ST, and Mac OS. A CD-ROM version was later released for the FM-Towns, with 256-color graphics, as well as a VGA PC version. The player has to enter copy protection codes similar to those of Maniac Mansion and Zak McKracken at the start of the game. If the wrong codes are entered three times, the game goes into \"demo\" mode. When Indy is asked by Walter Donovan to translate the tablet, he makes a hilarious mistranslation, causing Donovan to throw him outside, ending the game. The 256-color versions of the game do not have the copy protection codes. A replica of Henry Jones' Grail diary was included with earlier versions of the game. While very different from the film's version, it provided a collection of background information of Indy's youth and Henry's life. Later versions of the game came with a shortened version of the Grail diary. The diary gave Indy's mother's name as Mary, which was contradicted by subsequent canon. Last Crusade was also the first Lucasfilm game to include the verbs Look and Talk. In several situations, the latter would begin a primitive dialogue system in which the player could choose one of several lines to say. The system was fully evolved in The Secret of Monkey Island and remained in all later LucasArts adventures, with the exception of Loom. Many of the scenes unique to the game were conceived by George Lucas and Steven Spielberg during the creation of the movie", "platform": "Commodore Amiga", "release_date": "July 5, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Lucasfilm Games", "publishers": "Lucasfilm Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.53", "wikipedia": "https://en.wikipedia.org/wiki/Indiana_Jones_and_the_Last_Crusade:_The_Graphic_Adventure", "video_link": "http://www.youtube.com/watch?v=qKfd4sv2xz4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18310-indiana-jones-and-the-last-crusade-the-graphic-adventure\n"}