{"altername_name": [], "name": "Infection", "overview": "Infection was written by Dave Crummack and Craig Galley (Wise Owl software) in 1988 for the Amiga, Atari ST and C64. The AI was very basic in the first release. It was then sold to UK Virgin/Mastertronic who brought in David Whittaker to add the music, and the AI was also improved. The game was sent out to be reviewed but was never released. The rights then moved onto US Virgin/Mastertronic who licensed it to Leland (coin-op manufacturers) who turned it into the game Ataxx. Virgin had also acquired the rights to the Spot character which was used to advertise the soft drink 7up. The game was released as Spot on a variety of machines with extra animation. In 1992, Virgin Interactive and Trilobyte included in the 7th Guest CD-Rom game an Ataxx called Microscope, or Show of Infection, which was also based on the original game Infection. Since then, many other variants have been written such as Hexxagon. At the end of the 1990's, the Amstrad and Spectrum versions were released on the internet. The Amiga version was found in 2000 and also released in 2 versions, one for real Amigas and a special version for emulators. The Amiga version is actually broken, with a missing file (bmaps/copdata) which causes the title screen to appear as a rolling screen of random data. You can still click on various spots on the screen to get it to work. Infection is a Ataxx-type game. Starting in the corners, players take it in turns to place a marker of their colour on the grid. An existing marker can be moved two places away, or a new marker can be created within one space of a player's existing marker. If the marker is placed directly next to an opponent's marker, it will take over that marker's position. The game finishes either when the board is full (the player with the most markers wins) or there is only one player with markers left on the board (having taken over all other markers). Up to four players can take part, and they can either be human controlled or CPU controlled. There are nine different board layouts, some featuring barriers dividing parts of the board.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Wise Owl Software", "publishers": "", "genres": "Strategy", "max_players": "4", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/74487-infection\n"}