{"altername_name": ["Ingrid's Back"], "name": "Ingrid's Back!", "overview": "I’ve never yet met a gnome that I haven’t eaten. In fact, if I ever come across Ingrid in person it’ll bee goodbye Nettlefield, goodbye Flopsy and hello after-dinner snack. Ha! That should keep her away. The last thing I want is tiny busybodies messing up all the billy-goat trophies knocking about in my hole. What do you mean, what am I talking about? You remember Ingrid don’t you? Her mum and dad made the mistake sending her to the institute of Gnome Economics for a bit of education. When she came back, they wished she hadn’t. A faulty transportation scroll was designed to make sure she stayed away for ever (and good riddance). Trouble is, Ingrid came back. This time, one or two people are actually glad to see her. Nothing to do with her absence making the heart grow fonder: gnomes aren’t into all that sentimental claptrap! Nope, it’s more to do with the fact that Jasper Quickbuck has taken over as Little Moaning’s most hated gnome. He’s planning to raze the village to the ground and put a great big enormous yuppy homes development in its place. What a meany! Boo! Hiss! Well, Ingrid won’t stand for it. She’s got her territorial uniform out of storage, sawn off the end of a sub-machine gun and gathered together a few grenades (it doesn’t make her look any better – what she really needs is a shave) and now she’s ready for some action. Miss Bottomlow’s campaign is conducted in three parts. First off, she has to get as many people as possible to sign a petition. Easier said than done, but somehow she manages it. Not that it puts Jasper off making a quick buck – he just gets out his steamroller (plus troll cronies) and tries to flatten her farm. Once she’s stopped that, all Ingrid has to do is infiltrate Quickbuck’s manor as a maid and come back with enough evidence to put rabbit-features away for good. Personally, I was a bit disappointed with Level 9’s first interactive adventure, Knight Orc - there were loads of different characters and locations but in the end most of them turned out to be irrelevant. Gnome Ranger was a definite improvement on that, and Ingrid’s Back is even better. The interaction really is worth it this time I just hope, for Ingrid’s sake, that I never meet her front...", "platform": "Commodore Amiga", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Level 9 Computing", "publishers": "Level 9 Computing", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Ingrid%27s_Back", "video_link": "https://www.youtube.com/watch?v=fzYg_cnHLw4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71426-ingrids-back\n"}