{"altername_name": [], "name": "Interstellar Intrigue", "overview": "Five of the most powerful and influential beings in the galaxy meet on board the orbiting space station of Far Funus. Their declared intention is to bring peace to the galaxy by settling their differences, over the negotiating table, diplomatically. Secretly, each of these warlike beings hopes to outwit the other four and seize control of the galaxy for his empire once and for all. There's Bezel from the Pirate Empire resplendent in his burgundy and magenta robes but a creature none of the others would trust as far as they could have thrown his feared and awesome ship, the good vessel Vespozian. All of the others are at a disadvantage when haughty Shazaz-Ka looks them in the eye. They dare not return the stare of this subtle diplomat from the powerful Sun Empire, for fear of being permanently blinded. He uses this advantage sparingly but his terrible frown falls most regularly on the ill-mannered Bezel. In contrast, the brutish gesturing and roaring from infamously ill- tempered Tiaithan Lizard delegate Maachen, threatens to disrupt the proceedings at every turn. The others excuse his behaviour by making allowances for his being out of his natural amphibious environment but they are not so quick to dismiss the threat his numerous blue-emblemed Water Empire forces pose. No-one has ever discovered the name of the anonymous Ice Warrior, whose features remain hidden behind a glacier mask and whose grating voice is disguised by the crackling breathing apparatus that serves him on this mission. He represents the weak and much-scattered Dead Empire, whose voice at these proceedings is only heard because no other empire can take control of the inhospitable planets and dying stars where they live. But while they look down on the primitive resources of the Dead Empire and the irony that these most lifeless of beings have chosen vibrant green as the distinguishing colour of their poorly-equipped fleets, the others keep one wary eye on his ice-axe. And all know the value of an ally capable of inhabiting planets where no-one else can visit - let alone live. Lastly comes Grakta of the Bloodline Empire. Traditionally the rulers of this galaxy and let none estimate his cunning which is the result of 27 generations of careful cloning. His power relies on the Bloodline's long control of the stellar energy, but now it is under fierce attack from all sides - yet knowing Grakta he may still win the day. The five are sat around a board, with their base stars, outlying stars and fleets on it. As the fortunes of galactic war ebb and flow before them they argue, connive, ally and betray to gain the upper hand for their respective empires. Any is capable of wresting complete control, but each must use the others in brief alliances, all will try to prevent any other from becoming too powerful. It's diplomacy on a cosmic scale for two-five players and no holds are barred.", "platform": "Commodore Amiga", "release_date": "1999", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Roger Buckley", "publishers": "Public Domain/Freeware", "genres": "Strategy", "max_players": "5", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372777-interstellar-intrigue\n"}