{"altername_name": ["Eagles Nest"], "name": "Into the Eagle's Nest", "overview": "Into the Eagle’s Nest is a top-down action game, much like the old arcade classic, Gauntlet. As you may have guessed from the title however, Eagle’s Nest is a World War II based game, and concerns the heroic deeds of an Allied Commando, fighting hordes of German Stormtroopers. The graphics are bold and colourful, and the characters themselves are much larger than those in similar games like the Gauntlet and Garrison series, or indeed those from Alien Breed. Using the joystick you guide your character through the maze of corridors in the castle, finding various useful objects like ammunition, keys, health, elevator passes, etc. You will frequently see a long line of Germans lined up in an adjacent corridor, just waiting for you to unlock a connecting door, which will allow them to attack you. Unfortunately though, the game, which promises to be a fun and action filled romp, fails to deliver and will probably be abandoned after only a few minutes of play. The problem is one of tedium. Its just dull. Very little skill is required to massacre huge numbers of the enemy soldiers, and simply standing your ground and holding the fire button is usually sufficient to pack droves of them off to the great Reich in the sky. The sound is very limited, and the scrolling is somehow reminiscent of an early Psygnosis game; highly dodgy, and apparently not making efficient use of the Amiga’s purpose built hardware. I may have missed some source of appeal within the game, but I don’t see what. Its just so lacking in inspiration. In short, avoid the game - unless you feel you simply have to witness it for yourself.", "platform": "Commodore Amiga", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Pandora", "publishers": "Mindscape", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.12", "wikipedia": "https://en.wikipedia.org/wiki/Into_the_Eagle%27s_Nest", "video_link": "https://www.youtube.com/watch?v=5IjhMwRX04o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71442-into-the-eagles-nest\n"}