{"altername_name": [], "name": "Ishar 2: Messengers of Doom", "overview": "The sequel to ‘Ishar: Legend Of the Fortress’ takes up the story long after the destruction of Krogh, by Aramir and his companions - including Krogh’s own mother, the witch Morgula! The former Fortress of Ishar became the new growth epicentre for the Aborean archipelago - The Isle of Kendoria and diverse islands named after Jarel’s companions where another evil lord arose - Shandar. Zubaran, Ishar’s current Ruler, hears of this. So, naturally, Shandar must be found and destroyed. This is the ultimate object of the game. The Silmarils’ standard of graphics and gameplay is sustained, and in parts improved upon, in this evolved creation of a larger and more involved fantasy world. Additions to this game include the introduction of topography. There is a greater variety of characters and creatures and everything is, again, nicely drawn, but the animation remains ‘static’. You start out alone, broke etc., but you have the option of using your team from ‘Ishar 1’. There is a map in this game which, unlike its predecessor, actually shows your position, plus indications of places to go/avoid. This sequel does rely more heavily on precursive tasks, and, unfortunately in this way, does tend towards the linear - but, not in an obvious, precognitive, or boring, way. Overall? Quite a romp! Escapist adventure, or what?! Less uneventful/aimless wandering than either predecessor, but you need an eagle-eye to pick up on some things, even from the start. Difficulty level? Not novice, you need a bit of experience. Not as dull/predictable/frustrating/unimaginative as one or two other RPGs I could mention. Have fun!", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Silmarils", "publishers": "Silmarils", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.31", "wikipedia": "https://en.wikipedia.org/wiki/Ishar#Ishar_2:_Messengers_of_Doom", "video_link": "https://www.youtube.com/watch?v=UaT3HB6XCQI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71443-ishar-2-messengers-of-doom\n"}