{"altername_name": ["James Clavell's Shōgun"], "name": "James Clavell's Shogun", "overview": "OK, miniseries fans, turn back the clock to 1600. Change your name to John Blackthorne, pilot-major of the trader-warship Erasmus. Set your sails for feudal Japan, and enter the world of James Clavell’s Shogun, now an interactive adventure from Infocom. Shogun combines vivid graphics with a traditional text adventure (no audio, which accounts for the program’s low sound rating). As noted on the Shogun box, it’s ‘true to the original’ where language, violence, and such are concerned. Thus, it may not be the game of choice for children. Shogun’s screens are well done. The left pan of the screen is reserved for the text window, where you and the program interact. The rest is devoted to graphics—first-rate illustrations, accurately done in the style of sixteenth-century Japanese court painters that illustrate the adventure as it unfolds. Give these images heed; they may trigger useful insights. The rich graphics and detailed text make an effective combination. You won’t solve Shogun in one sitting. Just to survive, you’ll have to challenge your most basic Western beliefs and assumptions - not the least of which is when to use your sword. You have to learn the rules of a land where manners are paramount and honor is valued above all. Purists may object to the presence of pictures in what is essentially a text adventure. This genre, they say, should be like the novel itself, with illustrations only in the mind’s eye. But suspend judgment until you’ve experienced Shogun. It may change the way you see interactive fiction.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Infocom", "publishers": "Infocom", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/James_Clavell%27s_Sh%C5%8Dgun", "video_link": "https://www.youtube.com/watch?v=-hsaBC3Wi9Y", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/71966-james-clavells-shogun\n"}