{"altername_name": [], "name": "King Kong (void)", "overview": "King Kong for Amiga is an old remake of the famous Nintendo Game and Watch handheld - \"Donkey Kong\", which also noted as the first game on two screens. The main idea came from one of the MiniGame compo entries, where it was implemented for Oric. For the Amiga version, new graphics, music and sounds were used. Also the game was rewritten in C and made much easier to port on other platforms. 6 years after the initial release, it was rewritten for the SDL library, thus making it easier to recompile the game source code on much more platforms. For music, the chip music tracker AHX (Abyss Highest Experience) was used. For graphics I used Personal Paint and native Amiga graphics functions, which were later rewritten for the SDL library usage. The goal of the game sounds easy - you have to go to the top of the building and catch the crane at the right time. When the crane is catched, a hook holding the King Kong is removed. When all the hooks are removed, the guerilla falls, the player is rewarded bonus points and the happy princess send air kisses to her savior. Several obstacles make the goal harder. The guerilla throws barrels. If a barrel hits the player (or he hits himself in barrel), it takes him a life. There are also patterns on the building site, which can kill our hero, if they hit him. Or the player can fly away from the building, if he does not jump at the right time, or simply go to the wrong way. All these obstacles force the player to come up with a strategy for playing the game and scoring better results, which are kept in the \"BEST\" score register, shown on the bottom right of the game screen. The sound effects are minimal, but listening to them are a big helper during the game, where the player adapts to the speed, according to the ticks. The game beside the nice intro screen also have an outro screen, stimulating the player to complete it. The princess starts to smile if the guerilla falls too many times. Bonus lives are rewarded at certain points. There are also some other small surprises, which makes the game a polished product. It can be played with keyboard or Joystick. It is possible to look at the game in window on the Workbench or in full screen mode.", "platform": "Commodore Amiga", "release_date": "2003", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "dr Hirudo", "publishers": "void", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164108-king-kong-void\n"}