{"altername_name": [], "name": "Lactose Intolerance", "overview": "The game consists of 64 individually named levels, the task of each of which is to collect a certain amount of red and green gems and get to the exit, while avoiding the rampant spiders that inhabit the levels. To guide your man around the screen, use the joystick or the cursor keys. You can dig through ground and collect gems and keys by simply moving towards them. The spiders move all the time, trying to home in on you. They move slower on earlier levels, but fasten on later levels. Needless to say, contact with the spiders is fatal. For your defence, you have bombs. Each level gives you a certain amount of bombs. To drop a bomb, press fire or return. It will detonate shortly after it has been dropped. On some levels you may not have bombs at all. There are two kinds of wall, one which can be bombed through and one which can not. It's up to you to find out which is which. There also are teleports, keys and locks. The teleports look like purple blobs. If you use a teleport, you are teleported randomly somewhere on the screen. Take care, the spiders can also use the teleports! To collect a key, move to it. Moving to a lock carrying a key opens the lock and decreases your key amount by one. When you have collected the required amount of gems, find the exit and move to it. But you must note that you must collect the exact amount of gems required! If you collect too many gems, you won't be qualified to the next level. To help you out on this, you can leave gems behind by pressing del or help. Every level has a fixed amount of moves within which you must complete it. If you run out of moves, you die, but are granted a new set of moves.", "platform": "Commodore Amiga", "release_date": "August 28, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Joona Palaste", "publishers": "JIPSoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KzARQqblR2Q", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164124-lactose-intolerance\n"}