{"altername_name": [], "name": "Lancaster", "overview": "When it entered the war in 1942, the Lancaster bomber had an almost immediate effect. A devastating 14,000 pound payload, three gun turrets and eight .303 caliber machine guns. CRL's computer adaptation of a Lancaster bomber isn't quite dramatic as some of its real life encounters, but it certainly puts you where the action is, in the tail gunner's seat. Contained in the rear of the plane, just under the tail, is the turret. Armed with four guns it's the job of the gunner to cover the rear end of the plane from enemy attacks. The major attack wave consists of single engines Messerschmidt BF109, single engine fighters and Junker JU 88's with two engines and radar. On top of that flak is constantly thrown up from the ground below making life a lot rougher for the crew. If you and your plane have survived the Luftwaffe's best attempts to bring you down, it's your chance to drop a few bombs on German emplacements. Unfortunately the realism drift into fantasy and fun with fancy targeting cross hairs and a zoom feature through the bomb door's view. The way back is also fraught with the risk of attack from nearby airbases. The easiest way to avoid attacks is to fly around all the major cities; but unfortunately, you also have to keep your eye on the fuel gauge, so sometimes this proves a little tricky. Lancaster is a very well presented and executed game. The only real complaint I have is its overall lack of variety; maybe different aircraft positions during flight could have made a slight improvement. A worthy game for all shoot 'em up and simulation freaks.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Showroom Dummies", "publishers": "CRL Group", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=OWn0Mcc5yK0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72229-lancaster\n"}