{"altername_name": [], "name": "Las Aventuras de Rudolphine Rur", "overview": "Rudolphine Rur (Rudolph to friends) is in an enviable situation. He owns his own tree house in the most elegant part of the Valley. He has managed to progress in his profession to become respected as a Master Shoemaker. His family is in good health and he generally gets along with all of them (ahem). It looks like it's going to be a happy autumn in the Valley... What will drive Rudolphine to leave his comfortable home and dash through intricate forests and snowy mountains until dangerously deep into the unpleasant human world? This game belongs to what came to be called conversational adventures, and which today is also known as interactive fiction. You will be able to move through a series of locations, each of them made up of a description and a small static graphic on some occasions. The game consists of exploring this world that the game offers you, interacting with the characters you meet, collecting and using the objects... in short, doing everything that allows you to overcome the challenges of the story and have a fun time with it. The way to give orders is simple: you must write what you want to do, in a simple way, so that the computer understands you. Basically using the formula VERB + NOUN E, as for example: get book examine knife hit plant Occasionally you will need to use more complicated structures: open door with yellow key give cheese to fox The game has a large but limited vocabulary, so if you're sure of something but the computer doesn't understand you, try writing it differently or using different words. It will surely work. They are basic commands in an adventure: LOOK (M) , describes the current location again. NORTH (N), SOUTH (S), EAST (E), WEST (O), NORTHWEST (NO), UP, DOWN... to move from one place to another.", "platform": "Commodore Amiga", "release_date": "2005", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Dwalin", "publishers": "DAAD", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167490-las-aventuras-de-rudolphine-rur\n"}