{"altername_name": [], "name": "Leisure Suit Larry 1: In the Land of the Lounge Lizards", "overview": "Back in 1987, Leisure Suit Larry, a humorous graphic adventure, arrived on Amiga screens. In 1991, Sierra decided to revive the old classic with enhanced graphics and sound, while sprucing up the gameplay with their (then) new icon based user interface. The Man in Polyester was back, looking and sounding better than before. But is the new version a worthy successor to the old classic? Simple answer is - yes and no. The enhanced graphics meant 256 colours in the IBM compatible world - on the Amiga side this meant 32 colour dithered graphics with a rather shabby colour palette. Apparently the colour scheme was downgraded with no regards to picture quality. Luckily the animation is fluid. Speaking of graphics, the biggest difference between the original and this enhanced version is in the main character graphics. Larry has been transformed from a 'lego man' to 'Mr big giant potato head', resembling his picture on the gamebox cover much more than before. Soundwise the game is really enhanced - there's now properly orchestrated four channel music and also some speech samples which are put to good use. The biggest change in the new version is without doubt the new user interface. When designing their own icon-based UI, Sierra chose a very different path than for example LucasArts. First, the selection of verbs is very limited - walk, look, action, talk - and second, they are chosen in a very straightforward manner, by either continuously clicking the right mouse button until the mouse cursor transforms into the required choice or by selecting them from the icon bar which appears at the top of the screen if you move the mouse cursor over it. The new system is very easy to learn and use. While the original version has a special place in my heart and despite the slightly flawed conversion I would recommend this new version over it. The actual gameplay has not changed at all - all the toilet humour and shabby scenes (complete with the animated 'CENSORED' plate) are still there. If you own the original version there's no reason to buy this unless you are stuck in the original and want to play the game with the new easier user interface. Also, if you hate the game style Larry represents, this game is unlikely to turn you into a convert.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "", "esrb": "", "developers": "Sierra", "publishers": "Sierra", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.6", "wikipedia": "https://en.wikipedia.org/wiki/Leisure_Suit_Larry_in_the_Land_of_the_Lounge_Lizards", "video_link": "https://www.youtube.com/watch?v=gt6q9CV82bw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72277-leisure-suit-larry-1-in-the-land-of-the-lounge-lizards\n"}