{"altername_name": [], "name": "MA Games", "overview": "A 3 in one of games from Miguel Ángel Jiménez Santana of M. A Soft. MA Soft, with this game, offers us a compilation of 3 small intelligence games. After loading it we can choose between 1.Japanese Othello 2. Towers of Hanoi 3.Ston Ball Japanese Othello Entertaining board game in which we must catch the opponent's chips. You do this by surrounding an enemy token (or row of tokens) between two of your own, at which point the enemy token becomes your side. Whoever has the most pieces on the board at the end of the game wins. The game is controlled by keyboard instead of mouse (as usual in board games). Towers of Hanoi Famous pastime in which you find a stepped pyramid and three axes where it can be placed. The goal is to move the pyramid from one axis to another. Surely you have seen this little game on a mobile phone. The graphics are weak and somewhat bland but they pass, and as for the sound, a cheerful music accompanies the game. As I have already said, it is not a game but a hobby, but it is entertaining if you get into it. The control is by mouse, and therefore very comfortable. Stone Ball And we come to the best part... Stone Ball is a fun puzzle game in which you have to clear a path for some rocks so that they reach the bottom of the screen. For this we have 2 little men who will push sections of walls with holes inside. The idea is to move the walls so that the stones fall through the gaps until they reach the bottom of the screen. When the stones reach the bottom you go to the next level, being more and more difficult, of course.", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "M. A Soft", "publishers": "Public Domain/Freeware", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165064-ma-games\n"}