{"altername_name": [], "name": "Megasquad", "overview": "Megasquad is a two-player combat-style game with two different modes of gameplay: Tag and Duel. Both game modes are played on boards consisting of walls and gates, and there are many boards to choose from. You may either choose a board each time you play, or you can have the computer pick a random board. Control: The control is based on rotation and thrust. Each player controls a ship, and the ship is rotated left and right with the joystick. Thrust can be applied by pressing up on the joystick. In duel mode, the fire button fires a shot. Player 1 uses joystick #1 (the free joystick port) and player 2 uses joystick #0 (the mouse port). The object of tag is to accumulate a certain amount of points before your opponent does. The player who is not 'IT' accumulates two points per second. The player who is 'IT' must try to tag the opponent. When the player who is 'IT' tags the opponent, the opponent becomes 'IT'. There is a three-second getaway time, and during this time no points are accumulated. At the beginning of a Tag game there is a scramble to determine which player starts out as 'IT'. Both players are placed at an equal distance from a red line, and the last player to cross the line starts out the tag match as 'IT'. There are six different scramble boards, and you can select which one is used, or you can have the computer select a random one each game. This is done from the option screen. Duel: The object of the duel game is to shoot your opponent and avoid getting shot. You accumulate one point each time you kill your opponent, and your opponent accumulates a point when he kills you. The first player to get a certain number of points wins the game. There is a three-second invincibility which takes effect at the beginning of the game and whenever a player dies and reappears.", "platform": "Commodore Amiga", "release_date": "May 6, 1993", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Clay Hellman", "publishers": "Quality Public Domain", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=NGzAEzL3fYU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164244-megasquad\n"}