{"altername_name": ["Megaball v3"], "name": "MegaBall V3.0", "overview": "Megaball v3.0 is an Arkanoid variant with 50 levels, plus a level designer in the registered version, which inspired the DX-Ball series. It is the Sequel to Megaball v1 and Megaball v2 and the precursor to Megaball v4. The basic gameplay involves using a paddle to hit an arrangement of blocks, with the aim being to remove them all. There is an area above the blocks - getting the ball into this can cause a shot to remove lots of balls quickly. Like any Arkanoid-style game, there are power-ups, which are released by hitting particular blocks, and must be caught using the paddle. They include a bigger paddle, laser guns mounted onto each side of the paddle (making it quicker to remove the blocks) and a level-skip, but watch out for the 'kill player' icon. Not all bricks clear with one hit, and some remain on the screen but in a different colour to show that they've been hit. MEGABALL V3.0 was the first release of the game to feature support for AGA machines, as well as higher resolution/overscan screenmodes exceeding low-res PAL/NTSC. Reportedly, MEGABALL V3.1 was an exclusive release for new registered users only, who received 2 disks including the game disk (AGA + OCS/ECS releases of MEGABALL V3.0 with updated titlescreen) plus a music disk - that previously needed to be purchased separately for a small shareware fee - at no extra cost. TRIVIA: A fake version of MEGABALL 3 (with real coding credits removed) was released to the scene in 1994 by Hawkeye Soft, who were notoriously lame for hacking other games that year and taking credit for work that wasn't their own. Other fake versions - MegaBall v3.3 and v3.8 - were also released by hackers and can easily be identified by the dodgy spelling and grammar used in the version history logs contained in the AmigaGuide docs.", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Ed Mackey", "publishers": "Ed Mackey", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165326-megaball-v30\n"}