{"altername_name": [], "name": "Mike the Magic Dragon", "overview": "Imprisoned by some evil character in a castle far from home, you play the part of Mike The Magic Dragon. If you fail to escape you will become a guineapig for a series of cruel experiments. Mike was programmed by Kingsoft and true to their usual style the game starts up with a bit of Jan Hammer-like synth music, accompanied by a colourful if not amazingly well drawn title screen. The music continues through to the game which turns out to be a pretty straightforward platform affair. Three letters are placed around the screen which spell out a word or acronym associated with Amiga computing, for example, CU, CPU, RAM etc...which is an agreeable creative and appropriate item. Collecting them in the right order in addition to the many jewels will give you the key to the next level. Ghosts, tomatoes and all those kind of things you expect to find in a platform game patrol the walkways and as always are deadly to the touch. Parachutes can be picked up and used to break a fall. If you hang around too long your captor's pet spider makes an appearance to keep you on your toes. Fast reactions are called for here. Mike The Magic Dragon makes very few advances from Manic Miner, released on the Spectrum many years ago but gamers will find it involving. Sampled sound and improved graphics make it a very professional looking product but as far as the game goes, almost no progress has been made. You could think differently, so If you feel the need for a platform game Mike The Magic Dragon will be worth considering, certainly recommended for first-time, younger Amiga users.", "platform": "Commodore Amiga", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Frank Neuhaus", "publishers": "Kingsoft", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5HU-uCj5WDU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72380-mike-the-magic-dragon\n"}