{"altername_name": [], "name": "Mini Zorro", "overview": "A Jump n Run style platform game from Iron Gate with Zorro as the hero. Pick up the keys, jumping and dodging enemies. You have a pistol but it is of very limited use. The oldest of the place say that whenever injustice makes an appearance in our little town a mysterious figure appears from the shadows. A masked man who walks the roofs of the houses, always watching. There is no place he cannot go thanks to a purebred Spanish black horse. No identity and no age. He appears throughout the years and is a real nightmare for the soldiers. sent from Mexico with a thirst for gold and very few scruples. They say that he helped appease the Apaches, He defeated the English and French from the north and put the Mexicans to flight. Now a lieutenant has come from the south with his eye on gold. An evil subject who makes life miserable for the locals. Now more than ever Californians pray for the masked man to appear and free them from this terrible fate, Well, this lieutenant is willing to do anything to get the coveted gold. Everyone tells him: Don't stop looking at the rooftops, he looks in the shadows, for soon the most cunning and elusive knight in all of New Spain. Soon the one that everyone has called \"El Zorro\" will appear behind his mask Don Diego de la Vega is a Californian recently arrived from Spain, where he studied at a military academy and spent some time in the army in Europe. Skilled in the sword and above all in survival, he returns to his home where he hopes to spend his days calm away from the wars in which he is immersed throughout Europe. But those plans cannot be fulfilled, because an evil lieutenant has arrived in the region and is carrying out countless misdeeds protected by the authority of the uniform he wears. Don Diego's father confesses that El Zorro has lived in his family since who settled in that hacienda from Spain many years ago, when there were only Apaches. Now you as Don Diego must pick up the baton and rid the people of California of the evil lieutenant. Run, escape from the soldiers who come to your farm, find the Zorro costume and honor it. But do not think that the lieutenant has made it easy for you, he has soldiers everywhere He searched for Zorro and has captured your fiancée, holding her in the fort. Make your way through the rooftops, through the basements, galleons, mines and prisons. Whatever it takes to save your loved one and the people of California. Luck!!!!!", "platform": "Commodore Amiga", "release_date": "2020", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Irongate", "publishers": "Public Domain/Freeware", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=o1hWI91e7m0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368311-mini-zorro\n"}