{"altername_name": [], "name": "Nemac IV", "overview": "In 2048, all of Earth's defenses was handed over to three neural computers called Nemac I, II and III constructed by the three ruling alliances of the planet. Each computer was stored in a separate HQ. During the North-South Wars of 2057-2065 one of the HQs was infiltrated by commando units, which lead to the creation of an even more secure and powerful super computer called Nemac IV stored in a high-tech bunker deep underground. Nemac IV controls all the automated military arsenal in the world. However, a problem occured: a simulation meant to test Nemac IVs capabilities went horribly wrong when the super computer didn't notice that it was only a simulated assault on its physical systems in the bunker. This lead to the computer assuming its own makers were its enemies. Now it's up to the player to stop Nemac IV from launching its nuclear arsenal on its own troops before it's too late. Nemac IV is a first person shooter where the player remotely controls a FIKM-7 robot and has to destroy Nemac IV's reactor core at the bottom of the bunker. To defend against the enemy drones, the player has a chaingun, a plasma gun, grenades and bombs. Unlike other FPS games, weapons don't have to be picked up, but they are instead available right from the start. The player only has to ensure a full stock of ammo. The weapons can also be fired simultaneously by pressing their individual fire buttons all at once. Besides ammunition, bonus health can also be picked up. The levels contain doors which are sometimes locked by a key code that can be obtained at a computer. Nemac IV also contains small puzzles, where after pressing a switch, the player has to find the shortest route to the respective door before it closes again. To aid the player in navigating the 40 levels, a auto-map can be overlayed on top of the game screen.", "platform": "Commodore Amiga", "release_date": "1996", "game_type": "Released", "esrb": "", "developers": "ZenTek", "publishers": "APC&TCP", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128184-nemac-iv\n"}