{"altername_name": [], "name": "Nitro", "overview": "Nitro is an top-down perspective arcade racer for the Amiga and Atari ST. It was developed and published in 1990 by Psygnosis. This game contains no clear background or storyline, just white-knuckle video game racing. After choosing whether to play with one, two or three (via keyboard) players, the player(s) must select a car and buy accessories at the \"pit stop\" before proceeding to the race. Three vehicles are available; namely the racing car, sports car, and turbo buggy. Accessories include nitros, high speed, acceleration, traction, fix damage, a change of car, as well as fuel which is imperative to the racing campaign. The game consists of 32 levels, but the game ends when the fuel is depleted. To prevent this, the player must finish in a high place on most races, which rewards the player with up to 600 gasoline units. In addition, power-ups float around in the levels as well as being placed on the track, but these may be picked up by any of the four cars. There are four different environments. Starting on city roads, the player advance through forest and desert tracks before playing the last levels in a wasteland terrain. (Evidently, the Nitro story is that the apocalypse occurs, and the races go on. \"The end of the world is nigh\" is graffitied on the track.) Every four races there are night levels, which means that the screen is pitch-black save for the small area illuminated by headlights. Double headlights are available as a floating power-up. Obstacles during races are commonplace. Examples are cones and holes in the road, which mainly slow down the player, and (blue) oil spillage which causes the car to spin. The Nitro manual makes reference to pedestrians, and says that in some races extra points are given for hitting pedestrians—however During a replay only 1 of the 32 levels has a message prior to entering the race, mentioning : money awarded for hitting pedestrians. Nitro was also available as part of the Psygnosis monster pack, volume I, along with the original Shadow of the Beast and Infestation. The \"monsters\" in the game may refer to the players—namely, Clint Eastwood (P1—white), Rambo (P2—yellow), and James Bond (P3—red).", "platform": "Commodore Amiga", "release_date": "December 2, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Psygnosis", "publishers": "Psygnosis", "genres": "Racing", "max_players": "3", "cooperative": "No", "rating": "4.18", "wikipedia": "https://en.wikipedia.org/wiki/Nitro_%28video_game%29", "video_link": "http://www.youtube.com/watch?v=QE37V0k3NKA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18309-nitro\n"}