{"altername_name": [], "name": "On the Road", "overview": "A German language strategy game for up to 6 players, created by Expert Software and released in 1990. The date is April 13, 1993 at 12:25 p.m. Even as a freight forwarder, it is not easy to earn your daily bread. But what's the point of being a professional: Short but well calculated, the offers of the competition are undercut - and thus you can get the most lucrative orders. For example, moving a container with 20 tons of office furniture from London to Tunis - within just 24 hours. Now it's only six hours' drive to the destination. In fact, nothing can go wrong. But the gravel roads through North Africa are treacherous and put a strain on man and machine.... Features: *Simulation of the forwarding business in Europe in the 90's International Yean's account * Strategy game for 1-6 players or computer opponent 10 levels of difficulty High and low score tables Any number of games can be saved Game goals can be varied within wide limits Trucks with different power and Consumption values can be compiled Goods and company catalog with text editor arbitrarily changeable and expandable Weather influences and police controls switchable Interaction options: sabotage, espionage, theft, bribery, accusation, election to Trucker of the Month *Speculation deals in real estate, goods, Vehicles, orders... * high-quality, fully serviceable technical equipment of the forwarding office: computer with GUI, radio, telephone *Notebook function integrated virus test for program and boot sector 72-page manual Hard drive installer", "platform": "Commodore Amiga", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Expert Software", "publishers": "Lifetimes", "genres": "Strategy", "max_players": "6", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=CuRcI1aHgJ0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164390-on-the-road\n"}