{"altername_name": [], "name": "Overgod", "overview": "For too long has the world been ruled by cruel and disputatious gods! It's time someone did something about it. You have constructed a vehicle in which to visit the outer layers of the Celestial Oversphere and do battle with those who sit in judgement on the Universe. Failure means oblivion, or worse. Success will strike a blow at the shackles which bind humanity, and let you join or even supplant those you have conquered! Your vehicle is a marvel of transplanar engineering, capable of traveling to worlds beyond our knowledge and making use of the strange energies which there exist. Long years of research and intricate labor have allowed you to build weapons capable of tearing through the substance of even the most exalted ones, and you have made the appropriate pacts to enable your craft to reconstitute itself a limited number of times should its substance fail you. Now it is ready to leave this place behind and venture to where your existence is forbidden. Your task will not be an easy one. On each layer of the Oversphere you must fight your way through the lesser gods, greater gods, elder gods, younger gods, demigods, demiurges, idols, sub-idols, undergods and overgods, and all of their children, slaves, servants, soldiers, sentinels, guardians, messengers and machines. Most of the enemies you meet must be destroyed for you to reach the next layer. The larger enemies are worth several of their smaller kin, while there are some whose destruction may be useful but is not required. A secret ritual has shut the fearsome Eyes of the Watchful Ones, although only for a time. You will have from two to three minutes in each layer before they open again, so don't tarry! Game by Linley Henzell conversion to AmigaOS4 by Hitman.", "platform": "Commodore Amiga", "release_date": "January 5, 2010", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Hitman", "publishers": "", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167298-overgod\n"}