{"altername_name": [], "name": "Pechowy Prezent", "overview": "\"Unlucky Gift\" is an adventure game published by Mirage, and the authors of which are well known to us Mariusz Włodarczyk and his brother Karol. The plot is quite original and, to be honest, even funny. The main character receives the desired skateboard as a birthday present. He takes it to school, where it is stolen from him. A devastated little student decides to get her back at all costs ... And the player must help him in this. The whole story is described in the introduction to the game, enriched with digitized speech (a bit poor execution of the latter element). Unlucky Gift. The action of the game takes place at school. We are before the first class at 8:45 am and, reconciling the student's duties, we have to get the skateboard back by 1:00 pm. Time does not pass as you move through locations, but as activities are performed. The interface used to operate the game is not very complicated, although it is divided into two parts, between which we can move by clicking the right mouse button at any time. We won't see any command panel or anything like that. We simply click on the spotted items as part of examining them, examining them, or using a pocket item on them. The level of puzzles is quite low. It is a simple adventure game that should not be difficult even for novice players. There are a few items that we will find, but their use is intuitive. Usually, as soon as we find an item, we get an idea of its purpose. The characters appearing in the game suggest or suggest where to go next. The game type is linear, which means we can't change the course of events. We follow a predetermined path planned by the authors. What stands out is humor. I really liked the situation when, while in one of the rooms, I hovered the cursor over a girl who was wearing a very large bow. The words \"bow with girl\" will appear. There are more such situations. Interestingly, there is no typical way to save the game in the game. For what is rare in adventure games, we have a code system popularly used in arcade or logic games. After completing the stage of the game specified by the authors, we receive the code, which allows us to start playing from this moment on. The game is not equipped with a script that installs it on the hard drive, but it is enough to copy all files to one directory and make the appropriate assignments.", "platform": "Commodore Amiga", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Nipson", "publishers": "Mirage Software", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=QhWzydPQxog", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161675-pechowy-prezent\n"}