{"altername_name": [], "name": "PoNG4", "overview": "Pong for up to four players with objects in the middle that can affect the ball's movement. Four-player mode sounds exciting at first, but it does not really work in my opinion: If, for example, you play on the top side and the ball gets deflected to the top by either the player on the left or the player on the right, the distance can be so short you simply do not have enough time to react. 2x2 - two players are positioned at the top and two at the bottom of the screen. They play in co-op mode and their points are added up. The first team; top or bottom, who reach 21 points wins. At the start only two players are initialised. The other two players will appear if they press fire to join. If all 4 players join, a second ball will be added. 4x4 - each player is positioned at his own side of the screen. 1 point goes to the player that was last to hit the ball before it went out of the screen. -1 point goes to the player in front of the side of the screen where the ball went out. Points don't go below zero. The winner is the first one who reaches 10 points. Both types of the game start with a 3 second countdown. Unless a player hits fire, the player is controlled by CPU. You can either press fire during the countdown or join the game later. There's gravity towards the centre of the screen which is unnoticeable at the start but slowly increases. The Eye is revolving in random directions around the center of the screen and can also bounce the ball. It slowly aproaches the center of the screen and gravity gets stronger until it's caught at the center. It's satellite, if picked up by the ball it acts like power-up / down. Black satellite - turns off the screen for a second. Red satellite - slows down all players for 5 seconds except the one who last to hit the ball before it collided with the Eye's satellite. Blue Satellite - freezes all players for 3 seconds except the one who last to hit the ball before it collided with the Eye's satellite.", "platform": "Commodore Amiga", "release_date": "2018", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Cobe", "publishers": "", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=CJcGLQ5GO84", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161982-pong4\n"}