{"altername_name": [], "name": "Shadow of the Beast", "overview": "Shadow of the Beast is a side-scrolling platform computer game produced by Reflections (Later known as Reflections Interactive) and published by Psygnosis in 1989. The original version was released for the Commodore Amiga but the game has been ported to many other systems. The original Amiga release cost £35, an unheard of price for a video game in that era, but it did include a T-shirt in the box bearing a print of the box's artwork. Psygnosis had published numerous side scrollers with high quality graphics prior to the release of Shadow of the Beast (most notably Obliterator). Shadow of the Beast, however, was considered revolutionary because its graphics, with many more colours on screen and up to twelve levels of parallax scrolling backdrops, were of a level rarely if ever seen before in action games. It was also notable for its atmospheric score composed by David Whittaker that used high-quality instrument samples. The first game's story is about a man named Aarbron who was kidnapped as a child and corrupted through magic into a monstrous warrior-servant for the evil beast lord Maletoth. The creature's memory of his human life returns when he watches a man being executed, whom he later recognizes as his father. This prompts Aarbron to seek revenge on Maletoth. The box artwork of the game, like many Psygnosis releases of the time, was created by fantasy artist Roger Dean, in a style reminiscent of his Yes album cover artwork.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Reflections Interactive", "publishers": "Psygnosis", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.85", "wikipedia": "https://en.wikipedia.org/wiki/Shadow_of_the_Beast", "video_link": "http://www.youtube.com/watch?v=uiAUZe_kL_Y", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/19611-shadow-of-the-beast\n"}