{"altername_name": [], "name": "Shuttle: The Space Flight Simulator", "overview": "Shuttle is a 1992 space flight simulator game developed by Vektor Grafix and published by Virgin Games. It has been praised as a reasonably accurate simulation game of piloting the NASA Space Shuttle. The software is noted for simulations of the space shuttle in many situations in a 3D environment, from leaving the Vehicle Assembly Building to returning to Earth at the Shuttle Landing Facility and displayed almost every switch, knob and display of the real shuttle control panels while simulating most of their respective functions. That said, only a subset of the controls actually worked and a number simply made the shuttle explode; however, it's quite likely that many of the same controls (e.g. separating the Solid Rocket Boosters while they were still burning during the launch) would make a real shuttle explode, as well. The operation of the General Purpose Computers (GPC) required the input of the according program commands for the current flight situation, albeit in a simplified fashion. Shuttle for the PC was released on two 360k floppy disks, however it could be copied to a single 1.44MB floppy and installed or run from there. Gameplay consisted of flying through simulations of a number of different space shuttle missions, starting with the Approach and Landing Tests where the original space shuttle, Enterprise, was flown from the back of a modified Boeing 747 to a gliding landing at Edwards Air Force Base, through to launching the Hubble Space Telescope, building a space station, using the Manned Maneuvering Unit to capture satellites for repairs, and launching 'secret' military satellites. The level of detail went so far, that the External Tank (ET) painted in white color was only displayed in the earliest available scenarios while the later one displayed the brown it wore later on. As the missions themselves were fairly complex, the game would optionally provide a high level of hand-holding. Instructions were passed to the player on a 'teleprinter', and when those instructions required the player to use the shuttle controls, the appropriate switch or knob would be indicated by a flashing box. As such, the normally massive amount of material the player would be required to read through in order to know how to accurately and safely pilot a shuttle were condensed into something the average player could understand, another point of praise for the game by its users. The camera zooms in on the Space Shuttle launch stack (MS-DOS) To further ease gameplay, the game supported multiple different camera views, more than the standard control panel and external view found in most simulators of the time, the player could also look out of any of the cockpit windows, including back into the payload bay when retrieving or releasing satellites, and some of the CCTV cameras on the Remote Manipulator System. In addition, for those who wanted to know a little more about the shuttle but did not wish to read NASA technical details, the developers also provided an in-game primer giving a few pages of information and some diagrams on each of the major Space Shuttle systems. Finally, the publishers supplied a thick game manual and a large poster showing the control panels. Given the scope and complexity of the game it shouldn't be surprising that it was released with a few bugs. In particular the autopilot could get confused and fly some very unusual re-entry trajectories. In early releases, it was impossible to fly the last mission. Fortunately there was an easy workaround for the latter bug, as putting /ALL on the DOS command line when starting up the game gave one access to every available mission.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Vektor Grafix", "publishers": "Virgin Games", "genres": "Vehicle Simulation", "max_players": "1", "cooperative": "No", "rating": "4.59", "wikipedia": "https://en.wikipedia.org/wiki/Shuttle_%28video_game%29", "video_link": "https://www.youtube.com/watch?v=5Thf2eoa_og", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92647-shuttle-the-space-flight-simulator\n"}