{"altername_name": [], "name": "Simulman 7: Il Grande Freddo", "overview": "Simulman 07: Il Grande Freddo is an Italian 2D single screen - flip screen action adventure game, developed by Fabio Belletti, Natale Fietta and Stefano Balzani and published by Simulmondo, which was released in Europe in 1993. Simulman must arrest drug traffickers including The Great Cold or The Great Cold One as the title would be translated in English. Blessed are you who interact for pleasure. Not that I simulate by compulsion: only when I am faced with an adventure like this one of Simulman that you have in front of you, seriously I would like to know nothing else but to personally enjoy the action. But someone needs to create an adventure like this. Okay, in spite of myself I must rise to the occassion and satisfy you needs. In short, in this simulated story I decided to tell the past of Simul. Something you may have seen coming, and something that may not bring delight. However, the choice to become a virtual agent is not one taken at random. Let's say that the city understood that the threat of the Doors was real now. And that the simulations could become more disturbing and harmful of real reality. And so love and hate, good and evil are certainly no longer unreal and less exciting just because they are virtual. So here you will discover, interacting with enthusiasm and passion I hope, many things about the past life of the Simulmans and we will understand together why he is so determined to eradicate SS-DOS and its simulated creatures, including The Great Cold.", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Simulmondo", "publishers": "Simulmondo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=fnoxFgeu5yQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157223-simulman-7-il-grande-freddo\n"}