{"altername_name": ["Spades v2.12"], "name": "Spades", "overview": "\"Spades\" is a program written to play the card game Spades. It may be run from the CLI or the Workbench. This is a one player version of Spades -- you play one hand, and the computer plays your partner and two opponents. The program plays by the following rules adopted by my friends and I here at the University of South Florida: 1) Four players are found, divided into two partnerships of two players each. Partners sit opposite each other. 2) A dealer is randomly picked. Each player receives 13 cards from a standard 52-card deck dealt clockwise starting with the player on the dealer's left. On successive hands, the deal passes to the left. 3) Starting to the left of the dealer, each player bids the number of tricks he feels his hand can take. Bidding passes clockwise. A partnership's bid is the total of the two partners' bids. A partnership must take this total number of tricks. 4) Play starts with the player to the left of the dealer and passes clockwise. The only rule about leading is that spades may not be lead until spades have been broken (i.e., played during a hand), unless a player holds only spades. 5) Players must follow suit -- if you have a card of the suit lead, you must play it. Otherwise, any suit may be played. Play ends with the player to the right of the leader. In other words, each player plays one card. 6) Highest card of the suit lead, or highest spade if a spade has been played, wins the trick. Cards rank 2 lowest through Ace highest. The trick winner scores one trick for his partnership and then leads for the next trick. 7) After all 13 tricks in a hand have been taken, scores are totaled. If a partnership takes at least as many tricks as they bid, they get 10 points for each trick they bid and one point for each trick they took over their bid. If a partnership fails to take the number of tricks they bid, they lose 10 points for each trick they bid. If NIL bids are in effect, and a player bid zero tricks and took zero, his side scores 100 points. If a player bid zero and took at least one trick, his side loses 100 points. If Bags are in effect, and a team has accumulated 10 or more overtricks, they lose 100 points. Negative scores are possible. 8) Deal passes to the left for another hand. First team to 500, or the team with the highest score if both cross 500, wins.", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Greg Stelmack", "publishers": "", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=cWDyhNmq-Nk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164642-spades\n"}