{"altername_name": [], "name": "Starflight", "overview": "Starflight comes complete with a photo of a haggard looking group of American programmers dressed in spacesuits, but looking more like MacDonalds crew members. This game is set in one of the dodgiest area known to software - it's an Elite clone. You begin your quest in the round, anonymous bowl of the spaceport where you have a minimal amount of money to recruit a crew and equip your spacecraft. You then set off on an interplanetary flight by dragging a mouse around the solar system. Once you've established an orbit around the planet a revolving planet appears on which you can attempt a landing. You can then get onto your 4x4 range rover/mining machine and explore the surface. This is one of the best aspects of Starflight, as you zip around in search of bounty. Then, much like Elite, it's time to return to the starport to flog what you found. The systems are detailed with a good balance of interesting and not so interesting planets to explore. Where it loses out is in the space combat which is entirely formularised and really pretty dull. As you progress your options are made clear, whilst still leaving you a good margin of choice which gives the game a more RPG-like touch. Even taking into account the total unoriginality of the overall concept, EA have done an excellent job of making this as playable as possible. It will not become a classic, but Starlight made a very passable distraction and will almost certainly have you extracting your money's worth of entertainment as easily as your terrain vehicle scoops up minerals.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "MicroMagic", "publishers": "ECP (Entertainment and Computer Products)", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "https://en.wikipedia.org/wiki/Starflight", "video_link": "https://m.youtube.com/watch?v=ywDz_0_ratQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73186-starflight\n"}