{"altername_name": [], "name": "Stix n Trax", "overview": "A humorous ice hockey game Stix N Trax is a cool new 2 player simultaneous ice hockey game. You have to get the puck and score against the other player, first player to reach 10 wins! It was coded in Blitz Basic v2.1 using Dpaint5 to create the graphics. Sounds were grabbed for the crowd using Megalosound v1.37. The crowd sounds were meant to add humour to the game and make it more realistic, the graphics may not be very impressive because I did them myself ;). One final point is that it may need an accelerated Amiga because of the constant blitting of the crowd. I'm not sure though because it has only been tested on my 040/25. Welcome to Stix N Trax! A game made specifically for entry into the Amiga Format readers game section! The game is essentially a one on one 2 player simultaneous Hockey game, there are two NHL hockey teams to choose from. Each team consists of one pro player. The players must control their Hockey Player using the joypad and try and score in the opposing players goal. Pushing the fire button whilst in possession of the puck will fire it in the direction which you are traveling. The puck's speed and direction is proportional to the players speed and direction. Pushing and holding the fire button whilst not in possession of the puck lets you gain control of your goalkeeper. The goalkeepers job is to stop the puck going in the net by moving in the way of it. When the puck hits the keeper it will be catapulted outwards back into play. The winner of the game will be the player who gets 10 goals first.", "platform": "Commodore Amiga", "release_date": "1997", "game_type": "", "esrb": "Not Rated", "developers": "Gareth Murfin", "publishers": "", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=SHXSzup_klk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162776-stix-n-trax\n"}