{"altername_name": ["TechnoVenture"], "name": "Techno Venture", "overview": "TechnoVenture is a fun and innovative platformer with strong puzzle elements, similar to classic Apogee games of yore. At first TechnoVenture might look like just another Sci-Fi themed platformer game, but closer inspection reveals it's actually much more. The game begins with an advertisement for registration and the \"Playfield\" newsletter, which are quickly dismissed. You're not given any sort of introduction, but instead dumped right in the middle of the action. The \"story\", what little there is of it, tells you that you suddenly find yourself being a brand new XED-2000 robot, and your quest is to rid the land of the evil mutants. The story is told as you go along. On the surface, TechnoVenture plays like a platform game. Your XED-2000 robot is subject to gravity, and can run on horizontal surfaces, or jump in the air. The physics model, while not entirely realistic, allows quite nice touches, such as being able to change your direction in mid-jump. While most of the action relies on well-aimed jumps, there are also items you can pick up and use, such as keys of three different colours, weapons, and shields. These come in handy when you're trying to kill the mutants or get past an obstacle. You can also collect money and purchase keys from the vending automats found in strategic places. TechnoVenture isn't set on a series of levels or stages like conventional platform games, instead it has a big map made up of 100 fully interconnected \"rooms\", each taking up one screen. You can traverse these rooms in any way you please, providing the landscape lets you pass. There are also one-directional gateways and message boxes to help you on your way. If all TechnoVenture had was one single map with one single quest, it would be quickly forgettable. Thankfully, this isn't the case. In TechnoVenture, the map is actually separate from the game engine, and other maps can be loaded from the disk, or even designed yourself.", "platform": "Commodore Amiga", "release_date": "2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Ben Marty", "publishers": "Ben Marty", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5ZBVtekSj5k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161707-techno-venture\n"}