{"altername_name": ["Tetris (Infogrames)"], "name": "Tetris: The Soviet Challenge", "overview": "Hey! Tetris! One of the best games in the world - the only problem being that the original Mirrorsoft version was completely and utterly useless, saved only by the unspoilable basic Tetris gameplay. Now it’s been done again by Infogrames - a perfect chance to put al the wrongs right and use the power of the machine to produce what could be, quite literally, one of the best games there’s ever been. It’s one of the simplest games invented - surely just the laws of probability forbid it being buggered-up twice? Don’t they? You know what’s coming, don’t you? It defies belief, it really does, but this Tetris is another disaster. What is it about Tetris that turns Amiga programmers into inept halfwits? Like I said, it’s hard to mess up the basic Tetris gameplay, but the ridiculous keyboard layout on this version comes very dose to it. There’s no joystick control option, so it’s impossibly awkward to ever really get to grips with, and the graphics and sound aren’t anything to write home about (to put it mildly). You can change the speed and put obstacles on the screen to make things tougher, which would be good if the game was playable in the first place, but that’s just about all it’s got going tor it. That and the pretty backdrops which you can change during the game, I guess. If you’ve got amazing powers of lateral concentration, you will be able to play Tetris with this program, but it’s still only a tenth as good as some of the PD versions that cost a tenth of the price, and that alone makes it worthless. Don’t even think about it.", "platform": "Commodore Amiga", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Abersoft", "publishers": "Infogrames Europe SA", "genres": "Puzzle", "max_players": "6", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Tetris", "video_link": "https://www.youtube.com/watch?v=HotpXTchADo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/65787-tetris-the-soviet-challenge\n"}