{"altername_name": [], "name": "The Jetsons: George Jetson and the Legend of Robotopia", "overview": "For anyone who cannot remember. The Jetsons were a futuristic version of the Flintstone family, created by Hanna Barbera Productions. They live in a city above the ground supported by giant poles, and have all the latest hi-tech gadgets, plus plenty that have not even been invented yet. The family live with their dog Astro, Rosie the robot maid and Orbity, a lovable rogue alien pet. And after all this time they are making their debut as a computer game. George Jetson oversleeps. His autowaker has failed him. Already he is late for work, and he has not even got up yet! Rushing around his skypad apartment, he gathers the necessary belongings, and heads to the Spacely building in his flying car. The boss, Mr. Spacely is not amused, and if George can just manage to grovel enough and talk himself out of trouble, he just might keep his job. The price he will have to pay is a trip to Robotopia, a planet inhabited by sentient robots, where Spacely owns a leisure resort. It seems that the entire tourist operation, and Spacely’s investment with it, is threatened by massive pollution, caused by the building of a huge wall round the equator. It seems there is an ethnic problem amongst the robots – the aborigibots are constructing the wall, whilst the immigrant robots just as rapidly dismantle it at the other end. All this activity is giving rise to ash and dust which is spoiling the otherwise idyllic environment of the leisure centre. George’s task is to clear things up before the arrival of an important group of businessmen who are to decide the fate of the tourist attractions in the light of its failing property. All in all, a pushover for the hardened adventurer, but ideal for the beginner who fancies an easy ride for a change. Hopefully here is an offering that will recruit more enthusiasts to adventure playing.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "", "esrb": "", "developers": "The Dreamers Guild", "publishers": "MicroIllusions", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/72056-the-jetsons-george-jetson-and-the-legend-of-robotopia\n"}