{"altername_name": ["World of Magic 2", "The World of Magic II: Ghelae and the Death-Sword"], "name": "The World of Magic II", "overview": "This sequel to The World of Magic was released as licenseware in 1999. The World of Magic II: Ghelae and the Death-Sword is a fantasy point & click adventure game, set many years after the events of the first game. Grendon, the young hero of the original World of Magic, is now too old to go on his own adventures. Instead you take on the role of Ghelae, Grendon's son. Ghelae has grown up in comfort in his father's fortified home, kept safely away from the dangers and violence of life in Kawamoon -- but the time is fast approaching when the he will have no choice but to go out into the world and prove himself a hero. The interface splits the screen into two parts: the top half shows the current scene from a third-person perspective, and underneath is a panel that displays the inventory items you are carrying, as well as ten action buttons (\"Look at\", \"Talk to\", \"Give\", \"Pick up\", \"Use ... with ...\", \"Open\", \"Close\", \"Push\", \"Pull\", and \"Operate\"). Left-clicking the mouse selects an action button or an inventory item on the bottom panel, or if you left-click in the scene it causes the main character to walk towards the clicked location. Right-clicking is used to perform an action on a scene object or character. There are 10 savegame slots that can be saved to by holding down the shift key and pressing one of the function keys F1-F10, and then later loaded from by pressing the same function key without holding down shift.", "platform": "Commodore Amiga", "release_date": "1999", "game_type": "Released", "esrb": "Not Rated", "developers": "The Bosco Brothers", "publishers": "", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=99kRoZiV_1k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165327-the-world-of-magic-ii\n"}