{"altername_name": [], "name": "The Eire Raising Adventures of Seamus O'Mally", "overview": "Seamus was a rather simple feller, who enjoyed a Guiness, but then who doesn't? And a larf and a joke with his mates, followed by a Guiness. He was also renowned for being rather difficult to wind up or anger. Hopefully, by now, you've got a picture of a bloke that's as bright as a 5 watt light bulb and has the skin of a Rhino! That’s our Seamus! But today was different as based on the evidence so far, and today Seamus would get angry, very angry, and you wont like him when he's angry. It all started rather routinely… A gentle hike down to his local, ‘The Four Leafed Clover’, and on his way he'd pick up a rag, ‘The Irish Sun’ from the newsvender. Anyway after reading that interesting article on the side of page 3, as you do, he noticed an interesting article concerning a survey carried out by an English rag, ‘The Sport’. The survey claimed that the English (of all people) actually thought the Irish were the preverbial sandwich short of picnic! Now Seamus was quite prepared to admit he was no Einstein, but it wasn't an Irishman that invented the ZX81, and followed it up with a ZX Spectrum, and finally topped it off with a C5, was it? And it wasn't the Irish who told Jack Charlton to bog off, and chose Graham Taylor instead, was it? Nope. There was no doubt, this was hypocrisy at it's highest level, and Seamus meant to prove it! But how? The only way Seamus could see, was to find an Englishman thicker than himself! But where do he find such a man? Well, I suppose England's as good a place as any, Seamus thought…", "platform": "Commodore Amiga", "release_date": "1992", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "VideoBionics", "publishers": "F1 Licenceware", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/90343-the-eire-raising-adventures-of-seamus-omally\n"}