{"altername_name": [], "name": "The Gimp", "overview": "A small group of scientists searching for fossils found something not seen before on an excavation site. Rather than being fossilized, the small discovery was clearly preserved in a state similar to being frozen. Dr. Maswood, the head of the team, took it back to his lab searching for a way to penetrate the strange rock. Upon cracking the outer layer, he soon learned that the creature, although not alive was not of the life that is currently known during the time of the dinosaurs. Using carbon-dating he traced the blob back to the ice age, and discovered that similar life forms may have existing even until Egyptian rule, with rumored appearances in the iron age and even more recent times. The creature was soft, ball shaped and only responded to certain devices found with it. Other alien artifacts indicated the creature had been given a name that could only be described as unusual. Roughly translated, it was called The Gimp. The creature, along with the artifacts, it was discovered, could be used for time travel. An expedition was put together to go back and retrieve species that has long since ceased to exist. During that time a second Gimp was found based on information gleaned from the original dig site. Dr. Maswood, upon hearing of your choice to lead the expedition, took the 2nd Gimp and forged ahead, leaving traps for you and The Gimp species behind him. You must work to save both the endangered species and The Gimp. You have been given a device that will display the time and even let you freeze it for a very short time. It allows you to direct the Gimp's movement through the trap checkpoints, check inventory (and score and level for you gamers). You can even hit a button to escape the current area at any time.", "platform": "Commodore Amiga", "release_date": "1994", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "RCM Productions", "publishers": "Public Domain/Freeware", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=7qSDV_dwZbw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162453-the-gimp\n"}