{"altername_name": ["Tom & Jerry: Hunting High and Low"], "name": "Tom & Jerry", "overview": "There can be few people who have not heard of Tom and Jerry, the funniest double-act responsible for bringing more gratuitous violence to our screen then Rambo, The Professionals and Eastenders combined. With the exception of the later cartoons, which at generous assessment were rubbish, most of their adventures have stood the test of time and still manage to be funny at the fifteenth time of viewing. So if it works for a cartoon, the same zany formula should work for a computer game. Right? Well it is a good theory. The game's opening credits are promising, with accurate renditions of both characters, and the Amiga's sound capabilities reproduce Tom's manic laughter perfectly. The action, such as it is, takes place in various places about the house that are linked by Jerry's mouseholes. The aim is to guide Jerry through rooms, over shelves and furniture, devouring as much cheese as possible within the time limit of 500 seconds. Tom is in hot pursuit and for every time he catches Jerry you lose 30 seconds. Jerry risks losing a lot more. You can fight back by dropping books, bananas, bowling balls and other sundry items of cartoon mayhem on Tom and, when all else fails, you can escape down the nearest mousehole. After about 30 seconds or so it all becomes very boring indeed, which is a shame because the concept is good and the graphics are not bad. There must be scope for a good Tom and Jerry game somewhere. This one isn't it.", "platform": "Commodore Amiga", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Micro-Partner", "publishers": "Magic Bytes", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "2.67", "wikipedia": "https://en.wikipedia.org/wiki/Tom_%26_Jerry_(1989_video_game)", "video_link": "https://www.youtube.com/watch?v=9uN9mvV5YI8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73667-tom-jerry\n"}