{"altername_name": [], "name": "Turbo Tomato!", "overview": "TURBO TOMATO is a high-explosive arena battle game full of frantic fruity fun for the Classic Amiga platform. Fruit has never been so much fun! THE GARDEN, a pastoral haven. The sun shines, the birds sing, the grass grows and the fruits, vegetables and other creatures live peaceful and happy lives. In this idyllic place live brother and sister Turbo and Nitra Tomato, enjoying the simple life with their friends. But all is not as it seems... Five a day? Come get some! Take control of Turbo and Nitra Tomato in fast, one or two player co-op arcade action across four non-linear worlds. Use speed and sprouting explosive pods to do battle with increasingly dangerous mutant fruit and vegetable enemies - and other things. Gather power-ups and bonus items to increase your abilities and survive to continue the fight. Clear each level of mutants to progress and choose your route forward. Can you uncover the terrible secret? Can you save The Garden? History Brothers John and Adam Girvin first created the Turbo Tomato game in 1993, based on comic book characters Adam created while at school. It started as a homage to Psycho Pigs UXB (aka Butasan) but quickly grew in scope to the multi-world structure found today. Work continued until 1997, with a very rough and unfinished demo version being publicly released in December of that year. Over the next 23 years, the idea of finishing a Turbo Tomato game never died and, though a few starts were made by both John and Adam, nothing was ever released. In early 2020, John had just released Salitaire, a no-ads no-nonsense Solitaire game for modern desktop and mobile gamers, and was looking for his next project. Based on positive feedback received for the game at January 2020’s Amiga Ireland event in Athlone, Ireland, and on interest from publishers, John decided to resurrect Turbo Tomato one more time. And this time it would be different.", "platform": "Commodore Amiga", "release_date": "July 31, 2021", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "NIVRIG GAMES", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160973-turbo-tomato\n"}