{"altername_name": [], "name": "Ullisprick", "overview": "Take part in this homerew Italian picture/text adventure game. During a pleasure trip to Egypt you accidentally ended up in a brothel near Cairo, yes no, I was wrong therefore, you ended up inside an ancient tombs where you discovered a tablet of caustic bauxite of Falsely extraterrestrial origin, Intrigued and driven, you decide to go to the bottom and translate the histories and inscriptions. Vynuto, at the head of the enigma, finds himself alone, lost, traced in the heart of Tibet. In fact the mysterious inscriptions, in addition to representing a puzzle and a contest of graphic imagination, also reported a couple of coordinates which probably indicated... I don't know why Int Fero is here to find out. Are you convinced, however, that it is a secret landing base for extra-terrestrials coming from the remote planet Ullisprick in the Capraecaveli nebula in Herenda which is near... They came to earth 3000 years ago with the sole sinister purpose of sensing zitzania at the most different latitudes to see where zitzania took root the only problem is that if the last wee plant on the surface of the earth had died, the aliens would have destroyed our poor little planet in revenge. Since there are still millions of specimens of weeds all over the globe, you still consider it appropriate to PREVENT rather than FIGHT the Ullispricks. The case begins near the Tibetan town of Erte which is located exactly at the intersection of the coordinates indicated on the tablet, Will you be able to discover the truth and eliminate the threat to space? I think so, also because Leal always gives advice on how to continue. and if you want to continue, beautiful friend, take a taste...", "platform": "Commodore Amiga", "release_date": "1991", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Gargoyle Software", "publishers": "Public Domain/Freeware", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372345-ullisprick\n"}