{"altername_name": [], "name": "War Wizard", "overview": "WarWizard is a fantasy role-playing game similar in concept and style to many other computer games that have been around for over ten years. Yet while it is not intended to be revolutionary in concept and approach, it is evolutionary and contains many details and features not found in other games of the same genre. The authors have attempted to create the most realistic and involved role-playing game given their resources, but have also tried to exclude tedious and annoying features found elsewhere. This objective is obviously subjective, however the authors, who have played and enjoyed most role-playing games on the market, feel they have met the majority of their goals in creating WarWizard. Along with intricate features and realism, WarWizard also possesses some of the finest artwork found in role-playing games. In addition, the interface was carefully planned to make some of more tedious tasks execute more quickly. The authors feel they offer the most intuitive mouse-based interface available in a role-playing game to date. Because of these and other reasons, the experienced game player may wish to skip the detailed directions that follow and jump right into the game. We suggest reading the 'installation' and 'starting a new game' sections to ensure you begin properly, but beyond that you many refer to the manual merely as a reference tool. The beginner, on the other hand, is encouraged to read through the entire document so that he may enjoy WarWizard to the fullest extent. Essentially, the objective of WarWizard is to search the world in order to find clues as to the locations of the Artifacts your predecessor used to defeat the first High King of Terwan. Upon retrieving all nine artifacts, you are to locate the current High King in Aladain and defeat him in battle. During the quest you may acquire treasure, magical items, and up to three other companions with whom to aid you. Note that these companions may and should vary and that you most likely will not keep the same ones throughout the game. The characters and their classes will vary as the game proceeds, and it is up to the player to determine how he will utilize their various and unique talents on different parts of his quest.", "platform": "Commodore Amiga", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Micro Genesis", "publishers": "Micro Genesis", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=csmZYJ2kuL8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161782-war-wizard\n"}