{"altername_name": [], "name": "Wingnuts", "overview": "Features my favourite cartoons Dick Dastardly and Muttley, among others! 4-player mode requires a null-modem cable with 2 players on each computer. A flying machine shooter game where you can watch your combat from First Person or from outside view. Game designed by Colin Philpott and coded by Paul Glover. Just imagine the characters from Wacky Races all dogfighting with each other in odd flying machines and you've got a pretty good idea of what Wingnuts is all about. The characters aren't actually from Wacky Races as that would mean they'd have to have been licensed to be used in the game, but with characters called Dicky Dastardly and Smutley, I think you get the picture. The flying machines they get to control are pretty much right out of Wacky Races though, all flappy wings and odd attachments. Wingnuts is an arena-based dogfighting game. Pick the number of players you want (up to four can play if you link two Amigas with a null-modem cable, with two people sharing an Amiga each), select one of the half-dozen characters, give them a flying machine and then pop along to the armoury. Now this is an impressive part of the game. There are over 40 weapons to choose from here, although not all are available to all machines all of the time, and some of them are very impressive. The paint missile is a good example. Get an enemy in your sights, wait a couple of seconds for the cursor to change to a death's head to indicate that you've got a lock-on and then fire and forget the missile. If you get a hit then you can laugh at the other player who now has their screen plastered in red paint. Unfortunately, it's not like some of the other missiles in that it doesn't do permanent damage. The best you can hope for is that the player will become so disorientated that they'll crash into the landscape and die.", "platform": "Commodore Amiga", "release_date": "1998", "game_type": "Released", "esrb": "Not Rated", "developers": "The Skunkworks", "publishers": "The Skunkworks", "genres": "Shooter", "max_players": "4", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KqnG9gzP1Ok", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/131604-wingnuts\n"}