{
  "name": "Bust-A-Move",
  "shortName": "bust-a-move",
  "description": "The home version of <a href=\"https://www.mobygames.com/game/arcade/bust-a-move__\">Bust-A-Move</a> is not a straight adaptation of the arcade game. It greatly increases the number of levels, has new gameplay features and introduces new modes.<br><br>The general concept remains the same: the player controls a catapult at the bottom of the screen that shoots bubbles of random colors. When three or more bubbles of the same color touch on the play field, they are removed, with any bubbles falling away that are not attached to ceiling, side wall or another bubble. The ceiling periodically descends, pushing the bubbles downward. The game is lost if any bubbles touch the bottom.<br><br>In single player mode, the goal is to clear pre-set bubble patterns. The game consists of 100 levels, more than tripling the number from the arcade game. Some arcade levels are reused, but most are entirely new. Also new are gameplay elements in the form of special bubbles: explosive bubbles destroy bubbles in a small radius around them if hit. Lightning bubbles move sideways if hit, clearing a horizontal line. Water bubbles burst, with the downward stream recoloring all bubbles it touches. Another new element is a boss fight in the final level.<br><br>The two-player mode from the arcade version also reappears, but optionally adds a series of ten computer opponents with different playing strategies. In two-player mode, the goal is to make the other player fail. Instead of the ceiling descending, new bubbles are added from the top. Removing more than the required three bubbles at a time sends bubbles to the opponent's field.<br><br>The final mode is Challenge mode: it is an endless unwinnable mode where new bubbles are continuously added from the top. It is played for high score: both the score and the number of bubbles popped are counted.",
  "publishedBy": "Matsushita Electric Corporation of America",
  "developedBy": "Taito Corporation",
  "released": "1995",
  "alsoFor": "Game Gear, SNES, Windows, WonderSwan | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/3do/bust-a-move",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "3DO",
      "releases": [
        {
          "publisher": "Matsushita Electric Corporation of America",
          "developer": "Taito Corporation",
          "ported": "Micro Cabin Corp.",
          "country": " United States",
          "releaseDate": "1995",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}