{
  "name": "Emit: Vol. 2 - Inochigake no Tabi",
  "shortName": "emit-vol-2-inochigake-no-tabi",
  "description": "<i>Emit</i> is a visual novel divided into 3 parts which was made to help Japanese people study English. The game can be played both in English or Japanese with the ability to listen to the audio and/or read the transcript in both languages. There are 2 modes to play the game: Story mode and English Game mode. The story mode is the main game divided into chapters where players get to watch the story unfold and can do a number of exercises after each chapter. During the story mode, players can pause the game at any time in order to look up a term they didn't understand or to change the language.<br><br>The exercises are:<ul>\n<li>Listening comprehension activities where players pick the right options to check their understanding of the story.</li>\n<li>Guessing what's going to happen where players choose the question that's closest to their opinion and listen to the characters in the story commenting about the player's opinion.</li>\n<li>Conversation practice where students can listen to the characters speech and act out the dialogues.</li></ul>\nThe English game mode is a mini-game which involves 2 police officers in the game's world looking for a criminal. Players must tell the officers where they should go, write down which buildings are nearby and take note of the phone calls from the local citizens informing them where the criminal was last seen.<br><br>The second game deals with Yuri's trip to another world where she becomes one year older every day and must find a way back to her own world.",
  "publishedBy": "KOEI Co., Ltd.",
  "developedBy": "KOEI Co., Ltd.",
  "released": "Jul 14, 1995",
  "alsoFor": "FM Towns, Macintosh, PC-98, SEGA Saturn, SNES, Windows, Windows 3.x | Combined View",
  "genre": "Adventure, Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/3do/emit-vol-2-inochigake-no-tabi",
  "visual": "Cinematic camera, Fixed / flip-screen",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "3DO",
      "releases": [
        {
          "publisher": "KOEI Co., Ltd.",
          "developer": "KOEI Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 14, 1995",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}