{
  "name": "Masters: Harukanaru Augusta 3",
  "shortName": "masters-harukanaru-augusta-3",
  "description": "<i>Masters: Haruka Naru Augusta 3</i> is a sequel to <a href=\"https://www.mobygames.com/search/quick?game=Masters%3a+Haruka+Naru+Augusta+2\">Masters: Haruka Naru Augusta 2</a> golf game and in that relation very similar to its predecessor. This game also features Augusta National golf course and is licensed by <a href=\"https://www.mobygames.com/search/quick?company=Augusta+National+Golf+Club\">Augusta National Golf Club</a>. The game plays from third person perspective, showing your golfer sideways with mini-map of the current hole on the right side of the screen. Several modes are accessible from the main menu, including Masters, Tournament, Stroke Play, Match, and Training.<br><br>Much like its predecessors, the game uses live-action golfers and caddies over 3D golf course terrain. During the rotation of the terrain the game removes the texture details to moves more smoothly. Camera rotation lets you gain altitude on your current position, check the area around the hole immediately, or use your cart car to drive across the terrain and examine it in more detail before starting.<br><br>When playing a game you can select among four different golfers and four different caddies. Each golfer has its own advantages and disadvantages when playing such as the swinging gauge may be harder or easier to accurately select depending on the type of terrain of the golf club your golfer uses. Terrain level can be checked in more detail even while you're not on the green near the hole, and though it gives little help to use at those places it's still available. The course supports both members and masters tee plays and also includes a detailed guide for every hole. Various records for every hole are saved and can be checked along with other statistics.",
  "publishedBy": "T&amp;E Soft, Inc.",
  "developedBy": "T&amp;E Soft, Inc.",
  "released": "Jul 09, 1994",
  "alsoFor": "SEGA Saturn | Combined View",
  "genre": "Sports",
  "perspective": "1st-person, Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "Golf",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/3do/masters-harukanaru-augusta-3",
  "visual": "Free-roaming camera",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "3DO",
      "releases": [
        {
          "publisher": "T&amp;E Soft, Inc.",
          "developer": "T&amp;E Soft, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 09, 1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}