{
  "name": "SimTower: The Vertical Empire",
  "shortName": "simtower-the-vertical-empire",
  "description": "Maxis takes their Sim-building line vertical with SimTower, an original concept from Japan (where vertical living is much more commonplace than in many parts of the world). <br><br>Your goal is to build a skyscraper that is both tall, aethestically pleasing, popular, and, most importantly, economically profitable. To be successful, your building cannot just be levels upon levels of officespace, or just an apartment sky-rise, but a multi-functional haven for humanity featuring everything from penthouses to theatres, restaurants to shopping malls. The centerpiece of your tower design is your elevators and proper managment is the key.<br><br>You can watch your Sims enter and leave your grand tower, getting impatient waiting for elevators, or having a hectic work day at the office. You can even train in on one or two, to server as a metering stick for their compatriots, or just to peek into the average workday of the little people living in your building. Or watch the security and resuce crews race as distasters like bomb threats and fires rampage through your well-crafted skyscraper.<br><br>The PlayStation version adds an additional bonus map.",
  "publishedBy": "OPeNBooK Co., Ltd.",
  "developedBy": "OPeNBooK Co., Ltd.",
  "released": "Mar 29, 1996",
  "alsoFor": "Macintosh, PlayStation, SEGA Saturn, Windows 3.x | Combined View",
  "genre": "Simulation",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/3do/simtower-the-vertical-empire",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "3DO",
      "releases": [
        {
          "publisher": "OPeNBooK Co., Ltd.",
          "developer": "OPeNBooK Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 29, 1996",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}