{
  "name": "Star Control II",
  "shortName": "star-control-ii",
  "description": "Following an on-going war with the alien Ur-Quan race, the Alliance has lost. The Ur-Quan armada systematically hunts down the alliance races and imprisons them onto their homeworlds. However, unknown to the Ur-Quan, a small research vessel had been lost during the war while sent to a distant star system looking for evidence of the ancient Precursor race. The survivors of this research team had come across the controls to a Starship factory and used it to build a Precursor supply vessel, one of the largest vessels in the galaxy.<br><br>Upon return, the captain of the ship discovers, to his dismay, that Earth has become one of Ur-Quan's slave planets. The surface of Earth is glowing red, devoid of life, and a few humans are locked in a starbase orbiting the planet. The captain contacts the starbase commander and finds out that the only way to defeat the Ur-Quan is to convince other races populating the galaxy to join them in their struggle.<br><br><i>Star Control II</i> is a hybrid game based on exploration, space combat, and ship customization. Unlike its <a href=\"https://www.mobygames.com/search/quick?game=star+control\">predecessor</a>, it has a heavily plot-driven, quest-based structure reminiscent of role-playing or adventure games. The game's main focus is on exploring a vast galaxy consisting of numerous star systems and interacting with various alien species populating it. Each species has their own personal traits and would usually require the player to exploit conversation trees or perform different tasks to convince them to join. The main objective is to gather as many allies as possible, though only a few alliances are required to complete the game. <br><br>While in deep space, the starship can approach any star it comes across, and then the player can guide the ship around its system and land on its planets and their moons. Space is treated as two-dimensional and presented in a top-down view. There is also a starmap available which shows the entire galaxy and allows the player to set the ship on auto-pilot to any star. <br><br>Throughout space are different alien civilizations. These are represented on the starmap by a sphere of influence. Within the sphere, the aliens have a controlling presence and their ships will venture freely. Outside the sphere, encounters are rarer. Aliens can be dealt with diplomatically, through a series of dialog options, or engaged in combat.<br><br>Alongside the main plot objective, the player also configures and upgrades his fleet in a role-playing fashion. The main starship is the Precursor vessel and it can be used to travel between star systems, which uses up fuel. Raw materials are used as currency to make purchases in the starbase. It is possible to buy fuel, as well as improve the player-controlled fleet in various ways. These include purchasing smaller ships to accompany the main one on its travels and participate in combat; hiring crew members, which effectively act as the hit points of the ships; and upgrading the main ship with enhancements that improve its speed, maneuverability, and combat efficiency. Successfully completing a quest for an alien race may also result in their combat ships joining the fleet.<br><br>Raw materials are found on surfaces of planets and moons throughout the galaxy. The player has to send a landing module to the planet and then guide it around the surface as it picks up materials found earlier with a scanner. Each planet is unique in the type of minerals and metals it is formed of. Some planets are plagued by natural dangers such as lightning storms, earthquakes or lava, which can damage or destroy landing modules. Non-sentient lifeforms can also be found and stunned to obtain biological samples. Special installations, objects and ruins can also be found on certain planets and explored. <br><br>Combat is action-based and utilizes the same engine as the first game, where action is controlled from a top view and influenced by the gravity of nearby planets. Each alien vessel has unique abilities, and the player can select any ship from his fleet to participate in battles, attempting to find the best combination against specific enemies. Combat can also be played as a standalone game (melee mode), separate from the main storyline. It can also be set on a cyborg mode within the main game, allowing the computer AI to take over the battles and calculate their results depending on the attributes of the ships.",
  "publishedBy": "Crystal Dynamics, Inc.",
  "developedBy": "Toys for Bob Inc.",
  "released": "1994",
  "alsoFor": "Android, DOS, GP2X, Linux, Macintosh, Windows | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/3do/star-control-ii",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "Arcade, Mini-games",
  "setting": "",
  "release": [
    {
      "system": "3DO",
      "releases": [
        {
          "publisher": "Crystal Dynamics, Inc.",
          "developer": "Toys for Bob Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/499938-star-control-ii-3do-screenshot-title-screen.jpg",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/499939-star-control-ii-3do-screenshot-intro-movie-humanity-faces.jpg",
      "caption": "Intro movie. Humanity faces the Ur-Quan."
    },
    {
      "link": "/images/shots/l/499940-star-control-ii-3do-screenshot-main-menu.jpg",
      "caption": "Main menu."
    },
    {
      "link": "/images/shots/l/499941-star-control-ii-3do-screenshot-super-melee-menu-arcade-battle.jpg",
      "caption": "Super-Melee menu. Arcade battle mode."
    },
    {
      "link": "/images/shots/l/499944-star-control-ii-3do-screenshot-jousting-with-the-enemy.jpg",
      "caption": "Jousting with the enemy."
    },
    {
      "link": "/images/shots/l/499943-star-control-ii-3do-screenshot-ka-blooey.jpg",
      "caption": "Ka-blooey!"
    },
    {
      "link": "/images/shots/l/499942-star-control-ii-3do-screenshot-the-camera-auto-zooms-based.jpg",
      "caption": "The camera auto zooms based on the fighter's distance from each other."
    },
    {
      "link": "/images/shots/l/499945-star-control-ii-3do-screenshot-main-game-navigating-the-stars.jpg",
      "caption": "Main game. Navigating the stars."
    },
    {
      "link": "/images/shots/l/499946-star-control-ii-3do-screenshot-scanning-a-planet-for-resources.jpg",
      "caption": "Scanning a planet for resources."
    },
    {
      "link": "/images/shots/l/499947-star-control-ii-3do-screenshot-drive-your-lander-to-the-scanned.jpg",
      "caption": "Drive your lander to the scanned ores to collect them."
    },
    {
      "link": "/images/shots/l/499948-star-control-ii-3do-screenshot-hyperspacing-to-a-new-system.jpg",
      "caption": "Hyperspacing to a new system."
    },
    {
      "link": "/images/shots/l/499950-star-control-ii-3do-screenshot-all-dialogue-messages-are-voiced.jpg",
      "caption": "All dialogue/messages are voiced."
    },
    {
      "link": "/images/shots/l/499949-star-control-ii-3do-screenshot-pick-your-answer-and-prepare.jpg",
      "caption": "Pick your answer and prepare for the consequences."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/82781-star-control-ii-3do-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "3DO"
    },
    {
      "link": "/images/covers/l/82782-star-control-ii-3do-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "3DO"
    },
    {
      "link": "/images/covers/l/82783-star-control-ii-3do-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "3DO"
    }
  ]
}