{"name": "Food Fight", "overview": "In Food Fight, the player controls a young boy named Charley Chuck. The object of the game is to eat an ice cream cone located on the opposite side of an open playfield. The ice cream is slowly melting, and must be consumed before it melts completely. Standing between Charley and the ice cream are four chefs named Angelo, Jacques, Oscar, and Zorba.<br><br>The chefs appear from holes in the floor of the level and will chase after Charley. The chefs are identified by the shape of their toques: Angelo's is short and rectangular; Jacques' is curved; Oscar's is big and round; and Zorba's is tall and slender.<br><br>Scattered throughout the level are piles of food, such as pies, peas, tomatoes, and bananas. Both the player and the chefs can grab food from the piles to throw at each other. The supplies of most foods are limited, but watermelon, which appears either on special levels exclusively or with other foods in later levels, is unlimited in supply. If the chefs are hit by food thrown either by the player or by other chefs, they are taken down for a few seconds. If the player is hit, a life is lost. The player also loses a life if a chef touches Charley, if Charley falls through an open hole, or if the ice cream melts before it is eaten.<br><br>Points are scored for each chef hit by food thrown by the player (up to 1,000 points each), luring a chef over an open hole and for each remaining pile of food on the level. The ice cream is worth 500 points multiplied by the level number, up to a maximum of 25,000 points from level 50 onwards to the last regular level, level 125. If the player has at least one close call with flying food and a chef, the game will present the player with an instant replay of that level.", "platform": "Atari XEGS", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari Corporation", "publishers": "Atari Corporation", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=AuumFyfIU4c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/34725"}