{"name": "ThunderFox", "overview": "A heavily defended transporter carries Disilicate Energy Crystals for the approaching Phalon Mothership. Once installed, these will power the deadly Phalon War machine said to be capable of destroying entire solar systems in minutes. The Federation's only hipe is the latest in the slick, maneuverable space fighters: THUNDERFOX!<br>Your mission, should you choose to accept it, is to locate and destroy these crystals, thus preventing the War Machine from being built.<br>You must take care to avoid deadly lasers and lengthy exposure to dangerous radiation as you navigate your way to the Disilicate Energy Crystal Room. Once there, you will face the fearsome Crystal Guardian which must be destroyed along with the crystals it guards, by firing at its vulnerable, pulsating head.<br>There's no time to waste! If the Guardian is not destroyed before the Phalon Mothership reaches the transporter, a death missle will be fired, annihilating THUNDERFOX and your Mothership. The solar system will be left defenseless and doomed to imminent destruction!<br><br>Gameplay:<br>The gameplay for Thunder Fox is similar to other popular side scrolling action games like Namco's Rolling Thunder (video game), and Sega's Shinobi (arcade game). There are three buttons for each player - Attack, which normally is used to make Thunder and Fox (the game's heroes) stab with their knives. Jump, and a Weapon button which fires or throws a weapon acquired by the heroes.<br><br>What makes this game unique is that the game gives players the opportunity to allow players to use their obtained weapons (save for the hand grenades) as melee weapons which helps conserve ammunition for when it's needed.", "platform": "Atari XEGS", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Aztec Design", "publishers": "Atari Corporation", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=P_g_tPfMclo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/34726"}