{"altername_name": ["Talking Android Attack"], "name": "Android Attack", "overview": "Android Attack is a 32K update of the Berzerk variant Robot Battle for 16K Tandy Colour systems. The extra memory is used to add in another feature of the original arcade game, speech, which is featured in its Microdeal title, Talking Android Attack. Like in Berzerk, you are a lone humanoid in a large complex with lots of maze-like rooms. Your objective is to survive, and earn points by exterminating all the hostile robots that inhabit the complex. Shooting a robot (before it shoots you) turns it into a heap of deadly scrap, which will reanimate after a short while, though not into the android it once was, but into a ghost. The ghosts can pass through walls and try to fulfill the mission of their former life. This is a slight deviation from the original Berzerk, where the ghost was a separate character named \"Evil Otto\". Another difference is that in this version, you can jump and duck to avoid robot bullets. Another peril in the game is the walls, which are electrified. By sacrificing an energy unit, of which you need at least three, you can open up a hole in the wall to pass through. On each screen there is also a crown, which can be picked up for 100 points. Killing an android gives 50 points, and killing its ghost gives you another 100. By eliminating all enemies and picking up the crown and exiting the room, you are granted a bonus sum calculated from the remaining time (when it reaches zero, you are killed). For every 10000 points, you earn another energy unit. If you leave the room without having killed the enemies, the computer will say in wobbly 6-bit speech, \"Coward!\".", "platform": "Dragon 32/64", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Spectral Associates", "publishers": "Microdeal", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125416-android-attack\n"}