{"altername_name": [], "name": "Aquanaut 471", "overview": "Major Istar: Under the Doomed Sea is a text adventure set in the future where in the beginning of the 21st century the human-driven destruction of Earth's surface has driven mankind to build underwater cities. The player assumes the role of Major Camerion J. Istar (Aquanaut 471 in the UK version) a member of the Oceanic Federation tasked with keeping the peace in the underwater world. The game starts aboard a submarine headed towards the scientific research station Trident Dome. While en route you receive a distress call from service droid Huey-14, but it is cut off before it can explain the problem. Your goal is to solve the mystery regarding the SOS transmission and save the research facility. In addition to the normal graphical text adventure you will also face three arcade style event sequences requiring a joystick. The game screen is divided in two parts, with the top showing the environment in colour and the name of the location, and the bottom half the text description. Single stroke keys can be used to move around (N, S, E, W, U, and D) and there are more than 100 hundred locations. The command parser is a standard verb noun type. You can also save your current location to diskette/cassette for restart later. Next to the adventure parts there are three arcade games that need to be completed. Failure for these does not end the game, but transports Aquanaut 471 back to an earlier location to travel back and give it another try. The mini-games involve docking the submarine on to a platform while avoiding objects, and two security games where a platform needs to be reached while avoiding robot guards. The security games are largely identical in design, but in the second one the robots move quicker and have a different movement pattern.", "platform": "Dragon 32/64", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Microdeal", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.92", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/125419-aquanaut-471\n"}