{
  "name": "1984: A Game of Government Management ",
  "shortName": "1984-a-game-of-government-management-",
  "description": "<i>1984: A Game of Government Management </i> is a financial management game which gives you the chance to be the Chancellor of the Exchequer for the United Kingdom in the 1980s. Starting in 1984 with the real economy figures from 1982/83, you must try to survive in office for as long as possible trying to keep the books balanced and making more money for the country without upsetting too many people.<br><br>Your first screen shows you the Government Balance Sheet with the figures balanced and over the next year you will attempt to keep it balanced. As you play over your first year you will be presented with various screens and these either show the stats for various sectors or ask you various questions about adjusting figures like the Minimum Lending Rate or the percentage in wage increases for various sectors.  Other sectors or departments you will have to juggle the figures for include investments, Industrial Levy, funding, foreign aid and Industrial Grants. You will also have a cabinet meeting that asks you a question on various incidents that are happening at the time.<br><br>Once you have completed your first year, you will be shown various graphs and given a performance rating. Then it's on to 1985 and hopefully many years after that.",
  "publishedBy": "Incentive Software Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/1984-a-game-of-government-management-",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Incentive Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}