{
  "name": "The Archers",
  "shortName": "archers_",
  "description": "Events in the rural village of Ambridge have enthralled BBC Radio 4 listeners since 1950. The computer game re-creation casts you as one of the scriptwriters. The game is split into four parts, in which you control Jack Woolley, Elizabeth Archer, Eddie Grundy and Nelson Gabriel in turn. Guide each character through their decisions (from 3 multiple-choices), with the aim of choosing the most listener-friendly choices. Your choices affect the show's rating directly, as well as changing the forthcoming plot much more than in <a href=\"https://www.mobygames.com/game/secret-diary-of-adrian-mole-aged-13\">The Secret Diary of Adrian Mole Aged 13¾</a>.<br><br>Characters can be removed from the show depending on how you develop certain storylines, but make sure not to axe the popular ones. Avoid offending special-interest groups, as the BBC comes down hard on writers who generate complaints.<br><br>Unlike the other versions of this game the BBC version is the only one that comes without graphics, hence it is pure interactive fiction and text adventure, although the input is actually rather limited to choosing answers from multiple choice type questions to progress in the story than typing in commands of one's own choice and finding out how to solve puzzles to go further. The four parts of the game are evenly spread on both sides of the cassette tape. Each of the sides contains two parts of the story.",
  "publishedBy": "Mosaic Publishing",
  "developedBy": "Level 9 Computing, Ltd.",
  "released": "1986",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/archers_",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Mosaic Publishing",
          "developer": "Level 9 Computing, Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}