{
  "name": "AstroBlaster",
  "shortName": "astroblaster",
  "description": "<i>AstroBlaster</i> is a faithful, but unofficial recreation of the Sega arcade game <a href=\"https://www.mobygames.com/game/arcade/astro-blaster\">Astro Blaster</a>, including an eighth sector that was visible in the arcade attract mode, but unreachable in game. In order to fit the game into the limited memory of the BBC Micro, the docking sequence had to be sacrificed.<br><br>The player controls a ship at the bottom of the screen, with different squadrons of aliens on the upper half. The objective is to clear the sector of aliens and dock with the mothership. The ship can activate a one use time warp that slows the aliens down for a short while while maintaining its own speed and firepower. The ship's lasers have a temperature gauge, if the lasers overheat they need to be cooled down before they can fire, also at the bottom of the screen there is a fuel meter that measures the fuel consumption of the craft.<br><br>There are eight increasingly difficult sectors in total, each sector has different squadrons of aliens. In the original game once a sector is cleared, an asteroid belt is encountered. The asteroids had to be avoided while shooting fireballs that replenish fuel. With the missing docking sequence that replenished the fuel, all asteroids are now fireballs instead and running out of fuel results in a loss of life rather than game over.",
  "publishedBy": "Retro Software",
  "developedBy": "",
  "released": "2016",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/astroblaster",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Retro Software",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2016",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}