{
  "name": "Camelot",
  "shortName": "camelot",
  "description": "In <i>Camelot</i>, the player assumes the role of a deposed king, trying to prove his worthiness for the throne. The main goal of the game is to collect 3000 points by recovering bags of gold scattered around the flip-screen castle the game is set in. Killing enemies also increases the score, though in less amounts.<br><br>\nThe game consists of shooting, platform and some puzzle elements. Fighting various creatures, like witches and demons, is preferably done by shooting fireballs at them, of which there is a finite amount at the player's disposal. In addition to enemies, various hazards, like pools of water, may additionally drain the player's energy and thus need to be avoided. It's possible to pick up and carry up to 5 different objects. Collecting a key for example can give access to a different area. The protagonist's only life is lost when either all of his energy gets drained or the time limit runs out, both however, may be replenished through the course of the game.",
  "publishedBy": "Blue Ribbon Software Ltd.",
  "developedBy": "",
  "released": "1990",
  "alsoFor": "Electron | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/camelot",
  "visual": "",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Blue Ribbon Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/528633-camelot-bbc-micro-screenshot-one-of-the-first-screens-my-eyes.png",
      "caption": "One of the first screens, my eyes on the key"
    },
    {
      "link": "/images/shots/l/528634-camelot-bbc-micro-screenshot-further-exploring-after-gaining.png",
      "caption": "Further exploring after gaining my first object"
    },
    {
      "link": "/images/shots/l/528635-camelot-bbc-micro-screenshot-found-the-first-bag-but-the-condition.png",
      "caption": "Found the first bag, but the condition of my character leaves a lot to be desired."
    }
  ],
  "cover": []
}