{
  "name": "Codename Droid: Stryker's Run - Part 2",
  "shortName": "codename-droid-strykers-run-part-2",
  "description": "In this sequel to <a href=\"https://www.mobygames.com/game/strykers-run\">Stryker's Run</a> you once again play the role of John Stryker whose mission it is to land on the Planet Volga, navigate the underground complex and find and fly their latest spacecraft codenamed Z11. The complex is split into four zones which are split into a further three sectors. Each sector is full of Volgan soldiers and each must be avoided or killed to get further into the complex.<br><br>You are armed with a gun and also you have a wrist computer terminal which gives you stats and can recharge your suit and gun when energy cells are collected. There are objects scattered around and can be picked up and used to help you on your way like mines, micro-maps and a jet-pack which needs fuel collecting to keep using it. The most important thing to collect are sets of plutonium rods where four must be collected to fly the ship. Also security passcards are needed to operate the lifts. Mines are exchanged when they are used.<br><br><i>Codename Droid: Stryker's Run - Part 2</i> is a multi-directional scrolling platform game where only a small part of the whole complex is shown. The joystick is used to control Stryker.",
  "publishedBy": "Superior Software Ltd.",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "Electron | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/codename-droid-strykers-run-part-2",
  "visual": "2D scrolling",
  "gamePlay": "Metroidvania, Platform",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Superior Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "5 013848 001288",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/253382-codename-droid-stryker-s-run-part-2-bbc-micro-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "BBC Micro"
    }
  ]
}