{
  "name": "Conquering Everest",
  "shortName": "conquering-everest",
  "description": "<i>Conquering Everest</i> is a managerial game where you have to manage a team of people and control the movements of supplies and equipment to reach Camp 6 from Camp 0, before making a push to the summit of the highest mountain in the world, Mount Everest over a number of days. Your team consists of a number of climbers, sherpas and porters, with equipment, tents, food and oxygen needed to be taken to the various camps on route. On day one you are presented with a weather report and four options which are Carry, Move, Route and Summit. <br><br>Carry allows people to move equipment to the next camp and return back to their starting camp, and Move has people moving equipment but they stay at the next camp. Route is the first option before the other options can be selected which sees the climbers climb up to the next camp, the distance is given in rope lengths and the route sometimes isn't completed in a day. Summit is chosen from Camp 6 for the final push to the top of the mountain. Once a day is over then you are shown your inventories for each camp before stating a new day and another push up the mountain.",
  "publishedBy": "ASP Software Ltd.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "Atari 8-bit, Commodore 64, Dragon 32/64, ZX Spectrum | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/conquering-everest",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "ASP Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}