{
  "name": "Creepy Computer Games",
  "shortName": "creepy-computer-games",
  "description": "<i>Creepy Computer Games</i> is a book containing the following type-in games:\n<ul>\n<li><b>Computer Nightmare</b>: the computer throws random numbers at the player and the player must hit those numbers on their keyboard in order to score.</li>\n<li><b>Number Wizard</b>: the computer rolls two dice and the player must give two numbers from 1-9 which when added together give the same total as the numbers on the dice.</li>\n<li><b>Ghost Guzzler</b>: numbers representing ghosts move across the screen and the player must collect them by changing the number on their ghost guzzler so it is the same as the ghost then pressing X. If the player fails to guzzle a ghost they lose a life and if they lose all their lives it's game over.</li>\n<li><b>Spiderwoman</b>: the spiderwoman is thinking of a letter and the player must guess the letter in order to stop the spiderwoman from turning them into a fly. If the player gives the spiderwoman a word, she will tell you if it contains the letter she is thinking of.</li>\n<li><b>Gravedigger</b>: the player has become lost in a graveyard and must escape while avoiding the skeletons that wish to harm you. The player can dig holes to keep the skeletons at bay.</li>\n<li><b>Mad House</b>: the player must match up three doorways so that they can escape, however the player only has control of two of them.</li>\n<li><b>Ghost Maze</b>: the player finds themselves in a haunted maze and must find the exit, however the player can only see what's in-front of them. If the player is caught by a ghost they are transports to a different part of the maze.</li>\n<li><b>Seance</b>: the player is being contacted by a spirit, which points at various letters on a grid. The player must correctly type in the letters that the spirit picked, or they will anger it.</li>\n</ul>\nThe book has educational value as it explains how the game program works, shows ways of modifying the code and proposes problems to be solved in each game, such as altering the game code to make it register high scores.",
  "publishedBy": "Usborne Publishing Ltd.",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "Apple II, Commodore PET/CBM, Dragon 32/64, Oric, TRS-80, VIC-20, ZX81, ZX Spectrum | Combined View",
  "genre": "Compilation, Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/creepy-computer-games",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Usborne Publishing Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}