{
  "name": "Evening Star",
  "shortName": "evening-star",
  "description": "<i>Evening Star</i> is basically an enhanced <a href=\"https://www.mobygames.com/game/southern-belle\">Southern Belle</a> - a steam engine simulator - with the route changed to early 1960s Somerset and Dorset line (from Bath to Bournemouth, England) and the locomotive being BR standard class 9F (2-10-0) &quot;Evening Star&quot; (number 92220, the last British steam engine built) hauling the &quot;Pines Express&quot;.<br><br>The game has a demonstration mode and seven scenarios of increased difficulty with the highest level allowing you full control of the train, with all the gauges to watch, more problems that arise and a random timetable to follow. You start at a standstill in the station and must get your train moving. Different levels of speed must be maintained on the track to keep with the speed limits that are placed on the track and keep an eye on the signals that you will see on the way. The correct use of the whistle must be used and you have to make sure your water, steam and coal levels are correct to make sure you keep to the timetable.<br><br>The game is viewed from a first person perspective with you in the cab of the train with all the levers and gauges in front of you. You are able to see into the distance in front of you and the sides. As well as the main playing area you can also see your speed, water and coal level, any signals, gradient (slope) indicator and the time.",
  "publishedBy": "Hewson Consultants Ltd.",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "Amstrad CPC, Commodore 64, Electron, ZX Spectrum | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/evening-star",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Hewson Consultants Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}