{
  "name": "The Evil Dead",
  "shortName": "evil-dead",
  "description": "Based on the horror movie of the same name released a year earlier, here you take on the role of the films’ lead protagonist, Ash, and like the film, the game takes place in the isolated cabin deep in the woods, where upon a diabolical evil is set free. <br><br>The games’ viewpoint is from the top-down over head perspective, where as you see  character’s head and shoulders only. The play-field consists of the cabin interior, which  is outlined in a kind of plan view, where doors are represented by a short white line which disappears and reappears upon opening and closing, and windows are represented by dotted lines which function in the same ways as the doors. Some details that are from the film, is the swing on the porch which is gently swaying in the wind, the fire place, which is ablaze, and the two old beds.<br><br>The crux of the game-play is as follows, you take control of Ash, represented by a white figure, and you must try to keep out the Evil Dead shroud, which looks like a green cloud mass, that has the ability to open the various windows to get inside, and you must try to close the windows to stop it possessing your friends, Linda, Cheryl, Shelly or Scotty. When one is taken by the evil shroud, they will become a green mutant.\n \nPeriodically, weapons will spawn and disappear about the house which Ash can utilise to fight the mutants. Weapons consist of hatchets, shovels, and swords, and can be used for a limited time. As you fight the various new additions to the evil dead, they will split into various body parts before being completely finished off, so you will have to contend with disembodied arms, and legs, ghost spirits, and such. You score points for each mutant, or evil body part dispatched.<br><br>Ash’s health is expressed as a number, initially 10,000, and as you are attacked, and subsequently defend yourself, this number will proceed to diminish, and when it reaches zero, it is game over. The ultimate goal of the game is to score enough points to conjure up the book of the dead, and it will appear on the screen, and if you manage to collect it and throw it in the fire place, this is the way of concluding the game. ",
  "publishedBy": "Palace Software, Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "Commodore 64 | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/evil-dead",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Palace Software, Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1023517-the-evil-dead-bbc-micro-screenshot-game-controls.png",
      "caption": "Game controls."
    },
    {
      "link": "/images/shots/l/1023525-the-evil-dead-bbc-micro-screenshot-the-story.png",
      "caption": "The story."
    },
    {
      "link": "/images/shots/l/1023526-the-evil-dead-bbc-micro-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/1023527-the-evil-dead-bbc-micro-screenshot-starting-a-new-game.png",
      "caption": "Starting a new game."
    },
    {
      "link": "/images/shots/l/1023528-the-evil-dead-bbc-micro-screenshot-entering-the-cabin-and.png",
      "caption": "Entering the cabin and acquiring some weapons."
    },
    {
      "link": "/images/shots/l/1023529-the-evil-dead-bbc-micro-screenshot-chased-outside-by-a-mutant.png",
      "caption": "Chased outside by a mutant!"
    },
    {
      "link": "/images/shots/l/1023530-the-evil-dead-bbc-micro-screenshot-surrounded-by-evil.png",
      "caption": "Surrounded by evil!"
    },
    {
      "link": "/images/shots/l/1023524-the-evil-dead-bbc-micro-screenshot-high-score-table.png",
      "caption": "High score table."
    }
  ],
  "cover": []
}