{
  "name": "First Steps with the Mr. Men",
  "shortName": "first-steps-with-the-mr-men",
  "description": "These educational games with the Mr. Men characters from Roger Hargreaves' children books are for kids aged four to 8 years.  It features these fun games that also develop reading skills:\n<ul>\n<li>Mr. Greedy's Ice-Cream Hunt</li> - guide Mr. Greedy to find a giant ice cream through 5 progressively graded different stages.\n<li>Mr. Silly's Hat Game</li> - help Mr. Silly try on hats where the correctly shaped and coloured hats must be chosen through three rounds of increasingly difficult play.\n<li>Mr. Forgetful's Wardrobe Game</li> - Mr. Forgetful must open different wardrobe doors to match pairs of items such as shoes, socks and mittens in this concentration variant.\n<li>Mr. Forgetful's Letter Game</li> - similar to the Wardrobe Game, this includes letters of the alphabet behind the doors to be matched.\n</ul>\nThese games are a good introduction for kids to using computers as well and were designed by experienced primary school teachers. Included with the game is an instruction book that can be read by parents with their kids as an introduction to the games and how to play them.",
  "publishedBy": "Mirrorsoft Ltd.",
  "developedBy": "PrImer Educational Software",
  "released": "1983",
  "alsoFor": "Amstrad CPC, Atari 8-bit, Commodore 64, Electron, MSX, ZX Spectrum | Combined View",
  "genre": "Educational",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/first-steps-with-the-mr-men",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Mirrorsoft Ltd.",
          "developer": "PrImer Educational Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}