{
  "name": "Great Britain Limited",
  "shortName": "great-britain-limited",
  "description": "<i>Great Britain Limited</i> sets you as both the Prime Minister and Chancellor of Great Britain, giving you responsibility for every element of the land's economy. You are initially presented with key statistics for unemployment and inflation (and some sample prices), as well as your party's budget, and from that must set taxes (from alcohol and petrol rates to general Corporation Tax and VAT) and benefits. You can then assign money to special projects, such as improving the transport system and providing more jobs for school leavers. Once these decisions have been made, the results on the economy and on your popularity rating are shown.<br><br>The game continues like this for four turns, representing four years. At this point, you must prepare for an election. You have 1000 units of PR to assign, spreading it between inflation, unemployment, overseas aid and law &amp; order, depending on what you feel your Government's problem areas are. You have three attempts at doing this to improve your publicity rating. The election results then unfold, updating every time one of the four parties gains 10 extra seats. If successful, you have a second term of this.",
  "publishedBy": "Simon Hessel Software",
  "developedBy": "Simon Hessel Software",
  "released": "1982",
  "alsoFor": "ZX81, ZX Spectrum | Combined View",
  "genre": "Educational, Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/great-britain-limited",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Simon Hessel Software",
          "developer": "Simon Hessel Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}