{
  "name": "Killer Gorilla",
  "shortName": "killer-gorilla",
  "description": "<i>Killer Gorilla</i> is a clone of Nintendo's <a href=\"https://www.mobygames.com/search/quick?game=Donkey+Kong\">Donkey Kong</a> arcade game.<br>\nIt is a four stage platform game set on a building construction site, where stages consist of girders, ladders, conveyor belts and elevators. The object of stages one, two and three is to reach the top of the screen where your girlfriend is guarded by the eponymous Killer Gorilla. On stage four the objective is to remove the rivets from the girders, causing the top of the building to collapse and the gorilla to fall. On all stages, items belonging to your girlfriend can be collected for extra points. When stage four is completed, play loops back to stage one.<br><br>On stage one, the gorilla rolls barrels down the screen. These can be avoided, jumped over, or smashed with a hammer that can be collected and carried for a short time. If a barrel reaches the flaming barrel at the bottom of the screen, it will sometimes become a fireball that rolls erratically along girders and up and down ladders.<br><br>On stage two, conveyor belts that occasionally change direction carry trays of cement that are fatal to the touch. Fireballs appear from a central furnace. Ladders to the top level extend and retract. There is again a hammer that can be used to smash the fireballs and the cement trays.<br><br>On stage three, the gorilla throws bouncing I-beams that must be avoided. Constantly moving elevators must be jumped on to progress.<br><br>On stage four, eight rivets hold the top of the building together. Running or jumping over each rivet makes it disappear. When all eight rivets have been removed, the stage is complete, and the game loops back to stage one, speeding up and adding barrels and cement trays.",
  "publishedBy": "Micro Power Ltd",
  "developedBy": "",
  "released": "1983",
  "alsoFor": "Electron | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/killer-gorilla",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Micro Power Ltd",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/474819-killer-gorilla-bbc-micro-screenshot-the-title-screen.png",
      "caption": "The title screen."
    },
    {
      "link": "/images/shots/l/474816-killer-gorilla-bbc-micro-screenshot-barreling-through-stage.png",
      "caption": "Barreling through stage 1."
    },
    {
      "link": "/images/shots/l/474817-killer-gorilla-bbc-micro-screenshot-cementing-a-high-score.png",
      "caption": "Cementing a high score on stage 2."
    },
    {
      "link": "/images/shots/l/474818-killer-gorilla-bbc-micro-screenshot-elevating-your-character.png",
      "caption": "Elevating your character on stage 3."
    },
    {
      "link": "/images/shots/l/474815-killer-gorilla-bbc-micro-screenshot-riveting-gameplay-on-stage.png",
      "caption": "Riveting gameplay on stage 4."
    }
  ],
  "cover": []
}