{
  "name": "Mikie",
  "shortName": "mikie",
  "description": "<i>Mikie</i> puts you in charge of Mikie, a high school student who likes to win hearts of every girl that he can lay his eyes on. <br><br>There are several classrooms to explore like the Quantum Physics Room, Locker Room, Canteen, the Aerobics Dancing Class, and the Playground. In each classroom, Mikie has to collect all the hearts that are found in each classroom to form a message. In order to collect these hearts, Mikie must stand somewhere near them and shout out. There are two type of hearts: small  and large. Mikie needs to shout out only once to collect the small hearts, and multiple times to collect the large ones. When a message is formed, Mikie can exit the classroom through a door marked OUT.<br><br>Stopping him from collecting the hearts is the teacher, the chef, and the janitor. The teacher is the worst one. When he is unable to  catch you, he works up a sweat, and eventually, throws his teeth at you. When his teeth hits Mikie, he loses one of his three lives. In later classrooms, Mikie can throw stuff at his enemies in order to stun them for several seconds (for instance, the basketballs in the locker room, and the chickens in the canteen). The janitor isn't as bad because he walks much slower than the others.<br><br>In between levels, you have to enter the next classroom through a door marked IN without being caught, but you can do at least two things to pass time: Steal some lunch, and open one of the unmarked doors to receive a punch, a kick, or the chance to see a naked lady with breasts. Beware that if you take too long in the hallway and don't travel between floors, a bucket slides across the screen real fast and attempt to slip you.<br><br>If you're good enough at the game, you can enter a high score, and if you fail to enter anything, the game will assume that you are Clint Eastwood.<br><br>",
  "publishedBy": "Imagine Software Ltd.",
  "developedBy": "Konami Industry Co. Ltd.",
  "released": "1986",
  "alsoFor": "Amstrad CPC, Arcade, Commodore 64, Electron, SG-1000, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/mikie",
  "visual": "Fixed / flip-screen, Isometric",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Imagine Software Ltd.",
          "developer": "Konami Industry Co. Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/481016-mikie-bbc-micro-screenshot-two-colour-loading-screen-frankly.gif",
      "caption": "Two colour loading screen. Frankly it would have looked a lot better\nin mode 1 with 4 colours."
    },
    {
      "link": "/images/shots/l/481017-mikie-bbc-micro-screenshot-level-1-i-ve-collected-the-hearts.gif",
      "caption": "Level 1: I've collected the hearts and the door is ready to open.\nJust have to avoid the teacher to get to it."
    },
    {
      "link": "/images/shots/l/481018-mikie-bbc-micro-screenshot-in-the-corridor-between-classrooms.gif",
      "caption": "In the corridor between classrooms (levels) about the enter the next\nroom."
    },
    {
      "link": "/images/shots/l/481019-mikie-bbc-micro-screenshot-level-2-the-locker-room.gif",
      "caption": "Level 2: The locker room."
    },
    {
      "link": "/images/shots/l/481020-mikie-bbc-micro-screenshot-level-3-in-the-cafeteria-being.gif",
      "caption": "Level 3: In the cafeteria, being pursued by the teacher and two\nchefs."
    },
    {
      "link": "/images/shots/l/481021-mikie-bbc-micro-screenshot-level-4-in-the-dancing-studio-with.gif",
      "caption": "Level 4: In the Dancing studio with lots of hearts to collect and\ndancers to avoid."
    },
    {
      "link": "/images/shots/l/481022-mikie-bbc-micro-screenshot-level-5-outside-in-the-school-garden.gif",
      "caption": "Level 5: Outside in the school garden."
    },
    {
      "link": "/images/shots/l/481023-mikie-bbc-micro-screenshot-completed-it-all-the-hearts-collected.gif",
      "caption": "Completed it: All the hearts collected and given to Mandy."
    },
    {
      "link": "/images/shots/l/481025-mikie-bbc-micro-screenshot-high-score-table.gif",
      "caption": "High score table."
    }
  ],
  "cover": []
}