{
  "name": "Repton: The Lost Realms",
  "shortName": "repton-the-lost-realms",
  "description": "<i>Repton: The Lost Realms</i> was originally meant as a sequel to <a href=\"https://www.mobygames.com/search/quick?game=Repton+3\">Repton 3</a> but was ultimately not released until more than twenty years later. It is also most similar to that game, with the basic gameplay remaining the same. The game consists of 24 levels and the objective of each is to defuse a number of time bombs. Before this can be done however the player has to collect all diamonds and golden crowns and kill all monsters. Failing to do this within a certain time will result in the bombs exploding and the player loses a life. There are a number of puzzles that has to be solved and everything has to be done in a certain order or else the player may block himself in. Therefore it's necessary to plan ahead and pick the right route. As usually the player has to watch out for falling boulders as well as monsters, spirits, skulls and fungus. In addition to boulders this game also features balloons that are equally lethal but floats upwards. There are also certain doors that the player can remove only by collecting absorbalene pills.<br><br>An editor is included with the game. It allows the player to modify characters and levels. ",
  "publishedBy": "Retro Software",
  "developedBy": "",
  "released": "Nov 06, 2010",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/repton-the-lost-realms",
  "visual": "2D scrolling",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Retro Software",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Nov 06, 2010",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}