{
  "name": "Repton Infinity",
  "shortName": "repton-infinity",
  "description": "<i>Repton Infinity</i> is as much a development tool as it is a game. Its predecessor <a href=\"https://www.mobygames.com/search/quick?game=Repton3\">Repton 3</a> included a level and graphics editor but Infinity takes it one step further with Reptol, a scripting language that allows the user to alter the behaviour of characters and objects. This means that the user can not only create new Repton levels but also completely new games. <br><br>Four games are included to demonstrate the tools:\n<ul><li> Repton 3: Take 2</li>\n <li> Repton 4</li>\n <li> Robbo</li>\n <li> Trakker</li></ul>\n<i>Repton 3: Take 2</i> is the original Repton 3 remade with the new tools. The remake differs in that it doesn't have a time limit for completing a level. There is also a minimum score that has to be reached before the player can progress to the next level. <i>Repton 4</i> plays like previous <i>Repton</i> games but features some new objects. Jewels and banknotes have to be collected to score points while the player also has to watch out for ghouls that hatch out of cracked eggs, spirits that have to be guided into cages and fungi that grow when unattended. There are also magiblocks that transform into treasures when pushed into a row of three and photocopiers that can be used to duplicate objects. In <i>Robbo</i> the player controls a robot and has to collect flashing orbs and solve puzzles to get points. Puzzles include tasks like repairing a computer or lighting a bulb. In <i>Trakker</i> the player controls a bulldozer and has to get rid of creatures known as Hideous Jaggas. These can be killed by setting off dynamite or squashed with tomatoes. Bananas can also be used but then they will only turn into spiders. ",
  "publishedBy": "Superior Software Ltd.",
  "developedBy": "",
  "released": "1988",
  "alsoFor": "Electron | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/repton-infinity",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Superior Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}