{
  "name": "Repton",
  "shortName": "repton_",
  "description": "<i>Repton</i> is a diamond collecting game similar to <a href=\"https://www.mobygames.com/search/quick?game=Boulder+Dash\">Boulder Dash</a>. The player takes control of the eponymous lizard Repton who for each of the game's twelve levels has to collect all of its diamonds. At the same time he has to watch out for falling boulders and monsters that may roam around and try to kill him. The time is limited and when it runs out the player loses a life. A life is also lost when being caught by a monster or being crushed beneath a boulder. The main difference between Repton and Boulder Dash is that Repton is calmer and has a focus on puzzle solving rather than quick arcade action. Often there is only a specific route to take that the player must figure out or he risks being trapped between boulders. Some levels have eggs, safes and keys. When eggs fall they will crack and a reptile will emerge from it. The player should avoid the reptiles as he will lose a life if he comes into contact with them. Keys needs to be picked up to open the safes. Once opened a diamond will be revealed. The game uses a password system so the player can jump straight to the level he has the password for. ",
  "publishedBy": "Superior Software Ltd.",
  "developedBy": "",
  "released": "Jun, 1985",
  "alsoFor": "Acorn 32-bit, Electron | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/repton_",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Superior Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Jun, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}