{
  "name": "Repton 2",
  "shortName": "repton-2",
  "description": "<i>Repton 2</i> is, just like its <a href=\"https://www.mobygames.com/game/bbc-micro_/repton_\">predecessor</a>, a puzzle solving game about collecting diamonds. It features a number of new features and changes from the original formula. The biggest change is that it instead of separate levels features one big world where each sector is connected with teleporters. The basic gameplay is very similar though. The player digs his way through the dirt in search for diamonds and other objects and has to watch out for falling boulders or monsters (reptiles) that are out for him. Monsters appear from cracked eggs and will kill the player if he gets contact. They can be killed with falling boulders. There are also spirits who follow the walls to their left until they reach a cage. In the cage the spirit transforms into a diamond. To get all the diamonds the player therefore has to guide all the spirits to their cages. The player can also collect jigsaw puzzle pieces. These will then appear at the first screen and form the sentence &quot;Repton 2 Is Ended&quot;. On the topmost levels of the world the player has to watch out for meteors that fall from the sky.<br><br>The game involves more than just than collecting diamonds. To complete the game the player has to do all of the following:\n<ul><li>collect all of the 4,744 earth sections</li>\n <li>collect all of the 1,634 diamonds</li>\n <li>kill all of the 18 monsters</li>\n <li>use all of the 64 transporters</li>\n <li>collect all of the 42 jigsaw puzzle pieces</li>\n <li>collect a &quot;finish character&quot;</li></ul>\nUnlike the original game there is no time limit in Repton 2. Neither are there any save options so the player has to complete the whole game in one sitting. ",
  "publishedBy": "Superior Software Ltd.",
  "developedBy": "",
  "released": "Nov 14, 1985",
  "alsoFor": "Acorn 32-bit, Electron | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/repton-2",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Superior Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Nov 14, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}