{
  "name": "Trivial Pursuit",
  "shortName": "trivial-pursuit",
  "description": "This is the earliest home computer incarnation of Horn Abbot International Ltd's classic board game, <i>Trivial Pursuit</i>. The game involves answering questions on one of six subject categories to gain moves, and answering questions on special squares to gain one of the six 'Wedges' you need to gain the right to take on the final winning question. Questions are aimed at British players - many entertainment questions are based on British TV, and sport questions relate to popular British sports.<br><br>Two game modes are available: Single Player (which involves answering questions against the clock) and Multiplayer (where you can take on up to five human-controlled players). The computer reveals the answer, and you select 'yes' or 'no' to tell it whether you got it right.<br><br>The question categories are exactly the same as the board game: Art &amp; Literature, Science &amp; Nature, Geography, History, Sports &amp; Leisure, and Entertainment. However two different question styles are added to take advantage of computer technology - some questions relate to a picture or diagram and some relate to a piece of music. <br><br>One additional feature not available in the board game is a statistical analysis of the number and type of questions answered correctly. This can be split into the performances of all the players, or the performance of an individual player within the six categories. It is especially useful at the end of the game, when choosing which category a player must answer to win the game.",
  "publishedBy": "Domark Limited",
  "developedBy": "Oxford Digital Enterprises Ltd.",
  "released": "1988",
  "alsoFor": "Amiga, Amiga CD32, Amstrad CPC, Amstrad PCW, Atari 8-bit, Atari ST, CDTV, Commodore 64, DOS, MSX, SEGA Master System, Thomson TO, ZX Spectrum | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/trivial-pursuit",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Board game, Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Domark Limited",
          "developer": "Oxford Digital Enterprises Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/898244-trivial-pursuit-bbc-micro-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/898245-trivial-pursuit-bbc-micro-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/898246-trivial-pursuit-bbc-micro-screenshot-game-start.png",
      "caption": "Game start"
    },
    {
      "link": "/images/shots/l/898247-trivial-pursuit-bbc-micro-screenshot-a-music-question.png",
      "caption": "A music question"
    }
  ],
  "cover": []
}