{
  "name": "Words and Pictures",
  "shortName": "words-and-pictures",
  "description": "<i>Words And Pictures</i> is an educational title for three to seven year olds. There are two lists of words, List A and List B, and two ways of playing, Words or Sentences which gives four list/game combinations. The game starts with the player, or parent, entering a number in the range one to four to select the game/list combination of their choice.<br><br>After selecting their preferred game there are a couple of configuration questions to go through; sound can be turned on or off; collating a performance table (score sheet) is optional too; finally the children(s) names are entered.<br><br>Both game modes are very similar, in both cases the player(s) are shown four pictures and are asked a question. In the Word game a word is shown beneath the pictures and the player presses any key until the on-screen arrow points to the correct/matching picture. The sentence game is just the same but now in a sentence is shown beneath the four pictures so, for example, while in the Word game mode the player would see the word 'elephant' in the Sentence mode the game would show the sentence 'I see a pink elephant'.<br><br>In both game modes there are ten sets of pictures to a game. If the player gets an answer correct a little frog on the right of the screen hops towards some red bugs, (ten bugs because there are ten questions) and eats one. If the player gets a question wrong the frog turns red, a sound is heard, and the player get to try again.<br><br>At the end of a game an animated song 'Five Speckled Frogs' is played, and the player gets the chance to play again or return to the menu to play a different game. ",
  "publishedBy": "Chalksoft Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "ZX Spectrum | Combined View",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/words-and-pictures",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Chalksoft Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}