{
  "name": "Xor",
  "shortName": "xor",
  "description": "Magus and Questor are trapped in the 15 mazes of Xor. These include Dolly's Revenge, Patience Pending and The Decoder, and can be played in any order. Before going through the exit, they must collect every balloon from within the levels. All of this must be done in a limit of 2000 moves.<br><br>The characters have differing abilities, and can be swapped between at any time. Hazards to avoid include bombs, falling boulders and barriers. Four pieces of the map can be found and collected.<br><br>The physical rules of this top-down maze are somewhat bizarre, but consistent: dotted force-fields can be traversed (and neutralized) by horizontal passage, waved ones by vertical passage; fish will fall as surely and as lethally as the boulders in <a href=\"https://www.mobygames.com/search/quick?game=Boulderdash\">Boulderdash</a>, while chickens will travel in the direction they are pointed until something gets in their way. Various explosive devices, dolls and even teleporters further contribute to the complication of moving around this maze. Should all its levels be successfully completed, information will be provided permitting the completion of the overarching meta-puzzle.",
  "publishedBy": "Logotron Ltd",
  "developedBy": "Astral Software",
  "released": "1987",
  "alsoFor": "Amstrad CPC, Atari ST, Commodore 64, Electron, ZX Spectrum | Combined View",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/bbc-micro_/xor",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "BBC Micro",
      "releases": [
        {
          "publisher": "Logotron Ltd",
          "developer": "Astral Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}