{"name": "Jeff Minter Classics", "overview": "Jeff Minter Classics:<br><br>For the first time on the Atari Jaguar, experience Jeff Minter's classic games \"Llamatron 2112\" and \"Revenge of the Mutant Camels\". Both games have been brought to the platform with the full blessing of Jeff Minter himself and are contained on a single cartridge.<br><br>Llamatron 2112: You play the part of a totally hard laser-spitting llama. Your mission is to collect all the tiny sheep, llamas, camels and goats you see on each wave. Standing in your way are great herds of unintelligent but numerous Grunt enemies, plus a veritable menagerie of nasty creeps which fire at you, dodge your fire, emit fire hydrants, try to ram you, murder your llamas and shoot your ass off with lasers. Kill them deadly. Not everything can be killed, and some enemies take more than one shot to destroy. Your ultimate objective - destroy the Ozric Tentacle of level 99 and get to Herd Heaven on level 100.<br><br>Revenge of the Mutant Camels: You are a rather threadbare-looking camel. If you are playing CPU Assist or Two-Player, you are accompanied by a large shaggy goat creature called an Ancipital. You are the Good Guys. Your mission is simple: stay alive through 42 zones of 7km each. These zones are populated by rampant telephone kiosks, skiing kangaroos, butch Greenham Common Peace Women, manic Minters, flying sheep and all the usual nonsense. These are the Bad Guys. They try to kill you off and you, naturally, and in keeping with the traditionally calm, rational, and thoughtful nature of videogames, get to waste them with lots of spectacularly destructive weaponry.", "platform": "Atari Jaguar", "release_date": "", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Lawrence Staveley", "publishers": "AtariAge", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "4.33", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ROtu-K2BdZc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/140269"}