{"altername_name": [], "name": "Animaniacs: The Great Edgar Hunt", "overview": "Hollywood is in an uproar - the Edgar awards for films have been stolen! The culprit is none other than C.C. Deville, who is threatening to melt down the Edgars unless he gets a ten-picture deal from Warner Bros.! Deville arrives in his airship, but accidentally crashes into the Water Tower, scattering the Edgars across the various movie lot and freeing Yakko, Wakko, and Dot at the same time. Help the Warners reclaim the Edgars! Animaniacs: The Great Edgar Hunt is a 3D platformer where the player controls Yakko, Wakko, and Dot. Each character has their own special skills that can be unlocked as players progress through the game. For example, Dot can limbo under low walls, Wakko can dig tunnels in soft earth, and Yakko can bomb weak walls. Players progress further through the game by collecting Edgar awards which open up more areas in the Warner Movie Lots. There are also 300 collectibles in each world; players are awarded one Edgar at 150 collectibles and another at 300. In addition to this, there are also bonus mini-games guest starring Pinky and The Brain. Each of their short games features another failed attempt at world domination. The game also has the original cast of the cartoon reprising their roles for the game. There are also plenty of movie parodies, and it also takes the opportunity to riff a couple of video games as well.", "platform": "Nintendo GameCube", "release_date": "September 18, 2005", "game_type": "Released", "esrb": "E - Everyone", "developers": "Warthog Games", "publishers": "Ignition Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Animaniacs:_The_Great_Edgar_Hunt", "video_link": "https://www.youtube.com/watch?v=euWmUPRK2Zc&ab_channel=GTC%28GameTrailerCollection%29", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5994-animaniacs-the-great-edgar-hunt\n"}