{"altername_name": ["Capcom vs. SNK 2 EO: Millionaire Fighting 2001"], "name": "Capcom vs. SNK 2: EO", "overview": "Capcom vs. SNK 2 combines characters and gameplay elements from various Capcom and SNK fighting games, mainly the Street Fighter and The King of Fighters series. Other elements, most noticeably different fighting styles, incorporated elements from other games as well, such as Street Fighter III, Garou: Mark of the Wolves, and the Samurai Shodown series. In contrast to the original Capcom vs. SNK, characters no longer have a specific \"Ratio.\" Instead the player can select up to three characters in a team and give an amount or ratio (up to four) to each as desired. In console versions of the game, players can also choose a 1-on-1 game or a 3-on-3 game in Arcade Mode with the Ratio System removed. Unlike the first game, which was based on The King of Fighters-style two-strength, four button system of punches and kicks, Capcom vs. SNK 2 is based on the three strength, six-button system of punches and kicks, native to the Street Fighter series, and the SNK characters have been tweaked to fit the 6-button style. The overall system is derivative of Street Fighter Alpha. However, a number of different fighting styles called 'Grooves', which mimic other Capcom and SNK games, are included in the engine. These dictate both the character's Super Gauge system, and special techniques, such as dashes, running, and guard cancels, called \"Subsystems.\" There are six in total, each designtated with a letter, along with custom grooves that can be programmed in home versions of the game. Each player designates prior to the match which groove his or her team will use.", "platform": "Nintendo GameCube", "release_date": "September 23, 2002", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom Entertainment", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.11", "wikipedia": "https://en.wikipedia.org/wiki/Capcom_vs._SNK_2", "video_link": "https://www.youtube.com/watch?v=TSOtQDwzQJY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5381-capcom-vs-snk-2-eo\n"}