{"altername_name": [], "name": "Donkey Kong Racing", "overview": "Donkey Kong Racing was a sequel of the classic Nintendo 64 racing game Diddy Kong Racing. It was going to be released on the Nintendo GameCube sometime in 2002. Known playable characters in Donkey Kong Racing included Donkey Kong, Diddy Kong, Tiny Kong, Kiddie Kong, and Taj the Genie from the trailer; plus Crankey Kong and Lanky Kong (which were shown in an internal render for the game). It is rumored that some of the original cast from Diddy Kong Racing could have returned as Taj was a playable character in the game. The world of Donkey Kong Racing was going to include jungles, plains, and seas that were going to be stitched together into one seamless overworld. The tracks and scenery are blurred so much, \" It was up to you to decide where the track met amidst marauding rhinos, schools of darting piranha, swarms of agitated wasps and other roaming wildlife bent on mischief \"Donkey Kong Racing was going to have a lot of realistic features, like fading sunlight and swaying trees. The game was also going to have Dolby Surround Sound, even to go as far as to put together an orchestrated soundtrack. One of the main differences from Donkey Kong Racing to Diddy Kong Racing was that instead of riding in various vehicles, the player would be riding on the backs of different animals from the Donkey Kong Country series. The animals that could be ridden on include Rambi (Rhinos), Enguarde (Swordfishes), Ellie (Elephants), and Zingers (Wasps). Expresso (Ostriches), Chomps (Sharks), Flitter (Dragonflies), Glimmer (Anglerfishes), Necky (Vultures), and Army (Armadillos) was shown in the trailer, which could mean those animals could also be ridden in-game. Each animal would have a different size and color, with special abilities according to how big the animal was. Bigger animals could destroy objects, while smaller animals could maneuver around obstacles easier The player could also be knocked down from their animal, in which they would have to do a \" Track and Field \" inspired button-mashing activity to get back on said animal. When competing in races, the player could pick up fruits and prizes for their specific animal. Giving the user's animals enough could make them become \"true thoroughbreds.\" In other words, the user can collect fruits to upgrade the user's animal to max potential. There was going to be a multiplayer mode in the game. Up to 4 people would be able to play at a given time. However, not much else is known about the specifics of this mode. Donkey Kong Racing made its first (and only) appearance at E3 2001, where a teaser trailer for the game was shown off and said to be released somewhere in 2002. The game was anticipated to be shown at Space World 2001 or ETS 2001, but that unfortunately never happened. During that time, Rare Ltd. was not getting enough money from Nintendo to fund any of its projects. Knowing this, Tim and Chris Stamper (the heads of Rare Ltd. at the time) went to Nintendo to offer the rest of their company, but surprisingly, Nintendo refused their offer. Tim and Chris Stamper went looking for a buyer until 2002 when Microsoft beat out Activision and bought them for $375 million. Effectively, people thought Donkey Kong Racing was over, due to the fact that Rare doesn't have permission to use the Donkey Kong trademark anymore. This was not the case though, as when, in 2004, it was asked if the game was still being developed, the Rare team said \"Well yes and no. It's not called Donkey Kong Racing anymore, it's not on the GameCube anymore, and by this point, I'd imagine so little of the original art and code remains that it's barely the same game anymore, but yes it's still coming out in some form\" The game that was to be replacing Donkey Kong Racing was to be known as Sabreman Stampede, which would be also cancelled in late 2005.", "platform": "Nintendo GameCube", "release_date": "2002", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Rare", "publishers": "", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://youtu.be/0ThbbN3o5yw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/169501-donkey-kong-racing\n"}