{"altername_name": [], "name": "Ed, Edd n Eddy: The Mis-Edventures", "overview": "Ed, Edd and Eddy are three stupid friends obsessed with one thing and one thing only: jawbreakers! Eddy is the fearless leader, eager to make a quick buck; Ed is the tall, strong and stupid one, while Edd (or Double-Dee) is the smart, polite neat-freak, who communicates with his family through sticky notes. Ed, Edd n Eddy: The Mis-Edventures allows you to play as the trio through a series of levels, called 'scams'. Each level is a get-rich-quick scheme dreamed up by Eddy, allowing the Eds to get some jawbreakers. Each level can be accessed via the hub world, the 'Cul-de-sac', where the Eds have their adventures and meet other neighborhood kids. Players control all three Eds; more specifically, they're always in control of an Ed, and the other two tag along. You can switch your Ed at any time with the press of a button. Each Ed has their own abilities: Eddy can hurl stink bombs and form a tower to reach high objects, Ed can dig in sandpits, lift and throw objects, and charge at things to smash them, while Double Dee can use his slingshot, activate machines, and be thrown high into the air by the other two Eds. Ed, Edd n Eddy: The Mis-Edventures is a 3D platform video game based on the Cartoon Network animated television series Ed, Edd n Eddy, developed by Artificial Mind and Movement and Cartoon Network Interactive and published by Midway Games. The game's plot is loosely structured around six different stories with two bonus levels, each involving a scam by the titular trio to acquire enough money to buy jawbreakers, a plot that mirrors that of the animated series. Players may choose at any point to take control of Ed, Edd, or Eddy to overcome the game's obstacles. Character selection is strategical due to each of the Eds having his own unique ability. Throughout the game, the player encounters not only the Ed trio but also the series' side characters, such as Jimmy, Sarah, Kevin, Jonny, and the Kanker sisters. It was announced on February 15, 2005, and released on November 3, 2005, for the PlayStation 2, GameCube, Xbox, Game Boy Advance, and Microsoft Windows. https://ed.fandom.com/wiki/Ed,_Edd_n_Eddy_-_The_Mis-Edventures", "platform": "Nintendo GameCube", "release_date": "November 3, 2005", "game_type": "Released", "esrb": "E - Everyone", "developers": "Artificial Mind & Movement", "publishers": "Midway", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Ed,_Edd_n_Eddy:_The_Mis-Edventures", "video_link": "https://youtu.be/yymDECDU2Xs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30774-ed-edd-n-eddy-the-mis-edventures\n"}