{"altername_name": ["FIFA 07"], "name": "FIFA Soccer 07", "overview": "While the focus of this yearly update was on the game engine, the Manager mode was also enhanced: players now also improve their playing ability from being active members of the squad, forcing the player to choose between keeping his celebrated stars near retirement in the starting eleven, or give the benefits of the youth system a chance to shine. Another new feature, in what is now the primary mode of the series, is the ability to watch the game in a simplified text mode, with the ability to jump into action to turn the events still available. The points system was replaced by a less abstract currency model (with the ability to choose between Pounds, Euros or Dollars). Other game modes include Tournaments (including the creation of custom tournaments) and Challenges. By completing challenges (similar to the Global Challenges mode in World Cup 2006) the player can spend points in the Fanshop with items such as new teams, a special overhead camera, new balls from Adidas (including all original World Cup balls from 1974 to 2002), stadiums, third kits and special celebrations for created players. Finally, online gaming received a new mode: Interactive Leagues. These are online-only leagues based on the fixtures of their real counterparts (English Premier League, French Ligue 1, German Bundesliga and Mexican 1st division). Then, online players go head -to-head with their favorite teams with a victory counting one vote for their favorite team. Once the week is over, the team with more votes is declared the winner of the week, getting three points. The number of weekly matches a player can do in this mode is unlimited.", "platform": "Nintendo GameCube", "release_date": "October 3, 2006", "game_type": "Released", "esrb": "E - Everyone", "developers": "Electronic Arts", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "4", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/FIFA_07", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6680-fifa-soccer-07\n"}