{"altername_name": ["Harry Potter and the Philosopher's Stone", "Harry Potter to Kenja no Ishi", "Harry Potter und der Stein der Weisen", "Harry Potter y la Piedra Filosofal", "Harry Potter e la Pietra Filosofale"], "name": "Harry Potter and the Sorcerer's Stone", "overview": "Harry Potter and the Philosopher's Stone (known as Harry Potter and the Sorcerer's Stone in the United States) is an Electronic Arts multi-platform action-adventure with heavy platformer elements video game developed by KnowWonder, Warthog, Griptonite, Argonaut, Eurocom and Westlake Interactive. It is based on J.K Rowling's novel of the same name and the film adaptation. Philosopher's Stone was initially developed for the PlayStation, Microsoft Windows, Game Boy Color, Game Boy Advance and Mac OS X, and was re-made two years later for the PlayStation 2, Xbox and Nintendo GameCube. The first version of the game was released on 15 November 2001 in North America, in Australia and Europe on 16 November and in Japan on 1 December 2001. The second version was released in North America on 9 December 2003, in Japan on 11 December and in Australia and Europe on 12 December. The story follows protagonist Harry Potter, who discovers he is a wizard, and is sent to Hogwarts School of Witchcraft and Wizardry where he makes friends and receives magical training, and along with his friends stop Lord Voldemort from returning to power. The game received mixed reviews. Critics commented on the game's simple gameplay and its poor graphics (2003 versions) while others said the game's license would be the only thing to draw in fans.", "platform": "Nintendo GameCube", "release_date": "December 9, 2003", "game_type": "Released", "esrb": "E - Everyone", "developers": "Warthog Games", "publishers": "Electronic Arts", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Harry_Potter_and_the_Philosopher%27s_Stone_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30808-harry-potter-and-the-sorcerers-stone\n"}