{"altername_name": ["Harry Potter: Quidditch Copa del Mundo", "Harry Potter: Quidditch Weltmeisterschaft", "Harry Potter e la Coppa del Mondo di Quidditch"], "name": "Harry Potter: Quidditch World Cup", "overview": "Quidditch, the broomstick and ball “sport” of the Harry Potter world comes to life in this simulation. For those unfamiliar with the game, two seven-player teams of flying wizards attempt to score goals with one ball while dodging more flying balls and each other. For those who are familiar with the game, you will be happy to know that the players, positions, and “strategies” of Quidditch are faithfully recreated. The game starts with a player selecting which of the four Hogwarts school teams he or she wishes to play for. Following some tutorial events, they are launched into the competition for the Hogwarts Cup against the other three teams. As the player wins games and completes specific challenges (such as “score 120 points in one game”) they collect Quidditch cards which unlock special combo moves. Once a player has won the school championship, they can go on to play as one of nine international teams competing for the Quidditch World Cup each with its own style and special combo moves. After winning the cup once, there are still more cards to be collected by playing and winning as different teams. People familiar with actual sports know that the rules of Quidditch (as described in Rowlings' books) are fundamentally flawed and that the only meaningful part of the game is the 1 on 1 competition between the two seekers trying to catch the golden snitch. Quidditch World Cup alleviates this problem with the “golden snitch bar”. As the game progresses, completing action combos and performing special moves adds to a team progress bar. Eventually, when the snitch appears, the team with better positioning on the bar will start with an advantage in the chase. Ironically, this system rewards things other than actual scoring so in-game goals still remain mostly meaningless (except on lower difficulty levels where it is very easy to build a 160+ point lead and make the snitch inconsequential). Because it is designed for younger audiences, Quidditch World Cup lacks most of the advanced features you would expect in an EA sports game (league play, team management, etc…). It also lacks any multiplayer options other than two-player (same machine) exhibition matches.", "platform": "Nintendo GameCube", "release_date": "October 28, 2003", "game_type": "Released", "esrb": "E - Everyone", "developers": "Magic Pockets", "publishers": "Electronic Arts", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.69", "wikipedia": "https://en.wikipedia.org/wiki/Harry_Potter:_Quidditch_World_Cup", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6693-harry-potter-quidditch-world-cup\n"}