{"altername_name": [], "name": "I-Ninja", "overview": "I-Ninja is a 3D platform title starring an original character created by British developer Argonaut Software. Players control a spirited young ninja as they make their way past a diverse selection of five themed areas consisting of indoor and outdoor locales. I-Ninja is garbed in a blue suit and matching hooded mask to cover his watermelon-shaped head, so that only his eyes and his expressive brow are visible to players. The character also wields a pair of katana blades in both hands as he jumps from platform to platform, runs up walls and ramps, hops on a barrel to cross narrow ledges, and avoids numerous hazards while slicing at enemies. Other weapons include shurikens, swords, blowguns, rocket launchers, homing missiles, and more, with bosses and lesser villains appearing in the air, sea, and on the ground. Players will even square off against a 150-foot robot from inside a robot warrior of their own. The ultimate goal is to defeat nemesis Master O-Dor and his army of Ranx foot soldiers. The cartoon-style atmosphere is brought to life with over-the-top animations, giving the game a distinctive look from many of its platform contemporaries. I-Ninja is an adrenaline-charged adventure game. An ultra-cool ninja with major attitude meets extreme sports game play, I-Ninja is the consummate warrior who has spent years mastering his weapons and honing his skills. In true gravity defying game play, I-Ninja can scale buildings, \"shred\" on extreme rails, hover great distances with a \"sword copter\", ride drifting roller spheres and utilize specialized manga-style ninja moves to navigate through each dynamic environment.", "platform": "Nintendo GameCube", "release_date": "December 4, 2003", "game_type": "Released", "esrb": "T - Teen", "developers": "Argonaut Games", "publishers": "Namco Hometek", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.09", "wikipedia": "https://en.wikipedia.org/wiki/I-Ninja", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12480-i-ninja\n"}