{"altername_name": ["Jimmy Neutron: Der mutige Erfinder", "Jimmy Neutron: Boy Genius", "Jimmy Neutron: Boy Genius", "Nickelodeon Jimmy Neutron: Der mutige Erfinder"], "name": "Jimmy Neutron: Boy Genius", "overview": "Jimmy Neutron: Boy Genius is a video game based on the Nickelodeon film of the same name for the Nintendo GameCube, PC, PlayStation 2 and Game Boy Advance . It is based on the 2001 computer animated film of the same name. It was featured in a two-pack with Rocket Power: Extreme Arcade Games. An Xbox version of the game was planned but was cancelled. Gameplay[edit] The game is a 3D adventure starring Jimmy Neutron and his robotic canine Goddard. In the game, the evil King Goobot has abducted some of Jimmy's friends, so Jimmy must begin an intergalactic quest to save them. While progressing through various locales inspired by the movie, players need to solve puzzles using an assortment of gadgets. Also included are various mini-games to play within an amusement park, as well as hidden movie clips, Rugrats and SpongeBob trailers, character bios, and movie trailers to be unlocked. Played from a traditional third-person perspective, the game consists of five distinct regions linked together by a main hub. Once players decide on a region, they can enter a portal and then be whisked away to a 3D world. Among the environments players explore are Jimmy's House, an Asteroid Surface, an Asteroid Interior, Yolkus Prime, and Retroland Amusement Park. Each region spans multiple levels, with the goal in each being to find a number of key items and special prizes and a shrunken head. A secondary goal in some levels is to locate friends Carl Wheezer, Cindy Vortex, Rose, Nissa, and Zachary. Enemies trying to prevent Jimmy from succeeding include giant ants and the blob-like Yokians, with villains Ooblar, Poultra, and King Goobot forming the boss encounters. Players can run, jump, kick, and use an assortment of inventions. Health can be replenished by finding slices of blueberry pie, extra lives are awarded for every ten neutrons found, and weapons include the Shrink Ray, Inflato Ray, and the Jimmy Bat. Three types of vehicles can also be used to traverse the levels, the Goddard Pogo, the Goddard Sled, and the Goddard Scooter. The game disk includes a behind the scenes feature hosted by Nick Cannon, as well as footage from the movie, shorts, and trailers can be unlocked.", "platform": "Nintendo GameCube", "release_date": "December 17, 2002", "game_type": "Released", "esrb": "E - Everyone", "developers": "Big Sky Software", "publishers": "THQ", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.09", "wikipedia": "https://en.wikipedia.org/wiki/Jimmy_Neutron:_Boy_Genius_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6699-jimmy-neutron-boy-genius\n"}