{"altername_name": [], "name": "Killer7", "overview": "In an alternate version of the Earth's history, a treaty was signed in the early 21st century, during which all countries willingly destroyed their nuclear arsenals, ending international conflicts. The presumed era of world peace, however, is marred by continuous attacks carried out by a new terrorist group called \"Heaven Smile\", which consists of human mutants under the influence of a lethal virus, and targets the United Nations and the International Ethics Committee (IEC). Meanwhile, the relationship between the United States and Japan deteriorate, as the latter becomes controlled by a party that proposes to sever connections to the USA. A group of assassins known as Killer7 is hired by a man named Christopher Mills, on behalf of the US government. The group is led by an elderly wheelchair-bound man named Harman Smith, endowed with an ability known as \"Multifoliate Personae Phenomenon\", which allows him to transform into seven different personalities who were professional assassins in their lives, and whose souls were absorbed by Harman after they were killed in a mysterious incident fifty years ago. Garcian Smith is the leading persona among these seven, and the only one who can communicate with Harman. Killer7 is a hybrid game that incorporates shooting and puzzle-solving with light role-playing elements. The player can switch between any of the seven characters during most parts of the game. Each character has unique abilities. Dan, for example, is a true marksman, while Coyote is an experienced thief with exceptional movement. The unusual cast also includes the blind Con who moves very fast, Kaede with ranged skills, Mask who has the deadliest arsenal, the albino Kevin who can turn invisible, as well as Garcian, the leader of the pack who possesses the ability of reviving the bodies of slain personalities. Despite its 3D environments, character navigation in the game is restricted: playable characters can only move along pre-determined (though often branching) paths. Drawing out a weapon switches the view to first-person perspective with free camera rotation, but no possibility to move. Typically, the player should eliminate the approaching enemy as quickly as possible before sustaining damage, using various combinations of characters and weapons. Defeated enemies (particularly those dispatched with critical hits) yield the player \"blood\", which can be turned into serum in special rooms and used to enhance the abilities of the characters. A considerable portion of the gameplay is dedicated to solving various puzzles and gathering plot-related information by conversing with the game's exotic characters.", "platform": "Nintendo GameCube", "release_date": "July 7, 2005", "game_type": "Released", "esrb": "M - Mature", "developers": "Capcom Production Studio 4", "publishers": "Capcom Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.07", "wikipedia": "https://en.wikipedia.org/wiki/Killer7", "video_link": "https://www.youtube.com/watch?v=CFGlYkkWUo0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31-killer7\n"}