{"altername_name": [], "name": "Knights of the Temple: Infernal Crusade", "overview": "The player character Paul is a Templar knight on his first Crusade, to stop the end of the world by fighting his way through the sombre gloom of European monasteries and villages to the colourful bazaars and powerful bastions of the crusader castles under the blazing sun of the Holy Land and by entering the realms of hell and face his worst nightmares. An evil Bishop has abducted Adelle, a mysterious young woman with divine powers and Paul's beloved childhood friend. With his entourage of disciples and their captive Adelle he embarks on an Unholy Crusade, moving along the initial routes of the historic holy wars. By misusing Adelle's powers against her he plans to complete the Unholy Circle and to perform dark rituals at sacred places to desecrate them. This way he intends to eventually unlock and gain access to the Gateway to Hell. Paul finds upon him the tough task of starting a mission to uncover the Evil Conspiracy, to interrupt the Unholy Circle and to prevent the Evil Bishop from fulfilling his plan. Only by saving Adelle can he save the world from Evil. In the final confrontation with evil, the powers of hell have been unleashed and the corrupt bishop has gained limitless powers. Paul fights him and his henchmen, resurrecting countless of evil minion where Paul struggles to fight. Eventually the bishop was defeated and thrown into hell, and Paul, although weak and wounded, saved the world from darkness. He then brings Adelle home to her mother where they say that Paul's victory was the will of God, something to which Adelle agrees. However, whilst Paul and her mother look away, Adelle's eyes turn black, indicating that that she has been possessed by a demon.", "platform": "Nintendo GameCube", "release_date": "March 19, 2004", "game_type": "Released", "esrb": "", "developers": "Starbreeze Studios", "publishers": "TDK Mediactive", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.47", "wikipedia": "https://en.wikipedia.org/wiki/Knights_of_the_Temple:_Infernal_Crusade", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45245-knights-of-the-temple-infernal-crusade\n"}