{"altername_name": [], "name": "Radirgy: GeneriC", "overview": "Radirgy is a vertically scrolling shoot 'em up with bullet hell elements, and features a bright cel shaded graphical style. The game features an arcade mode with five stages, a score attack mode, scalable difficulty, and bonus modes depending on the platform. The story follows a blue-haired schoolgirl named Shizuru Kamigusa, who is allergic to radio waves. Her father works for a company developing a remedy for the condition, but a terrorist group led by Ruki Michima takes over their building. Shizuru mans a flying mecha called a “terminal suit\" to save her father and the medicine from the terrorists. Dialog appears on the playfield throughout the game and can be dismissed by pressing a button, although this feature can be disabled. The game features bullet hell gameplay elements, providing the player with a small hit box and swarms of particles to evade. Most of the bullets come in patternless waves with the exception for the mini-bosses and stage bosses which feature more regular patterns. The player may choose from three different ships each with a different spead setting, and may also choose from three different weapons: spread gun, homing laser, and bubble cannon. Each of these weapons features different ranges and speeds, so the player must utilize different strategies with them. They can also be powered up throughout the game. Once the game is started, the player is equipped with their main weapon, sword, and shield. The short-range sword can be used to destroy the same bullets and enemies the guns can destroy, but can also deflect items. This deflection mechanic allows the player to \"juggle\" items and power-ups until they are desired. When not firing, the terminal suit will automatically deploy a shield which can be used to deflect certain enemy bullets. A combo bar, which determines the score multiplier, can be increased by either using the shield to harvest energy from bullets or enemies or using the ABSNET shield, a weapon similar to Giga Wing or Mars Matrix which eliminates all minor enemies and projectiles on the screen. In order to use the ABSNET shield, the player gather blue items which drop from destroyed enemies to fill the ABSNET gauge. The combo bar slowly dissipates over time", "platform": "Nintendo GameCube", "release_date": "October 13, 2005", "game_type": "Released", "esrb": "Not Rated", "developers": "Milestone", "publishers": "Milestone", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "3.68", "wikipedia": "https://en.wikipedia.org/wiki/Radirgy", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45260-radirgy-generic\n"}