{"altername_name": ["Disney-Pixar Ratatouille"], "name": "Ratatouille", "overview": "Ratatouille is based on the Pixar film of the same name. The version by Asobo Studio is, like other versions, a 3D platform game, but has its own design, levels and missions. The game follows the plot of the film only loosely, but has the main voice cast from the movie reprising their roles. The player controls Remy, a rat with a refined sense of taste. When Remy finds himself in Paris near the restaurant of the famous deceased chef Gusteau, he works on making his dream of becoming a chef himself come true, while helping out his fellow rats to procure food. While many of the environments in the game are similar to those in the next-generation version, this version has almost none of the open world elements seen in the other title, with smaller levels and mostly linear progress. To get around in the various levels that include the sewers, streets and rooftops of Paris, the restaurant kitchen and a food market, Remy can jump and double-jump, swing along poles, balance on ropes, crawl on certain walls and defend himself with tail swipes or by using spoons as weapons. He can also engage his keen sense of smell, which displays the path to the next goal or objective. Sometimes, Remy must evade guards by hiding out of sight until their attention wanes. Other sequences in the levels involve sliding down pipes, rafting through water currents and fleeing from humans that chase Remy. Another large part are mini-games, many of which involve cooking, with Remy having to pick ingredients or peel potatoes. There are some optional bonus missions, taking the form of dream sequences, in which Remy navigates landscapes made of foodstuffs. All levels include many collectibles. In most levels there will be up to 100 stars to collect. Special items in certain levels include batteries, darts or lightbulbs. Collecting all of a certain kind of item in an area awards bonus points, which can be spent in Gusteau's shop to unlock bonuses, including various kinds of artwork as well as the possibility to play the mini-games outside the main game, in both single and multiplayer modes.", "platform": "Nintendo GameCube", "release_date": "June 26, 2007", "game_type": "Released", "esrb": "E - Everyone", "developers": "Heavy Iron Studios", "publishers": "THQ", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "3.92", "wikipedia": "https://en.wikipedia.org/wiki/Ratatouille_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30856-ratatouille\n"}