{"altername_name": [], "name": "Shaman King: Soul Fight", "overview": "Shaman King: Soul Fight! is a 2003 cel-shaded fighting game with turn-based strategy elements for the Nintendo Gamecube developed by Tuning Electronic, and published by Bandai. It is based upon the anime and manga Shaman King, written by Hiroyuki Takei. It follows the journey of Yoh Asakura and his friends in the quest to become Shaman King. There are 26 characters and five game modes to choose from: \"Story Mode\", \"Shaman Fight Mode\", \"Tutorial Mode\", \"Shaman King Mode\" and \"Omake Mode\". Soul Fight is one of the only console games developed by Tuning Electronic, a company which has developed a small number of low-budget arcade games. This game sold well in Japan and even gained a \"Bandai The Best\" version, but never made it to the US due to Konami securing exclusivity rights to video games for the franchise in the west. Players may choose from a cast of 20+ characters featured in the series to do battle. Fighting is essentially a game of rock-paper-scissors. Characters have 3 different attacks with attributes that may be customized to their liking. Attacks are chosen and played out on-screen by the characters who are indirectly controlled. Successful attacks build a crystal meter to launch cinematic specials that come in three levels, each a step up in strength from the last. The game also features a lengthy fully voiced story mode that follows the anime and a character training mode. There are a variety of unlockables, including much of the playable cast as hidden characters.", "platform": "Nintendo GameCube", "release_date": "March 28, 2003", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Bandai", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "2.93", "wikipedia": "https://en.wikipedia.org/wiki/Shaman_King:_Soul_Fight", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/45263-shaman-king-soul-fight\n"}