{"altername_name": ["Los Sims 2", "Die Sims 2"], "name": "The Sims 2", "overview": "The Sims 2 is a 2004 strategic life simulation video game developed by Maxis and published by Electronic Arts. It is the sequel to the best-selling computer game The Sims. The game has the same concept as its predecessor: players control their Sims in various activities and form relationships in a manner similar to real life. The Sims 2, like its predecessor, does not have a defined final goal; gameplay is open-ended. Sims have life goals, wants and fears, the fulfillment of which can produce both positive or negative outcomes. All Sims age, and can live to 90 sim days depending on the degree to which their aspirations are fulfilled. The Sims 2 builds on its predecessor by allowing Sims to age through six stages of life and incorporating a 3D graphics engine. Although gameplay is not linear, storylines exist in the game's pre-built neighborhoods. Pleasantview is based 25 years after the town in the original The Sims. Strangetown's storyline is based on the supernatural, and is loosely connected with Pleasantview. Veronaville's characters are based on Shakespearean characters. The Sims 2 was first released on September 14, 2004 for Microsoft Windows. A port to Apple Mac OS X was released on June 17, 2005. Eight expansion packs and nine stuff packs were subsequently released. In addition several console versions have been released. The Sims 2 is offered on mobile platforms, with manufacturers such as Nokia offering The Sims 2 from the Ovi Store. A sequel, The Sims 3, was released in June 2009. The Sims 2 was a commercial success, selling one million copies in its first ten days, a record at the time. During April 2008, The Sims 2 website announced that 100 million copies of The Sims series had been sold. The Sims 2 was well received by critics, gaining a 90% score from aggregators Metacritic and GameRankings. As of March 2012, The Sims 2 has sold at least six million PC copies and 13 million over all platforms, making it one of the best-selling PC games of all-time.", "platform": "Nintendo GameCube", "release_date": "October 24, 2005", "game_type": "Released", "esrb": "T - Teen", "developers": "Maxis Software", "publishers": "Electronic Arts", "genres": "Life Simulation", "max_players": "2", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/The_Sims_2", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30865-the-sims-2\n"}