{"altername_name": ["Nickelodeon The Adventures of Jimmy Neutron: Boy Genius: Jet Fusion"], "name": "The Adventures of Jimmy Neutron: Boy Genius: Jet Fusion", "overview": "The Adventures of Jimmy Neutron: Boy Genius - Jet Fusion is a platforming action game based on the Nickelodeon special of the same name. In the game the player needs to jump, shoot, and collect a variety of objects to create multiple inventions as you traverse level to level solving puzzles, defeating various villains, and even taking control of Jimmy's robot dog, Goddard, with upgrades like riding him as a bike or taking him to the skies. Major and minor inventions exist to enable your progression through each of the game's five worlds; with the major inventions being crucial to defeat the boss in every world. The minor inventions help you to defeat the various enemies and obstacles you'll encounter throughout. All the minor inventions feature a primary and secondary action to further your options for weaponry or to traverse through the various areas Jimmy will need to go through to save his world from peril. The plot sees Jimmy Neutron posed with an assignment to write a book report for school but, instead, he decides to invent a device by the name of the Virtual World Reproduction Machine, which is designed to show any book that you put into it like it's a movie. During his presentation, Jimmy places a Jet Fusion book into the machine to demonstrate the device to his class. However, this leads it to malfunction, turning the town of Retroville into a virtual world. Professor Calamitous, Jimmy's arch enemy, kidnaps the top-secret government agency spy Jet Fusion, who's more known to the public as the popular actor from the Jet Fusion films. It's now up to Jimmy to save Jet and his world from being taken over by the evil Calamitous.", "platform": "Nintendo GameCube", "release_date": "September 16, 2003", "game_type": "Released", "esrb": "E - Everyone", "developers": "Krome Studios", "publishers": "THQ", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.32", "wikipedia": "https://en.wikipedia.org/wiki/The_Adventures_of_Jimmy_Neutron_Boy_Genius:_Jet_Fusion", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30728-the-adventures-of-jimmy-neutron-boy-genius-jet-fusion\n"}