{"altername_name": ["Seigneur des Anneaux, Le - Le Retour du Roi", "Der Herr der Ringe: Die Rueckkehr des Koenigs", "Lord of the Rings: Ou no Kikan", "El Senor de los Anillos: El Retorno del Rey", "El Señor de los Anillos: El Retorno del Rey", "Il Signore degli Anelli: Il ritorno del Re", "Signore degli Anelli, Il: Il ritorno del Re", "Senor de los Anillos, El: El Retorno del Rey", "Herr der Ringe, Der: Die Rueckkehr des Koenigs"], "name": "The Lord of the Rings: The Return of the King", "overview": "The Lord of the Rings: The Return of the King is a 2003 action/hack and slash video game developed by EA Redwood Shores for the PlayStation 2 and Windows, by Hypnos Entertainment for the GameCube and Xbox, by Griptonite Games for the Game Boy Advance, by JAMDAT for mobile, and by Beenox for Mac. The game was published by Electronic Arts. It is a sequel to the 2002 game The Lord of the Rings: The Two Towers. The game is an adaptation of Peter Jackson's 2002 film The Lord of the Rings: The Two Towers and his 2003 film The Lord of the Rings: The Return of the King, which was released shortly after the game. As it is not an adaptation of J. R. R. Tolkien's 1954 novel, The Return of the King, the third volume in his Lord of the Rings trilogy, anything from the novel not specifically mentioned or depicted in the films could not be represented in the game. This is because, at the time, Vivendi Universal Games, in partnership with Tolkien Enterprises, held the rights to the video game adaptations of Tolkien's literary works, whilst Electronic Arts held the rights to the video game adaptations of the New Line Cinema films. The game is similar to its predecessor in basic gameplay, but differs by adding multiple storylines, more playable characters and increased interaction with environments. A two-player co-op mode is also available for some missions. As with The Two Towers, The Return of the King was developed in close collaboration with the filmmakers, using many of the actual reference photos, drawings, models, props and other assets from the film. The game was met with positive critical reception for its graphics, audio, and gameplay, although its camera positioning and short length were criticized.", "platform": "Nintendo GameCube", "release_date": "November 5, 2003", "game_type": "Released", "esrb": "T - Teen", "developers": "Hypnos Entertainment", "publishers": "Electronic Arts", "genres": "Adventure", "max_players": "2", "cooperative": "No", "rating": "4.17", "wikipedia": "https://en.wikipedia.org/wiki/The_Lord_of_the_Rings:_The_Return_of_the_King_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/6766-the-lord-of-the-rings-the-return-of-the-king\n"}