{"altername_name": [], "name": "13 Ghosts", "overview": "As the Great Venicksia, legendary conjuror and Ghost Exterminator Extraordinaire, you may have finally met your match. This town is crawling with ghosts! Stepping off the train at the depot, your objective is walk to the haunted house and back, blasting as many ghosts as you can along the way. Your weapon is your own design, a \"Ghost Blaster,\" capable of steady fire, though short, controlled bursts are the better option. The ghosts, of course, want you to panic. They're here to scare you to death, and to that end, each one that escapes will awaken the next, more dangerous ghost. When the thirteenth ghost appears, it's curtains for you. This early first-person shooter presents you with a panoply of ghosts in classical forms drifting and darting across the detailed backdrop of a Western ghost town. As you shoot ghosts, you advance across the backdrop: bigger steps for more dangerous ghosts. Your passage is made more complicated by a laughing ghost whose head pops up briefly and must also be shot to prevent the ghost counter from ticking forward. Some help is provided by spiders, of whom the ghosts are afraid; shoot a spider and the ghost counter goes down, though then ghosts swarm back _en masse_. Your Ghost Blaster is represented by a movable sight on the screen, but it takes more than just a quick trigger finger to hit a ghost. You must lead your targets. This is the only sense of depth the game screen gives, except when that final ghost comes rushing out to get you. Each pass through town is rewarded with a musical refrain, which changes from level to level. A successful round trip moves you up one level, which changes the background slightly and treats you to clever names like \"Dead of Night\" and \"Good Mourning.\" There are bonus trips to be discovered and even a secret behind the appearance of spiders and the mysterious laughing head. If you beat all thirty-two levels, you are truly a Ghost Exterminator Extraordinaire.", "platform": "Tandy TRS-80", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Software Affair", "publishers": "Tandy Corporation", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.85", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75805-13-ghosts\n"}