{"altername_name": [], "name": "Close Assault", "overview": "From a time when the best graphics a computer game offered were on the front cover of the box, Avalon Hill's Close Assault offers a hybrid computer/board game experience by enclosing cardboard counters and a playing board. The result, per the manual, is a \"visual impact... much greater than on even the best of computer graphics displays\" while freeing for the processor, \"a huge amount of limited resources\" normally used to manage the graphical interface. Those resources instead are devoted to accounting for every soldier engaged in the scenario, and fulfilling a dream of the era's simulation board-gamers: realism in what you know and when you know it. In Close Assault, your opponent's units appear on the board only when they are spotted by yours, their morale is only evident by their behavior, and only your experience will tell you the odds of success. This is a far cry from the usual board simulation experience, where you could pour over combat success tables and footnoted modifiers to judge exactly where the chances break in your favor, and use the morale markers on your opponent's front line to decide where to push. Close Assault's combination of three scenarios and three forces allows representation of a dozen different historical situations spanning northern Europe in World War II. Squad-level tactics are simulated on a common map showing a small village and three levels of topography. Commands are entered numerically or as single letters in response to computer prompts, as each player proceeds through six phases of hotseat turns -- units moving, firing, and reacting -- which represent two minutes of battle. As the computer kicks out the results of your gambles and guesses, counters come and go on the map, squads being spotted and routed or destroyed. In that way, the game is a genuine hybrid, flicking players' attention back and forth between the cardboard map and the computer screen. Units also come and go from your command: when they become demoralized or enter close combat, the computer takes over. Meanwhile, the manual comes straight out of the board-game simulation tradition, outlined by topic and case with occasional lessons in history and battle science, such as (regarding morale), \"beneath the surface of any organized army lies a terrified mass of men who long for home and peace\". The game experience would be limited to the standard armchair-lieutenant's view, but for a simple number noted on the squad record pad (an analog device to help the humans remember casualties, equipment, experience, and leader placement). The number represents you on the battlefield. Somehow, this simple mechanism effectively engrosses players in the course of the battle. If you become a casualty, the computer finishes the scenario for you while you watch, possibly even carrying your soldiers to victory if you left your sergeants well-positioned. Besides two-player hot-seat, solitaire is available, wherein the programmers put the computer's capable calculations to work on multi-turn tactics, nuanced with the historical characteristics of the opposing nationalities, from equipment to morale to battle tactics.", "platform": "Tandy TRS-80", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Microcomputer Games", "publishers": "The Avalon Hill Game Company", "genres": "Strategy", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Close_Assault", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367606-close-assault\n"}