{"altername_name": [], "name": "Cosmic Fighter", "overview": "Cosmic Fighter was loosely based on Astro Fighter, which was released by Data East in 1980. In many ways, Cosmic Fighter looks similar to Galaxy Invasion. However, the similarities are superficial and the games are very different. Your goal in Cosmic Fighter is to shoot the aliens as they descend from the top of the screen. Unlike Galaxy Invasion, you have a limited fuel supply which is used up as you move and shoot. A gauge at the top of the screen indicates how much fuel you have left. Your ship can be destroyed either by hitting an alien or shot or by simply running out of fuel. You are not likely to run out of fuel in the earlier levels of the game, but it does becomes an increasing problem in the later levels. At the start of the game, an alien can be destroyed with a single one shot. In the later levels, it takes two or more shots to destroy an alien. If you successfully destroy all of the aliens in a wave, then you move to the next wave. If some aliens do escape, then you still move to the next wave but your ship is positioned higher on the screen. This makes the game much harder because you have less time to shoot before the aliens can escape. After finishing a certain number of waves, you are required to dock your ship with a space station in order to refuel. The space station emerges from the side of the screen. It’s a bad idea to try to destroy the space station; if even a single shot hits it, it will promptly destroy you. Once you press the D key, your ship will rise to meet the space station. The ship needs to be matched up just right or you will miss the docking area and smash against the space station. To complicate matters, a Flagship usually shows up at this point. But curiously, the Flagship doesn’t seem to want to shoot at you, instead reserving its wrath for the space station. It fires repeatedly at the station and gets in your way while you are attempting to dock. It is very difficult to shoot the Flagship because if you miss and hit the space station, the space station will destroy you. After a successfully docking, the game continues at a higher difficulty level.", "platform": "Tandy TRS-80", "release_date": "1980", "game_type": "Released", "esrb": "Not Rated", "developers": "Bill Hogue", "publishers": "Big Five Software", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=LpZ1jD4av28", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84923-cosmic-fighter\n"}