{"altername_name": ["Computer Foreign Exchange"], "name": "Foreign Exchange", "overview": "Computer Foreign Exchange is a conversion of Avalon Hill's own 1979 board game. It retains all the original rules and options and can be played by two to four players but does not feature any AI opponents. Each player takes control of a business with assets all around the world. The game world consists of 24 cities in nine countries which are evenly divided between the players. Each player has when starting out one sales office in each controlled city. The first phase of the game is a trading session where players can trade cities they control. Players should attempt to hold all cities within one country since that allow them to build manufacturing subsidiaries and thereby increase profits. After the trading session the players take turns planning their strategies for each fiscal year. There are several options that can be made: purchase sales offices or manufacturing subsidiaries, hedge foreign assets, borrow foreign currencies, use a cash management consulting service, sell sales offices or manufacturing subsidiaries, use a foreign exchange advisory service and list ownership and assets of each city. After the planning has been completed players enter their jets and fly to the different cities. Player can control this by holding down the spacebar to fuel the jet and the longer it is held down the longer it will fly. If players land in an opponent's city they have to pay for it. The game goes on until one player has reached a target amount of money. The target is based on which difficulty level (1-9) is chosen before the start of a game. The higher the difficulty the more net worth is required to win.", "platform": "Tandy TRS-80", "release_date": "1982", "game_type": "Released", "esrb": "", "developers": "Microcomputer Games", "publishers": "Avalon Hill", "genres": "", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/293305-foreign-exchange\n"}