{"altername_name": [], "name": "Galaxy Invasion", "overview": "Many people thought that Galaxy Invasion was based on Space Invaders (including a reviewer for 80 Microcomputing), but this was a common misconception. Galaxy Invasion was based on the arcade game Galaxian, which was released by Namco in 1979. Galaxy Invasion was the first Big Five Software game to feature sound and music. In addition to the tune that plays during the title screen, there are many different sounds during the transitions between screens and when shots are fired. The game starts with your ship at the bottom of the screen and a formation of different kinds of aliens at the top. You move your ship from side to side and you can fire up (although only one shot at a time). The aliens periodically attack by swooping down and dropping bombs on you. You receive points for shooting an alien, and double points if you shoot it while it is attacking. What makes the game interesting is the distinctive behavior of the aliens. Each type of alien has a slightly different role and behavior. For instance, one type of alien acts as a bodyguard to the Flagship. Galaxy Invasion features the return of the Flagship, last seen in Super Nova. If you don’t destroy one of the Flagships on screen within a set time, then a “Flagship Attack Alert” starts. An continuing alert sound signals to you that a Flagship must be destroyed. If the “Flagship Attack Alert” expires before you can destroy a Flagship, then all of the Flagships on screen will fire lightning bolts at you. Unlike the lightning bolts in Super Nova, these are always fatal. After you pass 200,000 points, the “Flagship Attack Alert” is on all the time that a Flagship is on screen. As your score increases, more Flagships fill the top row of the screen until they occupy it completely. Galaxy Invasion is one of my favorite TRS‑80 games. It takes full advantage of the limited resolution of the TRS‑80 screen and actually makes that work to its advantage. In my opinion, the combination of smooth gameplay and clever sounds makes it one of the best example of a TRS‑80 game ever written. This was the first game designed by Bill Hogue, who went on to develop the classic early 80s platform game, Miner 2049er.", "platform": "Tandy TRS-80", "release_date": "1980", "game_type": "Released", "esrb": "Not Rated", "developers": "Big Five Software", "publishers": "Big Five Software", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=6jj1C93rmvw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84925-galaxy-invasion\n"}