{"altername_name": [], "name": "In the Hall of the Mountain King", "overview": "In a sister game to Voyage of the Valkyrie, developer Leo B. Christopherson puts you back in the role of a buck private in the renowned Space Vikings. Norse folklore is again prominent, the plot borrowed from the Peer Gynt story. You must rescue the princess Anitra, held for ransom by the rogue Mountain Troll King, and as a parting gesture leave a bomb to destroy the entire Troldhjem Kingdom. The catch is that Anitra won't come with you unless you charm her with jewelry, so you'll need to find some along the way. Also, keep an eye out for the scattered pieces of the bomb; all seven are necessary. These are hidden in the Norwegian Circle Maze you'll have to navigate to find the Hall of the Mountain King. Given that it comprises forty-one circles, each intersecting up to six others, you'll probably see most of it a few times over before arriving at your destination. Mapping your route is important, because while the actual rescue just requires reaching the hall, escaping means finding your way out before that bomb goes off. As you might expect, there are also trolls in the Troll Kingdom: big ones with guns. Fortunately your little rail car which rides the tracks of the circle maze not only has a defense shield, but is quick enough to back out of any battle which gets a little too hot. Combat is a first-person view of the troll -- looking rather like Christopherson's Dancing Demon -- jumping back and forth and blasting at you, while you maneuver crosshairs to shoot him in the heart. This alternates with a status screen showing your address within the maze, rank, treasure and items collected, and body count. Bring back enough treasure and you could retire as the Prince Regent. As the title implies, Edvard Grieg's Peer Gynt Suite provides brief musical interludes. Five levels of difficulty and seven variations on the fixed maze scale the challenge, which is single-player only. A sealed map is included in the booklet for those who become understandably desperate, and there's also a cheat key to start you at the climax scene.", "platform": "Tandy TRS-80", "release_date": "1982", "game_type": "Released", "esrb": "", "developers": "Leo Christopherson", "publishers": "Radio Shack", "genres": "", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/298997-in-the-hall-of-the-mountain-king\n"}