{"altername_name": ["Meteor Mission II"], "name": "Meteor Mission 2", "overview": "Meteor Mission 2, also known as Meteor Mission II, was based on Taito’s 1979 Lunar Rescue, although it differs from it in many ways. Despite the name, Meteor Mission 2 is not a sequel to Bill Hogue‘s earlier Meteor Mission. Amusingly, the first Alpha Products advertisement to feature Meteor Mission 2 mistakenly used pictures from Meteor Mission instead. The goal is to rescue astronauts who are stranded on the surface at the bottom of the screen. Your mission has two parts: the first is to pilot the spaceship and land it on one of the landing pads at the bottom of the screen. The second part is to carry the rescued astronaut to the space station at the top of the screen. To complicate matters, meteors move constantly through the playing field. You ship will be destroyed if you hit a meteor. Unlike Lunar Lander, there is no need to slow down the spaceship before it touches the landing pad. In fact the landing speed makes no difference at all. The only ways to crash are to hit a meteor, the sides, or the ground. After landing and rescuing an astronaut, you need to ascend to the Space Station. The lander climbs gradually, but you can increase the speed by using the fire button. The fire button also fires a shot, which allows you to destroy asteroids that are in your way. You can gain points by shooting the asteroids, but moving to try to intercept meteors increases the difficulty. Occasionally, an asteroid will start flashing. After flashing for a while, the asteroid will turn into a Flagship. The Flagship doesn’t shoot at you, but it does get in the way as it moves across the screen. It is worth many extra points, but mostly serves as a distraction. After a certain point in the game, meteor showers start appearing. These showers are very frustrating, because there often isn’t time to get out of their way before they hit you. After you rescue all of the astronauts, the round ends and you receive a bonus. The landing pads are rebuilt and the process starts again.", "platform": "Tandy TRS-80", "release_date": "1980", "game_type": "Released", "esrb": "Not Rated", "developers": "Big Five Software", "publishers": "Big Five Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=8yW_lB6na1k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84928-meteor-mission-2\n"}