{"altername_name": ["Robot Attack (1981)(Bill-Hogue)"], "name": "Robot Attack", "overview": "Robot Attack was based on the arcade game Berzerk, which was released by Stern Electronics in 1980. The game concept itself is older than that, and can be found in any number of BASIC games, such as Chase, Robots, and Daleks. Robot Attack was notable as the first talking game released by Big Five Software. The game supports the TRISSTICK and Alpha Joystick, but not the original STICK-80 (unless you perform a hardware modification to it). In my opinion, it makes the best use of the joystick of any TRS‑80 game. One of the most distinguishing features of Robot Attack is the voice, which is that of Bill Hogue himself. The speech is especially remarkable when you consider that encoding voices for arcade games was incredibly expensive at that time; the voices in Berzerk are estimated to have cost tens of thousands of dollars. The disk version of Robot Attack has much longer sections of speech, including the impressive: “Great Score, Player 1. You have achieved the highest score so far. Enter your initials carefully so that we may save them permanently.” Robot Attack features an extended scrolling title sequence (think of Star Wars). This sequence leads into an impressive transition to the title screen. At the beginning of the game, you are in a room that is stocked with robots. The goal is to destroy as many robots as possible and exit the room. The faster you clear the room, the more bonus points you receive. The walls to the room are electrified and will destroy you if you touch them. The robots are also deadly to your touch. What makes it interesting is that the robots are also destroyed if they touch the walls. You receive points for each robot destroyed, even if it walked into a wall on its own. Different robots have different behaviors. Some stay in the same spot and others move towards the player. By observing their behaviors, you can often fool the robots into walking into a shot or the wall. You can sometimes clear a room without firing a single shot. At the beginning of the game, the robots don’t shoot at all. But once the score passes 1000 points, the robots do start shooting. This makes the game much more difficult. The robots are indiscriminate with their shots; they will shoot other robots if they get in the way. You can often use this to your advantage. After a certain amount of time has passed, the Flagship appears. Contrary to its behavior in previous Big Five Software games, the Flagship fires no shots and can’t be destroyed. Instead, it steadily moves towards you, moving through walls and destroying any robots in its path. This puts a definite time limit on each level; you have to flee the room or be destroyed. The Flagship follows your movements, which means that clever players can make the Flagship touch and destroy robots left in the room. If you beat one of the high scores, then you can add your name to the scoreboard. The high scores are displayed graphically and they scroll like the title text. The disk version permanently saves these scores.", "platform": "Tandy TRS-80", "release_date": "1981", "game_type": "Released", "esrb": "Not Rated", "developers": "Big Five Software", "publishers": "Big Five Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=li-67gJBEXE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84929-robot-attack\n"}