{"altername_name": [], "name": "Scarfman", "overview": "Scarfman was based on the arcade game Pac-Man, which was released by Namco in 1980. It was written by Philip Oliver and distributed by the Cornsoft Group. The Cornsoft Group also released a version of Scarfman for the Color Computer. The game starts with you (the “Scarfman”) at the bottom of the screen. Like Pac-Man, the goal of Scarfman is to eat all of the dots on the screen. You earn points for every dot eaten. Five monsters start out at the top of the screen, initially with their eyes up. When in the eyes up state, monsters move quickly and chase you. You lose a life if one touches the Scarfman. But if you eat one of the pluses scattered through the screen, all of the monsters lower their eyes. When in the eyes down state, monsters move more slowly, run away from you, and are vulnerable to being caught. If you catch a monster, it returns to the top of the screen with its eyes up again. The eyes down state doesn’t last for long; all of the monsters revert to the eyes up state after only a short time. The monsters shimmer just before they revert, giving you a bit of warning. Clearing a screen by eating all of the dots and pluses moves you to a new screen. The difficulty level becomes significantly greater with each new screen. The monsters become smarter and the amount of time it takes for them to revert to the eyes up state becomes shorter. The Model III cassette version of Scarfman came with an extra instruction sheet listing the two BASIC commands needed to enable the Model III expansion bus. TRS‑80 joysticks, such as the TRISSTICK, used the expansion bus but it wasn’t automatically enabled by the cassette version of Scarfman. This wasn’t a problem for the disk version. Scarfman is one of my favorite TRS‑80 games. It has a nice feel, with very fluid movement that works well with a joystick. It uses minimal, but appropriate sound effects. I think it is the best of the Pac-Man games for the TRS‑80.", "platform": "Tandy TRS-80", "release_date": "1981", "game_type": "Released", "esrb": "Not Rated", "developers": "The Cornsoft Group", "publishers": "The Cornsoft Group", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Scarfman", "video_link": "https://www.youtube.com/watch?v=goqHUsPFAk0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84930-scarfman\n"}