{"altername_name": ["Interactive Fiction #1 - Six Micro Stories"], "name": "Six Micro Stories", "overview": "Six Micro Stories is number one in the \"Interactive Fiction\" series and contains six adventure style interactive fictions. The game is largely text based. At various plot points, the player is presented with several branching options for game play, with many incorrect choices leading to a non-ideal ending. The game uses a input format that encourages the character to respond in context, and attempts to pick out key elements to determine the player's true intent. The six stories are: Encounter in the Park - You attempt to woo a beautiful woman you meet rollerskating in the park. The Fatal Admission - You play as an American spy in 1942, who has parachuted into Germany, and is impersonating a famed Nazi colonel. You must convince the suspicious Admiral Kurtz that you are not an impostor. The Unexpected Question - You are a computer science PhD at Regalia University taking your final examination. You know everything about computers, but can you survive a question involving the liberal arts? At a high class luncheon, you catch the recently paupered Susan Braithwate stealing silverware. While trying to return the expensive cutlery, you are exposed. How do you respond? You are the owner of a luxurious, but soon to be defunct shipping company. The wealthy Pentameter Alexandros wishes to buy out your firm, not knowing your financial straits. Can you outwit him? The Empty World - You play as an airline pilot, who must address the passengers aboard the plane before it crashes into the sea.", "platform": "Tandy TRS-80", "release_date": "1980", "game_type": "Released", "esrb": "Not Rated", "developers": "Robert Lafore", "publishers": "Adventure International", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367593-six-micro-stories\n"}