{"altername_name": [], "name": "Starfleet Orion", "overview": "Starfleet Orion is a science fiction-based wargame, and is the earliest known game of its kind sold for home computers. It depicts battles between fleets of space ships belonging to the Stellar Union on one side, and the Confederation of Orion on the other side. The game requires two players (there is no AI opponent) and includes 12 increasingly complex scenarios and 22 different ship types. The battles take place on a 32 x 64 grid. Players enter their commands one after another, and the turns are then executed simultaneously. A scenario ends when one (or both) party's ships are destroyed or have escaped the play field. Each ship has a limited energy supply which must be divided between systems, including propulsion, weapons and shields. Armaments include beam weapons, missiles and torpedoes. The beams' effectiveness decreases with distance. Missiles are targeted to a specific grid location and then explode, regardless of whether a target is present or not. Torpedoes can only be targeted in a general direction, and explode if they pass within two grids of a possible target. Some ships also include squads of smaller starfighters that can be launched. Another useful tool is a tractor beam, which can be used to push other ships into or out of the way of launched weapons, or can accelerate fighters towards their target. In tape versions of the game, the scenarios have to be typed into the included scenario editor from the manual and saved to a separate tape before playing, whereas disk versions include the scenarios as finished files. The editor can of course also be used to construct new scenarios. Less", "platform": "Tandy TRS-80", "release_date": "1979", "game_type": "Released", "esrb": "", "developers": "Automated Simulations", "publishers": "Automated Simulations", "genres": "", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/349144-starfleet-orion\n"}