{"altername_name": ["Super Nova (1980)(Big-Five-Software)"], "name": "Super Nova", "overview": "Super Nova was based on the very popular arcade game Asteroids, which was released by Atari in 1979. It was the first big success for Bill Hogue and Big Five Software. Super Nova was originally available only on cassette tape. It required a Model I with 16K and Level I or Level II BASIC. Later, Big Five sold a disk version which saved high scores and required a 32K Model 1. They also sold both cassette and disk versions for the Model III. Rather than the arrow keys, Super Nova uses the R, T, O, and P keys to control the player, and the SPACEBAR to activate hyperspace. This might sound awkward, but it is actually quite easy to use and similar to the five keys used by the arcade Asteroids. Super Nova was so popular that other TRS‑80 games supported these keys as well. Later versions of Super Nova supported a joystick, but I think that the keyboard control works better for this game. At the start of Super Nova, you control a spaceship at the center of the screen. Large, slow moving meteors surround you and will destroy your ship if they hit you. You can move and shoot in all directions and you can fire multiple shots at once. If you shoot a large meteor, it will break into a smaller meteor. There are three sizes of meteors, each with a different point value. Smaller meteors tend to move faster than the larger ones. After you destroy all of the meteors on the screen, a new set of large meteors appear and the process repeats. To complicate matters, alien ships appear after the screen is mostly cleared of meteors. These ships are worth more points than the meteors, but they shoot back at you. Notice the names of two of the types of alien ships: BH (Bill Hogue) and JLK (Jeff L. Konyu). The smaller screen size of Super Nova compared to Asteroids means different strategies apply. My favorite technique is to destroy all but three or four of the small meteors that are slower than the rest. I then wait and destroy the aliens as they appear, being careful not to destroy the small meteors in the crossfire. Not going through the cycle of a new set of large meteors makes it easier to build up the your score faster. Of course, missed shots and shots by the aliens will eventually destroy the rest of the meteors. Super Nova features the first appearance of the Flagship, an alien ship which became an iconic figure in the Big Five games. In Super Nova, it starts appearing after the score passes 10,000 points. Unlike the other aliens, the Flagship fires lightning bolts at the player instead of shots. These bolts are impossible to dodge, and the Flagship tends to destroy the player after three of four bolts. Sometimes it just takes one bolt. The Flagship (usually along with the lightning bolts) appeared in all subsequent TRS‑80 games written by Bill Hogue.", "platform": "Tandy TRS-80", "release_date": "1980", "game_type": "Released", "esrb": "Not Rated", "developers": "Big Five Software", "publishers": "Big Five Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=p3s4PJ9dsYI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84932-super-nova\n"}