{
  "name": "Fix-It Felix Jr.",
  "shortName": "fix-it-felix-jr_",
  "description": "<i>Fix-It Felix Jr.</i> is a homebrew game that presents itself as a port of the fictional 1984 game of the same title by the fictional TobiKomi Corporation from the 2012 animated <a href=\"https://www.mobygames.com/search/quick?company=Disney\">Disney</a> movie <i>Wreck-it Ralph</i>. The gameplay draws inspiration from titles like <a href=\"https://www.mobygames.com/search/quick?game=Donkey+Kong\">Donkey Kong</a> and <a href=\"https://www.mobygames.com/game/wrecking-crew\">Wrecking Crew</a>.<br><br>At the start of the game a mad Ralph is awoken when his stump is moved for the construction of a large apartment building called Niceland. Ralph goes to the building and smashes its windows. It is now up to Felix it to fix that. The building consists of several levels that are presented as fixed, single screen. At the start of the level Felix has 45 seconds to fix all windows on three floors. He can move freely and jumps up or moves down. Meanwhile Ralph moves around on the top level and drops bricks that hurt Felix, who starts with three lives. Every hit removes one.<br><br>Points are scored by fixing the windows with bonus points for the remaining time. When done the game moves to a new screen at a higher level. Gradually new elements are introduced such as birds that fly in a horizontal line and appear from the side of the screen. The game keeps track of the high score and the game can also be played in a Marathon mode. The game is completed when five levels all cleared. Felix then receives a medal at the top of the building and the game is restarted with a higher speed, with the score kept.<br><br>The game was released on a cartridge in two small print runs. In the second run some bugs were fixed. It is not identical to <a href=\"https://www.mobygames.com/search/quick?game=Fix-It+Felix+Jr%2e\">the game of the same name</a> released in the same year by <a href=\"https://www.mobygames.com/search/quick?company=Future+Driver\">Future Driver</a>.",
  "publishedBy": "Airwalk Studios",
  "developedBy": "Airwalk Studios",
  "released": "2013",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Fangame",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/fix-it-felix-jr_",
  "visual": "",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "Airwalk Studios",
          "developer": "Airwalk Studios",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2013",
          "ean13": "",
          "comments": "cartridge version (mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}