{
  "name": "Handy Harvy",
  "shortName": "handy-harvy",
  "description": "<i>Handy Harvy</i> is an arcade action homebrew Genesis title that draws inspiration from titles like <a href=\"https://www.mobygames.com/search/quick?game=Donkey+Kong\">Donkey Kong</a> and <a href=\"https://www.mobygames.com/game/wrecking-crew\">Wrecking Crew</a>, but also <a href=\"https://www.mobygames.com/game/fix-it-felix-jr\">Fix It Felix Jr.</a> from the <a href=\"https://www.mobygames.com/search/quick?company=Disney\">Disney</a> movie <i>Wreck-it Ralph</i>. Although it was released after the NES game <a href=\"https://www.mobygames.com/game/getem-gary\">Get'em Gary</a> by the same developer, development on the Genesis title was started first.<br><br>Rusty kidnaps a blonde girl and climbs a building with her, destroying windows on the way. It is up to Harvy to get to Rusty and fix the windows in the meantime. Each level is a single building that consists of several fixed, single screens. Harvy starts at the bottom and needs to fix all broken windows on three levels to win the section and move on to a higher part in the next screen. This continues until the roof of the building is reached, the girl is brought back and Rusty is defeated.<br><br>Harvy only has 75 seconds to win a screen with multiple ledges. He can also only climb up when there is a pipe and sometimes there are statues that block the way. In the meantime Rusty moves about on the highest ledge and constantly drops projectiles that hurt Harvy and take away one of his three starting lives. Points are scored by fixing windows, winning screens and winning levels. Every now and then bonus items appear that need to be picked up quickly before they disappear, such as additional times or lives.<br><br>The game contains a cooperative two-player multiplayer mode with a second player controller Gary and simultaneous gameplay.",
  "publishedBy": "Second Dimension R&amp;T, LLC",
  "developedBy": "Second Dimension R&amp;T, LLC",
  "released": "Apr 08, 2018",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/handy-harvy",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "Second Dimension R&amp;T, LLC",
          "developer": "Second Dimension R&amp;T, LLC",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Apr 08, 2018",
          "ean13": "",
          "comments": "cartridge version (mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/652555-handy-harvy-genesis-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Genesis"
    }
  ]
}