{
  "name": "Little Medusa",
  "shortName": "little-medusa",
  "description": "<i>Little Medusa</i> is an action puzzle game with gameplay similar to titles like <a href=\"https://www.mobygames.com/search/quick?game=Adventures+of+Lolo\">Adventures of Lolo</a> and <a href=\"https://www.mobygames.com/game/kickle-cubicle\">Kickle Cubicle</a>. Artemiza is a goddess and the daughter of Zeus. She is also the successor to his throne on Mount Olympus. She is very vain and Fiora, the goddess of strife and magic, turns her into the gorgon Medusa. She also makes the other gods believe Artemiza has disappeared. Fiora frees the Titans and takes over the throne. Now Medusa is the only one who can stop her.<br><br>The game consists of five worlds with multiple levels and a world ends with a boss fight. Each world is tied to one of the Titans: Ariadne (water), Coeus (wind), Ermolai (earth), Fiora (magic and discord) and Thia (fire). A level consists of a single, fixed screen that is completed once Medusa has collected all yellow stars. She has two lives at the start and there are enemies roaming. She can petrify enemies with her gaze and then push them into the water to create bridges. She can also create stone blocks that serve as obstacles.<br><br>Some enemies have attacks and they respawn from pots. Later levels introduce keys, chests, rotatable arrow tiles that change the movement direction of pushed enemies, and additional lives that can be picked up. The game keeps track of the score and has a timer counting down. If the game is completed quickly enough a sixth and final world is unlocked with a new ending to the story. The game has achievements and an Olympian mode with permadeath.",
  "publishedBy": "Mega Cat Studios",
  "developedBy": "Mega Cat Studios",
  "released": "Aug 07, 2018",
  "alsoFor": "NES, SNES | Combined View",
  "genre": "Action, Puzzle",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/little-medusa",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "Mega Cat Studios",
          "developer": "Mega Cat Studios",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Aug 07, 2018",
          "ean13": "",
          "comments": "cartridge version (mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}