{
  "name": "Mega Cheril Perils",
  "shortName": "mega-cheril-perils",
  "description": "<i>Mega Cheril Perils</i> is a 2D platform game based on the 2010 ZX Spectrum title <a href=\"https://www.mobygames.com/game/cheril-perils\">Cheril Perils</a>. It keeps some elements of the original game as well as the premise, but both visually and for the gameplay there are many differences. The game stars the character Cheril. Wearing no clothes she leaves her homeland, the jungle of Badajoz, to start a life in the city. When she arrives there she discovers the city is overrun by zombies. A virus created by the pharmaceutic enterprise Parasol meant to make everyone beautiful was transported in a cistern truck not properly cleaned. The previous content was morapio double-malt and the mix of the two substances has an unusual side effect: it turns people into brain-eating zombies. Now the city has been shut down by the mayor using a barrier. The only way for Cheril to leave the city is by killing all zombies to clean the streets and convince the mayor the city is safe again.<br><br>Cheril needs to navigate platforms and can only defeat zombies by jumping on top of them. These zombies take on many shapes also as animals and flying creatures. Instead of one level the game now consists of five separate stages with a password provided after completing the previous one to enter them directly. Each level consists of a series of single-screen rooms, linked together horizontally and vertically to offer exploration. The game shows how many zombies need to be defeated near the top of the screen and once they are all dead the level is completed automatically. Next to platform elements with moving sections sometimes she also needs to push barrels to create passages. Certain sections are blocked off by a dirty old man. He only lets Cheril pass when she gives him a piece of lingerie and those need to be located first. A single hit with an enemy or spikes immediately makes Cheril lose one of the nine lives she starts with. Sometimes hearts appear to provide an additional life.<br><br>An entirely new element is that each room now contains a device that stop all enemies in their tracks for ten seconds. When Cheril activates it by jumping on top of it, the screen turns monochrome and a countdown is started. All enemies freeze, but platforms still move. When the countdown is over the colour returns and enemies start moving again. This is a core gameplay mechanic as enemies can now only be defeated when they are frozen. Jumping on top of them while they are moving makes Cheril lose a life. The freeze mechanic carries over between rooms, so a countdown started in one screen goes on in the next, leading to some environment based puzzle-solving.<br><br>Next to the free download release there was a crowdfunded release with the game on a PAL/NTSC compatible cartridge along with a box and instructions. Based on the tier different extras were provided, such as having your name listed in the game and the manual, a Mojon Twins T-shirt or becoming a character in the game replacing Cheril as the protagonist.",
  "publishedBy": "Mojon Twins, The",
  "developedBy": "Mojon Twins, The",
  "released": "Feb 03, 2017",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/mega-cheril-perils",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "Mojon Twins, The",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Feb 03, 2017",
          "ean13": "",
          "comments": "download release"
        },
        {
          "publisher": "1985 Alternativo",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "May, 2017",
          "ean13": "",
          "comments": "cartridge version (mail order release)"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/979580-mega-cheril-perils-genesis-screenshot-opening-screen-thanking.png",
      "caption": "Opening screen thanking backers crowdfunding the game."
    },
    {
      "link": "/images/shots/l/979581-mega-cheril-perils-genesis-screenshot-language-selection.png",
      "caption": "Language selection"
    },
    {
      "link": "/images/shots/l/979582-mega-cheril-perils-genesis-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/979583-mega-cheril-perils-genesis-screenshot-enter-a-password-to.png",
      "caption": "Enter a password to enter a later stage right away."
    },
    {
      "link": "/images/shots/l/979584-mega-cheril-perils-genesis-screenshot-introduction-sequence.png",
      "caption": "Introduction sequence"
    },
    {
      "link": "/images/shots/l/979585-mega-cheril-perils-genesis-screenshot-start-of-the-first-stage.png",
      "caption": "Start of the first stage"
    },
    {
      "link": "/images/shots/l/979586-mega-cheril-perils-genesis-screenshot-cheryl-freezes-time.png",
      "caption": "Cheryl freezes time, the countdown is going."
    },
    {
      "link": "/images/shots/l/979587-mega-cheril-perils-genesis-screenshot-get-past-these-enemies.png",
      "caption": "Get past these enemies and watch out for the spikes."
    },
    {
      "link": "/images/shots/l/979588-mega-cheril-perils-genesis-screenshot-more-enemies.png",
      "caption": "More enemies"
    },
    {
      "link": "/images/shots/l/979589-mega-cheril-perils-genesis-screenshot-first-activate-the-device.png",
      "caption": "First activate the device before you can take them out."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/579795-mega-cheril-perils-genesis-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "Genesis"
    }
  ]
}