{
  "name": "Mega Marble World",
  "shortName": "mega-marble-world",
  "description": "<i>Mega Marble World</i> is a homebrew Genesis game. It is a puzzle game that consists of 50 rooms where a ball needs to be guided to the exit. Using the four direction keys the ball can be moved in any direction and will automatically follow that path until an obstacle is encountered so the ball cannot be stopped halfway the trajectory. There are no enemies, but a lot of thinking is required to get the ball to reach the exit. There are bottomless pits and traps to take into account as well.<br><br>Rather that separate levels, the entire game is shaped like a large dungeon maze where all room are connected on a large world map that can also be consulted. Often rooms have multiple exits and the easiest one is not always the best option to progress. Players also discover multiple paths, portal and secret corridors. The game keeps track of the elapsed time and the number of moves needed. Using a password system it is possible to continue at the last room. Some rooms are very small, but there are also huge ones where the camera zooms out at the start. The goal is to reach the exit of the dungeon in a fast time.",
  "publishedBy": "GcUP team",
  "developedBy": "GcUP team",
  "released": "Mar 21, 2018",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/mega-marble-world",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "GcUP team",
          "developer": "GcUP team",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Mar 21, 2018",
          "ean13": "",
          "comments": "cartridge version (mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}