{
  "name": "Phantasy Star",
  "shortName": "phantasy-star",
  "description": "Algol is a star system that consists of three planets: the green Palma, the arid Motavia, and the icy Dezolis. Recently, the formerly benevolent king Lassic converted to a new religion and begins to rule Algol with an iron fist. Nero, the leader of a rebel group, is brutally killed by Lassic's robotic policemen. His last words were addressed to his sister Alis: he implores her to find a warrior named Odin. Alis swears revenge against Lassic and embarks on a journey to find Odin and other companions who would help her defeat the tyrant. <br><br><i>Phantasy Star</i> is commonly considered one of the progenitors of Japanese-style role-playing games. Unlike <a href=\"https://www.mobygames.com/search/quick?game=dragon+warrior\">Dragon Quest</a>, it has distinct anime-style visual aesthetics, and contains many characteristic gameplay elements of the genre. Rather than being cast as an adventurer or warrior on an impersonal quest, the player controls a character with her own background story, motivations and desires. The game introduces the genre's typical template of specific non-player characters joining the party for plot-related reasons. The game is also notable for being one of the first RPGs with a pre-determined female protagonist. It is set in a sci-fi environment in which advanced technology and magic co-exist, somewhat reminiscent of <a href=\"https://www.mobygames.com/search/quick?gamegroup=Star+Wars\">Star Wars</a>.<br><br>The core gameplay is influenced by <a href=\"https://www.mobygames.com/search/quick?gamegroup=Ultima\">Ultima</a> games, with simpler turn-based combat against randomly appearing enemies, which is similar to <a href=\"https://www.mobygames.com/search/quick?gamegroup=Wizardry\">Wizardry</a>. The player navigates Alis over top-down overworld, visiting towns and dungeons that are represented by icons. Dungeons have pseudo-3D graphics and are maze-like. <br><br>The player can purchase new weapons, armor, shields, as well as healing and restoring items in towns, or find them in treasure chests in the dungeons. Each character utilizes unique weapon types (e.g. Myau uses claws or fangs, Odin handles guns and axes, etc.). Experience points are awarded for defeating enemies; after a character has accumulated a sufficient amount of those, she or he levels up, gaining additional maximum hit points (HP) and higher combat parameters. Some characters can cast magic spells, requiring magic points (MP), which also increase when leveling up. Characters can visit doctors in towns, recovering HP and MP. Game progress can be saved anywhere.",
  "publishedBy": "SEGA Enterprises Ltd.",
  "developedBy": "SEGA Enterprises Ltd.",
  "released": "Apr 02, 1994",
  "alsoFor": "Nintendo Switch, SEGA Master System, Wii | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/phantasy-star",
  "visual": "",
  "gamePlay": "Japanese-style RPG (JRPG)",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "SEGA Enterprises Ltd.",
          "developer": "SEGA Enterprises Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 02, 1994",
          "ean13": "4 974365 545345",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/247949-phantasy-star-genesis-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cartridge Case",
      "country": "Japan",
      "platforms": "Genesis"
    },
    {
      "link": "/images/covers/l/247948-phantasy-star-genesis-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cartridge Case",
      "country": "Japan",
      "platforms": "Genesis"
    }
  ]
}