{
  "name": "Pigskin 621 AD",
  "shortName": "pigskin-621-ad",
  "description": "<i>Pigskin 621AD</i> is a sort of dark-ages-medieval-fantasy-style combat rugby game in which two five-player teams take to the field to compete in a game of &quot;footbrawl,&quot; all the while dodging rocks, trees, pools, pits, furniture and other obstacles.  Each player controls the team captain of one of the teams.  The original coin-op cabinet was set up with two joysticks and one screen, with both players sharing that same screen; if either player's team captain falls off the screen, he is quickly able to catch up and get back into the action.<br><br>At game start, players can elect to play either the standard game or the more difficult Pro game, which featured more aggressive AI players.  The first half of the game takes place on an outdoor field, while the second half takes place in a medieval-style dungeon &quot;field.&quot;  Both fields feature specific obstacles, with the dungeon field having more darkly thematic hazards like pools of beer to slip on, piles of skulls to trip over, and trap doors to fall into.<br><br>Players have two buttons: punch and pass, and constant punching is encouraged by the fact that each player's team will only punch (thereby knocking opposing players down if hit) when the team captain punches.  Score is gained by both possession, with one point earned for each ten seconds of uninterrupted ball possession, as well as by carrying or passing the ball over the opposing team's goal line.<br><br>One of the more noteworthy twists of the game is that weapons, from axes and swords to nooses and torches, litter the playing field.  If a team captain runs over one of these weapons, it is picked up and stored as a concealed weapon.  Whenever players get into a cartoon-cloud-of-dust-with-people-in-it-style brawl over the ball, if any one of them has such a weapon, he wins the brawl and the opposing player is slaughtered in some suitable way, denying the bereaved team of one player for a short time.<br><br>As the game progresses and one player or the other gets significantly ahead in points, it balances the game by giving slight advantages to the losing player.  Specifically, it applies hazards like a soldier who will sit on the field waiting to stab players of the other team as they go by, and eventually will give the losing team an upgraded troll player who is faster, tougher and more aggressive.  In a single-player Pro mode game against the computer, the player can elect to have a Troll Bowl, and the entire computer team is replaced by trolls.<br><br>The game was ported to the Sega Genesis console as <i>Pigskin Footbrawl</i> in 1992 by Razor Soft.  This version featured the endorsement of the head coach of the Atlanta Falcons at the time, Jerry Glanville, and it periodically plays recorded announcements of Glanville throughout the game.",
  "publishedBy": "RazorSoft, Inc.",
  "developedBy": "Midway Manufacturing Company",
  "released": "1992",
  "alsoFor": "Arcade | Combined View",
  "genre": "Sports",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "Rugby",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/pigskin-621-ad",
  "visual": "2D scrolling",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "RazorSoft, Inc.",
          "developer": "Midway Manufacturing Company",
          "ported": "Developer Resources",
          "country": " United States",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/223655-pigskin-621-ad-genesis-screenshot-title-screen.gif",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/223656-pigskin-621-ad-genesis-screenshot-high-scores-high-teams.gif",
      "caption": "High scores &amp; high teams"
    },
    {
      "link": "/images/shots/l/223657-pigskin-621-ad-genesis-screenshot-options-menu.gif",
      "caption": "Options menu"
    },
    {
      "link": "/images/shots/l/223658-pigskin-621-ad-genesis-screenshot-is-the-goal-clear.gif",
      "caption": "Is the goal clear?"
    },
    {
      "link": "/images/shots/l/223659-pigskin-621-ad-genesis-screenshot-let-s-go-warriors.gif",
      "caption": "Let's go, warriors!"
    },
    {
      "link": "/images/shots/l/223660-pigskin-621-ad-genesis-screenshot-the-game-begins-the-player.gif",
      "caption": "The game begins. The player you control is to the left!"
    },
    {
      "link": "/images/shots/l/223661-pigskin-621-ad-genesis-screenshot-the-referee-looks-happy.gif",
      "caption": "The referee looks happy"
    },
    {
      "link": "/images/shots/l/223662-pigskin-621-ad-genesis-screenshot-touchdown.gif",
      "caption": "Touchdown!"
    },
    {
      "link": "/images/shots/l/223663-pigskin-621-ad-genesis-screenshot-i-see-they-had-cheerleaders.gif",
      "caption": "I see they had cheerleaders in prehistoric times!"
    },
    {
      "link": "/images/shots/l/223664-pigskin-621-ad-genesis-screenshot-uh-oh-now-let-s-not-get.gif",
      "caption": "Uh-oh, now let's not get violent here"
    },
    {
      "link": "/images/shots/l/223665-pigskin-621-ad-genesis-screenshot-the-fights-can-get-pretty.gif",
      "caption": "The fights can get pretty intense"
    },
    {
      "link": "/images/shots/l/223666-pigskin-621-ad-genesis-screenshot-it-s-very-funny-when-a-player.gif",
      "caption": "It's very funny when a player drops into water"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/98379-pigskin-621-ad-genesis-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cartridge Case",
      "country": "United States",
      "platforms": "Genesis"
    },
    {
      "link": "/images/covers/l/98377-pigskin-621-ad-genesis-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cartridge Case",
      "country": "United States",
      "platforms": "Genesis"
    },
    {
      "link": "/images/covers/l/98378-pigskin-621-ad-genesis-media.jpg",
      "scanOf": "Media",
      "packaging": "Cartridge Case",
      "country": "United States",
      "platforms": "Genesis"
    }
  ]
}