{
  "name": "Show do Milhão Volume 2",
  "shortName": "show-do-milho-volume-2",
  "description": "Show do Milhão Volume 2 is a sequel to <a href=\"https://www.mobygames.com/game/show-do-milho\">Show do Milhão</a>, a game based on a Brazilian TV game show by the same name, hosted by Silvio Santos, a famous Brazilian TV presenter, owner of SBT, one of the greatest TV channels in Brazil. This sequel is exactly the same game as the previous one, except for the questions, all new.<br><br>Show do Milhão Volume 2 (One Million Show, in English) is basically a quiz game, with 16 questions divided in three blocks of five questions each, plus the one million question. Each question has 4 alternative answers, of which just one is right. The player has 40 seconds to answer, and wins a money prize for each right question. If he decides to stop at a certain question, he wins half of the questions' prize. If he guesses wrong, wins a quarter of the prize. But the rules are different for the last question: if he guesses wrong, he looses all the money he has won during the game. If he stops, takes half the prize as usual.<br><br>The player can also skip questions up to three times. If he skips a question, other one with the same prize is displayed. He can also ask for help, which comes in three different manners: cards, players and guests.<br><br>If the player chooses the cards help, he must pick one of three shuffled cards (K, A, 2 and 3), each one corresponding to the amount of wrong choices that will be removed from the screen (the K meaning no removal at all).<br><br>If the player chooses the other (in this case, simulated) players help, a screen showing the percentage of players guessing each answer will appear (in the real game show, many players participated each night, taking their turns at the central place).<br><br>If the player chooses the guests help, three guests will take their guesses on the answer, and you can go by their guesses or not (on the real game show, those guests were college students).<br><br>The game features the digitized voice of Silvio Santos, as well as the show's main theme. All the text is in Portuguese.",
  "publishedBy": "Tec Toy S.A.",
  "developedBy": "Tec Toy S.A.",
  "released": "2001",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/show-do-milho-volume-2",
  "visual": "",
  "gamePlay": "Game show / trivia / quiz",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "Tec Toy S.A.",
          "developer": "Tec Toy S.A.",
          "ported": "",
          "country": " Brazil",
          "releaseDate": "2001",
          "ean13": "7 891196 053023",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/209909-show-do-milhao-volume-2-genesis-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/209910-show-do-milhao-volume-2-genesis-screenshot-register-your-name.png",
      "caption": "Register your name."
    },
    {
      "link": "/images/shots/l/209911-show-do-milhao-volume-2-genesis-screenshot-game-rules.png",
      "caption": "Game rules."
    },
    {
      "link": "/images/shots/l/209912-show-do-milhao-volume-2-genesis-screenshot-high-scores-none.png",
      "caption": "High scores (none up to now)."
    },
    {
      "link": "/images/shots/l/209913-show-do-milhao-volume-2-genesis-screenshot-here-we-go-to-the.png",
      "caption": "Here we go to the first question!"
    },
    {
      "link": "/images/shots/l/209914-show-do-milhao-volume-2-genesis-screenshot-this-is-the-question.png",
      "caption": "This is the question screen. You can choose any of the 4 answers, or ask for help."
    },
    {
      "link": "/images/shots/l/209915-show-do-milhao-volume-2-genesis-screenshot-the-help-menu-you.png",
      "caption": "The help menu: you can choose cards, players, guests or to skip."
    },
    {
      "link": "/images/shots/l/209917-show-do-milhao-volume-2-genesis-screenshot-choosing-the-cards.png",
      "caption": "Choosing the cards help, the player must pick one of three shuffled cards (K, A, 2 and 3), each one corresponding to the amount of wrong choices that will be removed from the screen."
    },
    {
      "link": "/images/shots/l/209919-show-do-milhao-volume-2-genesis-screenshot-choosing-the-guests.png",
      "caption": "Choosing the guests help, three guests will take their guesses on the answer, and you can go by their guesses or not"
    },
    {
      "link": "/images/shots/l/209921-show-do-milhao-volume-2-genesis-screenshot-choosing-the-simulated.png",
      "caption": "Choosing the simulated players help, a screen showing the percentage of players guessing each answer will appear "
    },
    {
      "link": "/images/shots/l/209920-show-do-milhao-volume-2-genesis-screenshot-and-now-the-1-million.png",
      "caption": "And now, the 1 million question!"
    },
    {
      "link": "/images/shots/l/209922-show-do-milhao-volume-2-genesis-screenshot-you-lost-everything.png",
      "caption": "You lost everything!"
    }
  ],
  "cover": []
}