{
  "name": "Summer Challenge",
  "shortName": "summer-challenge_",
  "description": "The sequel to <a href=\"https://www.mobygames.com/game/games-winter-challenge\">Winter Challenge</a>, this Summer edition includes 8 events from athletics to cycling. The events are:\n<ul>\n<li><b>Kayak:</b> The player goes on a downhill stream, and must navigate through gates without missing or touching them (unlike the real event, there are no reverse gates), as well as avoiding to hit the margins of the stream. Pushing forward paddles, pressing a direction along a button allows a sharper turn. The winner is the one with the fastest time after penalty time is added</li>\n<li><b>Archery:</b> Each competitor has four targets, each with three arrows. By moving the directional buttons the player moves the erratic crosshair, while pressing a button fires the arrow.</li>\n<li><b>400m Hurdles:</b> The player does a full lap on the track by pressing the first button to set the pace and the second to jump. Mistiming the jump either makes the athlete knock the hurdle and lose a few tenths of second, or goes completely off-balance and falls, ending the event</li>\n<li><b>High Jump and Pole Vault:</b> Two similar events where the player starts by setting the bar height, and then mashing the power button to build enough speed. Then, just before the jump point the action button must be pressed and held until the athlete is in position to pass over the bar. The contest ends once there are three misses at an height, or the maximum height is cleared.</li>\n<li><b>Equestrian:</b> The most technical event, the player must steer the horse to the best trajectory while jumping over hurdles and walls. While a knockdown means a time penalty in the end, if the horse refuses to do a jump (if the button is pressed too soon or too late) the competition ends immediately.</li>\n<li><b>Javelin:</b> A simple event where each player has three attempts to launch the javelin as far as possible. To do so, first some speed must be built, and a few steps before the mark start pressing the action button to start the launch sequence, which initiates the angle measure. Once the player releases the button (ideally at an angle between 40 and 45 degrees next to the mark), the javelin is released as well</li>\n<li><b>Cycling:</b> In this sprint event the player must complete a number of laps in the velodrome, while keeping as fast and as close as possible to the inner edge without falling.</li>\n</ul>\nLike with Winter Challenge, graphically, the game features the same polygonal environments with bitmap athletes and game modes include the ability to train or compete in a tournament (up to ten human players, with three computer levels and 16 nations to choose from). It's also possible to replay and even store your best (or worst) moments. ",
  "publishedBy": "Accolade, Inc.",
  "developedBy": "MindSpan",
  "released": "1993",
  "alsoFor": "DOS | Combined View",
  "genre": "Action, Sports",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "Olympiad / mixed sports",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/summer-challenge_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "Accolade, Inc.",
          "developer": "MindSpan",
          "ported": "",
          "country": " United States",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/291396-summer-challenge-genesis-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/291397-summer-challenge-genesis-screenshot-main-menu.png",
      "caption": "Main Menu"
    },
    {
      "link": "/images/shots/l/291394-summer-challenge-genesis-screenshot-pole-vault.png",
      "caption": "Pole vault"
    },
    {
      "link": "/images/shots/l/291395-summer-challenge-genesis-screenshot-high-jump.png",
      "caption": "High jump"
    },
    {
      "link": "/images/shots/l/291398-summer-challenge-genesis-screenshot-kayak.png",
      "caption": "Kayak"
    },
    {
      "link": "/images/shots/l/291399-summer-challenge-genesis-screenshot-equestrian.png",
      "caption": "Equestrian"
    },
    {
      "link": "/images/shots/l/291400-summer-challenge-genesis-screenshot-fell-off-the-horse.png",
      "caption": "Fell off the horse."
    },
    {
      "link": "/images/shots/l/291401-summer-challenge-genesis-screenshot-archery.png",
      "caption": "Archery"
    },
    {
      "link": "/images/shots/l/291402-summer-challenge-genesis-screenshot-cycling.png",
      "caption": "Cycling"
    },
    {
      "link": "/images/shots/l/291403-summer-challenge-genesis-screenshot-big-fall.png",
      "caption": "Big fall!"
    },
    {
      "link": "/images/shots/l/291404-summer-challenge-genesis-screenshot-hurdles.png",
      "caption": "Hurdles"
    }
  ],
  "cover": []
}