{
  "name": "Sumo Slam!",
  "shortName": "sumo-slam",
  "description": "<i>Sumo Slam!</i> is a party game for up to twelve players with sumo wrestlers challenging each other on a platform. The game is played on a fixed-screen showing a platform with the sumo wrestlers using a top-down view. The wrestlers cannot be controlled directly. They constantly rotate in a stationary position at a fixed speed. By pressing and holding down a button the player makes the wrestler go forward in the direction he is facing for as long as the button is pressed. As soon as the button is released the wrestler starts rotating again. The game can be played in different game modes: Sushi (collect sushi playing along against a time limit), Chase (a game of tag) and Fight (bump other wrestlers off the platform). As only a single button or key press is used up to twelve players can participate simultaneously in local multiplayer. When playing alone the computer controls the opponents.<br><br>The game is almost identical to the 2004 J2ME title <a href=\"https://www.mobygames.com/game/sumo-smash\">Sumo Smash!</a>, which in turn is based on <a href=\"https://www.mobygames.com/game/jumbo-rumble\">Jumbo Rumble</a>, but it is not clear how the games are related.",
  "publishedBy": "Segaman Production",
  "developedBy": "Segaman Production",
  "released": "2013",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/genesis/sumo-slam",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Party game",
  "setting": "",
  "release": [
    {
      "system": "Genesis",
      "releases": [
        {
          "publisher": "Segaman Production",
          "developer": "Segaman Production",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2013",
          "ean13": "",
          "comments": "download release"
        },
        {
          "publisher": "Piko Interactive LLC",
          "developer": "Segaman Production",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 30, 2017",
          "ean13": "",
          "comments": "cartridge version (Piko Interactive mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}