{
  "name": "BS Super Mario USA",
  "shortName": "bs-super-mario-usa",
  "description": "<i>BS Super Mario USA</i> is the Satellaview-exclusive direct sequel to <a href=\"https://www.mobygames.com/game/super-mario-bros-2\">Super Mario Bros. 2</a>. The game was broadcast in four parts. The game is largely identical to the <a href=\"https://www.mobygames.com/game/super-mario-all-stars\">Super Mario All-Stars</a> version of <i>Super Mario Bros. 2</i>, but with new features. It features a new storyline, placing it after the original. Wart has returned in his attempt to conquer Subcon, bringing his army with him. The game introduces ?sama, who is the king of Subcon, and his assistant.  The game features audio drama-like narration and streamed radio-quality music, provided by the Satellaview's Soundlink technology. The most major addition to gameplay is the new goal of collecting Golden Mario Statues throughout the levels (a concept later revived in <a href=\"https://www.mobygames.com/game/super-mario-advance\">Super Mario Advance</a>, but with Yoshi Eggs). The player must then defeat the level boss. Another addition is that in each level, after defeating its boss, the player must locate and defeat Wart, who is found in every level by traveling down a vase while in Subspace. If there is still time left on the timer after all goals in an episode are completed, the player may explore any levels as much as they want before time runs out. Other additions include a points system, cutscenes, and forced character changes as the game progresses, starting with Mario.",
  "publishedBy": "St.GIGA",
  "developedBy": "Nintendo Co., Ltd.",
  "released": "Mar 31, 1996",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/bs-super-mario-usa",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "St.GIGA",
          "developer": "Nintendo Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 31, 1996",
          "ean13": "",
          "comments": "Episode 1: BS Super Mario USA Power Challenge Dai-1-kai &quot;Atashitachi, Super-Katherines!&quot; no Kan"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}