{
  "name": "Chaos Seed: F?sui Kair?ki",
  "shortName": "chaos-seed-fsui-kairki",
  "description": "In this action-strategy-RPG hybrid you play the role of a young member of a cave-dwelling race of warriors. As the planet is dying, it is your task to build the necessary mystic rooms in your caves to channel the energy back to the planet, but the surface-dwellers think that you are to blame for the current situation and constantly send waves of explorers and adventurers trying to clear your dungeon.<br><br>The game is played from a top-down perspective using a 2D engine in different phases, first you can roam your cave freely, molding the walls at your discretion by simply pushing and pulling into them to create the rooms needed to channel energy into the earth or create upgrades for your character, summon monsters to aid you, etc. When a timer runs out you proceed to a menu-based interface from which you control the energy production and decide what to upgrade, equip, etc. rinse and repeat for a new turn. Each turn brings new challenges in the form of surface-dwelling adventurers, which you must fight with your weapons and magic spells while attempting to build your rooms.<br><br>Whenever you reach a certain quota of energy production you get to move on to another scenario in a different cave. As mentioned you can create summon rooms to invoke creatures that can aid you in combat, help you gather energy and other resources, etc.<br><br>Depending on how you place you rooms according to certain Feng Shui principles you get bonuses and upgrades and you will also face cave-dwelling monsters that you must defeat and other non-player characters (NPCs) that may or may not aid you.",
  "publishedBy": "Taito Corporation",
  "developedBy": "Neverland Co., Ltd.",
  "released": "Mar 15, 1996",
  "alsoFor": "SEGA Saturn | Combined View",
  "genre": "Action, Role-Playing (RPG), Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/chaos-seed-fsui-kairki",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Taito Corporation",
          "developer": "Neverland Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 15, 1996",
          "ean13": "4 988611 950067",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/460494-chaos-seed-fusui-kairoki-snes-screenshot-title-screen.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/460495-chaos-seed-fusui-kairoki-snes-screenshot-main-menu.png",
      "caption": "Main Menu"
    },
    {
      "link": "/images/shots/l/246920-chaos-seed-fusui-kairoki-snes-screenshot-the-dungeon-where.png",
      "caption": "The dungeon where you start."
    }
  ],
  "cover": []
}