{
  "name": "Dai-3-ji Super Robot Taisen",
  "shortName": "dai-3-ji-super-robot-taisen_",
  "description": "The third <i>Super Robot Taisen</i> game is the first to appear on the Super Famicom and a direct sequel to its <a href=\"https://www.mobygames.com/game/nes/dai-2-ji-super-robot-taisen\">predecessor</a>. Six months after the war against the Divine Crusaders, the heroes that defeated them (now organized in the Londo Bell special forces unit) are called back into action. The DC remnants have regained strength under the control of the Zabi family. Additionally, unexplained disappearances near lunar colonies indicate that there might be another faction in play. It is up to Londo Bell to investigate and fight the next Super Robot War.<br><br>Like its predecessor, the game is a turn-based strategy game with heavy RPG elements that crosses over characters and robots from various animated TV series and puts them into an all-new story. The game features 58 missions (more than doubling the number from SRW2) and introduces a branching mission path to the series. The path through the game is determined via direct player choices during and after missions as well as mission performance (i.e. number of turns required to complete the level). The choices made also lead to three different possible endings.<br><br>The basic gameplay of the series remains unchanged from the predecessor, with players having their units move and attack on a map of the area via context-sensitive menus and fights played out as animated scenes. Series mainstays like the spirit (for unleashing special powers) and negotiate (for making enemy units defect) commands also make a return.<br><br>The strategic complexity however has been increased. Pilots and their robots are now separate entities with separate stats, making it possible for pilots to switch robots between missions, but only within their own franchise (i.e. Amuro Ray can control all Gundam, but no Mazinger robots). Another new feature is the ability to set one of four global counterattack strategies: from aggressive (always counterattack) to conservative (only if the counterattack can't destroy the unit or if it has more than 50% HP) to defensive (never counterattack).<br><br>The pilots are rated in six stats: attack power, probability to hit, piloting skill (determining damage potential and chance of critical attacks), response (determining chance of evading attacks), willpower (required for special attacks) and intuition (a static overall bonus). Stats are automatically raised through leveling, done by gaining experience points in combat. The robots are rated in hit points, energy, range, armor and maximum response (limiting the respective pilot's stat). All stats but range can be upgraded between levels by spending money, which, like XP, is gained through defeating enemies. Additionally, both pilot and robot are also rated in their adaptability to different terrain types. Each robot comes with a variety of unique weapons, which also all have their own stats: attack power, range, probability to hit, and ammo or energy requirements. Ammo, like spirit points, only refills at the end of a mission, but energy regenerates continually.<br><br>Besides adding some new robots and characters from the known franchises (including Gundam's <i>War in the Pocket</i> and <i>Stardust Memory</i>), the game introduces franchises from outside the Gundam/Mazinger/Getter Robo trinity for the first time: making their debut in the series are <i>Raideen</i>, <i>Combattler V</i> and <i>Daitarn 3</i>.",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Winky Soft Co., Ltd.",
  "released": "Jul 23, 1993",
  "alsoFor": "",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/dai-3-ji-super-robot-taisen_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Winky Soft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 23, 1993",
          "ean13": "4 983164 730241",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/815677-dai-3-ji-super-robot-taisen-snes-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/815678-dai-3-ji-super-robot-taisen-snes-screenshot-demo.png",
      "caption": "Demo."
    }
  ],
  "cover": []
}