{
  "name": "Energy Breaker",
  "shortName": "energy-breaker",
  "description": "<i>Energy Breaker</i> is set on a small, fictitious island called Zamuria. The story begins with Myra, a 21-year-old girl who has lost her memory. She keeps having dreams warning that she must hurry to avert a catastrophe. After visiting the fortune-teller Selphia who has just come to the Myra's town, she finds herself drawn into a conflict between four mysterious Dark Generals who are seeking the power of four jewels. With the local inventor Renard and his robot assistant Gulliver, they embark on a time-travelling adventure to meet new allies, uncover her forgotten past, and learn of the Dark Generals' plot that may threaten the world.<br><br><i>Energy Breaker</i> is hinted to take place in the same world as <a href=\"https://www.mobygames.com/search/quick?company=Taito\">Taito's</a> <a href=\"https://www.mobygames.com/search/quick?gamegroup=Lufia\">Lufia</a> series: for instance, the presence of Priphea flowers, some terminology and conventions, an obtainable sword named after the Dual Blade, and a cameo appearances by Lufia and Roman in the ending.<br><br><i>Energy Breaker</i> combines gameplay elements from traditional Japanese role-playing games and strategy/tactical role-playing games. The player is able to explore dungeons and towns from the same isometric perspective of the game's battle system. The game features many hidden items that can be found by interacting with the background environment, as well as a staggering amount of descriptive text for the environments that change throughout the course of the game, often several times. The player is able to choose an emotion or attitude when talking to NPCs, however this rarely seems to make a difference. Dungeon exploration transitions seamlessly into episode-like grid-based battle scenarios with preset enemy layouts and conditions as opposed to random encounters. Battles are typically won by defeating all enemies, though other win conditions exists such as defeating a boss, surviving a certain number of turns, or arriving to a specific point of the battle grid.<br><br>The battle mechanics are based around a &quot;Balance&quot; component. Player characters and enemies all receive an amount of Balance at the start of their turn, however the less HP a unit has, the less they will receive at the start of that turn. Balance is required to perform most actions, such as moving, performing basic and special attacks, and using items. Special attacks and skills are learned by finding and using &quot;Grimoire&quot; items before battle, and are equipped according to an energy system that consists of four types: blue, red, yellow, and green. One energy type may be leveled up once per level up, up to a maximum of eight. Before they can be used, special skills require the character to meet a specific minimum level of each of the four energy types, which themselves can be continually adjusted throughout the game.",
  "publishedBy": "Taito Corporation",
  "developedBy": "Neverland Co., Ltd.",
  "released": "Jul 26, 1996",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/energy-breaker",
  "visual": "2D scrolling",
  "gamePlay": "Japanese-style RPG (JRPG), Tactical RPG",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Taito Corporation",
          "developer": "Neverland Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 26, 1996",
          "ean13": "4 988611 960035",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1015850-energy-breaker-snes-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/1015849-energy-breaker-snes-screenshot-intro.png",
      "caption": "Intro"
    }
  ],
  "cover": []
}