{
  "name": "Fork Parker's Crunch Out",
  "shortName": "fork-parkers-crunch-out",
  "description": "<i>Fork Parker's Crunch Out</i> is a homebrew game starring <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,513980/\">Fork Parker</a>, the fictional CFO of <a href=\"https://www.mobygames.com/search/quick?company=Devolver+Digital\">Devolver Digital</a>. It was created to raise awareness about &quot;crunch time&quot; in game development, a practice in some companies when employees are expected to put in a large amount of (unpaid) overtime hours to get the game done in a proposed time. Devolver Digital donated 100% of their profits from sales to Take This, an organization that raises awareness and aims to combat mental health issues.<br><br>At the start of the game Fork Parker feels threatened by the rise of a new publisher, Cash Cow Games. They released <i>Loot Box: The Game</i> where only one in twenty downloads contains the actual game and they bought their own e-sports team. Parker decides it is time to catch up with them through crunch time. The player controls Parker in the office with mechanics typical of time management titles. He needs to bring employees caffeine to keep them awake, serve hamburgers at their desks, whip them into working, literally, using a bat, or resuscitate them using a dose of electricity when they pass out. The game takes place on a single, fixed screen and most actions are tied to moving to one of the four stations near the top of the screen, for instance to get coffee. An icon of an employee's head shows the current mood / status and Parker needs to move quickly to the correct station to remedy it. There is also a pink pet pig Pork running around and it needs to be avoided. When Parker comes in contact with it, he shakes it for a long time and B needs to be tapped repeatedly to make him let go.<br><br>Levels last only five minutes and then the developers' game needs to be done, with progress shown through a bar near the top of the screen. The first level starts with four developers, but the number of people increases with every new stage. Between levels, upgrades can be bought using money. Upgrades affect the stations, but also Parker himself. For instance increasing his movement speed, reducing the time he pets Pork, healing all negative status effects or earning 30 seconds of unpaid overtime. The latter are either single-use items or only last a single day, while the station upgrades are permanent.<br><br>Coins constantly appear between the desks and Parker needs to collect these to purchase the upgrades. There are also a large number of additional mini-games to play. These are tied to the development, such as completing a mini-game to fix the internet that has gone out so all development is halted. In another mini-game an employee has ordered food delivery through a drone, but lunch breaks are not permitted so Parker needs to intercept and catch the food in a sequence with a side view, throwing items back until the drone crashes.<br><br>The game was released on a cartridge, with a box and a full colour manual. The initial run was 1,000 copies.",
  "publishedBy": "Devolver Digital, Inc.",
  "developedBy": "Mega Cat Studios",
  "released": "Feb 19, 2019",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/fork-parkers-crunch-out",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Time management",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Devolver Digital, Inc.",
          "developer": "Mega Cat Studios",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Feb 19, 2019",
          "ean13": "",
          "comments": "cartridge version (mail order release)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}