{
  "name": "MechWarrior",
  "shortName": "mechwarrior_",
  "description": "In 3017, when Herras Ragen was 12, his father Colonel Joseph T. Ragen, a soldier in the House Davion army, was working to infiltrate and destroy a renegade mercenary cartel called the Dark Wing Lance. However, he was discovered, and the Dark Wing took their revenge: somehow, they had learned the location of the Ragen family's residence. Under cover of night they attacked, killing everyone. Only young Herras, who was at a friend's house at the time of the massacre, survived. Unbeknownst to him, the Dark Wing made an agreement that after the strike, they would separate for ten years and maintain an absolute code of secrecy before regrouping again to continue their nefarious operations.<br><br>Now, in 3027, that time is up. Herras, who has become a young man, has waited the last decade for his chance to take revenge. As a mercenary MechWarrior operating from the planet Galatea, with a light 'Mech in the hangar and 50.000 C-Bills in the bank, he will accept any mission that will lead him closer to finding the murderers of his family.<br><br><i>MechWarrior</i> on the SNES, while broadly similar to the <a href=\"https://www.mobygames.com/game/dos/mechwarrior\">PC game of the same name</a>, puts the player into the BattleTech universe with a new story, and gameplay and controls suited to the console. <br><br>The central hub in the game is Galatea. Here, Herras can visit Club Zero-Zero (for the latest news, rumors and gossip), General HeadQuarters (for mission assignments) and the 'Mech Complex (for buying, selling, repairing and customizing 'Mechs). In the club, bartender Cearle usually has some helpful advice, and other characters may also offer tips and give pointers to certain assignments that will lead Herras further in his quest. He can also view Holovids left to him by other characters as well as check out bulletins from NewsNet.<br><br>At GHQ, several missions will be available at any point in the game, not all of which advance the storyline: many are entirely optional. Before accepting an assignment, the mission parameters can be studied: they include the mission type, the size of expected resistance as well as environmental conditions, like planet climate and gravity. The possible mission types are Garrison and Riot Duty (destroy all enemy 'Mechs), Recon and Objective Raids (locate and collect a specific item carried by an enemy 'Mech), Planetary Assault and Offensive Campaign (stop the enemy from entering a friendly base), Security Duty (protect a base from being overrun - from inside the site) and Siege Campaign (locate and destroy an enemy base). Before each mission, the reward for successful completion can be negotiated - often something higher than the basic offer can be reached, but asking for too much might also offend House Davion.<br><br>During an actual mission, gameplay is seen from a first-person cockpit perspective, with the SNES' Mode 7 employed for a pseudo-3d effect. Specific parts of enemy 'Mechs (torso, arms and legs) can be targeted, with expected effects: losing arms also loses weapons, while damaged legs hinder movement.<br><br>Earned C-Bills can be spent in the 'Mech Complex for repairs or new acquisitions. Eight different BattleMechs are available to buy and sell: four light, two medium, one heavy and one assault 'Mech, all entirely new designs not seen in the BattleTech tabletop games. The machines can be equipped with loads of different weapons: guided and unguided missiles, machine guns, lasers, and the mighty particle cannon. Missiles and energy guns build up heat with every shot: to prevent overheating, heat sinks should be installed - the problem is less pronounced on colder planets, naturally. Also available are more than a dozen different engines, as well as armor plates and jump jets (which have a much stronger effect on low-gravity planets).<br><br>There are various paths through the game, depending on choices taken by the player on which assignments to handle. All in all, more than 50 storyline missions plus many optional ones await.",
  "publishedBy": "Activision, Inc.",
  "developedBy": "Beam Software Pty., Ltd.",
  "released": "May, 1993",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/mechwarrior_",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Activision, Inc.",
          "developer": "Beam Software Pty., Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Victor Musical Industries, Inc.",
          "developer": "Beam Software Pty., Ltd.",
          "ported": "",
          "country": "",
          "releaseDate": "",
          "ean13": "4 988002 261697",
          "comments": ""
        },
        {
          "publisher": "Activision, Inc.",
          "developer": "Beam Software Pty., Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/35885-mechwarrior-snes-screenshot-title-screen.gif",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/186542-mechwarrior-snes-screenshot-title-screen-main-menu-japanese.png",
      "caption": "Title screen / Main menu (Japanese)."
    },
    {
      "link": "/images/shots/l/97701-mechwarrior-snes-screenshot-intro.png",
      "caption": "Intro"
    },
    {
      "link": "/images/shots/l/97702-mechwarrior-snes-screenshot-main-screen-from-here-you-have.png",
      "caption": "Main screen - from here, you have access to all important screens."
    },
    {
      "link": "/images/shots/l/97703-mechwarrior-snes-screenshot-at-the-bar-you-can-pick-up-rumors.png",
      "caption": "At the bar you can pick up rumors and learn about the background story."
    },
    {
      "link": "/images/shots/l/97704-mechwarrior-snes-screenshot-here-you-can-view-information-on.png",
      "caption": "Here you can view information on various missions and pick one that suits your mech's abilities."
    },
    {
      "link": "/images/shots/l/97707-mechwarrior-snes-screenshot-beginning-a-mission.png",
      "caption": "Beginning a mission"
    },
    {
      "link": "/images/shots/l/97705-mechwarrior-snes-screenshot-you-can-always-see-which-part-of.png",
      "caption": "You can always see which part of an enemy mech you are hitting."
    },
    {
      "link": "/images/shots/l/97706-mechwarrior-snes-screenshot-air-battle.png",
      "caption": "Air battle"
    },
    {
      "link": "/images/shots/l/35886-mechwarrior-snes-screenshot-in-game.gif",
      "caption": "In Game"
    },
    {
      "link": "/images/shots/l/97708-mechwarrior-snes-screenshot-here-you-can-repair-and-tune-you.png",
      "caption": "Here you can repair and tune you mech ..."
    },
    {
      "link": "/images/shots/l/97709-mechwarrior-snes-screenshot-or-buy-a-completely-new-one.png",
      "caption": "... or buy a completely new one."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/136771-mechwarrior-snes-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States , Canada  and Mexico",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/136772-mechwarrior-snes-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States , Canada  and Mexico",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/172412-mechwarrior-snes-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States , Canada  and Mexico",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/145799-mechwarrior-snes-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Belgium , France , Luxembourg , The Netherlands  and United Kingdom",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/145800-mechwarrior-snes-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Belgium , France , Luxembourg , The Netherlands  and United Kingdom",
      "platforms": "SNES"
    }
  ]
}