{
  "name": "Operation Thunderbolt",
  "shortName": "operation-thunderbolt",
  "description": "<i>Operation Thunderbolt</i> is the exciting sequel to <a href=\"https://www.mobygames.com/game/sheet/p,27/gameId,3475\">Operation Wolf</a>. An airliner is hijacked by terrorists en-route from Paris to Boston, who threaten to kill all hostages on board if their mates aren't released from jail. Instead of reaching its destination, the airliner makes a landing in Kalubya, Africa, and all the hostages are hidden in various locations. The authorities have asked the hero from <i>Operation Wolf</i> to rescue the hostages, but only this time, the hero brings his friend along for the ride.<br><br>There are eight missions to complete in <i>Operation Thunderbolt</i>, and each one has you shooting down soldiers, choppers, and tanks. The gameplay varies every one or two missions. In some missions, you are driving a jeep or controlling a boat, while in others, you are walking while you're shooting. You have a limited supply of ammo, and a limited supply of rocket bombs, but you can always stock up by shooting down crates falling from the sky, or by killing a cat or dog that get in the line of fire. Also from crates, you can get special items like bulletproof vests, rocket bombs, and different weapons.<br><br>You also have a life bar to worry about. If you're shot at by soldiers, or if rocket bombs or grenades are thrown at you, you 'll lose energy, and once you're energy is depleted,  you lose one of your three lives. You can lose a lot of energy by killing hostages on purpose,  and you can't easily avoid killing them if you decide to use rocket bombs to wipe out enemies. The eighth mission, the mission that involves you fighting terrorists on a plane,  proves to be difficult because a woman in a blue dress stands up and gets in the line of fire, and you have to very careful when you're going to use rocket bombs.<br><br>There are two endings to this game, and which ending you can watch will depend on the number of hostages you've saved, and whether or not you shot the pilot instead of the mission eight boss. \n",
  "publishedBy": "Taito Corporation",
  "developedBy": "Taito Corporation",
  "released": "Oct, 1994",
  "alsoFor": "Amiga, Amstrad CPC, Arcade, Atari ST, Commodore 64, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/operation-thunderbolt",
  "visual": "",
  "gamePlay": "Arcade, Rail shooter",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Taito Corporation",
          "developer": "Taito Corporation",
          "ported": "Aisystem Tokyo",
          "country": " United States",
          "releaseDate": "Oct, 1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/153782-operation-thunderbolt-snes-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/153783-operation-thunderbolt-snes-screenshot-a-resumed-briefing-of.png",
      "caption": "A resumed briefing of your chosen soldier."
    },
    {
      "link": "/images/shots/l/153784-operation-thunderbolt-snes-screenshot-after-some-explanations.png",
      "caption": "After some explanations of Colonel Jones, you'll be able to select the first task."
    },
    {
      "link": "/images/shots/l/153965-operation-thunderbolt-snes-screenshot-shin-miyamoto-is-about.png",
      "caption": "Shin Miyamoto is about to be damaged by a double-massive attack made by an enemy airplane..."
    },
    {
      "link": "/images/shots/l/153966-operation-thunderbolt-snes-screenshot-some-rebels-executing.png",
      "caption": "Some rebels executing a double frontal attack against Shin: successfully he kills one of them."
    },
    {
      "link": "/images/shots/l/153967-operation-thunderbolt-snes-screenshot-even-stunned-for-the.png",
      "caption": "Even stunned for the last attack received, Shin was capable to destroy an enemy boat!"
    },
    {
      "link": "/images/shots/l/153968-operation-thunderbolt-snes-screenshot-now-the-action-goes.png",
      "caption": "Now, the action goes to Erica Whitney, and she starts the non-stop action beating a silly rebel!"
    },
    {
      "link": "/images/shots/l/153969-operation-thunderbolt-snes-screenshot-the-next-target-for.png",
      "caption": "The next target for Erica: a single barricade formed by some rebels and a reinforced tank."
    },
    {
      "link": "/images/shots/l/153970-operation-thunderbolt-snes-screenshot-critical-situation-after.png",
      "caption": "Critical situation: after a massive-enemy-counter-attack, Erica Whitney is about to reach 0-life!"
    },
    {
      "link": "/images/shots/l/631690-operation-thunderbolt-snes-screenshot-commanding-officer.png",
      "caption": "Commanding officer"
    },
    {
      "link": "/images/shots/l/631691-operation-thunderbolt-snes-screenshot-destroy-the-helicopter.png",
      "caption": "Destroy the helicopter"
    },
    {
      "link": "/images/shots/l/631692-operation-thunderbolt-snes-screenshot-enemies-to-kill.png",
      "caption": "Enemies to kill"
    },
    {
      "link": "/images/shots/l/631693-operation-thunderbolt-snes-screenshot-explosion.png",
      "caption": "Explosion"
    }
  ],
  "cover": []
}