{
  "name": "SD The Great Battle: Aratanaru Ch?sen",
  "shortName": "sd-the-great-battle-aratanaru-chsen",
  "description": "<i>SD The Great Battle: Aratanaru Chousen</i> is an action game that crosses over the <i>Ultraman</i>, <i>Kamen Rider</i> and <i>Gundam</i> franchises in Super Deformed style. The story begins when the environmental control system of the SD Nation malfunctions, which revives hordes of evil creatures. Kamen Rider V3, Ultraman Taro and Knight Gundam go on a mission to investigate, but soon disappear. Now the original Kamen Rider, Ultraman and Gundam must find their friends so they can defeat the evil behind it all together.<br><br>The game consists of seven levels, seen from a bird's eye perspective, which range from flying islands and mysterious castles to spaceships. The player can switch between the different heroes at any time. Once the missing heroes are found, they can also be used. The levels are full of regular and boss enemies from various incarnations of the three franchises. To defeat them, the heroes can use a standard gun as well as a powerful special weapon unique to each character that requires energy to operate. A helpful ally can be found in each level who will boost the special energy.\n",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "",
  "released": "Dec 29, 1990",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/sd-the-great-battle-aratanaru-chsen",
  "visual": "2D scrolling",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 29, 1990",
          "ean13": "4 983164 730029",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1016490-sd-the-great-battle-aratanaru-chosen-snes-screenshot-title.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}