{
  "name": "Sink or Swim",
  "shortName": "sink-or-swim",
  "description": "Your name is Kevin Codner – rescue mariner extraordinaire, answering the distress call of a sinking cruise liner, the SS Lucifer. You set off in your little submarine and board the ship where a horde of passengers desperately need your keen oversight and &quot;shipsmarts&quot;.<br><br>In 60 levels you have to rescue as many passengers (dubbed the Dim Passengers) as possible. At the beginning the passengers fall through a tube in the level. Similar to <a href=\"https://www.mobygames.com/search/quick?game=Lemmings\">Lemmings</a> you have to find a way for the passengers to the exit of the level. In order to do so, you must blast hindrances such as cargo boxes and bulkheads with bombs or, when no bombs are left, reposition the boxes with a crane. There are also conveyor belts in the levels. If the belt moves in the wrong way, the passengers either can't use it or may even be transported to their dooms, being dropped off into water, fire or steam jets. You can usually choose the direction of the belts by pulling a lever.<br><br>There are several types of scenarios that Kevin Codner (you) are faced with throughout the game. Of course the puzzles get progressively more difficult, involving things like patching up cracked pipes to stop a lethal jet of steam from cooking the distressed passengers. You can blast away obstacles and stack crates in creative manners. For instance, you can have them fall onto each other to form a bridge across a gap or to provide shielding from fire. This is usually done by hoisting them onto conveyor belts using a crane.<br><br>Each level has a certain &quot;save limit&quot;, meaning you have to save at least a certain amount of passengers. This again is akin a bit towards Lemmings, and lots of levels have a built-in time limit, represented by water pouring into the compartment, rising ominously. When the water rises high enough, the passengers will get carried along with it, and they can only swim for a short period of time before getting exhausted and drowning, so you'd better be on time with some assistance.<br><br>At the end of each level you receive a password (again, Lemmings-style) so that you may pick up your game from the current level without having to progress through them all from the get-go.<br><br>Genesis and SNES versions feature 100 levels. Also, the Genesis version shows a password only once in 5 levels starting from level 5. Although the passwords for each level actually exist, they are never given by the game.",
  "publishedBy": "Titus France SA",
  "developedBy": "Zeppelin Games Limited",
  "released": "1994",
  "alsoFor": "Amiga, DOS, Game Gear, Genesis | Combined View",
  "genre": "Puzzle",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/sink-or-swim",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Titus France SA",
          "developer": "Zeppelin Games Limited",
          "ported": "",
          "country": " France, Germany, Italy, The Netherlands, Spain, United Kingdom",
          "releaseDate": "1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/303001-sink-or-swim-snes-screenshot-copyright-notice.png",
      "caption": "Copyright notice"
    },
    {
      "link": "/images/shots/l/303002-sink-or-swim-snes-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/303003-sink-or-swim-snes-screenshot-training-hit-the-switch-and-blast.png",
      "caption": "Training: hit the switch and blast the door to get your men to safety."
    },
    {
      "link": "/images/shots/l/303004-sink-or-swim-snes-screenshot-use-the-crane-to-fill-the-gap.png",
      "caption": "Use the crane to fill the gap, so that the little guys can cross."
    },
    {
      "link": "/images/shots/l/303005-sink-or-swim-snes-screenshot-at-the-factory.png",
      "caption": "At the factory"
    },
    {
      "link": "/images/shots/l/303006-sink-or-swim-snes-screenshot-winter-level.png",
      "caption": "Winter level"
    },
    {
      "link": "/images/shots/l/303007-sink-or-swim-snes-screenshot-rescue-the-men-dressed-like-eskimos.png",
      "caption": "Rescue the men dressed like eskimos."
    },
    {
      "link": "/images/shots/l/303008-sink-or-swim-snes-screenshot-kitchen-level.png",
      "caption": "Kitchen level"
    },
    {
      "link": "/images/shots/l/303009-sink-or-swim-snes-screenshot-now-save-the-cooks.png",
      "caption": "Now save the cooks."
    },
    {
      "link": "/images/shots/l/303010-sink-or-swim-snes-screenshot-in-a-mansion-they-now-look-like.png",
      "caption": "In a mansion - they now look like butlers."
    },
    {
      "link": "/images/shots/l/303012-sink-or-swim-snes-screenshot-get-them-across-the-clothes-line.png",
      "caption": "Get them across the clothes line."
    },
    {
      "link": "/images/shots/l/303013-sink-or-swim-snes-screenshot-enter-a-password-to-start-in.png",
      "caption": "Enter a password to start in a later level."
    }
  ],
  "cover": []
}