{
  "name": "Super Robot Taisen EX",
  "shortName": "super-robot-taisen-ex",
  "description": "<i>Super Robot Taisen EX</i> is a spin-off entry in the <i>Super Robot Taisen</i> series. It stars characters original to the series that were introduced in previous games, instead of the anime TV heroes that the main line games focus on. The game is set after <a href=\"https://www.mobygames.com/game/snes/dai-3-ji-super-robot-taisen_\">the third Super Robot War</a> and sees protagonist Masaki return to his homeland of La Gias, located on the inner surface of the hollow Earth. He finds the land engulfed in a civil war, and quickly decides to join the fight to restore peace. He soon learns that people from La Gias have opened gates to the surface, summoning robot pilots to join the war against their will, thus introducing both allies and enemies from the past wars into this new conflict. Among those summoned is Ryune, who, upon learning of the situation, decides to seek other summoned friends and help them before trying to return home. Unlike the straight science fiction scenario of the earlier games, <i>EX</i> goes for more of a fantasy flavor, with a medieval setting and a world of faeries, spirits, demons and magically-powered robots crossing with the hi-tech robots from the surface.<br><br>The game consists of three separate campaigns plus a short training scenario: one for Masaki (easy difficulty), one for Ryune (medium difficulty) and one for a mysterious third character who was believed killed in the previous game (hard difficulty). Masaki's and Ryune's campaigns can be selected from the beginning, while the third one only unlocks upon completion of the earlier ones. All in all, the game includes more than 60 scenarios. While there are some branches in the mission tree, they are not as extensive as in the previous game. It is possible to import the results of one campaign into the beginning of another, leading to slightly different events.<br><br>Gameplay is only slightly changed from the direct predecessor. Players control their units via context-sensitive menu commands on a top-down view of the area, with battles being fought via animated scenes. Changes include the ability to set counterattack strategy per enemy turn instead of globally, the introduction of ranged attacks that can be fired in the same turn after moving, dead zones for ranged attacks, and area attacks. Besides leveling up pilots and upgrading robots, individual weapons can now also be upgraded. The power statistic of pilots is gone, and special robot attacks now require high enough stats in both willpower and piloting skill. Control and UI improvements include the display of to hit chance before an attack, quick switching between units, the display of active spirit powers on pilots, several shortcuts, and diagonal cursor movement.<br><br>Besides the usual assortment of Gundam, Mazinger and Getter Robo mechs, the game includes robots and characters from the series <i>Goshogun</i> and <i>Dunbine</i>, as well as a host of originals native to the La Gias scenario.",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Winky Soft Co., Ltd.",
  "released": "Mar 25, 1994",
  "alsoFor": "PlayStation, PlayStation 3, PSP, PS Vita | Combined View",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/super-robot-taisen-ex",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Winky Soft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 25, 1994",
          "ean13": "4 983164 730340",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/815675-super-robot-taisen-ex-snes-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/815676-super-robot-taisen-ex-snes-screenshot-demo.png",
      "caption": "Demo."
    }
  ],
  "cover": []
}