{
  "name": "Super Robot Taisen Gaiden: Masou Kishin - The Lord of Elemental",
  "shortName": "super-robot-taisen-gaiden-masou-kishin-the-lord-of-elemental",
  "description": "The world of La Gias, situated inside our Earth. For millennia, the Holy Kingdom of Langran ruled over the lands of La Gias with its long, proud history and an unprecedented level of technology. However, the days of the kingdom are numbered. Seers and scholars predict that the mighty state will fall in the next 10 years, thus bringing forth the destruction of their world. In an effort to stave off such a terrible prediction, Langran produces powerful machines, called the Masou Kishin, powered by pilot's sheer willpower, called &quot;pr?na&quot;. The majority of the people of Langran however, do not possess enough willpower to control these giant mechanical beings. In their last ditch effort, the kingdom summons a few people from the Surface (Earth). Among them is Masaki And?, a man that will rise to the challenge of putting an end to an almost invincible evil.<br><br><i>Masou Kishin The Lord of Elemental</i> is the first <i>Super Robot Wars/Taisen</i> game that does not feature any licensed franchises; instead, it tells the story of the original characters that were previously introduced in <i><a href=\"https://www.mobygames.com/game/nes/dai-2-ji-super-robot-taisen\">SRW 2</a></i>, <i><a href=\"https://www.mobygames.com/game/snes/dai-3-ji-super-robot-taisen_\">3</a></i>, <i><a href=\"https://www.mobygames.com/game/super-robot-taisen-ex\">EX</a></i> and <i><a href=\"https://www.mobygames.com/game/dai-4-ji-super-robot-taisen\">4</a></i>. Like its contemporaries, it is a turn-based tactical RPG game. The player goes through a comprehensive campaign, battling against enemies and leveling up their units. After battles, players can upgrade their units' stats. Alongside the battles, players experience the story through the eyes of the main protagonist and make important choices that can have an impact on how the story plays out.<br><br>While the core gameplay remains relatively the same as that of the previous classic <i>Super Robot Wars/Taisen</i> titles, <i>Masou Kishin</i> introduced a number of features that would be implemented in later games of the franchise. For one, the graphics are vastly enhanced: robots are represented in actual proportions during battle, instead of the &quot;super-deformed&quot; look of the previous titles. The battlefield is now in isometric position, compared to the top-down view of the previous titles. The isometric view also allows for more tactical depth: units attacking from behind deal greater damage than attacking from the front. Terrain also affects unit stats that can give a notable advantage over the enemy.",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "Winky Soft Co., Ltd.",
  "released": "Mar 22, 1996",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/super-robot-taisen-gaiden-masou-kishin-the-lord-of-elemental",
  "visual": "Isometric",
  "gamePlay": "Tactical RPG, Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "Winky Soft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 22, 1996",
          "ean13": "4 983164 730685",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1007726-super-robot-taisen-gaiden-masou-kishin-the-lord-of-elemental.png",
      "caption": "Title screen / Main menu"
    }
  ],
  "cover": []
}