{
  "name": "Super NES Super Scope 6",
  "shortName": "super-nes-super-scope-6",
  "description": "<i>Super Scope 6</i> is the pack-in game for the <a href=\"https://www.mobygames.com/search/quick?attribute=Super+Scope\">Super Scope peripheral</a>, which is required to play this game. The emphasis of <i>Super Scope 6</i>'s gameplay is on first person shooting, using the required Super Scope accessory to aim. It features a total of six game modes, categorized as either <i>Blastris</i> or <i>LaserBlazer</i>.<br><br><i>Blastris Mode</i> features a variety of unrelated games.\n<ul><li><b>Blastris A</b> is a falling block game based on <a href=\"https://www.mobygames.com/search/quick?game=Tetris\">Tetris</a> and plays very similar. Blocks appear on the left side of the screen and move towards the right side of the screen, where they will fit into play. The goal is to have the blocks on any column line up and destroy themselves. Each level requires five of these to happen. Unlike <i>Tetris</i>, the player cannot move or even rotate blocks. Instead each section of the block can be destroyed by shooting it. Higher difficulty levels increase the speed of gameplay</li>\n<li><b>Blastris B</b> is a falling block game based on <a href=\"https://www.mobygames.com/search/quick?game=Columns\">Columns</a> and <a href=\"https://www.mobygames.com/search/quick?game=Puyo+Puyo\">Puyo Puyo</a>. On each screen are a number of &quot;jelly blocks&quot; which must be destroyed to complete the stage. New blocks appear at the top of the screen and move towards the bottom where they fit into play. Blocks can be destroyed by lining up a row of 4 blocks of the same colour. The player is unable to move the falling blocks but may cycle their colour by shooting at them.</li>\n<li><b>Mole Patrol</b> is combination of Whack-a-Mole and a shooting gallery. A number of moles appear on the screen with a flag indicating the amount that need to be destroyed that level, before jumping into a pipe. From there the moles will climb out of any one of 12 holes on the screen and the player must shoot them as fast as possible. Along with regular moles are pink moles that will temporarily speed up gameplay, making shots more difficult.</li></ul>\n<i>LazerBlazer Mode</i> feature a group of games set in a military atmosphere.\n<ul><li><b>Type A: Intercept</b> is a first person shooting game where the player shoots down incoming missiles and airplanes. These missiles/planes appear on the right side of the screen and move towards the left side. A radar is also given to the player to keep track of overall positions of these objects on the screen. Ammunition is limited and the player must shoot down a certain amount each level.</li>\n<li><b>Type B: Engage</b> is a first person shooting game where the player shoots down incoming missiles and airplanes, which will cautiously open fire on the player. These missiles/planes appear in front of the player, in the distance and move towards the player. The player has limited energy which is decreased when hit by an enemy. A radar is also given to the player to keep track of overall positions of these objects on the screen. Ammunition is limited and the player must shoot down a certain amount each level. </li>\n<li><b>Type C: Confront</b> is a first person shooting game where the player shoots down incoming spacecraft, which will actively open fire on the player. These UFOs can appear anywhere on the screen and the player must shoot them down before they open fire on the player. Each hit by an enemy decreases the player's shield energy. A radar is also given to the player to keep track of overall positions of these objects on the screen. Ammunition is limited and the player must shoot down a certain amount each level. </li>\n</ul>",
  "publishedBy": "Nintendo of America Inc.",
  "developedBy": "Intelligent Systems Co., Ltd.",
  "released": "1992",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/super-nes-super-scope-6",
  "visual": "",
  "gamePlay": "Arcade, Falling block puzzle, Shooter",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Nintendo of America Inc.",
          "developer": "Intelligent Systems Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1992",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Intelligent Systems Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 21, 1993",
          "ean13": "4 902370 501674",
          "comments": ""
        },
        {
          "publisher": "Playtronic Industrial Ltda.",
          "developer": "Intelligent Systems Co., Ltd.",
          "ported": "",
          "country": " Brazil",
          "releaseDate": "Aug 30, 1993",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Nintendo of Europe GmbH",
          "developer": "Intelligent Systems Co., Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1994",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/265303-super-nes-super-scope-6-snes-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/459584-super-nes-super-scope-6-snes-screenshot-title-screen-european.png",
      "caption": "Title screen (European version)"
    },
    {
      "link": "/images/shots/l/459585-super-nes-super-scope-6-snes-screenshot-title-screen-japanese.png",
      "caption": "Title screen (Japanese version)"
    },
    {
      "link": "/images/shots/l/265304-super-nes-super-scope-6-snes-screenshot-aim-adjusting.png",
      "caption": "Aim adjusting."
    },
    {
      "link": "/images/shots/l/265305-super-nes-super-scope-6-snes-screenshot-game-selection.png",
      "caption": "Game selection."
    },
    {
      "link": "/images/shots/l/312745-super-nes-super-scope-6-snes-screenshot-blastris-game-a.png",
      "caption": "Blastris game A "
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/154935-super-nes-super-scope-6-snes-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/179520-super-nes-super-scope-6-snes-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States  and Canada",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/254442-super-nes-super-scope-6-snes-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Belgium , France , Luxembourg  and The Netherlands",
      "platforms": "SNES"
    }
  ]
}