{
  "name": "Toys",
  "shortName": "toys",
  "description": "Welcome to Zevo Toys, where whimsy and childlike innocence are the order of the day. Workers sing and dance as they make wondrous toys in their mission to bring joy to children everywhere. Unfortunately, Kenneth Zevo, the head of the company, is dying. While he’d like to leave the company in the hands of his son Leslie, he feels that Leslie has yet to learn to take life seriously and isn’t ready to run the company.<br><br>In a desperate gamble, he leaves his brother, the strait-laced and humorless Lt. General Leland Zevo, in charge of the company. He knows that his brother is ill suited to run the company, but also knows that his military methods and lack of any sense of humor and whimsy will spur Leslie to grow up if he wants to keep Zevo Toys the way it always was.<br><br>Alas, Kenneth’s plan is working TOO well: Leland is producing deadly weapons designed as toys. Tanks, helicopters, dolls, and balloons, among other things, have been designed with sinister and deadly intent. It’s a disgrace to everything that Zevo Toys stands for, and if Leslie wants to save the factory and the good name of his family, he’ll have to face his uncle head on and fight toy with toy.<br><br><i>Toys</i> is an isometric action game based on the 1992 surreal comedy/fantasy movie of the same name starring Robin Williams, Joan Cusack and LL Cool J. As Leslie, you’ll explore three areas of Zevo Toys (the West Bay factory area, the cafeteria, and the warehouse) in order to take down General Zevo’s elephant-head security cameras. To do so, you’ll have to take out the active defenders of each camera such as jeeps, Hurly-Burly Helicopters, Tommy Tanks, deadly pogo stick bears, bomb-toting balloons, and much more. When the defenders in one area are cleared, you’ll have to disable the camera. This is accomplished by blinding the camera’s eyes with water from your trusty water gun, then spraying the lens until the camera is destroyed. Careful, the movement of the camera will make things difficult, along with the laser mounted in the camera if you take too long...<br><br>The non-camera areas aren’t safe either, with wind-up walking bombs, amorphous slime globs, spiders and toy paratroopers backing up the defenders. Fortunately, your cousin Patrick will supply you with your own toys to combat the General’s army. These range from your trusty peanut gun to bowling balls and tops to custard pies and water balloons and so much more.<br><br>Once you’ve destroyed all the cameras, you’ll traverse a model of Manhattan via a giant toy plane. Avoid the the Hurly-Burly Helicopters and keep the plane charged using the giant charging coils, and you’ll reach the General’s office and shut down his plans.<br><br>It’s time to fight fire with marshmallows and let joy and innocence prevail!\n",
  "publishedBy": "Absolute Entertainment, Inc.",
  "developedBy": "Absolute Entertainment, Inc.",
  "released": "1993",
  "alsoFor": "Genesis | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/toys",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "Absolute Entertainment, Inc.",
          "developer": "Absolute Entertainment, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/330661-toys-snes-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/330662-toys-snes-screenshot-the-hat.png",
      "caption": "The hat"
    },
    {
      "link": "/images/shots/l/330663-toys-snes-screenshot-the-overall-story.png",
      "caption": "The overall story"
    },
    {
      "link": "/images/shots/l/330664-toys-snes-screenshot-more-intro-story.png",
      "caption": "More intro story"
    },
    {
      "link": "/images/shots/l/330665-toys-snes-screenshot-your-evil-uncle.png",
      "caption": "Your evil uncle"
    },
    {
      "link": "/images/shots/l/330666-toys-snes-screenshot-the-computer-security-has-detected-you.png",
      "caption": "The computer security has detected you."
    },
    {
      "link": "/images/shots/l/330667-toys-snes-screenshot-the-level-opening.png",
      "caption": "The level opening"
    },
    {
      "link": "/images/shots/l/330668-toys-snes-screenshot-starting-location.png",
      "caption": "Starting location"
    },
    {
      "link": "/images/shots/l/330669-toys-snes-screenshot-a-wind-up-bomb.png",
      "caption": "A wind-up bomb"
    },
    {
      "link": "/images/shots/l/330670-toys-snes-screenshot-if-you-die-you-drop-through-a-hole-in.png",
      "caption": "If you die, you drop through a hole in the floor."
    },
    {
      "link": "/images/shots/l/330671-toys-snes-screenshot-jeeps.png",
      "caption": "Jeeps"
    },
    {
      "link": "/images/shots/l/330672-toys-snes-screenshot-these-tanks-hurt.png",
      "caption": "These tanks hurt."
    },
    {
      "link": "/images/shots/l/330673-toys-snes-screenshot-helicopters-i-am-shooting-a-jeep.png",
      "caption": "Helicopters. I am shooting a Jeep."
    },
    {
      "link": "/images/shots/l/330690-toys-snes-screenshot-i-lost-all-my-lives.png",
      "caption": "I lost all my lives."
    },
    {
      "link": "/images/shots/l/330691-toys-snes-screenshot-now-my-evil-uncle-will-make-lots-more.png",
      "caption": "Now my evil uncle will make lots more war toys."
    },
    {
      "link": "/images/shots/l/330692-toys-snes-screenshot-game-over-and-final-score.png",
      "caption": "Game over and final score"
    }
  ],
  "cover": []
}