{
  "name": "Wizardry: Bane of the Cosmic Forge",
  "shortName": "wizardry-bane-of-the-cosmic-forge",
  "description": "It is said the the Cosmic Forge is a magical pen possessing an enormous power: whatever is written with it instantly becomes true. A group of explorers ventures into the castle that where the king, the queen, and the wizard who created the pen used to dwell. Nobody knows what has been happening there for the last hundred years, since nobody dares to enter the haunted castle. As the heroes step in, the doors behind them close forever. They are left alone to discover the truth about the Cosmic Forge and the drama that occurred between the castle's inhabitants.<br><br><i>Bane of the Cosmic Forge</i> is the sixth entry in the Wizardry series. While retaining the basic premise of creating a party of up to six adventurers to roam first-person dungeons and fight enemies in turn-based combat, this installment contains numerous enhancements and new features. It is the first game in the series to feature full color graphics and a mouse-driven interface. Combat options are more detailed, with precise weapon moves (such as thrust and bash) available. Magic is divided into six different schools, the spellcaster's powers increasing if he or she concentrates on one of them. Picking locks or disarming traps by thief-like classes is done actively by participating in a simple minigame. Characters can learn skills unique to their class when leveling up. These skills range from weapon proficiencies to field abilities that can be used outside of combat.<br><br>In addition to the traditional races of humans, elves, dwarves, hobbits, and gnomes, the player can choose between the Lizardman, the cat-like Felpurr, the canine Rawulf, the pixie-like Faerie, the intimidating Dracon, and the furry Mook. Each race has its own strengths and weaknesses, as well as predispositions to certain classes. Exotic character classes such as Valkyrie, Alchemist, Psionic, Ninja, Samurai, and Monk are also available during character creation, though they require a higher amount of bonus points received during the initial dice roll. It is also possible for characters to switch to another class during the course of the game.<br><br>Conversations with NPCs have been extended, the player being able to talk about various topics with the same character. The game also features a branching storyline: depending on the player's choice to believe or mistrust a key character, the plot will split into different directions, resulting in several different endings. The entire game takes place within the castle and its surroundings, without the possibility to travel back to the town or create other characters after the game has started. Unlike the previous entries, it is possible to save the game anywhere manually.",
  "publishedBy": "ASCII Corporation",
  "developedBy": "Sir-tech Software, Inc.",
  "released": "Sep 29, 1995",
  "alsoFor": "Amiga, DOS, FM Towns, Linux, Macintosh, PC-98, Windows | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/snes/wizardry-bane-of-the-cosmic-forge",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "SNES",
      "releases": [
        {
          "publisher": "ASCII Corporation",
          "developer": "Sir-tech Software, Inc.",
          "ported": "GAME STUDIO Inc.",
          "country": " Japan",
          "releaseDate": "Sep 29, 1995",
          "ean13": "4 988606 100774",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/84392-wizardry-bane-of-the-cosmic-forge-snes-screenshot-intro.png",
      "caption": "Intro"
    },
    {
      "link": "/images/shots/l/84393-wizardry-bane-of-the-cosmic-forge-snes-screenshot-title.png",
      "caption": "Title"
    },
    {
      "link": "/images/shots/l/84394-wizardry-bane-of-the-cosmic-forge-snes-screenshot-beginning.png",
      "caption": "Beginning the game"
    },
    {
      "link": "/images/shots/l/84395-wizardry-bane-of-the-cosmic-forge-snes-screenshot-choosing.png",
      "caption": "Choosing a party"
    },
    {
      "link": "/images/shots/l/84396-wizardry-bane-of-the-cosmic-forge-snes-screenshot-wandering.png",
      "caption": "Wandering through a dungeon"
    },
    {
      "link": "/images/shots/l/84397-wizardry-bane-of-the-cosmic-forge-snes-screenshot-magic-menu.png",
      "caption": "Magic menu"
    },
    {
      "link": "/images/shots/l/84398-wizardry-bane-of-the-cosmic-forge-snes-screenshot-character.png",
      "caption": "Character info"
    },
    {
      "link": "/images/shots/l/84399-wizardry-bane-of-the-cosmic-forge-snes-screenshot-combat.png",
      "caption": "Combat"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/98518-wizardry-bane-of-the-cosmic-forge-snes-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/98519-wizardry-bane-of-the-cosmic-forge-snes-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "SNES"
    },
    {
      "link": "/images/covers/l/98520-wizardry-bane-of-the-cosmic-forge-snes-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "SNES"
    }
  ]
}