{"name": "1943 Kai: Midway Kaisen", "overview": "1943: The Battle of Midway Mark II is a vertical scrolling shooter arcade game released exclusively in Japan by Capcom in June 1988. It is the third game in the 19XX series, an update of 1943: The Battle Of Midway, released a year prior. The title of this game translates from Japanese as \"1943 Modified - Midway Naval Battle\"<br><br>Not a proper sequel per se, 1943 Kai is a Japan-only re-vamp of the original 1943 that keeps the same setup and gameplay, while making a few minor tweaks here and there for variety's sake. A sturdy biplane replaces the staple P-38, the level count has been reduced from 16 to 10, and the weapon selection available from the 'Pow' icons has been increased to include the rare 'wingmen' option and a super-efficient 'laser' (a special weapon that could only be obtained via a hidden code in the foriginal 1943). Not just that, every weapon can now be individually powered-up by picking up the same icon twice - so word to the wise: go for two lasers and some wingmen immediately.<br><br>Well, some might say that it is almost exactly the same as its predecessor, yet 1943 Kai does have a slightly different flavour: it features an all-new soundtrack, and the overall rhythm of the game game has been increased. If anything, the core of the game is better - but then its kitsch biplanes, over-the-top weaponry and outrageous background colours (red sea?) give it a slightly tacky re-hashed feel, and make it loose the gritty pseudo-realism of the original.<br><br>The difficulty has been upped so that the game is even more unforgivably fierce... It's a quicker, tougher challenge - a souped-up remix specifically concocted for those who enjoyed the original.", "platform": "Arcade", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.84", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=aKhQ33Ngdf0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/34847"}