{"name": "2 Spicy", "overview": "2 Spicy is a cover based third person shooter made for arcades. The game is built around one-on-one fights between two players and is controlled with light guns and pedals. Pointing the gun at the screen allows the player to fire at the enemy while pointing away from the screen causes the player character to hide behind a cover such as an oil drum or a pillar. Moving between different covers is done by stepping on one of two pedals, causing the character to move either left or right. Stepping on a pedal twice allows the player to do jump shots when aiming at the screen and a dodge when aiming away. Aiming on the enemy for a certain amount of time causes the camera to zoom in and the player's attack power will be increased and it is possible to do a head shot for a large amount of damage. It's possible to destroy some of the covers and an nearby enemy will take damage and be knocked out. When knocked out the player has to quickly step on a pedal to get back up.<br><br>There are two game modes: versus mode and story mode. The versus mode can be played in multiplayer by connecting two cabinets or against an AI opponent on a single machine. A match is won by the player that first wins a specified number of rounds which happens when the opponent's health level goes down to zero. The winner moves on to the next stage which is played against an AI opponent. In the story mode each of the game's six characters has its own story. The objective is to clear missions which involve defeating an enemy within a time limit. The player has three mission stars and when failing a mission a star is deducted. The game ends when the player runs out of stars but it is possible to gain more stars by completing bonus missions.", "platform": "Arcade", "release_date": "April 1, 2007", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega", "publishers": "Sega", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.09", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=NPrMq_j5Wyo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/34849"}