{"name": "After Burner: Climax", "overview": "After Burner Climax is a sequel to the long-running After Burner series. Just like the previous games players command an aircraft from a third-person view, engaging enemies, dodging enemy fire and rockets and navigating through canyons and narrow passages. Gameplay requires quick reflexes and is arcade-like in design. The iconic F-14 Super Tomcat of the previous games has been replaced by a F-14D Super Tomcat with the addition of two new aircraft, F/A-18E Super Hornet and F-15E Strike Eagle.<br><br>In the standard EX arcade mode there is a branching mission path with various objectives. Sometimes enemies need to be engaged, while other times friendly fighters help along, stealth must be used, or a specific target needs to be pursued and taken out. There are two main weapons: regular cannon fire for close distances and rockets that can only be used when they are locked on. There is also a Climax gauge that can be activated when it is full. Time slows down and multiple enemies can be targeted. As soon as the aircraft leaves the Climax mode, all selected targets are engaged with rockets at once. Cannon fire is unlimited, and rockets as well, as long as the player does not use them constantly. At the same time enemy rockets need to be dodged by moving up, down, left or right, or doing barrel rolls. Just like the previous game in the series there is a limited amount of manoeuvrability without complete freedom. It is however possible to move the speed of the aircraft.<br><br>During the games players can unlock many EX options to further customize the arcade mode, as well as make available different paint schemes: Standard, Camouflage, Special and Low Visibility. There is also a secondary scoring mode with an unlimited amount of credits.", "platform": "Arcade", "release_date": "November 1, 2006", "game_type": "Released", "esrb": "Not Rated", "developers": "SEGA AM2 Co., LTD", "publishers": "Sega Corporation", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.4", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=gSYuw_gx2ws", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7585"}