{"name": "Agress: Missile Daisenryaku", "overview": "Agress is a fast-paced puzzle game with a war setting. The game is played between two sides (either a computer-controlled opponent or a second player) on a fixed screen. The two sides each control a launcher vehicle that can shoot missiles. The player needs to reconstruct the shape as shown in the top window. This is done by solving a sliding puzzle. In early levels shapes only contain three or four blocks with a single colour, while later levels introduce complex shapes with multiple colours. If a shape is successfully created a new one is provided. Behind the board, blocks with different types of missiles are hidden with a lay-out that is changed with each new shape. If a shape is formed on top of a missile block, the missile is launched. That way, not only creating the shape is sufficient, the player also needs to strategize to move the shape in a certain direction to cover as many missiles as possible.<br><br>When a missile is launched this is shown near the top of the screen. It travels across the map and either collides with a missile of the opponent or with the launcher vehicle itself. When the latter occurs a green part of the map is coloured in and conquered. The goal however is not to conquer the entire map or to destroy the opponent, the player needs to reach a certain level before too many hits are sustained. In the first stage for instance level ten needs to be reached, meaning the player has to construct ten shapes before being destroyed. The missile aspect can however not be ignored or too much damage will be received before the required level can be reached. Some board lay-outs have a special red missile that clears the entire line of missiles on the screen instead of just one. At the start of the stage the player also receives a number of missiles that can be fired right away in emergency situations.<br><br>After a successfully completed stage a bonus is provided through a slot machine mechanic. When there are two players both boards are shown and there is a time limit. When playing against the computer there is no time limit, but the computer's board is hidden. The game has no real story and the regions/countries on the map are fictional, but both Saddam Hussein (Iraq) and George H. W. Bush (USA) are shown in the introduction, referencing the Gulf War (1990-1991).", "platform": "Arcade", "release_date": "1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Palco", "publishers": "Palco", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=cWWS16rbbJE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/34910"}