{"name": "Ajax", "overview": "The player has been issued an emergency order. He must save the earth from being conquered by enemy forces. He climbs into his helicopter and prepares for intense aerial combat. Shooting oncoming enemy aircrafts and bombing the enemies below, he tries to make his way through the different stages to reach the enemy base. When he finishes the first stage, he is transported to his next mission by ab aircraft carrier. He hops into his jet fighters, tanks, ships, helicopters, and aircraft carriers. The player must also be aware of unseen enemies and surprise attacks.<br><br>Different kinds of power ups can be obtained throughout the game. These include:<br>'3' 3-Way: Bullets fire forward, right, and left.<br>'L' Laser: Player can shoot double lasers.<br>'T' Triple: Missiles are fired that spread out three ways in front.<br>'V' Vulcan: Rapid bullets are fired in the directions controlled.<br>'B' Bomb: Air to ground missles which can be upgraded twice.<br>'O' Orbital: A small drone using the same weaponry as the helicopter which can be otained by clearing a special formation of little red fighters.<br><br>There is an additional super weapon that destroys all the enemies on the screen at once. However, use of this weapon is limited.<br><br>Ajax contains 2 different types of stages: 2-D and 3-D. In the 2-D stage, the player controls a helicopter. In the 3-D stage, the player commands a jet fighter.<br><br>Ajax features some impressive graphics filled with rotation and scaling effects (some may get a little dizzy, though!), a solid soundtrack and excellent game control. Highly recommended for any shoot'em up enthusiast!", "platform": "Arcade", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.7", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=OStGZzUWcbE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7582"}