{"name": "Akai Katana", "overview": "Unleash the power of the Blood Katana! The Empires war has ravaged the world and the people are suffering in its relentless pursuit of domination using the feared Blood Katanas. The sacrifices have been great, their deaths giving power to these blades. Do you have the strength to lead a small band of rebels to victory in the face of overwhelming odds?<br><br>Akai Katana is a bullet hell shooter video game developed by CAVE Interactive CO. that was released on August 20, 2010 in arcades. <br><br>The game allows the player to choose between three different ships, each with two characters (one pilot and one gunner/ninja) and an option. Once a meter fills it becomes possible to enter ninja mode, in which the ship transforms into the ninja character and its two shot types (spread and focused) are replaced by an offensive and a defensive mode. In offensive mode, the character fires an extra powerful shot. In defensive mode, all bullets get reflected when they come close enough, and enter a state in which they continuously home in on the player character until Ninja Mode is deactivated or the enemies that fired them destroyed. If said enemies are destroyed before Ninja Mode is deactivated, the bullets turn into gold that circles the player until the end of Ninja Mode, when the ship absorbs them and the player's score is boosted.<br><br>Warning: the game is no longer playable on newer versions of MAME due to pressure from CAVE to remove the game, if you want to play the game, you have to use an older version of MAME, or an alternate emulator such as Final Burn Alpha, or other emulators from that series.", "platform": "Arcade", "release_date": "August 20, 2010", "game_type": "Released", "esrb": "Not Rated", "developers": "Cave", "publishers": "Cave", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "4.37", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=JSfM9g4DWxs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75166"}