{"name": "Alpine Racer 2", "overview": "Alpine Racer 2 is a 3D Alpine skiing arcade game released by Namco in 1996. It is the sequel to Alpine Racer.<br><br>Alpine Racer 2 is a downhill ski racing game and the sequel to Alpine Racer. Just like the original title it is played on a large cabinet where the player stands on a set of ski-like foot stands that are moved with horizontal motions to steer and taking corners while holding onto two bars for stability. There is also an edging element when the pressure applied to the inside and outside edges of the foot stands are measured, as an additional means to control speed. Edging is affected by the surface, it has for instance more effect on snow than on ice.<br><br>At the start of the game the player can select one of three skiers (racing, free skiing or mogul). It has the same two game modes as the original game: either speed racing to reach the finish before computer-controlled opponents do or gate racing as a race against time. There are two courses for each game mode: a hi-speed course of a technical course. The technical course is faster and has short-cuts, but also more obstacles. Each slope is split up into different sections separated by gates that extend time in the race mode. In the gate racing mode the skier has to pass as many gates as possible, but missing gates does not lead to disqualification. A replay of the run with different perspectives is shown after the game is over. Compared to the first game the game environment has more elements in the background.<br><br>Entirely new is the ability to link two cabinets for head-to-head racing", "platform": "Arcade", "release_date": "December 6, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Namco", "publishers": "Namco", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=nrLksyfTpLA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11617"}