{"name": "APB: All Points Bulletin", "overview": "The overhead view of Officer Bob's police car scrolls in every direction. Catch wanted criminals and force them to confess. Eat doughnuts for extra time, avoid demerits and be sure to meet your quota of arrests!<br><br>Join Officer Bob on a very politcally-incorrect, never-ending quest to meet his daily quota by arresting hitchhikers, litterbugs, honkers, dopers, speeders, assaulters, murderers, and the A.P.B.'s themselves. Bring in A.P.B.'s for questioning but do not get caught or else they will be released because of police brutality.<br><br>Officer Bob starts each day at one of several police stations in the area. His daily quota is presented and you must use a targeting crosshair to arrest offenders by tapping the appropriate amount of times (or shoot them if you have the gun) to arrest them. Time and fuel are limited so you need to find donut huts and stands or donuts lying off the beaten path to extend your time and gas pads or tow trucks to get more gas. Once you have met your quota, scores are doubled for each subsequent arrest. Return to the station before time/gas runs out for a bonus.<br>You get demerits for collisions without your siren on, crashing, exploding and running over pedestrians. You can lose one demerit every 10,000 points or if you drive a perfect day (meeting your quota without ANY collisions, explosions, or other wrong doing).<br><br>Every other day (starting with the 3rd day), the chief will present an A.P.B. that you can catch and provide information as to where he/she was last seen. You must then find and wear down their \"resist-o-meter\" and ram them off the road to capture them. Return them to the station before time/gas runs out and you will not need to fill your quota that day. After capturing, you must then make them confess by rapidly tapping the siren and gun buttons to bring the \"confess-o-meter\" up to full before the chief walks in and sees you choking them. If you get caught, the A.P.B. is let go and you get one additional demerit for each item you failed to take care of on your quota, thus it's usually a good idea to fill as much of your quota as possible before capturing an A.P.B.<br><br>There are 10 A.P.B.'s total, but the game does not end if you capture them all. The game ends when you hit your demerit maximum.", "platform": "Arcade", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari Games", "publishers": "Atari Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.81", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=KTDy9qXzT0M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11620"}