{"name": "Argus (Gottlieb)", "overview": "Protect the citizens of earth! As Gottlieb's Argus, shoot villains and hazards with energy bolts. Hold down catch button to rescue falling citizens and catch falling cars. Shoot or catch rubble before it crushes someone. Game ends when no citizens remain.<br><br>This caped superhero game is a very rare unreleased prototype. The game was originally called 'Protector' (the official test name was 'VideoMan'). Tom wanted Gottlieb to get the Superman license but they didn't. 'VideoMan' was too close to 'SuperMan' so they went with 'Protector', but the name was also changed at one point to 'Guardian', and then 'Argus' (designers' joke name became 'ProVidGuardArgus').<br><br>During a couple of focus group tests of the game, players suggested using a joystick instead of a trackball to control the superhero (Test players perceived the results as the trackball performing badly). Tom did that. It was worse. Unfortunately, there are some kinds of action that should not be controlled by a proportional controller (unless it has tactile feedback) - Argus had this kind of game action. Argus did have some fun stuff, like the ability to knock chunks out of buildings (Warren did the rubble stuff) and pick up a city bus.<br><br>The game may have been buggy, Tom was not the best designer or programmer, but the game design was primarily responsible for it's failure to test well. You have to remember that this was early days in computer game design and there were lots of elaborate ways to fail for the first time. Tom was a pioneer in his own way. Argus's failure was hard to accept, as \"Reactor\" had not done well either.", "platform": "Arcade", "release_date": "1984", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Gottlieb", "publishers": "", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.54", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=cxvQT2KqOOU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107904"}