{"name": "Arm Wrestling", "overview": "The player faces off against a beefy Texan, a Sumo, a masked fighter, a robot, and a mutant in a series of arm-wrestling contests. Timing and quick joystick motions are key to victory.<br><br>In this game, each time you face a different opponent, push the joystick left to arm-wrestle your opponent. Whenever your opponent starts to act, push the joystick right to counterattack and press the button to increase your power. If you do not counterattack, move the joystick back and forth several times to prevent yourself from being pinned. You must try to pin your opponent before the counter reaches one minute or you will lose.<br><br>Opponents:<br> -- Texas Mac.<br> -- Kabuki - His arm is harder to budge than the first opponent.<br> -- Mask X - He will try to ram you with his head and each time he attempts to do so, move the joystick right to avoid him. Before you can pin Mask X, you must unmask him by pulling the joystick up rapidly. Once uncovered, the fighter will turn out to be Bald Bull from the game Punch-Out!! After Mask X has been defeated, the master of ceremonies will throw you a bag of money worth 50,000 bonus points, but you must catch it by pulling up in order to receive the points.<br> -- Alice and Ape-III - These opponents must be counterattacked up to three times. Before you can pin Ape-III, you must grab the magnet (worth 10,000 bonus points) in his other hand by pushing the joystick right. You will have two chances to get the magnet, but if you miss twice, you will lose.<br> -- Frank Junior - He will occasionally give a signal with his hand and say \"Wait!\" Before you can pin him, you must move the joystick left to avoid the flames that he will shoot from his mouth. If you beat him, you will have a chance to catch another money bag worth another 50,000 bonus points.<br>After defeating all the opponents, the game begins again with increased difficulty.", "platform": "Arcade", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo R&D3", "publishers": "Nintendo", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "3.31", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=RlOZcZLb4So", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11631"}