{"name": "ATV Track", "overview": "ATV Track is a racing game with all-terrain quads set in South America covering both the Amazon and the Andes. Players race on courses with a large variety of terrain such as beaches, forests, canyons, ice roads, volcanoes and rivers. At the start of the game the player chooses a character (Zack or Jill) and one of the four available quads. Players race against time with the goal of driving as long as possible to complete the circuit by reaching the checkpoints in time for a time extension. A circuit is made up out of three routes that consist of five parts each. There is a short break between the three routes. For every part fifteen seconds is provided. If it takes longer the player receives a strike and after three strikes the racer is disqualified. Taking longer than fifteen seconds also eats away at the surplus of fifteen seconds that is provided at the start. When the surplus is gone, the game is also over even if no three strikes were received.<br><br>There are four circuits in total and they can be played in two modes: Practice or Competition. Practice is a pared-down experience that makes it easier to get used to the gameplay. Circuits are often filled with obstacles, opportunities for stunts and also other racers that can block the road. The game's cabinet has a motion seat shaped like an ATV. The player sits leaning forwards with the hands on the handlebars with brakes available for both hands. The left hand has access to the rear brake and the right hand to the front brake. The right handle has a button for most of the menu actions in the game. There are two foot pedals to accelerate and start. In the middle, in front of the player, there is an emergency stop button as well. Body movement is used to steer left or right. The seat can hold two riders and there are foot pegs for the comfort of the passenger.", "platform": "Arcade", "release_date": "2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Gaelco", "publishers": "Gaelco", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "4.43", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=DqLEC0FtzBg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35020"}