{"name": "Ave Fenix", "overview": "Ave Fenix (Recreativos Franco, Spanish bootleg of Phoenix)<br><br>Phoenix is an outer space-themed, fixed shooter video game similar to Taito's Space Invaders. It was developed by Amstar Electronics (which was located in Phoenix, Arizona) in 1980, and released by Centuri in the United States and by Taito in Japan. The Phoenix mothership is one of the first video arcade game bosses to be presented as a separate challenge. This was before the term boss was coined. The player controls a spaceship that moves horizontally at the bottom of the screen, firing upward. Enemies, typically one of two types of birds, appear on the screen above the player's ship, shooting at it and periodically diving towards it in an attempt to crash into it. The ship is equipped with a shield that can be used to zap any of the alien creatures that attempt to crash into the spaceship. The player cannot move while the shield is active and must wait approximately five seconds before using it again. The player starts with three or six lives, depending on the settings. Each level has five separate rounds. The player must complete a round to advance to the next. Rounds 1 and 2 – The player must destroy a formation of alien birds. While in formation, some of the birds fly down kamikaze style, in an attempt to destroy the player's spaceship by crashing into it. Hitting a bird flying diagonally awards a bonus score. The birds are yellow in round 1, pink in round 2. The player's spaceship is given rapid fire for round 2, where the birds fly somewhat more unpredictably. These rounds are highly reminiscent of Galaxian. Rounds 3 and 4 – Flying eggs float on the screen and seconds later hatch, revealing larger alien birds, resembling phoenices, which swoop down at the player's spaceship. The only way to fully destroy one of these birds is by hitting it in its belly; shooting one of its wings merely destroys that wing, and if both wings are destroyed, they will regenerate. From time to time the birds may also revert to the egg form for a brief period. The birds are blue in round 3, pink in round 4. The mothership in Phoenix is one of the first bosses to appear in an arcade game. Round 5 – The player is pitted against the mothership, which is controlled by an alien creature sitting in its center. To complete this round, the player must create a hole in the conveyor belt-type shield to get a clear shot at the alien. Hitting the alien with a single shot ends the level. The mothership fires missiles at the player, moves slowly down towards him, and has alien birds (from rounds 1 and 2) protecting the ship. Defeating all the birds will produce a new wave. The game continues with increasing speed and unpredictability of the bird and phoenix flights.", "platform": "Arcade", "release_date": "1980", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "", "publishers": "Recreativos Franco", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=mSPDVaBzy0E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/152867"}