{"name": "Baluba-louk no Densetsu", "overview": "The object in each stage is to collect all the chests while avoiding the monsters that guard the treasures. The simplest method is to grab all the closed chests, but opening them will provide the means to attack the monsters. Chests can be opened by jumping up and hitting the platform from below. Some chests will reveal coins while others may reveal a jewel. If you hit a chest with a jewel a second time, the jewel grows larger.<br>Scattered throughout the stages are bombs. If you jump while in front of a bomb or hit the bomb from below, you will detonate it and any monsters caught in the blast will be briefly stunned. Collecting opened chests of coins or small jewels will leave more bombs for you to use.<br><br>Collecting opened chests with large jewels leaves traps that can be used to destroy monsters. Traps are activated just like bombs (jump while in front of them or hit them from below) and they shoot a bolt in both directions. Monsters killed by the shots will leave behind special items (designated by Greek letters) that contain rewards like bonus points, warp tunnels and changing all the chests on screen into large jewels.<br><br>Also, on each level is at least one power pill. Collect this and you can temporarily turn the tables on the monsters for a short time, grabbing them for bonus points. If you manage to grab all six, the last will be worth 10,000 points.<br><br>Once the last chest has been collected, the stage is cleared and you receive bonus points based on your skill and the time remaining. You then move on to the next room.", "platform": "Arcade", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Able Corporation", "publishers": "Able Corporation", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "3.79", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=FS5tWm6-eSc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35046"}