{"name": "Batman (Raw Thrills)", "overview": "In Batman, players control Batman as he drives the Batmobile through Gotham City to recapture supervillain escapees from Arkham Asylum. Players can choose to pursue the Joker, Bane, or Mr. Freeze; each of these gameplay routes, available in \"easy\" and \"hard\" variations, features a predetermined set of six vehicular combat missions to complete. Players must use the Batmobile to chase and eliminate specified targets, such as vehicles filled with henchmen. Certain missions feature other Batman villains, such as the Scarecrow, the Penguin and Catwoman, while one mission in each gameplay route sees the player fly The Bat from The Dark Knight Rises. Weapon upgrades such as a Sky Drone, Batarangs and a Battering Ram can be collected to more quickly and effectively destroy targets. A timer is constantly decreasing during gameplay; the remaining time is extended with each mission successfully completed. The game ends when the timer fully depletes or the Batmobile is destroyed, at which point the player is given the choice to insert additional credits to resume play or abandon the game.<br><br>The game has a profile system for players to save their game progress and resume at a later time. Ten different Batmobile designs from previous Batman media are available for use in the game. The full list includes the following:<br><br>Batman (1966 TV series)<br>Batman (1966 TV series) (Chrome Version)<br>Batman (1989 film)<br>Batman: The Animated Series<br>Batman Forever<br>Batman & Robin<br>The Dark Knight<br>Batman: The Brave and the Bold<br>Batman: Arkham Asylum<br>The Dark Knight Rises", "platform": "Arcade", "release_date": "December 1, 2013", "game_type": "Released", "esrb": "", "developers": "Specular Interactive, Inc.", "publishers": "Raw Thrills", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.12", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=RSdN3t-yTPk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127303"}