{"name": "Big Striker", "overview": "The game view is isometric, with scrolling in all directions and field oriented horizontally. Playability remembers some previous games, but there are also some innovations, including using a third button to make fake to avoid opponent markers. With the first button in the possession of the ball, passes to the comrades: according to the pressure time you can decide the height and length of the passage itself; it is also possible to make flight passes; during non-possession the ball is slipped in order to steal the ball to the opponent.<br><br>With the second button, if you are away from the opposing goal, you kick the ball long and high as if you want to sweep it away from the area, while in the proximity of the opponent's penalty area an angle can be made into an angle; If you use that button on a high ball or bounce you make a first shot that varies depending on the height of the ball from the ground (inverted, semi-kicked, shot before, head-to-head). With the third button in possession of the ball you make a fake (bicycle, cuauhtemiña or double step) making the player at that moment invulnerable to the attacks on slipped by the opponents; it should be noted that after performing a fake time it is necessary to make a new one.<br><br>When you are near the opposing area below, you will see a side view of your own bench with the teammates who encourage the team; if at that time it is located on one of the two bands, the bench on the bench has the word \"centering\", thus proposing to the player to make a cross in the area. The selectable teams are eight and the levels are seven. As a cliché for time games there are no reserve divisions.<br><br>Different meteorological situations such as rain show up.", "platform": "Arcade", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Jaleco Ltd.", "publishers": "Jaleco Ltd.", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "3.82", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=9i3t4Yu3vPo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33827"}