{"name": "Blaster", "overview": "First-person shooter. Use a 49-way optical flight control/joystick with thrust and fire buttons to fly through different levels (space, time warp, asteroid fields, etc.) shooting various enemies, objects, and picking up lost spacemen. Receive extra points for shooting all enemies in a wave, flying through obstacles, and reaching level 20, \"Paradise\".<br><br>You are in the cockpit of your spaceship flying through outer space battling wave after wave of deadly enemies. Stranded astronauts tumble through space, and you can rescue them to score additional points or ignore them and just try continuing to survive.<br>Groups of enemies can attack from the front or the rear, and it is not unusual to have a dozen or more enemies on the screen at once, all firing deadly missiles at you or trying to collide with your ship.<br><br>Everything moves with true 3-D perspective, and you control your ship's flight with a Zaxxon-like joystick.Fire and thrust buttons are located on the joystick beneath your index finger and thumb(with optional buttons on either side of the control panel), giving you simple and powerful control with one hand.<br><br>The game has 20 different waves. The Attack Waves can be divided into nine basic types:Planetoid Waves, Robot Grid Waves, Saucerland Waves, Vampire Waves, Time Tunnel Waves, Outer Space Waves, Enduro Waves, Cat World Waves, and Mastermind Waves.The waves Armageddon and Paradise, each only occur once throughout the game.<br>The game lets you choose the beginning wave for your game. You can start on any of the first four waves:Planetoids, Robot Grid, Saucerland, and Vampires. After you choose a beginning wave, the game begins. You start with three lives, and you are awarded an extra life every 100,000 points. Each life is equivalent to three shields, and one shield is lost each time you run into a rock, planet, enemy or missile. The shield indicator at the top of the screen lets you know how many shields you have left; the first collision takes away one-half of the shield indicator, the second takes away the rest of it and flashes an \"ENERGY CRITICAL\" warning and after the third hit the cockpit window shatters and a life is lost.<br><br>At the end of the game, you are given the option of beginning another game from the point where your first one had ended. If you insert another coin and press the start button before the 10-second timer expires, you can start playing right where you stopped,with the same score. Bonus lives are awarded at the same scores on continued games, so by using this feature you can \"buy\" a high score, but only up to Wave 20, the continuation option is no longer available; this makes the high score on the game more meaningful.<br><br>Throughout the game various kinds of enemies appear in groups. These groups vary in numbers from two to ten, and the number of enemies in the next group is unpredictable. Bonus points are always awarded for destroying an entire group, so you should always try to blast all the enemies in a group. This is true in all waves. The exact value of each of the group bonuses is explained in detail under each kind of wave below.<br><br>In addition to the group bonuses, a 100,000-point super-bonus is awarded for destroying all the groups in a Saucerland Wave, Cat World Wave, or Mastermind Wave.This feature is not included in the Vampire Wave.<br><br>Because of the group bonuses and super-bonuses, the best way to play is to try to blast every single nemesis you see. This is particularly important when you consider that the continued-play option does not work after Wave 20; if you are \"buying\" a high score by restarting after every game, you will need to make the first 20 waves count as much as possible. Or else, you will get to Wave 20 with a lower score than other players.<br><br>Throughout the game, except in the Time Tunnel Waves, you must continue to battle all enemies who attack you in most other waves, including Robots, Androids, Es (which can restore your shields to full strength, if you blast them), Runaway Ships, Flying Saucers, Vampires, Space Cats, Deathriders, Masterminds, Destroyers, X-29 Fighters, Starcruisers, Destruktor Satellites, Space Robots, Space Cowboys and so on. The Time Tunnel Waves are the only peaceful waves where there are no enemies at all but you attempt to rescue stranded astronauts as you do throughout the entire game.<br><br>In Armageddon, you will battle almost all the enemies from all the other waves. When you make it to Paradise, there are no enemies at all in that wave, and you do not even score any points. You just fly through space and watch a show. After the show is over, you are awarded 1,000,000 bonus points and three extra lives and then you are sent back to Wave 10.<br><br>The astronauts who can can rescue as you fly through space are worth 1000 points each, with the value increasing by 200 for each astronaut you catch without a miss, up to a maximum of 2000 points.", "platform": "Arcade", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Vid Kidz", "publishers": "Williams Electronics", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.42", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=agEQ7YIYk0A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11685"}