{"name": "Bubble Trouble", "overview": "Bubble Trouble: Golly! Ghost! 2 (バブルトラブル: ゴーリー! ゴースト! 2 Baburu Toraburu: Gōrī! Gōsuto! 2?) is a electro-mechanical/video game hybrid released in 1992 by Namco only in Japan. It is the fifth game from Namco to not allow scores end with \"0\", and as the name suggests, it is the sequel to Golly! Ghost!, whichw as released two years earlier in 1990. It runs on Namco System 2 hardware, with a Yamaha YM-2151 FM for music.<br><br>The game is very similar to the original Golly! Ghost!, but is themed around sunken treasure, taking place at the bottom of the ocean, where the player(s) use the lightguns codenamed \"ZIP\" and \"ZAP\", and must shoot aquatic creatures such as fish, crabs, seahorses and pirahnas. The player can shoot the bonus characters (which are the four ghosts from the original title, ableit with aquatic gear), which can range from 2 to 5 points apiece. If the player gets to the end of a level, a boss will appear, including a ghost pirate, a large idol, a giant octopus, and a large glob of polluted water. The players will move on to the next level if they shot enough enemies, but will lose if they fail to do so. The fifth scene is very remiscent of the fourth level of Golly! Ghost!: the enemies will form into a large monster, which must be killed before the timer reaches 0. If the player completes all of the levels, the ghost will flee from the \"Southern Island\" shown in the game's attract mode, and the game ends. If the player shoots every enemy after the boss dies in the final level, the player will be shown a special credits screen", "platform": "Arcade", "release_date": "1992", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "2.22", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35296"}