{"name": "Bullet", "overview": "Bullet is an overhead run'n'gun twin-stick shooter for up to three players, set in a dark future. The left joystick will move your character around while the right joystick will make your character fire in the pressed direction, allowing you to move and shoot freely in different directions.<br><br>Teenage resistance fighters Emmy, Fred and Chris have to go down through the six levels - ranging from destroyed city streets through subway tunnels, sewers, underground tunnels and so on - and defeat the before reaching the elevator to the next level, in order to reach and bring down the Robot Master and save the world. All the time, an endless supply of enemies will charge in from the edges of the screen. Enemies come in several visual flavors but most act the same and simply run towards you at the same pace, while a few will also shoot at you. All regular enemies can be destroyed with a single shot, instead relying on their large numbers. There are also indestructible turrets keeping you on your toes.<br><br>Except for the final boss, all others are variations of the same encounter with the enemy commander sitting on a chair at the top of the screen attacking with a clone image of himself while turrets and moving electrical pillars defend him. A constant stream of enemies advance from the edges, but damaging the boss will destroy all enemies on the screen.<br><br>Your weapon meter can be upgraded by standing on special platforms which will upgrade your projectiles at certain thresholds, maxing out at level four. These platforms can only be used once even if you did not stand on it long enough to drain all the available power. Firing will drain your weapon power, eventually reducing it to the previous level as it's used and and must be regularly charged up again by finding another platform. The more powerful weapon levels drain power quicker.<br><br>There is no continuing with a single player. In a multiplayer game, as long as at least one player is alive others can join in. On the final level of the game there is no joining or continuing at all.", "platform": "Arcade", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega AM1", "publishers": "Sega", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "2.67", "wikipedia": "", "video_link": "https://youtu.be/N6zARWRGXWY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35308"}