{"name": "Cheyenne", "overview": "A shooting game, with a western motif. The player uses a gun (mounted to the cabinet) to escort the sheriff through a variety of dangers, gathering bounty for capturing criminals.<br><br>In this game, you must protect lawman Buster Badshot from some of the most wanted outlaws in the West. Each level has three or more stages that can be chosen in any order by simply shooting the hanging picture. These stages are set in places like saloons, mines, deserts, forests, ghost towns, graveyards and canyons. After all the stages have been completed, you move on to a bonus target practice stage where if all the objects are hit within the time limit, you are awarded a Bonus Buster. At the conclusion of the bonus stage, you increase levels where new stages await.<br>On each stage, Buster Badshot will encounter many perils and be attacked by a variety of enemies as he travels. You must shoot any attacker or object that will harm him. Objects that are shot or thrown include bullets, knives, arrows, shovels, cannonballs and bombs. The wild animals that attack include coyotes, bats, buffalos, wildcats, beavers, bears, wolves, skunks, raccoons, birds and rats. Other perils include ghosts, falling boulders, floating twigs and runaway mining cars.<br><br>The gangs of outlaws are comprised of cowboys, women, Indians, hillbillies, Mexican bandidos or various mixtures of these. The sizes of the gangs range in size from two to four members and each carries a unique name like \"The Petticoat Floozies\" (Slu Foot Sue, Elvira and Lotta Love), \"The Dalton Gang\" (Big John Dalton and Emmet Dalton), \"The Apache Braves\" (Buffalo Breath, Running Bull, Geronimo and Running Nose), \"The Banditos\" (Lu Ren, Pancho Mancho and Cisco Disco), \"The Pawnee Tribe\" (Crazy Horse, Falling Rock, Flying Arrow and Bloody Hawk) and so on. Gang members are different from the other characters on the screen since their colors flash, but each must be shot (captured) in order to complete the stage. After the entire gang is captured, the stage's introductory screen will be shown again with iron bars being placed over the wanted poster of each outlaw while the red word \"Paid\" is stamped over the reward on each wanted poster. From here, you return to the main screen containing the pictures of the remaining stages.<br><br>The rewards for captured outlaws starts at $100, goes to $250 and then increases by $250 ($100, $250, $500, $750, $1000 ...). In the mine stages, shoot the dynamite in the wall for $5000. Between stages, if you shoot the picture that says \"Deposit Gold\", the bounty you've earned will be multiplied by the number of levels you've completed and then added to your score. The longer you wait to cash in your gold, the larger your bonus will be. Bonus Busters are awarded at various point levels throughout the game.", "platform": "Arcade", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Exidy, Inc.", "publishers": "Exidy, Inc.", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.22", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=eG-vJ5Nw_Gw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35530"}