{"name": "Choukou Senki Kikaioh", "overview": "Tech Romancer, known as Choukou Senki Kikaioh (超鋼戦紀 キカイオー?) in Japan, is a 3D arena fighting game developed by Capcom and released for arcades in 1998 and later ported to the Sega Dreamcast console in 2000. The game draws heavily from the various sub-genres of the Mecha culture.<br><br>The player controls a giant robot which is used to fight another robot in one-on-one combat. Tech Romancer is considered a spiritual sequel to Cyberbots: Fullmetal Madness, another Capcom fighting game that also uses mecha and borrowed sprites from the earlier side-scrolling beat em' up game Armored Warriors.<br><br>Artwork was done by Sho Sakai and SENSEI (the latter artist also worked on Armored Warriors), and Tech Romancer's original concept and mechanical design was conceived by renowned mechanical design and mecha designer Shoji Kawamori. The robots were designed by Studio Nue, who were responsible for the mecha designs for many renowned anime series including The Super Dimension Fortress Macross, Gunbuster, and Mobile Suit Gundam 0083: Stardust Memory.<br><br>Battles take place mostly on a flat 3D plane, with buildings and other terrain features scattered around. Destroying the terrain (by attacking or walking through them) releases power-ups, which include three weapons (vary between each character/mecha), armor or life powerups, and the Hero Mode powerup, which increases the power of your mecha's attacks, and may also unlock additional abilities or moves.<br><br>Rather than rounds, the matches are decided by the life meters of the fighters. Each fighter has two life meters, and is destroyed when the second one is depleted. In addition, each mecha gets an armor gauge that, when broken by consistent brute attacks, lowers the mecha's defense and makes it harder to recover from attacks received.<br><br>Each mecha has at least two super attacks, as well as a Final Attack, which is usable when the opponent is down to the last 50% of their second lifebar. This attack, when activated and successfully connected, automatically destroys the opponent, winning the battle.<br><br>Modes<br>The game is primarily played in two modes: Story Mode, and Hero Challenge Mode. <br><br>Story Mode<br>Each mecha has its own story mode, which plays out like an anime series, with each battle broken up by an episode title, eyecatch, and dialog scenes before and after each battle. Each mecha has its own story (where it is the star of its own show), and decisions made in the dialog scenes, as well as the conditions under which a battle is won, can cause some stories to branch out and have multiple paths and endings. The other mecha and characters naturally make appearances, but their role may vary from their actual origins to fit the \"star\" mecha's story.<br><br>Hero Challenge Mode<br>An \"Arcade-style\" mode where the player fights through each of the major mecha and bosses. Various hidden mecha and pilots found in the game can only be used in Hero Challenge Mode. In the Dreamcast version, points earned in Hero Challenge Mode and the VMU minigames could be used to purchase hidden characters including boss characters and movies.", "platform": "Arcade", "release_date": "September 14, 1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2.22", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35547"}