{"name": "Cliff Hanger", "overview": "Cliff Hanger is a laserdisc video game that was released by Stern Electronics in 1983. It uses animation from two Lupin III films, most prominently The Castle of Cagliostro, as well as The Mystery of Mamo. Like many laserdisc games, it is a reactive game which requires the player to press a button or move the joystick in a particular direction when prompted by the game to progress the storyline. The segments from The Mystery of Mamo use the original English dub commissioned by Toho, while the segments from The Castle of Cagliostro use a dub created for the game.<br><br>The game's plot is based very loosely on that of The Castle of Cagliostro, and follows Cliff (Arsène Lupin III) as he attempts to rescue Clarissa (Lady Clarisse d'Cagliostro) from the evil Count Draco (in some materials called \"Dreyco\" and in the instruction manual \"Dragoe\"), who wants to marry her. Cliff is aided in his quest by Jeff (Daisuke Jigen) and Samurai (Goemon Ishikawa XIII).<br><br>The original version of Cliff Hanger features an animated sequence of Cliff being hanged at the gallows immediately following the \"miss\" animation sequence. The sequence was taken from the opening sequence of The Mystery of Mamo (where Lupin was supposedly hanged in Transylvania), plus a later scene in the same film. According to the instruction manual, a setting on the game cabinet's logic board would allow the individual owners/operators the option of not playing the sequence if they so chose.<br><br>Cliff Hanger was released as the novelty of laserdisc games waned, thus many cabinets were destroyed or converted over time. Unlike other laserdisc arcade games, Cliff Hanger can work perfectly on MAME as well as DAPHNE, a laserdisc-game emulator.<br><br>The game was considered for inclusion on the American Blu-ray release of The Castle of Cagliostro by Discotek Media, however, due to an inability to find the original contracts for the game, it was left off the release.", "platform": "Arcade", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Stern Electronics", "publishers": "Stern Electronics", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5iAR-V_nv1E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35574"}