{"name": "Combat", "overview": "A shooting game with a military motif. The player uses a gun, mounted to the cabinet, to protect allies from a variety of dangers while attempting to break through and conquer enemy lines and get promoted to a higher rank from Private to General Of The Army and be awarded a campaign medal.<br><br>The game has various stages and settings which have military battlegrounds. The object is to protect your allies from attacks by enemy forces until they make it safely to the other side of the screen. Your allies are marked in yellow and the enemies are marked in red.<br>After your allies have broken through and conquered the enemy lines, you will get promoted to a higher rank and be awarded a campaign medal. Each rank is indicated by both a title and insignia. The rank you start with is Private one chevron, followed by Corporal two chevrons, Sergeant three chevrons, Second Lieutenant gold bar, First Lieutenant silver bar, Captain two silver bars, Major gold oak leaf, Lieutenant Colonel silver oak leaf, full Colonel eagle, Brigadier General one star, Major General two stars, Lieutenant General three stars, full General four stars and, of course, General Of The Army five stars.<br><br>During the demo, there is a screen that features a Godzilla character attacking a city with the army trying to stop him.<br><br>When you begin the game, a globe of the world spins around displaying different stages, each with enemy lines that must be broken through and conquered. To select a stage, you must shoot the location of the world that is highlighted in red. The stages include cities, fields, mountains, depots, jungles, oceans and skies.<br>Your allies will either be bazookamen, infantrymen, battleships, submarines, jeeps, tanks or bomber planes. You will have a maximum of five allies at the beginning of the game. During each stage you must protect your allies from attacks by enemy craft such as planes, helicopters, tanks, ships, cannons and other military attackers. You need at least one of your allies to successfully make it across the enemy lines in order to complete the stage and that area will be highlighted in yellow. After that, you will be able to proceed on to another stage of your choice.", "platform": "Arcade", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Exidy", "publishers": "Exidy", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "2.64", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=xma4Dsb_glg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35612"}