{"name": "Dance Dance Revolution 4th Mix", "overview": "Dance Dance Revolution 4thMix[a] is the fourth game in the main Dance Dance Revolution series of music video games. It was released as an arcade game by Konami on August 24, 2000 in Japan. 4thMix features 136 songs, of which 37 are new songs available and 12 are new unlockables that require an operator code. Dance Dance Revolution 4thMix Plus is an update that unlocks these 12 songs without an operator code, while also adding 14 new songs of its own, for a total of 150 songs.<br><br>The core gameplay of 4thMix is the same as the previous Dance Dance Revolution games. For scoring, Each step is given a score based on the accuracy of the step and the running combo. A judgment of Great or Perfect will award points and increase the combo, whereas any lower judgment will break the combo, reducing it to zero. Jumps are only worth one judgment, and only adds one to the combo. Each Great is worth 555 points and each Perfect is worth 777 points. The player also receives 333 points multiplied by the current combo after every step. 4thMix is unusual in that it is the only game in the series where Boo steps do not deplete the dance gauge.<br><br>A player may play anywhere from one to five songs, depending on how many the arcade operator sets the machine to play each game. At the end of each song, the player sees their accumulated points, bonus points, and how many of each kind of step they stepped. They also get a letter grade that is dependent on the judgments received during play, ranging from \"AA\" (all steps Perfect) to D (failure, only seen in Versus mode when the other player passes). If the player manages to pass his or her songs, a cumulative results screen is given, totaling the stats from all played stages.", "platform": "Arcade", "release_date": "2000", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35776"}