{"name": "Dariusburst: Another Chronicle", "overview": "Dariusburst: Another Chronicle, or Darius Burst: Another Chronicle, is a shoot em up video game released in 2010 for Arcades, and a remix of Dariusburst.<br><br>Plot<br>1904 D.C. (Darius Calendar)— When a Belser virus rent the hyperspace network to tatters, every craft in the human space fleet with a network link was stripped of all communications capabilities. The ensuing chaos saw the entire fleet devastated in the blink of an eye. The Silver Hawk fighters were the only craft from Planet Darius to escape the massacre. Equipped with Burst technology, these two cutting-edge craft were entrusted to humanoid AI terminal Ti2 and test pilot Riga Pratica. Flying the Silver Hawk Burst fighters alone into enemy territory without network support, the two heroes braved overwhelming odds to secure victory and liberation for Darius.<br><br>It is now 1910 D.C., and repairs on the hyperspace network have begun to reconnect the pockets of humanity scattered across the vast reaches of space. Combat data transmitted from Darius soon sees Burst-equipped Silver Hawk fighters constructed in every inhabited galaxy. The stage is set for mankind’s grand counteroffensive. A team of heroes takes wing, flying into battle and the pages of history.<br><br>Gameplay<br>The game allows from 1 and up to 4 players to play at a time; the largest amount of players possible in any Darius game. The players may choose between playing Default Entry, with 3 ships per coin, or Infinite Ships Entry, with infinite ships at the cost of additional coins and forfeit of the players' highscore.<br><br>Another Chronicle has two game modes:<br><br>Original Mode<br>Standard gameplay through 3 zones from a selection of 12 (A-L). Here the players chooses one of 3 zones to start on and continues through two more zones in traditional fashion.<br><br>Chronicle Mode<br>Here the players choose individual missions, consisting of rearranged levels and bosses, with various possible set parameters.", "platform": "Arcade", "release_date": "December 17, 2010", "game_type": "Released", "esrb": "", "developers": "Taito", "publishers": "Taito", "genres": "Shooter", "max_players": "4", "cooperative": "Yes", "rating": "4.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=MT3be5TXVxk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154850"}