{"name": "Daytona USA", "overview": "The player is put behind the wheel of a stock car (known as the Hornet), with the choice of three tracks as well as an automatic or manual transmission. The player's objectives are to outrun the competing cars, and complete the race before time runs out.  \t<br>This game will certainly go down in history as a classic. Few games have realized such a transmission of visceral thrill and emotional competitiveness to the extent that Daytona has. The force-feedback steering is amazingly responsive and adds incredibly to the gameplay, allowing players to feel the road, and the bumps and impacts of other cars. The stunning graphics suck the player right in, even the smallest detail (like yachts bobbing independently in the water) was paid considerable attention. The games superb physics model allows for depth and complexity that, in my opinion, has rarely been matched. To me, this game allows the player to refine his skills, and inject his own style and finesse into the gameplay, in a manner that brings to mind the feeling of becoming an expert Asteroids or Star Wars player. Daytona does it right in just about every possible way. Arguably the greatest racing game ever made. The American twin is the most common model, and has a sturdy cabinet, aside from a tendency for the seat-rails to be damaged. The twin is truly that, each \"half\" contains it's own Sega/Martin-Marietta Model2 board set, monitor, speakers, controls, seat, etc. Only the coin-box is shared. The deluxe featured a beautiful molded plastic race car body, and a 50\" projection television monitor. The Japanese twin features an open metal \"U\" rail where the U.S. version has solid wood lower sides, a 29 inch monitor without monitor glass, better seats and a better seat-adjust knob, and rug flooring, rather than the corrugated rubber of the U.S. model. 4 twins, or 8 deluxe games can be linked by means of fibre-optic cable to enable up to 8 players to compete within the same race.", "platform": "Arcade", "release_date": "March 1, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega AM2", "publishers": "Sega", "genres": "Racing", "max_players": "8", "cooperative": "No", "rating": "4.32", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=GAcMqFTkAs8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7685"}