{"name": "Dead or Alive 2", "overview": "Dead or Alive 2 (Japanese: デッドオアアライブ2, Hepburn: Deddo Oa Araibu 2, abbreviated as DOA2) is a fighting game in the Dead or Alive series, developed by Team Ninja and published by Tecmo. It debuted in arcades in 1999. The enhanced Millennium edition released in 2000 includes several enhancements.  <br><br>The gameplay of Dead or Alive 2, and all subsequent DOA fighting games, borrows heavily from the Virtua Fighter series, but makes some key changes that drastically changes the way Dead or Alive is played in comparison to Virtua Fighter.<br><br>In DOA2, the basis of the entire fighting system is the circular relationship between three types of moves: blows, throws, and holds. The other defining feature of the game, aside from blows/throws/holds, is its stun system. Many attacks can inflict a stun on the opponent; those stunned cannot attack or guard, however they can hold. If the attacker lands a non-knockdown, non-launching attack while the opponent is stunned, the opponent will be re-stunned in a new way, depending on what attack was landed.<br><br>A major difference between DOA2 and other fighters was in the safety and non-punishability of attacks, both upon hitting and upon being blocked. Most blows in DOA2 can be punished on hit and block by each character's faster throws, making blow-based offense very risky. In addition to the normal rules of juggling, each character also fits into a specific weight category, which affects how the character responds to being launched and being juggled.<br><br>In DOA2, fights can occur on either water or ice; when a character is on such a surface, all non-knockdown, non-launching attacks will induce a stun on any successful hit. Walls and falls in the middle of stages are everywhere in the game. Many stages are also multi-tiered: to get to other areas of the stage, one character must be knocked off a ledge and fall into the next area. These falls deal usually fairly high damage, but cannot knock the opponent out.<br><br>Other notable features included introducing CG cutscenes in line with the plot, replacing the original \"Danger Zone\" areas in stages with fully interactive ones, allowing players to juggle each other into walls, propelling characters from landmarks for more damage (the first game to implement this feature was SNK's Samurai Shodown 64), and upon completing the game, presenting the player with (sometimes ambiguous) endings for each character using the game's standard engine.", "platform": "Arcade", "release_date": "October 16, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Team Ninja", "publishers": "Tecmo", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.47", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=lJZVa-GW2mU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35830"}