{"name": "Dead Heat", "overview": "Dead Heat (known in Japan as Maximum Heat) is an over-the-top arcade car street racing game developed by Polygon Magic and released by Namco Bandai for arcades (using PC-based Namco System ES1 hardware) on October 19, 2010 (in North America) and April 20, 2011 (in Japan).<br><br>A fast-paced street racing game from the studio behind the original Wangan Midnight Maximum Tune, Dead Heat puts players in high-octane eight-player races in one of four cities (New York, Chicago, San Francisco, and London) with a wide selection of real-life cars (including tuner cars and, in the US version, muscle cars). It includes a nitrous system for speed boosts, high-speed drifting, numerous jumps and obstacles, and a PIN-based progression system (allowing players to customize their vehicles).<br><br>Similar to some of Namco Bandai's other racing and vehicle games at the time (such as Mario Kart Arcade GP 2 and Tank! Tank! Tank!), the game machine includes a camera above each display that takes a picture of the player, which is used to indicate (to others) the driver of their vehicle. Players can opt to have their photo appear as CPU rivals for that machine in future races. The Japanese version of the game also includes an optional mounted head visor (with polarized lenses) for a stereoscopic 3D mode.<br><br>The game later received a motorbike-focused sequel in North America in 2013, titled Dead Heat Riders. It retains much of the same gameplay mechanics and interface, as well as the four locales. While the original game features a soundtrack by Yuzo Koshiro (of Wangan Midnight Maximum Tune fame), the sequel features a soundtrack by Hideki Naganuma (of Jet Set Radio fame).", "platform": "Arcade", "release_date": "2010", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Racing", "max_players": "", "cooperative": "No", "rating": "2.93", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39312"}