{"name": "Defender", "overview": "Defend the human population from swarms of attacking aliens. Extremely popular even though it was deemed a flop at a 1981 Chicago arcade machine trade show because of its difficulty. The attract mode for the game was programmed in just five hours.<br><br>Your mission, as captain of the Defender, is to protect the humanoids stranded on the planet from their alien abductors. The scanner will help you determine a strategy to shoot down the alien ships before they reach the humanoids. If you destroy the aliens after they have captured their prey, you must return the humanoids to the safety of the planet or they will fall to their death. If an alien carries its victim out of your range, the humanoid will mutate, join the alien force, and take to assault with deadly vengeance!<br><br>The challenge becomes ever more intense as the action progresses. Fighter ships Bombers and mines will test your skills. A direct hit will destroy the mother ship Pods but smash it into a swarming mass of mini-ships Swarmers which then must be wiped out! If you do not act quickly, the cosmic Baiter will attack! Use your two escape options only if all else fails! Your \"Smart Bomb\" power is limited and \"Hyperspace\" puts you into an unknown space warp. But beware! If all the humanoids are abducted, the entire planet will explode in a blinding flash!<br><br>Tips:<br>Avoid using hyperspace unless you are about to die. Fighting off attacks, regardless of the number of enemies will make you a better Defender player.<br>Baiters can usually be overcome by hitting the reverse button twice quickly. They will fly past you and be in range for your fire power. Do NOT try to outrun them as Baiters are faster than your ship.<br>Swarmers are easy to defeat. You can hit reverse as soon as they fly past you and fly behind them. They cannot shoot backwards so you can blast away at will.<br>At higher levels you will need to play God and even sacrifice some humanoids by killing them yourself to preserve the rest of the planet's population. The planet is too large for you protect and you are sparing the humanoids from a fate worst than death mutation. Do not worry, these humanoids reproduce quickly and overpopulation has always been a constant problem. The planet will be fully populated at the start of every fifth attack wave configurable.", "platform": "Arcade", "release_date": "February 1, 1981", "game_type": "Released", "esrb": "Not Rated", "developers": "Williams Electronics", "publishers": "Taito", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.22", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=GdUlS_cSMoE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7532"}