{"name": "Demoneye-X", "overview": "Demoneye-X is a fixed shooter arcade game that was released by Irem, in 1981; it is the first of only two games that utilize their then-new M27 hardware (a Motorola M6502 running at 5.865 MHz and a Motorola M6802 running at 3.579545 MHz, with two General Instrument AY-3-8910s also running at 3.579545 MHz for sound). The player must, like in several other fixed shooters from this time period, use a two-way joystick to direct a spaceship back and forth at the bottom of the screen, and a single button to make it fire missiles at the various enemies - the \"Demoneye Jr.s\" are worth 40 points and they'll explode into \"Octopluses\" (worth 70 points) when hit, which explode into \"Octobombs\" (worth 100 points) when hit. Occasionally, the \"Demoneye Jr.s\" and \"Octopluses\" change their colour, and increase their values to 100 points; if the \"Octopluses\" are hit they will explode into a group of three \"Octobombs\" (which are worth 200, 400, and 800 points in succession). Once all the smaller aliens have been killed, a hole will open up in the bottom of the eponymous \"Demoneye-X\"'s body - and if you can fire a shot through the hole the \"Demoneye-X\" will explode and you will receive 500 points. At the end of every second round, that three-eyed \"Demoneye King\" will show up; once you fire out three shots into the hole at the bottom of his body, he will explode and you will receive 1500 points. The face from the title screen will then open up its eyes and reveal its mouth, as the text \"HAVEN'T GIVEN UP YET!\" appears below it, and the game continues - and the screenshots below are taken from MAME and inaccurate (on an actual Demoneye-X cabinet, the background is coloured black).", "platform": "Arcade", "release_date": "1981", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35873"}