{"name": "Digger (CVS)", "overview": "Many features of Digger are similar to those in the arcade games Mr. Do! and Dig Dug. The player is placed in an underground maze and can dig horizontal and vertical tunnels through it. At least one tunnel already exists at the start of play. At various points on the board are emeralds (usually in clusters) and bags of gold. Monsters (initially in the \"nobbin\" form) appear at the top right-hand corner. If earth is excavated from under a gold bag, then the bag will wobble for a few seconds and then drop; if it falls more than one row, it will break open after falling, releasing gold, which can be collected. Bags can be pushed left or right into vertical paths, with similar results. Falling bags will squash monsters, but they will also squash the digger. The digger has a weapon, which fires in a straight line, but takes several seconds to recharge (taking longer as the levels go higher).<br><br>Monsters sometimes change from the \"nobbin\" form to the \"hobbin\" form, more frequently on higher levels. Hobbins also have the power to excavate and can destroy emeralds and gold bags while so doing.<br><br>When a monster is killed, another will appear at the top right-hand corner of the screen, up to a maximal number, which depends on the level. Once all the monsters for the level have been created, a cherry appears in their place. If the digger collects this, bonus mode is entered, and for about fifteen seconds (which decreases as the game level gets higher) the digger is able to eat the monsters. Accordingly, the monsters now run away from the digger rather than towards it (similar to Pac-Man).<br><br>A level ends when all the emeralds are gone or all the monsters have been killed.", "platform": "Arcade", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Century Electronics", "publishers": "", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "2.56", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Jk2C9S2PKuc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/35909"}