{"name": "Dinosaur King", "overview": "Dinosaur King is a card-battling game released in 2005 for Sega Aurora arcade hardware. It marks the start of Sega's Dinosaur King franchise, and was the first game to be released for Aurora hardware. Like its sister franchises Mushiking and Oshare Majo: Love and Berry, Dinosaur King is housed in a small, 130cm tall cabinet designed to appeal to children.<br><br>Every time the game is played, a slot near the base will dispense one random \"dinosaur\" or \"move\" card which has a barcode running down one side. To use these cards in game, one must swipe a dinosaur card of their choosing on the scanner between the two control pads when prompted. They can also swipe up to three move cards as upgrade moves for the moves that are preset, although to use three move cards they must be rock, paper and scissors (like Mushiking).<br><br>There are two types of moves: normal moves and super moves. Normal moves can be used by any dinosaur and do not have an attribute. Super moves are powerful moves that can only be used by dinosaurs of matching attributes. There are six attributes: fire, water, grass, earth, lightning and wind. Each dinosaur has their own attribute; water types for example are usually large sauropods and rarth types are usually heavilly armoured quadrepedal dinosaurs such as Edmontia and Stegosaurus. Move cards have their own hand sign: rock, paper or scissors.<br><br>Dinosaurs also have a critical move, a powered up move that is stronger than the rest. Critical moves are easily distinguishable by the spike patterns around the hand sign. After all cards have been swiped, the game begins. One can choose to play through the storyline in one player or battle another player.", "platform": "Arcade", "release_date": "March 18, 2005", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega", "publishers": "Sega", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144662"}