{"name": "Domino Man", "overview": "Domino Man is a 1983 arcade video game released by Bally Midway. It features the ragtime piece, Maple Leaf Rag by Scott Joplin as the background music.<br>The player controls Domino Man, a bespectacled, balding man wearing a beat-up turtleneck sweater and sporting a mustache. The player attempts to set up a number of giant dominoes across the screen.<br><br>The main goal of Domino Man is to set up a domino on every site marked by a black dot. Meanwhile, pedestrians meander throughout the playfield and may wander into dominos, knocking them over. Domino Man can shove them away from the dominos. A killer bee constantly appears trying to sting Domino Man. There is also a neighborhood bully who is much larger than Domino Man (who can be stunned but not shoved) and an invincible walking clock. Domino Man can set up dominos, swing a domino as a weapon, and remove placed dominos (which can be used to stop a cascade of falling dominos). A Domino Man is lost if he is stung or the leftmost domino is disturbed.<br><br>After the player has set up all the dominoes, they will have a choice to either knock down all the dominoes or continue play in hopes of increasing the domino bonus value. After they have made the choice, they will move on to the next screen.<br><br>After the game is over, the game will have a poem displayed on the screen to evaluate the player's performance on the game. For example:<br><br>Roses are red<br>Or so goes the verse,<br>You set up 52—<br>You could have done worse.<br>The main character in this game is very similar (if not the same) as the bartender in Tapper and one of the Timber lumberjacks.", "platform": "Arcade", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Marvin Glass and Associates", "publishers": "Bally Midway", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "2.85", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=o9cbxTFGxVQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11740"}