{"name": "Donkey Kong Junior", "overview": "The player controls a small monkey who must leap from platforms, climb vines, and avoid enemies to rescue Donkey Kong from Mario. The game has several distinct levels with similar goals. Fruit can be dropped on enemies leg traps and birds to kill them.<br><br>The game's basic concept is the same as Donkey Kong except the good guys and bad guys have changed places. The player controls Donkey Kong Junior, a small ape who must rescue his father, Donkey Kong, from his nemesis Mario.<br><br>The games has four different levels: The Vines, The Chains, The Jumpboard and The Hideout.<br>On the Vine level, Junior must climb up vines and walk across platforms to get to the key at the top of the screen while avoiding or jumping over red and blue Snapjaws. The red Snapjaws move back and forth but the blue Snapjaws only move in a straight line and in random directions. Junior can also destroy these pursuers by dropping fruit onto them. Junior can also jump over them while he moves across a platform. When Junior reaches the key at the top of the screen, Mario pushes the cage with Donkey Kong in it away and then you proceed to the next level. The same thing happens on the Jumpboard level and Hideout level.<br><br>On the Jumpbaord level, Junior can jump onto jumpboards to make himself jump high, he also must jump onto moving platforms and grab onto and climb moving cables followed by chains while avoiding deadly purple birds.<br><br>On the Hideout level, Junior must avoid or drop fruit onto deadly electrodes that move across the platforms and on the cables that are climbed on.<br><br>On the Chain level, Junior must climb up and down chains and place keys into the keyholes to help Donkey Kong break free while avoiding or dropping fruit onto red Snapjaws and blue birds. After Junior has freed Donkey Kong from the cage when the last key is placed in it's keyhole, the screen freezes, all the game elements disappear, and Mario and Donkey Kong both fall down. Junior catches his father safely and then they punch Mario a good one to teach him a lesson. Afterwards, the game starts over again with increased difficulty.", "platform": "Arcade", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "4.14", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=v9yfoHrUzzc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7558"}