{"name": "Donkey Kong", "overview": "Jumpman -- known today as Mario -- must traverse levels structures to save his girlfriend, Pauline, from Donkey Kong before time runs out. The levels include Girders, Rivets, Elevators, and Conveyor Belts. Mario must avoid flames, barrels, and bouncing rivets to reach his goal.<br><br>You are a workman named Mario who climbs girders and ladders and will stop at nothing to save his stolen love from the clutches of the giant ape.<br>Using the joystick and the Jump button, you maneuver Mario over rolling barrels, away from falling barrels, over or away from fireballs and cement tubs, away from bouncing rivets, up and down ladders, along girders and conveyor belts, onto elevators, over rivets to remove them and over dangerous crevices, to get to where the ape holds the girl captive. For additional points, Mario gathers umbrellas, hats, purses and other bonus items that the girl has dropped on her way to the top of the building. Mario can also grab a hammer by jumping up to it to smash barrels, fireballs, and cement tubs for additional points but the hammer can only be used for a limited amount of time.<br><br>On the Girder, Elevator and Conveyor Belt levels, whenever Mario reaches Pauline, Donkey Kong will grab her and carry her off to the next higher level. But on the Rivet level, Mario must remove all the rivets on each and every floor by running or jumping over them. After all the rivets are removed, Donkey Kong will fall head first onto a stack of girders and be knocked out and then Mario and Pauline will be together again for good. Afterwards, the game starts over again with increased difficulty.", "platform": "Arcade", "release_date": "1981", "game_type": "Released", "esrb": "Not Rated", "developers": "Ikegami Tsushinki", "publishers": "Nintendo", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "4.44", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=qUb97eM45UA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7557"}