{"name": "Dream World", "overview": "At first glance, Lode Quest and Dream World seem like typical Bubble Bobble clones. The characters are even brought into the stages by huge bubbles, but those suggest a greater similarity between the games than actually exists. In fact, Semicom mixed the concept heavily with influences from Lode Runner, thus the title Lode Quest (it is not possible to discern right now whether Dream World is an actual update or just a changed title for international release). The games are no longer confined to a single screen per stage, either, introducing scrolling into all directions.<br><br>There's basically two ways to solve each level: Either collect all the gems and escape with them, or defeat all enemies. The latter is often easier said than done, as all enemy types take different strategies. The most basic ones can just be jumped on and then used as projectiles to take out even more with them. But soon the two cute magician protagonists encounter a new helmet-wearing breed, that can't be attacked directly, but have to be lured into Lode Runner type manholes the heroes can create with their wands. When enemies learn to jump over said holes or there are no diggable ground tile available, the only way to get rid of them, anymore, is picking up a potion of invincibility that makes it possible to attack enemies directly with the wand, or use up one of the rare hidden spellbooks that wipe out all enemies on screen.<br><br>The stages are also set up with the ladders and climbing bars known from Lode Runner, which are essential for progression as the characters sport poor jumping ability. The stages keep altering between gradually more tricky puzzles and reflex based ones, with a boss waiting at every 10th stage.", "platform": "Arcade", "release_date": "2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Semicom", "publishers": "Semicom", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "2.81", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=kAnG9XOQ88o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/36022"}