{"name": "Dribbling", "overview": "A tabletop soccer game.<br><br>Unlike most video games, the machine acts only as the interface through which two players compete against each other. Players apply their skill by creating new tactical situations and by directly controlling the game, play after play.<br><br>After depositing a coin and pushing the start button, two teams of seven players enter the field from opposite sides, accompanied by realistic cheering sounds of an imaginary crowd. After the presentation of the two teams and the choice of the team's colors (push the shoot button on the right handle), the players automatically position themselves on the field. The referee brings the ball to the starting point and then whistles the start of the game.<br>The players are controlled by two handles. The right controls the three forwards while the left controls the three defenders and the goalkeeper. The players can move in eight different directions: four orthogonal (vertical and horizontal movement) and four oblique (45 degree angle). Each group can move toward a precise part of the field in order not to create confusion and not to create \"dead zones\" when going for the ball. The controls are automatically shut off in order to allow the players to take their programmed positions when the game starts, after a score, during a corner kick or during a penalty shot.<br><br>The goalkeeper can only be moved vertically even though he is controlled by the same handle that operates the defense. In order to better facilitate the goalkeeper's movements, his control has been set on semiautomatic. The players hook the ball automatically unless the shoot button is pressed when the player reaches the ball.<br><br>When any player hooks the ball, he or she can dribble it for a set time of three and a half seconds. After that it is lost automatically. If the player is moving, the hooked ball will follow him or her anywhere he or she moves and he will then be able to kick it in any direction that he or she chooses to.<br><br>When the goalkeeper blocks the ball, he can hold onto it for one and a half seconds and then it is thrown out automatically. If the goalkeeper dives to block the ball with his fists, it will bounce away.<br><br>When the player has the ball and the shoot button is pressed, there are two trajectories that that ball can travel. If the player is standing still, the ball will have a horizontal trajectory, but if the player is moving with the ball, the trajectory will be opposite to the way the player is moving. (The base speed for the ball is about 9.5 cm. or 3 1/2 inches per second.) The ball speed also depends on the time the player has kept the ball while dribbling it.<br><br>When the ball collides with any player, while the shoot button is being pressed, depending on the collision course, the ball can take different directions. In one case, if the ball is kicked backwards, it could cause a corner kick or even a self score. When the forward players kick the ball from the lateral sides of the field, the ball takes a 45 degree angle toward the goal.<br><br>A player with posession of the ball may defend it by stopping and the player of the opposing team will be unable to take it away. If the player with the ball is moving, contact with another player will send the ball away from the two.<br><br>When the center forward is moving inside the penalty area and is fouled by a defender without touching the ball first, the result is a penalty shot. At this point, the ball is automatically placed on the penalty disc. When the referee whistles, the player kicking the ball have the option of shooting straight or at a 45 degree angle towards either side of the goal. The goalkeeper in this case operates alone and only the intuition of the player can make him block the penalty shot.<br><br>In the case of a corner kick, the ball is automatically placed in the corner disc and the players are automatically placed in a programmed position. The ball may take two different trajectories: either directly toward the center forward or a parabolic shot (curve ball) that will reach the forward wing closer to the corner disc. By pressing the shoot button, the resulting kick will have a higher speed. The defense may intercept the corner kick or it may be left to the goalkeeper to block the shot.<br><br>There is a right percentage of scoring from a corner kick. A valid goal is scored when the ball passes the goal line (a point is awarded). When play is resumed, it is possible to open action to the forward wing in order to bypass the opposing team and get to the net for scoring.<br><br>The time of the game is monitored and decreases from the time set down to zero. At that point, the referee whistles three times for the end unless there is a penalty. In this case, the game is over after the completion of the action.", "platform": "Arcade", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Model Racing", "publishers": "Model Racing", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=g2s4jUEMjuE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/36024"}