{"name": "Egg Venture", "overview": "Egg Venture is a 1997 arcade first-person shooter game which was a partnership project between two arcade equipment companies: The Game Room and Innovative Concepts in Entertainment. In the end of the production, both companies had their own version of the game to go by.<br>Egg Venture is set up in an unusual manner for a game. The plot of the arcade game was simply to \"shoot bad things\" and avoid \"shooting good things\". In the first version of Egg Venture, players progressed through the game based on \"days\" instead of levels. Each \"day\" allowed players to choose four different missions of play which involved these CGI eggs with faces and floating hands.<br><br>Title Screen of Egg Venture<br>Missions provided including target practice shooting frying pans instead of eggs, protecting scuba egg divers from green piranhas and mines, or shooting an egg's submarine through the sea.<br>The original version of Egg Venture had no ending, and was programmed to simply get harder and harder until either the player was overwhelmed by the difficulty or simply gave up because of boredom. The game had several glitches, due to the nature of the hardware.<br>Later in 1997, The Game Room released a \"deluxe version\", which plotted an egg travelling around the world, bumping into landmarks along the way. Most of the game's missions remained the same as the original version, however, many of the bugs were fixed and there was actually an ending that could've been achieved in the game.<br>The theme music in the game bears a resemblance to \"The Great Egg Race\" by Martin Cooke and Richard Denton, but this appears to have been legitimately licensed.<br>A variation of the game was eventually used as a ticket redemption game at kid's arcade funhouses.<br>Players can lose lives by:<br>Shooting an egg.<br>Letting an egg die where the players protect them.<br>Failing to reach a quota.", "platform": "Arcade", "release_date": "1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Innovative Concepts in Entertainment", "publishers": "Innovative Conecepts in Entertainment", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "2.64", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=YPsZLvcsqPs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/36068"}