{"name": "Fantasy Zone (Mega-Tech)", "overview": "The Mega-Tech System is an arcade cabinet released by Sega in 1989, and Western counterpart to the Mega 6. It was based on the Sega Mega Drive home console, and was designed similarly to Nintendo's PlayChoice-10: players chose games from a menu of eight titles, with credits buying more play time (usually 1 minute per credit) rather than extra lives or continues; reaching a game over screen does not end the play session, and players can start over or choose a different game as long as there was some play time remaining. The Mega-Tech was not released in North America, though did see use in Asia and the PAL regions.<br><br>In the game, the player's ship is placed in a level with a number of bases to destroy. When all the bases are gone, the stage boss appears, who must be defeated in order to move on to the next stage. There are eight stages, and in all of them, except the final one, the scroll is not fixed; the player can move either left or right, though the stage loops. The final level consists of fighting again all previous bosses in succession and then facing the final one.<br><br>Opa-Opa uses two different attacks: the standard weapon (initially bullets) and bombs. He can also move down to land on the ground by sprouting feet and walking around until he flies again.<br><br>It is possible to upgrade Opa-Opa's weapons, bombs and flying engine to increase speed, as well as get extra lives. Before that, the player must get money by defeating enemies, bases or bosses, and access a shop by touching a marked balloon. Each time a new item is bought, they become more expensive. When the player chooses to exit or the time runs up, another screen appears, in which he or she can select what upgrades Opa-Opa can use; only one engine, weapon and bomb can be equipped at a time.<br><br>Some of the new weapons have a time limit that starts as soon as the shop is left. Some of the bombs can be used at any moment, but they are limited. On the other hand, the engines are permanent, though some of these actually makes Opa-Opa hard to control, as he moves too fast. The powerups can also be reassigned by reentering the shop or touch a balloon with the word \"Select\" written on it. If the player loses a life, all of the upgrades are lost.", "platform": "Arcade", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega", "publishers": "Sega", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127784"}