{"name": "FireTrap", "overview": "A firefighter climbs a burning building while avoiding falling objects, extinguishing the fires and rescuing people and animals who are trapped.<br><br>This game is very similar to Crazy Climber. As your firefighter climbs the building, he must use his fire extinguisher to put out the fires which include burning papers, flaming windows and shooting fireballs. The fire extinguisher contains a limited amount of water, so you will have to use it wisely.<br>Your firefighter can climb upward to get higher in the building and he can also scroll sideways on the building as well climb down about three steps. Your firefighter can get some items which appear on random windows that can help him like a rocket that will advance him about three stories up, an extinguisher that shoots in three directions at once, a water supply that fills your extinguisher and a special item that puts out all fires on the screen.<br><br>Your firefighter must touch men, women, boys, girls, dogs and cats, so they will parachute to safety. There are various falling objects that appear including cars, couches, hammers, chairs, lamps, stoves, refrigerators and so on. Your firefighter must avoid those objects or deflect them by shooting them with the fire extinguisher.<br><br>Your firefighter must climb to the roof of the building to rescue a young woman who is trapped up there. When your firefighter has nearly made it to the roof, there will be a giant fireball circling the tower and he must avoid it or shoot it with the fire extinguisher. After the firefighter has rescued the woman, he must fly down the building with his jet pack and extinguish any fires remaining on the building and then land safely at the bottom of the building. A cheering crowd will thank him. Afterwards, your firefighter goes to another building to make another rescue attempt.", "platform": "Arcade", "release_date": "June 1, 1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Data East", "publishers": "Data East", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.18", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=P-WsL0KcCYY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27058"}