{"name": "Food Fight", "overview": "As Charley Chuck, you hurl piles of food at your foes, the four crazy chefs, but make sure you eat the ice-cream cone before it melts. This game uses a special analog joystick that is comprised of a centering-bellows and two potentiometers.<br><br>Food Fight hero, Charley Chuck, gets points by eating his ice cream cone before it melts. To do this, he must fight off Oscar, Angelo, Jacques, and Zorba, the four mean-looking chefs who rise from holes and throw food at him.<br>Each of the chefs wears a different hat: Oscar wears a big hat Angelo wears a small hat Jacques wears a curved hat and Zorba wears a tall hat.<br><br>Charley must not be caught by a chef, get hit by food thrown by a chef or walk onto an open hole or else he is a goner.<br><br>On some stages, the food that Charley can throw at the chefs include peas, tomatoes, bananas and pies each in piles. On these stages, the supplies are limited, so you must try to use whatever you can to throw at the crazy chefs before they run out.<br><br>On other stages, the food that he can throw are watermelons. On these stages, Chuck can throw pieces of watermelon continuously because the supplies are absolutely unlimited.<br><br>Whenever Charley makes a direct hit at a chef, the chef is temporarily stunned.<br><br>Chuck must eat the ice-cream cone before it melts in order to proceed to the next stage. When Chuck eats the cone, the ice-cream flavor changes and the game difficulty increases.<br><br>If the round lasts a long time and Charley has a lot of narrow escapes or close calls before successful completion, the game may award an \"Instant Replay\" - when this happens silly music plays there is no background music during gameplay and the entire round is played back on the screen. The music is synchronized to the replay so that the last few notes correspond perfectly to the point where Charley eats the cone. Getting an \"Instant Replay\" does not add to the player score, but it sure is fun to see. When the chefs pop up they also leave holes on the screen, you fall in a hole you die! Avoid the holes.<br><br>There are 125 total levels. Once you reach level 80 or so, the game is so fast that you are pretty much just running for the cone.<br><br>The game is labeled \"Charley Chuck's Food Fight\" on the marquee and the manual.<br>An upright version of the game appears in the movie \"Real Genius\".", "platform": "Arcade", "release_date": "1982", "game_type": "Released", "esrb": "Not Rated", "developers": "General Computer Corporation", "publishers": "Atari, Inc.", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.36", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=pdNcro22TbQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/11760"}