{"name": "Freeze (Atari Prototype)", "overview": "The following info comes from the \"Unreleased Atari arcade games\" web site:<br><br>Freeze! is an unreleased 1996 Atari game that was on display at the 1998 and 1999 [California Extreme] show. It's a puzzle game where the goal is to match at least three same-colored fish in a row. The twists in the game are as follows: You throw one fish at a time up into the playfield, which is pressed back down at you until the field is completely full. If you are \"attacked\" from the other player making a horizontal match, pieces towards the top are frozen and cannot be matched. To thaw a piece you need to make a match that borders the frozen piece from any side. Finally, each of the six characters has a special weapon that occasionally appears to thaw ice, or create automatic matches. There's also a one player puzzle mode where you are given a limited number of fish to clear the playfield.<br>The game has terrific whimsical artwork, with great voice and sound work as well as fluidly moving characters and puzzle (fish) pieces! It was polished enough that I had trouble determining whether the graphics were computer generated or claymation (or maybe a combination of both). The characters are funny, each with their strange story for one player mode. In this mode you hop from island to island in search of a treasure, battling the computer at each stop.<br><br>The characters are: a monkey in search of a crown (he's skipping Dr. Freeze's swimming lessons to get the crown so he can be the bigshot instead of Dr. Freeze); a Racoon searching for a shiny mirror because he likes shiny things; a cow wearing a skirt searching for a special dye so she can be noticed in a movie audition (\"all us girls look the same\"); a slow-witted aardvark searching for fireworks; and a helipak-wearing fox searching for spring shoes to get the attention of a lady fox. Each of the six characters pops out of their frame during play to gloat when they are attacking the opponent, or cry streams of tears when they lose. There's also a strange looking chicken with dark eyebrows that hosts the puzzle mode.<br><br>My favorite character is Zap, a bug-eyed cat who happens to wear snorkling goggles. He keeps missing dinner so a fellow cat reccomends using an alarm clock. Zap says, \"I have trouble sleeping because my eyes are so big. Regular alarm clocks do not work for me.\" His friend tells him about a rumored 64-bit alarm clock which would surely wake him, so Zap goes off to search for it.<br><br>The gameplay is solid and fun, especially if you are a fan of puzzle (Tetris/Columns) games. It's a shame this game never made it to general release because it's fun to play, completely finished, obviously had a lot of work put into it, and does not really have any flaws. The test mode even allows play of a Japanese translation! I may not be representative of the market, but I definitely would have sunk in some quarters while I never played other Atari games of the time like S.F. Rush or Mace the Dark Age. At least a home version would have been nice.\"", "platform": "Arcade", "release_date": "1996", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Atari Games", "publishers": "Unreleased Prototype", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=3WRmhhmEYZE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114873"}