{"name": "Fruit Bonus 2000 / New Cherry 2000", "overview": "Two games in one <br>Player  has  the  option  to  play  whichever  game  he  wants,  just  stick  to  the  one  he  likes  or  <br>playing  alternatively.  Default  setting  is  both  games  available  to  player;  but,  you  can  also  <br>adjust  to  either  one  game  only.  From  testing,  playing  both  games  alternatively  is  far  more  <br>exciting  and  interesting  than  just  one  game.  Besides,  you  don’t  have  to  worry  which  one  to  <br>keep more than another. <br> <br>New Treasure Bonus <br>While  both  games  maintain  all  the  features  of  ‘96  Special  Edition,  a  new  bonus  feature,  <br>Treasure  Bonus,  is  added.  Each  Treasure  Box  (in  Main  Game  of  CH2000,  in  Main  Game  and  <br>Win Double Game of FB2000) will give one Treasure Wheel spin. The circular Treasure Wheel <br>is divided into 8 sectors. Opposite sectors have same type of odds. Odds = x5, x10, x15, and <br>x30  (of  Total  Play).  When  the  wheel  rests,  whichever  sector  the  pointer  points  at  is  the  <br>winning odds. Player can stop the wheel manually as well. <br> <br>Link Bonus <br>You can link up to 15 units of FB2000 & CH2000 (and other S2000 series games) together to <br>create a big progressive bonus. A control unit and link cables are required. For detail, please <br>read manual of Linking. Basically, it is very simple, convenient, and cost effective.  All mixed <br>Bar is reserved as Link Bonus. Link Bonus Point will appear on screen of each unit in real time. <br>The adjustment of the base, max, and rate of Link Bonus is done in the control unit.<br><br>• Standard 36/10 Pin Cherry Master Harness.<br>• CGA graphics.<br>• 3 spinning reels.<br>• 8 lines.<br>• Double-up feature.<br>• Scorebox.<br>• Game count.<br>• 10X multiplier.<br>• Fruit Bonus: Treasure Box Bonus and Diamond Bonus games.<br>• Cherry Bonus: 1 Bar Bonus, Bell Bonus Cherry Bonus, and Treasure Box Bonus games.<br>• Link ready.", "platform": "Arcade", "release_date": "2000", "game_type": "Released", "esrb": "Not Rated", "developers": "Amcoe", "publishers": "Amcoe", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "2.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=jbjQgY4WB30&t=3s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/36261"}