{"name": "G-Darius Ver.2", "overview": "Much like previous installments in the Darius series, G-Darius is a two-dimensional horizontally scrolling shoot'em up set in a fictional future. While the game features three-dimensional polygonal graphics, the gameplay remains two-dimensional. The player controls a spaceship named the Silver Hawk and must battle enemies and avoid obstacles throughout the game's stages (referred to as zones in the game). The ship is armed with forward-firing missiles, small aerial bombs and a protective force field. These can be upgraded by power-ups, in the form of large orbs, that are dropped by specially-colored enemies when they are destroyed. When the player reaches the end of a zone, a boss appears, which must be defeated to proceed. Once the boss of a zone is destroyed, the player is given a choice of which zone to play next via a branching path.<br><br>Among the player's arsenal is the 'capture ball', which the player can launch to capture enemies. Once captured, the enemy will follow and aid the player's ship. Each enemy contains a unique enhancement; some will act as extra turrets and others will act as shields. Additionally, the player can detonate their captured enemy as a bomb. The captured enemy will continue to follow the player until either they are destroyed after taking enough damage or the player's ship is destroyed.<br><br>New to the series in G-Darius is the concept of beam-dueling. The player can absorb a captured enemy to fire a powerful laser beam over a short period of time, which will instantly destroy nearly every enemy it comes into contact with. This is primarily used during boss fights. Every major boss in the game has an equivalent laser beam. If the player and the boss fire their lasers simultaneously, a 'duel' between the two will initiate. The player must overwhelm the boss' laser by repeatedly tapping the fire button as quickly as possible. If successful, the boss' beam will eventually dissipate and the player's beam will multiply in size (as well as in power) and severely damage, if not kill, the boss.", "platform": "Arcade", "release_date": "1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Taito", "publishers": "Taito", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "4.3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=caQrhs3cNKk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/36397"}