{"name": "Gaelco Championship Tuning Race", "overview": "Gaelco Championship Tuning Race © 2005 Gaelco.<br><br>Gaelco Championship Tuning Race puts you behind the wheel of a Sport Prototype Car, in an amazingly realistic racing simulation. There are two Game modes available: Arcade Mode where there is a strong head to head competition against other players or CPUs. And Tournament Mode, where the game play is Time Attack, racing against the shadow car and beating the best time lap, becoming in that case, the 'shadow car'. You can choose between four different cars and make them your own, by tuning them aesthetically in the Arcade Mode or technically in the Tournament Mode.<br><br>During the race, in the Arcade Mode, you will accumulate points depending on your driving skills on overtaking, speeding, skidding, time record and if you finish from 1st to 3rd position in the race. These points will be available for you to exchange in the 'Car tuning' for accessories, at the end of each race, but only, if you have finished in the first three positions.<br><br>However, in the Tournament –Time Attack Mode, the engine will be adjusted and you will have a limited time to do a recognition lap and technically fine-tune your car changing the suspension, the wheels or the aerodynamics of the car. The race will take place in 4 racing circuits in Las Vegas city and the suburbs.<br>All the circuits have got a different layout, that will increase the difficulty of the game, additionally, the weather condition Dry, Dump or Wet, will also contribute to the level of difficulty. This combination offers you a total of 12 different circuit’s conditions for racing. In both modes, the competition is limited to a number of laps.<br><br>Capturing the exact experience of competition, 'Gaelco Championship Tuning Race', straps you in the driver's seat. All the power, speed and glory of racing are now at your fingertips with unprecedented details and realism!!!", "platform": "Arcade", "release_date": "2005", "game_type": "", "esrb": "", "developers": "Gaelco", "publishers": "Gaelco", "genres": "", "max_players": "", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114995"}