{"name": "Great Sluggers '94", "overview": "Great Sluggers '94 (グレートスラッガーズ'94 Gurēto Suraggāzu Naintī Fō) is a baseball arcade game that had been released by Namco in June 1994; it runs on the company's NB-1 hardware, and as the name suggests, it is the sequel to Great Sluggers (which was released exclusively in Japan the year before). However, instead of the twelve teams of Japan's Central and Pacific Leagues, the players must take control of two of the twenty-eight teams of the American League and National League - and there are two teams for both Chicago and New York.[1] Unlike in the original, this game's teams do not have mascots (which were first featured in Super World Stadium '92) so the \"FAVOR\" screens that appear in the game's attract sequence will display two pictures of the teams' star players with their batting averages and home run counts; there are also only two stadiums to choose from (\"Traditional\" and \"Modern\"), which are based on the Kōshien (which had been renamed to \"Urban\" for the original Great Sluggers) and Kaihei Dome Stadiums, from the World Stadium series, and the original Great Sluggers respectively. The \"Modern\" Stadium also replaces the advertisement for the Japan-exclusive quiz game of Net-to! Geki-to! Quiz-to!! from the original Great Sluggers with one for Dragon Buster, but the advertisement for the puzzle game Emeraldia, which was also Japan-only, remains - and an advertisement for Super World Stadium, that misspells the last word as \"Studium\" (a case of \"Engrish\"), was also added. Both Great Sluggers games were also the basis for the NB-1 era (1995-1997) of the World Stadium series, where the Hillside and Kaihei Dome Stadium of the original (and their adverts!) reappeared.", "platform": "Arcade", "release_date": "1994", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "2.57", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/36563"}