{"name": "GuitarFreaks V8", "overview": "GuitarFreaks (ギターフリークス) is a music video game series produced by Konami. It is a rhythm game where the player uses a controller to simulate the playing of an electric guitar. The game consists of music predominantly from the rock music, rock and roll and J-pop genres. It is considered one of the most influential video games of all time, for having laid the foundations for popular guitar-based rhythm games, such as the Guitar Hero series. <br><br>The interface is similar to other games in the Bemani series. Two note scrolls—one for each player—are displayed at the left and right sides of the screen. Colorful animations for each song are displayed in the center of the screen. Each note scroll consists of four columns: one each for the red, green, and blue buttons, and a fourth column, known as the Wailing Bonus column. Individual notes and chords are represented by small colored bars that scroll upward in the columns. To play the correct note, the player must hold down the buttons corresponding to the colored bars, and move the fret lever when the bars reach the yellow fretting line. When a guitar icon is displayed in the Wailing Bonus column along with an associated note, the player can tilt the guitar upright while playing the note to receive bonus points.<br><br>The player's accuracy is judged for each note played. The current system uses the names Perfect, Great, Good, OK, and Miss to indicate a player's accuracy. Ratings of Miss will deplete the player's Groove Gauge, while Perfect, Great and Good ratings will replenish it. If the Groove Gauge is emptied completely, the player fails, and the game ends. Players are allowed to play anywhere from one to five songs depending on the game cabinet's configuration, with the ability to earn additional songs in certain versions of the game. Furthermore, if \"fast/slow\" (advanced judge) is enabled, then there will be additional indicator of judge (Just/Fast/Slow/Miss). Just Perfects are called \"X-Perfect\"s (rainbow color) while Fast/Slow Perfects are regular Perfects (yellow color).", "platform": "Arcade", "release_date": "2011", "game_type": "Released", "esrb": "", "developers": "Bemani", "publishers": "Konami", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=VqmgS22uScg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154895"}