{"name": "House of the Dead: Scarlet Dawn", "overview": "House of the Dead: Scarlet Dawn is the fifth arcade game in the House of the Dead series. It takes place in 2006, between the events of The House of the Dead 4 and The House of the Dead III. The game's story follows AMS agents Kate Green and Ryan Taylor who infiltrate Scarecrow Manor just as a horde of bioengineered creatures attack. From then on they have to fight their way to safety while exploring the mansion and uncovering who is behind the outbreak.<br><br>Like in previous games in the series, the player uses a gun controller to shoot enemies as they appear on the screen. Each creature has a weak spot that deals extra damage when hit. In addition to the monsters, there are also civilians that have to be avoided. The player also has to keep track of the partner who at any time might need to be rescued. Failure to do so before time runs out leads to a life penalty. A new feature to the series is the introduction of quick-time events in which the player needs to quickly shoot a specific target. Reloading is automatic but can also be done manually by pointing outside the screen.<br><br>In addition to the main machine gun, the player can choose two more items (shotgun, grenade, rocket launcher, etc.) ahead of each level. In the Japanese version, items are bought with coins which are awarded for successful actions such as critical shots, collectibles obtained and saved civilians while in the international versions items can be chosen freely. Another Japan-exclusive feature is the use of Aime cards. They are used for storing progress, keeping collected coins, completing achievements, checking high scores and taking part in national leaderboards. Part of the Aime functionality is also a level system where players earn experience for each stage completed and are rewarded with coins for every level up.<br><br>The game has two game modes: normal mode and master mode. The normal mode is for first time players and includes assistance events. The master mode is for advanced players and has stronger and faster enemies.", "platform": "Arcade", "release_date": "October 1, 2018", "game_type": "Released", "esrb": "", "developers": "Sega AM1 R&D Division", "publishers": "Sega Amusements International Ltd", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "4.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142685"}