{"name": "In the Groove 2", "overview": "In the Groove 2 is the sequel to Roxor Games' 2004 arcade game In the Groove. It was released to arcades officially on June 18, 2005. It was available as an upgrade kit and as a dedicated cabinet developed by Andamiro. <br><br>There are a total of 137 songs available in the arcade version.<br><br>The Novice difficulty level is a feature added to the home version of In the Groove, carried over to In the Groove 2. On this difficulty level, all songs are rated as ones (including the hardest and fastest songs on other difficulties), and play in Novice mode places a traffic light graphic on the screen that tells players when to step. As always, two players can select different difficulty levels for the same song, but if one selects Novice, then the traffic light always appears instead of the normal backgrounds. It is also worth noting that on ITG2, Novice always forces a constant speed of 120 BPM (a \"C120\" mod). As a result, since C-mods disqualify scores from appearing on the scoreboards if the song played has pauses or speed changes, those songs will never have any Novice scores saved.<br><br>Rolls are a new feature. They look like spiky hold notes and usually come in pairs. The player must continually tap the corresponding arrows until the end of the roll, much like the drum roll notes in Namco's Taiko no Tatsujin. Regardless of the song's speed, rolls must be tapped at least once every 0.3 seconds.<br><br>Survival Mode is another course-based gameplay mode. The player must play a five-song course, where each song has a time limit less than the song's length. Time left over after each song is carried over to the next, and missteps deplete the time remaining - time is only added for Fantastics, with no change for Excellents and detractions for anything lower. The lifebar in this mode is not used to determine whether the player passes. Instead, it serves as a visual indicator of how much time is remaining. The game ends when the remaining time is fully depleted.<br><br>Fitness Mode is a common home version feature on dance games that is included in the arcade version of ITG2. This gameplay mode allows users to keep track of time spent dancing and calories burned.<br><br>Three previously Marathon-only modifiers - Bumpy, Beat, and Robot (a metallic gray Flat arrow type) - have also been added to the regular modifier list. In addition, a multi-colored arrow type, Vivid, has been added for colorblind players. It resembles the default arrow color scheme used in Dance Dance Revolution.<br><br>\"Excellent\", \"Great\" and \"Decent\" judgments are now prefixed or suffixed with a dash. A prefix (-Excellent, -Great or -Decent) indicates that the player stepped too early; a suffix (Excellent-, Great- or Decent-) indicates that the player stepped too late. In novice mode, \"Way Off\" becomes \"Way Early\" and \"Way Late\" respectively; in other modes, the dash system still applies.<br><br>\"Stretch Jumps\" have been included in double play, a jump that requires a player to hit two panels simultaneously that are farther away from each other than normal jumps, such as 1PU+2PD or 1PL+2PL.", "platform": "Arcade", "release_date": "June 18, 2005", "game_type": "Released", "esrb": "", "developers": "Roxor Games", "publishers": "RedOctane", "genres": "Music", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=9S84RQw7fVo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154896"}