{"name": "INDY 500 Deluxe", "overview": "Clone of INDY 500 Twin.<br><br>Indy 500 is a 1995 arcade racing game developed by Sega AM1. Based on the IndyCar Series, the game possesses a license from the Indianapolis Motor Speedway, home of the Indianapolis 500, and includes the speedway as one of its courses. Indy 500 was AM1's second game developed using 3D computer graphics and their first to utilize color textures. While planned as a Model 3 arcade system board release, delays in the hardware's completion led to use of the Model 2 instead. A Sega Saturn port was planned, but later cancelled.<br><br>Gameplay<br>Indy 500 is a racing game based on IndyCar, and possesses an official license from the Indianapolis Motor Speedway. Players can race one of three courses: Highland Raceway, Indianapolis Motor Speedway (called Indy 500 in the game), and Bayside Street. The race commences after the user has made their choice of automatic transmission or manual transmission with a 2-position shifter. Special features of the cabinet include a steering wheel with haptic feedback. Similar to previous Sega arcade racing games, the game can be played from one of four different camera angles. Up to eight players can compete in multiplayer, via a feature where multiple arcade cabinets can be linked.<br><br>Development and release<br>Indy 500 was developed by Sega AM1, an arcade research and development division of Sega led by Rikiya Nakagawa. The game was AM1's second project using 3D computer graphics, after 1994's Wing War. According to Nakagawa, Indy 500 was the first time AM1 was able to develop color textures and gave the team experience in developing games in 3D. The game was originally developed for the Sega Model 3 arcade board, but due to delays in the board's development it was instead released on the Sega Model 2, specifically the Model 2B variant first used in Sega Rally Championship.<br><br>Indy 500 was released in Japan in July 1995, and to other regions by the end of the year. The development team behind the Sega Saturn version of Sega Rally Championship were planning to do a Saturn conversion of Indy 500, and a Saturn port was announced, but due to fan demand they were taken off of the project and put to work on Daytona USA: Championship Circuit Edition instead.<br><br>Reception<br>In Japan, Game Machine listed Indy 500 in their September 1, 1995 issue as being the second most-successful dedicated arcade game of the month. However according to an article published in Edge a few months after the game's release in Japan, \"... reaction to the game in Japan has been relatively muted so far, with Namco's impressive Rave Racer attracting a lot more players.\"<br><br>A Next Generation reviewer called Indy 500 \"the fastest simulated driving experience ever. He praised the game's high quality graphics and effective simulation of the unique qualities of IndyCar racing, though he also remarked that the infrequency of powerslides makes the game less fun. French magazine Player One [fr] praised the game's graphics and stated that Indy 500 continued a racing tradition with Sega that began with Virtua Racing and continued with Daytona USA and Sega Rally Championship. A reviewer for Computer and Video Games compared the game to Daytona USA and stated that Indy 500 is a more realistic game, but lacks in both graphics and gameplay compared to Daytona and Rave Racer. Reviewing the game for Sega Pro, Steve Hardy expressed disappointment that Indy 500's course selection offered nothing out of the ordinary. He gave praise to the game's graphics, but suggested that players play Sega Rally Championship instead for more excitement.", "platform": "Arcade", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega Enterprises Ltd.", "publishers": "Sega", "genres": "Racing", "max_players": "8", "cooperative": "No", "rating": "2.86", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ua4ZfqopTyw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/36856"}