{"name": "Jungle Hunt", "overview": "Jungle Hunt is a one- or two-player side-scrolling arcade platform game produced and released by Taito in 1982. It was also known as Jungle King in early releases.<br><br>The player controls a jungle explorer who sports a pith helmet and a safari suit. The player must rescue his girl from a tribe of hungry cannibals. To do this, he must swing from vine to vine, survive a crocodile-infested river, jump or duck falling rocks rolling downhill, and release the girl before she \"takes a dip\" in the boiling cauldron.<br><br>Jungle Hunt is one of the first video games to use parallax scrolling.<br><br>History<br><br>Jungle Hunt changed names several times during development. The original prototypes were called Jungle Boy and later became Jungle King for release to the arcades. In these earlier versions the playable character was a bare-chested man with a loincloth who resembled Tarzan.<br><br>Taito was sued by the Edgar Rice Burroughs estate for copyright infringement for using the character's likeness. This led to a re-release as Jungle Hunt, with the following changes made to the game:<br><br>The character was replaced with a jungle explorer wearing a pith helmet and safari outfit.<br>In the first scene, ropes replace the vines as the objects that the player has to swing on.<br>The Tarzan yell was removed and cannot be heard throughout the game. It was replaced by the music from the end of the second scene.<br><br>Taito Brazil (Taito do Brasil) released a version of the game in Brazil in 1983 under the title 'Jungle Hunt' which included the bare-chested character and the Tarzan yell. Yet another variant of the game was called Pirate Pete. Gameplay in this version was identical to Jungle Hunt but the character was replaced with a pirate (complete with eye patch) and the levels had a pirate theme.<br><br>Gameplay<br><br>The gameplay is split into four scenes, which have different objectives.<br><br>In Scene 1, the explorer is required to swing from vine to vine. This is accomplished by pressing the action key when two vines swing closely enough together. Timing is critical, and missing the vine causes the explorer to fall to the jungle floor, losing a life. In some cases the vine may also have a gorilla swinging from it, in which case the explorer must time his jump not only to catch the vine but also to not hit the gorilla. If he hits the gorilla, he falls to the jungle floor and loses a life.<br><br>Scene 2 has the explorer navigating a crocodile-infested river. The explorer can attack the crocodiles from below with his knife, unless their mouths are open. The explorer must return to the surface periodically to breathe, where he cannot attack the crocodiles. Bubbles periodically rise from the bottom of the river, which can trap the explorer and carry him to the surface, potentially hitting crocodiles on the way.<br><br>Scene 3 involves the explorer dodging various sized boulders rolling and bouncing towards him as he runs up the side of a volcano. Timing is critical as the different sized boulders bounce at different speeds and heights, and the explorer can be trapped between them.<br><br>In the final scene, the explorer must evade cannibals while attempting to get to a woman being lowered into a flaming cauldron. After the player rescues the woman, the word \"Congratulations!\" appears, which is then followed by a message saying \"I Love You!!!\" followed by the woman kissing the explorer.<br><br>Further gameplay repeats the scenes with increased difficulty.", "platform": "Arcade", "release_date": "August 1, 1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Taito", "publishers": "Taito", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.3", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=OBIKxWtfuIw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31564"}