{"name": "Kid no Hore Hore Daisakusen", "overview": "Kid no Hore Hore Daisakusen (キッドのホレホレ大作戦? lit. Dig Dig Kid's Epic Battle) is an action arcade game developed by Nichibutsu and published in Japan in 1987. It was originally to be entitled \"Booby Kids\" in an early prototype (as shown in the flyer to the right), but the name was ultimately changed. In this case, the title was a reference to the \"booby traps\" that this player lays for the enemy, but it's possible that the developers felt the name might be misconstrued.<br><br>Kid no Hore Hore Daisakusen is probably best compared to a much older game known as Heiankyo Alien, which Nichibutsu apparently obtained the rights to at some time. While the play mechanics are similar to Heiankyo Alien, in which the player must dig holes to trap enemies in and kill them by filling the holes back up, the goal in Kid no Hore is not to kill all of the enemies (they constantly reappear). Instead, the goal is to collect all of the treasure chests scattered throughout the level in order to obtain the key which opens the door that leads to the next level. In this manner, it may also be compared to an overhead-view version of Lode Runner.<br><br>While this game was ported to a few home systems, it's legacy is a little strange. It was first ported to the Famicom under its original title, Booby Kids, with entirely different levels, and was given a sequel on the Game Boy known as Booby Boys. The game's concept was converted for play on the PC Engine, but was changed to make use of a license to use the Doraemon character and released as Doraemon Meikyuu Daisakusen. When the game was localized for play in the United States on the Turbo Grafx-16, the Doraemon character was removed, and the original player sprite was restored, but the game was entitled Cratermaze.", "platform": "Arcade", "release_date": "1987", "game_type": "Released", "esrb": "Not Rated", "developers": "Nichibutsu", "publishers": "Nichibutsu", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=QEeByrMJl6o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37032"}