{"name": "Kid Chameleon", "overview": "The player, as Kid Chameleon, progresses through a series of levels, containing an array of deadly enemies and obstacles. Most levels contain a flag, which is the primary goal of each level, from which the player progresses to the next level. However, a number of teleporters throughout the game can warp the player not only to different places in the same level, but also to different levels, and sometimes to an entirely different path through the game. At the end of the game, Kid fights and defeats the final boss, Heady Metal. Kid Chameleon contains 103 levels, of which only about half are on the \"main path\" (traversing levels only by flags), and also counts 32 smaller unnamed levels, simply called \"Elsewhere\". Despite the game's considerable length, there was no password system or other method of saving the game (although re-releases in compilations and the Virtual Console include their own save features). There are several bonuses that can be earned at the end of certain levels (in which the flag is touched), including beating a time limit, not getting hit and not collecting any prizes.<br><br>As Kid Chameleon moves through the game's levels, he gains access to masks that alter him into different characters. Each character has different special abilities and varying numbers of hit points. Collecting a mask that the player is already wearing will restore its health. The sheer amount of variety in gameplay due to the various characters is part of what gave Kid Chameleon such an addictive style; few levels repeated the same structure and they usually had specific strategies and characters to be beaten. In addition to the offensive abilities of each form, the Kid could also defeat enemies by jumping on them, although he may take damage from some enemies by doing so. Each form can also make use of Diamond Powers which require diamonds collected in the game to use, accessed by pressing A + Start. Players lose a life if Kid Chameleon loses all his hit points in human form, is crushed, falls into bottomless pits or lava, touches the drill wall which appears in certain levels, or if time runs out. Extra lives and continues can be found in the game, with additional lives awarded for every 50,000 points.", "platform": "Arcade", "release_date": "1992", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37030"}