{"name": "Kingdom Grand Prix", "overview": "Kingdom Grandprix, released in Japan as Shippū Mahō Daisakusen Kingdom-Grandprix (疾風魔法大作戦キングダム-グランドプリ Shippū Mahō Daisakusen Kingudamu-Gurandopri?, lit. \"Hurricane Magic Armageddon - Kingdom-Grandprix\") is a vertically scrolling shooter/racing hybrid arcade game created by Eighting/Raizing, it was later ported to the Sega Saturn. It is the second in the Mahou Daisakusen series, but the first to include the bizarre but original feature of being a shooter/racing hybrid.<br><br>The game consists of a vertically scrolling field where the player races against seven contestants while shooting enemies and avoiding enemy bullets. Tapping the fire button fires the player's weapons; holding it down gives the player a speed boost. In addition to these speed boosts, overall speed will increase or decrease depending on screen position (the higher up the player craft is onscreen, the faster it travels). Overall speed decreases every time a life is lost or the next stage is reached.<br><br>The player is also given a limited amount of bombs which destroy most on-screen enemies and slow down the opponent racers. There are four power-ups in Kingdom Grandprix. All have a cumulative effect on overall power except the bomb which simply increases the number of times it has been used.<br><br>The game has a total of twelve stages in a branching path configuration. In most cases, there is a choice of two stages for each level. There is only one choice for the first level, and there are three choices for the sixth level. Beating the first loop of the game in one credit and finishing first overall unlocks the second loop, where all the stages not selected in the first loop are played.", "platform": "Arcade", "release_date": "September 1, 1994", "game_type": "Released", "esrb": "", "developers": "Raizing", "publishers": "Eighting", "genres": "Racing", "max_players": "2", "cooperative": "Yes", "rating": "3.53", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=71c8lhy4x-o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/30619"}