{"name": "Land Breaker", "overview": "Land Breaker, not to be confused with Taito’s excellent (but not lewd) puzzler Landmaker, is yet another example of a saucy arcade game adopting what has become known as the “outline” genre. But don’t come into this one expecting just another Qix clone — this one actually does some notably different and interesting things.<br><br>Land Breaker appeared in 2000 to relatively little fanfare; it’s barely acknowledged in the collective history of arcade games recorded across the Internet. That’s kind of a shame, though, because it provides an interesting twist on the usual “outline” formula. Yes, you’re still uncovering vaguely provocative images of scantily clad women — here provided in the form of low-resolution 65,536 colour digitised images — but the way in which you do so is notably different from other games of this type, such as Kaneko’s Gals Panic series.<br><br>Instead of starting on the stage boundary and “cutting” into the stage as in Qix and its many, many clones, in Land Breaker you control a mechanical device which can freely move around the interior of the stage. By tapping one of the two buttons, you can switch it between a horizontal and vertical orientation, and by tapping the other button, you fire out a laser in both directions.<br>If this laser reaches both sides of the available play area without being intercepted by something, it “cuts” the playfield, though the mildly lewd background is only actually uncovered if one of the slices you make contains no enemies whatsoever. In other words, if you cut the playfield in half, the half that has no enemies will reveal the backdrop, while the half that does contain enemies becomes the new available play area.<br><br>But what happens if both slices contain enemies? In Qix, that was the main way in which you scored big points, largely because it was extremely difficult to achieve. But in Land Breaker, what happens is that you still create the “cut”, but neither slice reveals the background. The cut does act as a barrier for the enemies, however, so when dealing with large groups of enemies you can use this to corral them into gradually smaller and smaller areas, revealing the background a piece at a time with proper timing.<br><br>The enemies mostly take the form of bouncing balls of various sizes. Towards the start of the game, you only have to deal with one or two large balls, but as the game progresses, you’ll have to deal with larger numbers of smaller balls, and occasional enemies that move in more unpredictable patterns.", "platform": "Arcade", "release_date": "1999", "game_type": "", "esrb": "Not Rated", "developers": "Eolith", "publishers": "Eolith", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "3.07", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37132"}