{"name": "Ma Cheon Ru", "overview": "You're all familiar with Shanghai, right? The game about picking up pairs of Mahjong tiles out of a big pile in the right order? Ma Cheon Ru is based on a kind of variant of that. I can't find a name for this variant, though I think the most well-known games to feature it are the Dragon World series by IGS. How it works is that like in Shanghai, there is a specially-arranged pile of Mahjong tiles and you have to pick up all the tiles, with restrictions on which tiles can be picked up. Also like in Shanghai, the main restiction is that you can only pick up tiles that aren't covered by other tiles, and which have at least one of their horizontal sides untouched by other tiles, too. You aren't trying to match pairs to remove them from the game, though.It's a pretty simple concept, but it's one that's kind of hard to explain in words. You have to match trios of identical tiles, but you don't have to pick them up together. Instead, you can hold up to six tiles in your hand (picking up a seventh that isn't the third tile of a set results in a game over), and tiles vanish from your hand when you've made a set of three. Get rid of all the tiles in the time limit and you finish the stage and go onto the next one. It's a genre I've only seen in arcade games, and pretty much all of them ramp up the difficulty very very quickly.What makes Ma Cheon Ru stand out though, is the bonus stages (if you play it after reading this, I recommend going into the settings in MAME and setting it so they appear after every stage instead of after every third stage). There's nine different bonus stages that take the form of Tanto R-style minigames, with a wide variety of subject matter, like shooting parachutists, repeatedly punching a guy in the face, throwing objects at ugly people, and so on. They break things up pretty well, and you can get power ups for the main game if you score enough points in them. In fact, it seems like a lot more care and attention went into the bonus stages than the main game itself, and I wonder if the devs actually wanted to make a minigame compilation, but their publishers said that they needed to make a tile-matching puzzle game instead? We'll probably never know. Either way, I don't think this little subgenre is actually as fun as regular old vanilla Shanghai, but if you're going to play one of these games, Ma Cheon Ru at least has some mildly amusing bonus stages in its favour.", "platform": "Arcade", "release_date": "1999", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37268"}