{"name": "Make Trax", "overview": "Player controls a paintbrush to paint paths within a maze. The player is harassed by two fish which can be temporarily destroyed by running them over with a one of two paint rollers located near the maze center. A critter occasionally emerges to leave footprints on painted areas which must then be repainted.<br><br>The objective of this game is to paint the entire maze. As the maze is being painted, two devilish little fish form in the aquarium and take chase after the paintbrush. If they overtake the brush, a new one will have to be used. Your only defense against these deadly little fish are the paintrollers that you can use to roll over them. Each time you roll over a goldfish you collect bonus points, and temporarily put them out of action, but they will return to their aquarium, regroup and come back to torment you further.<br>If that is not enough you will also have to contend with other little beings who are determined to make tracks in your nice paint job kittens, mice and even a dirty bird that will leave its droppings in your fresh paint. Other aggrivations include cats, tires and an invisible, footprint-leaving man who can be caught, if you are quick enough, for 1000 points each time.<br><br>When you reach 10000 points, you recieve an extra paintbrush.<br><br>The player must finish painting blank patterns in the maze with color as two tail-swishing goldfish jump out of an aquarium and chase the paintbrush, trying to force it to paint itself into a corner. As the game progresses, the deadly goldfish get smarter and trickier. They seem to anticipate the player's every move. These goldfish chase the paintbrush, then turn and run away. They even plot to close in on the brush from opposite ends of the path. The player has to try to outmaneuver the goldfish or make it to one of the overpasses, grab the paintroller, which waits for it there, and roll over the goldfish. This sends the goldfish back to the aquarium. The player gets a score, which doubles progressively for each fish it sends back to the aquarium.<br>In order to get some relief from the goldfish's relentless pursuit, the player can leave the screen through any one of the six exits on the screen. The brush reappears on the screen on the opposite side but it must be careful that the goldfish have not followed it. The goldfish can pursue the paintbrush off the screen and back onto it again.<br><br>As the game continues, other problems arise for the brush. On each pattern, a different mischief-maker makes tracks through the wet paint, spoiling the player's painting. These mischief-makers include a playful kitten, a nose-twitching mouse, a dirty bird, a runaway tire, a dancing cat, and an invisible man who leaves only footprints on the paint job. To stop these mischief-makers from ruining the painting, the player has to catch them with the brush. To complete the pattern that is being painted, the player has to go back over any tracks that have been left behind. The player can gain up to three extra brushes to do this.<br><br>Has some similarities to Atari's Amidar, which also came out in 1981", "platform": "Arcade", "release_date": "1981", "game_type": "Released", "esrb": "Not Rated", "developers": "Alpha Denshi", "publishers": "Exidy", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=jnkHKWWJhnY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12181"}