{"name": "Manx TT Superbike", "overview": "Manx TT Super Bike (マンクスＴＴ スーパーバイク) is a Sega Model 2A CRX 3D arcade motorbike racing game developed by Sega AM3 and Sega AM4. It was initially released in 1995. It is a motorcycle racing game built for the Sega Model 2 arcade board. Up to 8 players can race in this game if enough cabinets are linked together (4 Twin two rider cabinets or 8 Deluxe single rider cabinet units). The Deluxe cabinet includes a larger single unit 50-inch projector screen. The twin model two player cabinet was the standard model; hence, also referred to as Manx TT Superbike: Twin <br><br>The game's setting is the Isle of Man TT - the world-famous and demanding motorcycle racing event held on the Isle of Man. There are two courses to race on: the Laxey Coast course for novices and the more difficult TT (\"Tourist Trophy\") Course for veteran players. While the TT Course is based on the actual course on the Isle of Man, the Laxey Coast is a fictional course designed by the game developers, though its scenery is drawn from the Isle of Man.<br><br>The arcade game was known at the time for its impressive graphics and innovative cabinet. Many arcade motorcycle games incorporated a bike-like machine that tilted so the player could maneuver the on-screen bike through the physical \"bike\" (pioneered by another Sega game, Hang-On); to do this, the player would need to push their feet against the floor. The Manx TT machine, however, was sensitive enough to tilt just from the rider shifting their weight, allowing the player to keep their feet on the machine and use their body weight to control the on-screen bike, making the game feel more realistic. Many of the unsold cabinets were converted into Motor Raid, a futuristic Model 2 motorcycle racing game released in 1997.", "platform": "Arcade", "release_date": "November 28, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega AM3", "publishers": "Sega", "genres": "Racing", "max_players": "8", "cooperative": "Yes", "rating": "1", "wikipedia": "", "video_link": "https://youtu.be/D4fnGdy6JZs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37515"}