{"name": "Mario Bros.", "overview": "Mario Bros. was produced by Nintendo in 1983.<br><br>Turtles, crabs, and flies come pouring out of the waterworks. Hit the floor beneath them to flip them over, then kick them into the water. Collect coins for bonus points.<br><br>Mario Bros. features two plumbers, Mario and Luigi, having to investigate the sewers of New York after strange creatures have been appearing down there. The objective of the game is to defeat all of the enemies in each phase. The mechanics of Mario Bros. involve only running and jumping. Unlike future Mario games, players cannot jump on enemies and squash them, unless they were already turned on their back. Each phase is a series of platforms with four pipes at each corner of the screen (in the old version along with an object called a \"POW\" block in the center). Both sides of every phase feature a mechanism that allows the player to go off-screen to the left and appear on the right and vice versa.<br>The player gains points by defeating multiple enemies consecutively and can participate in a bonus round to gain more points. Enemies are defeated by kicking them over once they have been flipped on their back. This is accomplished by hitting the platform the enemy is on directly beneath them. If the player allows too much time to pass after doing this, the enemy will flip itself back over, changing in color and increasing speed. Each phase has a certain number of enemies, with the final enemy immediately changing color and increasing its speed to maximum. There are three enemies in all: the Shellcreeper, which simply walks around; the Sidestepper, which requires two hits to flip over; and the Fighter Fly, which moves by jumping and can only be flipped when it is touching a platform. Players may also make use of the above-mentioned \"POW\" block, which flips any enemy touching a platform or the floor when a player hits it from below. This item can be used three times before it disappears. Coins appear whenever enemies are defeated and may be collected for bonus points.<br>As the game progresses, elements are added to increase the difficulty. Fireballs either bounce around the screen or travel directly from one side to the other, and Slipices can freeze platforms, causing Mario and Luigi to skid. In addition, icicles start to form under the platforms and fall loose. Bonus rounds give the players a chance to score extra points by collecting coins without having to deal with enemies; the \"POW\" block regenerates itself on each of these screens.", "platform": "Arcade", "release_date": "July 14, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.93", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=JHlUEJXaxfY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/15753"}