{"name": "Michael Jackson's Moonwalker (Mega-Tech)", "overview": "The Mega-Tech System is an arcade cabinet released by Sega in 1989, and Western counterpart to the Mega 6. It was based on the Sega Mega Drive home console, and was designed similarly to Nintendo's PlayChoice-10: players chose games from a menu of eight titles, with credits buying more play time (usually 1 minute per credit) rather than extra lives or continues; reaching a game over screen does not end the play session, and players can start over or choose a different game as long as there was some play time remaining. The Mega-Tech was not released in North America, though did see use in Asia and the PAL regions.<br><br>Michael Jackson's Moonwalker (マイケル・ジャクソンズ・ムーンウォーカー Maikeru Jakusonzu Mūnwōkā) is the name for several unrelated video games, all based on the film of the same name created by U.S. Gold and Sega in 1989 and 1990 that incorporate the personage of and were co-developed by Michael Jackson himself. The arcade version, home video games and home computer versions all differ in terms of gameplay, but the story and concept remain constant. The story, which is taken from the Moonwalker film, follows Michael, using various music and dance related abilities, on a quest to save kidnapped children from the hands of the evil \"Mr. Big\". The games incorporated synthesized versions of the musician's hits, such as \"Beat It\" and \"Smooth Criminal\". The games have now achieved cult status and are remembered for being a memorable point in Jackson's change to a different stage persona from \"Thriller\", to \"Bad\".", "platform": "Arcade", "release_date": "", "game_type": "", "esrb": "Not Rated", "developers": "Sega", "publishers": "Sega", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127797"}