{"name": "Millipede", "overview": "Millipede was produced by Atari in 1982.<br><br>Blast bugs and mushrooms with your cannon in this sequel to Centipede.<br><br>Defend yourself from hordes of larger-than-life insects. The bugs keep coming -- all kinds -- and the challenge continues while the intensity increases.<br><br>Armed only with a bow and arrows, you, as the \"Archer\", must fire through through a garden of enormous mushrooms to hit the giant millipede who steadily crawls right toward you. Single heads shoot out from the sides of the play field!<br><br>Spiders, earwigs, inchworms and beetles appear to wreak their own special havoc and then suddenly the screen is filled with waves of bombing bees, dragonflies and mosquitoes! Your only chance is to explode one of the DDT bombs!<br><br>Although this game utilizes the same format and controls as Centipede, Millipede offers many extra elements that test your skill limits. You still shoot from the bottom of the screen at a field of mushrooms, but instead of battling the original four insects, you now face a deadlier variety of enemy bugs: millipedes, spiders, bees, beetles, earwigs, inchworms, dragonflies, and mosquitoes. Naturally, each of these insects has unique characteristics that must be studied.<br>Fortunately, there is a new feature that can be used to the player's advantage: DDT bombs. Four of them can appear on the playfield at any given time. Shooting one of them unleashes a cloud of deadly gas that destroys any insects, flowers or mushrooms in the area. After every few levels a swarm of insects appears, the point value for each insect shot during the swarm increases by 100 points up to 1000 points. Another feature is the option to start at a higher level of difficulty, which progresses as the player scores more points similar to Tempest.<br><br>The game's original or working title was \"Centipede Deluxe\".", "platform": "Arcade", "release_date": "January 1, 1982", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari", "publishers": "Atari", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4.21", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=r8IX8Y2t0LQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33240"}