{"name": "Mini Vaders", "overview": "Mini Vaders (also known as Minivader) is a fixed shooter arcade game that was released by Taito Corporation in 1990; it is based on the four (five, if you count Space Invaders II) games that make up their Space Invaders series, but is not officially part of it. It utilizes a single Zilog Z80 microprocessor (running at 4 MHz), only features monochromatic graphics, and does not have a scoring system or any sound chips - and the reason is because it was only created as a test board on account of a Japanese law stating it was illegal to sell an arcade cabinet without a game in it. The invaders also will not fire off any bullets, which means the only way to lose is if they reach the bottom of the screen; UFOs will also appear over the formations (and, if you shoot them, they will turn into the word \"Bomb\", but given that this game does not have a scoring system, it has no effect). <br><br>The game is comprised of eight rounds - and the initial one features only one Small Invader, while the second features two Small, eight Medium and six Large Invaders. The third features six Small, twelve Medium and twelve Large Invaders, while the fourth features ten Medium and eleven Large Invaders; the fifth, and sixth, both feature four Small, eight Medium and eight Large Invaders, while the seventh features one Small, two Medium, and two Large Invaders. The eighth (and final) round features eight Small Invaders, sixteen Medium Invaders and sixteen Large Invaders - and once you have cleared it, the text \"ALL ROUND CLEAR!\" shall appear on the screen. The text \"GAME OVER\" will then appear on the screen, and the game will go back into attract mode ready for another player to insert his coin.", "platform": "Arcade", "release_date": "1990", "game_type": "", "esrb": "Not Rated", "developers": "Taito Corporation", "publishers": "Taito Corporation", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "2.06", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=1F-h5ieaaFw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37634"}