{"name": "Missile", "overview": "Missile is a 1969 electro-mechanical arcade shooter game by Sega that launches rockets with a joystick control.<br><br>The game's development was led by Hisashi Suzuki's Sega Production and Engineering Department. It was a shooter and vehicle-combat simulation, and it featured electronic sound and a moving film strip to represent the targets on a projection screen. It was first game to feature a joystick with a fire button, which formed part of an early dual-control scheme, where two directional buttons are used to move the player's tank and a two-way joystick is used to shoot and steer the missile onto oncoming planes displayed on the screen; when a plane is hit, an animated explosion appears on screen, accompanied by the sound of an explosion.<br><br>It was one of the first video projection arcade games, along with Sega's Duck Hunt and Kasco's Indy 500. Missile was also the first game to use a joystick with a fire button, which was a major step forward for game design, laying the foundations for how arcade games and video games were controlled in the 1970s and 1980s. After early location testing in Japan, the game made its North American debut at AMOA 1969, where it was well-received. Much like Periscope, Missile became a major success in Japan and North America. Sega followed-up the success of Missile with the ambitious first-person flight simulator Jet Rocket in 1970. Missile also inspired Midway's 1970 arcade game S.A.M.I.[1]<br><br>The game has electronic sound, and the fired missile can be steered by the player after it is launched by using the joystick. The cabinet is covered in a Formica-like material and is very durable (and heavy). Missile uses a looping film strip to show the planes on a projection screen. The player moves a small motorized tank left and right via two buttons (left and right) which moves the motorized launcher, and then fires ahead of the incoming missiles. Once the missile is launched, the missile can be slightly steered into the oncoming planes (\"flight control\") by moving the joystick left or right. If a plane is hit, an explosion is heard and an explosion flashes on the projection screen.<br><br>The cabinet was specifically designed for 25-cent play in the United States[2].<br><br>It was an early shooter and vehicle combat simulation game. It was also the earliest known arcade game to feature a joystick with a fire button, used as part of an early dual-control scheme. It uses a similar projection display system as Duck Hunt, Grand Prix, Jet Rocket and Killer Shark.<br><br>In 1970, the game was licensed to Midway, which released a version of the game as S.A.M.I. in North America.", "platform": "Arcade", "release_date": "", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38176"}