{"name": "Monaco GP", "overview": "Monaco GP was produced by Sega/Gremlin in 1980.<br><br>An overhead driving game where you try to beat the clock. During the game a player is given an unlimited number of cars lives. Extended play is awarded once a player's score reaches a certain amount.<br><br>A player receives points based upon how fast the car is traveling. About eight points per second are awarded for being in low gear with the accelerator fully depressed while 25 points per second are received for being in high gear with the pedal in the same position.<br><br>The goal is to beat the clock. The player basically has an unlimited number of cars, but it is nearly impossible to reach extended play except using high gear and not crashing.<br>There are 5 areas you drive through: normal road, ice (you will slide around), tunnel (you can only see what's ahead of you in your headlights), gravel (you will slow down if you drive on the gravel), and the bridge (very tricky). The five levels always show up in the same order. Until you get extended play you will only drive on the normal road, ice, and the tunnel.<br><br>You can crash as much as you want during the first 90 seconds of game play. There is no penalty except losing out on points. Extended Play (one extra car) is awarded at 2,000, 4,000, 6,000, and 8,000 points. The game stops counting score at 9,999 (and the scene locks on the normal road, it never changes after that).<br><br>The cars all move in a fairly predictable sine wave. As you go further, your car gets faster and traffic gets thicker making the game more challenging. The trickiest part of the game is getting on the bridge. It's always in the middle and you'll be warned with a bottleneck sign just before you get to it. Drop to first gear, let off the gas, and merge within the other cars. The safest way to beat the bridge is to match speed with the other cars until you're off. Puddles will also cause you to lose control briefly. Puddles only appear on the normal road and only once per scene and usually towards the beginning. You can typically avoid them by sticking to the extreme left or right of the screen.", "platform": "Arcade", "release_date": "January 1, 1980", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega", "publishers": "Sega", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "4.04", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=n7Vl6g0RiHI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37673"}