{"name": "Motor Raid", "overview": "Motor Raid (モーターレイド) is a racing video game released by Sega on its Model 2A arcade system board in 1997. In contrast to the realistic style of most of Sega's previous racing games, Motor Raid uses a futuristic aesthetic and gameplay supplemented by fighting elements.[1]<br><br>The game was released in single and two-player cabinets, which may be linked together to support up to four players.[2] Game modes include \"Championship\" and \"Practice\" and there are four playable characters, Geila, Gunz, Io and Robin.<br><br>Unlike other Model 2A racers like Manx TT Superbike and the original Sega Rally Championship, Motor Raid was not ported to the contemporary Sega Saturn or Windows 95. In 2018, it was made playable on consoles for the first time via an in-game arcade machine in the Yakuza spin-off Judgment.[3]<br><br>As with most motorcycle arcade games, acceleration is performed by twisting the handle, steering is accomplished through leaning the bike's body left or right, and braking is done by squeezing a lever. As the race progresses, a three-layer turbo gauge fills automatically and the player can choose among three types of boosts: a short blue boost that is ready when the boost gauge fills to 100%, a stronger green boost that requires the boost gauge to fill up to 200%, and an extremely powerful orange boost that can only be unleashed when the boost gauge fills to the maximum level of 300%, and will allow the character to knock out opponents. Boosts are activated by waiting for the gauge to fill up and twisting the acceleration handle twice whenever the desired boost type is available.<br><br>Players can engage in close quarters combat in an effort to seize or maintain first place. The primary combat move is to swing a powerful weapon (such as a crescent sword or a \"smash-nail\" pike) around to knock down and slow opponents. The player can also hold down the button to sacrificially throw the weapon at an opponent in an effort to take their weapon as a replacement, but if the player misses or gets attacked too many times, the weapon is lost. In such a situation, the player can throw a punch or use a permanent secondary weapon, such as a claw or whip, for a chance to steal a weapon from a nearby opponent. Players can kick to hold off opponents that approach from behind, but kicks do not result in knockouts.<br><br>Players are given a limited amount of time to finish a race, which can be partially replenished by passing through checkpoints. If the timer reaches zero, the game ends. Finishing a race at a good position may award the player a few extra seconds of time for the next race.<br><br>Upon beginning a game session, the player is prompted to choose between four characters and whether to compete in the \"Championship\" (where the player races on three planets for the top prize) or do a \"Practice\" run on a course from any of five playable planets (plus a sixth one, Segal, if a cheat code is entered). The player begins each race with the character's primary weapon, secondary weapon, and a 100% full turbo gauge.<br><br>In the \"Championship\" mode, the player does a two-lap race on the first planet, Yendas, and a one-lap race in two other planets. Which planet the next race takes place on depends mostly on whether or not the player finishes in first place. If the player finishes first in all three races, they will go to the planet Segal for an extra race. If the player finishes first in every race, more about the chosen character is revealed in a bonus ending.", "platform": "Arcade", "release_date": "January 1, 1997", "game_type": "", "esrb": "", "developers": "Sega", "publishers": "Sega", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=6NbeD4W84Zo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14481"}