{"name": "Ms. Pac Man (Speedup Hack)", "overview": "The gameplay of Ms. Pac-Man is very similar to that of the original Pac-Man. The player earns points by eating pellets and avoiding ghosts (contact with one causes Ms. Pac-Man to lose a life). Eating an energizer (or \"power pellet\") causes the ghosts to turn blue, allowing them to be eaten for extra points. Bonus fruits can be eaten for increasing point values, twice per round. As the rounds increase, the speed increases, and energizers generally lessen the extent of the ghosts' vulnerability, eventually stopping altogether.<br><br>There are also some differences from the original Pac-Man:<br><br>The game has four different mazes that appear in different color schemes, and alternate after each of the game's intermissions are seen.<br>Three of the four mazes (the first, second, and fourth ones) have two sets of warp tunnels, as opposed to only one in the original maze.<br>The walls have a solid color rather than an outline, which makes it easier for a novice player to see where the paths around the mazes are.<br>The ghosts' behavioral patterns are different, and include semi-random movement, which prevents the use of patterns to clear each round.<br>Instead of appearing in the center of the maze, the fruits bounce randomly around the maze, entering and (if not eaten) leaving through the warp tunnels. Also, each fruit appears one at time unlike the original Pacman in which each of the fruits after level 2 appears twice until the player reaches the Key. Once all fruits have been encountered, they appear in random sequence for the rest of the game, starting on the eighth round; this means that a 5000-point banana can be followed by a 100-point pair of cherries, and vice versa.<br>The orange ghost is called Sue, rather than Clyde; her color was later changed to purple in Pac-Land to differentiate her.<br>When Ms. Pac-Man makes contact with a ghost and dies, she spins around rather than folding in on herself like the original Pac-Man did.<br>The three intermissions have changed to follow the developing relationship between the original Pac-Man and Ms. Pac-Man (from when they first meet to having a stork drop off their baby); the latter later served as the attract opening sequence for Jr. Pac-Man.<br>The sound effects and music are very different from those of the original game, including a new opening theme and death sound effect.<br>As with Pac-Man, this game has a bug in the subroutine that draws the fruit, which renders the 256th round unplayable. However, the game also has other bugs that cause it to crash or become unplayable much sooner, making it impossible to reach Round 256 without the use of emulation", "platform": "Arcade", "release_date": "1981", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "4.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/31759"}