{"name": "Mushihime-Sama Futari Black Label", "overview": "Mushihime-sama Futari was originally planned to have four modes instead of the three. This fourth mode, titled \"God mode\" would be added in a special remixed version of the game titled Mushihime-sama Futari Black Label.<br><br>This version was originally released for arcades on December 20, 2007, and was only available through Cave's online store. Only 150 copies were produced, and were completely sold out within an hour. The game was originally completed in one month by a single programmer; Cave's arcade publisher AMI wanted more content than a single mode and new TLB (Spiritual Larsa). This request saw Cave take their first foray into Adobe Photoshop, heavily modifying the background colors (most noticeable on stages 2, 3, and 5), along with remixed scoring systems and enemy placements. Each character has only one shot type, a combination of the normal and abnormal types from the original game; and when combined with faster movement speed, the result is characters far more powerful than their original counterparts. Of course, this buff comes at the expense of all modes now having an increase in bullets that also travel faster.<br><br>The final mode, God mode, is a heavily altered replacement of the Ultra mode found in the regular versions of the game. While replacing Ultra mode, the scoring system is based on Maniac mode, with the multiplayer maxing out at an increased value of 30,000; rather than the normal Maniac value of 9,999. Additionally, past 9,999 the counter will flash, allowing for the same quick increase techniques as in the new Maniac mode. The new TLB, Spiritual Larsa, is considered to be much easier than the actual stage 5 end boss, but getting to her is much harder than before. To reach Spiritual Larsa, players must clear the game up to the final boss without losing a single life. Successfully defeating her will double the end of game score bonus.", "platform": "Arcade", "release_date": "December 20, 2007", "game_type": "Released", "esrb": "Not Rated", "developers": "Cave", "publishers": "AMI", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.97", "wikipedia": "", "video_link": "https://youtu.be/PPlRGOscbXo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/37773"}