{"name": "Panicuru Panekuru", "overview": "Panicuru Panekuru (パニクルパネクル, lit. Panikuru Panekuru) is a puzzle arcade game which was released by Namco in 2002 only in Japan; it runs upon that company's System 10 hardware, and the player must use a 4-way joystick and a single button to take control of a dog named Īnu, who is on a mission to rescue several other animals who have been imprisoned inside panels: Kākame (turtles), Nēneko (cats), Gāgacho (ducks), Kūkuma (bears), Ūsa (rabbits), Yāyagi (goats), Ūshi (bulls), and Būbuta (pigs). To make the panels explode, the player has to press the button to make Īnu pick one that he is facing up in his teeth (he may not pass over the panels, but he may pass over the flashing dots), and line up at least three identically-coloured ones (either horizontally, vertically or diagonally) by carrying one to an appropriate position then pressing the button again to drop it - and when done correctly, the panels shall flash before exploding, freeing the animals that were trapped inside them. After saving a certain amount of animals, the current level shall be cleared; the game shall also end after 6 levels on its Okiraku Course and 12 levels on its Tegotae Course, but its Endless Course, as its name implies, continues indefinitely. However, if Īnu ever inadvertently surrounds himself with panels on all four sides and becomes unable to move as a result, he shall lose a life - and when the game was new, it also supported Internet ranking, which could be reached through a password that appeared on the screen after a run ended, but this has now long since gone from Namco's website.", "platform": "Arcade", "release_date": "2002", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38037"}