{"name": "Panic Park", "overview": "Panic Park is an arcade game developed and published by Namco in 1997, and released on the arcade system board Namco System 23<br><br>The game has a primary mode, the \"Interactive Story\", which can be either for one or two players. There are 25 mini-games, randomly selected both for the type of game and which for the levels of difficulty (Easy, Normal or Hard), and all respectively, with different time limits, lives and scores; five of the 25 mini-games are solely the final stage in Solo Play, but can be any stage in VS Play. In the game, officially, there are seven rounds (in the Solo Play) and five rounds (in the VS Play), and the objective of the game is to successfully complete all the rounds in order to win the trophy at the end, and also the completion of the game. In the VS Play mode, the winner is determined by whoever wins more rounds than the other. The mini-games classified for levels are:<br><br>Rocket Panic, for the levels 1, 6 and 11;<br>Electric Panic, for the levels 2, 7 and 12;<br>Hammer Panic, for the levels 3, 8 and 13;<br>Space Panic, for the levels 4, 9 and 14;<br>Jumping Panic, for the levels 5, 10 and 15.<br>The other mini-games are instead: Volcano Panic, Cactus Panic, Missile Panic, Wall Panic, Buffalo Panic, UFO Panic, Chicken Panic, Mole Panic, Bridge Panic, Shark Panic, Chick Panic (similar to \"Buffalo Panic\"), Money Panic, Balloon Panic, Ice Panic, Vase Panic, Conveyor Panic, Ring Panic, Superball Panic, Fire Panic, and Bomb Panic.<br><br>In addition, the game has a special mode called \"Panic King\", for one player only. In it, the player can set a high score, by attempting to beat the old record of the players who previously played the mode. Compared to the \"Interactive Story\", the level of difficulty of the mini-games in this mode is much higher, and for the player has only chances for the player to try again; also the same mini-games (always in this mode) vary from month to month subdividing, in turn, depending on the month into six official games. They are:<br><br>Shark Panic in January and July;<br>Buffalo Panic in February and August;<br>Missile Panic in March and September;<br>Jumping Panic in April and October;<br>Mole Panic in May and November;<br>Fire Panic in June and December.", "platform": "Arcade", "release_date": "1998", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38034"}