{"name": "Panzer Attack", "overview": "Panzer Attack, Midway, 11/74, #586. This is a pretty neat projection style gun game. It uses a Sylvania DFF 120v 150w bulb through two lenses and a plastic film to project WW2 tank scenes, through several mirrors, to a projection screen. The film is mounted between two pieces of glass (so it doesn't melt), and is on a very slow motorized rotisserie type device with a metal plate. The metal plate has holes in it that line up with the tanks and aircraft on the film. When a single contact hits the hole, a relay is de-energized, and this allows the player to score that \"hit\".<br><br>Speaking of which, there are two styles of hits in this game. A \"canon\" and a \"machine gun.\" The canon is worth 20 points, the machine gun is worth 10 points. There are two motor for these, one for each weapon. There's also two more projection bulbs. Press the machine gun button, and the bulb comes on, projects through a black (with clear stripes) motorized film, and then through another static film, to give the illusion of machine gun fire. The canon works the same way, but the motorized film has less clear stripes and the static film has a different design (to give the illusion of cannon fire.) The game is timed, so it's unlimited fire for the time duration (default of 60 \"seconds\"). There is an extended play feature too at different point values.<br><br>There is electronic sound too. Basically three sounds: motorized tank noise, machine gun noise, and canon fire noise. This is accomplished through sound cards on the back door of the game. Note the front glass to the game is plastic because it is cut out and drilled to accomodate the tank sighting sculpture mounted to the score glass.", "platform": "Arcade", "release_date": "", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154635"}