{"name": "Pirate Ship", "overview": "The player is the pirate captain of his ship raiding across the sea. Collect pieces of eight and gold dubloons while avoiding collisions of various enemies and obstacles in a quest for the key to Treasure Island.<br><br>This video redemption game has a wooden ship's wheel which can steer the ship left and right.<br>At the beginning of the game, the player can select one of three stages: The South Isles, Atlantis or The Sea Of The Dead. When the player has made it to the end of one of those stages, the game ends.<br><br>Tickets are won from the game depending on the score during the gameplay and the \"X\" number from one of the three treasure chests at the end of the stage.<br><br>After one of three stages has been selected, the player must steer the pirate ship while sailing across the sea. The ship must pick up coins worth 1, 5, 10, 25, 50 or even 100 points to score. The player needs 2000 points or more in order to get the key for Treasure Island at the end of the stage. Pick up the coins along the sea, try to catch the coins that fly, and claim treasure chests that may have coins in them.<br>Try not to collide with any sharks, whales, octopuses, rocks, islands, enemy ships or any other obstacles, otherwise you will lose some of your coins and points will be deducted from your score. Also, try to avoid cannonballs fired from enemy ships and do not claim the treasure chests that have skulls or bombs in them.<br><br>When you have made it to the end of the stage, if you have under 2000 points, you won't be able to get into Treasure Island. If you have 2000 points or more, you will have the key to open up and get into Treasure Island. Before your ship goes to the main vault, however, you can choose one of three treasure chests that will either have \"X1\", \"X2\", or \"X10\" in it.", "platform": "Arcade", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Casino", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=HMCoGgCXK3A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106792"}