{"name": "Poly-Play", "overview": "Poly-Play is the only arcade machine created in East Germany. It is a collection of eight different games.<br>Hirschjagd (Deer Hunt): the player controls a hunter whose goal is to hunt deer. The screen contains a number of trees that hunter and deer can not move through. The hunter has 10 shots in his gun, but ammunition is not subtracted if the shot is a hit. Shots are also removed if a short timer has finished counting down. While the deer can leave the border of the screen and reappear on the other side, the hunter does not have that ability. The game ends when he is out of shots. Successful hits count towards the score.<br>Hase und Wolf (Hare and Wolf): a Pac-Man variant. The player controls a hare and must eat all peas and carrots within a labyrinth while being pursued by a wolf. Eating a pea gains 1 point, eating a carrot 5, and eating a randomly appearing pear gains 7 points. Hare and wolf can use tunnels that allow them to leave the screen on one side and reappear on the other. Being caught by the wolf or running out of time removes one of three lives. Once a labyrinth is successfully completed, the game begins again with higher difficulty: the number of wolves raises from one to three and the game speed increases.<br>Abfahrtslauf (Downhill): the player controls a skier who must move downhill between a number of flags towards the goal line. The game consist of six rounds, with consecutively decreasing space between the flags. Moving in a straight line greatly accelerates the skier, making him difficult to control, while turning allows more control at the expense of speed. Score is influenced by time and the space between the flags.<br>Schmetterlinge (Butterflies): a mole moves across a flowered meadow and must catch butterflies with his net. The flowers act as obstacles and often draw the butterflies towards them. Different types of butterflies award a different amount of points. The game ends after a time limit.<br>Schießbude (Shooting Gallery): a Carnival variant. The player moves a gun at the bottom of the screen and shoots at targets (flowers, balloons and ducks, with different point scores) moving in three rows at the top. Hitting objects in the top rows gain more points. Ammunition is limited but can be refilled by hitting a magazine at the left side of the screen, but only if a plus sign is displayed. Hitting the magazine while the minus sign is displayed removes ammunition. Another way to lose ammo is through ducks: if a duck reaches the center of the middle row, it starts to fly towards the player's gun. If it isn't hit quickly, it devours some bullets.<br>Autorennen (Motor Race): a race against an AI-controlled car, consisting of two races of four laps each. There is only one track, but the layout slightly changes during the race. Hitting the border of the track slows the car down. Scores are given depending on lap times, with the score doubling if the race is won.<br>Merkspiel (Memory Game): a sequence of colored shapes (each of which also has a corresponding tone) is displayed for a short time. The player must recreate the displayed sequence from memory. Only three symbols are shown at the start, to which one additional symbol is added after each successful guess. The game ends after a time limit. Lost time can be regained through a successful guess.<br>Wasserrohrbruch (Water Pipe Burst): a water pipe has burst in the room above and water now drips into the cellar. The goal of the player is to collect water drops into a bucket and empty it out of the cellar window. Catching drops and emptying the bucket gains points. The player gets two chances at saving the cellar - the game ends after the water level has risen to 100% twice.", "platform": "Arcade", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "VEB Polytechnik Karl-Marx-Stadt", "publishers": "VEB Polytechnik Karl-Marx-Stadt", "genres": "", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38199"}