{"name": "pop'n music: Sunny Park", "overview": "Pop'n Music (ポップンミュージック, Poppun Myūjikku), commonly abbreviated as Pop'n, PM or PNM and stylized as pop'n music, is a music video game series in the Bemani series made by Konami. The games are known for their bright colors, upbeat songs, and cute cartoon character graphics. Originally released in 1998, the series has had over fifteen home releases in Japan as well as many arcade versions.<br><br>Unlike most of Konami's Bemani series, the Pop'n Music interface is not designed to represent any actual musical instrument. Instead, it uses nine buttons, each three-and-a-half-inches in diameter, laid out in two rows (Since the location test of Wonderland, a multitouch panel is added). Five buttons are the bottom row, the other four being the top. Like in most Bemani games, color-coded notes (in this game called \"Pop-kun\" (ポップ君) and anthropomorphized with faces) fall from the top of the screen in nine columns that correspond to the buttons. When a note reaches the red line at the bottom of the screen, the player presses the button or tap the panel, which triggers a sound within the song.<br><br>When a note is played, an accuracy rating is displayed, either \"Great\", \"Good\", or \"Bad\". The maximum number of points possible in any single-stage song is 100,000, and unlike beatmania or beatmania IIDX, can not be exceeded as no additional score bonuses are given. A \"Combo\" tally is kept of properly played notes like in other Bemani games, but always excludes the first note played; for example, if a song has 322 notes, the maximum combo will be 321. Until Pop'n Music 6, \"Good\" notes would interrupt a player's combo.<br><br>Each song is represented by a character, and players are represented by characters too. The player can choose a character by pressing both yellow buttons on the mode selection screen, but as of Pop'n Music 19 TUNE STREET, the character selection screen automatically pops up after choosing a mode. The default player characters are anthropomorphic rabbit Mimi and anthropomorphic cat Nyami.", "platform": "Arcade", "release_date": "December 5, 2012", "game_type": "Released", "esrb": "Not Rated", "developers": "Bemani", "publishers": "Konami", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=SVYF-_MegVU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154920"}