{"name": "Pop'n Music 4", "overview": "Pop'n Music 4 (ポップンミュージック 4 Poppun Myūjikku 4?) is a Japanese music/rhythm video developed by Konami and Bemani in 2000, and the fourth release of the Pop'n Music series.<br>First Pop'n Music game to run on BEMANI FIREBEAT HARDWARE, which was also used for Beatmania III, KEYBOARDMANIA, and ee'MALL. The colors and graphics were noticeably more colorful and more detailed than ever as a result of the more powerful hardware. Firebeat would be used through Pop'n Music 8.<br>First Pop'n Music game in the series to have speed modifiers. However, the only one is 2X.<br>First Pop'n Music arcade game in which new AC songs have HYPER notecharts.<br>This is the first game that has to tell you what the BPM of a song was.<br>First Pop'n Music game in the series to have a distinctive interface (1-3 were essentially the same interface with color differences). In addition, all the menus feature new music re-arranged by Seiya Murai.<br>This is the only pop'n music game without an individual song, MISS, and FEVER backgrounds. Instead, several backdrops are seen in the background for songs.<br>Tatsuya Furukawa (good-cool) and Seiya Murai (V.C.O., Kiyommy+Seiya, natural bear, etc.) make their pop'n music debuts.<br>Hiroki Koga (Naya~n) starts writing his own music for the series.<br>Pop'n Music 4 is the only game to have two individual CDs for one installment. The first CD, Pop'n Music 4 arcade originals, contains all the AC songs, plus jingles and three new long versions. The follow-up CD, Pop'n Music 4 consumer originals, contains all the pop'n music 4 AC songs (except GROOVE ROCK), but axes the jingles and long versions for the 4 CS songs and new long versions of those songs.<br>This is the only Pop'n Music arcade game where NONE of the AC songs have ever gotten HYPER charts in Battle Mode.", "platform": "Arcade", "release_date": "2000", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38212"}