{"name": "Pop'n Music 5", "overview": "pop'n music 5 was the last one to have a weird fascination for naked women in the ranking screens. It was not the last one to insert random proverbs wherever possible, though. Oh, it also introduced EX charts, but very few songs had them, and they could only be played in the also new Extra Stage.<br>First pop'n music game with Internet Ranking and CHALLENGE MODE.<br>Unlike NORMAL MODE, CHALLENGE MODE has no stage limit, and you can play any three songs you wish.<br>You can still only play the same song once a credit, though.<br>First mainline arcade pop'n music game with 5LINE. The mode had earlier appeared in pop'n music アニメロ and in the CS games.<br>First pop'n music game to let you set mods before each song.<br>First pop'n music arcade game since the the original with no new CS crossovers in the songlist.<br>First pop'n music game with EXtra STAGE, which introduced a new difficulty level: EX.<br>EX charts can only be played in EXtra STAGE in pop'n music 5, hence the difficulty's name.<br>Characters can now have distinct LOSE animations. Previous games recycled a character's MISS animation for their LOSE animations.<br>First (and only) arcade pop'n music game with FREE MODE 2, which keeps track of the number of GREATs, GOODs, and BADs you have. (pop'n music 7 onward, however, shows these stats in almost every mode.) You can only play two songs, but you can play the same song twice, a first in the series.<br>All songs prior to pop'n music 4 have been removed due to memory limitations. Every pop'n music arcade game through pop'n music 8 would continue to only have the current songlist and the previous game's. (Except in the case of licenses and songs in courses.) When pop'n music 9 came out and the series switched to Python 1 hardware, near all of the previously removed songs would be revived.<br>All pop'n music 4 songs received new song backgrounds (though a few songs used backdrops from 4 for their backgrounds), as well as their own MISS and FEVER! artwork.<br>Takayuki Ishikawa (dj TAKA) makes his pop'n music debut, as does Shunsuke Kida.<br>In addition Osamu Migitera starts writing his own music for the series, and CG designer shio becomes a permanent staff member.<br>Last pop'n music game with the old music select screen of rival characters on the right side, and genres in Japanese on the far left through a menu.<br>Last pop'n music game to feature the original GAME OVER screen that had been used since the very first game.<br>Total songs: 54", "platform": "Arcade", "release_date": "2000", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38213"}