{"name": "Psychic Force EX", "overview": "Psychic Force (サイキックフォース Saikikku Fōsu) is a 1995 fighting arcade game created by Taito which was later ported to the PlayStation in 1996 and 1997. The PlayStation version was released by Acclaim in North America, and in PAL regions. The game was a 3D fighter which had combined the normal features of an arcade fighting game with psychic powers. There were eight playable characters available to choose from in the game and a final boss/secret character who is playable through the use of a code. Psychic Force was released without much hype and was not commercially successful at the time of its initial release, but the series has since gained a strong cult fanbase. Psychic Force would later get an arcade-exclusive update titled Psychic Force EX, which was released a year later in 1996. EX would make Keith, the final boss/secret character of the original game a playable character without having to initiate a code and that the characters would receive new color schemes for their costumes while the gameplay was improved and balanced. In 1998, a sequel was released under the title Psychic Force 2012 also for the arcade, and was later ported to the Dreamcast console in 1999. It was eventually adapted to the PlayStation under the title Psychic Force 2, which was released in Japan on October 7, 1999 and later to the PAL regions in 2001.<br>In 2006, the original Psychic Force was re-released as part of as an anniversary pack for the PlayStation 2 titled Psychic Force Complete, which had included Psychic Force 2012 and a special exclusive remixed version of 2012 titled Psychic Force 2012 EX.", "platform": "Arcade", "release_date": "", "game_type": "", "esrb": "Not Rated", "developers": "Taito", "publishers": "Taito", "genres": "Fighting", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/83164"}