{"name": "Psychic Force", "overview": "Psychic Force (サイキックフォース Saikikku Fōsu) is a 1995 fighting arcade game created by Taito which was later ported to the PlayStation in 1996 and 1997. The PlayStation version was released by Acclaim in North America, and in PAL regions. The game was a 3D fighter which had combined the normal features of an arcade fighting game with psychic powers. There were eight playable characters available to choose from in the game and a final boss/secret character who is playable through the use of a code. Psychic Force was released without much hype and was not commercially successful at the time of its initial release, but the series has since gained a strong cult fanbase. Psychic Force would later get an arcade-exclusive update titled Psychic Force EX, which was released a year later in 1996. EX would make Keith, the final boss/secret character of the original game a playable character without having to initiate a code and that the characters would receive new color schemes for their costumes while the gameplay was improved and balanced. In 1998, a sequel was released under the title Psychic Force 2012 also for the arcade, and was later ported to the Dreamcast console in 1999. It was eventually adapted to the PlayStation under the title Psychic Force 2, which was released in Japan on October 7, 1999 and later to the PAL regions in 2001.<br>In 2006, the original Psychic Force was re-released as part of as an anniversary pack for the PlayStation 2 titled Psychic Force Complete, which had included Psychic Force 2012 and a special exclusive remixed version of 2012 titled Psychic Force 2012 EX.<br><br>All combat in Psychic Force takes place in a cubic space defined by a magical force field. The fighters float inside this space and are capable of movement in all directions. Even though Psychic Force is structured as a 3D game, the gameplay is in 2D.<br>The walls of the force field play a big part in the strategy behind Psychic Force. A character takes damage when they're forced into a wall by their opponent. The character do not take damage, however, if they move into the wall themselves. If a character takes another hit as they bounce off from the wall, the character will become stunned and fall through the air. The character is eventually invulnerable while they're falling.<br>As in most fighting games, the first character to win two rounds wins the match. However, you cannot win a round on time. i.e., if time runs out, neither player wins. Instead, you go to a sudden death round in which the space is much smaller and both characters have 0% Psycho Gauge. The first person to land an attack wins. When you are fighting the computer, however, the character with more health remaining at the end of the round wins.<br>The characters are controlled with an eight directional joystick and three buttons which dictate a guard, a light attack, and a heavy attack (On the ported PlayStation version these commands were given to the square, triangle and circle buttons). By combining these different commands, the player can make combo attacks, throws, and special moves which can break the enemy's defenses.<br>A character's special move is determined by the Psycho Gauge, which is seen under the Life Gauge of the character. Depending on the type of special move initiated, the Psycho Gauge will immediately drain from within sight and once the character uses up their entire Psycho Gauge, they'll be left with the only option to unleash continuous weak projectiles until the Psycho Gauge is charged back up, either through an automatic slow charge or a manual fast charge in which the player can press all three buttons to help re-charge their Psycho Gauge.<br>Other tactics seen from within Psychic Force includes a Barrier Guard, which can be used to help protect a character from both physical attacks and special moves but drains the Psycho Gauge real quickly, an Evasion Barrier, in which the character can immediately put up a force field and avoid slamming against the wall even though it uses up 40% of the Psycho Gauge, a Normal Dash which enables a character to move real quickly in any direction from within sight, and a Quick Dash which enables a character to move real fast towards their opponent while being able to deflect any weak projectile that gets in their way.<br>In both the original arcade version and home console Story Mode of Psychic Force, the player's character would go through eight stages of combat from within sight against a specific set of opponents and that they would face off against a specific final boss from within the eighth and final stage which would vary and depend from within the specific playing character's story. The home console Story Mode would add additional cut-scenes in order to advance the story of the specific playing character and an ending would be presented once the player is able to beat the game with the specific playing character.", "platform": "Arcade", "release_date": "1995", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "3.4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38297"}