{"name": "Pump It Up 2013 Fiesta 2", "overview": "Pump It Up (Korean: 펌프 잇 업; RR: Peompeu it eop) is a music video game series developed and published by Andamiro, a Korean arcade game producer. The game is similar to Dance Dance Revolution, except that it has five arrow panels as opposed to four, and is typically played on a dance pad with five arrow panels: the top-left, top-right, bottom-left, bottom-right, and a center. Additional gameplay modes may utilize two five-panel pads side-by-side. These panels are pressed using the player's feet, in response to arrows that appear on the screen in front of the player. The arrows are synchronized to the general rhythm or beat of a chosen song, and success is dependent on the player's ability to time and position his or her steps accordingly.<br><br>Typically a game of Pump It Up starts by displaying a screen asking if the player is playing alone giving time for a second player to join in. This waiting time may be sped up by tapping the center gold arrow (used as a submit button). Players may insert a USB flash drive containing an access code or tap an A.M. pass card which you can on the game center's counter where the P.I.U. cabinet is installed.<br><br>If there are no USB flash drives or A.M. pass card logged in, the game will default to Basic/Easy mode on more recent games. Games started with a PumBi drive inserted will default to Arcade mode. Players may input the \"All songs\" code to access this mode without a PumBi drive by tapping down left, up left, center, up right, down right, quickly with their feet. Games prior to Pump it up Zero show the player a \"Station Select\" screen to allow the player to select their difficulty. Station select can be accessed in all games by tapping the upper right or left arrows and allows for alternate game modes on later games.<br><br>Once a player has selected their game mode they are presented a list of songs. To switch between songs the player steps on the rear right and left arrows on the pad. Various statistics such as the song speed in BPM, song artist and song difficulty will be displayed. Waiting with the cursor on the song will play a sample of the song and may display example background video from that song. To select a song the players must press the central yellow arrow. Games after Pump It Up Zero allow the player to select difficulty at this time. To select difficulty they may tap the rear arrows. To go back to the main menu the player taps the upper corner arrows. To begin the song the player taps the yellow arrow a second time.<br><br>The core gameplay involves the player moving his or her feet to a set pattern, stepping in time to the general rhythm or beat of a song. During normal gameplay arrows scroll upwards from the bottom of the screen and pass over stationary arrows near the top (referred to as the \"guide arrows\" or \"receptors\"). When the scrolling arrows overlap the stationary ones, the player must step on the corresponding arrows on the dance platform. Players receive a judgement for each step based on the accuracy of the step. Judgements include, from best to worst, Superb, Perfect, Great, Good, Bad and Miss. The timing window of these judgements vary from version to version and can depend on the difficulty of the machine set by the machine operator.<br><br>Regular arrows come on the full beat, half beat, quarter beat or sixteenth beat depending on the song's steps. Longer arrows referred to as \"holds\" must be held down for their entire length with them adding additional Perfects to the combo. In addition holds can be held on to before the hold passes through without penalty.<br><br>Successfully hitting the arrows in time with the music fills a life bar, while failure to do so drains it. If the bar is fully depleted during gameplay with Stage Break mode turned on the player fails the song usually resulting in a game over. If Stage Break is off, players only fail the song (and cause play to stop) by getting a combo of 51 consecutive misses. If the player completes the song without draining the life bar or missing too much the player is taken to the Results Screen which rates the player's performance with a letter grade and a numerical score among other statistics.<br><br>After completing a song the player may be given a chance to play again depending on the settings of the particular machine. The number of songs in a credit is 3 songs + bonus on all versions other than Extra Mix and NX2. Extra allows changing the game to 2+1 while NX2 is 2+1 by default on Arcade Station (3 songs in all other Stations). If the player gets an A ranking or better on all songs in a game, the player earns a \"bonus stage\". Later games display how many A or S grades a player has gained that game on the select screen via a life bar featuring hearts. Getting any score other than an A ranking or higher will lower the number of hearts. If the player passes a song with a D rank or lower but does not fail then the player's song set will be reduced to just two songs.", "platform": "Arcade", "release_date": "November 24, 2012", "game_type": "Released", "esrb": "", "developers": "Andamiro", "publishers": "Andamiro", "genres": "Music", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=06idr59iSx0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154922"}