{"name": "Punch-Out!!", "overview": "Punch-Out!! was produced by Nintendo in 1984.<br><br>A first-person perspective boxing game where you fight six boxers in the WVBA. The player character is a green wire frame model who must defeat all the opponents to become the champion. The commentator says \"Body blow!\", \"Stick and move!\" and \"Great fighting! You're an up and coming boxer!\"<br><br>The top monitor is used for statistics while the bottom is used to display the game. The game has two speakers, one wired to each monitor. One speaker is used for the commentator, the other for the crowd noise and music.<br>The World Video Boxing Association boxers are fought in the following order:<br><br>Glass Joe<br>Piston Hurricane<br>Bald Bull<br>Kid Quick<br>Pizza Pasta<br>Mr. Sandman<br><br>The object of the game is to beat up your opponents.<br>Glass Joe basically stands around waiting to lose. No real strategy there.<br>For Piston Hurricane, stick with body blows, and wait for that charge. If you miss the knockdown, block up, then down, etc, until he stops.<br>Bald Bull will charge at you as well, but is easier to knock down than Piston Hurricane.<br>For Kid Quick, set him up with a right to the head. He'll counter, then dodge and hit him with three left jabs. Repeat until you knock him out.<br>Pizza Pasta will grab you -- dodge right then pummel his head until he's down -- he won't fight back.<br>Mr. Sandman is fast, but very predictable. Just dodge and counter and you'll be fine.<br>After winning the belt, the fighters are more difficult, and Kid Quick doesn't appear at all ditto for Pizza Pasta after his second appearance. The biggest hurdle to overcome is Piston Hurricane he will run down the clock. For Mr. Sandman, Bald Bull and Glass Joe, don't lead with the left since they will jump around it and nail you every time.", "platform": "Arcade", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Sports", "max_players": "1", "cooperative": "No", "rating": "3.62", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=C_JluY5XKck", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8487"}