{"name": "Puzzle King", "overview": "Puzzle King is a compilation arcade game that was released by K1 Soft and HAN System, in 2002; it runs on the same hardware used by Toaplan for Snow Bros.: Nick and Tom in 1990, but increases its Motorola 68000 to 16 MHz, decreases its Zilog Z80 to 4 MHz and utilises a Yamaha YM-2151 and an OKI MSM-6295 for audio instead of a Yamaha YM-3812. Three of its four titles were initially released by other Korean manufacturers under different names, and one is that aforementioned \"Snow Bros.\".<br><br>Games in this compilation:<br><br> -- Pac-Man 2 (1995): Initially released under the name of \"Hyper Pac-Man\", by SemiCom, this is the second compilation that this unofficial title for Namco's Pac-Man series has been featured in (as it was previously in SemiCom's own XESS: The New Revolution).<br><br> -- Tetris (2002): This variation on Alexei Pazhitnov's \"Soviet puzzle game\" was never released as a standalone game, but features new characters including a chicken called \"Cocki-U\" and a farmer.<br><br> -- Hyper Man 2 (1997): Originally released under the title of \"New Hyper Man\" by SemiCom in their aforementioned \"XESS\", this is (again) the second compilation that this unofficial title for the Pac-Man series, in which the Pac-Mans stop moving if the joysticks are let go of, has been featured in.<br><br> -- Snow (1990): Originally released under the name of \"Snow Bros.: Nick and Tom\" by Toaplan, this single-screen platform game now has new audio; it's also worth noting that the ending sequences of all three of the previously released games were removed for this compilation and replaced with a generic screen featuring a grinning clown holding a piece of paper with \"THE END\" written on it.", "platform": "Arcade", "release_date": "2002", "game_type": "Released", "esrb": "Not Rated", "developers": "K1 Soft", "publishers": "HAN System", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.19", "wikipedia": "", "video_link": "https://youtu.be/Jzsuir-d5x4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38341"}