{"name": "RayCrisis", "overview": "RayCrisis, known as RayCrisis: Series Termination in North America, is the third game released in the \"Ray\" series of Taito shooting games. Chronologically, it is considered a prequel to the first game, RayForce. First released for arcades in 1998, it supported co-op mode for two players, which the PlayStation ports released in 2000 lack; these ports are the only games in the \"Ray\" series to lack co-op.<br><br>RayCrisis, being a prequel to RayForce, details the events during the timeframe of the supercomputer called the Neuro-Computer Con-Human gaining sentience and rebelling against its human creators, a direct result of a misguided scientist trying to bond a human clone to Con-Human mentally. Now, against Con-Human's massive attack forces laying siege to the Earth, exterminating and cloning humans, a mecha-neurologist jacks in to the Con-Human system in an attempt to regain control of the rogue machine by means of the computer viruses, known as the Waveriders, into the Cybernetics Link, engaging Operation Raycrisis to cease the supercomputer's destructive actions permanently and prevent it from causing more havoc in the future.<br><br>However, even when Operation Raycrisis leaves Con-Human wrecked from the inside, it was too late to reverse the damage it has done. Furthermore, what is left of the human race has left for the space colonies as refuge from the destruction. In the end, years later, with the unveiling of the X-LAY starfighter and the ships of the fleet, Terran Command and the remaining humans initiate one final assault on Con-Human, who has turned the Earth into a bleak, metal graveyard. One final assault, in which will end the cybernetic nightmare once and for all, destroying the planet they've called home in the process. And that assault will be called:<br><br>Operation RayForce.<br><br>The gameplay of RayCrisis is based on RayForce, which features a viewpoint given to the player with an overhead perspective. The game is a vertically scrolling shooter with a \"virus infiltration\" theme: the player plays the role of the Waverider computer virus, and the enemies he or she encounters are Con-Human's antibodies, programmed to terminate any virus—including the player—getting inside the supercomputer's system.<br><br>An Encroachment system is added, which causes player to lose points when it reaches 100%, especially facing Dis-Human and Infinity prematurely when reaching a huge Antibody, in addition to a bad ending. Encroachment percentage can be lowered by deleting Antibodies, terminating huge Antibodies or obtaining items, keeping a low profile not to be recognized by Con-Human.<br><br>The game starts with Self-Area, followed by 3 other stages out of the following: Emotion, Consciousness, Intelligence, Memory, or Consideration, each reflecting Con-Human's details of sentience. After completing stage 4, having the emergency control activated by Con-Human because of the havoc the player have caused, the Waverider computer virus must fight against the Dis-Human Antibody, and Infinity, Con-Human's heart.<br><br>The player is given three ships called Waveriders to choose from at the start of the game:<br><br>WR-01 - a ship resembling the R-Gray 1 from RayStorm in terms of firepower. It features a wide laser attack and can lock onto 8 targets at a time.<br>WR-02 - a ship resembling the R-Gray 2 from RayStorm. Uses a narrow-angled focused laser for its main gun and it has a max capacity of 16 lock-ons available to the player and uses a weapon called the \"thunder laser\".<br>WR-03 - a brand new design. Removes the lock-on feature and forces the player to use a powerful photon chain gun. Its primary weapons are small guided missiles that swarms the enemies but is weak in terms of hitting power. In the original arcade version, this craft must be unlocked.<br>Additionally, the two original ships from RayStorm (R-Gray 1 and R-Gray 2) can be unlocked on the PlayStation version.", "platform": "Arcade", "release_date": "1998", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "4.39", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38488"}