{"name": "Relief Pitcher", "overview": "Relief Pitcher was produced by Atari Games in 1992.<br><br>Baseball game with play-by-play announcer, and option of playing a standard baseball game or playing as a relief pitcher through a series of games. Doesn't use real teams or players but allows operator to choose up to 4 cities for players to select from. Keeps detailed statistics.<br><br>Each player can select the throwing arm, throwing motion overhand or sidearm, and special pitch sinker, etc. for their pitcher. The three-button control allows each pitch to be a fastball, curveball, or special pitch and the joystick controls the location and movement. The batter can choose a standard swing, power swing, or bunt with the buttons. The player can choose to play a normal baseball game from start to finish or play as a relief pitcher, and finish up computer generated games starting in the 8th or 9th inning of each.<br><br>The game offers an \"All-Star\" game after you make six relief appearances.<br>SOUND: The announcer calls the plays as they happen. Curiously, when creating your pitcher, one of the special pitches you can choose from is a \"Rising Fastball\". Even an overhand pitcher can throw this pitch in a game. In reality, though, you can't throw a rising fastball, it is physically impossible.<br><br>The announcer is St. Louis Cardinals' broadcaster Jack Buck, and his likeness is even digitized.<br>Diehard Atari fans might recognize the names of some of the batters. Several batters are named after Atari employees, including the legendary Ed Rotberg.<br><br>While the game does not have an official Major League license, the ballparks for the four teams in the game are based on actual ballparks in Boston, Chicago, Houston, and Los Angeles. A setting in test mode allows up to 32 different cities to be used for the teams, but the ballparks remain the same.", "platform": "Arcade", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari", "publishers": "Atari", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "3.45", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=DnXfLFKGA8s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23542"}