{"name": "Rezon", "overview": "Rezon (レゾン) is a 1991 horizontal scrolling shoot 'em up arcade game developed and published by Allumer. It is the first game to actually display the Allumer name, as well as the first game to be self-published, though a Taito-branded release exists.[1] It is modeled after Irem's 1987 arcade hit R-Type, with its own twist in the \"Arms\" system.<br><br>Rezon is unusual in that it has an exceptionally poor soundtrack,[2] yet no other aspect of development was sacrificed. Blandia is a similar game, also by this developer; unlike that game, Rezon was never ported to any platform, so it never received a soundtrack upgrade like Blandia did.<br><br>Taking place in the year 2191, the player pilots a recently developed space fighter, the SR-91, through six stages to defend the Earth from a two-year-long alien invasion. The SR-91 uses the VAWS (Variable Armor and Weapon System) which uses the Optica Weapon Arms. The Arms shield the ship from top and bottom attacks, provides back-up fire and using its Arm System can be positioned to fire in various angles depending on the current weapon. Overall, this system functions somewhat like the tentacle equipment in X Multiply, another Irem game with ties to R-Type. The SR-91 uses one of three different pick-up weapons: the red \"Taikuu Laser\", thin red beams that fire straight forward; the yellow \"Ring Laser\", yellow rings which can be aimed in all directions and provide good coverage; and the blue \"Hansha Ball\", blue spheres that can be also aimed in all directions and bounce off the walls. The only other pick-up items are Speed Ups and Speed Downs. Extends are set at the first 70,000 points and was added with every 80,000.", "platform": "Arcade", "release_date": "1991", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "3.19", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38555"}