{"name": "Ring Riders", "overview": "Ring Riders is a 3D motorcycle racing game set in a theme park. The game contains several courses with up to four racers on the track. Points are scored by riding through giant rings, doing acrobatics and the finishing position. Rings have different colours (red, yellow and green) with different points. The focus is however on the time as a 5,000 points need to be scored within the time limit to extend the time and continue racing. The game offers 20 characters to choose from. They have different characteristics based on power, weight and speed. There are two circuits: Hurricane Ride and Seaquake Ride. Both circuits can be played with different weather conditions, which determines the difficulty level (Easy, Medium, Advanced) along with different surfaces such as mud, rain, sand, snow and water. There are five bikes available with different characteristics.<br><br>The game is played on a dedicated cabinet shaped like a real motorcycle on a platform with a seat for the rider and additional passenger. There is an interactive handlebar with an accelerator grip (right) and a brake lever (left). Twisting the handlebars while racing is also used to perform stunts. Big jumps are achieved by using full throttle at the right moment. On the fuel tank in front of the player are a start button, a view button to change the perspective and an emergency stop button. There is also a footrest with a safety stop system. Up to four cabinets can be linked up for local multiplayer games. The game uses a geared induction motor that provides a motion system with two degrees of freedom. The player can move the bike up and down. There is also vibration based on the surface type.", "platform": "Arcade", "release_date": "", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114355"}