{"name": "Sega Rally Championship: DX", "overview": "Sega Rally 2 is the 1998 sequel to Sega's hit arcade game, Sega Rally. This game, like it's predecessor, is based on Rally racing. Rally racing is unique in that races take place on both race tracks and off-road courses. The courses in this game reflect this nicely. Some take place in the desert or forest, others take place in cities. The cars in this game are all actual rally cars, with manufacturers from Europe and Japan both well represented. You do not get to see very many of them at one time, however, since rally races are typically time-based events. In this game, you are not competing directly against the other cars, you simply have to have the best time through the course. So, during any race you will usually see a handful of other cars on the track.<br><br>The game was produced in three cabinet versions: <br>1) upright cabinet with 2 player alternating play.  This unit does not have multiplayer network ability.  <br><br>2) Deluxe (DX) version with a sit-down cabinet, an additional handbrake for hairpin turns, and a 50-inch projection screen display. The first released DX has slower cars and different paint on the Toyota and Ford, is a little less polished in graphical terms than the later twin version. The DX has ability for multiplayer network play for up to 4.  <br><br>3) Twin version with dual sit-down cabinet, handbrake feature, two 29-inch CRTs and some minor improvements to gameplay, features, and sound beyond those of the upright and DX. The twin can display the www.segarally.com text, the DX does not even have the option, but has a nicer motif on the Ford Escort (white/orange).  The Twin has ability for multiplayer network play for up to 4.", "platform": "Arcade", "release_date": "1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Sega AM5 R&D Division", "publishers": "Sega Enterprises Ltd.", "genres": "Racing", "max_players": "4", "cooperative": "Yes", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KgZDQ1jEXQs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38772"}