{"name": "Shanghai III", "overview": "Shanghai III (not to be confused with some ports of Shanghai II: Dragon's Eye with \"Shanghai III\" in the title) is a mahjong solitaire game developed by Success and released by SUNSOFT (under license from Activision) for arcades in Japan on November 1993, with an overseas release sometime after.<br><br>The third in the studio's arcade ports of the Shanghai series (after Shanghai II), Shanghai III features a new progression system, allowing players to tackle a new set of 12 puzzle configurations in any order they choose. It also revamps the power-up system, adding two additional ones (one for peeking under tiles and one for adding time to the timer) while adding a bonus mini-game between rounds to earn them (resembling a game of concentration).<br><br>In addition to the standard two-player mode (which no longer has mid-game joining), the game also introduces a new two-player versus mode known as \"2-Player Taisen\". In this mode, each player has control of a separate (but equal) set of smaller configurations and must race to uncover and tap the \"golden tile\" hidden at the bottom.<br><br>While all 12 puzzles in the main mode are based on the Chinese zodiac, they are all unrelated to the similarly-themed puzzles in Shanghai II: Dragon's Eye.<br><br>The game was later ported to the Super Famicom by Kuusoukagaku in Japan on September 15, 1994. Released by SUNSOFT, this version supports the Super Famicom Mouse peripheral (with multiplayer mouse support). The original arcade version was also digitally re-released as part of HAMSTER'S Arcade Archives series, once for the PlayStation 4 (in Japan on July 3, 2015 and in North America on November 24, 2015) and once for the Nintendo Switch (worldwide on December 31, 2020).", "platform": "Arcade", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Success", "publishers": "Sun Corporation", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38821"}