{"name": "Shinobi III", "overview": "Shinobi III: Return of the Ninja Master, released in Japan as The Super Shinobi II (ザ・スーパー忍II Za Sūpā Shinobu II), is an action game developed and published by Sega for the Mega Drive/Genesis console that was released in 1993. It is the direct sequel to the previous The Revenge of Shinobi. The game was originally intended to be released in 1992, and to be very different from the final version of the game in terms of levels and storyline.<br><br>Shinobi III was included on the Sega Genesis Collection for the PlayStation 2 and PlayStation Portable and Sonic's Ultimate Genesis Collection for the Xbox 360 and PlayStation 3. It was also released for the Wii's Virtual Console service in 2007, for the PC on the download service Steam in 2010, on the iPhone in 2011[4] and for the Nintendo 3DS eShop in 2013.<br><br>Compared to its predecessor, the action is considerably smoother, with less emphasis on difficulty and more on speed. In addition to the ability to run from place to place, the player character comes equipped with a new array of moves and techniques, including a mid-air dashkick, the ability to jump-scale walls and a powerful running slash that renders him temporarily invincible.<br><br>Besides his regular assortment of moves and attacks, the player has the ability to perform four special ninjitsu techniques. Only one can be used in each level, unless the Shinobi finds additional ninjitsu bonuses throughout hidden spots in most levels. The four ninjitsu techniques involve engulfing lightning as a temporary shield, summon fire-dragons, boosting his vertical leap and self-sacrificing, the latter costing one life to destroy common enemies or damage bosses.<br><br>Neo Zeed is threatening the world once more. The evil crime syndicate - thought to have been vanquished two years earlier - has returned, headed by a man known only as the Shadow Master. Joe Musashi has felt their presence, and descends from the lonely mountaintops of Japan to face his nemesis once more. As the Shinobi, stronger than steel and faster than a whirlwind, the last keeper of the Oboro Ninjitsu techniques, only he can stop Neo Zeed.<br><br>Round 1: Zeed's Resurrection: Joe Musashi descends from his training grounds in the mountains after he learns that the syndicate Neo-Zeed has emerged with a vengeance from the criminal underworld; he battles waves of assassins and a huge mutated samurai through the forests and caves of Japan.<br>Round 2: Secret Entry: Musashi races on horseback through the meadows as a storm gathers and Neo-Zeed's assassins descend from kites to attempt their kills, including a ferociously agile ninja in orange with a large supply of spears — the Shadow Dancer. The conspiracy is revealed to be much larger and dangerous than expected as Musashi reaches a huge high-tech facility, neutralizing Neo-Zeed's machine gun-armed soldiers and encountering a levitating robot armed with bullets, bombs, lasers, and reality-warping trickery — the first brain-powered jet-piloting supercomputer's successor.<br>Round 3: Body Weapon: The facility houses a morbid biological weapons laboratory, where Musashi must fight off mutated brains and muscular ooze, descending into the sewers where he faces off against one of Neo-Zeed's most horrible weapons: the hulking and hideous Hydra.<br>Round 4: Destruction: Musashi discover a great river near his home, where Neo-Zeed has constructed a huge factory between this river specializing in robotic weaponry. He surfs across the river fighting off hordes of Neo-Zeed's Ninjas, who are riding on huge, hovering futuristic vehicles. On the river, he confronts humanoid robots armed to the teeth with lasers and machine guns.<br>Round 5: Electric Demon: Upon crossing the river, Musashi arrives at another heavily guarded weapons facility in the forest. It is as if he has descended into hell, as he fights the military guerrillas amidst a burning inferno that has engulfed the forest. Seeking justice and shelter in the facility, Musashi ascends into the top floors and confronts a hulking, fire-breathing, robotic dinosaur who resembles Mechagodzilla (perhaps as an allusion to the Godzilla battle in The Revenge of Shinobi), one working prototype of a planned army of these beasts.<br>Round 6: Traps: Musashi descends into a gorge, fighting to stay alive by killing bloodthirsty assassins and seeking a little safety while falling down toward a great canyon. After fighting a mystical humanoid hawk, Musashi discover the lair of Neo-Zeed's last echelon: a mist-shrouded pagoda. He avoids several lethal traps and twisting passages to meet his old foe, the Ninja Master.<br>Round 7: The Final Confrontation: Despite defeating the Ninja Master in a violent battle, there is one final nail to pound into the coffin of Neo-Zeed. Musashi ascends into the sky on Neo-Zeed's massive air fortress where his most formidable enemy awaits his arrival: his fighting abilities are equal to Musashi's, and his weapons wield unprecedented power. He is now the Shadow Master.", "platform": "Arcade", "release_date": "1993", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "4.64", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38840"}