{"name": "Sir Prize", "overview": "The original Sir Prize was a great British pub machine. There was another one called the Jolly Joker that was practically the same machine with different symbols.<br><br>It had a dual coin mechanism, for sixpences and tokens. Sixpences (half a shilling) tripped that gadget on the left side for two games and went to the cash box, and tokens just tripped the token relay for one and went to the hopper. This meant it could pay out up to 20 tokens for the maximum legal prize (5 shillings), allowing the traditional 18 for bells. It had a time jackpot - hitting the secret combinations pound-pound-bar or bar-bar-pound turned it on, and then the next 10 games paid out maximum coins if a single Sir Prize symbol turned up on the payline, which it did nearly every pull. Hold and Draw was controlled by the Hold relay. The switch stack on the left dropped it out in the early part of the cycle, then another contact on the stack passing through a contact on the hold bar pulled it in again towards the end, providing that none of the solenoids was pulled in. Power to the hold solenoids was interrupted by another contact on the right at the end of the cycle. (Actually I believe they are mechanically released by a cam). If the hold relay pulled in, it self-latched with one of its contacts. In the event of a winner, a contact on the Win relay opened to drop it out again. So there would be no hold after hold or hold after win.<br><br>Time jackpots were made illegal so the Sir Prize unit in the upper right part of the cabinet had to come out, and then hold was made illegal. After much industry lobbying it was allowed again so long as it was random - the player couldn't know until the coin went in whether he would be able to hold or not. That's what the small cam motor is for. An enormous number of Sir Prizes and Jolly Jokers were reworked for arcade duty with new glass, win wiring and hopper board. You were lucky to get one with original glass but I'm sure the dual coin mech and the Sir Prize unit are unobtanium now.", "platform": "Arcade", "release_date": "200", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/38888"}