{"name": "Space Lords", "overview": "Space Lords was produced by Atari Games in 1992.<br><br>First person fly through space game. You shoot or nuke various opponents with a gunner to help. Balance your ship's attributes between speed, agility, shields, and firepower.<br><br>This game is divided into four areas. In all modes you receive a final Rating Score. However, only by completing all 15 missions do you receive an actual RANK (see Missions 1 thru 15):<br><br>Missions 1 thru 15: In this mode the object is to complete each mission by destroying the stated number of enemy ships. The first eight are against a single species opponent and the next six are against a combination of two enemies, while the last stage is a battle against all species/enimies. Upon completing the game you receive a rank based on your final rating. (Finishing the game gives you an extra 200 kills which will improve your overall rating). The ranks that can be obtained are as follows: Cadet, Corporal, Lieutenant, Captain, Admiral, Space Lord. These ranks will be displayed on the high score screen!<br><br>Melee: This is a free for all battle, every ship for themselves, where the computer controlled ships also attack each other. In this mode, all linked players can interact and dog fight in the same space.<br><br>Team/Vs.: In this mode players can choose to be on the same side or opposing sides and either combat the computer ships or each other. There are no \"species\" ships from the other modes in this type of combat, only the players and computer controlled \"player-style\" ships<br><br>Modify: This is where you can choose the number of Nukes and Hypers you want your ship to start with whenever you enter any mode of play. You can also adjust Shields, Laser, Agility, and Speed. (Note: by increasing or decreasing the levels of one attribute others decrease/increase as well to keep the ship balanced). By adding a co-pilot you automatically gain one extra Nuke and one extra Hyper; you also gain slightly better attributes.", "platform": "Arcade", "release_date": "1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari Games", "publishers": "Atari Games", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "4.12", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=5MeBABcoQh4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39023"}