{"name": "Star Gladiator Episode I: Final Crusade", "overview": "A futuristic fighting game from Capcom.<br><br>In the year 2348, humans have been exploring the vast reaches of outer space for the past four centuries and have established peaceful contact with various alien civilizations. People now emigrate from one planet to another and life is generally good. However, some problems arise with a couple of alien races, so the Earth Federation begins its research in creating a Plasma-power weapon to help protect the Earth from any possible outside threats. Dr. Edward Bilstein: a Nobel Prize-winning German-American prestigious physicist for the Earth Federation, uncovers the secret to humanity's \"sixth sense\": a technique for capturing the energy of the human mind and discovers how to use it as an energy source he calls \"Plasma Power\". <br><br>The specific Plasma weapon is built, using mental power as its basis and that Bilstein is able to gain fame and fortune for the invention, but it is soon discovered by the Earth Federation that Bilstein had experimented on actual human bodies during his research on Plasma Power and that he's immediately arrested and exiled from Earth, being imprisoned in a floating prison satellite that orbits the Planet Zeta while the development of the specific Plasma weapon is indefinitely suspended. Word of Earth's possession of a super weapon immediately spreads throughout the universe and that it instantly reduces hostile confrontations while the name Dr. Edward Bilstein is completely forgotten from within the minds of everyone. However, four years later, a report from Zeta states that an Earth Federation army base from upon the planet was attacked and immediately destroyed by a small group of rebels calling themselves the \"Fourth Empire\" and that Bilstein, who had built himself a powerful cyborg body and managed to escape from the floating prison satellite on Zeta, is the one who's leading this group of dangerous individuals. With several other similar reports coming from other nearby planets and realizing that the specific pattern of attacks is leading right back to Earth, a panicked Earth Federation has only one recourse: to find people who could utilize Plasma Power in their own given accord and attempt to stop Bilstein from within a last, desperate effort before the mad genius can invade and conquer Earth and the rest of the universe with his nascent Fourth Empire. <br><br>All of Earth's hopes rest in the project codenamed \"Star Gladiator\".", "platform": "Arcade", "release_date": "July 5, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.07", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=cwWXSKMi2pQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27181"}