{"name": "Star Wars", "overview": "Star Wars was produced by Atari in 1983.<br><br>Pilot the X-Wing Fighter in the classic color vector arcade game! Blast away TIE Fighters, zoom across the surface of the Death Star, and roar down the trench with sampled voices and effects from the movie!<br><br>Before the action starts, the player is allowed to choose which level of difficulty to begin at, with compensating bonus scores for each higher level of play. Once the preliminaries are finished with, the battle begins, and the incredibly smooth first person perspective and 3-D effects take over.<br>The steering mechanism and four built-in triggers enable pinpoint shooting and flying accuracy as well as rapid-fire. The four laser-cannons that are located on the sides and bottom of the video monitor hit the \"cursor\", which is manipulated by the steering mechanism that also controls the direction of your ship. The mechanism is a good copy of the firing triggers in the movie.<br><br>There are three chapters in the story of the game. In the first, your X-Wing Fighter dogfights with Imperial TIE Fighters and Darth Vader's ship. In the second, you maneuver past bunkers and deflector towers on the face of the Death Star, blasting them along the way. In the final scenario, you find yourself speeding through the trench of the Death Star, avoiding obstacles and blasting gun turrets then, finally, hopefully time a proton torpedo for a direct hit on the exaust port target. What follows, if you are successful, is the Death Star exploding in a multitude of different colors. Then it is on to do battle again.<br><br>Throughout the game, you are bombarded by fireballs and lasers, which you must destroy or avoid. Each hit on your ship destroys one of your shields. Any collision will also lose you a shield and the game ends when you run out of shields and you get hit by anything. You do, however, receive an additional shield every time you destroy the Death Star.<br><br>The game features a dramatic state-of-the-art color vector graphics system that produces surprisingly realistic effects. The sound track is laced with the familiar voices of Luke Skywalker \"Red Five standing by.\", \"I cannot shake him!\", \"This is Red Five. I'm going in!\", etc., Obi-Wan Kenobi \"Use The Force, Luke!\", \"Remember, The Force will be with you. Always.\", etc., Han Solo \"Yahoo! You are all clear, kid!\", Darth Vader \"I have you now!\", \"The Force is strong with this one!\", etc., Wedge, and even R2D2 various beeps and electronic sounds, documented in the manual as \"Yes\", \"No\", \"I agree\", \"Sequence completed\", \"Ouch!\", and \"That really hurt.\". There are also seven different musical themes from the movie that are played throughout the game including the Star Wars Theme, Ben's Theme and the Mos Eisley Cantina Band's number.<br><br>The object of the game is to destroy the Death Star. You battle squads of attacking TIE fighters as well as Darth Vader's ship in the attempt to accomplish your goal.", "platform": "Arcade", "release_date": "June 17, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Midway", "publishers": "Atari", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "4.02", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=CbqFawQvdGE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/8491"}