{"name": "Street Fighter III: 3rd Strike: Fight for the Future", "overview": "This version of the third series marks the return of Chun Li along with the Bonus Rounds.<br><br>This version of Street Fighter III adds five new characters to the rosters such as Chun Li (from Street Fighter II), Makoto (a judo expert), Twelve (another Gill clone), Q (who resembles a Japanese superhero similar to Tetsujin 28) and Remy (a Guile/Nash clone). This game also marks the return of bonus rounds which were last present in Super Street Fighter II.<br><br>After choosing a Super Art in a 1-Player game, you'll then be given a choice of 2 stages to proceed to. As mentioned, earlier, for each stage except the last 2 stages, you have a choice, out of 2 opponents to fight with. Once you've selected who you'll be fighting, the announcer (or someone) will give some speech remarks (either \"That's what I expect\" or something else. It's random), and then you'll proceed to fighting the opponents. If you continue, you'll still have the same choice of 2 opponents, but you can re-select who to fight. So, if you think Opponent 1 is hard to win, you can then go for Opponent 2.<br><br>In the 1-Player game, you have a course of 10 opponents to fight against in order to complete the game. Due to constant VS matches, no one had the chance to reach that far (I reached Stage 7 before the long VS matches began). However, as mentioned earlier, in Stages 9 and 10, you would not have a choice of opponents (i.e. fixed opponent depending on your character in Stage 9), and Stage 10 should be Gill for every character. Your character will have some dialogue with your Stage 9 opponent.<br><br>After Stage three and Stage six, you will be given the chance to try out the Bonus Stages. After Stage three is the \"Crush the Car\" Bonus Stage, while after Stage 6 is the \"Parry the Ball\" Bonus Stage. Before the car Bonus Stage, the VS screen will show you VS SUV (the name of the van and a picture of it). Then it goes like in the SF2 games. However, you don't need to switch sides, as the whole car can be destroyed by only 1 side, and you CAN use Super Moves. Although the Super Meter is not shown, but it's still accumulated as you do moves. Unfortunately, you CAN'T have 2-Player Bonus Stages as in the SF2 games. When another player joins in, it just goes straight to the fight.<br><br>The Parry the Ball Bonus Stage (shown as you VS Basketball at the VS screen, with Sean's picture holding a Basketball) works something like the one if SF3:2I. There are still different levels of it, depending on your performance before you reach it. However, there are slight differences. For one, it gets it very own background, instead of reusing one of the character backgrounds, and you're not just limited to one screen. The background can scroll when you move too far away from Sean. Other than that, it works the same, and you have 20 balls to parry.<br><br>The Grade Judgment System is applied throughout the game. For each stage, you'll receive a grade, depending on your performance (mostly stuff like don't lose a round, do Super Cancels, do long combos, win with Super Arts, etc. will give you a higher grade). And the grade you've obtained for each stage is keep track and shown on the list of characters that you've defeated before each stage. At the very end (when you don't continue or win), a chart will be shown for all the stages and the grades you've obtained for them. Below the grades, there's a bar labelled as \"SP\" and for certain stages, you have a dot on this bar (I suppose SP means Super?). There's a high chance that this Grade Judgment System and the SP should be a key in unlocking some secret boss...<br><br>In 2-Player battles, you have a separate set of grades. For the player that has at least 1 win, the highest grade he/she has obtained will be shown below their wins. The more wins they have, the more chances for them to obtain higher grades for that match. Once they lose, the grade disappears.<br><br>Parries... It's still in the game, but there are only three versions of it now. F on the ground for a high parry, D on the ground for a low parry, and F in the air for an air parry (i.e. no D air parry that makes you bounce). Parries still work like in the previous versions, but the freeze-time after a parry has been shortened slightly. This causes a few changes. One, most players would need to relearn parry rhythms for a string of parries (i.e. parrying multi-hit moves), and two, you have less time to connect a Super Move after a parry.<br><br>Throws have been changed to LP LK and you have miss animation frames, although it's very fast, universal overhead attacks (previously D, D ANY BUTTON in SF3 and SF3:2I) are now MP MK, while taunts are still HP HK. Throws need to be re-learned once again. Depending on the character, you can have several different throws, depending on whether you press LP LK when you're holding B, F or NEUTRAL. MP MK for universal overhead attacks still works the same way, and the taunt is still the same. The characters still have dashes(F, F or B, B), high jumps (D, U), long jumps (DB, UF), quick stand (D when hitting the floor), and Super Cancels.", "platform": "Arcade", "release_date": "May 12, 1999", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.61", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Vz4d2Gl3NbM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39183"}