{"name": "Sun Shine", "overview": "Sun Shine is an unreleased 1990 tile-matching puzzle arcade video game that was in development by Alpha Denshi and planned to be published by SNK for both the Neo Geo MVS (arcade) and Neo Geo AES (home) platforms. It is notable for being the first puzzle game to be developed for both systems, as well as holding the distinction of being the smallest Neo Geo title made in terms of memory data.<br><br>Taking place in Paradise Island where looming severe weather threatens to disrupt the climate of the tropical location, players assume command of a dish that contains the Sun's transferred power in order to repel the incoming storms and restore the island to normal. Its gameplay consists of tile-matching, with a main two-button configuration and featuring two playable modes. Sun Shine was first given a location test in July 1990 and despite being previewed across a few video game magazines, in addition to being showcased to attendees at various trade shows, it was ultimately shelved for unknown reasons.<br><br>Although Sun Shine was never officially released to the general public by SNK in its original state despite being completed, it was recalled and received a complete overhaul by Alpha Denshi that would eventually lead to the game becoming a new project titled Fun Fun Bros, featuring a new storyline and theme while retaining the same gameplay from its original counterpart.<br><br>Sun Shine is a puzzle game similar to Columns and Tetris where the main objective is to match three colored tiles of the same color that fall at the top of the playfield as a vertical pair by catching them with the Sun Dish players take control of, instead of the blocks themselves to form a solid vertical line without gaps, although their falling order can be arranged depending on the difficulty level or game mode selected.<br><br>A vertical line section in the middle of the playfield allows players to aim and shoot at the incoming blocks with the A button to drop them into the dish, stopping them for a brief time period and they can be rotated by shooting once again at the pair, while managing to match five blocks in a X form will result on a special bonus.<br><br>Pressing the B button activates a colored Squall (Sunshine) that will clear all blocks that match it from the playfield but only two Squalls are given to players per credit, however more can be obtained by achieving a \"Lucky Bonus\" through a flashing X block that appears on random occasions at the center of a X pattern and matching four tiles of the same color. Failing to catch any of the blocks into the dish rises the water at the bottom of the screen by one level, leaving less space to catch the blocks and if said blocks exceeds the amount of available space on the playfield, the game is over as a result unless players insert more credits into the arcade machine to continue playing. The game also offers a two-player mode where players compete for the highest score.", "platform": "Arcade", "release_date": "January 3, 2022", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Alpha Denshi", "publishers": "", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/82869"}