{"name": "Sundance", "overview": "The object in Sundance was to catch little suns that bounced back and forth between a pair of grids, which move closer and closer together as the game goes on. <br><br>The vector game PCB that Sundance ran on was the original Rosenthal design that \"Space Wars\" used, except there was a lot of cut-and-jumpering done to allow for the varying degrees of intensity that the vectors could show. Hence, the game was quite fragile and none of the machines lasted very long. Sundance had grids in space years before \"Tempest\". Skelly felt the game lacked the anxiety element needed in a good game and begged Cinematronics not to release it. <br><br>Cinematronics tried to make about 1000 of them, but the production fallout rate was around 50%. The problem was the 23'' CRT which was manufactured by an outside vendor. The carbon coating sprayed onto the inside of the tube was defective, and would shake loose and settle around the neck if the game was left in certain positions. When the game was powered up after shipping to the operators, the CRT would instantly burn up from arcing inside the tube. As a result, most Sundance machines suffered a quick death, and were likely destroyed or sent out to pasture in an operators back room. <br><br>Sundance came in the same basic cabinet as the more common \"Rip Off\" and \"Tailgunner\". It featured flame themed sideart, and also had flames on the monitor bezel and around the coin door. The monitor bezel was orange, in order to give the game a bit of color. Most of these cabinets were instantly scrapped, as game conversions weren't really big in 1979, and a cabinet with a bad monitor isn't very good for a conversion anyhow.", "platform": "Arcade", "release_date": "October 1, 1979", "game_type": "", "esrb": "", "developers": "Cinematronics", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2.55", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=1GpxgEJQ4ro", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14449"}