{"name": "Super World Stadium '95", "overview": "Super World Stadium '95 (スーパーワールドスタジアム'95, literally Sūpā Wārudo Sutajiamu '95), is a baseball arcade game that was released by Namco in 1995, only in Japan. It runs upon Namco NB-1 hardware and is the eighth title in the company's World Stadium series; it was also the first title in the series that did not use a Yamaha YM-2151 FM sound chip for music (instead, it used a C352 custom sound chip for everything), and features the same twelve real-life teams from the three previous titles (including the Yokohama Baystars, who were known as the \"Yokohama Taiyo Whales\" up until 1993).<br><br><br>As in the three previous, NS2-era titles, players must select one of twelve real teams; they must then select one of six new stadiums for the match to take place in (Hillside, Trad, Urban which was known as \"Kōshien\" in the seven previous titles, Kaihei Dome, Air Dome which was known as \"Dome\" in the four NS2-era titles, and Seaside which is also from the four NS2-era titles) before picking one of their chosen team's six pitchers (whose names will again be displayed in Kanji, as opposed to Hiragana) - and both of your chosen teams' full 9-player lineups will then be displayed upon the screen (again, in Kanji), before all eighteen players run out to take their positions upon the field of the chosen stadium for an eighth time. The stadiums also have advertisements for several older Namco games including Starblade, Great Sluggers, Outfoxies, Tekken, Mach Breakers, Xevious, Mappy, Dig Dug, Pac-Land, Pac-Man, Ace Driver, Galaga, and Midway Games' first unauthorized Pac-Man sequel Ms. Pac-Man.", "platform": "Arcade", "release_date": "1995", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "3.23", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39393"}