{"name": "Super World Stadium '92", "overview": "Super World Stadium '92 Gekitouban (スーパーワールドスタジアム'92激闘版, literally: Sūpā Wārudo Sutajiamu '92 Gekitōban) is a baseball arcade game that was released by Namco in 1992 exclusively in Japan. It runs on Namco System 2 hardware, and is the sixth title in the company's World Stadium series.<br><br><br>Super World Stadium '92 Gekitouban's gameplay is identical to Super World Stadium '92. The game is different in that it has three extra Kanji characters on its title screen, adding \"Gekitouban.\" This difference illustrates the fact that it has a brand-new \"FAVOR\" setting in its options menu (which is set to \"NONE\" by default, but could be set to any one of the twelve new-for-1992 teams in order to make the game display any one of the twelve screens shown below during its attract sequence). Therefore, any arcade operators who were based close to the teams' home stadiums at the time would have the power to label themselves as a fan of their local teams - and the screens display the favoured team's names in Kanji and Katakana, along with their positions in the Central or Pacific Leagues at the ends of the 1989, 1990, and 1991 seasons, a picture of their mascots at a local landmark (the Lions', Blue Wave's, Giants', Hawks' and Tigers' mascots also still appear in the game itself), their flags (from the game's team selection screen) and their rounded logos (from whenever a run is scored in the game). They also display this three-script text: honki ha, (favoured team's name in Kanji or Katakana) fan no tame no tokubetsu shiyō ni natte imasu (本機は、西武/近鉄/広島/中日/オリックス/日本ハム/ヤクルト/巨人/ダイエイ/ロッテ/大洋/阪神ファンのための特別仕様になっています), down at the bottom of the screen; translated into English, it means \"this unit is built to special specifications for (favoured team's) fans\".", "platform": "Arcade", "release_date": "1992", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39390"}