{"name": "Super World Stadium '93", "overview": "Super World Stadium '93 (complete Japanese title: Super World Stadium '93 Gekitōhen スーパーワールドスタジアム'93激闘編, lit.: Sūpā Wārudo Sutajiamu '93 Gekitōhen), is a baseball arcade game that was released by Namco in 1993 exclusively in Japan. It runs on Namco System 2 hardware, and is the seventh (and last NS2-era) title in the company's World Stadium series; like its predecessors, it used a Yamaha YM-2151 FM sound chip (for all its songs this time, as opposed to just the secondary ones) - but it used a C140 custom sound chip for its sound effects and speech (as opposed to a PSG and DAC). The Yokohama Taiyo Whales have also undergone a renaming, to \"Yokohama Baystars\".<br><br><br>As in the two previous titles, players must select one of twelve real teams (as mentioned above, one of them has undergone a renaming); they must then select one of the four stadiums for the match to take place in (Dome, Kōshien from the three NS1-era titles, Seaside, and Manhattan) before picking one of their chosen team's six pitchers (whose names will again be displayed in Kanji as opposed to Hiragana) - and both of your chosen teams' full 9-player lineups will then be displayed on the screen (again, in Kanji), before all eighteen players run out to take their positions on the field of your chosen stadium, for a seventh (and last, for players who favour the Kōshien and Manhattan Stadiums, time). At the start of the NB-1 era, the Dome Stadium was renamed to \"Air Dome\" (エアドーム, lit. Eadōmu), possibly to avoid confusion with the new Kaihei (開閉) Dome Stadium, and the Kōshien Stadium was renamed to \"Urban\" (アーバン, lit. Āban); they also featured advertisements for earlier Namco games.", "platform": "Arcade", "release_date": "1993", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "2.85", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39392"}