{"name": "Super World Stadium", "overview": "Super World Stadium (スーパーワールドスタジアム, literally: Sūpā Wārudo Sutajiamu), is a baseball arcade game that was released by Namco in 1991, exclusively in Japan. It runs on Namco System 2 hardware and is the fourth title in the company's World Stadium series; much like its predecessors, it used a Yamaha YM-2151 FM sound chip (for all its songs this time as opposed to just the secondary ones), but it used a C140 custom sound chip for its sound effects and speech (as opposed to a PSG and DAC). It also features: sixteen teams (as opposed to only twelve - ten of the teams are returning favourites from the three System 1-era titles, but six of them were created specifically for this game).<br><br><br>As mentioned above, the players must select one of sixteen different teams (the Lionels, Buckaroos, Giants, Cars, Wheels, Fires, Orients, Drasans, Sparrows, and Titans from the three NS1-era games, and the new for NS2-era Blue Arrows, Holmes, Orbies, Fifties, Nationals, and Americans); they must then select one of four (as opposed to three) stadiums for the match to take place in (Dome, Kōshien from the three NS1-era titles, Seaside, and Manhattan) before picking one of their chosen team's five pitchers (the rear views of whom will no longer be displayed on the screen as you push your joysticks up and down to highlight them - and their names are now displayed in Kanji as opposed to Hiragana). Both of your chosen teams' full 9-player lineups will then be displayed (again, in Kanji), on the screen, before all eighteen players run out to take their positions on the field of the chosen stadium yet again.", "platform": "Arcade", "release_date": "1992", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "3.06", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39387"}