{"name": "Super Duck", "overview": "You’re controlling the angel-duck, and your mission is to clear each stage by collecting all the fruits / vegetables in the stage- in this case, those rather succulent-looking strawberries. The play area is a maze constructed from lollipop sticks hovering over a pond, so as you can probably tell most of the gameplay is going to revolve around jumping. You can only walk on the wooden platforms and you have to jump between them. You can only jump across a gap of one “unit,” if you get me – so the duck will clear the jump he’s attempting in the screenshot above, but if he tried to jump directly downwards from his landing point he’d fall to his death because that gap’s two “units” wide.<br>Okay, so there are also monsters to avoid. They could easily threaten a duck. There are two main categories of monsters in Super Duck: the ones that pop up and fire a deadly projectile roughly in the duck’s direction, or the ones that run around the level without a care in the world, uninterested in what the duck is up to but still deadly to the touch. Whether by design or coincidence, the monsters often seem to congregate on the outer peripheries of the stage. It doesn’t feel particularly intentional, but there are always a few fruits you need to grab at the edge of the level and those are the most difficult to reach so maybe the monsters are supposed to move outwards and block your path.<br>Once you’ve grabbed every piece of fruit, the stage ends and you’re whisked away to the next one. There’s a different layout of platforms to contend with and the background usually changes, but other than that the gameplay’s the same, and I don’t think it’d be too harsh to say that if you’ve played one stage of Super Duck you’ve played ‘em all. If I was comparing Super Duck to another game I suppose Pac-Man would be the obvious choice, although because both games are about jumping between floating platforms from a sort-of-top-down perspective, Evil Stone would be a more accurate comparison. Thankfully this game never gets anywhere near as frustrating as Evil Stone.", "platform": "Arcade", "release_date": "1992", "game_type": "", "esrb": "Not Rated", "developers": "Comad", "publishers": "Comad", "genres": "Puzzle", "max_players": "", "cooperative": "No", "rating": "3.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39270"}