{"name": "Super World Stadium '99", "overview": "Super World Stadium '99 (スーパーワールドスタジアム'99, literally Sūpā Wārudo Sutajiamu '99), is a baseball arcade game that was released by Namco in 1999, only in Japan. It runs on Namco System 12 hardware and is the eleventh (and final) title in the company's long-running World Stadium series; it is also the last title in the series that does not use a Yamaha YM-2151 FM sound chip for music (as with its three NB-1-era predecessors, it uses a C352 custom sound chip for everything), and the only title in the series to feature three-dimensional polygonal graphics (with non-identical-looking players).<br><br><br>For the eleventh, and final, time, players must select from one of twelve returning real-life teams from the last six titles, and that USA team from the last two (who have undergone a renaming, to \"USA All-Stars\" for their last appearance), along with five new fictitious teams that were created specifically for this game (the Central League, Pacific League, Namco Stars, Gals, and User Team); the flags for the first and second of these new teams are identical to those of the leagues they are named after, which have appeared on the license screens in the attract sequences of the last six titles. The third one also originally appeared in the Japan-only Famicom game of Pro Yakyuu Family Stadium, and Pro Yakyuu Family Stadium '87 (which were the inspiration for the entire WS series, even though the teams of the Railways, Foodsfoods and Major Leaguers never made it into the arcade) - and they must then select one of twelve new stadiums for the match to take place in (Seaside and Air Dome which was formerly known as \"Dome\", from the last seven titles, Hillside, Trad, and Kaihei Dome from the last three titles, Urban which was formerly known as \"Kōshien\" from all ten previous titles, and the new-for-NS12 Bay Area, Owari Dome, Naniwa Dome, Forest, Setōchi and Kasenjiki). The rules are still identical though.", "platform": "Arcade", "release_date": "1999", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "4.23", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39397"}