{"name": "Super Real Mahjong P7", "overview": "SRMP7 is amongst the top mahjong games in MAME. Very few can match with the quality of animation found in this game, nor the purity in how it handles the game of mahjong.<br><br>There are 3 different story modes to choose from, each revolving around one of the three opponents in the game. You still challenge all 3 girls, just in a different order. Each story is told through cut-scenes that play throughout the game. The cut-scenes themselves are quite nice. Loads of animation, colorful, and very appealing. Much of the same quality that you would find and expect from a regular anime. A slight issue with them is that that can be a tad too long. Some can last over a minute in length. You sometimes forget that you're actually playing mahjong :)<br><br>SRMP7 is video mahjong at its purest. There are no items in the game, which eliminates any advantage for the player. Opponents have no score, which means that you can only win by winning a series of rounds and not by making a really big hand in a single round, which is still pretty rare to do without items anyway. To make matters worse, opponents re-cloth themselves with each round they win. Meaning that you may have to win more rounds than the minimum in order to win the match depending on how many times the opponent wins. The good side about this is that it does make you play more defensively each time the opponent has a clear opportunity to win such as trying to force a draw situation and watching what you actually discard in order to decrease her chances from winning.<br><br>I would say that the difficulty of the game is fair. It's not easy, but its not too hard as well. It feels like both me and the opponent has an equal chance of winning. All that it comes down to is me and how I handle my tiles.<br><br>SRMP7 is video mahjong at its best and the purest of them all. No wonder it's called \"Super Real Mahjong.\" :)", "platform": "Arcade", "release_date": "1997", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39335"}