{"name": "Susume! Taisen Puzzle-Dama", "overview": "Taisen Puzzle-Dama (対戦ぱずるだま, lit. \"Battle Puzzle Ball\") is a puzzle series developed by Konami.<br><br>The gameplay of the series is similar to other matching-based puzzle games, such as Puyo Puyo, being a battle game between one player and either a human or CPU opponent. Balls will descend down the screen, in colours red, yellow, blue, or green. These balls can be either \"large balls\" (おおだま, Ōdama) or \"small balls\" (こだま, Kodama), the latter of which appear \"locked\" in square boxes. Large balls are cleared if three or more are touching horizontally or vertically. When a large ball is cleared next to a small ball, that small ball is \"unlocked\" and becomes a large ball, and so can be matched with. If a combo of matches occurs, those balls are converted into \"attack balls\" (こうげきだま, Kougeki dama), which results in small balls being added to the opponent's side, in a different pattern for each character.<br><br>The ball types are as follows:<br><br>Large Ball (おおだま, Ōdama): Basic ball type, can be matched.<br>Small Ball (こだま, Kodama): Appear \"locked\" and can be unlocked by matching large balls next to them.<br>Good Ball (ぜんだま, Zendama): Introduced in Susume! Taisen Puzzle-Dama. These balls are white in colour, and when they land, they convert all adjacent small balls to large balls.<br>Evil Ball (あくだま, Akudama): Introduced in Susume! Taisen Puzzle-Dama. These balls are black in colour, and when they land, they convert all adjacent large balls to small balls.<br>Eating Ball (くいだま, Kuidama): Introduced in Susume! Taisen Puzzle-Dama. These balls are purple in colour, and are oriented in a certain direction. Where they land, they continue in the direction they are facing, \"eating\" small balls and removing them from the field. They stop when they reach the edge of the field or a large ball. They then convert the last small ball they \"ate\" into a large ball.", "platform": "Arcade", "release_date": "1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/85682"}