{"name": "Suzuka 8 Hours 2", "overview": "Suzuka 8 Hours 2 (鈴鹿8アワーズ2, Eng. Suzuka Ēto Awāzu Tsū), is a racing arcade game that was released by Namco in 1993, only in Japan; it runs upon Namco System 2 hardware, and as the name suggests, it is the sequel to Suzuka 8 Hours, which was released in the previous year. The gameplay is much the same as that of the original, except that this time there are four different tracks to choose from - the original Suzuka Circuit (making its fifth appearance in a Namco racing game after PP2, FL, FL2 and the original S8H), the \"Green Hill Circuit\" (which despite its name, does not take place in the initial Zone for Sonic the Hedgehog), the \"Bayside Raceway\", and finally the \"Devil's Canyon Circuit\".<br><br><br>That Green Hill Circuit is the easiest of the four tracks (and is recommended for novice players); once you have mastered it, you will be ready to move on to the Bay Side Raceway (which is the equivalent of the Monacan and San Marinan tracks from FL2 and 3). Once you have mastered it, you'll be ready to move onto the Suzuka Circuit from the original game which is now the equivalent of the Italian and French tracks from FL2 and 3 - but that Devil's Canyon Circuit is the hardest of the four tracks, and is only recommended for expert players or those who had managed to master the England track in FL3. As in Final Lap 2 and 3, the course with the most votes at the start of the game will be chosen, and if you are using MAME to play this game (which you almost certainly will be, unless you are a native of Japan), you will have to hold \"9\" and press \"F2\" in order to calibrate that virtual steering wheel; if you do not, you will only be able to select the Bay Side Raceway and Devil's Canyon Circuit as you start.", "platform": "Arcade", "release_date": "1993", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Racing", "max_players": "", "cooperative": "No", "rating": "3.03", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39408"}