{"name": "Tail to Nose", "overview": "Tail To Nose: Great Championship was produced by Video System Co. Ltd. in 1989.<br><br>Choose one of six F1 cars (along with the driver) and race around a track as fast as you can.<br><br>You choose one of six F1 Cars and get to select one of the two drivers. It is one of the few F1 games that runs in a standard JAMMA cabinet, but it can use a steering wheel and pedals. The game has a top-down view of the racing, with the track rotating rather then the car. Although you can race all 23 qualified drivers, only the eleven top drivers (the ones you can select) will give you any trouble. A map shows you where you are and where the top driver is.<br><br>You choose one of six F1 Cars and get to select one of the two drivers. It is one of the few F1 games that runs in a standard JAMMA cabinet, but it can use a steering wheel and pedals. The game has a top-down view of the racing, with the track rotating rather then the car. Although you can race all 23 qualified drivers, only the eleven top drivers (the ones you can select) will give you any trouble. A map shows you where you are and where the top driver is.<br>Game Play<br><br>Before you start a race you must select what curcuit you want to Race on, You can select Silverstone (Speed), Sazuka (Technical + Speed), Detriot (Technical) these will be over four laps. You can also select Championship mode which you race around the said circuits over two laps and Monaco (very Technical) over four laps, but you must place sixth or better on each circuit to proceed to the next curcuit. You then have to qualify. Drive around the track to try to get the fastest possible time, but take too long and you will either not qualify or your will be game over before you even finish. The remaining eleven drivers will race you and will always take racing line, but they won't give you an inch. Touch a car and you will slow down, go off the track and you will slow down, turn on the grass and you will spin. Like most decent racing games you must learn how to brake and how to turn around corners. Belting round corners at high speed will send you spinning off the track, losing time. Crash too much (but you would have to be a very bad driver to do this) will retire the car and your game will be over.<br>You are also racing against the clock. You generally have a few seconds more then the basic lap record (which is an average time!!). Failure to pass the start / finish line in this time, then it is game over. When the clock hits zero it is game over, with no slowing down first. When you complete a lap, you come up against the back markers who get in your way and can cause you to lose places and time.<br><br>Finish sixth or better and you will continue to the next round. Get third and see a podium picture. Win and, well you'll just have to see!", "platform": "Arcade", "release_date": "1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Video System Co., Ltd.", "publishers": "Video System Co., Ltd.", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3.15", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=BvdnOYlxw_Q", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23595"}