{"name": "Tekken 6", "overview": "Tekken 6 (Japanese: 鉄拳6) is a fighting game developed and published by Bandai Namco Games. It is the sixth main and seventh installment in the Tekken franchise. It was released in arcades on November 26, 2007, as the first game running on the PlayStation 3-based System 357 arcade board. A year later, the game received an update, subtitled Bloodline Rebellion. Both versions also saw a limited release in North America. This was the first time a main installment was produced for a non-Sony console. The game was produced by Katsuhiro Harada, who aimed to give the fights a strategic style while remaining faithful to the previous games in the series.<br><br>Tekken 6 features bigger stages with more interactivity than its predecessors, including walls or floors that can be broken to reveal new fighting areas. The character customization feature has been enhanced, and certain items have implications in some aspects of the gameplay.<br><br>A new Rage system gives characters more damage per hit when their vitality is below a certain point. Once activated, a reddish energy aura appears around the character, and their health bar starts to flicker in red. The Rage aura can be customized with different colors and effects to appear like fire, electricity, and ice, among others. Another newly added gameplay feature is the \"bound\" system. Every character has several moves that when used in a juggle combo will cause the opponent to be smashed hard into the ground, bouncing them off it in a stunned state, leaving them vulnerable to another combo or an additional attack.", "platform": "Arcade", "release_date": "November 26, 2007", "game_type": "Released", "esrb": "", "developers": "Namco Bandai Games", "publishers": "Namco Bandai Games", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=koHPHDYm-Hg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156177"}