{"name": "The Revenge of Shinobi", "overview": "The Revenge of Shinobi, released in Japan as The Super Shinobi, is a hack-and-slash action video game developed and published by Sega in 1989. It was the first Shinobi game developed for the Sega Genesis, and was later released on the coin-operated version of that console, the Mega-Tech.<br><br>Alongside Shadow Dancer, the game is a sequel to Shinobi, and features an original score by Yuzo Koshiro. The game was included in the compilations: Mega Games 2, Mega Drive 6 Pak, Sega Classics Arcade Collection (for the Sega CD), and Sega Smash Pack (for the PC and Dreamcast). It was also re-released for the Wii Virtual Console in 2009, on the PlayStation 3 via PlayStation Network and Xbox 360 via Xbox Live Arcade download services in 2012, and for iOS and Android devices in 2017 via Sega Forever.<br><br>The game is a traditional side-scrolling platform game. The player controls Joe Musashi and must complete eight districts before the final confrontation with the head of Neo Zeed. Each district consists of three scenes, two of which are platforming levels and the third being a battle against a unique boss character.<br><br>The directional pad moves Joe around while the A, B, and C buttons are used to perform ninjutsu techniques, attack and jump, respectively. A key move in The Revenge of Shinobi is the somersault, which maximizes Joe's jumping height and enables him to throw eight shuriken at once in mid-air. Additionally, some stages consist of multiple layers, such as the first scene of the Military Base and the freeway in Area Code 818. Switching between layers is also done with the somersault move.<br><br>Alongside his standard moves and attacks, Joe has the ability to do four special ninjutsu techniques. Only one can be performed in each level, unless a ninjutsu item was picked up, or the ninjutsu of Mijin was used.<br><br>A variety of bonus crates can be found in each level, some hidden in the scenery. These include simple powerups such as extra shuriken or health packs, as well as special items to gain lives or extra ninjutsu attacks. Besides powerups, some crates may contain time bombs: explosives that detonate when their fuse runs out or if Joe comes too close (though he can walk out of the blast radius if the player is quick enough).<br><br>The game is divided into four difficulties. As difficulty increases, more enemies appear per stage; on Hardest, Joe takes twice as much damage and the number of starting lives decreases from 10 to 1. From the options menu, the player can also choose the number of starting shuriken from 0 to 90 (though a technique does exist that allows infinite shuriken). The game has two different endings, depending on whether Joe rescues his bride or not.", "platform": "Arcade", "release_date": "1989", "game_type": "", "esrb": "Not Rated", "developers": "SEGA 7th AM R & D Department", "publishers": "", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "4.64", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39621"}