{"name": "The King of Fighters '98: Ultimate Match HERO", "overview": "The King of Fighters '98 Ultimate Match is a remake of The King of Fighters '98 which includes all characters that were present up to The King of Fighters '97 (making it the only dream match game with the most complete roster of characters based to date within the KOF series as a whole).<br><br>Additionally, new alternate versions of characters were added (such as EX Blue Mary and EX Yamazaki). Meanwhile, other alternate versions of characters (barring the Orochi New Faces team and Omega Rugal) gain brand new portraits from their original versions (despite their portraits being already different from each other in the original KOF '98).<br><br>New adjustments to stages (as well as new stages themselves) come along with adjustments to gameplay via re-balancing and new moves (such as Extra Mode now having a manual MAX Mode of its own and having a stock at full charge, thus no longer entering a MAX Mode automatically via this method). A new and notable mode of play for this game is known as Ultimate Mode, where similar to the EX Grooves of Capcom vs. SNK 2, players are able to customize their gauge systems and the mechanics that go along with them, with it being able to select between Advanced or Extra (the gauge style, the method of dodging, and method of quick forward movement).<br><br>The game was released in Japanese arcades on March 18, 2008 and later on the PlayStation 2. Ultimate Match is also available on Xbox 360 Live Arcade. The American port was released by Ignition Entertainment March 3, 2009 and packaged with an extra DVD containing trailers and wallpapers for the game and King of Fighters XII.<br><br>The home version of the game, similar to The King of Fighters Neowave for its home version, uses full 3D-rendered versions of its backgrounds (though an option exists to convert them back into the classic-styled backgrounds in the original '98). The home version also comes with its own arranged soundtrack of the original '98 and most of the game's new soundtracks for UM, as well as a new Neo Geo mode, which allows for a demo of the original Neo Geo-port perfect version of the classic KOF '98.<br><br>A Final Edition of the game (containing various tweaks to the characters and game mechanics) has been released as well, initially for the arcades, and has been released to the PC through Steam in December 16, 2014. Also was released a version for Humble Bundle, in January 9, 2016.<br><br>An animated intro included with the Dreamcast port of the original can be accessed as an unlockable extra in Ultimate Match", "platform": "Arcade", "release_date": "March 18, 2008", "game_type": "Released", "esrb": "Not Rated", "developers": "SNK", "publishers": "SNK", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.11", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106316"}