{"name": "The Return of Ishtar", "overview": "The Return of Ishtar is an adventure game that requires two players. It was also the first game from Namco to have a password feature, to give players the opportunity to continue from where they left off, and their first to not feature a scoring system. Player 1 controls the priestess Ki who fights with magic, while Player 2 controls the sword-wielding Prince Gilgamesh. This sequel starts off directly after Gilgamesh has saved Ki from Druaga, and focuses on their escape from the tower (and its inhabitants) who are after Gilgamesh and Ki to avenge their former master. There are a total of 128 rooms in the sixty-floor tower, and the screen will only scroll according to Ki's location, so the second player will have to stay close to their partner as they traverse the tower. Ki attacks by casting spells at the enemies, while Gilgamesh automatically draws his sword whenever an enemy gets close enough to him, allowing him to attack the enemy by bumping into it with his blade (similar to Adol from the Ys games). However, colliding with enemies will also damage Gilgamesh, and the counter in the bottom-right of the screen will decrease by a preset amount, depending on what enemy type it was. If the counter reaches 0, he will disappear, and the game will be over for both players (which will also happen if Ki is touched by any enemy at all). There are also several different items that can be found in the rooms and collected to aid Gilgamesh and Ki in their quest. As an easter egg, the game's designer, Masanobu Endō, appears unconscious at his desk in the \"Dead End\" room. Ki can use the Blue Crystal Rod spell on him to wake him up; he will then proceed to warp her and Gilgamesh to the \"Calvary Prison\" room.", "platform": "Arcade", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Namco", "publishers": "Namco", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "2.12", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=CDKDqP6fFJs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39619"}