{"name": "The King of Fighters XII", "overview": "The King of Fighters XII (ザ・キング・オブ・ファイターズ　トゥエルブ) (KOF XII) is the twelfth installment of The King of Fighters series of fighting games developed and published by SNK Playmore. KOF XII uses newly drawn 2D sprites on 2D backgrounds. Due to the time the developers took to make the sprites, there are 20 playable characters (giving it the smallest roster in the series), with an extra two added to the console versions. The game was originally released in Japan in April 2009 for arcades. Like The King of Fighters '98 and The King of Fighters 2002, this game does not have a storyline; the saga from Ash Crimson that started in The King of Fighters 2003 finishes in The King of Fighters XIII.<br><br>The King of Fighters XII uses the usual 3-on-3 team system with each fight consisting of up to five rounds. However, the Tactical Shift System from The King of Fighters 2003 has been removed. KOF XII also introduces the \"critical counter\" system. During a match, a bar beneath the player's vitality will fill. When it is full and a player lands a close strong punch as a counter, the character enters into a critical counter mode where the player has a short amount of time wherein their character can link multiple attacks together. Once the critical counter's time period has expired the player can finish with a special move. The new \"Guard Attack\" feature allows a fighter to intercept and hit an incoming opponent's strike damage free (even Desperation Moves can be repelled in this fashion). Finally, there is also a \"clash\" system in place (called the Sousai or \"Deadlock\") wherein characters who land blows on one another with matched timing, the engine will generate a 'break' effect and push the characters away from one another into a neutral standing.<br><br>As it happened with The King of Fighters '98 and The King of Fighters 2002, the game does not contain a storyline, allowing the return of several characters depending on their status in the series. Additionally, there are no official teams, leaving the player to create any team to use. Players can still dash, backstep, and perform rolls as their evade. The Guard Breaks from previous games can now be done at any time.", "platform": "Arcade", "release_date": "April 10, 2009", "game_type": "Released", "esrb": "Not Rated", "developers": "SNK Playmore", "publishers": "SNK Playmore", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14464"}