{"name": "The Big Pro Wrestling!", "overview": "The Big Pro Wrestling! was produced by Technos Japan in 1983.<br><br>In this early arcade wrestling game, you control the team of Terry and Sunny who continuously challenge The Heel Team in a series of tag team matches.<br><br>During each match of this game, whenever you come into contact with one of The Heel Team, you will be given a choice of which attack you want to use against your opponent. These moves include The Straight Jab, The Karate Chop, The Body Slam, The Drop Kick, The Piledriver, The Brain Buster, The Lariat and The Cobra Twist. Press the Action button to select one of those attacks whenever they appear on the screen.<br><br>For each of The Heel Team, one of them is fat and wears black pants and the other wears a red mask and white tights. Moves such as The Brain Buster, The Piledriver, The Lariat and The Cobra Twist will not work when fighting the fat character. If one of The Heel Team turns red, unless you have enough strength to kick out, he can pin you down for a three count, unless you tag in your partner. Every time you tag in your partner you will take control of him while your other wrestler recovers his strength. Whenever you and one of your opponents are outside the ring, your opponent will try to prevent you from getting back into the ring. Sometimes another wrestler will come out of the audience and interfere by attacking you as the referee continues to count.<br><br>To defeat your opponent on three count, when your opponent is down, press the pin button. An opponent can also be beaten if he is out of the ring for twenty counts. You can also win if one of your wrestlers has the masked Heel Team member submitted in The Cobra Twist. A match will be declared a draw if time runs out or if both you and your opponent are both counted out. If Terry and Sunny beat The Heel Team ten times, the two heroes will become world champions who must continuously defend their title against The Heel Team in the following matches.<br><br>Technos Japan's first game. Sunny would later appeared as a supporting character in Double Dragon 3 - The Rosetta Stone.", "platform": "Arcade", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Technōs Japan", "publishers": "Technōs Japan", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.7", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=pi4P9u7Vdcs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39550"}