{"name": "Thunder & Lightning", "overview": "Thunder & Lightning was produced by Seta in 1990.<br><br>A Breakout type game with characters such as Mr. Chin and the Thunder Warrior. Mr. Chin holds a stick over his head that acts as the paddle. If your ball hits one of the power-up carriers (flying saucer, submarine, or airplane) you have to try and pick up the released power-up while continuing to keep the ball in play.<br><br>Power-ups are:<br><br>    Glove: Catch the ball and then release with the A button.<br>    Long: Mr. Chin's stick will become longer.<br>    1-Up: Get an extra life for Mr. Chin.<br>    Missile: Gain fire power, press the A button to launch a missile, catch a second missile to fire two missiles simultaneously.<br>    Big Ball: The ball enlarges and blows through any type of block in its path.<br>    Slow: This will slow the speed of the ball.<br>    3 Balls: The ball will split into three balls and as long as you keep one ball from falling you will always have three balls.<br>    6 Balls: The ball will split into six balls.<br><br>Hostile characters will occasionally appear and try to mess with Mr. Chin.<br><br>    Sea Anemone: If he captures your ball it will split into two smaller balls.<br>    Octopus: He lives underwater inside an ancient vase, if the vase is hit by the ball the octopus will come out and try and latch onto Mr. Chin's stick. If he succeeds he will weigh you down causing you to move slower.<br>    Turtle: They will walk over the wall and transform themselves into new blocks to hinder your progress.<br>    Bird: If hit with your ball it will fly out of control smashing through the walls before flying away.<br>    Thunder Warrior: If you hit the Thunder Warrior with your ball he will release a circle of lightning bolts that will fly around him. The lightning bolts will destroy the walls but they will momentarily paralyze Mr. Chin if he is hit.", "platform": "Arcade", "release_date": "1990", "game_type": "Released", "esrb": "Not Rated", "developers": "SETA Corporation", "publishers": "Romstar", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "2.73", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Ix9SMDQR2_I", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39643"}