{"name": "Tobe! Polystars", "overview": "Tobe! Polystars is a scrolling shooter arcade video game developed and originally published by Konami in March 1997. It has not received any official port to home consoles after its arcade release.It is the first game that ran on the Konami M2 hardware, which was Konami's version of the Panasonic M2. Taking place on the fictional planet Polygon, where the secret Perfect Primitive Polygon association led by Material the Third have invaded its inhabitants, players assume the role of police officers Poly and Stan from the titular squad in order to restore peace on their home.<br>Tobe! Polystars is a scrolling shoot 'em up game reminiscent of Parodius and TwinBee, where players take control of police officers Poly (P1) and Stan (P2) of the titular squad across seven increasingly difficult levels, each with a boss at the end that must be fought before progressing any further, in a last-ditch effort to overthrow the secret Perfect Primitive Polygon association led by Material the Third and his army from conquering planet Polygon as the main objective. Similar to TwinBee Yahho!, players can adjust their playing style before starting the game to suit their preference in that there are two control styles to choose between: one which fires the gun with one button and drops bombs with the second, while the other style shoots and drops bomb at the same time with a single button. In addition to the single-player mode, the game also features a two-player cooperative multiplayer mode.<br><br>During gameplay, players have only two weapons at their disposal: the standard shot that travels a max distance of the screen's height and missiles. There are two types of power-up items scattered through every stage in total that spawn via destructible carriers for shots and missiles. There are also three different shot types to pick up as star-shaped icons. The game employs a respawn system where in which a downed single player will start off immediately at the location they died at. Getting hit by enemy fire will result in losing a live, as well as a penalty of decreasing the character's firepower to its original state, in addition of all medals collected and once all lives are lost, the game is over unless the player inserts more credits into the arcade machine to continue playing.", "platform": "Arcade", "release_date": "1997", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39682"}