{"name": "Toobin'", "overview": "Two guys on inner-tubes ride down a river throwing cans at things and avoiding obstacles to gain points. When you complete a level you get a beach party thrown in your name and the party gets bigger as you progress. Great music and gameplay combine for a fun two player game.<br><br>You are in a river race pitted against the computer or another player. Outscore your opponent by swishing the gates, hitting obstacles and other game characters with cans, collecting hidden letters to spell Toobin', and collecting treasures.<br>The player characters are Bif and Jet. Whenever there is only one player in the game, there will be a computer-controlled opponent called Flotsam.<br><br>The game has three different classes, each with five rivers, for a total of 15. When you reach class 4 it repeats the classes until the last class of the game: number 6. The rivers in each class are as follows:<br><br>Colorado, Amazon, Okeefenokee, American and Nile<br>Yukon, Argentum, Left Bank, Cuprum and Canals Of Mars<br>Jurassic, Black Forest, Rio Grande, Styx and Nightmare<br><br>Collect as many points as possible and try to push your opponent into obstacles. Swish up to five gates in a row and you will correspondingly advance your score multiplier (very important). Basic gates start at 2000, 1000, 500, 250. Once passed through the gates will decrease in points until they reach 100. Swishing a gate and then bumping it numerous times before your opponent can pass is an effective move. Pick-up cans (you can carry up to 9 at a time) or a sixpack (which gives you unlimited cans). The cans are used as \"ammo\" to hinder your opponent, stun other game characters, or to destroy certain obstacles (some obstacles are only temporarily destroyed). When you have a blowout you lose your sixpack and your score multiplier resets to 1. Your multiplier will go down each time you miss a gate.<br>Obstacles in the water (icebergs, bushes, mines, etc.) can reveal hidden points, sixpacks, patches(extra life), beachballs(speedup), including the fabled colorful letters. These letters are worth 10,000 points a piece. Try to have your score multiplier as high as possible to maximize the letter bonus at the end of each class. Be on the lookout for the 25,000 point gate since swishing it can give you up to 125,000 points if your score multiplier is 5! Unlike the other gates however, you only get one chance at the 25,000. Also be on the lookout for falling rocks, jumping penguins, submarines with nasty torpedoes, etc. On the first and second start gate you can utilize the warp whirlpool that will send you to a higher class. Many non-player characters chase you along the way. Watch out for the alligator, he likes to come out when you stall and he always comes from the top of the screen. You must go through a gate to repel that alligator before he appears or before he gets you.", "platform": "Arcade", "release_date": "1988", "game_type": "Released", "esrb": "Not Rated", "developers": "Atari", "publishers": "Domark", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.54", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=89IMkBRt0GE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/26073"}