{"name": "Twin Action", "overview": "Twin Action © 1995 Afega.<br><br>Released in July 1995.<br><br>Similar to \"Air Fox\".<br><br>Most of the music is ripped from the SNES game 'Sonic Blast Man'.<br><br>The two \"heroes\" are twins. We are well advanced when we know that! <br><br>Why should curiosity and the thirst for discovery of new shmups go through the box \"foul dung\"? I do not know, but once again, I make the sinister experience with this Twin Action, a foul game that would like to \"cute them up\" without being \"cute\". <br>The world has never been so close to its end, at least I see this explanation as a pretext for the sad farce that Twin Action is. The graphics, which we like to see sharp, colorful and shimmering in a cute them up, are here botched to the point of making me believe that my glasses were no longer adapted to my deep myopia. The contours of the sprites overflow one over the other, and the poor face of your enemies will give you clearly the impression of a shmup drawn by the graphic designers of Nickelodeon ... Basically it is ugly, flat, not detailed and frankly mediocre. Your hero has attitudes and animations respectively weak and simplistic, impression hardly noted by the nevertheless excellent maneuverability and the great efficiency of the proposed armament (a multidirectional firing and powerful bombs on the ground). Your puppet has in addition to a smart bomb which is in fact a powerful projection of his aura, capable of destroying a boss in one go. <br>As for the soundtrack, it is frankly insignificant, neither the themes nor the sound effects are in adequation with a game that is a cute them up, while being a frightful ugliness remember it. <br>It is frankly a pity, because some passages really give a twist and put your sense of slalom to the test ... Entire passages skilfully mixing trajectories adjusted to the millimeter (due to the hitbox enough balèze) and a number of projectiles pretty enough have a little something catchy, but it will be all ... <br><br>Ah, it is sometimes difficult to want to forge uen shmup culture always more exhaustive. The walk of the shooteux is strewn with pitfalls and can cause, depending on the case, happiness or desolation ... (There, it is about desolation).", "platform": "Arcade", "release_date": "1995", "game_type": "", "esrb": "Not Rated", "developers": "AFEGA", "publishers": "AFEGA", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "2.91", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39856"}