{"name": "U.N. Squadron", "overview": "The game is a military, side-scrolling shooter. Great graphics and music. Based on the Japanese Animation \"Area 88\".<br><br>Shin Kazama is engaged to his girlfriend, Ryoko, and is on the verge of graduating flight school. He has dreams of becoming an airline pilot for his fiance's father's airline corporation, but one night in Paris, his backstabbing friend Kanzaki takes him to a bar and has him get drunk enough to trick him into joining the Asran military, where he must serve for 3 years. And now there's only three ways he can get out: 1. He can serve his three year term, 2. He can buy his way out by earning $1,000,000 from destroying enemies, or 3. He can desert, which is considered a federal crime in Asran. In the fight against Project 4, Shin is joined by two pilots, Mickey Simon and Greg Gates.<br><br>The player can choose between three mercenary pilots: Shin Kazama, Mickey Simon, and Greg Gates. Each pilot flies a specific plane and has slightly different capabilities:<br><br> -- Shin Kazama: Shin flies an F-20 Tigershark; the weapons on his plane fire forward only but at a quick pace. Shin and his plane are the most balanced combination available.<br> -- Mickey Simon: Mickey flies an F-14 Tomcat; the weapons on his plane also fire forward only, but are also larger (albeit slower), inflicting more damage than Shins plane.<br> -- Greg Gates: Greg flies an A-10 Thunderbolt; this plane has smaller forward fire than either Shin or Mickey's planes, but it also fires a second stream downward at a 45° angle from the forward firing stream.", "platform": "Arcade", "release_date": "August 1, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "4.03", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=4TB62ZPYGLU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/7963"}