{"name": "Ubeat", "overview": "Jubeat (ユビート, Yubīto), stylized as jubeat, is a series of arcade music video games developed by Konami Computer Entertainment Japan, and is a part of Konami's Bemani line of music video games. The series uses an arrangement of 16 buttons in a 4x4 grid for gameplay, a grid also used for the displaying of cues and part of the user interface.<br><br>The game went on several location tests in Asia since December 2007, and was released on July 24, 2008[1] in Japan, and December in Hong Kong and Macau (Mainland China didn't officially get the game until early 2010). Two attempts to localize the game for the United States market have been made since August 2008, including UBeat, a variant of the first version,[2] and Jukebeat in 2009, a variant based on Jubeat Ripples.[3]<br><br>A port of the game for the iOS, Jubeat Plus, was released on Apple's Japanese App Store in 2010, with a release in the US store, retitled Jukebeat like the 2009 location test, in 2011.[4] On April 1st 2021, Konami announced a major overhaul to Jubeat Plus via the official Jubeat Twitter account, rebranding it as Jubeat. [5] On May 7th, 2021, it was launched as a successor to both Jukebeat and Jubeat Plus on both Android and iOS.[6]<br>The basic gameplay of the series is similar to Nintendo DS music games such as Osu! Tatakae! Ouendan and Elite Beat Agents and can be considered to be similar to Whac-A-Mole. Animated explosions or other animations, called \"markers\", that can be chosen at the song select screen are shown within the panels synced to a track of the player's choosing; when they reach a \"hot point\", which is dependent on the marker chosen, the player must tap the corresponding screen to score points.[7] Taps can be judged as either Perfect, いい感じ (Good), 早い (Fast), or 遅い (Slow). 3 difficulties (Basic, Advanced, and Extreme) are offered for each song. As with other Konami games, an e-Amusement card can be used to save statistics and a player ranking, and can also be used to access unlockable songs. Single player and linked multiplayer modes with multiple cabinets are also offered. In the app version of Jubeat, players can choose from three different levels of difficulty, just like in the arcade version: basic, advanced and extreme.", "platform": "Arcade", "release_date": "", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154448"}