{"name": "Under Fire", "overview": "Under Fire (アンダーファイアー Andā Faiā) is a 1993 shooter game released in video arcades by Taito Corporation. The game features graphics created using digitized photographs and two player gameplay using gun controllers, similar to Konami's Lethal Enforcers. Unlike Lethal Enforcers, the controllers are not traditional light guns but rather operate using infrared technology. They also provide force feedback when the player pulls the trigger. Like Konami's game, Under Fire is rated for mature audiences 17+ ages and older. The game was never released for home consoles.<br><br>This game is an arcade lightgun rail shooter that up to two players can play simultaneously. Players have individual life bars, and are armed with sub-machine guns. The players have to shoot the \"Hoppers\" down, without shooting innocent victims and fellow policemen. Players take damage if enemies shoot the player or hit them with a projectile (such as a bomb, rocket or a molotov cocktail). If players shoot an innocent victim or policeman, they will also receive damage. Sometimes enemies try to shoot an innocent victim, so the player would have to shoot the enemy that is trying to risk the innocent victim's life; doing so will increase the player's life by one point.<br><br>There are six stages in the game, with two \"bonus\" or \"accident\" stages depending on the player's accuracy. If the player has a satisfactory accuracy rating, the \"accident scene\" is played in which players battle a rush of criminals while trying to avoid shooting the civilians. If a player didn't shoot well enough in the stage, a \"Practice Round\" is played instead in which the players shoot pictures of criminals while not shooting the pictures of civilians. Players can also shoot items to get power-ups:<br><br>Police badges offer score bonuses.<br>The Full Fire power-up provides the player with fully automatic machine gun capabilities (as opposed to the standard 3-shot burst)which comes with a limited number of bullets.<br>The shotgun cartridges make the number of shotgun bullets increase by one bullet, per cartridge, with a maximum of 9.<br>Reloading is done by shooting off screen. The end of each stage contains a boss fight, and all of the bosses have life meters as well. The game also features voice samples. Enemies usually taunt the player by saying: \"Go to Hell!\" (only in the Japanese version), \"I'll kill you!\", \"What do you think of that?!\" and \"Yah!!\". Innocent victims appear and shout: \"Help!\", \"Don't shoot!\" and \"Help me!\", while policemen say: \"Freeze!\" or \"Hands Up!\".", "platform": "Arcade", "release_date": "1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Taito", "publishers": "Taito", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "1.97", "wikipedia": "", "video_link": "https://youtu.be/9yAdFCUKBfs?t=403", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39893"}