{"name": "Vampire Savior 2: The Lord of Vampire", "overview": "A Capcom fighter featuring supernatural monsters as fighters. Released in Japan in 1997, Vampire Savior 2 (ヴァンパイア セイヴァー 2, Vanpaia Seviā) was released along side Vampire Hunter 2 and uses the same gameplay mechanics as Vampire Savior. The game adds Night Warriors: Darkstalkers' Revenge characters Donovan Baine, Huitzil (Phobos in Japan) and Pyron to the Vampire Savior cast while omitting Jon Talbain (Gallon), Rikuo (Aulbath), and Sasquatch. Although the game was never official released in arcades outside of Japan, the game was incorporated into Darkstalkers 3 (Vampire Savior) and later as it's own standard game in the Japanese only release of Vampire: Darkstalkers Collection.<br><br>Vampire Savior 2 retains most of the cast has the characters Jon Talbain, Rikuo and Sasquatched removed from the roster and opening themes in order to incorporate Donovan Baine, Huitzil and Pyron. The default colors for CPU colors are different. Character specific boss fights are now repleaced with a singular boss fight against Jedah Dohma, with only Jedah himself receiving a unique ending. Pre-bosses fights are no longer varied but set so the player must fight Darkstalkers's original boss, Pyron.<br><br>Along side Shadow a new character, Marionette has been added. Marionette allows the player to fight in mirror matches throughout the game. Like Vampire Hunter 2, Shadow receives an addition 5 colors to his pallet and stages share the same recoloring. Oboro Bishamon is now a playable character through code input on the character select screen. Donovan's Night Warriors stage \"Revenger Rooster\" is readded and recolored as well.<br><br>Oddly and unlike Vampire Hunter 2, Vampire Savior 2 uses Night Warriors 's (Vampire Hunter in Japan) default color scheme for it's CPU characters while Vampire Hunter 2 uses Vampire Savior 's medium punch color scheme. Minor differences include health and EX/special bars colors and the font used for winning quotes.", "platform": "Arcade", "release_date": "September 1, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "4.2", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=yRfFtIAtfHU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39937"}