{"name": "Vampire Hunter 2: Darkstalkers Revenge", "overview": "A competitive fighting game similar to the vast majority of Capcom titles released in the '90s. The arcade game was only released in Japan. Vampire Hunter 2 (ヴァンパイア ハンター2, Vanpaia Hantā) was released August, 1997 simultaneously with Vampire Savior 2. Both games were not direct sequels but altered versions of Capcom's original, Vampire Savior. The main difference between Vampire Savior and Vampire Hunter was removal of Jedah Dohma, B.B.Hood, Q-Bee and Lilith. In their place the missing Night Warriors: Darkstalkers' Revenge characters, Pyron, Donovan Baine and Huitzil who did not appear originally in Vampire Savior were used.<br><br>Vampire Hunter 2 features the same character roster and soundtrack as Night Warriors: Darkstalkers' Revenge (which was known as Vampire Hunter in Japan). The game play is the same as with Night Warriors, though slightly tweaked so that the characters play similar to their appearance in Vampire Savior; it also features the double-health bar system from the aforementioned game. Changes were made to accommodate the added characters. CPU opponents appear in different costume colors and background stages, from Vampire Savior, received new colors. Donovan Baine's stage was added and the Pyron boss fight now takes place inside the \"Fetus of God.\" All character, aside from Pyron, were given one shared ending.<br><br>There were implied plans to create an English version of the game, which would've gone under the title Night Warriors 2, but was dropped possibly due to time constraints. This was evident with the Night Warriors 2 logo found in the game's graphics data.", "platform": "Arcade", "release_date": "August 1, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.8", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=M0UK4z4y158", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/39934"}