{"name": "Vs. Gradius", "overview": "Vs. Gradius was developed by Konami and then licensed to Nintendo in 1986. Nintendo released Vs. Gradius for its Vs. System line of arcade machines. The Nintendo Vs. System catered to gamers that engaged head-to-head competitive game play. As an added bonus, the Vs. System also came as a kit that could modify an existing game into a new title.<br><br>Vs. Gradius is actually based on the Nintendo Entertainment System port of the original Gradius arcade game. The main difference between Gradius and Vs. Gradius is that the second version offered never-ending game play. The original Gradius comes to an end after the seventh stage is won. Vs. Gradius supports one and two person game play.<br><br>The Vic Viper is a stealthy fighter jet, and it can move across the screen in eight different directions. This fighter jet lacks a lot of power at the start of each new game, but players can quickly seek out power-ups that can be used to customize their ships. Speed, damage, weaponry and even mystery power-ups can be combined to strengthen the Vic Viper, enabling players to battle opponents on an even playing field.<br><br>Enemy hatches produce large numbers of foes that appear on the screen all at once. Called Kanimu, Dagumu and Gaomu, these hatches can be wiped by bombarding them with sustained attacks with the laser and main weapon. The eight types of air based enemies in Vs. Gradius include; Beans, Rugal, Fose, Fans, Zubs, Uska, Rugal Mkll and Garun. Smaller enemies usually attack in greater numbers while larger opponents typically have more powerful weapons.<br><br>Several bosses, including Moai, Tentacle, Mother and Child, Iron Maiden and Big Core must be defeated at multiple points in Vs. Gradius. Destroying bosses yield large point bonuses. Players do battle with each of these major bosses at least once each in the game.<br><br>Enemies like Ducker, Uros, Amoeba, Dee-01, Jumper and Rush are generally based on the land, but they are known for periodically attacking in the air. Collecting the Double, Speed-up, Option, Mystery, Laser and Missile power-ups make it easier for pilots of Vic Viper to avoid crashing into enemies as well as destroy them.", "platform": "Arcade", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami Industry Co. Ltd.", "publishers": "Nintendo", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "3.91", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=UkJKpM9o9No", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40032"}