{"name": "Vs. SkyKid", "overview": "Vs. Sky Kid is an Action game, developed by Namco and published by SunSoft, which was released in 1986.<br>Sky Kid is a two-dimensional scrolling shooter game. The players take control of the Sky Kids, \"Red Baron\" and \"Blue Max\", which are references to Manfred von Richthofen, the famous World War I flying ace, and the prestigious order Pour le Mérite informally known as Blue Max. The Sky Kids fly around in biplanes and are assigned specific targets during the missions. These missions involve bombing specific targets. The \"A\" button is used to control the plane's machine gun and the \"B\" button is used to perform a loop. A number of obstacles face the players in each level. First, their biplane is not equipped with a bomb to complete their mission and must be picked up en route to the target. Second, there are both ground and air units that attempt to keep the Sky Kids from accomplishing their mission. Last, the Sky Kids may have to navigate through some very inhospitable terrain or navigate around cities in order to get to the target. The targets which the Sky Kids must bomb will either be fortress complexes, or ships. As the players advance further up in the 21 missions, multiple targets will begin to appear in the course of one mission. Players receive points for destroying air and ground targets, and receive additional points at the end of the mission for how many of these types of targets are destroyed. In addition, players get points based on how much of the target is destroyed - but only total destruction warrants an end-of-mission bonus.<br><br>Occasionally, performing a loop over a billboard will reveal one of four hidden Namco characters: Pac-Man, Inky, the Special Flag from Rally-X (which, like the Galaxian flagship, has appeared in several other Namco games) or Pooka from Dig Dug.<br><br>If the player performs a loop in front of the three dancing girls which appear at the end of each mission, the girls will send out hearts representing kisses. If the player should shoot the girls, or hearts, they will turn into pink powder puffs and waving dogs respectively.", "platform": "Arcade", "release_date": "1985", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40049"}