{"name": "Vs. Slalom", "overview": "Slalom, originally released as VS. Slalom, is a skiing sports video game in which the player races in a series of downhill slalom runs while navigating past flags and obstacles before time expires. It was developed by Rare and first released by Nintendo in 1986 for the Nintendo VS. System in arcades. It was then released for the Nintendo Entertainment System (NES) in North America in March 1987 and in Europe later that year. The game was developed by Tim and Chris Stamper and its music was composed by David Wise.<br><br>Slalom was the first NES game developed outside Japan and the Stamper brothers' first game released under the Rare brand. Reviews from the 1980s found Slalom unrealistic, but largely appreciated its graphics and animations, while the original arcade version received praise for its innovative ski controls. In contrast, AllGame's retrospective review called the game poorly made and rushed. Slalom was released in Rare's 2015 Rare Replay compilation for Xbox One.<br><br>Slalom is a single-player game in which players race downhill in a series of slalom races. There are 24 downhill runs total that are evenly spread across three mountains. Before the game starts, players choose their mountain based on difficulty: Snowy Hill for beginners, Steep Peak for intermediate players, and Mount Nasty for experts. The goal for each run is to reach the finish line within the allotted time. Players must dodge obstacles including trees, flags, snowmen, sledders, and other skiers on their way downhill, or else they will tumble and lose time. With enough momentum, players can jump over these obstacles. Players must ski around flags to maintain their speed. If they ski on the wrong side of the flag, the racer will snowplow and slow down.<br><br>Also located on the runs are moguls (bumps) that, when hit, causes the racer to go airborne and slow down slightly when landing. While airborne, players can perform freestyle tricks and earn bonus points. However, if the player botches the trick, the racer may tumble and fall, losing time. At the end of each run, final scores are calculated based on the amount of time remaining on the run and points scored from completing freestyle tricks. If the player earns enough points, they may race the next level \"solo\" (without other skiers onscreen). The points earned in qualifying runs convert to additional seconds on the solo run timer. The high scores on each of the runs are saved in memory until the console is powered off.", "platform": "Arcade", "release_date": "1986", "game_type": "Released", "esrb": "Not Rated", "developers": "Rare Coin-It Inc.", "publishers": "", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://youtu.be/M1MSZuN6HTM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40045"}