{"name": "Warriors of Fate", "overview": "Warriors of Fate is a beat'em up with nine stages. Each contains large mobs including spearman, archers, strongmen, bomb-wielding opponents, and at least one Wei boss. There can be up to three players on-screen at the same time. Using two buttons, Attack and Jump, the characters all have standard moves typical of Capcom side-scrollers of the day. Common enemies including Wei soldiers such as bandits, privatees, wrestlers, fatties and thieves will keep popping up from everywhere. In the end of each stage there is a Wei general as stage bosses, e.g., Li Dian, Xiahou Dun, Xu Chu, Zhang Liao, Cao Ren, Xu Huang, the infamous Lu Bu as final boss. After defeating them all, there is also Cao Cao himself.<br><br>Feudal Chinese warriors fight for their lord against an evil warlord who is wreaking havoc and terror. Beaten opponents drop treasure, books and food which rejuvenate the combatants. Big bosses at the end of each level attempt to prevent your warriors from achieving their goals.<br><br>Warriors of Fate follows Liu Bei's plight in Jingzhou from Romance of the Three Kingdoms, a history-based novel of China, set in the Three Kingdoms period as Cao Cao sets to invade his lands. In Warriors of Fate, Shu Han, led by Liu Bei, as in the novel, was everything \"good\" and \"righteous\", while Wei, led by the ever suspicious and cunning Cao Cao, is portrayed as \"evil\" and \"bad\". Liu Bei's warriors begin by fighting Cao Cao's forces at the Battle of Bowang, then Battle of Changban, then finally join up with Sun Quan to fight at the Battle of Red Cliff.", "platform": "Arcade", "release_date": "October 31, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Beat 'em Up", "max_players": "3", "cooperative": "Yes", "rating": "3.78", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=iNo7UhzwZs4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/12506"}