{"name": "Water Ski", "overview": "Arcade Video game published 38 years ago:<br><br>Water Ski © 1983 Taito Corp.<br><br>In this timed abstract racing game, a single player controls a water-skier who is being pulled along behind a power-boat. The objective is to complete the course in as fast a time as possible to reach the next course, while avoiding rocks, sharks, motor boats, wind surfers and numerous other obstacles.<br><br>The player can move their skier left or right, and can press buttons to either slow the boat's speed or to jump over obstacles. Small rocks are the most common obstacle and can either be avoided or jumped over. As well as the small rocks that litter each course, there are also occasional large rocks; these cannot be jumped and must be avoided at all costs. Also, players must be watchful of the direction their tow-boat takes them otherwise they risk being dragged into oncoming obstacles or having their tow-rope snapped on one of the large rocks.<br><br>As well as obstacles, each stage also contains one or more large jump ramps. To make a successful jump, players must ensure they hit the bottom of the ramp with their ski-board facing directly forwards. At the top of the ramp players must press the JUMP button, which will propel them from the end of the ramp to make a perfect landing in the water below. Making a successful ramp jump awards the player with bonus points, but if a player fails to hit the bottom of the ramp properly, they will crash and lose valuable seconds.<br><br>TECHNICAL<br>It came in the standard 'Taito Classic' cabinet (the same one that was used for titles such as \"Qix\", \"Zoo Keeper\", and \"Jungle King\"). It was usually a brown cabinet with painted sideart (stripes and a 'Taito' logo). This was not a very popular game, and real cabinets are almost impossible to find.<br><br>Runs on the \"Taito SJ System\" hardware.<br>Prom Stickers: A03<br><br>Players: 2<br>Control: 2-way joystick<br>Buttons: 2<br><br>TRIVIA<br>Water Ski was released in September 1983 in Japan.", "platform": "Arcade", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Taito", "publishers": "Taito", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "2.83", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Zl7WYZp93zo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156971"}