{"name": "World Championship Soccer", "overview": "World Championship Soccer (ワールドカップサッカー) is a soccer game running on Sega's Mega-Tech arcade cabinet system and was released as one of the first games for the Sega Genesis system in North America in September 1989.<br><br>The European Mega Drive release, World Cup Italia '90, was published jointly with Olivetti and Virgin Mastertronic and was an officially licensed franchise game of the 1990 FIFA World Cup featuring the official logo and mascot. After the World Cup licence had expired the game was renamed to Sega Soccer on the Mega 6 compilation cartridge on the Mega Drive removing the Virgin Mastertronic credit. A different game was also released as World Cup Italia '90 for the Master System in 1991 but this is not connected to World Championship Soccer.<br><br>In 1990 the game was ported by Elite Systems for DOS, Amiga, Atari ST, Commodore 64 and ZX Spectrum.<br><br>The game presents a top-down view of a simple version of soccer (there are no fouls, substitutions, or strategies). Players must dribble and pass the ball towards one end of the field and try to score a goal by forcing the ball into the opposing team's net. When the player's team has the ball, the player can either dribble the ball across the field, kick the ball towards the goal, pass the ball in the air to another team member, or kick the ball forward in the direction that the player is currently facing. When the opposing team has the ball, the player can switch between different team members on the field, or slide kick their opponent to dislodge the ball from their control.<br><br>When the ball goes out of bounds, the game will switch to a full-screen graphical view for a corner kick or a goal kick. If the game ends in a tie and is not an elimination round match during the championship mode, the game will switch to a graphical penalty kick view.<br><br>To start a game, the player must first select which country they would like to be. Teams are rated on a scale from 1 to 5 (5 being the best) based on four different attributes (Speed, Skill, Defense, and Keeper). The best team in the game is Brazil, while the worst two teams are China and Japan. Games run for 90 minutes, where each minute in the game is actually 6 seconds. There are three audio tracks during game play, chosen based on the teams in the match.", "platform": "Arcade", "release_date": "1989", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40190"}