{"name": "World Stadium '89", "overview": "World Stadium '89 (the complete Japanese title: World Stadium '89 Kaimakuban ワールドスタジアム'89開幕版, lit. Wārudo Sutajiamu '89 Kaimakuban), is a baseball arcade game that was released by Namco in 1989 only in Japan. It runs upon Namco's System 1 hardware, and as its name suggests, it is the sequel to World Stadium, which was released in the previous year; and like how Super Xevious (which had been released five years earlier) was based upon the original Xevious, this game is based upon its predecessor with a few minor changes (team logo/outfit colours and player/manager names).<br><br><br>As in that original game, players must select one of twelve different teams in the \"Urban League\" (the Giants, Cars, Drasans, Sparrows, Wheels and Titans) and the \"Country League\" (the Lionels, Bravos, Hornets, Fires, Orients, and Buckaroos); they must then select one of 3 different stadiums (Kōrakuen, Kōshien, and Mejā) for the game's match to take place in, before selecting one of their chosen team's five pitchers (the rear views of whom will be displayed on the screen, as you push the joystick up and down to highlight them). Both of your chosen teams' full 9-player lineups will then be displayed on the screen, before all eighteen players run out, and take their positions on the field of the chosen stadium (for a second time - and the colours of some of the teams' initial letters on the scoreboards have been changed as well to reflect their new outfits). And when World Stadium '90 was released, it was almost an identical copy of this game, but for its player/manager names and usage of the secondary themes.", "platform": "Arcade", "release_date": "1989", "game_type": "", "esrb": "Not Rated", "developers": "", "publishers": "", "genres": "Sports", "max_players": "", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40216"}