{"name": "World's Largest Pac-Man", "overview": "Pac-Man is back and BIGGER than ever in this arcade exclusive twist on the beloved classic! The huge 108″ LED game screen will stop customers in their tracks and the familiar classic gameplay of Pac-Man will keep them playing for that high score. Using bright LED billboard technology creates a unique appearance to a familiar game that stands out among any other title on your floor.<br><br>2 Player Simultaneous Play- Updated gameplay includes 2 player simultaneous play in Pac-Man. Players can cooperate to complete the mazes in Pac-Man. This feature is brand new to the original Pac-Man game and increases the potential for collections by allowing the customer to play with someone.<br><br>Different Colors- During 2 Player simultaneous play, the controllable characters will be a different color to avoid player confusion.<br><br>New High Score Tables- World’s Largest Pac-Man has brand new high score tables for Pac-Man. These tables have been updated from the original games to allow more names to appear as well as longer.<br><br>Unique “Bragging” Screens- Pac-Man will now have a screen of accomplishments at the end of each completed level that shows which player “ate the most dots”, “ate the most ghost”, etc. that summarizes the player’s accomplishments.<br><br>New features have been added to the familiar Pac-Man formula to enhance the experience.<br>Players can now continue the game by inserting more credits after their lives are lost. Earnings climb higher thanks to the unique “co-op” game mode where you and a friend can tackle the mazes together! The Left side player gets classic Yellow Pac-Man and on the Right is the new Green Pac-Man. Clear out those mazes together and post your high score to the leaderboards afterward.<br><br>Adjustable Lives- Easily adjust the number of lives given to the player for Pac-Man.<br><br>Game Expansion- World’s Largest Pac-Man will offer flexibility for future updates to increase the amount of available classic game titles for the player to choose from. Expect the classic Galaga game to be made available later. The newest update includes the classic arcade game, Galaga!<br><br>Continue- Another new addition to World’s Largest Pac-Man & Friends is the ability to purchase a continue after you lose your last life. In the original Pac-Man games, the player would have to start over from the beginning but now, they can continue from where they left off to try and break the high score.<br><br>Features:<br><br>Arcade Exclusive – you’re not going to find this game on any PS4 or Xbox One! Software designed by Raw Thrills for Bandai Namco Amusement America.<br>1-2 players – 2 can play at the same time! Adjust the distance of the control panel to the screen to fit your venue’s needs.<br>Giant “Video Billboard” screen using RGB/multi-color LEDs. Iconic Pac-Man artwork on the control panel and on the game screen cabinet.<br>Display up to 3 of your own video ads on the game for the Attract Mode!<br>Promote your business, special events, tournaments, and more by uploading your ads via USB.<br>Continue feature.<br>Leaderboards with 8 letter spots for longer names and 10 player slots.<br>Ticket redemption available", "platform": "Arcade", "release_date": "", "game_type": "Released", "esrb": "", "developers": "", "publishers": "", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154430"}