{"name": "Wyvern Wings", "overview": "A vertical shoot'em up with 4 selectable airplanes. 3 years later after Arizona impact, other enemy appears to the Human species faced to a environmental crisis. Owing to the appearance of the unknown enemy, the Human being in faced to the existent crisis...<br><br>This game exists under two titles, Wivern Wings and Wyvern Wings: Space Opera, the latter edited by G-Vision. Wyvern Wings is a shm'up arcade very influenced by the style of Psikyo productions. <br><br>8 levels of challenging ducks and destructions await you. You will start by choosing your craft, 4 cuckoos are at your disposal. These machines - from the classic fighter of the armed forces to a kind of stealth aircraft closer to the flying saucer than a real human-made craft - each have their own specificities, ranked according to 4 points: power, speed, bomb and special attack . In fact, the devices in question have a wide frontal fire, a self-guided secondary shot, a smart bomb and a \"special\" attack, which in fact consists of a shield with limited effect. The game opts for an intelligent power-up system: the \"P\" items boost your main shot, the items \"u\" increase the power and/or deployment of your auxiliary weapon.<br><br>The order of the levels will depend on the choice of the ship. The levels are relatively long for a production of this type, without reaching excesses, the action is rather dense and the stages of real condensed slalom and absorption of shots. And to finish on the shields, their use is limited to 3 per level. <br><br>Graphically, Wyvern Wings, without being a masterpiece, gets away with the honors. Even if the backgrounds are rather simplistic, the enemy sprites are worked and detailed, the bosses are particularly well cared for and the enemies of the end of level level in \"Russian doll\" will be delighted, once again in the style of the Psikyo shoots. The types of projectiles, the anticipation, the random order of the levels, the bosses with drawer, everything is there to remind us the Firm of Shin Nakamura, big factory with big shm'ups. But despite all these positive points, and precisely because of this desire to imitate the Psikyo model, Wyvern Wings disappoints a little, there is a praiseworthy and undeniable effort, but marred by a lack of care in the realization.<br><br>A game pleasant to discover certainly, but that struggle to keep the player in breath. Not that its difficulty is ridiculously low (on the contrary, it is even hard enough) but the back taste say a little fadasse of this shm'up does not help. Even if the requirement of the gameplay on the player seems rather incompatible with a game that one would keep for one or two parts.", "platform": "Arcade", "release_date": "2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Semicom", "publishers": "Game Vision", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.67", "wikipedia": "", "video_link": "https://youtu.be/3Ym_e_7PnWE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40224"}