{"name": "Zero Point", "overview": "Zero Point is a light gun shooting gallery game and it is very similar to Point Blank in style and presentation.<br><br>One or two players shoot their way through a series of mini games, which last about 20 or 30 seconds each. The rules of the mini games are displayed before each round. In general players have to shoot targets of their own color, while avoiding to shoot bombs or targets with the opponent's color. After each round a results screen shows if the objectives were completed or failed. Failing a round and the player loses a life heart, lose all hearts and the game is over.<br><br>From a grid of 28 question mark cubes, the players select one cube to reveal four mini games. The mini games can be played in any order. A mini game can be labelled \"very hard\" to indicate it has a more strict objective or more difficult targets. At the beginning of the game the players can choose one of three difficulty settings; training, beginner or expert. Training is 2 cubes, so 8 mini games in total, with no \"very hard\" rounds. Beginner is 6 cubes, so 24 mini games, each and after that an end boss. And expert is even more rounds.<br><br>There are many mini games, including shooting targets on a scrolling fence or train, protecting a man from crocodiles or tigers, elevator doors that reveal bad guys or civilians, shoot blocks to help pacman escape a ghost, shoot falling bombs before they reach a city and many more. Other mini games include targets like clay targets, cardboard cut-outs, ghosts, robots, witches on broomsticks, fireworks, cans, pumpkins, bowling pins, traffic signs etc. Some mini games seem to be taken straight from Point Blank, for example a cuckoo clocks with targets popping out and a Galaga-like game. There is a bonus round which is essentially a \"shell game\". Some extra hearts or bullet item are hidden under four cups which then spin around. Players get one bullet to shoot one cup which, hopefully, reveals an item.", "platform": "Arcade", "release_date": "1998", "game_type": "Released", "esrb": "Not Rated", "developers": "Unico Electronics Co., Ltd.", "publishers": "Unico Electronics Co., Ltd.", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "2.37", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=a2WlQ1XIjmE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/40267"}