{"name": "Archipelago of Truth Collection", "overview": "On the Evening of October 10th 1990, The Mario Bros were peacefully Chillaxing in their 2 story House they had just purchased on a Recently Discovered set of Islands.. An Archipelago to be exact. Well as a House-Warming present Princess Peach invited herself over for a visit. Peach Gave the Bros. a Special Package, and after peeling back the blue wrapping paper, and cute pink bow, they say an ancient wooden box. Luigi opened it up and saw the most beautiful Gem he had ever seen. It glowed all 7 colors of the rainbow, and seemed to give off it's own light. Peach said she had found it washed up on the beach as she came to the Bros House. The Bros, being very Humble and modest, declined Peach's Gift, and told her to keep the Precious gem for herself. Peach agreed to do so. After Several Hours of Joyous Conversation, the Mario Bros. and Peach decided to go to sleep, the gem tucked carefully in Peach's Pocket. In the Middle of the Night, a Great Tropical storm began Brewing near the Bros.' Island House. Lightning Crashed, Thunder Rolled, and Giant Waves Crashed along the Beaches. Suddenly the Window of the Bros House Smashed open, and suddenly Peach Vanished before the Bros.' could react at all. The Storm raged harder outside, making it impossible to see, or even hear anything. The Bros were stuck in their house for the Remainder of the Night. Once the storm subsided, the Bros. went out to investigate. The Sun was shining as brightly as ever, and nothing seemed out of place, except for the broken window in their beloved house. Mario decided to go look for Peach, while Luigi stayed back to fix up the window. While searching Mario found nothing. No Koopa Kids, no ransom notes from Bowser, no Toads crying for help. Nothing. Mario sat down beneath a nearby Oak tree to rest. He took his ever-stylish Custom (M) hat off, and rested. Upon sitting down, he noticed some storm clouds were still in the sky above a far off island. Without any leads this seemed to be the most logical place for Peach to be... but how could a storm simply make a person vanish into thin air without a trace? Mario went back to the house and told Luigi what he had seen. Luigi Finished up fixing the window (trying to stall the adventure), and finally Mario and Luigi set out on a Quest to find Peach, the Mysterious Gem, and the Truth...", "platform": "Super Nintendo Entertainment System", "release_date": "2007", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Onyx", "publishers": "", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114814\n"}