{"name": "Celeste.smc", "overview": "This hack is the lovechild of two incredible platformers. Over the course of three years, I brought the mechanics, elements, and visuals from Celeste into Super Mario World. While the inspiration comes heavily from Celeste, it is not a 1:1 recreation or remake of it. The level design is entirely my own, blending the ideologies from Kaizo Mario and Celeste into one complete package. The overarching level design philosophy is something that has never really been seen before given the hack's extensive catalog of custom mechanics and its use of exploration despite being considered Kaizo. Basically every mechanic from Celeste you can think of has been brought over. The dash, the wall jump, the strawberries, and more. Nearly everything has some form of representation in the hack and it is all combined with familiar SMW and Kaizo mechanics. Regrabs, neutralling of the d-pad, and of course shells are all utilized in combination with the Celeste elements to create a one-of-a-kind hack playthrough. With these being said, I do have a few warnings. If you have not beaten all chapters of Celeste, I would recommend doing that before playing this. This hack does its best to explain the Celeste mechanics, though a base understanding of how they work in the original game is quite useful to have in the back pocket. It will also highlight some of the minute differences between Celeste and my implementation of them in the SMW engine. Another warning is that this hack is fairly difficult. I did my best to make (at least) the first level approachable for beginners so they could at least enjoy some of this game, but the difficulty ramps dramatically as the hack progresses. This game assumes that you have a strong, fundamental understanding of Kaizo mechanics and if you lack these, this hack may be something you approach at a later point in time. I would consider beating Summit (\"any%\") a Kaizo: Intermediate hack, but going for a full 100% completion (all berries, all hearts, all chapters) would be Kaizo: Expert. The last warning I'll mention (in regards to the hack's difficulty and gameplay) is that this hack is incredibly rough on the hands. Especially when playing on a standard SNES controller, your hands will hurt more quickly than playing a typical Kaizo hack due to the custom mechanics this hack features. I would recommend taking breaks when playing through this, both to save your hands and to enjoy the experience more. Getting stuck on sections when your hands hurt or when something is unclear is a good time to stop. It will play much better the next time you tackle it. Feel free to ignore my advice, just be aware of the potential consequences. Last note, and this is mainly for stating compatibility. To start, this hack does not work on SNES Classic, and will never work for it. Due to all the custom stuff that gets saved and the system's improper emulation of SRAM, this hack will not work on SNES Classic and I would have to rewrite basically everything to make it compatible. Sorry, play on an emulator instead. The other incompatible thing is that using savestates on console can be quite buggy. Due to how savestates work on console versus emulators, anything in SRAM will not get saved properly and may result in unintended consequences. I also have custom audio code and due to how ARAM is not backed up on console savestates, audio may break as well in levels that run this specified code. While I have code that could prevent savestate use entirely, you can still try to use savestates on console, but I am giving you plenty of warning that it might not work as you expect. Anyway, with all of that said, I am incredibly happy to finally be putting this out. This hack means a lot to me and I hope you have as much fun playing it as I did making it. If you actually read through the entirety of this description, you're a real one. Good luck, have fun. You can do this.", "platform": "Super Nintendo Entertainment System", "release_date": "", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "MarkAlarm", "publishers": "SMW Central", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=xsfi1rms6oU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158797\n"}