{"name": "Chrono Trigger: Lavos' Awakening", "overview": "This is a hardtype hack, that drastically increases the difficulty of the original game, as well as a re-balancing of various aspects for the sake of tuning the difficulty curve, customization, and/or fun. A key part of the re-balance in this hack is making most Dual-Techs and Triple-Techs significantly stronger than in the original game, compared to Single Techs. Summary of Changes: -Entire game made substantially more difficult. Usually not so much as to require substantial grind. By end-game, having max of certain defensive stats is necessary, and is also achievable long before reaching max level. - Particular detail has been given to end-game bosses and enemies, often involving extensive changes of their battle scripts. - Running from battles, is no longer possible. - From Death's Peak onward, enemies give substantially increased XP compared to the original game, in order to speed-up the end-game leveling process. - Dual- and Triple-Tech power generally improved. - Some re-balancing of endgame skills, especially: Luminaire, Flare, Dark Matter, Shock, and Dark Bomb, but others as well. - General re-balance of characters, but staying within their given themes. - End-game equipment has been partially re-designed with new stats and effects in the interest of balance and providing more complex equipment setups. - Once you have the winged Epoch, no one-time-fight-able enemies from that point forward, will have unique charm-able items -- WITH THE EXCEPTION OF OZZIE'S FORT. This frees the player from having to include Ayla in a great many boss fights. Typically, the bosses now drop their charm-able item instead, if it was something special. - Special Uber-Boss: Nu Spekkio is now 10x the force he was in the original game. Try him out if you're looking for a battle potentially even more epic than the final battle. - Easter Egg: Lucca's Pico Magnum can be found somewhere in the game, but it's rather annoying to acquire. It's a good weapon for her when you get it, but mostly, it's just a trophy. - Lapis item now heals for 350, instead of 200. - Megalixirs, can now only be used on the field.", "platform": "Super Nintendo Entertainment System", "release_date": "October 5, 2012", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "zombero", "publishers": "Romhacking.net", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.57", "wikipedia": "", "video_link": "https://www.youtube.com/playlist?list=PLe5Usj-orEjQv_qXZ0dpj0_-8QGFlDVic", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133905\n"}