{"name": "Classic Mario World 3: The Finale", "overview": "Story: After defeating the Great Alliance in the last adventure Mario took a long vacation but when he returned, he discovers that Bowser has taken over Rosalina's Observatory and kidnapped her. Also, there's a warp stars that works as a gateway to his space fortress hidden on his castle, so Mario decides to go on an adventure to save her. Info: This is a traditional Mario adventure with lots of places to explore, levels in this hack are usually longer than the ones from my previous hacks and even the original SMW but don't worry, this hack features the Multiple Midway points patch, multiple powerups and hidden goodies around to help the player out on their adventure. Also new to this update are the Long jump and High jump moves seen on my latest hack and some gameplay improvements like the Upward Fireballs and Safe fall patches that can help the players in traversing the levels and lowering a bit in the difficulty department. Warnings: This hack was originally released in 2016 as part of the Classic Mario World Trilogy that I worked around the time and were my first 3 hacks submitted and accepted here, during these last years I have been updating and adding new improvements to these hacks so they can be more playable and fun, this is the last part of this. Also, some warning that I must give is that the star coins are not necessary to reach 120 exits neither to 100% the hack, they only unlock a small reward for those who take the time to find a part of them but you don't even need to find every single one for that. Also, you won't be able to reach 93 bonus stars which was their total for the original version since in this new version the Mushroom Castle and Toad's Bonus house don't have star coins anymore, so the new cap now is 91. Only collect them if you wish or if you like the completionism aspect of the game ;)", "platform": "Super Nintendo Entertainment System", "release_date": "June 13, 2020", "game_type": "", "esrb": "", "developers": "", "publishers": "", "genres": "Platform", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163447\n"}