{"name": "Cyber Knight II: Chikyuu Teikoku no Yabou", "overview": "Following the events of the first Cyber Knight in the 24th century, the crew of the Swordfish have returned to Earth after defeating the mechanical \"Berzerkers\" far across space. However during their time away, the Earth Federation has been taken over by the ambitious General Forrest, who seeks to wage war on the independent systems and conquer them. Recognizing the potential weapons that could be made from the Berzerker science data, Forrest impounds the Swordfish and jails it's crew. The Berzerker data is used to create \"Overtech\" and bring to life \"Metalliforms\", self-replicating war machines. The Swordfish crew manages to escape, thanks to a mysterious agent \"CJ\", and are recruited into the resistance against the Earth Federation. Given a new spaceship, the Galvodirge, they must travel the galaxy to different human civilizations and devise a plan to stop Earth's attack. Cyber Knight II is an RPG with science-fiction themes. As in the first game, much of the game takes place in a top-down view for movement on planets and areas, a side-view for combat sequences and a first person menu system when aboard the Galvodirge starship. The Galvodirge can travel between stars, scanning worlds for information. If the ship is able to land on a planet, the crew can debark either on foot or using combat modules (mechs). Some areas are only accessible using modules and others (such as towns) do not allow the use of these war machines. Many planets will have towns or people living on them which can be talked to in order to uncover information. Different quests are assigned in order to find the items necessary to progress. There is no system of currency or buying items. Instead, many defeated enemies leave behind \"NeoParts\", which can be brought back to the Swordfish's lab. Analysis of these Neo parts unlocks enhances statistics (endurance, agility, accuracy, etc) for the Modules and new weapons for them to carry.", "platform": "Super Nintendo Entertainment System", "release_date": "August 26, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Atelier Double", "publishers": "Tonkinhouse", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.81", "wikipedia": "https://en.wikipedia.org/wiki/Cyber_Knight", "video_link": "https://www.youtube.com/watch?v=17-ikMJiy38", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/19386\n"}