{"name": "Donkey Kong Country", "overview": "Donkey Kong is back in Nintendo's Donkey Kong Country, with a new sidekick, Diddy Kong, in a crazy island adventure. Challenged by the crazed tribe of reptilian Kremlings, they endeavor to get back their stolen banana horde! Armed with lightning-quick moves, chest-pounding muscle and awesome aerial acrobatics, our duo is ready to face their cunning adversaries. With the help of Donkey Kong's quirky family and his wild animal mounts, they squabble and scamper their way through the unending monkey mayhem. The Donkey Kong Country Competition Cartridge is a cut-down competition variant of Donkey Kong Country manufactured for use in the Nintendo PowerFest '94 game competition and later featured in the Blockbuster World Video Game Championships II event. Only 2,500 copies of the Competition Cartridge were released. The actual game consists of a few select levels from Donkey Kong Country with the addition of a point counter and a few minor tweaks to encourage scoring, the goal being to score as many points as possible. The tree house and banana cave at the start of Jungle Hijinxs have been disabled and all of the Animal Tokens in the early levels have been replaced with banana bunches, making it impossible to reach the bonus round without the usage of a cheating device. The player is also given 50 starting extra lives instead of the 5 as in the original game. The game has a time limit of five minutes, which is displayed at the center of the screen. After the allotted time, the game freezes.", "platform": "Super Nintendo Entertainment System", "release_date": "November 24, 1994", "game_type": "Released", "esrb": "E - Everyone", "developers": "Rare", "publishers": "Nintendo", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "4.57", "wikipedia": "https://en.wikipedia.org/wiki/Donkey_Kong_Country", "video_link": "https://www.youtube.com/watch?v=AUTQBeS4l08", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127\n"}