{"name": "Final Fantasy IV: Ultima", "overview": "Final Fantasy IV - Ultima is a ‘deluxe’ version of Final Fantasy II for the SNES. FF2US always felt somewhat lacking and incomplete but full of potential. This hack rectifies that by adding a ton of additions to the base game while keeping the majority of the main story intact and the feel of FF2US the same. List of features, additions and changes: • 32 New Weapons! Including Ultima Weapon! • 25 New Spells! Also revamped existing spells! • 25 New Bosses!! • New Enemy Graphics!! (HUGE thanks to chillyfeez!) • New Areas! New Side Quests! • New Events! New Endgame Scenarios!! • New Equipment Screen with DETAILED buffs and stats!! • New attack/swing/spell animations! • New weapon graphics!! New sound effects! • New maps, new areas and new edits to overworld maps! • New events! New enemies!! Sprint with the Y button!! • New commands for characters. New Armors and Gears! • Revamped shops/equipment and balanced their progression. • Dark Knight Cecil now dual-wields and is 2-handed!! • Edge is now buffed offensively! Stealing is also buffed! • Rydia has also been buffed(slightly). It’s a surprise! • Cecil has been buffed as a tank. • Rosa can use more White Mage combative gears. • Kain has new offensive buffing spells at end-game and new commands as he rejoins the team. • Rare items and summons now drop much easier! This hack is designed as a ‘play-through’ without grinding. • Many enemies now have meaningful rare drops, and all end-game enemies now have rare ultimate drops! • New thrown weapons and back-row weapons! • Lots of secrets that can lead to early acquirement of better equipment! • Few minor tweaks to the base game such as save points, etc. • Useless finds now replaced with good items or equipment! • All weapons/armors used by characters no longer in party are now usable by at least one character from the end-game party! • MOST items/equipment are now non-missable. Meaning they will be acquirable in some ways at end-game.", "platform": "Super Nintendo Entertainment System", "release_date": "February 20, 2020", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "8-bit fan", "publishers": "", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "3.79", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126202\n"}