{"name": "Final Fantasy IV: The Darkness Within", "overview": "This romhack is a redesign of the original Final Fantasy IV game, focusing mostly on a revamped story and rebalanced gameplay. A lot of development time went into ensuring that the game was challenging and engaging to all playstyles. • Character and Enemy stat, AI, and drop adjustments. • Spell lists and learned spell levels have been adjusted for most characters. • Several spells have had their power/accuracy/elements/cast time adjusted in an effort to make all spells serve a purpose. Some spells removed. Some spells added. • Summons revamped or altered. • Several new abilities have been changed/added/re-introduced to the game. • Equipment overhauled including new accessories which behave like relics from later games. Crow!’s TLD Equipment Screen mod makes the equipment menu far more informational. A Weapon/Armor Chart is also included for viewing items outside of the game. • Several characters are capable of equipping different weapon types. These weapon types offer differing styles of gameplay intended to allow the player to hybridize certain characters. Different weapons grant different stat bonuses. • Fat Chocobos no longer require an item to summon. They can be found in most small chocobo forests as well as a few other places. • Many dialogue and naming changes to coincide with later releases and easier reading. • Nearly every dialogue box in the game was edited or completely altered. Proper English is now used in most cases, and the characters should display more personality with their new dialogue. • Events occur in a different order from the original game almost right from the start! • A number of sidequests have been added at roughly the 2/3 point of the game which provide a break from the action as well as VERY lucrative rewards. • Y-button dashing, increased menu speed, and ATB bars visible in battle courtesy of Myself086!", "platform": "Super Nintendo Entertainment System", "release_date": "March 3, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Rynzer", "publishers": "", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126201\n"}