{"name": "Holy Umbrella: Dondera no Mubou!!", "overview": "In Holy Umbrella you control a schoolboy who lives in modern-day Japan. One day, the sky suddenly turns dark blue, a heavy rain falls onto the city, and the boy finds, halfway between his house and the school, an umbrella which seems to have fallen from the sky. What he does not know is that the umbrella is magical! The moment he touches it, he is transferred to a parallel universe. Immediately, he is attacked by a huge tank, but a strange old man with a talking bird saves him. It seems that an evil creature named Dondera is threatening the country with the terrible monsters she created. But is it really so? You visit the capital town, talk to the emperor, and decide to investigate the matter... Holy Umbrella is essentially a platform action game, but unlike most other games of this genre, it allows you to visit towns, where you control your hero in a standard RPG-like top-down fashion. You can enter houses, talk to townspeople, etc. On platform levels, which are the main part of the game, you have to switch between the hero, the talking bird Bonto who accompanies you on your quest, and the girl Saki, whom you meet later in the game. Every character has his/her own special abilities and own ways of fighting: the hero can slide through air by using the umbrella, Bonto can double-jump on high ledges, Saki can jump on walls, etc. You use your umbrella as a weapon, as well as elemental stones you can collect on your way and throw at enemies. You also find various power-ups and items you can equip on the hero.", "platform": "Super Nintendo Entertainment System", "release_date": "September 29, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Earthly Soft", "publishers": "Naxat Soft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Holy_Umbrella:_Dondera_no_Mubo", "video_link": "https://www.youtube.com/watch?v=J5bf7-EV760&ab_channel=RetroOpeningGames", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/14292\n"}