{"name": "Ken Griffey Jr. Presents Major League Baseball: Ken Griffey Jr. All-Time Edition v2", "overview": "Here is a new-and-improved update to the All-Time Edition I did last year for the first Griffey on SNES. Differences from this version and the last are pretty distinct. I corrected a fwe things, revised some lineups and rosters as well as rating the players differently so it would make a more evenly balanced game. For my original release I used a player's 5 best career years, regardless of the team and regardless if the seasons were not in a row. While this may be more fun I suppose since players will be a lot better, it also made the game a little less balanced. So, for this release, I decided to take a player's 7 best seasons. Also, the 7 seasons had to be consecutive (except if they missed significant time due to injury or a suspension or military service) AND they had to be seasons from which the player played on the team he is represented on in the game. This helped make things a lot more balanced as well as making it a whole lot easier for me to rate the players. I also changed how I rated a player on their defense. I used a combination of Defensive Runs Saved, FLD%, Assists, dWAR, Caught Stealing % and Zone Ratings as well as taking Gold Gloves into account. This definitely lowered a lot of fielder ratings across the board and I think it's much more accurate. One good example of how this changed player ratings would be Jeter on the Yankees. His DEF rating is now a more realistic 7 since I now took into account his horrible range factor this time. Overall, I am a lot more happy with this version than the previous one and hopefully you are, too! I guess version 1.0 is more extreme, so you have a lot more guys rated 9 or 10 where as this one has far less players rated as highly. I included both the regular version here as well as the '98 expansion version, which replaces 2 teams so you can play as Tampa and Arizona if you want. (See the original v1.0 thread for details on that). Enjoy! Feel free to give any criticism or feedback and if you notice any mistakes. I had Harmon Killebrew as a Lefty in v1.0, but thanks to someone on here that pointed this error out, he is now a Righty like he should be.", "platform": "Super Nintendo Entertainment System", "release_date": "March 24, 2020", "game_type": "ROM Hack", "esrb": "", "developers": "Darth Brett", "publishers": "tecmobowl.org", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126910\n"}