{"name": "NBA Jam 2K22: Tournament Edition", "overview": "Creators Double Z/eskayelle and Mattrizzle’s next collab brings with it full use of 2K21 TE’s Mattrizzle Player Engine, and in turn at least 250 playable characters! Look for 64 secret players, a handful of hiddens available only through par codes, and a massive roster update in this release. With more than 170 current NBA players at your fingertips, each team’s expanded roster has no less than five jammers from the end of the 2020-21 season. As of 2K22 TE’s release, no other NBA Jam hack out there boasts this many current NBA players. With v2.0 of the Mattrizzle Player Engine, the mods extend beyond player accessibility and into the following realms: • A substantial graphics update sets fonts and palettes that much closer to the arcade. Check out those sweet courts! • Break backboards! The feature lost after the original SNES NBA Jam (but found its way into College Slam) is back! Locate a maxed out dunker and see if you can shatter some glass! • Just wanna watch a game? Set up simulations a la Tecmo Bowl with the new Spectate feature, pit your favorite teams against each other, sit back, and watch the show! Meanwhile, enjoy these other features known to the 2KTE series… • Battle from worst to first, based on the latest season standings and playoffs. • Injury stats max out at a whopping 50. No shove, no love! • Konami codes from previous hacks get you easy access to expanded rosters, plus the special teams. • Secret players are accessible in campaign mode, with their records available to save. • Cycle both forward AND backward through players on the team select screen. • “Greyscaled” uniform portraits allow for more seamless future roster swaps. • Updated court colors, uniform colors, logos, and banners are all over the game. • New and extended announcer sound clips put more Kitzrow in your ears. • Bug fixes from past hacks keep the pushin’ and shovin’ “professional”. BONUS CONTENT: An add-on Tampa Bay Raptors patch sends Toronto’s team to their quarantine home!", "platform": "Super Nintendo Entertainment System", "release_date": "September 2, 2021", "game_type": "ROM Hack", "esrb": "T - Teen", "developers": "eskayelle", "publishers": "Romhacking.net", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "3.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154561\n"}