{"name": "NBA Jam 2K20: Tournament Edition", "overview": "From the first Double Z Mod to 2K17 – Overtime Edition, development two years in the making has brought eskayelle to this… The Endgame. WELCOME TO NBA JAM 2K20! Improving upon the Double Z mods before it, NBA Jam 2K20 – Tournament Edition brings home the following features: • Updated rosters! Starters and bench strength from the end of the 2018-19 season are here! • New players! Luka Doncic, Evan Fornier, Clint Capela, Moe Harkless, Myles Turner, Seth Curry, Zion Williamson… are all in the game. • All 30 teams are playable, the Grizzlies, World Champion Raptors and Pelicans prominently displayed on an Others team. • Beat the game to access the 2019 All-Stars, expanded rosters, and legacy players! • New and old secret players are obtainable via initials and button combinations. • Bad boys Barkley, Laimbeer, and Rodman are all at your fingertips! • More sound clips! Wizards! Thunder! Plus a couple surprises! • Contemporary logos are combined with some old favorites. • “Greyscaled” uniform portraits for more seamless future roster swaps. • Battle from worst to first based on the 2018-19 season standings and playoffs. • Bug fixes from past hacks remain in the game! • Got a hankerin’ to put on a hurtin’? Injury stats max out at a whopping 50! No shove, no love! • Konami codes from the previous hacks get you expanded rosters, plus either the 2019 All-Stars or the Grizzlies/Raptors/Pelicans. • Plus a few new court colors sprinkled in for fun… • Please feel free to browse the readme for more info, including secret player initials/button combinations and cheat codes. Now get out there and JAM! (Psst… Have you found the Sixth Man yet???)", "platform": "Super Nintendo Entertainment System", "release_date": "July 15, 2019", "game_type": "ROM Hack", "esrb": "T - Teen", "developers": "eskayelle", "publishers": "Romhacking.net", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154559\n"}