{"name": "NBA Jam 2K21: Tournament Edition", "overview": "Kick off your NBA season with NBA Jam TE 2K21! With the delayed 2020 NBA season having come to a close, developer eskayelle/Double Z has provided a roster update to his popular NBA Jam 2KTE series! With some serious support by ASM gurus phonymike and Mattrizzle, 2K21 TE takes the prior year roster update one massive leap forward, with the following improvements: • New players! Jusuf Nurkić, Bam Adebayo, and the Carushow are all in the game. • Updated rosters! Starters and bench strength from the end of the 2019-20 season are here! • Battle from Delete 8 to bubble bursts to NBA Champs based on the 2019-20 season standings and playoff results. • New secret players… and you can now play them in campaign mode with saved records. • Cycle both forward AND backward through players on the team select screen. • New banners reflective of 2020 events (and shilling some other Double Z romhacks). • New and extended announcer sound clips. • Additional original game bug fixes (end of quarter dimming and options menu colors). • Gone are “Others” team mash-ups. Backed by the Mattrizzle Player Engine, with sound rips and insertions by Wake and eskayelle, you now have all 30 NBA teams separately at your fingertips! • Konami codes from the previous hacks now get you expanded rosters, plus the 2020 All-Stars and a slew of Legends. • Court and uniform colors have been revised to better reflect today’s teams. • Bad boys Barkley, Laimbeer, and Rodman are all at your fingertips! • Contemporary logos are combined with some old favorites. • Got a hankerin’ to put on a hurtin’? Injury stats max out at a whopping 50! No shove, no love!", "platform": "Super Nintendo Entertainment System", "release_date": "March 21, 2021", "game_type": "ROM Hack", "esrb": "T - Teen", "developers": "eskayelle", "publishers": "Romhacking.net", "genres": "Sports", "max_players": "2", "cooperative": "Yes", "rating": "0.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154560\n"}