{"name": "NBA Jam 2K17: Overtime Edition", "overview": "This romhack takes concepts learned and developed within eskayelle’s NBA Jam TE - Double Z Mod and extends them to EMiller518’s awesome 2K17 mod, the purpose being to develop a proof-in-concept whereby a template game could be created to apply annual roster updates against. To achieve this, this romhack expands and improves upon the great work accomplished in the original 2K17 romhack by adding the following: • Applies the option menu bugfix issued by Mattrizzle to the NLSC Forum in January 2017. • Applies eskayelle’s injury bugfix. • Applies phonymike’s Grand Champions bugfix. • Reformats certain texts in the attract mode screens. • Allows for input of 2 Konami codes for accessing expanded rosters. • Updates logos for select teams, including Toronto, Memphis, and NOLA. • Modifies the playing order of the teams, such that you now battle from worst to first, based on the 2015-16 season. • Removes all visual references to the Seattle Supersonics, New Jersey Nets, and Washington Bullets. OKC, Brooklyn, and the Wizards are here! • Swaps in new secret characters to add to the game’s playability. • Adds sound clips for the Thunder and the Wizards! Please feel free to browse the readme for more info, including secret player initials/button combinations, and cheat codes. Huge thanks to phonymike for all his guidance and ASM assistance on both the Double Z Mod and NBA Jam 2K17 - OT Edition. Thanks as well to Wake for prepping additional sound clips via Soundforge and Audacity, plus DarkSamus993 and gauveldt for sound guidance that helped “crack the code”. Hat tips to optiroc and Bregalad for additional SNES sound concepts.", "platform": "Super Nintendo Entertainment System", "release_date": "December 5, 2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "eskayelle", "publishers": "", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "2.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/126204\n"}