{"name": "NFL Football", "overview": "THE ONLY THING CLOSER TO LIVE PRO ACTION WOULD BE SEATS ON THE FIFTY YARD LINE! Tackle the only football game to fully harness the awesome Mode 7 power of your Super NES and you'll have the biggest and baddest hulksters in the league to contend with. - Radar Mode 7 camera coverage automatically rotates around the field and zooms in so you won't miss a single bone-crushing play. - Huge players dominate the field with smooth action digitized from actual human movement. - Exclusive Artificial Intelligence feature helps determine the most devastating course of action depending on the field position, down, yards-to-go, time remaining, quarter and score. - Dive, spin, high step, burst and stiff arm like a runaway freight train through an amazing running game. - Choose from all 28 NFL teams blazing with their official colors. - Excruciating games, brutal weeks of playoffs and on to Super Bowl stardom. - Execute strategy with two playbooks—one standard hard hitting NFL, the other geared to each team's style and strengths. - Battle in the authentic arenas. Grinding artificial turf and glaring lights of the Dome, or frozen tundra of Cleveland outdoors. Snow and mud get worse as the game goes on. Strategies must adapt for survival. - True-to-life announcer voices pump up the action. - Challenging, intricate passing plays. - Password feature used during playoffs. - Take on tough Super NES opponents solo or go helmet to helmet with another pro player like yourself. Tear down the opposition with the Houston Oiler \"run and shoot\" or batter Green Bay's defensive line with a Chicago Bear \"up the middle\" attack. Just get off the bench and make the coach proud!", "platform": "Super Nintendo Entertainment System", "release_date": "July 1, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Park Place Productions", "publishers": "Konami", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "3.23", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5436\n"}