{"name": "Plok", "overview": "Plok is a side-scrolling platform game developed by Software Creations and released for the Super Nintendo Entertainment System in 1993. The game is a traditional platform game starring a character named Plok. Plok can launch any of his limbs at will to damage enemies. Once the damage has been done they return to Plok. Some puzzles involve having to \"sacrifice\" one of Plok's limbs to activate switches (thus gradually decreasing Plok's mobility and his chances in battle). Once a limb hits a switch, it is placed on a hanger that may be right next to the switch or several screens away; some switches also require certain limbs. Plok's secondary attack takes the form of a buzzsaw-like jump that not only gives him increased speed, but also dispatches enemies. Plok can pick up shells, which award extra lives and serve as ammunition for a special amulet received partway through the game. The amulet converts shells into power for Plok's secondary attack. Power-ups come in the form of \"presents\" scattered throughout the majority of levels. If Plok locates one of these colorful gifts he is immediately transformed into a more powerful fighting machine for a brief length of time. These power-ups include a flamethrower, boxing gloves, a blunderbuss, dueling pistols and multiple rocket launchers. Specific presents yield vehicles that Plok can use in some later levels in the fleas' lair such as a unicycle, Jeep, jetpack, motorbike, tank, helicopter, Flying saucer and a pair of spring pogo shoes. The player encounters a number of different enemies, such as the aforementioned fleas.", "platform": "Super Nintendo Entertainment System", "release_date": "September 1, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Software Creations Ltd.", "publishers": "Activision", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.68", "wikipedia": "https://en.wikipedia.org/wiki/Plok", "video_link": "http://www.youtube.com/watch?v=bSalAo_rIM0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/5514\n"}