{"name": "Sicari Remastered", "overview": "\"Once upon a time there was a devil who decided on a Saturday afternoon to destroy the universe, but then there was a robot loli and an assassin with depression to kick the tent stick!\" Sicari Remastered is the remastered version of Sicari, hack of the same author released in 2013. Considered one of the most anticipated hacks of the site, Sicari Remastered faithfully follows its original version, but with a great re-working in graphics, music and of course ... ASM. The plot revolves around two girls who must stop the evil plans of Riscuna, an entity that nobody knows where it came from but who wants to destroy the universe because yes. \"What a beautiful day to kill!\" As you may have noticed this hack has two protagonists: Sicari and K-16. Sicari is a depressive child who lost her parents early and had to kill to survive. In her journey, she has the help of her assistant k-16, a robot that has a laser cannon on her arm (which slightly unbalances the gameplay in her favor). During the game you can switch between the two heroines by punching in a mixed block that appears during the beginning of each phase. I recommend choosing coldly K-16 for good part of the levels and Sicari for bosses, that's because they have immunity to android shots. \"Where is everybody? Lol\" The graphics, as well as the story and its characters, were created by the author herself. The cool thing about it all is that Eevee's pixel art skills have evolved considerably since the day the original version was released in 2013. To make the game look more appealing and appealing, the author preferred to use HDMA effects such as gradients and parallaxes. The soundtrack is a paradise of references. Much of the soundtrack is made up of hits from other games and hits from outside the world, like this song here in particular. \"Who raised this castle here has a great artistic sense!\" But you know it's not all flowers, is it? Well, if you want to venture out here, know that the only thing you need to worry about is moments of forced damage. In other words, there will be times when the game will experience a peak of difficulty only to take damage from the player (usually in phases or rooms that precede the battle against the boss). But rest assured: our dynamic pair is ready to kick some ass, yeah!", "platform": "Super Nintendo Entertainment System", "release_date": "January 12, 2018", "game_type": "ROM Hack", "esrb": "", "developers": "EEvee", "publishers": "Romhacking.net", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.31", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116557\n"}