{"name": "Super Metroid: Project Base", "overview": "Project Base keeps the original Super Metroid map mostly intact, while adding new stuff. It doesn't force the player to take a new path, or to use any advanced techniques. Sequence breaks and shortcuts have been left alone, with new ones added. Highly speedrunnable, and with a level of difficulty that is accessible to anyone. Works with Snes9X, ZSNES, higan/BSNES, and on SNES/flash cartridges. The name \"Project Base\" refers its original purpose, which was to act as a base hack for others to build from. It first appeared in August 2009 after I was inspired by squishy_ichigo's Vanilla++ hack, and it is currently still being worked on. I take long breaks often to gather feedback and bug reports. FEATURES: - Alternate versions! Vanilla Palettes, Vanilla Gameplay, and Gameplay Only - General movement is less inhibited, with many new tricks made possible - Modified enemies and bosses, including AI and graphical touch-ups - Faster elevators, doors, room transitions and item-collection sequences - Optional new color palette for the entire game - Bug fixes and polish applied whenever possible - New rooms added, others expanded and/or merged - Alternate versions that offer even more ways to enjoy Super Metroid! SPECIAL MOVES: - RESPIN -- press jump at any time during a normal fall to resume spinning - BACK FLIP -- while crouched, hold run, then press and hold jump + back - BOMB SKIP -- hold down to avoid bomb jumping - QUICK MORPH #1 -- hold item cancel + press down to instantly morph - QUICK MORPH #2 -- hold L + press down, only works in the air - DEMORPH JUMP -- until Spring Ball is equipped, holding run allows spin-jumping straight out of ball form - SPEED BALL -- with Spring Ball equipped, Samus gains the ability to run at full speed as a ball - UP SPIN -- while standing still, hold run to easily spin-jump straight up - SPIN FALL -- hold jump as you fall from a ledge to flip automatically See website/readme for more info.", "platform": "Super Nintendo Entertainment System", "release_date": "August 31, 2009", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "begrimed", "publishers": "Metroid Construction", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107073\n"}