{"name": "Super Metroid: Ancient Chozo", "overview": "Ancient Chozo is an expansion of the original Game that contains the original Super Metroid Map with extra rooms and areas locations, plus new routes to find. An all-new eye-pleasing experience. It has new GFX in most of the areas and new palettes, Ancient Chozo based on Project Base Hack but it's not the same. It has new color palette for the entire game, and more places to explore! The new routes makes the game more interesting. My intention is to keep the original route of Vanilla, but players with good skills can break the Game Sequence. Chozo Hack focused on Explorations and most of the original items locations has been changed! There's a lot new secrets to discover, no longer have the help of the X-Ray vision, players can explore and feel curious how to find new ways and upgrades to make the adventure even more enjoyable. I have add more secret rooms and maybe i'll add some more in future versions. The Ancient Chozo Hack is my First Project! I was always want to make a different Hack compared to other Super Metroid Hacks. I really like the loneliness and ambience of the Metroid series, the ruined places like chozo ruins and chozo race. - New Shinesparks Control can now steered left/right or up/down - New Instant Bombs make bombs explode instantly with no jump (only works on the ground) - New Tractor Beam (updated) charge beam attracts energy/ammo much faster and smoother than before FEATURES: - New Secret Rooms added on Brinstar and Norfair, Some items are now on this rooms. - New Suit palette now with the one was equipped when the game was beaten. - New Custom Music Background on Maridia. - New Puzzles, even more than version 1.0.9. - New Mechanics as moving platforms. - New Rooms added, others merged. - New Color palette for the entire game. - New Samus Suit sprites + palette added. - Modified Enemies & Bosses including palettes. - Faster Doors, Elevators, Rooms transitions & item-collection sequences. - More Detail on this Areas: Brinstar Upper/Lower, Norfair Upper-Lower. - New Beams sparks Animation edited. - Item Fanfare Has Been Restored to the Original Sound. - Bomb Explosion Sound Has Been now Restored to the Original Sound. - Sound Edited on some Bosses. - New Grafics Added to Brinstar/Norfair. MOVES: - New Diagonal Bomb Jump -- Diagonal Bomb Jump will now send you a considerable distance, very useful for SpeedRuns! - Project Base Psychics Modified. - RESPIN -- Press jump button at any time during normal fall to resume spinning. - BACK FLIP -- While crouched, hold run, then press & hold jump + back button. - BOMB SKIP -- Hold down button to avoid bomb jumping.00 - QUICK MORPH #1 -- Hold item cancel + press down button to instantly morph. - QUICK MORPH #2 -- Hold L + press down button, this only works in the air. - DEMORPH JUMP -- Until Spring Ball is equipped, holding run allows spin-jumping straight out of ball form! - SPEED BALL -- With Spring Ball equipped, Samus gains the ability to run at full speed as a ball - UP SPIN -- While standing still, hold run button to easily spin-jump straight up - SPIN FALL -- Hold jump button as you fall from a ledge to flip automatically FIXES: - Permanents Stucks-Fix - Glitch Pallettes on some items-Fix Thanks Grime :) - Some Sprites on Samus-Fix - And So many Not on the list yet! SPECIAL THANKS: -# Grime, Quote58, AnarchyGuitarist, Shannon Cross, Black Falcon, & The Metroid Construction Community!", "platform": "Super Nintendo Entertainment System", "release_date": "January 18, 2018", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Albert V.", "publishers": "Metroid Construction", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.86", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107119\n"}