{"name": "Super Mario World: Central Production 2", "overview": "Ahhhh... Super Mario World Central Production 2, or SMWCP2, for short... I have a lot to say about this collab hack. I've been watching the progress of this collab since I was 11-12 years old, when I was just a freshman of SMW Central and I was too young to fully contribute to anything. I ended up getting banned as a result of my oblivious stupidity and unhelpful attitude, until years later when I ended up creating the World 3 and 9 maps, as nobody else would rise up to it at the time. Since then, SMWCP2 was seemingly about to be wrapped up with its new-fangled ASM cutscenes and credits around 2013-2014...and it never happened. And even worse, after Blind Devil playtested the hack, it turned out the collaboration was a buggy, glitchy, less-than-appealing mess that was outdated a few years after it came out, what with newer versions of Lunar Magic and other tools coming out with new features and less space-heavy insertions. And so, for the longest of time, SMWCP2 was dead... Until recently, that is! Blind Devil took it upon himself to revise SMWCP2 into the hack it should be: A clean, polished, and ambitious yet fun collab to play. His operation started off slowly, until one day when I decided to make that one post where I sparked interest in revising the project after years of radio silence. And for years, Blind Devil and I searched for people who were interested in revising levels, music, graphics, ASM, anything we could change, we changed it. That leads us to today. While Blind Devil has left the site and the project due to real life issues, leaving me and Disk Poppy to take the lead, development has slowed down until a few months ago. Unfortunately, there are some missing features that we want to insert at some point, but we either didn't insert them due to time constraints, or didn't have any space left in the 4MB ROM to insert them. We would need to expand the ROM to 6MB, but that requires the usage of an SA-1 ROM, and unfortunately said ROM is incompatibible with some of SMWCP2's patches. If you think you can help us with that obstacle as well as to help us with anything else we want to add or change, we would appreciate that. For anyone curious on what these missing features we wish to add later or what features we wish to change are, here is a list: List of stuff we want to add/change in future versions: Show But anyway, for what we have, I think we did a great job polishing this hack to try to make it truly shine. Some people might be happy that we took our time and didn't rush out this collab just to be done with it. Other people might say we're polishing a turd. But whatever the case, we're just happy to have the first official release of this long-overdue project done. We will be adding some of these missing features as we go on, hoping that we can reach the potential that SMWCP2 was reaching back in its 2012 years. Overall though, if this project was meant to be a learning experience to us all, I think it taught us many important lessons when it comes to Super Mario World ROMhacking, but I believe these three are the most important: 1: It's great to be ambitious, but you gotta know your limits. ROMs don't have infinite space to fit all your crazy ideas. Your idea might also be incompatible with another idea you had, so you have to be careful. The SA-1 patch can be full of incompatibilities that you have to watch out for. 2: Sometimes, less is more. Despite what many might have you believe, short ROMhacks aren't the antithesis of a good or amazing hack. Just look at Mario's Mystery Meat, for example. That hack is very short, only lasting people about an hour or two of gameplay depending on how long it takes when they beat it. Yet that hack is filled to the brim with hilarious Vinesauce memes and inside jokes, which makes it a treat playing. Holding back on the amount of levels or content overall a hack could have means you could squeeze in some space for something very space-heavy. 3: And I believe that this is the bigbest and most important lesson of them all...", "platform": "Super Nintendo Entertainment System", "release_date": "May 3, 2022", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "SMW Central", "publishers": "SMW Central", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=fSyFcO-A858", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162197\n"}