{"name": "Super Mario Kart: Epic Racers", "overview": "Super Mario Kart - Epic Racers has come a long way. This ambitious project began all the way back in 2003. Starting as a direct follow-up to The Impala Battles, this mod was dubbed The Impala Courses. Later that changed to Epic Battle, and finally the name became Super Mario Kart - Epic Racers. This mod was intended to be some sort of tribute to the Stifu Board forum. Therefore you’ll encounter members from back then. And no, Jesus himself wasn’t a member of our board, but he was a nice opposite to the dark Loki. ;-) Work on Epic Racers started in a time when only small parts of the SMK ROM were documented. There were no other mods, and only one, very limited, editor. Step by step the complete ROM was documented. Using Lunar Compress, graphics could be extracted and changed. Stifu started working on the graphics, while Ok Impala! painstakingly worked on changing the track designs. Initially it proved to be too complex to change the A.I., so tracks were created with the old A.I. The results were far from ideal. With the help of smkdan, Stifu started working on a new track designer to fix all the issues with track design once and for all. Epic Edit saw the light of day and was shared with the world. Meanwhile work on Epic Racers slowed down, due to life changes. In 2016 it seemed like the project was dead. Fast forward to 2020. Ok Impala! decides to start from scratch on the track design, ditching all the ballast of the old track designs. Stifu got on board again to work on the last graphical changes. In several months, revamped tracks and graphics were created, while a lot of bugs and A.I. problems were ironed out. So, there you have it. 17 years later, Epic Racers is finally, proudly, presented to the world. Hopefully you’ll enjoy all the work and love that went into this mod! Features: 20 brand new race tracks, with unique gameplay elements! 4 brand new battle arena’s! 8 new drivers are ready to start their engines! New points system. Every position receives points! New items and probability sets! New course themes! New objects! New items! New title screen! New character selection screen! Always continue to the next race in GP mode, regardless of your position! Play the special cup in 50cc! And a whole lot more!", "platform": "Super Nintendo Entertainment System", "release_date": "November 6, 2020", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Ok Impala!", "publishers": "", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=2agxbyz_tvU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116127\n"}