{"name": "Super Mario RPG Revolution", "overview": "This is my attempt to balance out Super Mario RPG. For those that do know, Super Mario RPG is a pretty easy game once you master it. It's one of the few RPGs that I've played where the \"Defense\" command is almost useless because of how powerful your equipment would get after a while and the fact that damage was pretty low-end, even for the stats that you had. Also, I felt that the enemies and bosses, while having their fun gimmicks and quirks, were a step below that of the charm of the Mario & Luigi and Paper Mario (the earlier games, mind) series. This ROM hack is a way to address those issues and to refine the game to challenge players that have played and beaten the original and wanted to experience this wonderful RPG in a new light. All the enemies and bosses have had their battle scripts changed from scratch, and any old strategies that you had for the bosses the first time around WILL not work as well as you'd think. Also, characters have been re-balanced, so that any character will be useful in your set-up and that the most powerful characters (Geno & Peach for example) aren't infinitely more useful than everyone else. Equipment has been modified so that each piece of equipment will have some sort of use to you when you get it. As there is the concern that when you get something like the Lazy Shell weapon in the original, the Ultra Hammer is deemed worthless because of it being incredibly weaker. While the Lazy Shell weapon STILL is Mario's strongest weapon, it will certainly come with some consequences that will make you consider which is the best weapon. Though, for those that like to be a little dissuaded by equipment lowering your stats, there generally is going to be a benefit that will make it arguably more useful than it appears. The game also takes up the damage dealt between parties considerably more now, to accommodate for the higher stats and the fact that your characters can level up to 50! It's just my way of saying, \"Man, level 30 is a odd level to max out on. Let's raise the standard a bit.\" While you certainly will not need the higher levels to be in the game (on average, parties will typically be around Level 32~35 at the endgame), to take on the optional bosses, you're going to need all the help you can get!", "platform": "Super Nintendo Entertainment System", "release_date": "August 10, 2013", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Waddler-D", "publishers": "", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.18", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=vZYrcRfhbuQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133856\n"}