{"name": "The Legend of Zelda: A Link to the Past Redux", "overview": "“The Legend of Zelda: A Link to the Past Redux” is a fork of Conn & qwertymodo’s A Link to the Past DX hack that further modifies the game to include changes to accommodate the game into the overall franchise, as well as renaming stuff badly translated and making changes for characters with official artwork not matching with the sprites/palettes in-game. This version aims to keep consistence with the overall franchise, along with converting some of the odd palette/sprite choices that didn’t match the original artwork of the game. Some of the changes are: Change Link’s hair and hat to closely match his original artwork. Change Agahnim colours to match the original red robe and blue skin artwork. Changed Uncle’s sprite to match official artwork. Change the Flute’s name to Ocarina (I don’t know in what world that instrument is a flute). This includes in-game text and Credits name changed too. Change the Good Bee’s name to Golden Bee. Change Faerie to Fairy. This includes in-game text too. Change Pegasus Shoes to Pegasus Boots. This includes in-game text too. Change all the references of the “Wise Men” to “Sages”. Change the layout of the Ice Palace to that of the GBA port. No more going around the entire palace just to get to the next room! King of Hyrule now has a red outfit instead of green to match the rest of the franchise’s Kings of Hyrule (Like Daphnes Nohansen Hyrule from WW). As of v2.0, the Ice Palace new layout has been fixed to have 3 movable blocks in the new section. There was one movable block unused in one other Dungeon layout found in Room 240. (Why was it there?) For v5.0, the final bug (palette shared between green soldiers and King of Hyrule) has been fixed. Thanks to Conn for this! Besides the previous changes mentioned, some uncensored changes have been included too, as well as restoring some unused content. These changes focus on restoring censored content from A Link to the Past (J) and unused content for both ROMs (U and J). Some of the new content includes: Star of David for the Eastern Palace restored (From the Japanese ROM) New custom hieroglyphs to mimic those of the Japanese release. Sanctuary doorway restored Skull Statues restored. They appear in the Skull Woods Dungeon. Unused Zora sign near Zora’s Domain entrance restored. First warp point has been relocated, it no longer drops you at the very beginning of the Death Mountain, but rather at the left side of the Heart Container you obtain after your first travel to the Dark World for convenience sake. Additionally, as of version 7.0, two more existing hacks have been implemented into Redux to up the experience: Max consumables for Bombs and Arrows are now 99. New inventory GFX (Optional patch), which gives individual slots to every item, including one per bottle and the shovel is handled as a separate item. Ocarina and Golden Bee names have been fixed manually for this release too. And for v7.5 and v8.0, thanks to RH user rainponcho, the bug with the Bunny palette and also the glitch with the LR Item switch for New GFX have been both fixed as well! Thank you so much, rainponcho! Please refer to the A Link to the Past DX hack page by qwertymodo and Conn for more information on additional ASM changes over the original A Link to the Past (including L/R Item Switch).", "platform": "Super Nintendo Entertainment System", "release_date": "May 25, 2017", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "ShadowOne333", "publishers": "", "genres": "Adventure", "max_players": "", "cooperative": "No", "rating": "4.14", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129938\n"}