{"name": "Xalabaias Adventure", "overview": "Pai Troll, um Youtuber e Streamer bem conhecido, estava prestes a começar uma nova transmissão ao vivo. Mas ele percebe que sua câmera havia sumido! Enquanto a procurava pelo quarto, uma mensagem aparece no seu computador. Era um hacker que roubou sua câmera como vingança por ter “tratado mal dela”. Pai Troll decide ir atrás do hacker, entrando em seu computador e passando por todos seus jogos instalados para acessar a internet e conseguir ir ao Japão, a sede da empresa Kanon! A hack possui duas finalizações, que dependem de ter acionado todos os 4 switches. A finalização boa inclui um chefe extra, o verdadeiro vilão! Contem modificações em ASM, novos inimigos, uso de todos os 8 modos gráficos do SNES, versão em inglês e mais. ;) ---------------------- Pai Troll, a well-known Youtuber and Streamer, was about to start a new live stream. But he realizes his camera is gone! While searching on his room, a message appears on his computer. It was a hacker who stole his camera in revenge for \"mistreating her\". Pai Troll decides to go after the hacker, logging into his computer and going through all his installed games to access the internet and be able to go to Japan, the headquarters of the Kanon company! The hack has two endings, which depend on having triggered all 4 switches. The good ending includes an extra boss, the real villain! Contains ASM modifications, new enemies, use of all 8 SNES background modes, English version and more. ;)", "platform": "Super Nintendo Entertainment System", "release_date": "December 15, 2019", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "Clay Cowgill", "publishers": "hack (Clay Cowgill)", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/128831\n"}