{"name": "XBAND", "overview": "XBAND was one of the first competitive online console gaming networks and was available for the Genesis and Super NES systems. It was produced by Catapult Entertainment, a Cupertino, California-based software company. It is the only modem released in America to have been officially licensed by Nintendo. It debuted in various areas of the United States in late 1994 and 1995. History: The Genesis version of the XBAND was released in November 1994, with the Super NES version following in June 1995, and the Super Famicom version in April 1996. The Genesis version also works with the Genesis Nomad. In Brazil the Mega Drive service was released as the Mega Net 2, named after the Sega Meganet. In 1995, Catapult Entertainment signed a deal with General Instrument, producers of the Sega Channel, which stipulated that the XBAND modem would henceforth be built into new Sega Channel adapters, and that the top 5 to 10 games offered by Sega Channel each month would be wired for play over XBAND. Initially, Catapult Entertainment had a limited staff and virtually no advertising. By January 1997, XBAND network playability had reached practically every metropolitan area and several rural areas in the U.S. The actual XBAND modems were carried by a handful of software and video rental chains across the United States. Internationally, the XBAND saw some limited expansion in the Japanese market, and Catapult was working on PC- and Sega Saturn-based versions of the platform, though they merged with Mpath Interactive, and the focus shifted to the online PC gaming service, Mplayer.com (Mplayer.com was taken offline and integrated into GameSpy Arcade in 2001, after acquired by GameSpy on December 2000). Service: The concept of playing online was fairly new at the time. Arcades were still quite popular, and online gaming was not yet a household idea. The XBAND modem was widely available at Blockbuster Video branches during its time. It retailed for $19.99, with additional charges based on usage. Two pricing plans were available. One had a monthly fee of $4.95 and allowed the user to connect to the service up to 50 times a month with each additional connection costing 15 cents. The other had a monthly fee of $9.95 and granted the subscriber an unlimited number of connections per month. Activities that consumed a player's monthly allowance of connections included dialing into the XBAND service for matchmaking, downloading mail (called \"XMAIL\"), and downloading the daily edition of the two XBAND newsletters, one containing generic news and the other containing platform-specific information such as leaderboards and contest announcements. Players were also assessed a fee of $3.95/hour for connecting to opponents outside their local calling area; player-to-player connections inside their local calling area were free. The modem features built-in storage for up to four users (\"codenames\"). It stores user friend lists, which can contain the codenames of up to ten of the user's friends; the users' XMAIL boxes, storing up to ten incoming and ten outgoing messages for each user; the users' rankings, win/loss records, and accumulated scores; a short profile section; and the user's avatar (chosen from 40 preset avatars). Text entry is done either through an on-screen keyboard or an optional XBAND keyboard add-on ($29.95 MSRP) released later in the network's lifespan. The client-side system worked by manipulating the game's memory in a way similar to Game Genie and third-party computer game modifications such as Multi Theft Auto. A problem of most online services of the time was that the connection would be lost whenever a phone on the same line was picked up. The XBand operating system was designed to ensure that connections are not lost due to phone activity; in the case of call waiting, the system would alert the user to the call and allow the game to be resumed. XBAND had an official website where a member could check any other player's statistics, along with other information and updates that were not available to view on consoles. At its height, XBAND had 15,000 subscribed members. Gaming: A 1995 article in Next Generation stated that the XBAND modem's \"ultra-low latency is the key to its successful handling of realtime videogaming\". The modem's data transfer rate was 2,400 bits per second, which, while low compared to PC modems of the time, was sufficient to handle the simple one-on-one games which XBAND was used with. When connecting to play, unless a player specified a particular user from their friend list, players would be matched with a random player elsewhere in the country (or the player's local area code depending on their preference settings) who was also connecting to play the same game. The server would attempt to match players of like skill levels, using the Elo rating system. When the network matched two players up, the newly-connected player's XBAND modem would disconnect from the server and dial the other player, whose own XBAND modem would answer when the phone rang. At that point the players would see the XBAND logo slide together, followed by the matchup screen, which displayed each player's codenames, avatars, locations, and a pre-typed \"taunt\". In December 1995 XBAND launched its first national tournament. This was the first modem to modem tournament ever to be held over a console. The grand prize winner received a special Genghis Khan icon for their XBAND profile and a $200 cash prize from Catapult. Peter Kappes aka \"SphiNX\" of Orlando, FL became the first person in history to win a modem to modem national tournament over a console.", "platform": "Super Nintendo Entertainment System", "release_date": "November 1, 1994", "game_type": "Released", "esrb": "", "developers": "Catapult Entertainment", "publishers": "Catapult Entertainment", "genres": "", "max_players": "", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/XBAND", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133742\n"}