{"name": "Zelda no Densetsu BS: Inishie no Sekiban", "overview": "The events of Ancient Stone Tablets occur a mere six years after the destruction of Ganon by the hero, Link in A Link to the Past. Hyrule is enjoying a time of peace and tranquility, but Princess Zelda suffers from a dark, recurring dream showing a shadow over a temple; a premonition of evil to come. One day, she witnesses a mysterious and brilliant light in the sky to the east. Aginah, the younger brother of the wise man Sahasrahla and now living in his old hideout near the Eastern Palace also witnesses such a light, and travels to investigate. There he finds a strange youth lying on the ground. Zelda, also following the light, meets up with Aginah, and they both carry the child to rest in Sahasrahla's hideout. Confused by the youth's unusual clothes, they believe the child not to hail from Kakariko Village. Speaking to Aginah while the youngster sleeps, Zelda learns that his brother Sahasrahla had also sensed danger surrounding Hyrule and had left the land to find the hero, Link. While Link has not yet returned, Zelda senses that if this new youth was endowed with courage, he or she may be the Hero of Light.Ancient Stone Tablets is different from most other Zelda games as the game's central heroes are actually the avatars of the player's ID for the BS-X Broadcasting System, drawn into Hyrule, which is also true for BS The Legend of Zelda. The difference being that this time the player does not take the place of Link, but takes part in a new tale set after the events of A Link to the Past. The male character wears a green tunic.", "platform": "Super Nintendo Entertainment System", "release_date": "March 30, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.44", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/33272\n"}