{"altername_name": [], "name": "Custom Mate", "overview": "A young man finds a mysterious box. Making sure no one is at home, he opens the box and finds a scroll with a magic incantation inside. He chants the magic spell - and immediately a cute female elf appears. She says she can create any girl the hero wants. But once the girl is created, he has to figure out how to win her good graces... Custom Mate can be called a \"seduction simulator\". Lacking the adventure elements of Cocktail's most famous series, Can Can Bunny, Custom Mate offers much deeper simulation gameplay instead. In the beginning of the game, the player effectively \"creates\" the girl he will need to seduce; it is possible to choose age, height, breast size, hair style, and personality. Mixing all these parameters results in different girls who require different approach. For example, an older, experienced and direct woman might appreciate physical stimulation (kissing etc.), while a young shy girl needs to talk more before the hero can afford any straight-forward actions. The gameplay is menu-driven - the player can choose to talk, to ask, to look, to touch, to kiss, and to take off the girl's clothes. Choosing one of these actions usually leads to a sub-menu, which varies depending on the girl and the current situation. For example, the \"talk\" menu usually brings a large sub-menu of more precise actions (\"praise\", \"order\", \"beg\", etc.), each of which opens new sub-menus. Similarly, physical interaction can also become quite detailed: the \"kiss\" command opens a sub-menu (\"lick\", \"bite\", etc.). Physical interaction is made more precise by implementing a point-and-click interface; in many cases, choosing the exact body part to interact with can be a matter of \"life and death\", since it is possible to make a girl very angry, which might lead to a Game Over.", "platform": "NEC PC-9801", "release_date": "September 17, 1993", "game_type": "Released", "esrb": "", "developers": "Cocktail Soft", "publishers": "Cocktail Soft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133283-custom-mate\n"}