{"altername_name": [], "name": "Custom Mate 3", "overview": "It's Christmas. Hayashi Ryuusuke is walking through the crowded city, feeling sad that he is alone on such a day. Suddenly, he spots a neon sign: Custom Mate. He enters and sees a strange receptionist with elf-like ears and a magic symbol on the forehead. She creates the girl of his dreams and they get married! But this is just the beginning, and Ryuusuke realizes that marriage is not all about the honeymoon... The third Custom Mate game differs from its predecessors by offering much deeper simulation gameplay, which includes different aspects of the life of a married couple beside just sex. In the beginning, the player creates the protagonist, choosing his age, blood type, and personality. The future wife is created the same way. Unlike the previous games, it is impossible to change appearance and physical aspects of the girl; however, there are many more personality traits. After the honeymoon, the couple returns to daily routine. The player can make daily or monthly schedule. The wife's behavior is determined by character creation, but also by the choices the player makes. The wife would often ask questions, make suggestions, etc.; the player's reaction determines future interactions and the overall development of the relationship. The couple has various parameters, from love level to monetary wealth. Sex interaction plays an important role; the player should choose the right actions, depending on the wife's personality, otherwise the relationship will deteriorate. Menu-based interface is utilized for most of the game, but the actual sex interaction is done in point-and-click fashion, with action icons.", "platform": "NEC PC-9801", "release_date": "December 8, 1995", "game_type": "Released", "esrb": "", "developers": "Cocktail Soft", "publishers": "Cocktail Soft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133282-custom-mate-3\n"}