{"altername_name": ["Daraku no Kuni no Angie: Kyoukai no Mesudorei Tachi"], "name": "Daraku no Kuni no Angie", "overview": "Angie and Ruby are two ordinary young girls: they like spending time together, talking about fashion, men, and all the usual stuff. But one day, they see a very strange man - dressed in a rabbit costume, with a gigantic erected penis... The two girls try to flee, but instead end up in an alternate dimension - a bizarre world called Decadence Land. This world is populated by grotesque characters with only sex in mind. Now Angie and Ruby have to figure out a way to escape from this dangerous world and to return home... Daraku no Kuni no Angie is an adventure/RPG hybrid. Movement on the top-down map of Decadence Land is done by clicking on a location icon. The plot is advanced when the player chooses a correct action, unlocking new locations. However, some actions can only be performed when certain items are acquired. Both girls have RPG-like statistics, including a health bar and a \"perversity level\", which corresponds to normal levels in traditional RPGs. There are also more precise statistics which refer to particular sexual parameters and activities (such as \"anal level\", \"vagina stamina\", etc.). When the girls are moving on the world map, random encounters with the weird inhabitants of Decadence Land can occur. Agreeing to participate in sexual activities with these inhabitants decreases the girls' HP, but grants them experience points that raises their \"perversity level\", and with it increases other parameters, that will allow the girls to participate in more dangerous sexual exercises without dying.", "platform": "NEC PC-9801", "release_date": "April 19, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "PIL", "publishers": "PIL", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137110-daraku-no-kuni-no-angie\n"}