{"altername_name": ["Delfoi no Shintaku"], "name": "Delphi no Shintaku", "overview": "The Oracle of Delphi was the ultimate place of wisdom, the home of the Seven Great Wisemen of Greece, known for the famous aphorisms inscribed on its temple's walls (such as \"know thyself\"). Indeed, only the wisest of men can be worthy of learning his fate from the Oracle. A young prince from Babylon has to travel through the world of the Hellenist era, meeting wise people and accumulating knowledge, which is a precious treasure and a powerful weapon... Delphi no Shintaku is a game that combines elements from different genres. The structure of the story mode resembles Western 3rd person point-and-click adventures. The player navigates the young hero through the cities of Greece and their surroundings by clicking on the appropriate place on the screen, being able to move in all directions. Each city typically consists of several screens, including famous landmarks (such as the Colossus on Rhodos). Dialogue icon is displayed when a conversation with a character is possible. However, the actual challenge of the game lies in participating in quiz \"battles\" against the game's characters. Many characters will suggest to test the hero's knowledge, and in order to advance in the game, the player must agree and complete their quiz. A quiz usually contains two or more timed questions. The player has to quickly choose the correct one of the four available answers. When a quiz is complete, the player receives items needed to make progress in the game. The quiz questions belong to diverse topics, from classical literature to video game trivia. Beside the story mode, there are also many other \"lesser\" modes, which can be considered mini-games. Some of them are various types of quiz - timed, competing against computer (or another player), game show-like tournament, etc. Others are mind games, which include finding differences between two pictures and arranging pieces of a puzzle.", "platform": "NEC PC-9801", "release_date": "March 25, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137118-delphi-no-shintaku\n"}