{"altername_name": ["Cybernetic Hi-School Part 2: Highway Buster", "Denno Gakuen 2"], "name": "Dennou Gakuen II: Highway Buster!!", "overview": "Something strange is afoot in town. A midnight rider is assaulting drivers on the highway, bombarding them with tricky quiz questions. If the driver can't answer the questions, he and his car is blown up. Out of fear of the so-called Highway Buster, people dare no longer use the highways. As a student at the Cybernetic Hi-School, the player is given the task by the headmaster of finding out who the Highway Buster is, and ultimately defeat him. The game is a minimalistic adventure game, where the player goes around the campus and town using seven commands. Talking to people advances the plot, though the player have no input on what to say, merely receiving what others tell them. Their first task to get on with the case is to get a vehicle, which they are lent by the headmaster. Before they can leave school grounds, though, they must pass a test to get a driving permit. This is where the other main part of the game commences. Cybernetic Hi-School is not only an adventure game, but also a strip-quiz game, which is slightly novel compared to the more common strip poker and strip mahjongg games. If the player gives the right answers to the driving knowledge test conducted by the female police officer, she will strip for them (for reasons unknown). When she is naked, the player will get their permit, and can leave the premises to find the leader of the school's touring club, who they must also beat in a quiz to see her naked and acquire the driving techniques they will need to beat the Highway Buster. All questions in the game are driving related, although they later on stray from the more mundane legal paragraphs to about car and bike related pop culture trivia.", "platform": "NEC PC-9801", "release_date": "December 10, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Gainax", "publishers": "Gainax", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129043-dennou-gakuen-ii-highway-buster\n"}