{"altername_name": ["Oranda Tsuma wa Denki Unagi no Yume o Miru ka?"], "name": "Do Dutchwives Dream of Electric Eel", "overview": "The title (translated as Do Dutchwives Dream of Electric Eel?, an obvious humorous allusion to Philip K. Dick's novel Do Androids Dream of Electric Sheep?) refers to a product of Japanese sex doll industry commonly known as \"dutchwives\". One of such sex dolls has been stolen, and the Oranda Corporation hires a private investigator to retrieve it. The second entry in Koei's self-proclaimed \"Strawberry Porno\" series (following Danchi-zuma no Yūwaku) has certain similarities to its predecessor in interface and overall concept. However, it is a much more open-ended game with emphasis on gradual exploration and interaction, which gives it a definite role-playing flavor in addition to basic adventure-like gameplay. Like in the preceding game, the player character is generated by stopping rapidly revolving counters assigned to individual parameters. These parameters influence the chance of success in subsequent encounters with women, though much of it is calculated randomly. The player area is a fairly vast top-down urban environment consisting of numerous interconnected screens, which are mapped as the player explores them. The streets are populated by various types of NPCs. These include young women who would sleep with the main character for money, yakuza thugs who would attack if provoked, policemen, etc. These characters are randomly generated. The map also includes various locations such as several love hotels, adult shops, fast food restaurants, phone booths and police stations. The protagonist can spend money on various items sold in these establishments, bring women to love hotels, or try his luck with hostesses. The ultimate goal of finding the missing sex doll can be achieved by acquiring a few key items and finding the right NPCs among many others. The interaction on the streets consists of inputting the key-bound commands Look, Transact, Attack, Present, and Rape. The latter command can be used on certain types of women on the streets (provided there are no witnesses) and leads to the so-called \"Fuck Mode\", which can also be brought forth by having consensual sex with hookers or indoor female characters. This mode features a few sex-related commands. In addition, indoor locations have their own set of commands bound to function keys. These include making a phone call, various types of conversation (nice, normal, aggressive, etc.), attacking, attempting to have sex, etc. Attacking usually leads to a separate first-person combat screen. Combat is turn-based and has its own set of commands (attack with weapon, attack with bare hands, etc.). There are no experience points awarded, but the protagonist's hit points decrease when the enemy manages to damage him.", "platform": "NEC PC-9801", "release_date": "November 1, 1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Koei", "publishers": "Koei", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149468-do-dutchwives-dream-of-electric-eel\n"}