{"altername_name": [], "name": "Ekudorado: Kagami no Naka no Oukoku", "overview": "A young high-school student named Seirou has a normal, boring life: days resemble each other, and so do the nights: every night he sees the same strange dream: two girls talking to each other, one of them saying something about a coming darkness... One day, he and his female classmates find a mirror in an abandoned house; when they touch the mirror, they are transported into the magical medieval land of Ekudorado. The hero must first find his classmates, who are scattered around this world, and then find a way to return to our reality... Ekudorado is a mixture of card-based strategy and role-playing. The interaction in \"friendly\" areas (towns etc.) is done in Japanese adventure fashion; however, in order to access them, the player has to move the hero on a linear path composed of dots; each dot represents an enemy encounter. The battles follow a rather complex set of card game rules. At each turn, the player is dealt a deck of five cards. There are three kinds of cards: Law, Neutral, and Chaos, and six categories: Black, White, Fire, Earth, Water, and Wind. Each card stands for a unique type of action; for example, a Light Law card restores HP, a Fire Neutral card attacks the enemy with fire, etc. It is also possible to use combination of cards (up to three at a time), which leads to various results (for example, paralyzing the enemy while healing the hero). Even though other characters join the hero, it is possible to use only one character with one deck of cards per battle. The RPG angle is present in character-building system: the hero gains experience points and levels up. Each time the player is given a certain amount of points to increase the hero's strength in the six elemental categories (Black, White, etc.). The game has scenes with nudity and explicit sexual content.", "platform": "NEC PC-9801", "release_date": "1997", "game_type": "Released", "esrb": "", "developers": "Black Package", "publishers": "Black Package", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/139765-ekudorado-kagami-no-naka-no-oukoku\n"}