{"altername_name": [], "name": "Elemental Ou", "overview": "The Guild Master and the Protectors of the Elements had the best intentions. All they wanted was to use the Grand Card in order to summon the Grand Master who would protect the world, just like the legends said. Surely they could not predict would would happen. That the Grand Master would be a sexy, but decidedly unfriendly girl. That she would quickly realize that she wields the power over all Elves. That she would kill all the Protectors. And that she would swear to destroy humanity... Only one person can stop the Grand Master. A simple young human boy named Nemo, but with mysterious ties to the race of Elves. When his father is killed by the Grand Master's minions, he knows that it's not just about saving humanity - it gets personal!... Elemental Ō (\"Elemental King\") is an RPG with several distinct features. For once, there are no random or regular battles - Nemo can freely roam the vast overworld map without fear of being attacked. Navigation is done in top-down fashion, while battles are viewed from first-person perspective. The pre-set battles (mostly against female elves) take place on a separate screen, and utilize a card system. Nemo can buy (or acquire from treasure chests or from other characters) cards, which stand for weapons, armor, magical spells, and items usually used in RPGs. Cards have their own elemental properties, so when choosing cards in battle, the player should pay close attention to the elements of the opponent's cards. It is also possible to fuse two or more cards into a more powerful one by using special cards. The game is controlled entirely with the mouse. Like many other Japanese DOS games, Elemental Ō contains nudity and sexual situations.", "platform": "NEC PC-9801", "release_date": "June 17, 1994", "game_type": "Released", "esrb": "", "developers": "Apple Pie", "publishers": "Apple Pie", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137138-elemental-ou\n"}