{"altername_name": ["First Queen IV: Barcia Senki"], "name": "First Queen IV", "overview": "The land of Logris was originally inhabited by elves, dwarves, and other magical creatures. When the humans arrived, the cultural differences between the races were not enough to provoke a war, so for a while they co-existed peacefully. Afterwards, the humans have split into several smaller nations. The nation of Barcia in the north had a small population, and its king Zenel was worried his country will be conquered by others. To prevent that, he invited the dark magician Zon, who cast a spell over his soldiers. But nothing comes without a price. Insanity seized the king and its army. Barcia began invading other countries. A warrior named Ares and his friends try to assassinate the king, but as a result, Ares is thrown in prison. A mysterious man with magical powers saves Ares, telling him that it's time to sort out the differences between nations and races, and lead an army to stop the madness of Barcia... The fourth entry in First Queen series utilizes the trademark \"mixed-up characters\" battle system, with dozens of characters on both sides fighting each other in real time. The game features a new point-and-click interface, with battle tactics accessible at any moment from the battle screen. It is also possible to focus attacks on an enemy simply by clicking on him with the mouse. Compared to the previous entries, First Queen IV emphasizes the war game aspect, with less focus on RPG-like exploration and more strategic challenge. The movement on the map has grown into an important gameplay device: different armies move simultaneously, and the player has to pay attention for enemy forces advancing to different locations. It is possible to split units, create new ones, exchange soldiers, and send different units to different locations. An enemy army may join forces with the heroes upon defeat; diplomacy can also be used to make agreements with sovereign city-states. Once a location is clear of enemies, it is possible to \"camp\" and to direct other actions from there.", "platform": "NEC PC-9801", "release_date": "1994", "game_type": "Released", "esrb": "", "developers": "Kure Software Koubou", "publishers": "Kure Software Koubou", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133343-first-queen-iv\n"}