{"altername_name": [], "name": "First Queen", "overview": "The land of Logris is home to many races and nations: humans, elves, dwarves, centaurs, and others. It is divided into many small kingdoms, different nations trying to live in peace with each other. But the queen of Ornic, one of these nations, had plans of her own. She sent her troops to the south, invading the kingdom of elves. The army of Ornic started conquering one country after the other. The king and queen of Cardic, a powerful country in the south, decided to stop the madness, sending their soldiers, under the commands of general Richmond, to find allies wherever possible and to defeat the army of Ornic. First Queen is a mixture of RPG and strategy game with real-time combat. In a RPG fashion, the party of heroes roams the world, fighting enemies, buying items, and leveling up. However, the focus of the game is shifted towards recruiting soldiers and fighting against whole armies. The player-controlled unit may contain a dozen or more characters, and it is also possible to build more than one, making the player-controlled group more similar to an army than to a standard RPG-type party. Like the earlier Silver Ghost by the same developer, the game utilizes the so-called gocha-kyara (\"mixed-up characters\") combat system, which they later employed in several other games. The player is able to control only one character at a time; the others act according to the computer AI. Attacking an enemy is a matter of simply bumping into him. This system allows for large-scale battles, with the characters sometimes filling the entire screen, creating the \"mixed-up\" impression.", "platform": "NEC PC-9801", "release_date": "1988", "game_type": "Released", "esrb": "", "developers": "Kure Software Koubou", "publishers": "Kure Software Koubou", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133339-first-queen\n"}