{"altername_name": ["Gakuen King: Hidehiko Gakkō o Tsukuru"], "name": "Gakuen King: Hidehiko Gakkou o Tsukuru", "overview": "In the year 30 of the Meiji era in Japan (end of 19th century), a powerful family of Japanese oligarchs (zaibatsu) known as \"Amatsukami\" has constructed an artificial island and ruled over it, basically creating a state within a state. They had high hopes of building the \"Japan of the future\" and educating the young ones: the central place on the island was dedicated to a high school. But years have passed, and the youngsters rebelled against the oligarchs. Chaos reigned on the island, and even terrorist attacks were not uncommon. Amatsukami Hidehiko, the last (and youngest) of the oligarchs, decides to change the way of things. Using his charisma, but also more violent tactics, he goes to the troubled school to deal personally with anyone who dares oppose him. Gakuen King is a peculiar mixture of typical Japanese RPG with random turn-based battles, strategy elements (recruiting students to join Hidehiko's army), and adventure elements (\"search\" command, finding and manipulating items), with extended sex scenes that have Japanese adventure-style menu-based interaction. The basic gameplay is that of a top-down RPG: Hidehiko walks around, fights random enemies, levels up, etc. The combat system is rather basic: Hidehiko's party (or, better to say, army) is treated like a single character - the player is only able to give general commands (attack, use special powers, retreat, etc.), after which the battle unfolds automatically. That is why the player also has to focus on adventure-like exploration to solve problems and overcome obstacles, as well as constantly enlarging the army to become stronger.", "platform": "NEC PC-9801", "release_date": "June 7, 1996", "game_type": "Released", "esrb": "", "developers": "Alice Soft", "publishers": "Alice Soft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133676-gakuen-king-hidehiko-gakkou-o-tsukuru\n"}