{"altername_name": ["GaoGao! 2nd Pandora Wood"], "name": "GaoGao! 2nd: Pandora no Mori", "overview": "A biological experiment that began in 1993 led to a terrible disaster in the beginning of 21st century. A virus that turned living beings into mutants and monsters has been unleashed. Soon the Earth turned into a terrifying place of chaos, as more and more human beings became infected. Unspeakable violence obliterated human civilization. Within a few years, humanity was on the verge of total annihilation. The Era of Darkness began. But not all hope was lost. Humans began building cities known as \"Domes\", isolated from the wilderness, protected by glass from all sides, cut from natural resources. It was possible to start building civilization anew. On one fateful day, the famous scientist couple Mizuhara were killed in what looked like an accident. Their project, which showed new ways of fighting the virus, descended into the grave with them. Their two children were separated and for a long time were unaware of their origins. But the wheels of destiny keep spinning, as the young Mizuhara is about to discover the truth about his parents, and perhaps bring new hope to humanity... Pandora no Mori is seemingly unrelated story-wise to the first GaoGao game; however, as the story advances, common themes and even recurring characters become apparent. From the point of view of gameplay, Pandora no Mori plays just like its predecessor: it is a Japanese adventure without puzzles, with traditional menu commands (\"Look\", \"Talk\", etc.) and object sub-menus. As the first game, it contains scenes with adult content.", "platform": "NEC PC-9801", "release_date": "April 8, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Four Nine", "publishers": "Four Nine", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137222-gaogao-2nd-pandora-no-mori\n"}