{"altername_name": ["Genesis"], "name": "Genesis: Beyond the Revelation", "overview": "A series of devastating wars and economic disasters influenced the Earth's atmosphere. Various types of energy were released, and as a result the planet's continents began to change shapes. The ensuing cataclysm deformed the Earth's surface, and it changed beyond recognition. Most of the planet turned into a desert. But humanity survived. Humans built new cities in the wilderness, and new organizations emerged. Surviving in this world will be anything but easy... Genesis is an early RPG by Square, which is still much more heavily influenced by the leading Ultima template of the time than their later famous work, Final Fantasy. With the exception of the original post-apocalyptic theme and a few original gameplay elements, the game looks, feels, and plays very similarly to early Ultimas. In the beginning of the game the player has to create and name the protagonist. Four classes are available: Soldier, an all-purpose fighter type; Karateka, specialist in unarmed combat; Esper, who relies on psychic forces; and Doctor, who focuses on healing. The player can freely allocate points into the four available character attributes: Strength, Duration (Endurance), Dexterity, and IQ. Afterwards, the player is thrown into the game world. Gameplay process is non-linear; rather than following a narrative with scripted events, the player explores the world and travels to its locations in any order. Interaction with the world is performed with menu commands such as \"Attack\", \"Enter\" (a location represented on the map as an icon), \"Transaction\", etc. Enemies are visibly roaming the world map; a contact with any of them leads to a separate small isometric battle screen, on which the playable character can freely move, attack physically, or use psychic powers in turn-based fashion.", "platform": "NEC PC-9801", "release_date": "1985", "game_type": "Released", "esrb": "Not Rated", "developers": "Square", "publishers": "Square", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133761-genesis-beyond-the-revelation\n"}