{"altername_name": ["Ginga Eiyū Densetsu III", "Ginga Eiyu Densetsu 3"], "name": "Ginga Eiyuu Densetsu III", "overview": "The third game in the series based on the anime adaptation of Yoshiki Tanaka's Legend of the Galactic Heroes science fiction novels. The novels (and the games) are set in a futuristic world, where humanity has conquered the entire Milky Way and split into two powerful warring states, each encompassing different systems and planets: the Galactic Empire (modeled after Bismarck's 19th century Prussia), and the democratic Free Planets Alliance. The third installment enhances the traditional gameplay of the series in significant ways. Instead of having the player focus entirely on space combat, Ginga Eiyū Densetsu III puts him in the role of either Imperial or Alliance top general, who has to lead the war from the beginning to the end. Instead of choosing one of the different scenarios, the player first chooses the side (either Empire or Alliance), and the scenarios play out as created by the player during the gameplay. The player oversees a map of an entire galaxy and can choose to conquer (or protect) any of the planets, recruit and fire generals, manage space ship production, deployment, weaponry, etc. Whenever there is a conflicting interest in a star system, the player is warned by an advisor. He then chooses to avoid the battle or engage the enemy. From that point on, the game plays similarly to its predecessors: the player moves the assigned units over the top-down battle space, engaging enemies in combat, which is automatic and is displayed as animated scenes.", "platform": "NEC PC-9801", "release_date": "November 6, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Bothtec", "publishers": "Bothtec", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133348-ginga-eiyuu-densetsu-iii\n"}