{"altername_name": [], "name": "Half-Pipe", "overview": "In the year 199X, a huge meteorite collided with the Earth. The consequences exceeded every disaster seen before. Even long after the collision, due to the distortion of gravity, volcano eruptions, earthquakes, and other disasters continued to occur. Civilization has shrunk into small cities spread across vast wasteland. The level of violence has raised beyond the imaginable. In such a terrible world, the 18-year-old musician named Damian has to earn his living by playing piano in a bar in the city of Gunu. One day, something falls on the Earth right in front of him - this \"something\" being a girl named Nicole, who apparently arrived from the mysterious meteorite. The first task assigned to the hero, if you haven't guessed it, is to get Nicole some clothes. Naturally, this soon develops into a much more sinister story musicians usually don't get involved into... Half-Pipe differs from traditional Japanese RPGs in several aspects. Even though there is a party (up to four people), during combat the player has to choose one character at a time. Most of the battles are random, but there are many that can be triggered by talking to a character. The battles are turn-based and are viewed from first-person perspective. Damian is controlled by the player, while the other three (all girls) are controlled by the AI. Only when Damian's HP reaches zero, the game is over. Damian can use a variety of attacks (punches, kicks, etc.). There are no weapons or armor in the game. Even though there is an overworld map heroes can travel on, much of the action happen in the large cities, which take time to explore. Female characters disrobe when defeated in combat, and there are plot-related cutscenes with explicit sexual situations.", "platform": "NEC PC-9801", "release_date": "September 29, 1993", "game_type": "Released", "esrb": "", "developers": "Aypio", "publishers": "Aypio", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137280-half-pipe\n"}