{"altername_name": [], "name": "Halfmoon ni Kawaru Made", "overview": "The game is based on the manga Half Moon ni Kawaru made by Ryo Ramiya. It contains four separate stories/games, which can also be defined as mini-games due to their short length. Each story contained is dedicated to a different heroine: Suzuka and her boyfriend escape from ninjas; they are ambushed by amazon warriors and get separated. Suzuka finds herself in a weird mansion overrun by monsters, and must fight her way with a sword. This game is an adventure with top-down movement; the goal is to find the way through the maze-like locations. There are also pre-set turn-based battles - Suzuka can choose between various techniques to defeat the foes. There is no RPG system of any kind. The sex scenes include grotesque encounters with monsters. Eve is a saleswoman in a large company that sells items for skin care and make-up. She has to explore the neighborhood and to convince customers to buy their products. This story plays like a standard Japanese adventure with first-person view and menu-based commands. The sexual content here is mostly of lesbian nature. The protagonist in this story is the \"hero\" of the entire game (default name Tatsuya); he offers his services to Selena, the queen of the medieval Rabbi-Rabbi kingdom. Evil bunnies are disturbing the peace in the country side, and the hero, aided by the lovely girl Nina, has to get rid of them and bring back the carrots. This is an action game, with bunnies popping out of holes in different stages, and the player character hitting them on the heads using various items (such as a house shoe). The shortest game tells the story of Titis, a lovely mermaid who dreams of marrying a human prince. In search for the love of her life, Titis gets to know the world of humans through a series of sexual encounters. This game is once again a typical Japanese adventure with menu-based commands and no movement of any kind (the player switches locations automatically, as dictated by the story).", "platform": "NEC PC-9801", "release_date": "April 28, 1994", "game_type": "Released", "esrb": "", "developers": "Cocktail Soft", "publishers": "Cocktail Soft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137279-halfmoon-ni-kawaru-made\n"}