{"altername_name": [], "name": "Hamlet", "overview": "What does the story of this game have to do with Shakespeare's famous masterpiece? Absolutely nothing. The word \"hamlet\" is used here in its original meaning, \"little village\". This was the (somewhat ironic) name that was given to a massive project, which started in the 1980-ies yet was first accomplished in the second decade of the 21th century: a research laboratory built on the surface of the Moon. By the middle of the century, Hamlet become one of the most important industrial centers in the world. It manufactured food, medicine, vehicles, and above all - high-technology weapons. Until one day, the contact between the Earth and Hamlet was broken. Suddenly, Hamlet was cut from the rest of the world. The owners of the station send a team of six highly trained agents, piloting advanced giant robots (\"mechs\"), led by Conrad V. Eibol (codename \"Boss\"). The mission: enter Hamlet's facilities and find out what happened. When the heroes arrive, they find the first level completely abandoned... except a few mechanisms which have seemingly gone berserk. The youngest of the team, simply addressed as \"Kid\", is sent to explore the lower level, maintaining communication with the others over the radio. Hamlet is a first-person perspective game, set in the huge 3D maze-like eponymous facility. The auto-map is always visible, showing the player the character's position. Enemies and important objects are also visible on the radar. Whenever an enemy approaches, the playable robot is unable to move. The shooting is actually done in turn-based style; the player can only shoot once the robot's attack meter has filled up, and the rate of shooting depends on the robot's (or enemy's) agility. However, the game doesn't pause when the shooting occurs, creating the illusion of real-time combat. Though the game looks like a first-person shooter, it is, in its core, an RPG. Player-controlled robot receives experience and levels up after having defeated certain amounts of enemies. Attack, defense, speed, etc. get increased with each level up. It is possible to find and equip various kinds of weapons: a basic gun with infinite ammo, but low damage; powerful rocket launchers which cause high damage, yet have limited ammunition, etc. Two weapons can be equipped in each hand, and the player can switch between them during combat. Shields can also be found and equipped. Weapon energy, body (\"health\"), and shield energy can be restored with appropriate items. An updated version of the game (with enhanced graphics and view angles) was later released in The West under the name Space Griffon VF-9.", "platform": "NEC PC-9801", "release_date": "November 19, 1993", "game_type": "Released", "esrb": "", "developers": "Panther Software", "publishers": "Panther Software", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137281-hamlet\n"}