{"altername_name": [], "name": "Hiouden", "overview": "The country ruled by the king MacIntyre is attacked by king Macaulay and his underlings. The land is burning, and the castle is under attack. The guards convince the young prince Richard to escape. But as he steps out of the castle, he encounters a mysterious dryad named Beatrix. The dryad tells him that there is one way to save the kingdom. A powerful ring can turn all the monster statues in the castle to real monsters. But to be able to do that, Richard must be cursed. The young prince doesn't hesitate. Very soon, he leads the army of monsters into battle, unaware of the price he will have to pay for that... Hiōden is a strategy game with RPG elements. The player navigates several teams of characters, mostly monsters (up to six in each team) through isometric environments. Sometimes cooperation between different player-controlled teams is required to advance. The game plays in real time, i.e. enemy parties also move and perform actions without waiting for player's input. The RPG angle is present in form of character levels - characters grow stronger after defeating enemies. It is possible to put the teams on \"auto-mode\", having some of them move and perform actions on their own. The game has a mouse-driven interface with a somewhat unusual feature for its time: windows. The movement field of different teams, character statistics, overview map, team management screen - everything has its own window. It is possible to enlarge any window to full screen, close it, open several small windows at the same time, and drag windows to arrange them on the screen in any way.", "platform": "NEC PC-9801", "release_date": "June 26, 1992", "game_type": "Released", "esrb": "", "developers": "Wolf Team", "publishers": "Wolf Team", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137288-hiouden\n"}