{"altername_name": [], "name": "Image II", "overview": "Like its predecessor, Image II consists of three episodes, which are unrelated to each other story-wise and can be accessed from the main menu; each episode can be played in two different ways (\"scenarios\"). All the three episodes are set in medieval/fantasy environment. The first episode tells of a \"cursed\" treasure room somewhere on the outskirts of a town; the only one brave enough to venture there is a young hero named Recardo. In scenario A, Recardo has to find a way to defeat a demon, using objects from the treasure room; in scenario B, he has to face a female demonic creature and seduce her without getting killed in the process. Scenario A has a large turn-based battle that can be lost; the key to winning is usage of items. The second episode stars the fighter Rush and his female companion Femir; traveling across the desert, they enter a town, and Rush decides to participate in a fighter competition. This episode differs from the other ones (and most other Japanese-style adventures) by having free movement in top-down environment. Scenario A puts the player into Rush's role; the gameplay here contains slight, mini-game-like elements of role-playing, as Rush has to win turn-based battles, gain money, and buy better weapons, equipment, and items to survive. In Scenario B, the player controls Femir. While Rush is fighting his battles, Femir investigates a strange disappearance of female warriors. The third episode is the most traditional one, both from the point of view of story and gameplay. This rather minimalistic episode depicts a meeting between the young boy Fand and the girl Remia, who is from another town. Fand shows her around, the two have a date, and the rest of the episode evolves according to the player's decisions for both characters (Fand in Scenario A, Remia in Scenario B). The gameplay is similar to the one implemented in the first game, with the exception of the episode-specific enhancements described above. Most of the time the player has several verbs at his disposal, sometimes with object sub-menus. Sex scenes are usually handled via a point-and-click interface with icons that represent verb commands.", "platform": "NEC PC-9801", "release_date": "April 27, 1993", "game_type": "Released", "esrb": "", "developers": "Software House Parsley", "publishers": "Software House Parsley", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133358-image-ii\n"}