{"altername_name": ["Kakyusei"], "name": "Kakyuusei", "overview": "In Kakyūsei, the player takes the role of a young Japanese high-school student named Kentarou. During the summer break, Kentarou has been working in a restaurant, run by a relative of his family. Now the summer is over, so Kentarou can finally get his salary and prepare for the school season that is about to begin. With some money in his pocket, and plenty of interest towards representatives of the fairer sex, the boy is determined to make this school year memorable... The game is a so-called love adventure, i.e. Japanese-style adventure game with a heavy emphasis on dating, similar to Dōkyūsei, another popular game of that kind by Elf. The word \"kakyūsei\" means \"student(s) from a lower grade\", which in its turn means that younger girls are the primary \"dating focus\" of the game. However, it is also possible to date other women beside the hero's schoolmates, including even a teacher. The gameplay mechanics are similar to those of Dōkyūsei: the player navigates Kentarou through the top-down city, visiting locations that are presented as still screens viewed from first-person perspective. The game has an internal clock, and each visit advances it, so that the number of activities that can be done during one day is limited. Kentarou must usually wait for the next weekend or vacation to be able to explore the city freely. The game offers a considerable amount of freedom in exploration, and the possibility to visit diverse locations, such as museum, cinema, parks, game arcades, etc. Kentarou can earn and pend money, buying items that can be given to a girl on a date. The dating mechanics, however, are not very complex, mostly involving being at the right place at the right time, and choosing appropriate answers to impress the girl. The game features scenes with nudity and sexual situations.", "platform": "NEC PC-9801", "release_date": "June 7, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Elf", "publishers": "elf", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137384-kakyuusei\n"}