{"altername_name": [], "name": "Last Guardian: Juukyou no Shugosha", "overview": "Last Guardian: Jūkyō no Shugosha is set in a fantasy world ruled by gods and inhabited by many different races. Many years ago, two of the gods fought each other, until the god Gaduros emerged victorious, imposing a harsh rule over the nation of the winged Beasts. But the beautiful goddess Typhon defeated Gaduros. It looked like the age of peace finally began. But when the Beasts discovered an ancient disc-like artifact, everything went wrong again. A warrior from the nation of Centaurs and a mysterious religious cult suddenly became very interested in the artifact, making it clear to the Beasts that they will have to fight for their lives. And so three of them - two young friends, Rezak and Maxen, and their older comrade Badio - started a dangerous journey across the world, to find out what their enemies' intentions truly are... The game is a mixture of RPG and strategy. As in most RPGs, the player controls a party of characters (up to 7), who gain experience points from fighting enemies and level up. However, there is no exploration of any kind and no movement outside of the battle field in the game. The game consists of long strategic battles and cut scenes, most of which are presented as still anime-style shots that advance the story. The turn-based battles allow free movement on the battle field. Each action (movement, physical attack, spell, etc.) requires a certain amount of action points. Beside the usual attacks, some player-controlled characters can transform into various types of beasts. While in \"beast mode\", the character gains access to new abilities, but might lose some of those he/she had while in human-like form.", "platform": "NEC PC-9801", "release_date": "January 17, 1995", "game_type": "Released", "esrb": "", "developers": "Studio Inferno", "publishers": "Anjin", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/136478-last-guardian-juukyou-no-shugosha\n"}