{"altername_name": [], "name": "Little Vampire", "overview": "Little Vampire is an adventure-style visual novel (ADV) published in Japan by AliceSoft's predecessor company, Champion Soft, in 1988. The game was later included as a bonus on the PC-98 release of Rance IV. Little Vampire is the direct sequel to Little Princess, and continues the adventures of Kurusu Miki and Ogawa Kentarou after their escape from Dracula's Castle. The events of the game would later be retconned into the timeline of the Rance series, with Dracula developing into the Demon King Gi, and the game's central antagonist, Ramon C. Burksham becoming one of the earliest-appearing Dark Lords. Unlike the game's predecessor, Little Vampire is an all-ages title, one of the only such titles in the Rance series. Characters from this game appear in Party Game Hopper alongside characters from Chotto Meitantei and Gakuen Senki. Little Vampire was the first game released to make use of the System platform. The game was later ported to DOS as a 16-bit application by WAO, who remembered it as both \"very memorable\" and \"very difficult.\" The DOS port was eventually developed through fan efforts to be playable on modern-day Windows systems. It was given an English translation in early 2020. Story After Miki's kidnapping by the vampire king, Dracula, Kentarou has managed to rescue her. But Dracula died too easy, leaving Kentarou with peculiar dying words: \"And now... I die in peace...\" The two take refuge in a nearby town, determined to find a way back to their home world. Starved for food and money, they will have to find a way to survive and ultimately escape. Monsters patrol the area, whispering about a \"Little Princess,\" and a ruined church tower looms in the distance, said to corrupt all comers. And Dracula's curse lingers...", "platform": "NEC PC-9801", "release_date": "May 5, 1988", "game_type": "Released", "esrb": "", "developers": "Alice Soft", "publishers": "Alice Soft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/139396-little-vampire\n"}