{"altername_name": [], "name": "Madou Monogatari A.R.S", "overview": "The heroine of Madō Monogatari: ARS is, like in all other games in the Madō Monogatari series, the young apprentice magician Arle (in this game, she is still a little girl). However, Madō Monogatari: ARS contains two other stories dedicated to Rurue (Rulue) and She-Zo (Schezo), who are known as antagonists in Puyo-Puyo games, but here act as protagonists. All the three stories can be played directly from the main menu. In Arle's story, the little girl is walking through a forest and suddenly sees the cute Carbuncle (Compile's mascot). The little guy runs away, and Arle follows him into the depths of the forest, facing dangerous monsters. Rurue's story begins when she is taken to a mysterious castle. She has lost her memory and must now find her way out of the castle, which is populated by vicious enemies. She-Zo, who is otherwise a powerful magician, is just a school boy in this game. His class is having a tour in the ruins of a 200-year-old dungeon. While the rest of the children follow the guide, the curious boy touches a strange mirror, and is sucked into the dungeon, the way it was once... The gameplay is traditional Madō Monogatari style: crawl through pseudo-3D maze-like dungeons, fighting random enemies in turn-based combat. As in other games in the series, there is a distinct \"wacky\" edge to enemy design, and - despite it being an RPG - no numbers at all. All statistics pointing to damage in battle, conditions, etc., are depicted through animations and text comments. Arle and She-Zo can only cast magic spells. Being a little girl, Arle starts with only two spells, aptly named \"Hot\" and \"Cold\". She-Zo has a vast array of elemental magic. Rurue uses \"techniques\" instead of magic, but they work pretty much the same way.", "platform": "NEC PC-9801", "release_date": "December 10, 1993", "game_type": "Released", "esrb": "", "developers": "Compile", "publishers": "Compile", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.7", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137433-madou-monogatari-ars\n"}