{"altername_name": [], "name": "Marines: Gairomu no Fuuin", "overview": "The kingdom of Franmer lies on the shore of a large sea. One day, a boy from the village of Kos discovered a mysterious ancient stone while diving. The king sends his most renowned specialist to decipher the inscription on the stone. It appears that an evil demon named Gairom has gained possession of sacred orbs that preserve the balance of nature. It is up to the local female warrior Meiria and the magician Faran, daughter of the king's minister, to find a way to retrieve the orbs and defeat Gairom. Marines: Gairom no Fūin is primarily a puzzle game. The player must use Meiria's unique ability to hurl large orbs that can destroy stone structures. However, Meiria can only shoot in a straight line; in order to change the angle of the shot, the player has to manipulate the orb into a whirlwind, which either occurs naturally or can be produced by positioning other characters of the party at correct angles. Characters can also push stones, and use special abilities to help Meiria achieve her goal. The game also has light RPG elements. Characters in the party have hit points, and various healing and offensive items can be found during puzzle stages. There are a few dungeons in the game, but they contain no enemies. The few turn-based battles occur as dictated by the plot, and can be won using strategic combinations of physical attacks, magic, and items. There is no leveling system in the game. Anime-style cutscenes advance the plot between some of the stages. Some of these cutscenes contain explicit nudity and sexual situations.", "platform": "NEC PC-9801", "release_date": "July 25, 1994", "game_type": "Released", "esrb": "", "developers": "Hervest", "publishers": "Hervest", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/146498-marines-gairomu-no-fuuin\n"}