{"altername_name": ["Master of Monstars Final: Tasogare no Yubiwa"], "name": "Master of Monsters Final: Rings of Twilight", "overview": "Master of Monsters Final is a turn-based strategy game in which the player takes the role of a master whose tribe is chosen by the player and the aim of the game is to defeat the masters of all the enemies to conquer them. Defeating each master kills all the remaining enemies. The master acquires different spells depending on the tribe chosen. Players can summon different kinds of creatures such as humans, elves, barbarians, trolls, skeletons, angels, demons and other kinds of monsters depending on the alignment chosen (Law, Neutral, and Chaos). The game adds an RPG element to the series by focusing solely on its campaign, allowing players to form or break alliances with other alignments or even be neutral to all of them. Compared to its predecessor, monsters can't be summoned during battles so they have to be purchased before jumping into the action. Master of Monsters Final gives players the possibility to explore the maps as much as they would want to even after defeating all the masters. There are 4 endings available to the players based on the alliances they make during gameplay. This game ditches the anime style of the former games and ramps up the difficulty, while also adding a MIDI soundtrack and changes to the overall interface, making battles occur in a top-down perspective. In addition to that, the Windows version overhauls the graphics and music, improves the script of the story and fixes some of the event-related bugs of the PC-98 version, such as the inability to create a synthetic monster.", "platform": "NEC PC-9801", "release_date": "November 28, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "SystemSoft", "publishers": "SystemSoft", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133004-master-of-monsters-final-rings-of-twilight\n"}