{"altername_name": [], "name": "Panic Dolls", "overview": "In Panic Dolls, three ordinary Japanese school girls suddenly discover that Miki, their school nurse, is in fact a \"Master Dragoon\", a super-heroine fighting for a powerful galactic organization. Their current adversary is the evil warlord Barado and his emissary, the sexy yet deadly monster-summoner Kyuuma. The three girls turn into the super-heroines Phoenix Rose, Tiger Lily, and Tortoise Cheery - the Power Dolls - and venture into Barado's dungeons to defeat him once and for all... ...only the player won't be helping them. In a sudden twist, the player is given control of the evil Kyuuma. The girls are automatically walking through the isometric, maze-like dungeons, trying to find the exit. The player's goal is to help Kyuuma summon monsters to stop them. As the girls walk, their attack level increases (from 0 to 4), and so does Kyuuma's summoning level. At level 4, she can summon the most powerful monsters in each category (giants, demons, spirits, etc.). When the monster is placed into the dungeon, it will try to find its way to the girls. Depending on the girls' level and the monster's level, the battle will decrease the girls' level by a certain number. The trick is to position different monsters in such a way that the girls will have to face a monster when they are all at level 0. Losing a battle at level 0 will cause a girl to become disoriented and wander off, turning into easier prey for the monsters, and eventually getting killed in a battle. The game doesn't stop if the girls successfully traverse a dungeon. The player can simply let them walk and advance to the next dungeon screen. Depending on where and how the player disposes of the girls, the game ends with a different scene. The game has cut-scenes with explicit sexual content.", "platform": "NEC PC-9801", "release_date": "July 27, 1996", "game_type": "Released", "esrb": "", "developers": "Nihon Plantech", "publishers": "Nihon Plantech", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133396-panic-dolls\n"}