{"altername_name": [], "name": "Pink Shock Pirates", "overview": "The story of Pink Shock Pirates is rather simple: the protagonist is a young girl named Pink, who wants to become a pirate. To do so, she acquires a ship (which she calls Shock), and begins to explore the land in search of crew and adventure. Pink Shock Pirates is a hybrid of strategy and role-playing. Rather than following a linear narrative with scripted events, the game allows the player to sail through the sea and visit towns on all the continents right from the beginning. Towns are represented by small pictures of places of interest, such as weapon shop, item shop, church, etc. Crew members can be hired in towns, or by performing quests. Instead of a usual RPG \"party\", the player manages and controls the crew of an entire ship (their number can get as high as 50). Enemy ships will randomly attack Shock. Before the battle, the player has to position all the crew members on the deck. The player can buy and upgrade the ship cannons, as well as other long-ranged weapons that can be used in battles without engaging in melee. These cannons have limited ammunition; if the player hasn't succeeded to scare the enemy ship away or runs out of ammo, the enemy might get aboard Shock and attack the crew. The battles are turn-based and involve the player moving the crew members on the screen, attacking when an enemy is in range. Attacks are graphically represented as animated sequences appearing in small windows. Role-playing elements are present in the leveling up of crew members, as well as in the possibility to explore the land on foot. The player navigates Pink over the top-down \"world map\", entering and exploring hostile areas. Enemies will attack randomly; land battles are handled the same way as the melee combat on the sea. All the crew members are female, and during combat they might lose parts of their clothes. Despite these suggestive themes, there is no explicit nudity or sexual situations in the game.", "platform": "NEC PC-9801", "release_date": "November 1, 1989", "game_type": "Released", "esrb": "", "developers": "Soft Plan", "publishers": "Soft Plan", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137520-pink-shock-pirates\n"}