{"altername_name": [], "name": "Pink Shock Pirates 2", "overview": "After the brave pirate Pink has defeated the evil Temujin in the first game, peace was restored in the land of Thanatos. However, demonic forces cannot be annihilated so easily; the spirit of Temujin is still alive, looking for a body to possess once the power of the seal that imprisons his soul is gone. The king of the land is concerned, particularly because Pink herself has disappeared, possibly abducted by Temujin's agents. The king summons four female knights under the command of Sara, and orders them to rescue Pink and stop the forces of evil once again. Pink Shock Pirates 2 retains many gameplay elements of the original; however, rather than being a hybrid between two full-fledged genres (strategy and role-playing), it is more of an RPG with strategy elements. Instead of controlling Pink alone and hiring crew members, the player controls a standard RPG party (up to five characters). More gameplay time is now dedicated to exploring the land masses on foot, fighting randomly appearing enemies in turn-based style. Despite the drastically reduced amount of active combatants, the battles still have a strategic edge: the player has to position the five girls on the battle field and navigate them over it, attacking when an enemy is in range. The towns are now viewed from the same top-down view as the rest of the game, and can be physically explored. Sea exploration and ship customization is still present in the sequel. It is no longer possible to fight with ship cannons; instead, the player can acquire multiple ships. From time to time, a whole armada of ships will attack the protagonists, which leads to turn-based battles that are played similarly to the regular ones, the combatants being represented as separate ships rather than individual characters. As in the first game, the enemies can decide to board the player-controlled ship; a battle with a larger number of combatants (including \"nameless\" crew members) ensues.", "platform": "NEC PC-9801", "release_date": "November 1, 1990", "game_type": "Released", "esrb": "", "developers": "Soft Plan", "publishers": "Soft Plan", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137521-pink-shock-pirates-2\n"}