{"altername_name": ["プリンス·オブ·ペルシャ"], "name": "Prince of Persia", "overview": "Game players and critics hailed Karateka for the graceful, realistic animation of Jordan Mechner's karate fighting sequences. Now, working meticulously from hundreds of movie clips, he breaks new ground with animation so uncannily human it must be seen to be believed. Seventeen years have I, Jaffar, served as Grand Vizier to the Sultan of Persia. Now the hour of my triumph is at hand. Already I sit on his throne, and soon I shall have his daughter as well—the Princess, whose beauty is like the stars and the moon. Of course, I would never force myself upon this lovely creature. I shall give her a full hour to reach her own decision. She shall choose me of her own free will—or forfeit her life. And yet she clings to her fantasy of rescue. The object of her childish infatuation? A young adventurer—a nobody— who is now, on my orders, a prisoner in my dungeons. There will be no rescue. He shall never leave his prison alive. Even should he escape his cell, he could never survive the cunning traps and palace guards barring him from the Princess. Yet suppose—by some succession of miracles—he prevails over all these? Ah, then I would be obliged to use certain forces of my own. Enchantment? Black magic? These are but words. I speak of mysteries. Mysteries that no man—or woman—can withstand. Fluid animation and quick, responsive controls. Non-stop action combined with the exploration and puzzle-solving challenge of an adventure game. Movie-like storyline with intrigue, romance, and surprising twists. 12 levels of difficulty. -Explore over 250 rooms. -Battle ever-more skillful swordsmen. -Evade increasingly diabolical deathtraps.", "platform": "NEC PC-9801", "release_date": "July 20, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Arsys Software", "publishers": "Brøderbund Japan", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.12", "wikipedia": "https://en.wikipedia.org/wiki/Prince_of_Persia_(1989_video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106145-prince-of-persia\n"}