{"altername_name": [], "name": "Revery: Izanai no Masuishou", "overview": "Revery are people who know the secret way of magic. Few of those are left in the world, and unfortunately, not all of them use their powers for good... Tyfana is a young girl who was living together with her father, Alfred. One day, a mysterious man named Wolfgang came to her father's house, demanding a magical artifact known as the Staff of Freya. Wolfgang cast a spell on Alfred, petrifying him. At the last moment, Alfred ordered Tyfana to grab the staff. Then he created a portal, and Tyfana disappeared... The young girl finds herself in an unknown forest, with the staff in her hands. Armed with her newly acquired magical power, she swears to find a way to return home and rescue her father. Revery: Izanai no Masuishō is a role-playing game with a rather unusual combat system. There are no separate battle screens; the combat takes place on the exploration field and in real time. The player directly controls only Tyfana, but other characters can join the party and fight on her side, controlled by the AI; the player is able to assign general strategies to them (attack, defend, run away, etc.). Since Tyfana is armed with a staff and casts magical spells, the player-controlled combat in the game entirely consists of long-ranged magical attacks that require aiming (the game pauses for that moment). Tyfana needs magic points to cast spells, which (like her HP) are gradually restored when she walks. She can equip rings, bracelets, and necklaces to enhance her defenses. A somewhat unusual (for Japanese RPGs) feature of Revery: Izanai no Masuishō is the leveling-up system, which is controlled by the player. Every time Tyfana levels up, the player is given a certain amount of points, which he/she can freely use to raise any of the player character's attributes.", "platform": "NEC PC-9801", "release_date": "March 10, 1994", "game_type": "Released", "esrb": "", "developers": "Right Stuff", "publishers": "Right Stuff", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137554-revery-izanai-no-masuishou\n"}