{"altername_name": [], "name": "Seisenshi Mokkoriman", "overview": "Seisenshi Mokkoriman opens the line of Mokkoriman games. Mokkoriman is a super-hero. Perhaps a little unusual one. You see, Mokkoriman is famous for his... how should I say that... manly powers. That's why he is called \"sei senshi\", which means sex warrior. Mokkoriman is determined to make women happy (or so he thinks) by having sex with them. But the path to each beautiful woman is filled with dangerous creatures and traps. Death awaits our hero at every corner, so he must prove that his other super-powers - jumping and shooting - will be as effective as his main talent... An early game by Illusion, \"Sei Senshi Mokkoriman\" marks the beginning of this company's long tradition of fusing mainstream game genres with sex scenes. This particular game experiments with platform genre. It is a full-fledged platformer with complex levels that have to be solved in a unique way: there are teleporters that connect various areas of the level, and Mokkoriman can use them only if he has gathered enough energy - which he does when defeating enemies. If his energy count is too low, he should return and fight more enemies (which respawn on each screen). Mokkoriman has no melee attack: he shoots small energy balls at enemies. Various upgrades can be found, which enhance Mokkoriman's shooting abilities, making him shoot two or more balls. Rather than instantly dying when hit by an enemy, Mokkoriman has a proper health bar. Health packs are also scattered around. Each level ends with a sex scene between the hero and the \"boss girl\" of the level. Trademark interactive sex scenes make their first appearance in this game, though in a rather basic form: the player has to hold a mouse button and quickly drag the mouse, imitating Mokkoriman's movements on screen. The goal is to fill the girl's \"pleasure meter\", while not running out of \"spirit\", as the game calls it (read: premature ejaculation is not an option!).", "platform": "NEC PC-9801", "release_date": "August 27, 1993", "game_type": "Released", "esrb": "", "developers": "Illusion", "publishers": "Illusion", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.12", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137600-seisenshi-mokkoriman\n"}