{"altername_name": [], "name": "Slayers", "overview": "Lina Inverse, the teenage sorceress, and Gourry Gabriev, her swordsman sidekick, are out traveling the countryside after having successfully \"liberated\" a nearby castle. They are accosted a pair of bandits, who are quickly taken out by Lina's magic. In return for sparing their lives, the bandits tell Lina and Gourry of a secret cave near the city of Welnan where a powerful dragon lives...a powerful dragon whose fangs are worth lots of money! Lina immediately decides that this is their next destination, and off they go to Welnan to prepare. Their plan soon deviates, though, as they find themselves involved in something called the \"Chimera of the Year Contest.\" Slayers is a dungeon-crawler RPG based on the light novel series of the same name by Hajime Kanzaka and Rui Araizumi. The player takes Lina and Gourry, along with a companion of their choosing (including mainstays like Zelgadis, Naga, Amelia, and even Amelia's father Phil), and ventures off into the dungeon near Welnan. The player must explore the dungeon, fighting enemies and looking for treasure. Lina and her companions must also return to the surface in order to visit Welnan, which is the only place where the game can be saved; in the town, thy can also rest and heal, change or revive characters, and buy or sell items. During battles, the player only directly controls Lina, with the rest of the team acting on their own. Characters do not level up, having their full range of abilities from the beginning. The focus is on proper use of those abilities, minimizing the need for returning to the surface, and having the right team and items for the task at hand.", "platform": "NEC PC-9801", "release_date": "March 25, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "AIC Spirits", "publishers": "Banpresto", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Slayers_video_games#Slayers_(PC98)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129035-slayers\n"}