{"altername_name": [], "name": "Star Platinum", "overview": "High in the heavens, there was a girl who was training in a shrine to be the successor of a goddess. One day, the goddess had to leave the shrine to attend a meeting of the many gods, leaving the girl alone at the shrine. The goddess warned her to leave alone a box of star-souls within the shrine, and that under no circumstances should she open it. Naturally, as soon as the goddess had left, the girl's curiosity got the better of her and she opened the box. The star-souls escaped, turned the girl into a small fairy, and fled down towards the Earth. She must track down and capture the star-souls, now causing mischief on Earth, before the goddess returns to the shrine. However, while chasing several of the star-souls through the sky, the girl crashes through the window of a young man who lives on Earth. She decides that since he can somehow see her, that he's going to help her out, and so the two of them begin their adventure. Star Platinum is an erotic visual novel combined with a basic card game. The player reads through the story as it progresses, accompanied by still illustrations of the events as they unfold. Whenever a character in need of exorcising is encountered, the game switches to the battle mode. In the battle mode, the player and the computer take turns matching and collecting cards that feature various astrological symbols. If one collects enough cards of a certain type to create a set, then the player can attack, reducing the opponent's health by a set amount and resetting the cards to their neutral state. If the player can deplete the opponent's health, then the story will continue and the player will be rewarded with increasingly erotic images of the opponent (which can be viewed again later through the main menu). However, if the player's health is depleted, then the battle must be started over again from the beginning.", "platform": "NEC PC-9801", "release_date": "October 10, 1996", "game_type": "Released", "esrb": "", "developers": "Cybertech Custom", "publishers": "Cybertech Custom", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137635-star-platinum\n"}