{"altername_name": [], "name": "Starfire", "overview": "You start the game as a member of a mercenary squad piloting Motor Shells, infantry mechs deployed from space. The squad is under contract by the government and stationed onboard the battleship Dragonet, tasked with various dirty jobs like subduing colonial uprisings and cleaning up orbital bio factories that have gone out of control. Inevitably events unfold that leave you as the only one who can prevent a mysterious invader from taking control of the galaxy. Starcraft Inc. is mainly known for porting numerous popular western games from DOS to Japanese home computer systems like PC-98 and FM Towns. Starfire is one of their few original games, but uses an engine taken from the Might & Magic series of games they translated and ported to PC-98 in the early 90's. It retains the 3D first person dungeon crawler navigation and sprite based graphics, but the classic RPG encounters are replaced with a simple real time action-based combat where you shoot the enemies as they appear on screen. Instead of levels and experience points you increase your combat stats through upgrades from engineers and doctors. Killing enemies provide you with credits to spend at item shops and arms dealers. Eventually you gain access to a space ship, which enables you to travel the galaxy. That also means running into hostile space ships that you will have to fend off in simple space battles. To unravel the plot you have to visit the various systems and their space stations and talk with the characters that live on them, eliminating space pirates and alien forces along the way.", "platform": "NEC PC-9801", "release_date": "October 14, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Starcraft", "publishers": "StarCraft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/132453-starfire\n"}