{"altername_name": [], "name": "Super Battle Skin Panic", "overview": "Arigawa is just an ordinary Japanese teenager, who attends an ordinary Japanese high school. At least he was ordinary until he met Mimi, the charming new exchange student. One day, being a perfect gentleman, Arigawa walked her home after the school, but was attacked by angry female martial artists. Mimi reveals to him that she has studied esoteric martial skills by a man known simply as \"The Teacher\". Unfortunately, not every one who knows these secret techniques uses them for the good. The young hero gets involved in a conflict from which there is no escape... Super Battle Skin Panic is a hybrid of Japanese-style adventure and card-based battles. During the adventure part, the player clicks on one of the three available commands (\"Look\", \"Talk\", and \"Move\") to interact with the environment. As in most Japanese adventures, there is no puzzles or other kind of challenge, and at most screens the player simply has to deplete all the commands to proceed. The battles are pre-set and follow a turn-based pattern. The player controls Mimi. Both player-controlled character and the enemy are dealt five cards, one of which the player has to \"play\"; after the turn is over, the player is dealt a new card. The cards work like battle command: attack, defense, etc. A special card is \"undress\", which, unsurprisingly, makes the character remove some of her clothes or even get completely naked. Both Mimi and the enemy have a \"shame\" meter, which can be reduced (or raised) by playing certain cards. The higher the shame meter, the more the character feels ashamed of her nudity, which leads to decrease in combat performance.", "platform": "NEC PC-9801", "release_date": "February 8, 1991", "game_type": "Released", "esrb": "", "developers": "Gainax", "publishers": "Gainax", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133505-super-battle-skin-panic\n"}