{"altername_name": [], "name": "Sword World PC", "overview": "Sword World PC is based on the Japanese table role-playing game Sword World, itself based on the Record of Lodoss Wars light novels which were initially created as role-playing \"replays\" of Dungeons & Dragons. It is set in the medieval world of Forcelia, which includes both the Lodoss island and the continent of Crystania from a series spin-off. The setting is similar to D&D games, having familiar medieval fantasy elements such as magic, races like elves and dwarves, etc. Despite its Japanese origins and anime-style visuals, the game is closer to Western RPG format and attempts to recreate a table role-playing experience without focusing on character development or a linear plot. Though certain quests must be completed and events triggered in order to advance in the game, the player is for the most part free to venture to any city of the game world in any order. Navigation between the cities is menu-based, i.e. there is no wilderness exploration. Specific dungeons and other hostile areas can be accessed only by receiving respective missions. In such areas, as well as in locations within towns, player-controlled party can be physically navigated from an overhead perspective. Character creation involves choosing a race (Human, Dwarf, Elf, two types of Half-Elves, or a halfling-like GrassRunner) and a class (Bard, Fighter, Priest, Ranger, Sage, Shaman, Sorcerer, or Thief). Character statistics and abilities are similar to those of D&D games. The player creates only one character, while the rest of the party consists of NPCs that can be convinced to join. Combat takes place in the same area as exploration and is of the tactical turn-based variety, allowing characters to move on the screen.", "platform": "NEC PC-9801", "release_date": "November 27, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "T&E Soft", "publishers": "T&E Soft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133445-sword-world-pc\n"}