{"altername_name": [], "name": "The Dark Crystal", "overview": "In a faraway world, an event of cosmic importance is about to occur: a Great Conjunction of the planet's Three Suns. A thousand years ago, when the Suns last came together, a cruel and selfish tribe known as the Skeksis seized control of the radiant Crystal that once brought harmony to all beings. A quarrel erupted and blows were struck, fracturing the Crystal and sending a shard flying off into the countryside. The Crystal darkened, and evil spread like a cloud across the land. Now, as Jen, last known survivor of the Gelfling race, it is up to you to travel the world and fulfill an ancient prophecy by restoring the missing shard of the Dark Crystal. The power to end the Skeksis' reign is yours.... But there is much to be learned, and time is short. Unless you heal the Crystal before the Great Conjunction, all things whole and good will be destroyed, and the tyranny of the Skeksis will be reconfirmed forever! The Dark Crystal is closely based on Jim Henson's film of the same name. The game is set in Thra, a world with three suns, which come together every thousand years in an event known as \"The Great Conjunction\". The player controls Jen, the last survivor of the Gelfings, a race of mole-like people. He must find a dark crystal and its broken shard, and repair it to end the reign of a tyrannical lord. Like other installments of the Hi-Res Adventures series, the game is entirely text-based, with non-animated graphics to illustrate the areas. Movement between areas and interaction with the game world is performed by typing commands consisting of either one or two words (a combination of a verb and an object).", "platform": "NEC PC-9801", "release_date": "January 1, 1984", "game_type": "Released", "esrb": "", "developers": "Sierra On-Line", "publishers": "StarCraft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154570-the-dark-crystal\n"}