{"altername_name": ["Chou Jikuu Yousai Macross: Skull Leader Complete Pack"], "name": "The Super Dimension Fortress Macross: Skull Leader Complete Pack", "overview": "Macross: Skull Leader Complete Pack is a VN/strategy game hybrid released in July 1995. This game is basically a mix of two earlier Macross games by Family Soft, namely Skull Leader and Love Stories. There are naturally certain changes and improvements to the formula, but by and large this is what this particular release is. It is an interesting take on the plot of Macross. The core of the plot is based on the movie “Do You Remember Love?”, as you can see from the designs of the pilot suits and the Zentradi; however, it uses the TV series to fill any hole that the movie doesn’t show (for example, how the Macross leaves the planet). In order to mix the two versions together, the role of Minmay in the TV series is “taken” by one of the original characters in the game. This game is split into two stories: Hikaru (the main character of the original series and movie) and Kei (an original character made for this game). Hikaru’s story has more chapters, and a route split that changes the story, making it more similar to the TV series in one version, and more similar to the movie in the other; Kei’s story is shorter, but has a dating sim element, with different endings based on your choices. As to the gameplay itself, it’s a mixture of the aforementioned VN segments and strategy battles. Strategy battles are fairly involved, since you can utilize a wide variety of units, strategies, formations, transformations and weapon types. Your goal is usually to destroy all the enemy units, get to a certain point or escort some unit as fast as possible. VN segments and strategy segments complement each other quite well, and the story itself has some original elements to it.", "platform": "NEC PC-9801", "release_date": "1995", "game_type": "", "esrb": "", "developers": "", "publishers": "Family Soft", "genres": "Strategy", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/84846-the-super-dimension-fortress-macross-skull-leader-complete-pack\n"}