{"altername_name": ["Ultima V"], "name": "Ultima V: Warriors of Destiny", "overview": "The Avatar, the embodiment of the Eight Virtues and the hero of Britannia, is called back to deal with a grave threat. Lord British, the country's benevolent monarch, has disappeared, and a man named Blackthorn has usurped his throne. The tyrant rules the land by enforcing the virtues upon the will of the people, corrupting their meaning in the process. His fundamentalist visions led him to create a police state, where failure to adhere to the virtues is punishable by death. Behind Blackthorn are the three Shadowlords, anti-thesis to the three principles of Truth, Love, and Courage. The Avatar must understand their meaning and origins, find a way to defeat them, rescue Lord British, and restore the former ethical principles of Britannia. Ultima V uses the basics of the Ultima IV engine, an overhead perspective for the map of Britannia and its towns, and a rosette-compass 3D view for the dungeons. The battle system also resembles that of the previous game, with separate battle screens and navigation of character icons in turn-based style. Many of the gameplay elements of the predecessor return, including the complex spell system (reagents must be bought in order to cast spells), recruitable party members, moongates that teleport the party between locations, various means of transportation (horses, ships, etc., with the notable addition of a magic carpet), and so on. Character creation based on morally ambiguous questions and basic leveling up system have been preserved as well. In comparison to the predecessor, the classes have been reduced to four.", "platform": "NEC PC-9801", "release_date": "July 21, 1990", "game_type": "Released", "esrb": "", "developers": "Origin Systems", "publishers": "Pony Canyon", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Ultima_V:_Warriors_of_Destiny", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133332-ultima-v-warriors-of-destiny\n"}