{"altername_name": [], "name": "Viper V6 RS", "overview": "Viper V-6 is the first in the long-running Viper series of animated adult games. It contains three separate stories: The Devil Came tells the story of a teenager named Ogawa, who was unpopular in his class and summoned a demon to exact revenge. But the demon turned out to be female, so his wishes naturally assume a different direction... Afternoon describes a scene during a beauty contest. The defeated participant thinks that she was unfairly judged, but her fury at the winner turns, in front of the amazed spectators, into erotic desire... Double Impact features two young female detectives, Miho and Kumi, who pretend to search for jobs as maids in order to infiltrate a mansion in which mysterious disappearances have been taking place. All the three stories are very short and can perhaps be better described as \"scenes\"; the entire game can be completed within several minutes. The interaction is reduced to absolute minimum, with an occasion decision to make, and is available only in The Devil Came (in which it is also possible to die if the player makes a wrong decision); the two other stories are non-interactive, the only input being pressing the return key to advance to the next scene. What sets \"Viper V-6\" (and the whole series) apart from most other Japanese adult games - beside the \"three stories in one\" concept - is the fact that most of its sex scenes are animated. VIPER-V6 RS version: Upgrade kit for the original PC98 versions to add PCM voice and enhanced gameplay previously available in the X68000 version. Game package includes twelve page instruction manual, five diskettes, registration card, and a number of promotional flyers.", "platform": "NEC PC-9801", "release_date": "March 31, 1995", "game_type": "Released", "esrb": "", "developers": "Sogna", "publishers": "Sogna", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "1.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133089-viper-v6-rs\n"}