{"altername_name": [], "name": "Zavas II: The Prophecy of Mehitae", "overview": "The follow-up to Zavas is, like its predecessor, a fantasy role-playing game with Japanese anime-like aesthetics, but more Western-oriented free-form gameplay with more emphasis on character development than on a character-driven plot. Through a series of choices the player make the protagonist (always named Majon, but with different family names) to be a prince, the son of a merchant, or the son of a fisherman. In the beginning the player character undergoes a series of trials (which may include arcade-style mini-games, mathematical tasks, etc.) which determine his eventual attributes and also follow his growth until he turns sixteen and embarks on a quest to find companions and defeat an evil sorcerer in accordance with an ancient prophecy. Though the game has a traditional overworld with towns, hostile areas, and fairly simple turn-based battles, many of its gameplay features deviate from the standard Japanese template. Every NPC can be approached with different attitudes (including bribe and usage of items), and often a specific attitude is needed to further the hero's goals. Money can be earned and managed through various activities. Experience points are awarded for conversations and other actions besides combat. An important factor is the party's stamina: a certain amount of it must be reached in order to access key plot-advancing locations, and building up stamina through side quests and other actions occupies a considerable portion of the gameplay. The protagonist has a ship at his disposal from the beginning of the game, and it is possible to physically sail across the sea and access any location, provided the stamina level is high enough.", "platform": "NEC PC-9801", "release_date": "February 24, 1993", "game_type": "Released", "esrb": "", "developers": "Glodia", "publishers": "Popcom Soft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/137732-zavas-ii-the-prophecy-of-mehitae\n"}