{
  "name": "Une affaire en or",
  "shortName": "une-affaire-en-or",
  "description": "<i>Une affaire en or</i> (a golden opportunity, or something like that) is a business simulation for up to four players. You are the new director of the &quot;Apples Company&quot;, and your goal is to turn the company into Europe's biggest player in the apple compote industry.<br><br>You start out with a capital of 15 million francs, for which you must buy factory capacity, energy, apples and hire a workforce. You have four different energy alternatives, ranging from atom energy to coal, petrol or gas. Atom energy is expensive but secure, whereas your energy supply can get interrupted by wars in the Middle East if you rely on petrol, and the other alternatives also fluctuate in price and supply. After having bought energy and supplies, you can start production. Your production capacity per turn is calculated based on the size of your factory in relation to your labour force. Being a French labour force, strikes can halt production for certain turns, and mood swings will bring down productivity as well.<br><br>Production cannot proceed without a supply of apples, and accidents in your warehouse may force you into the market to buy fresh ingredients. Apples can be bought in your own region, from all of France, or from the EEC market. Supply is limited, and may be brought down by bad weather. <br><br>For selling your stock, you need a dealer network, either on a national or European level. The market prices fluctuate, and can be saturated by cheap &quot;made in Hong-Kong&quot; goods, halting trading for one turn or more. Sometimes, the state will seize your stock and pay only half price for it. However, the state also tends to give you subsidies for investments.<br><br>The game is won by saturating the markets, both domestic and export. Gameplay takes place on a screen filled with graphs and a cursor-based menu, triggering action dialogues. Five actions can be taken per turn, and each turn is ended by entering the production phase.",
  "publishedBy": "Free Game Blot",
  "developedBy": "Free Game Blot",
  "released": "1986",
  "alsoFor": "Alice 32/90, Amstrad CPC, Oric, Thomson MO, Thomson TO | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/exelvision/une-affaire-en-or",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Exelvision",
      "releases": [
        {
          "publisher": "Free Game Blot",
          "developer": "Free Game Blot",
          "ported": "",
          "country": " France",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}