{
  "name": "Super Uwol",
  "shortName": "super-uwol",
  "description": "<i>Super Uwol</i> is a game created for the devkitSMS competition 2016 and it largely retains the concept of the original 2009 <a href=\"https://www.mobygames.com/game/uwol-quest-for-money\">Uwol: Quest for Money</a> by the same developers. The basic gameplay is identical, but with new levels and additional game modes. After the events of the first game Uwol is retiring in a cozy house on the beach of Pepinoni (province of Badajoz). He discovers someone has stolen all his money from the bank from his friend Meemaid, once an evil sorceress and now a heroine, as she was using an ATM at the bank when the robbery happened. That is why Uwol returns to the Storm Palace of the first game to collect a new fortune.<br><br>The palace still has its rooms are arranged like a pyramid, but now with entirely level lay-outs and new elements such as spikes. Each room represents a single-screen platform level with coins and enemies. By moving through sides of the screen horizontally the character appears on the other side. When all coins are collected two exits appears and Uwol can choose a new level in the pyramid with some freedom for the path to follow based on the chosen exit. To win the game a total of 255 coins has to be collected. If the bottom of the pyramid is reached without the required amount the game restarts and a different path can be chosen, avoiding the empty rooms, to collect additional coins.<br><br>Levels have three types of enemies: Franky, Vampy and Wolfy. Enemies cannot be attacked, they can only be avoided. There is only a small amount of time to clear a room. When time runs out Fanty is summoned who can freely move around the screen and chases Uwol until the character is dead or all coins are collected and the exit is reached after all. Uwol starts with three lives but a single hit is not deadly right away. When hit once, Uwol loses his clothes and a second hit will kill them. By picking up a T-shirt the protection is regained.<br><br>Entirely new for this version are the three modes. Next to the regular one-player mode only controlling Uwol, it is now possible to access a two-player mode with a friend controlling Meermaid. Both characters are in the same room and work together to collect coins. The third mode is a variant where the two characters compete for coins. The character to collect most coins in a room scores a point. When Fanty appears in the two-player mode it chases the player with the most coins. In the versus mode it is possible to pick up the T-shirt for the other character so they cannot regain protection.<br><br>Next to the free download release for NES there was a crowdfunded release with the game on a PAL/NTSC compatible cartridge along with a box and instructions. Based on the tier different extras were provided, such as having your name listed in the manual, a game poster based on the cover art by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,1017511/\">Ferry Hardest</a> or becoming a character in the game replacing Uwol as the protagonist or becoming an enemy.",
  "publishedBy": "Ubhres Productions",
  "developedBy": "Mojon Twins, The",
  "released": "Nov 19, 2016",
  "alsoFor": "NES | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/sg-1000/super-uwol",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "SG-1000",
      "releases": [
        {
          "publisher": "Ubhres Productions",
          "developer": "Mojon Twins, The",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Nov 19, 2016",
          "ean13": "",
          "comments": "download release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/579701-super-uwol-nes-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Electronic",
      "country": "Worldwide",
      "platforms": "NES and SG-1000"
    }
  ]
}