{"altername_name": [], "name": "Mr. Do!'s Castle", "overview": "The object of Mr. Do's Castle is to score as many points as possible by collecting cherries and defeating unicorn-like monsters. The game takes place in a castle filled with platforms and ladders, some of which can be flipped from one platform to another. The player controls Mr. Do as he collects cherries by using a hammer to knock out blocks that contain them from the various platforms. Empty holes left by the knocked-out blocks serve as traps for the monsters - if a monster falls into a hole, the player can then defeat it by causing a block above the monster to fall on top of it. If the player takes too long to complete a level, the monsters transform into faster, more difficult forms that occasionally multiply. The game advances to the next level when all cherries on the level have been collected or all enemies have been defeated. The player loses a life if Mr. Do is caught by a monster, and the game ends when the player runs out of lives. The game is an example of the trap-em-up genre, which also includes games like Heiankyo Alien, Lode Runner, Boomer's Adventure in Asmik World, and Space Panic. As in Mr. Do!, the player can earn an extra life by collecting all of the letters from the word \"EXTRA\". Regular monsters can be changed into monsters bearing the EXTRA letters by collecting all three keys distributed around the playfield and then picking up a magic shield from the top floor. Monsters in this state are easier to defeat than normal; a simple hammer strike will do the job. After a brief interval, they change back into their normal forms. The game also offers a bonus credit for collecting a rare diamond that appears on the playfield at random intervals. The cherry blocks are absent from Mr. Do Vs. Unicorns and early revisions of Mr. Do's Castle. Instead, blocks that are not keys or skulls at the start of a stage will be fill blocks (those left behind when unicorns fall into holes and are left alone for a time). Because of this, there are only three ways to complete a level in this version, versus the four ways to complete levels in Mr. Do's Castle. In addition, in these early revisions, the fill blocks change colors every two stages.", "platform": "ColecoVision", "release_date": "1984", "game_type": "Released", "esrb": "Not Rated", "developers": "Parker Brothers", "publishers": "Parker Brothers", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "3.33", "wikipedia": "https://en.wikipedia.org/wiki/Mr._Do%27s_Castle", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10019-mr-dos-castle\n"}