{"altername_name": [], "name": "Rolloverture", "overview": "The maestro takes that baton and readies the orchestra. But wait! All notes have been scrambled and you must help the maestro scurry madly around the directing the notes back Co their proper order. Climb ladders, throw/overs, reverse the conveyor belt, and step on the music ball with the correct notes and proper placement rewards you Willi Ihe overture, but incorrect placement results in a speed increase and greater difficulty. A variety of melodies and random scrambling of notes.While you painlessly learn about music. You help Maesiro Theodore T. Tophat (affectionately known as Triple T) travel around the orchestra pit attempting to direct the rolling note into the proper note-maker slot. The orchestra pit contains seven levers, positioned over the note-maker slot that the lover controls. Triple T runs by a lever to change its setting, thereby opening or closing the corresponding note-maker hatch. The conveyor bolt is used to direct the rolling note to the led note-maker slots or the right note-maker slots. Triple T can change the direction of the conveyor bolt by running on the conveyor belt in the opposite direction you wish it to go. There are two blue bumpers which are solid color when active, and an outline when not active. If Triple T runs over an active blue bumper the note-maker slots will be scrambled. There are seven red bumpers, which are solid color when active. II the rolling note hits an active red bumper, the note- maker hatches will be scrambled (opened and closed). Triple T runs over any active red bumper, the bumper is de-activated with scrambling the note-maker hatches. There are seven ladders that Triple T can use to climb up or down in the orchestra pit, There are two gaps which Triple T must jump over.", "platform": "ColecoVision", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Sunrise Software", "publishers": "Sunrise Software", "genres": "Education", "max_players": "2", "cooperative": "No", "rating": "1.62", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=_4lYw0rJL_k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/10028-rolloverture\n"}