{
  "name": "Crazy Climber",
  "shortName": "crazy-climber",
  "description": "As Crazy Climber, climb your way to the top of a series of buildings, where a helicopter is waiting to pick you up and take you to the next building. As Climber scales a building, he is able to climb up and sideways but he cannot climb down.\nWhile climbing a building, windows will open and close simultaneously. If any window closes on either of his hands he will lose his grip. However, if a window closes on both of his hands, he will fall to his death, resulting in the loss of a life. You have three Climbers in total, but you are awarded an extra Climber every 30,000 points. Besides windows, Climber is faced with other dangers, including:<ul><li>Bald-headed guys who hurl various objects at you.</li>\n<li>Pesky condors who fly by, dropping eggs and droppings of an unpleasant substance.</li>\n<li>Falling steel girders and iron dumbells.</li>\n<li>Electrical &quot;Nichibutsu&quot; signs with a dangling live wire.</li>\n<li>Falling &quot;Crazy Climber&quot; signs.</li>\n<li>King Kong leaping from side to side of the building and slams his hands against the windows.</li></ul>The climber must try to avoid or overcome each of those hazards which he will encounter as he continues climbing in his attempt to reach the rooftop. If he falls to his death by windows or objects,  another climber will replace him and will start at the same location where the last one fell. The specific danger will not be present at the same point, so the climber can go further up to face the next danger. Most of the hazards are announced by certain recognizable musical themes. <br><br>Crazy Climber is awarded a bonus score on each building every time after getting carried off by the helicopter. However, each bonus score will decrease by every ten seconds that the climber will spend scaling each building as he attempts reach the top. Somewhere in the game, there is &quot;The Lucky Balloon&quot;, which can lift Climber about ten stories and raise the player's bonus score if he catches it.",
  "publishedBy": "Grandstand Leisure Ltd",
  "developedBy": "Nihon Bussan Co., Ltd.",
  "released": "1982",
  "alsoFor": "Android, Arcade, Atari 2600, NES, Nintendo Switch, PlayStation, PlayStation 4, Wii, WonderSwan | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/arcadia-2001/crazy-climber",
  "visual": "2D scrolling",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Arcadia 2001",
      "releases": [
        {
          "publisher": "Grandstand Leisure Ltd",
          "developer": "Nihon Bussan Co., Ltd.",
          "ported": "UA Limited",
          "country": " New Zealand",
          "releaseDate": "1982",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/892917-crazy-climber-arcadia-2001-screenshot-score-screen.png",
      "caption": "Score screen"
    },
    {
      "link": "/images/shots/l/892918-crazy-climber-arcadia-2001-screenshot-level-selection-screen.png",
      "caption": "Level selection screen"
    },
    {
      "link": "/images/shots/l/892919-crazy-climber-arcadia-2001-screenshot-gameplay.png",
      "caption": "Gameplay"
    }
  ],
  "cover": []
}