{"name": "Dig Dug", "overview": "The objective of Dig Dug is to eliminate underground-dwelling monsters by inflating them until they pop, or by dropping rocks on them. There are two kinds of enemies in the game:<br>Pookas - A race of round red monsters (said to be modeled after tomatoes) who wear yellow goggles.<br>Fygars - A race of green dragons who can breathe fire.<br>The player's character is Dig Dug, dressed in white and blue, and able to dig tunnels through destructible environments. Dig Dug is killed if he is caught by either Pooka or Fygar, burned by a Fygar's fire, or crushed by a rock.<br>A partially inflated monster will gradually deflate and recover after a few seconds, during which time the player can pass safely through it. The monsters normally crawl through the tunnels in the dirt but can turn into ghostly eyes and travel slowly through the dirt. The last enemy on a level will try to escape off the top left of the screen.<br>More points are awarded for popping an enemy further down in the dirt (the levels are color-coded). In addition, Fygars are worth double points if exploded horizontally, since they can only breathe fire horizontally in the direction they are facing. Extra points are also awarded for dropping rocks on enemies in order to eliminate them rather than inflating them. If one enemy is killed by the rock, it is worth 1000 points. The next two add 1500 points each, and any after that add 2000. The act of digging is itself worth points, giving 10 points for each block dug, so some players do as much of it as possible in situations where the threat from the remaining monsters is minimal.<br>After the player drops two rocks, fruits and vegetables and other edible bonus items, such as Galaxian flagships appear in the center of the play field, and can be collected for points if the player is able to reach them before they disappear. These edible bonus items will appear even if the rocks fail to hit any enemies. In some versions of the game, the most points attainable from a single bonus fruit is 8,000 from the pineapple.", "platform": "Atari 5200", "release_date": "1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Namco", "publishers": "Atari", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=Pd6TTrVdm7s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4897"}