{"name": "Super Cobra", "overview": "The player controls a helicopter and has to guide it across a scrolling terrain, battling obstacles along the way. The player uses a joystick to accelerate, decelerate, move up, and move down. The ship uses a laser and bomb to destroy defenders, tanks, and UFO's while infiletrating 10 Super Cobra defense systems.<br>The ship has a limited fuel supply, which is depleted over time. More fuel can be acquired by destroying fuel tanks in the game.<br>The game is divided into ten sections, plus a finale, each with a different style of terrain and different obstacles. Players navigate through ten levels and a base, where they must safely make it through the level and safely remove the booty. The levels are described as follows,<br>Player must maneuver the chopper over mountainous terrain against fast and slow firing rockets.<br>Chopper faces Arcing missiles over a mountain terrain.<br>Smart Bombs flying in groups of four over mountainous terrain. Rockets appear, but do not fire.<br>Single Smart Bombs over mountainous terrain. Again, Rockets appear, but do not fire.<br>Chopper flies through a cavern-like terrain against falling mines.<br>Rapidly firing, roving tanks over mountainous terrain. Rockets appear, but do not fire.<br>Maneuver through a field of meteors which explode when hit with bombs or 3 times with laser, plus a single, green, shadow meteor directly in front of chopper which explodes when hit five times with laser. Rockets appear but do not fire.<br>Chopper flies over mountainous terrain against rapidly firing UFOs. Tanks and rockets appear, but do not fire.<br>Chopper faces arcing missiles over tall buildings.<br>Firing rockets in a building maze.<br>Base: Player must maneuver the chopper over tall buildings against arcing missiles and rapidly firing tanks to reach the Booty and safely carry it away.<br>There is no intermission between each section; the game simply scrolls into the new terrain. If the player destroys the booty on the final level, they must start back at the beginning of the level.", "platform": "Atari 5200", "release_date": "February 4, 1983", "game_type": "Released", "esrb": "Not Rated", "developers": "Parker Brothers", "publishers": "Parker Brothers", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "2.22", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=W0MmmBuMhzY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/4966"}