{
  "name": "Citadel",
  "shortName": "citadel___",
  "description": "An old deserted castle is being used as a base for a dictator known as Marduk. It is being used to build a starport that will transport an alien invasion force to Earth. If this succeeds the dictator is likely to take control over the planet. The starport is powered by five crystals that can be found in the castle. The player's objective is to stop the invasion by destroying the starport. To do so he has to collect the crystals, activate the starport and travel to the alien homeworld. Once there the player has to find a figurine and use it to destroy the starport. After the invasion has been averted, the player can become the ruler of the citadel by collecting three hidden crowns and energy bottles.<br><br><i>Citadel</i> is a platform game with a focus on puzzle solving. Gameplay involves exploring the citadel in search for the crystals while collecting items and avoiding enemies. The game does not have any instant deaths. Instead the player has an energy level that decreases when he comes into contact with enemies or hazards. However, if the player loses too much energy in a room he gets teleported back to the start of it. Energy is also lost continuously due to radiation so the player cannot stand around too long. The energy can be replenished by collecting bottles and solving puzzles. The game is low on combat as most enemies cannot be killed. The monks are an exception as they can be killed by shooting spells in their faces. The puzzle solving involves picking up objects and using them at the right location. The player can carry two objects at the same time. Examples of objects include keys to open doors, ice crystals that freezes water and trampolines that can be used to reach otherwise unreachable platforms.",
  "publishedBy": "Superior Software Ltd.",
  "developedBy": "",
  "released": "1985",
  "alsoFor": "BBC Micro | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/electron/citadel___",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Electron",
      "releases": [
        {
          "publisher": "Superior Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/678498-citadel-electron-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "Electron"
    },
    {
      "link": "/images/covers/l/678499-citadel-electron-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "Electron"
    },
    {
      "link": "/images/covers/l/678500-citadel-electron-media.jpg",
      "scanOf": "Media",
      "packaging": "Cassette Case",
      "country": "United Kingdom",
      "platforms": "Electron"
    }
  ]
}