{
  "name": "Cranky",
  "shortName": "cranky",
  "description": "<i>Cranky</i> is a single player maths-based educational game.<br><br>Cranky is a calculator who, naturally enough, has problems when it rains because the water gets into his circuits and damages them. The object of the game is to repair Cranky's circuits but, because the rain has caused damage, only the keys 3 and 5 are working. <br><br>In the 'Help Cranky' game there are three levels of difficulty, all of which play the same. Cranky will show which of the 100 circuits are damaged on a numbered grid and the player's task is to find ways to make up the damaged numbers. Starting with just the 3 and the 5 keys working the player can create the numbers 3, 5, 33, 35, 53, &amp; 55. These numbers can be added and subtracted to make other numbers and once a player has entered 5 - 3 = 2 for example, the number 2 becomes available and can be used in future sums. Once all the circuits have been repaired Cranky becomes available to use as a functioning on-screen calculator.<br><br>In the 'Play Challenge' game the player selects a pair of numbers in the range 1 - 9 and then uses these in a 'Help Cranky' game. The game documentation does warn that not all number pairs will allow the player to successfully complete the grid.\n",
  "publishedBy": "Acornsoft Limited",
  "developedBy": "Applied Systems Knowledge Ltd.",
  "released": "1984",
  "alsoFor": "BBC Micro, Dragon 32/64 | Combined View",
  "genre": "Educational, Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/electron/cranky",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Electron",
      "releases": [
        {
          "publisher": "Acornsoft Limited",
          "developer": "Applied Systems Knowledge Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}