{
  "name": "Daredevil Denis",
  "shortName": "daredevil-denis",
  "description": "Denis makes his debut as a stuntman. He has to impress the director and earn wages by performing stunts. Each screen consists of four platforms that cover the entire screen horizontally. Depending on the scene, Denis uses a motorbike, jet-ski or ski-doo to cross the area from left to right. Leaving the screen on the right, he reappears on the left of the platform below, maintaining his speed. A scene is completed if he manages to leave the screen on the lowest platform.<br><br>Denis is controlled through three keys. He can accelerate, slow down and jump. The scenes are filled with hazards such as houses, trees, snowmen, spiders, ambulances, helicopters, boats, whales and policemen. Some of these are static, but others move around or up and down. Sometimes there are gaps that can be used to descend to a lower platform immediately, using a balloon. When Denis touches a hazard he is flung off the vehicle and has to restart. The director provides three takes. When they are used up, Denis is fired.<br><br>From the main menu six difficulty levels are available. They offer variation in the amount of hazards. The vehicles cannot be chosen, they are provided at the start of each scene.",
  "publishedBy": "Visions (Software Factory) Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "BBC Micro | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/electron/daredevil-denis",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Tricks / stunts",
  "setting": "",
  "release": [
    {
      "system": "Electron",
      "releases": [
        {
          "publisher": "Visions (Software Factory) Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}