{
  "name": "DeathStar",
  "shortName": "deathstar",
  "description": "<i>DeathStar</i> is a clone of <a href=\"https://www.mobygames.com/game/sinistar\">Sinistar</a> with identical gameplay. Players command a ship in space with the backdrop scrolling endlessly in all directions. The space ship always moves forward and it can be rotated left or right in turns of 22.5 degrees, making up sixteen directions in total. There are two additional actions: shooting regular bullets and launching a starbomb. To win a level and move on to a next zone, the player has to defeat a large space craft called DeathStar.<br><br>The screen is initially filled with three types of objects: workers, warriors and planetoids. All of these can be shot and colliding with them does not harm the player's ship. The main goal is to shoot the planetoids to make them emit glowing crystals that can be picked up by the player. These provide points and are converted into starbombs, of which a maximum of 24 can be collected. The opposition has the same goal in mind. Warriors mine crystals from the planetoids and can attack the player's ship. The workers pursue all released crystals (by warriors or the player) and transport them back to the Deathstar (at that point not visible on the screen). Both workers and warriors can be shot by the player, and when workers carry a crystal the player can reclaim it.<br><br>Once twenty pieces have been successfully transported by the workers, regardless of the player's efforts, the Deathstar ship appears. It pursues the player and is guarded by warriors. The goal is to destroy it completely by releasing starbombs as regular bullets have no effect. For each successful hit a piece of it is removed. When all twenty pieces are gone, the ship is destroyed and a bonus of 15,000 points is provided. Starbombs can be released in succession and trace the Deathstar's position automatically. When out of starbombs, more planetoids need to be shot to gather additional crystals. When the Deathstar is blown up, a warp drive is activated to move on to the next zone: Worker Zone, the Warrior Zone, the Planetoid Zone and finally the Void Zone. Each zone has small changes. The last one for instance has fewer planetoids. Between each zone there is a bonus screen.<br><br>The player starts with three lives. There is a radar image near the top of the screen where the various objects and opponents are shown as dots: the player's ship (white), warriors (blue), workers (red), Deathstar (white).",
  "publishedBy": "Superior Software Ltd.",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "BBC Micro | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/electron/deathstar",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Electron",
      "releases": [
        {
          "publisher": "Superior Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}