{
  "name": "Rebel Planet",
  "shortName": "rebel-planet",
  "description": "<i>You play the part of an agent of SAROS, the Terran resistance movement against their imperial alien overlords, the Arcadians. Disguised as a merchant, you will fly your ship, <b>the Caydia</b>, to three different colony planets -- Tropos, Halmuris, and Arcadion -- to rendezvous with underground freedom fighters and gather the intelligence you require to destroy the central computer of the Arcadian hivemind, liberating humanity!</i><br><br>An adaptation of <a href=\"https://www.mobygames.com/search/quick?developer=Robin+Waterfield\">Robin Waterfield</a>'s <a href=\"https://www.mobygames.com/search/quick?gamegroup=Fighting+Fantasy+adaptations\">Fighting Fantasy</a> gamebook #18, published the previous year, this computer game version rejects the Choose-Your-Own-Adventure gameplay design of the book in favour of a more open-ended text adventure model, albeit one with a restrictive text parser.  Most elements of the trademark Fighting Fantasy RPG system, including the randomness of even simulated die-rolls, have been streamlined out, leaving only metrics for damage taken and hunger (hitherto untracked in the books.)  Carrying limits, while atypical in FF gamebooks, are enforced here as in the original book.<br><br>A further new dynamic includes the strict timetable of the space traffic control towers -- you need to have wrapped up your business planetside before your launch window comes up, otherwise you're out of luck.  In keeping with the game's sci-fi setting (in both rural and urban flavours), you will find extensive use of objects such as your limcom, nutritious hcaps (tasty like dead Zorkons, num num!), and the indispensable lite-kube.  Combat has been largely phased out in favour of an extension of the gamebook's espionage theme of ciphers and passwords, magic words with the power of plot advancement.",
  "publishedBy": "Adventuresoft UK Ltd.",
  "developedBy": "Adventuresoft UK Ltd.",
  "released": "1986",
  "alsoFor": "Amstrad CPC, BBC Micro, Commodore 64, ZX Spectrum | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/electron/rebel-planet",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Electron",
      "releases": [
        {
          "publisher": "Adventuresoft UK Ltd.",
          "developer": "Adventuresoft UK Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1986",
          "ean13": "",
          "comments": "Text only"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}