{
  "name": "Rubble Trouble",
  "shortName": "rubble-trouble",
  "description": "The third world war between 2001 and 2003 ends with a massive nuclear explosion. The force of the explosion and the effects of the radioactivity is felt all over the world and forces the humans to live in primitive caves. The only creatures that strive among the ruins in the wastelands are the krackat, a sort of mutated turtle. The krackats feasts on human flesh and is a constant threat for those humans that remain. <br><br><i>Rubble Trouble</i> is a <a href=\"https://www.mobygames.com/search/quick?game=Pengo\">Pengo</a> variant. The game is played in a maze of boulder where the krackats are patrolling in search of humans to eat. The player is a human and has to kill all the krackats in each level. To kill a krackat he has to push a boulder into the path of the krackat and thereby crushing it. Boulders that are pushed into a wall will bounce back so the player has to be careful or he might be killed by his own boulder. Killed he will also be if he comes into contact with a krackat. Radiation is also a problem. If the player takes too long he might die of it or the boulders might disintegrate. Some of the boulders have special functions. Cyan boulders give extra points while rocks with bombs in them might create a new holocaust.",
  "publishedBy": "Micro Power Ltd",
  "developedBy": "",
  "released": "1984",
  "alsoFor": "BBC Micro | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/electron/rubble-trouble",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Electron",
      "releases": [
        {
          "publisher": "Micro Power Ltd",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1984",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}