{
  "name": "Spellbinder",
  "shortName": "spellbinder",
  "description": "In the late thirteenth century, ten powerful magelords lived in a land call Lorraine. After studying sorcery and enchantment since childhood they had the cunning to create spells that could cause both metamorphosis and devastation. In <i>Spellbinder</i>, the player takes control of one such magelord called Eldon the Spellbinder whose task is to find and defeat the evil Zorn who has deserted from the magelords and barricaded himself in the Castle of Lorraine. To defeat the villain the player has collect the right ingredients, mix the ultimate spell and cast it on Zorn so that he is banished for all eternity.<br><br><i>Spellbinder</i> is an adventure game where the player has to navigate his way through the castle, collect ingredients and make spells that can be used on the various creatures that roam the castle. The player sees his character from a side view and uses the keyboard to navigate him between rooms and interact with the environment. The castle consists of two floors, three citadels, a catacomb and a dungeon and to move between the different levels teleports or portals have to be used. There are also secret passages, one-way doors and doors that only appear after certain tasks has been accomplished.<br><br>To create spells the player has to collect the various ingredients that can be found around the castle and then mix them together. Among the ingredients there are burned ashes that is used for spells that causes effects on enemies, sulphur that is used for curing wounds, toad's legs that are used for freezing spells and dried roots which is used on spells intended for the spellbinder. Example of spells include heal which is made by mixing sulphur and dried roots while freeze which slows down enemies is created by combining toad's legs and burned ashes. Regular spells doesn't kill enemies but can be used to avoid their bad effects. Recipes for the most common spells are listed in the game's instructions but by exploring the castle the player will find hints and clues on how to create more advanced spells. ",
  "publishedBy": "Superior Software Ltd.",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "BBC Micro | Combined View",
  "genre": "Adventure",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/electron/spellbinder",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Electron",
      "releases": [
        {
          "publisher": "Superior Software Ltd.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/699879-spellbinder-electron-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/699880-spellbinder-electron-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/699881-spellbinder-electron-screenshot-starting-out.png",
      "caption": "Starting out"
    },
    {
      "link": "/images/shots/l/699882-spellbinder-electron-screenshot-the-talking-mask-in-the-wall.png",
      "caption": "The talking mask in the wall"
    },
    {
      "link": "/images/shots/l/699883-spellbinder-electron-screenshot-finding-ingredients-in-a-chest.png",
      "caption": "Finding ingredients in a chest"
    },
    {
      "link": "/images/shots/l/699884-spellbinder-electron-screenshot-a-winged-skull.png",
      "caption": "A winged skull"
    },
    {
      "link": "/images/shots/l/699885-spellbinder-electron-screenshot-being-chased-by-a-cyclop.png",
      "caption": "Being chased by a cyclop"
    },
    {
      "link": "/images/shots/l/699886-spellbinder-electron-screenshot-a-watcher-gets-a-bit-too-close.png",
      "caption": "A watcher gets a bit too close"
    }
  ],
  "cover": []
}