{"altername_name": [], "name": "12 is Better Than 6", "overview": "12 is Better Than 6 is a top-down shooter with twin stick controls set in 1873 in North America and with a western setting. The protagonist is a Mexican slave who on the run, looking to make his way from Mexico to Texas while being chased by headhunters. After the tutorial the game is divided into four large acts where many different towns are visited along with encounters with characters that further the story. The game uses a hand drawn pen-and-paper art style and everything is coloured in shades of purple, except for the red trails and blotches of blood. The gameplay has many elements similar to Hotline Miami. Aside from using the same perspective, there is brutal violence and gun play that requires fast reflexes as a single shot is usually deadly. It is possible to go in all guns blazing, but it is more effective to draw out enemies one by one. There are also many sections in the game that require or encourage stealth, using a knife or a bow for instance. There is an unlimited amount of lives, but often there is trial-and-error involved to find an approach that works, so many areas will need to be played multiple times. The Mexican carries a limited number of dynamite sticks that cause large explosions, along with a single melee and a single ranged weapon. Ranged weapons are revolvers, shotguns, rifles, but also stationary Gatling guns. Weapons have a limited amount of ammo and manual reloading is required. It is also not possible to keep shooting just until a clip is empty. There is a quick reloading mechanic that requires the player to release the mouse button used for aiming to load another bullet in the chamber, before it becomes possible to aim and shoot again. This heightens the tension in situations where multiple enemies need to be taken out in succession. Some weapons provide a wider range where it possible to slightly scroll the screen to look ahead. Additional ammo is picked up from dead bodies and it is also possible to swap weapons that way. Enemies also leave behind money used to buy perks such as homing rats carrying dynamite, a breastplate with a 50% chance for bullets to deflect, dual-wielding, twice the amount of ammo, and loading two bullets at once. The game is largely linear, but there are some optional parts or scenes that can be approached in different ways or sometimes even be ignored. Especially after the first act the game opens up and for instance offers side missions. Often it is possible to search cabinets and other locations for items. Many parts of the environment can be used to seek cover or to hide. Enemies often hear shots or screams, they investigate bodies and their guard patrol path is shown through footsteps that disappear after a while. They do not react to the Mexican's footsteps, mainly the line of sight. Next to the main game there is an endless survival arena mode where players worldwide can compete for the best score, staying alive as long as possible and defeating waves of enemies.", "platform": "Nintendo Switch", "release_date": "March 5, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "Ink Stains Games", "publishers": "HypeTrain Digital", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.71", "wikipedia": "", "video_link": "https://youtu.be/xPNk11zHzME", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117896-12-is-better-than-6\n"}