{"altername_name": [], "name": "12 Labours of Hercules II: The Cretan Bull Switch", "overview": "Enter the mythical world of Ancient Greece! Meet your favorite gods and heroes in this breathtaking strategy time-management game! With over a million downloads and a passionate community of players, Hercules heat arrives on Nintendo Switch yet again – this time for its breathtaking sequel! Don't wake the sleeping dragon… or rather don't try to mess with Hera! The Greek Goddess is upset with Hercules, and in the fit of anger decides to turn the famed Cretan Bull into a wild beast! The bull is destroying everything in his path: roads, buildings and the entire villages are in huge danger! Only one hero can stop the mayhem and tame the bull - it's Hercules. The story doesn’t end there though; Join Hercules and his friends on a wild ride as you restore villages, fight beasts and construct world wonders! Game features: - Explore gorgeous Greek landscapes to their finest detail with the stunning HD graphics - Hercules has tons of tricks up his sleeve: sit back and enjoy a fun story full of twists - Try out new a NEW game mode and construct gorgeous World Wonders - Unlock extra puzzles and bonus levels as you progress - Immerse yourself in the beautifully crafted ancient world: meet new heroes, gods and beasts! Hercules II is uses Nintendo Switch™ features to their full potential. You can play the game using JoyCon™ controllers, touch screen, or dock the console to play on a TV! Hercules II is proudly an adventure strategy game designed for players of all ages. Kids and adults can enjoy a breathtaking story, complete fun quests and assemble fun puzzles! It’s top-grade family fun.", "platform": "Nintendo Switch", "release_date": "April 6, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "Jetdogs Studios", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=2HFD7QLL9WQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370834-12-labours-of-hercules-ii-the-cretan-bull-switch\n"}