{"altername_name": ["17 Bit Platinum Pack"], "name": "17-Bit Platinum Pack: GALAK-Z: The Void / Skulls of the Shogun: Bone-a-fide Edition", "overview": "Extra value pack with two amazing games brought to you by 17-Bit developers. GALAK-Z: The Void: Get back into the cockpit with the premium all-you-can-eat version of our rogue-lite love letter to 80’s anime and space shooters. 80’s spaceship anime and arcade-gaming meld with ultra-modern physics and A.I. in a skill-demanding, procedurally generated rogue-lite adventure! Be the hero in a world that oozes classic Saturday morning anime but plays like a tough, modern, tactical shooter. Try to survive the hostile environments of deep space, battling warring factions full of unique and cunning enemies. Unlock ever more powerful upgrades as you learn the secret of the GALAK-Z, and die and die again as you valiantly struggle to become the ultimate pilot – finally good enough to beat what GALAK-Z throws at you! • New Mode: The Void allows endless gameplay, Online Leaderboards, and a Daily Challenge • Advanced enemy A.I. for intense dogfights • Arcade Mode for the faint of heart who don't dare the rogue-lite approach Skulls of the Shogun: Bone-a-fide Edition: Skulls of the Shogun is a fast-paced turn-based strategy game, supercharged with fighting-game flare and packed with a serious amount of humor! Crush your enemies and eat their skulls! Enter the Samurai Afterlife and join forces with undead warriors, magical monks, and mighty mustachioed samurai generals! Skull-tastic features: • Beautifully hand-drawn and hand-animated! See it in motion! • 4 magical animal monks to discover and master! • 24 levels of epic single-player story! Why can’t General Akamoto get any respect?! • 4 gods and 6 generals, all with distinct personalities! • Power up your army to deadly demons! • Gain experience, emblems, and cred with the progression system! • BONUS island featuring persistent troops and the Tanuki Monk!", "platform": "Nintendo Switch", "release_date": "February 25, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "17-BIT", "publishers": "Golem Entertainment", "genres": "Shooter", "max_players": "4", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=hIcgjXvJ5l8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370684-17-bit-platinum-pack-galak-z-the-void-skulls-of-the-shogun-bone-a-fide-edition\n"}