{"altername_name": [], "name": "60 Seconds!", "overview": "60 Seconds! is an atomic dark comedy of scavenge and survival. The game follows a 1950s American, suburban family in their quest to survive the nuclear apocalypse. Surprised by the bombing, they only get the titular 60 seconds to rummage through their house and collect supplies necessary to last in a fallout shelter. If they make to their underground bunker, the adventure continues as the family tries to make it day by day, rationing food and water, making expeditions to the wasteland when supplies run low and coping with unexpected situations, making decisions that affect their future. It is up to the player to keep them alive, sane and protected from mutant cockroaches and other dangers of the post-apocalyptic world, until contact with the military is made and a rescue is arranged. 60 Seconds! features a combination of two distinct gameplay stages. In the first 60 seconds of a game, the player controls Ted, the head of the family, trying to make the best of the time given to collect supplies for the nuclear apocalypse and rescue the rest of the family. That stage plays in a 3D environment of the family's procedurally generated house. Whatever and whoever ends up in the fallout shelter in that stage is what the player will have at their disposal in the second part of the game, when trying to survive in the fallout shelter. However, in this stage, the game resembles a text adventure, with player making decisions about the family's well being and following their unique adventure, different in every playthrough, in a hand-written journal that updates every day.", "platform": "Nintendo Switch", "release_date": "December 18, 2017", "game_type": "Released", "esrb": "T - Teen", "developers": "Robot Gentleman", "publishers": "Robot Gentleman Studios", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "https://youtu.be/lnZ6ATCakuI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117899-60-seconds\n"}