{"altername_name": [], "name": "911 Operator", "overview": "People's lives are in your hands! In 911 Operator, you take on the role of an emergency dispatcher, who has to rapidly deal with the incoming reports. Your task is not just to pick up the calls, but also to react appropriately to the situation – sometimes giving first aid instructions is enough, at other times a police, fire department or paramedics’ intervention is a necessity. Keep in mind that the person on the other side of the line might turn out to be a dying daughter’s father, an unpredictable terrorist, or just a prankster. Can you handle all of this? Specifically redesigned for Nintendo Switch™, 911 Operator lets you put your patience and management skills to the test, whether you're eager to save lives on the go or want to give out orders from the comfort of your couch with a Pro Controller. PLAY IN ANY LOCATION IN THE WORLD Over 900 cities from all around the world. The Free Play mode lets you choose a city to play on along with real streets, addresses, and the emergency infrastructure. You can also try the Career mode, which contains 6 cities with unique events – survive an earthquake in San Francisco and save Washington, D.C. from bomb attacks. MANAGE TEAMS A number of police, fire department and paramedic units are at your disposal. The forces may use a variety of vehicles (from common ambulances to police helicopters), essential equipment (e.g., bulletproof vests, first aid kits, or technical tools) and consist of team members with different abilities. Key features: - Opportunity to play on over 900 cities in the world! - Expansive Career mode, featuring unique calls and events. - Nintendo Switch exclusive World Map feature that allows you to pick any location you want to play! - More than 140 types of reports to encounter. - 12 types of emergency vehicles (including helicopters, police cars or motorcycles). - Real first aid instructions.", "platform": "Nintendo Switch", "release_date": "October 26, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Jutsu Games", "publishers": "SONKA", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://youtu.be/zFG4Gra4o0s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156208-911-operator\n"}