{"altername_name": [], "name": "Abandon Ship", "overview": "Become king of pirates while sailing through seaports, battles, krakens & navy. Engage in piracy and become a hunted Captain. Take command of an 'Age of Sail' ship and her crew, exploring a vast, story-filled world that reacts to your decisions. Engage enemy vessels, fortifications and sea monsters in brutal tactical combat, all framed in an art style inspired by classic Naval Oil Paintings. SURVIVE ON THE EDGE IN A WORLD WITH CONSEQUENCES Discover a huge amount of unique, story-filled islands across diverse biomes and themed areas: Fight ghost ships in the Haunted Seas. Ward off giant arachnids in the Spider Islands. Regions filled with poisonous gas, icebergs, cannibals and much more await. Engage enemy ships, fortifications and sea monsters in vicious combat, employing your best tactics to out-manoeuvre and out-gun the enemy. Weather and environmental conditions affect your battles: Tidal waves, lightning strikes, volcanic bombardments and blizzards are just some of the modifiers that impact your strategy. Abandon Ship focuses on ‘Age of Sail’ ships in a Fantasy setting, framed in an Art Style inspired by classic Naval Oil Paintings. SHIP DESTRUCTION IS NOT THE END Life in this world can be brutal. Death is permanent. But the journey doesn’t end if your vessel is destroyed. You are the Captain, and as long as the Captain is alive, there is always hope. By escaping to a Lifeboat, or even being stranded, alone in the water, there is a chance to survive and fight your way back to the top. SNATCH VICTORY FROM THE JAWS OF DEFEAT Combat is tactical and savage. Each battle is hard-fought, always on the edge of defeat. Your only chance of overcoming the odds is to employ every advantage you can bring to bear. Dozens of diverse weapons and upgrades are available to utilise on the various ship classes you can acquire. Customise your vessels appearance by capturing enemy ships intact. Your trusty crew gain experience and traits to help provide an edge over the enemy. REAP WHAT YOU SOW Explore a fantasy world that reacts to your actions. Engage in piracy and become a hunted Captain. Undertake quests that may drastically change the environment – or the entire world. Make decisions that create allies or enemies that return to help or seek vengeance. Play multiple stories, including the main campaigns tale of overthrowing a Cthulhu-esque Cult, a Freeplay mode about rebuilding the legacy of your forebears, and shorter tales, such as the combat campaign focused on rescuing your sister, or Sword of the Cult, where you play as one of Father’s children, climbing the ranks until you’re granted the ultimate weapon: The Kraken.", "platform": "Nintendo Switch", "release_date": "June 28, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Plug In Digital", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=sq0trPwyYng", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370807-abandon-ship\n"}