{"altername_name": [], "name": "Abbie's Farm for kids and toddlers", "overview": "This game lets children experience an exciting day on the farm. Help Abbie feed the animals or bake a tasty cake. The farm has lots of animals that want to be cared for. Their food grows in the yard, and Abbie can draw water from the well. Children playfully learn what to feed to each animal. But don't worry if they aren't fed or given water for a few days - they can take care of themselves as well! The following places can be visited on the farm: The Pigsty: Home to a family of three pigs, happily romping in the mud, waiting to be stroked and given lots of food. The Stable: Abbie's beloved horse lives here, and is happy to receive any attention. The stable is also where the farmyard cat tries his luck at catching mice. Despite the presence of the horse and the cat, there are a lot of mice, which are difficult to catch. The Garden: This is where all the food grows for the animals on Abbie's farm - carrots, apples, cabbage, beets, corn, grass, strawberries and more. After the fruit and other crops have been harvested, it takes a little while until they grow back again. The scarecrow keeps thieving birds away from the crops. The Well: This is where Abbie draws water to give to the animals, for example. The powers of deduction and logic of little farmers are challenged by everyday tasks: for example, to collect water, the bucket must first be found and then used with the well. The Hen House: Three chickens are clucking away all day long. Every now and then they lay an egg, but only if they're well fed. Abbie can collect the eggs and use them for a cake, for example. The Windmill: On sunny days, this is where Abbie dries her washing. The wind on the little hill isn't only good for turning the mill. In the mill itself, Abbie can grind corn to make flour and then use it to bake delicious cakes. The Barn: The two sheep of the farm live here, frolicking in the hay. They always look forward to seeing Abbie, especially when she gives them some food. The Meadow: A farm wouldn't be a farm without cows. There are two grazing all day long in the meadow. Abbie can milk the cows and then use the milk for baking, for example. The cat also loves to drink milk. The Goat Shed: The goat hasn't been at the farm for long, but has already found some new friends - a mother duck and her ducklings. The goat, duck and ducklings are all waiting to be played with. The Kitchen: The stove standing in the farm kitchen is old, but still does its job very well. If Abbie has collected all the ingredients, she can mix them up in the kitchen and bake a delicious apple or strawberry pie, which will give her lots of energy, so she will be able to do a bit more on that day. The Bedroom: After a hard day's work on the farm, when the food has been harvested and all the animals have been fed, Abbie looks forward to getting into her cosy bed. Quick! Turn off the light and enjoy a restful sleep. Have fun on Abbie's Farm!", "platform": "Nintendo Switch", "release_date": "April 1, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "Asylum Square", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370846-abbies-farm-for-kids-and-toddlers\n"}