{"altername_name": [], "name": "Actraiser: Renaissance", "overview": "Heaven, earth and mankind - Create and destroy everything according to your will! Experience the revival of the 90's classic hit \"Actraiser\". ABOUT Actraiser Renaissance combines 2D platforming action (Realm Acts) with a City-building simulation (Realm Management) in the ultimate battle between good and evil! Featuring the soundtrack that sent shockwaves through the gaming world when it was first released, composed by the legendary Yuzo Koshiro - now remastered! Help humanity flourish by playing as the Lord of Light and their loyal angel in a world beset by evil. NEW FEATURES Remastered 2D graphics present the game in beautiful HD 15 new music tracks, as well as re-arranged original tracks by Actraiser composer Yuzo Koshiro! New stories, expanded action and realm management gameplay, additional action stages, an all-new realm, and a new, powerful boss! Auto-save and difficulty levels GAME SYSTEM Realm Acts: Strategically cast powerful fire, ice, and other magic in these 2D action stages. Humans return to reclaim the realm after you conquer these stages, allowing you to begin cultivating your settlements. New magic that was not available in the original game has been added along with the ability to dodge. Players can also attack with upward and downward motions for a more dynamic action experience. You will need every new trick in your arsenal to defeat stronger bosses at the end of the new action stages. Realm Management: Help humanity flourish by cultivating your settlements and offering guidance. Use your miraculous powers to summon lightning and trigger earthquakes to remove obstacles such as trees and boulders that impede the growth of your chosen. Play as the Lord of Light's angel and use your mighty bow and arrows to drive back the evil monsters that prey on your people. Protect your settlements from enemy raids in real-time strategic battles. The placement of your forts and timing of your miracles is key to achieving victory in these engagements. Experience all-new tales of humanity's struggles to overcome their flaws and failings as they learn to love one another and together grow stronger. Altogether, these new scenarios amount to more than twice the story present in the original. Explore the vast new realm and enjoy building your settlements for longer than ever before! MUSIC The original Actraiser composer, Yuzo Koshiro, has re-arranged all of the iconic original tracks and added 15 new tracks as well. Players can listen to the original music or switch to the re-arranged versions while playing the game. Tired from protecting and raising your villagers? Then just sit back, relax, and enjoy the tunes.", "platform": "Nintendo Switch", "release_date": "September 23, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Sonic Powered", "publishers": "Square Enix", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "https://en.wikipedia.org/wiki/ActRaiser", "video_link": "https://www.youtube.com/watch?v=7zki3kY4YCQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155159-actraiser-renaissance\n"}