{"altername_name": [], "name": "Afterimage", "overview": "Story: A great deity created the world named Engardin, leaving four goliaths before her departure. The Goliaths abided by their different divine callings and upheld the order and flow of this world. Hence, the lives in Engardin reincarnated and multiplied. Humans were the last creation, and their ever-expanding ambitions led to a protracted war against the Goliaths. Engardin was engulfed in flames, until a huge explosion known as \"The Razing\" devastated the Holy Grounds of mankind and brought a swift end to the conflict. But the divine order was broken, and lives withered away. The age of mankind came to an end. The survivors of the conflict scattered across Engardin. Severed from the Well of Mankind and unable to reincarnate, they banded together to form settlements. Years have passed since this great cataclysm, and the remaining human settlements have been suddenly assaulted by mystic forces. Renee, a young amnesiac girl and student of Aros, was the lone survivor of the attack on her village. Determined to recover her forgotten memories and locate her lost mentor, she bids farewell to her destroyed village to embark on a journey that will inexplicably set into motion a series of events that will determine the fate of this new world. Gameplay: Experience a gorgeous hand-drawn world: Engardin is not only filled with sublime beauty but also plagued by crises. The ruins of Engardin are home to many treasures and secrets, but the Corrupted are waiting for their next prey and ancient deadly traps are ready to kill the careless. Fight Fierce Enemies: With humanity in retreat, nature and the creatures that inhabit it have reclaimed Engardin as their own. Battle through over 170 varieties of enemies and 30 tough boss encounters that stand between you and your goal. Bountiful rewards await those who can weather these brutal combat trials. Diversified Character Builds: Harness and channel the power of defeated enemies to unlock powerful skills and upgrade a diverse arsenal of weaponry. Become the master of your own fighting style with over 200 different equipment to collect and choose from including 6 classes of main weapon, sub weapon, armor, and accessories. Key Features: - Explore a non-linear world - unearth the secrets buried deep within the ruins of the vast interconnected world of Engardin. Interact with over 50 different NPCs, each with their own story and purpose. Learn more about their role in Engardin through side quests! - Fight over 170 varieties of enemies, including 30 tough boss encounters. - Deep RPG mechanics allow for diverse character builds – over 200 different equipment to collect and choose from including 6 classes of main weapon, sub weapon, armor and accessories. Invest talent points into a variety of stat upgrades and unique weapon skills for each class of weapon. - Determine the fate of the world – discover multiple endings depending on Renee’s actions that will shape the future of Engardin. - Stunning 2D art style with animations hand-drawn frame-by-frame. - Discover new abilities and new Afterimages that grant unique benefits in your exploration and combat. Use these skills to access new areas, shortcuts, and master these in combat to defeat more difficult enemy encounters! - Over 40 original orchestral tracks composed by the Aurogon Sound Team and fully recorded by International Master Philharmonic Orchestra and other various musicians.", "platform": "Nintendo Switch", "release_date": "April 25, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "Aurogon Shanghai", "publishers": "Aurogon Shanghai", "genres": "Beat 'em Up", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368257-afterimage\n"}