{"altername_name": [], "name": "Agatha Christie: The ABC Murders", "overview": "Agatha Christie: The ABC Murders is based on the novel of the same name. The main character is the master detective Hercule Poirot who, together with his assistant Hastings, investigates the ABC murder mystery: A serial killer who bases his murders on the alphabet (and likes to send taunting letters to Poirot) is on the loose. In contrast to other Agatha Christie works, this story is set in a number of English locations and not in a confined environment. Except for the inspiration, this game is unrelated to the Nintendo DS game of the same name. The majority of the game is spent with investigating crime scenes and other locations: searching for and clicking on hot spots and finding clues. Often the game goes in a close-up view and shots the number of hot-spots to find in said view. When observing people or places, the player needs to find spots which correspond with Poirot's statement (for example, when he says \"This woman is a heavy smoker\", the cursor needs to be held over a cigarette). During conversations, the player needs to choose the stay in character for information and bonus points - but the game continues even after botching an interrogation completely. Sometimes during the case, Poirot enters deduction mode which works in a similar way to Crimes & Punishments: Sherlock Holmes: in a mind-map, the player needs to combine the collected evidence to form conclusions. However, in contrast to Crimes and Punishment there is no option to fail. A similar mechanic are the reconstructions where the detectives reconstruct a timeline. It is basically a movie and at certain points the player needs to choose how it continues - if a wrong answer is chosen, it is back to the beginning. Additionally the game features a number of logic puzzles which take place on a separate screen. Those are mostly a simpler version of The Room: the examined object can be turned around by holding the button and the player can manipulate certain areas. For example, a part may be loose, can be moved and reveals a button which in turn reveals another part of the contraption. There are also some traditional puzzles like comparing two letters to see if the same typewriter was used. There are no traditional inventory puzzles save for combining found keys on locks.", "platform": "Nintendo Switch", "release_date": "October 6, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Artefacts Studio", "publishers": "Microïds", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "https://youtu.be/hEhkVIgcXOM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156516-agatha-christie-the-abc-murders\n"}