{"altername_name": [], "name": "Air Conflicts: Secret Wars", "overview": "Air Conflicts: Secret Wars is an arcade flight game with battles spanning both World Wars, featuring seven campaigns and 49 missions that engage players in white-knuckle air battles and secret missions across Europe and North Africa. An impressive selection of famous aircraft of the era is available to the player, each showcasing specific strengths and weaknesses in the battle for air supremacy. Air Conflicts: Secret Wars challenges players with an exciting mix of mission types, including patrolling, sneaking/stealth, hit & run, bombing and escort objectives. Mission objectives are presented in an animated, graphic-novel style format as cockpit chatter keeps the game lively and fun. An upgrade system lets players tune their planes’ performance between missions, allowing for more maneuverable and faster aircraft, while also boosting their wingman’s skills. Casual pilots and veteran simulation fans will appreciate the game’s dual control schemes – either arcade, for simpler, faster control, or simulation mode, for more fine-tuned and realistic control. Air Conflicts: Secret Wars – extends its replayability with several multiplayer modes for up to four players. Features: - Jump into the Cockpit – Fly more than 16 aircraft from both World Wars, including classic biplanes like the Sopwith Camel to the Messerschmitt BF109 and the Spitfire. Push the limits of secret prototypes such as the Bolchowitinow BI-3, Gloster Meteor fighter jets, and the Horten H IX, a forerunner of modern stealth bombers. - Customize your Aircraft – Add speed or maneuverability as you shred your enemies in vicious aerial dogfights, leveraging airplane customizations that best match your playing style and mission requirements. - Battle in the Real World – 24 real-world inspired maps including Berlin, Belgrade, Slovakia and Tobruk will challenge your battlefield piloting skills across 7 campaigns and 49 diverse missions. - Aces and Rookies Welcome – Newcomers can jump in and play quickly, thanks to the accessible arcade controls. Combat aces can switch to simulation-styled controls for more precision and realism. - Take to the Skies with Friends (or Enemies) – Show everyone you’re an ace in eight player Dogfight, Team Dogfight, Capture-the-Flag and Destroy & Protect multiplayer online exploratory gameplay.", "platform": "Nintendo Switch", "release_date": "March 26, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Games Farm", "publishers": "Kalypso Media", "genres": "Flight Simulator", "max_players": "8", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113791-air-conflicts-secret-wars\n"}