{"altername_name": [], "name": "Airoheart", "overview": "Airoheart is an ode to the deep and emotional story telling of the Final Fantasy series, whilst also adopting the style and charm of early classics from The Legend of Zelda series. Its graphical art style and music are heavily inspired by such franchises with the core gameplay elements closely resembling that of 'A Link To The Past'. It embraces old-school real-time combat situations mixed with puzzles and platforming sequences, all from the much loved top-down pixel art perspective of the mid 90s. Airoheart features a huge new open world of extremes to explore, teeming with life, characters, and dangerous creatures... Our story begins in the land of Engard, where our beloved hero Airoheart sets out on a journey to stop his brother's diabolical plan to unleash an ancient evil that has been sealed in the shadows for generations, and to trigger a war using the power of the Draoidh Stone.  Along his journey, Airoheart will encounter strange and fascinating characters, with unique and interweaving stories. Some with noble pursuits, and some that confront Airoheart with morally ambiguous choice. Will you confront your own brother and stop him from executing his wicked plans? Music, setting the scene… Some of the most memorable musical moments in gaming came from the SNES era. A time when limitations on consoles prevented things like voice acting from being possible. Airoheart replicates this concept, limiting sound channels and sticking to small sample libraries, with prominent lead instruments.", "platform": "Nintendo Switch", "release_date": "September 30, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Pixel Heart Studio", "publishers": "SOEDESCO", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=n_7TbBOn5fM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165818-airoheart\n"}