{"altername_name": [], "name": "American Fugitive", "overview": "American Fugitive is a modern take on classic sandbox action offering a new 3D top-down open-world single-player experience. Welcome to Redrock County, a sleepy American town with a booming criminal underbelly. You take the role of Will Riley. No angel for sure - but not a killer. Yet the cold-blooded murder of your dad is the crime they locked you up for. Fuelled by grief and a burning desire for vengeance, you’ll bust out of jail intent on finding the real culprit. Once outside, you’ll need to blend with the townsfolk to avoid recapture. Establish contact with the criminal underworld and stay one step ahead of the police dragnet. Set in the deep south of the 1980s, American Fugitive is a love-letter to the classic movies and games of old. It’s a race against time, and JUSTICE AIN'T ALWAYS LEGAL. KEY FEATURES: ⯈ A MODERN TAKE ON CLASSIC SANDBOX ACTION – Rediscover the joy of top-down carnage with stunning 3D graphics and destructible environments, dramatic storytelling and epic car-chase mayhem. ⯈ A MATURE GAME BASED ON AN ORIGINAL STORY – Unravel a plot of mystery, deception and corruption, full of twists and turns, inhabited by a motley cast of law-breakers and law-enforcers. ⯈ A MASSIVE OPEN-WORLD ENVIRONMENT - Explore Redrock County on foot on by car - a beautiful and vibrant slice of 80s rural USA. ⯈ CHOOSE THE LIFE OF A FELON - Rob houses, steal cars, arm yourself to the teeth. Just don’t get caught! ⯈ PUT THE PEDAL TO THE METAL: test yourself against time trial challenges and stunt jumps dotted throughout the world, using any of the numerous vehicles. ⯈ A WEALTH OF ACTIVITIES – Whether you’re undertaking jobs for the criminal underworld, uncovering hidden stashes, looting houses, sticking up stores, or fencing fine art, remain vigilant. The crooked cops will stop at nothing to see you back behind bars!", "platform": "Nintendo Switch", "release_date": "May 23, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "Fallen Tree Games", "publishers": "Curve Digital Publishing", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://youtu.be/3m6ulrBUnPs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116091-american-fugitive\n"}