{"altername_name": [], "name": "Anarcute", "overview": "Anarcute is the cutest riot game, with a catchy art direction and unique crowd-beat’em all gameplay! These are dark times. A group of evil corporations has taken over the major cities of the world. They took control of the media, brainwashed the police and now shamelessly dictate the citizens' lives from the heights of their skyscrapers. It is time to act! Take control of the revolution to face the terrible Brainwash Patrol who’s dominating the world. United we stand! In Anarcute you’re not controlling a single character but rather a whole crowd! The bigger the crowd, the more powerful it gets. Wake up your fellow rioters in the cities and grow the revolt to unleash devastating abilities! The city is your playground Phone booth, fire hydrants, trash cans, bikes, cars… use objects from the city as projectiles. If your crowd gets big enough, you’ll even be able to take down whole buildings and make them collapse on your opponents! Fight the Brainwash Patrol Your opponents will stop at nothing and they will use all of their impressive equipment to stop you from completing your objectives. Lasers, Electric Turrets, Spider Robots, Helicopters and Mortars are some of the many traps and enemies that will stand in your way Spread the revolution across the Globe During your adventure, you will get through 5 cities with unique visual and audio settings. From Tokyo to Paris and going through Reykjavik & Miami, the Brainwash Patrol won’t give you any rest. Explore every corner of the cities to find all the animals and customize the crowd to your taste! It is time for the cute revolution! Key Facts : ※ Lead a group of adorably cute rioters and wreak havoc all over the world in your fight against evil ※ Pick up any object in the streets and throw those at the Brainwash Patrol ※ Take down any building on your path and take advantage of the city’s layout ※ Fight the Brainwash Patrol, a terrible force ready to do anything to stop you ※ Explore the world and set it free!", "platform": "Nintendo Switch", "release_date": "May 30, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Anarteam", "publishers": "Plug In Digital", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156224-anarcute\n"}