{"altername_name": [], "name": "Angry Video Game Nerd I & II Deluxe", "overview": "He's gonna take you back to the past... again! The Angry Video Game Nerd has been sucked into Game Land! It's up to you to guide him through three terrible and treacherous retro game worlds! Angry Video Game Nerd Adventures and Angry Video Game Nerd II: Assimilation come together for the ultimate Nerd experience! This is the definitive way to play the series... and more! This deluxe collection brings you every stage from both of famously tough action platform games, remixed & re-balanced plus an all-new, never-before-seen final chapter to bring the experience together for the ultimate experience in nerd rage. Featuring... Enhanced Visuals! Experience the 8-bit ugliness in a whole new way! Updated Game Engine! And by updated, we mean \"Rebuilt the first game from the ground up in the superior second game's engine.\" Trust us, it feels better. Improved level design and difficulty options! Both games are infamously hard-as-nails, but Normal and Easy difficulties come with infinite lives, so take as many attempts as you need to beat the challenge. Level designs have been improved upon to really nail the balance between tough and fair. Or perhaps you loved the limited lives and ludicrous overuse of instant-death blocks in the original release? We've got you covered. Just select \"Old School\" or higher from the difficulty menu and you'll be cursing the developers' name in no time. Quality of Life Improvements! Faster respawning (When you die, which will be often, you'll just pop right back out of the Toaster and get on with your day, just like nature intended!), multiple save slots, accessibility options and more mean that anybody can take on the challenge. Surprises! Perhaps you've never played either of these games, perhaps you're new to the sequel, or maybe you have spent years achieving the world speedrun record for both, but whatever your experience with the series, there are plenty of surprises in store for you! New Chapter, Completing The Story! \"Wait, the game had a story\" You ask? To which we say: ...Kinda! But there's more of it now! Beat both games to unlock the epic finale! And more!", "platform": "Nintendo Switch", "release_date": "October 30, 2020", "game_type": "Released", "esrb": "M - Mature", "developers": "FreakZone Games", "publishers": "Screenwave Media", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155730-angry-video-game-nerd-i-ii-deluxe\n"}