{"altername_name": [], "name": "Animal Crossing: New Horizons", "overview": "Animal Crossing: New Horizons is a life simulation video game developed and published by Nintendo for the Nintendo Switch console. It is the fifth main series title in the Animal Crossing series. As in previous installments in the Animal Crossing series, Animal Crossing: New Horizons is a nonlinear life simulation game played in real-time. The player assumes the role of a customizable character who moves to a deserted island after purchasing a vacation package from Tom Nook. The game proceeds in an open-ended fashion as the player explores the island, and develops it into a community of anthropomorphic animals. Similarly to the 2017 spin-off title Animal Crossing: Pocket Camp, the game introduces a crafting system that allows the player to convert materials into tools and furniture, which can be used to decorate the game's interior and exterior spaces. Nook Miles, a new in-game currency earned by accomplishing various tasks, can be used to purchase premium items. The game allows the player to select their character's skin color, a feature introduced in the 2015 spin-off title Animal Crossing: Happy Home Designer appearing for the first time in a main series Animal Crossing title. The game's weather also adjusts to the seasons of the Northern and Southern Hemisphere depending on the player's real-world location, a first for the Animal Crossing series. New Horizons supports both local and online co-op gameplay, with up to four players locally and eight players online able to occupy an island at a given time.", "platform": "Nintendo Switch", "release_date": "March 20, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo EPD", "publishers": "Nintendo", "genres": "Life Simulation", "max_players": "8", "cooperative": "Yes", "rating": "4.58", "wikipedia": "https://en.wikipedia.org/wiki/Animal_Crossing:_New_Horizons", "video_link": "https://www.youtube.com/watch?v=YvKwD8ngDqo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116313-animal-crossing-new-horizons\n"}