{"altername_name": [], "name": "Aqua Moto Racing Utopia", "overview": "Fun, exotic and for up to 8 players, Aqua Moto Racing Utopia brings allthe intensity of jet skiing right to you! Exotic courses, spectacular stunts, split-screen and online multiplayer:all the intensity of jet skiing on your own or with friends! Aqua Moto Racing Utopia is fun and competitive: have a blast in dozensof races, performing stunts in gorgeous environments and playing againstup to 7 opponents. 10 EXOTIC ENVIRONMENTS The environments are based on real places: theAmazon, Greece, a mangrove swamp, the tropics, the Mediterranean coast,an Atlantic port... So each race is a different challenge. 7 GAME MODES FOR ALL STYLES Championship, Freestyle Championship,Custom Race, Freestyle, Time Trial, Leisure, and Party Games. MORE THAN 50 RACES Take part in 12 championships in the runabout,ski, and freestyle divisions and make waves on your way to the top ofthe podium. 44 STAND-UP AND SIT-DOWN JET SKIS Complete races and events to earnmoney and unlock powerful watercraft. UP TO 28 STUNTS TO PERFECT Body flip, Indian air, stand up, nohander, backflip and the 360: find out how much fun a perfectly executedstunt can be. CUSTOMIZE YOUR AVATAR Name, nationality, physical appearance, gear:make your driver look the way you want, down to the color of the jet ski. CHALLENGE YOUR FRIENDS With up to 4 players on the same screen, oreach with their own console in handheld mode for up to 8 players:challenge your friends anywhere, anytime! You can also use the onlinefeature to take on up to 7 friends or other players from around the world.", "platform": "Nintendo Switch", "release_date": "April 27, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Zordix AB", "publishers": "Big Ben Interactive", "genres": "Racing", "max_players": "8", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114472-aqua-moto-racing-utopia\n"}