{"altername_name": ["Ara Fell"], "name": "Ara Fell: Enhanced Edition", "overview": "Take in the beauty of a magical world floating above the clouds, then take on a menacing race of vampires hidden in the dark. \"Long, long ago, the elven sorcerers cast a spell to save the floating world of Ara Fell from destruction. Instead, they doomed it to fall from the sky. By chance, the fate of the world has been placed in the hands of a young woman. Join her as she and her friends endeavor against all odds to save their homeland, all while the clock ticks ever nearer the final hour...\" Ara Fell: Enhanced Edition combines the best parts of Japanese-style 16-bit role playing games with the best parts of western RPGs, as well as including elements of visual novels and adventure games to create a truly unique experience. Atmosphere, emotion and surprise lie at the forefront of Ara Fell's story, driven by deep and accessible characters, each with his or her own past, their own desires and their own motivations for joining the protagonist’s quest. Join Lita and relive the golden age of RPGs with a game that both pays homage to the past greats, as well as blazing its own trail. The new Enhanced Edition features a slew of upgrades, including a revamped battle system, new character classes and skills, new side quests, an overhauled UI, upgraded crafting system, new enchanting system, enhanced aspect ratios, new difficulty modes, an autosave feature, Twitch integration, and more! - EXPLORATION - Ara Fell is a world meant to be explored! Jump, crawl, swim and even fly through the air to solve puzzles and discover new locations filled with hidden treasure, secrets and adventure! Every corner of Ara Fell is designed with exploration in mind. - OPEN WORLD - Most of the world can be explored from the moment you leave Aloria Village, the heroine's home town... provided, of course, you're strong enough. A clever explorer may be able unlock secrets and discover powerful equipment early in the game if he or she commits to taking advantage of the open nature of the game world. - TACTICAL COMBAT - Ara Fell may be a story-heavy game, but the world is still fraught with danger. Choose specialized equipment and statistics, customizing each character to best suit your play style, and to best thwart each boss battle's unique mechanics. - CHARACTER DRIVEN - When you join Ara Fell's unwitting heroine on her quest to save her homeland, you'll discover a world filled with vibrant characters who laugh, cry, crack jokes, lose their tempers, and even their will to go on as the size and scope of the curse that plagues Ara Fell becomes apparent. Friends and villains alike are not who they seem as the stakes grow ever higher…", "platform": "Nintendo Switch", "release_date": "March 26, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Stegosoft Games", "publishers": "DANGEN Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Ara_Fell", "video_link": "https://www.youtube.com/watch?v=as7cwkDHKp8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368822-ara-fell-enhanced-edition\n"}