{"altername_name": [], "name": "ARIA CHRONICLE", "overview": "Princess Aria and her party set out on a pilgrimage to carry out the Rite of Succession. En route, she learns of the disappearance of a village lord, and the involvement of an organization known as the “Cult.” In her struggles with this Cult, Aria discovers the shocking truth behind the Kingdom’s history, which drives her to make a certain bold decision... ARIA CHRONICLE is a rogue-like, role-playing game featuring dungeon exploration, strategic battles, and unique heroes with complex growth factors. Enjoy strategic, turn-based battles which are sure to keep you on your toes. An important aspect of this game is the management of each hero’s mentality, which will greatly affect their performance in battle. Be sure to keep alert to the state of your heroes, not only in battle, but also in the randomized dungeons, so that you can fully utilize the capabilities of your entire party. You can head out on a quest with a party of up to five heroes decided by you. Aria’s job can be chosen from 14 types. Each of these jobs can be further customized and enhanced by arranging various factors, including weapons, skills, and traits, to meet your strategy. The story revolves around Princess Aria, heir to the throne of the Kingdom of Tamageria. After learning of the disappearance of a village lord, Aria and her party become entangled into the clash against the mysterious organization known as the “Cult.” Aria eventually discovers a grave secret hidden behind the history of, not only the Kingdom, but the world as a whole. Through her struggles, Aria grows worthy to become the true successor to the throne. A tale that began in a seemingly peaceful countryside village gradually progresses into an epic adventure. Enjoy the unpredictable storyline!", "platform": "Nintendo Switch", "release_date": "July 8, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "STUDIO N9", "publishers": "HIKE Inc.", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373683-aria-chronicle\n"}