{"altername_name": ["Arise: A Simple Story"], "name": "Arise: A Simple Story: Definitive Edition", "overview": "Embark on an emotional journey of losing the love of one's life in the critically acclaimed Arise: A simple story, a 3D adventure game enhanced for Nintendo Switch as The Director’s Cut. Manipulate time, solve puzzles, and reshape surroundings as you push forward into the bittersweet recollections of a past life. This is a story about happiness and hardship, joy and sorrow. A story that all of us will one day experience. YOUR ADVENTURE OF LOVE AND LOSS Set out on an adventure through the changing landscapes of memories lush with feelings of love and loss. Every moment of this rollercoaster ride is a new challenge and a chance to see your life in a different light. INSPIRED ART STYLE Enter the wonderful world of memories and feelings brought to life by the talented artists from Piccolo Studio. Discover the heartfelt magic in your personal, everyday struggles thanks to the game’s soulful music and beautiful art direction. MASTERY OVER TIME Control the flow of time and change your surroundings from the shifting of seconds to entire seasons. Fast forward, move back or pause time to relive your memories and overcome every obstacle on your journey. PLAYING TOGETHER Invite a second player to help you control time and enjoy the journey together. The easy to pick-up nature of Arise keeps everyone engaged and lets them experience the emotional story to its fullest.", "platform": "Nintendo Switch", "release_date": "April 28, 2022", "game_type": "Released", "esrb": "E - Everyone", "developers": "Piccolo Studio", "publishers": "Untold Tales", "genres": "Adventure", "max_players": "2", "cooperative": "Yes", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Arise:_A_Simple_Story", "video_link": "https://www.youtube.com/watch?v=fdie3-sqYLo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163513-arise-a-simple-story-definitive-edition\n"}