{"altername_name": [], "name": "Asdivine Collection", "overview": "Asdivine Collection Includes: Asdivine Hearts, Asdivine Hearts II, Asdivine Dios, and Asdivine Menace. ♡ Asdivine Hearts: Asdivine Hearts boasts of groundbreaking visual quality, plenty of subquests, a battle arena, treasure to dig for, and an enemy guide to complete. By taking puzzle piece-like jewels and setting them in a box known as a rubix, players are able to customize characters! How far can you level and how many millions of damage can you dish out? All these challenges await you and more! ♡ Asdivine Hearts II: With a convenient summary of the previous title included, players can jump right into Asdivine Hearts II without having played the first! Utilizing a brand new team system, lead up to six characters into battle, and destroy onslaughts of powerful foes! See the amalgamation of years of RPG-crafting expertise and plug in jewels to boost character parameters as the beloved rubix makes its triumphant return. ♡ Asdivine Dios: Boasting a voluminous story, an expansive world, treasure filled dungeons, exciting turn-based battles, weapon creation, and more, the all-inclusive RPG experience is here! Plus, limitless enemies and loot, a multitude of subquests, and even bosses that will blow your mind await! ♡ Asdivine Menace: Experience immersive turn-based battles with cooperative attacks and new limit break skills! With all new quests, collecting and crafting, the battle arena, and even post-game content, Asdivine Menace comes packed with enough elements to satisfy JRPG-hungry gamers. As Izayoi deepens his bonds of trust with his spirit companions, their fates together move in new and meaningful directions!", "platform": "Nintendo Switch", "release_date": "October 5, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "EXE-CREATE", "publishers": "Kemco", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=aC2GZlKv1Ug", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372119-asdivine-collection\n"}