{"altername_name": [], "name": "Asphalt 9: Legends", "overview": "Real racing. Legendary wins. Tear up the competition in the most exciting arcade racing game on Nintendo Switch™! Collect real hypercars from the most renowned manufacturers like Ferrari, Porsche, Lamborghini, and more. Customize their looks and performance before going for a spin on tracks from around the world. Whether you race solo or against real players, the experience is nothing short of legendary! • OVER 90 REAL CARS: Unlock and customize an ever-growing number of the most gorgeous and powerful speed machines on the planet. • 100+ TRACKS: Blaze across breathtaking real-world locations with dynamic features, from the roaming tornados of the American wilderness to the rocky landslides of the Himalayas. • SOLO & MULTIPLAYER: Complete events and grow your collection in the Career mode, or compete against up to 7 online opponents in various multiplayer events. • SPLIT-SCREEN: Challenge up to 3 friends to an offline multiplayer challenge anytime, anywhere! Pick one of the 42 available tracks and show them who's best. • 4 CONTROL MODES: Master the full manual controls, specially tailored for Nintendo Switch™, or try the innovative TouchDrive™ commands that streamline steering so you can focus on the fun! You can also use Tap-to-Steer or Tilt-to-Steer controls with a customizable interface. • QUICK RACE OFFLINE: Challenge your personal best while racing alone or against the AI in the Quick Race and achieve your best time on every single track, both online and offline. • WEEKLY UPDATES & EVENTS: Enjoy fresh events, new content, and exciting rewards every week!", "platform": "Nintendo Switch", "release_date": "October 8, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Gameloft", "publishers": "Gameloft", "genres": "Racing", "max_players": "8", "cooperative": "No", "rating": "4.07", "wikipedia": "https://en.wikipedia.org/wiki/Asphalt_9:_Legends", "video_link": "https://www.youtube.com/watch?v=HBg5vBKVR_M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122555-asphalt-9-legends\n"}