{"altername_name": [], "name": "Asteroids: Recharged", "overview": "How long can you survive the depths of space in this fresh revival of the classic arcade shooter? Pilot solo or recruit a friend for local co-op across 30 challenges or arcade mode. The original space shooter warps to the modern era! Asteroids: Recharged has been reimagined for modern gameplay, with vibrant visuals, powerful new abilities, and another original soundtrack from award-winning video game composer Megan McDuffee. Asteroids: Recharged creates a familiar, but revitalized and modern challenge to both old school and new high score chasers. And 30 unique and creative challenge levels take the space shooting gameplay into new territory, complete with local and global leaderboards. An entirely new collection of power-ups -- including spread shots, rail guns, reflector shields, and more -- will help stave off splintering asteroids and aggressive UFOs. Co-op play lets you play with a friend, and ramps up the intensity as players do their best to coordinate and survive. Key Features: • Old Meets New: Classic Asteroids gameplay updated with refined control, and modern visual flourishes • Power Up: Blast pink UFOs to pick up deadly benefits like explosives asteroids or a black hole shot that sucks in all enemies in its radius • Challenge: Compete in a series of 30 challenges designed to put even the most seasoned players to the test • Compete: Reach the top of global leaderboards for arcade and individual challenge modes • Bring a Friend: Play local co-op in every mode, surviving the depths of space together • Get in the Groove: Space out to an original score by Megan McDuffee", "platform": "Nintendo Switch", "release_date": "December 14, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "Adamvision Studios", "publishers": "Atari Interactive", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/Xt3b8EJlmws", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157341-asteroids-recharged\n"}