{"altername_name": [], "name": "Asterix & Obelix: Heroes", "overview": "Asterix, Obelix and their friends are back in a tactical game. The year is 50 BC. Gaul is entirely occupied by the Romans. Well, not entirely... One small village of indomitable Gauls still holds out against the invaders. USE YOUR CARDS INSTEAD OF YOUR FISTS Fight using the cards, upgrade your heroes and add to your deck during the adventure. Each card has specific characteristics, from inflicting heavy damage with a menhir to healing a hero with one of Getafix's potions! It's up to you to adapt to each round, making the right choices, so you can foil the plans of the crazy Romans. ASTERIX, OBELIX… AND OVER 20 ICONIC CHARACTERS FROM THE COMIC Asterix et Obelix are here, of course, and so is the entire village and their friends, all ready to set off on an adventure. Cacofonix the bard, the faithful Dogmatix, Unhygienix the fishmonger and even Queen Cleopatra: they're all ready to fight! Unlock up to 24 heroes, each with an ultimate skill and unique characteristics. THE TREASURE OF TOUTATIS The village is again under threat… Caesar is seeking a treasure that will enable him to conquer ALL Gaul. Asterix, Obelix and their friends have to find it before he does in order to foil his plan. But be careful, the path ahead is fraught with peril. Use your cards wisely so you can avoid the traps set by the Romans. During your quest, you will travel across 6 regions well known to fans of the series, while you take on the Roman legions, of course, as well as the pirates, Egyptians, Vikings, and even wild animals.", "platform": "Nintendo Switch", "release_date": "October 5, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nacon", "publishers": "Gamexcite", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=uXpA413Na5c", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/374320-asterix-obelix-heroes\n"}