{"altername_name": [], "name": "Asterix & Obelix Slap Them All! 2", "overview": "A double helping of slaps! The humble country life of Asterix, Obelix and the other villagers is interrupted by the sudden arrival of Justforkix, who has come seeking help. He reveals that his father, Doublehelix, has been imprisoned for a theft he did not commit... The Lutetia Eagle, the precious golden emblem of the Roman legions, has just been stolen, and an innocent man has been thrown in jail! Asterix promises to investigate and asks Justforkix to stay safe in the village. The two Gallic warriors head to Lutèce to get more information from an acquaintance known to be well-informed about the rumors and intrigues of the city... And obviously, they won’t find the answers they need on their long journey without a healthy dose of slaps! Asterix & Obelix – Slap them all! 2 is a slap-filled Beat’em Up with an original storyline. You’ll visit many different places along the way: forgotten ruins in a murky forest, the largest Roman camp ever, and even Lutèce... A journey towards distant lands, packed with diverse environments, punctuated by numerous encounters and, of course – featuring a generous distribution of slaps! All accompanied by original animated scenes that bring the story to life! Asterix & Obelix – Slap them all! 2 takes the fighting to the next level with more enemies and bosses, as well as many new features and gameplay improvements. In addition to their unique moves that they can “charge”, and more dynamic and fluid fights, Asterix and Obelix also benefit from a Fury mode and a devastating Ultimate attack. Not to mention the possibility of destroying certain elements in the environment and throwing barrels or menhirs in combat! The Romans and all other enemies better watch out! FEATURES - Beautiful, brand new levels, from Lutèce to... the end of the world! - A action-packed storyline, full of twists and turns. - A new Fury mode that can be activated in combat... - ... and a unique Ultimate attack for each character. - New enemies and bosses to deal out the slaps to! - The ability to destroy certain elements of the environment. - Locations and characters faithful to the comics. - Play with 2 players in local Co-op mode. - An original story with animated scenes.", "platform": "Nintendo Switch", "release_date": "November 20, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Mr. Nutz Studio", "publishers": "Microids", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=qmDKW14uucc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/374322-asterix-obelix-slap-them-all-2\n"}