{"altername_name": [], "name": "Asterix & Obelix XXL: Romastered", "overview": "Asterix and Obelix make an XXL comeback in a Romastered version full of Romans! The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely... One small village of indomitable Gauls still holds out against the invaders. And life is not easy for the Roman legionaries who garrison the fortified camps of Totorum, Aquarium, Laudanum and Compendium. Peace reigns in the small Armorican village, where the villagers go about their daily business. Our two heroes, Asterix and Obelix, hunt wild boar, the blacksmith and the fishmonger quarrel, and the village chief strolls around the village square atop his shield. After a fine day's hunting, Asterix and Obelix return to find their village in flames, pillaged by the Romans! They set off to rescue their fellow villagers, accompanied by their faithful Dogmatix. Their journey will take them to Normandy, Greece Helvetia, Egypt and, finally, Rome, in order to save the villagers from the clutches of the emperor Caesar... Rediscover the first XXL adventure of your favorite Gauls in this fully romastered version! Toggle between Asterix & Obelix et travel accross various regions of the world such as Greece or Egypt to set free Impedimenta, Panacea, Getafix and the other villagers. Fight all the Romans, pirates and Vikings who will stand in your way! Nothing can stop you with magic potion. Cherry on the boar, 4 NEW GAME MODES are available: - Course mode for stunt lovers - Countdown mode for speed freaks - Extreme mode for the bravest Gauls. - Retro mode to switch to the original graphics anytime!", "platform": "Nintendo Switch", "release_date": "October 22, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "OSome Studio SARL", "publishers": "Microids", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=sLEELhn3XJo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155734-asterix-obelix-xxl-romastered\n"}