{"altername_name": [], "name": "Astria Ascending", "overview": "Explore a vast world on the brink of chaos in a mature, emotional JRPG. Experience an epic story with rewarding, turn-based combat and expansive customization rendered in glorious hand-drawn visuals. Explore the vast and beautiful world of Orcanon Visit five different cities populated by unique creatures and solve more than 20 dangerous dungeons. With over 50 hours of game-play and a range of fun mini-games - including shoot ‘em ups, an original fantasy-themed card game and challenging environmental puzzles. A grand tale of fate and sacrifice Immerse yourself in a fascinating narrative rife with betrayal, sacrifice and terrors. A story based around adult characters, Astria Ascending offers a more mature experience and extensive dialog. A rewarding, turn-based combat system Fight over 200 different monsters in captivating, turn-based combat. Collect and summon legendary beasts into the fight and build up your power to wield legendary Cosmo Breaks. Meet an unforgettable cast of characters Pick from eight customizable characters spanning a range of fantastical races and skills, and assemble a heroic team that must sacrifice everything to save the world. With 20 classes to choose from and an array of unique skills to command, their fates are doomed, but the world is not. A hand-drawn adventure crafted with skill and passion From a team featuring developers from Final Fantasy, Nier Automata and Bravely Default, Astria Ascending includes full voice acting in Japanese and English, a traditionally animated, fully hand-drawn 2D world and a dynamic weather system.", "platform": "Nintendo Switch", "release_date": "September 30, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Artisan Studios", "publishers": "Plug In Digital", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=MLRGFHnVZ1U", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155398-astria-ascending\n"}