{"altername_name": [], "name": "Astro Duel: Deluxe", "overview": "Astro Duel: Deluxe is a same-screen, retro shooter arena party game and an updated version of the original Astro Duel. Up to six players participate in quick game rounds in individual and team-based battles, with a goal to destroy opponents' ships or pilots, depending on the game mode. Players can compete against each other or team up against the AI. The game has multiple modes: Classic (4-player), Chaos (6-player), and Party (4-player, using any combination of touch screen or controllers). The game supports multiple controller types, including Joy-Con controllers (paired, horizontal, or vertical mode), Nintendo Switch Pro Controller, and touch screen. Ships are armed with offensive and defensive power-ups including missiles, lasers, jousters and shields. Areas are often dynamic with hiding places and hazards. The ships need to avoid turrets, death beams, and black holes. Many game modes can be mixed up with Ggame modifiers (enable asteroids, starting power-ups, super dashes etc.) Compared to the original game this version adds a Chaos mode for up to six players, a Party mode that supports touch-screen play, and gameplay mechanics balanced for mixing touch and controller play, and a Team Annihilation game mode that combines gameplay mechanics for the Pilot Hunters mode (run over pilots) with the Team Deathmatch mode. There are also two new pilots (Box Cat and Chomper) and a Sudden Death mechanic where killing beams ignite on both sides of the screen, and narrow down on remaining players. In the wacky Touch mode ships can only turn in one direction and in Ship Hunters players battle for the most kills. Also new to this version are instant replays after completing a round, new music, stereo sound, localization for 12 languages, and several miscellaneous gameplay and polish additions.", "platform": "Nintendo Switch", "release_date": "May 30, 2017", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Panic Button", "publishers": "Panic Button", "genres": "Shooter", "max_players": "6", "cooperative": "No", "rating": "2", "wikipedia": "https://en.wikipedia.org/wiki/Astro_Duel_Deluxe", "video_link": "https://youtu.be/jaR6VpwZUAk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/143117-astro-duel-deluxe\n"}