{"altername_name": [], "name": "Atelier Mysterious Trilogy: Deluxe Pack", "overview": "The definitive edition of the Atelier Mysterious trilogy titles, featuring new content and a variety of previously released downloadable content! The Games: Atelier Sophie: The Alchemist of the Mysterious Book DX: The 1st instalment, \"Atelier Sophie\", is back in DX form! The Mysterious series combines heart-warming everyday elements with extraordinary experiences in a world full of wonders. As a fledgling alchemist, Sophie works with Plachta on various alchemic recipes in order to hone her skills. As they learns new recipes, explore the fields, collect materials, and synthesize new items, the power of alchemy and Plachta's memories begin to come to life. Atelier Firis: The Alchemist and the Mysterious Journey DX: The 2nd instalment, \"Atelier Firis\", is back in DX form! The Mysterious series combines heart-warming everyday elements with extraordinary experiences in a world full of wonders. Together with Sophie and Plachta, the two alchemists who she meets by chance, Firis ventures to the outside world and learns alchemy from Sophie. In order to take the official certification exam in a year, she must practice her alchemy skills, complete tasks, and search for “licensed alchemists” in the towns and villages she visits to collect recommendation letters. Atelier Lydie & Suelle: The Alchemists and the Mysterious Paintings DX: The 3rd instalment, \"Atelier Lydie & Suelle\", is back in DX form! The Mysterious series combines heart-warming everyday elements with extraordinary experiences in a world full of wonders. Hone your alchemy skills by exploring the mysterious worlds inside paintings and collecting ingredients through exploring and defeating monsters. Aim to become the best atelier in the kingdom by completing many requests and tasks and raising your atelier rank.", "platform": "Nintendo Switch", "release_date": "April 22, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Gust", "publishers": "Koei Tecmo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=gFKM9EavoY4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372139-atelier-mysterious-trilogy-deluxe-pack\n"}