{"altername_name": [], "name": "Azure Striker Gunvolt 3", "overview": "The next installment in the high-speed 2D action Gunvolt series is finally here with Azure Striker Gunvolt 3. Balancing both an involving story and satisfying gameplay, Gunvolt 3 is the most extravagant entry in the series yet! Play as both new star Kirin and series protagonist Gunvolt as you switch between them on the fly while conquering Gunvolt 3's many stages and bosses. Story Mode+ which keeps the exciting action uninterrupted by the rich story. New to Gunvolt 3 are Image Pulses, collectable summons and equipment called forth from Gunvolt's own memories. Over 150 varieties are available to collect! Gunvolt 3 was developed targeting the Nintendo Switch™ hardware, allowing for more crisp visuals and astounding effects to go along with the high-speed action! ■ Satisfying swordplay meets light-speed superpowers! Experience the exhilarating 2D action your own way! Take control of Kirin's stylish sword action or Gunvolt's devastating lightning powers to clear stages with show-stopping abilities! ■ The thrilling near-future dystopian story plays out in real-time with \"Story Mode+\"! Characters talk and banter without interrupting gameplay thanks to Story Mode+, allowing their personalities to shine and the story to develop without diluting the action experience. Full English voices are available along with the original Japanese! ■ New songs from \"The Muse\" Lumen heat up the battle! Put on a show with your gameplay to earn \"Kudos\" points and the virtual pop idol Lumen will start a performance of her own, replacing the stage track with a vocal pop song! 7 brand new songs are included alongside a large selection of classic songs from the series. ■ Kirin and Gunvolt's team-up creates a new power - \"Image Pulse\"! Collect over 150 types of \"Image Pulses,\" giving form to Gunvolt's memories. Image Pulses allow you to summon comrades and rivals from Gunvolt's past to attack, grant abilities, and more.", "platform": "Nintendo Switch", "release_date": "July 28, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "Inti Creates", "publishers": "Inti Creates", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Azure_Striker_Gunvolt", "video_link": "https://www.youtube.com/watch?v=heDpzWIqo54", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164604-azure-striker-gunvolt-3\n"}