{"altername_name": [], "name": "Bake 'n Switch", "overview": "Violently cute couch co-op and PVP party brawler for 2-4 players. Catch, merge, and sacrifice delicious Dough creatures before time runs out! It has been centuries since the Master Bakers left the World of Fla, the fabled lands of living Dough. But something is rising again. The Mould is back! More powerful and infectious than ever before. It's spread to all corners of the World, gobbling up every species of Dough it comes across. Turning them sour. Changing their behaviors into twisted versions of their former selves. As the World crumbles above, the ancient Guardians rumble below. Awoken from their slumber to fulfill their sworn duties to protect the Doughy creatures of Fla. However, hundreds of years of hibernation have not fared the Guardians well. They are hangry. Real hangry. With an insatiable penchant for baked goods. So, the Bakers must bake. Sacrificing the adoughrably cute Bun creatures to win favor with the Guardians; their only hope of vanquishing The Mould. Join a crew of Apprentice Bakers on their journey to learn the unique abilities that set them apart. Get ready to face the Guardians of each World, unlock the story behind The Mould infection, and fulfill your destiny to become a Master Baker! 100 LEVELS Whether you're a casual party gamer or a couch co-op veteran, Bake 'n Switch has increasingly challenging dynamic courts that will keep you coming back for more! Put your friendships to the test, and beat the Dough out of each other in PVP or Team v Team levels. With unlockable levels - Hit the max 3-Stars on any level, and increase the heat by taking on its Stormy variant. 7 BUNS These cheeky Buns have unique behaviors that can prove useful or troublesome; LIL' BUN - Grow this Bun and watch them do the work for you, as they find themselves too tasty to resist. Chomp, chomp! DOUGHDOUGH - Not the smartest birdy Bun in the batch and scares easily. Try herding them toward the oven and watch them hop right in. DOUGHRILLA - Dance monkey, dance! They've got music in their feet when they hear that jungle beat. ARMADOUGH - Tough on the outside, but... nope, just tough! Use these curly croissants as giant bowling balls to smash through flavors and barriers. BUNBOA - A sneaky Bun who burrows in the sand for surprise attacks, and constricts your enemies. FLUFF FOX - Work as a team to corner these fast foxes. Just look out for their stunning tailspin. BATLAVA - This guy sucks. Literally! With a super sweet-sharp tooth, They'll suck the flavor right off of those Buns. 6 BAKERS Work together or battle it out to catch, merge, and bake the biggest Buns and bag the highest scores. Choose from 6 Bakers with gameplay abilities; GINGER - The fiery lab tech with Bun-doubling serums, and a fierce pony-tail whip. PARSLEY - A shy Baker with a feisty feline friend that causes kitty chaos on command. ROSEMARY - Whack-a-Dough with Granny Rosemary, the fastest rolling pin swinger in the World. SAGE - Whisk up witchy brews that exterminate Mould and instantly bake Buns. SALT - This seasoned pro catches runaway Buns with his grappling-hook. THYME - His powerful mitts emit flames that bake on the spot. With 12 different enemies to fend off and 2 Bosses, you'll knead to find the right Baker for the task in hand. Whatever your style, there's a Baker to match. You can even change their color to suit your mood. Or get those max scores to collect enough stars to reveal new character costumes! 2 WORLDS From beaches where the Doughs go to relax in pineapple pools, to deserts scorched by honey-lava or lush forests with watermelon puddles. TROPIC TOASTER - A lush, verdant chain of tropical islands inhabited by tribes that worship a lizard Guardian called Maurice. Flavors: Pineapple, Watermelon, and Coconut pools. SERRADURRA - A sandy mirage of vividly contrasting rocks. The hardy inhabitants take shelter in the hidden oasis. The beetle Guardian, Bob slumbers in these lands. Flavors: Honey-Lava, Cinnamon Storms, and Pomegranate Boulders.", "platform": "Nintendo Switch", "release_date": "September 10, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Streamline Games", "publishers": "Streamline Media Group", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155739-bake-n-switch\n"}