{"altername_name": [], "name": "Banner of the Maid", "overview": "A Heroic Story of the French Revolution Banner of the Maid is a Turn-Based Strategy Game set in the late 18th century to early 19th century, based on the alternative history of the French Revolution. At the end of 18th century, as the House of Bourbon was on the verge of clasping, Louis XVI of France planned to secretly escape from his country. Starting from the French Revolution, the wave of chaos swiped across Europe. Follow the steps of our protagonist, the young female officer Pauline Bonaparte, to start her journey as a regular officer and win battles both on the battlefront and in the political vortex of Paris, and finally write her own heroic story. Salon Socialization and Political Struggles In the heat of the French Revolution, the Royalists, Club des Feuillants, Club des Jacobins and Malmaisons, various factions contend with each other on the grand stage of Paris. Starting from the eye of storm, the Malmaison Salon, Pauline Bonaparte have to approach the factions, complete their quests and challenges in order to establish connections with political figures and win over their support, gather funding to improve her weaponry and equipments, secure army supplies while she also tries to discover and unveiled the secrets of the Maids that are buried deep inside the City. A vast collection of characters with special talents The storm of the French Revolution and the mysterious Maids had changed the fate of the entire Europe. The revolution is a time of heroes: talented and trustworthy generals, secret agents of the Royal Family, even musicians who possesses extraordinary talents. More than 30 characters with distinct background will be available for you to command. Hire them to be one of your own, understand their stories and cultivate them to be your unstoppable force on the battlefields. Master the European battlefields Command the iconic troops of the 18th and 19th century such as Line Infantry, Skirmisher, Calvary, Artillery and much more through the Turn-Based Strategy combats to experience the reimagined European battlegrounds. Train your commanders to improve their abilities and learn the appropriate tactical skills, defeat powerful enemies! Varied and detailed combat environments Over 30 maps, including cities, plains, snowy mountains, etc. Utilize the unique elements on the battlefields to ensure advantages. - Critical terrain elements that provide advantages and disadvantages during battles; - Different key locations that provide unique support to different types of troops; - Special events that take place on the battleground as the story progresses; - Environment changes such as storm, heavy snow, thick fog, dark nights, etc.", "platform": "Nintendo Switch", "release_date": "August 12, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "CE-Asia", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "https://youtu.be/wr1RUU-4MPU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/142537-banner-of-the-maid\n"}