{"altername_name": [], "name": "Bat Boy", "overview": "Save your friends from the clutches of the evil Lord Vicious and stop the Trials of Darkness! Interdimensional mage Lord Vicious has brainwashed Bat Boy’s fellow teammates in order to participate in the Trials of Darkness, a heinously brutal series of athletic events! It’s up to Bat Boy to team up with the mouthy crow Garou, traversing a hostile world to free the minds of his sports-hero teammates before they fall victim to the trials. Along the way, Bat Boy will encounter a variety of characters, some allies, most not, as he fights his way to the final confrontation with Lord Vicious. Bat Boy pits the titular hero against the former allies of his sports team with heroes such as Racket Girl, Shinai Guy, Aquaria and Mr. Blitzer, among others as he travels through the many regions beyond Lord Vicious' dimensional gateway! Features: • A thrilling 2D platforming adventure set against rich, nostalgic 8-bit backdrops. • Swing, deflect, spin and power-hit your way through exciting baseball-style combat! • Explore a vast world of unique and exciting environments, ultimately leading to a showdown with one of Bat Boy’s brainwashed allies! • Take on the powers of your allies as you free them from the influence of Lord Vicious! • Glorious 8-bit visuals, reminiscent of early legendary platformers. • High octane chiptunes from Evader Music, composer for Smelter and Super Sami Roll. • Dozens of enemies, exciting bosses, and intriguing companions to encounter! • Make your way to your allies using your baseball bat to go up against Lord Vicious' goons and solve puzzles! • Hidden secrets, collectibles, unlockable music and more to find!", "platform": "Nintendo Switch", "release_date": "May 25, 2023", "game_type": "Released", "esrb": "Not Rated", "developers": "Sonzai Games", "publishers": "X PLUS", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=khDDCG1gwcg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369811-bat-boy\n"}