{"altername_name": [], "name": "Batman: The Telltale Series", "overview": "The player-protagonist of Batman is Bruce Wayne, secretly also the titular character. He is the CEO of Wayne Enterprises and the heir to the Wayne Fortune, who uses his wealth to fund his activities as a vigilante. Wayne is assisted in his operations by Alfred Pennyworth (Enn Reitel), his butler and former guardian, and Lucius Fox (Dave Fennoy), the head of technology at Wayne Enterprises. Wayne is also friends with Harvey Dent (Travis Willingham), the District Attorney and Mayor candidate, and an associate of Vicki Vale (Erin Yvette), a reporter for the Gotham Gazette. As Batman, he also receives occasional help from James Gordon (Murphy Guyer), a lieutenant and contact in the Gotham City Police Department, and Selina Kyle/Catwoman (Laura Bailey), a skilled thief who works with him if their needs align. The main antagonists of the series are a terrorist organization called the \"Children of Arkham\", lead by a masked figure called \"Lady Arkham\" (Steve Blum). Members of the group include Oswald Cobblepot/Penguin (Jason Spisak) and Roland Desmond/Blockbuster (also voiced by Blum). Common criminals that appear in the game include Carmine Falcone (Richard McGonagle), the head of the Falcone Crime Family, and Hamilton Hill (Robert Pescovitz), the corrupt mayor of Gotham. Whilst at Arkham Asylum, the player also meets various inmates, including convicted serial killer Victor Zsasz (Kiff VandenHeuvel), former ventriloquist Arnold Wesker (Larry Brisbowitz), and the mysterious \"John Doe\" (Anthony Ingruber). Other characters that appear include Renee Montoya (Krizia Bajos), a police Sargent who distrusts Batman, Peter Grogan (Robert Clotworthy), the current police Commissioner, Regina Zellerbach (Lorri Holt), the chairwoman of Wayne Enterprises, and Jack Ryder (also voiced Clotworthy), a reporter for the Gotham City News channel. Bruce's deceased parents, Thomas and Martha Wayne (voiced by Baker and Holt, respectively), and their murderer, Joe Chill (Jarion Monroe), also appear in flashbacks.", "platform": "Nintendo Switch", "release_date": "November 14, 2017", "game_type": "Released", "esrb": "M - Mature", "developers": "Telltale Games", "publishers": "Telltale Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Batman:_The_Telltale_Series", "video_link": "https://www.youtube.com/watch?v=HdURM3VWQLY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91357-batman-the-telltale-series\n"}