{"altername_name": [], "name": "Battle Princess Madelyn: Royal Edition", "overview": "Who needs Sir Arthur when you've got Princess Madelyn?! Battle Princess Madelyn: Royal Edition is a game that's heavily influenced by classics like \"Ghosts 'n Goblins\" and \"Wonder Boy 3: The Dragon's Trap\". Players control Madelyn, a young knight in training, who sets out on a journey to save both her family and the kingdom from an evil wizard. Accompanied by her ghostly pet dog, Fritzy, she travels through various landscapes, confronts challenging enemies, and solves puzzles that block her path. The game successfully integrates elements of classic arcade gameplay with modern enhancements, presenting players with both a nostalgic experience and fresh challenges. Royal Edition vs. Standard Release: • Improved Gameplay: The Royal Edition introduces gameplay tweaks and adjustments that provide a smoother and more balanced experience. This can include repositioned checkpoints, modified enemy behavior, and improved controls. • Enhanced Graphics and Audio: While the core art style remains the same, some visual and audio enhancements offer a richer and more immersive experience in the Royal Edition. Expect updated animations, improved backgrounds, and reworked soundtracks. • Additional Content: New levels, enemies, and challenges have been added, giving players more to explore and conquer. • Reworked Story Scenes: Some story sequences have been revamped or expanded upon to provide better context and understanding of Madelyn's journey. • Quality of Life Improvements: General improvements, such as more intuitive menus, HUD modifications, and faster load times, make the game more user-friendly. • Bug Fixes: Any existing bugs or glitches from the standard release have been addressed and corrected in the Royal Edition, ensuring a smoother gameplay experience.", "platform": "Nintendo Switch", "release_date": "April 9, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Monster Bath Studios", "publishers": "Causal Bit Games", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Wh46lqpgNtQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/129255-battle-princess-madelyn-royal-edition\n"}