{"altername_name": ["Battleship"], "name": "Battleship: The Classic Naval Combat Game", "overview": "The Classic Naval Combat Game Call out your coordinates, fire your missiles and... HIT! You sank my BATTLESHIP! Play a classic game of BATTLESHIP based on the popular Hasbro board game or bombard the enemy with airstrikes, mines and surgical strikes in the brand new Commanders mode. It takes a tactical commander to sink your opponent’s fleet before they find yours. BATTLESHIP features: - Classic mode - A faithful conversion of the classic Hasbro board game Sink your opponent’s carrier, cruiser, submarine, destroyer, and battleship Find their fleet before they sink yours Call your shot and fire! - Commanders mode - A brand new, more tactical version of the game Enhance your turn with special abilities, place a mine, use sonar or fire a bomb Play as navy commanders with unique abilities such as airstrike and salvo New ship and grid shapes keep the game unpredictable - Single player - Battle against AI Commanders and raise your game before heading into multiplayer! - Online multiplayer - Take on the world or your friends in a 1v1 game Cross-platform multiplayer compatible - Local multiplayer - Play together in your living room or on the go Requires the free ‘Battle Grid Companion’ app, available on iOS and Android - Unlock historical Commanders and Arenas - Unlock 7 unique commanders and arenas inspired by historical naval battles from World War 2, the Age of Sail and Ancient Times Including William Karslake, Sir Philip Wade and Astrid Stormur, the Viking Commander Man your battle station, command your fleet and sweep your enemy off the board!", "platform": "Nintendo Switch", "release_date": "December 24, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Marmalade Game Studio", "publishers": "Marmalade Game Studio", "genres": "Board Game", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155756-battleship-the-classic-naval-combat-game\n"}