{"altername_name": [], "name": "Battle Chef Brigade: Deluxe", "overview": "Vive la Brigade! Welcome to Victusia, where the members of the elite Battle Chef Brigade are revered for their ability to skillfully take down monsters and transform their kills into delicious cuisine! But getting in isn't easy; chefs from across Victusia must vie for their spot in a high stakes competition. Follow two contestants, Mina and Thrash, as their journeys through the tournament unfold. In order to become a Brigadier you'll need to hunt monsters with combo-based attacks and prepare your freshly-caught ingredients in puzzle-based cooking challenges to serve up winning dishes to the judges – all while the round clock ticks down. An “Extra Helping” of Features • Play as two chefs, brought to life with colorful illustrations and VO, in a charming campaign that’s equal parts old school brawler and combo puzzling, with a light sprinkling of RPG progression on top. • Welcome Ziggy, the Undead Necromancer Chef, now playable in Local Multiplayer, Break the Dishes, Survival, and Free Play. • If that’s not enough for you, test your might against fellow Brigadiers with the addition of Local Multiplayer! Play as Mina, Thrash, and even Ziggy in an epic battle where YOU make all the rules. Who will come out on top? • Extra Modes that test your cooking prowess including: Daily Cook-Off, Restaurant Rush, Break the Dishes, and the BRAND NEW Survival Mode leaderboards where you can show off your culinary creations. • Hone your skills in a BRAND NEW Free Play Mode and find the ultimate cooking combination. • Collect and enjoy the brilliant illustrations of Battle Chef Brigade in the BRAND NEW Art Gallery.", "platform": "Nintendo Switch", "release_date": "November 20, 2017", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Trinket Studios", "publishers": "Adult Swim Games", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/aQF9cwfUiNU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156260-battle-chef-brigade-deluxe\n"}