{"altername_name": [], "name": "BDSM: Big Drunk Satanic Massacre", "overview": "BDSM is the first satirical action RPG where you get to play Lou, Satan’s son! Get some milk, kill the traitors, save Hell and rescue the hottest demoness from the clutches of those nasty people and mega-corporations! Big Drunk Satanic Massacre is basically a shooter with strong RPG elements - not that rocket propelled gun, though. The game itself takes place in Hell where the main hero, Lou, is to find milk and rescue the hottest Mistress from the clutches of a fat clown. The game consists of four levels / chapters representing different areas of Hell, such as the hellish Big Wac fast food café, Skeleton Slums and the Red Light District. The idea behind those levels is to kill specific bosses. Each boss represents a unique multistage fight and it is pretty challenging. The player has to choose between six weapons and one magical ability. The main feature of the game is that Lou is healed by milk. The more he drinks, the more his blood milk level increases, which is sort of good for him. As a result there may be either negative or positive effects. Ever wondered what it's like to be Satan's son? Nothing special... Unleashed lust, chronic alcoholism and reckless shooting - the usual routine Save Hell! Wait... What? Yup, that's right - Hell! It's not the place it used to be - Hell's been possessed. Possessed by the most vile dark hideous evil the world has known - people. They've turned your precious homeland into a madhouse, and only you can stop them! What's in it for you? Spectacular locations, battles with epic bosses and a nice mixture of pain and nonsense. Choose the right side of evil and rescue your \"princess\" - the most badass dare-deviless Hell has ever seen. The game contains graphic violence, blood and gore.", "platform": "Nintendo Switch", "release_date": "October 10, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "Big Way", "publishers": "Big Way", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://youtu.be/YnG6suVa2iw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156306-bdsm-big-drunk-satanic-massacre\n"}