{"altername_name": [], "name": "Beholder 2", "overview": "Indie Adventure Strategy Cold, gray, forbidding walls stretch to the sky. Massive oak doors conceal the most important secrets of the State. This is where fates are decided. This is the Ministry! Welcome, intern! You are now a part of the SYSTEM! We have entrusted you with work of great importance. As part of the Ministry, you are expected to perform your duties with impeccable thoroughness. While you are now at the bottom of the career ladder, that is more than many of your fellow citizens will ever achieve! You will work hard for the public good and help thousands of citizens. Your efforts won't go unnoticed. In fact, the Wise Leader himself will decorate you with official honors! Yet... You are not going to dust off the applications of insignificant citizens, are you? No, pushing papers is not your cup of tea! Your goal is the Prime Minister's seat! You'll get there, too, and destroy anyone who dares to stand in your way! Scheming and blackmailing are just the tip of the iceberg – and the ends justify the means! But… How did you end up here? Could you have landed this job on your own? No, that would have been next to impossible! So, who sent you and – more importantly – why? They want what?? NO!! No one can know this! Otherwise, your will career end before it begins! How are you going to do what you must do? Are you even going to pursue that goal? After all, you are now an officer of the Ministry, with the power and freedom to shape your own future! So what will you become? The choice is still yours to make!", "platform": "Nintendo Switch", "release_date": "August 15, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "Warm Lamp Games", "publishers": "Alawar Premium", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118324-beholder-2\n"}