{"altername_name": [], "name": "Billion Road", "overview": "Travel across Japan and make your fortune in Billion Road! Earn money by landing on property squares and invest in places like a sushi restaurant in Ginza or an animation goods store in Akihabara. Along the way, look out for errant monsters that may shower you with riches... or throw a wrench in your plans! Make it around the board to enrich yourself while ruining your rivals’ plans. Whoever finishes with the most money wins! • Brains, Bravado, and Lucky Breaks! Dice and random events will help decide your fate... but you’ll also need to invest wisely, take calculated risks, and rely on the whims of unpredictable monsters if you want to become Japan’s next billionaire! • Over 30 items and 50 monsters! Use them to push your opponents around, ruin their investments and make their lives miserable. But be careful, because while they may help you earn money and pull ahead, they can also make bad purchases or investments on your behalf. This can change the game at a moment’s notice, so study the monsters well to make sure you know when to walk away! • Tournament Mode is a single-player version that lasts for 30 in-game years, while Skirmish Mode is a quick multiplayer experience that lasts a mere 36 months. Whether long or short-term, it’s sure to get the adrenaline pumping! • Show 'em who’s boss! Play with your buddies locally or play online! • Hidden maps like Monster Island! • Family-friendly game that teaches kids the importance of investments!", "platform": "Nintendo Switch", "release_date": "April 16, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Bandai Namco Entertainment", "publishers": "acttil", "genres": "Board Game", "max_players": "", "cooperative": "Yes", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=8cUzI4kuzVY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134292-billion-road\n"}