{"altername_name": [], "name": "Bite the Bullet", "overview": "You are what you eat! Run, Gun and Eat your way through this roguelite RPG shooter where every enemy is edible. Shoot fast. Eat big. Satisfy your appetite for destruction. Bite The Bullet is the world’s first Run & Gun & Eat. In this roguelite RPG shooter you must eat enemies, bullets and more to powerup your character, weapons, and abilities. Gun down zombies, robots and giant mutant bosses with a barrage of bullets before chowing down on their corpses to craft new weapons, unlock new abilities and special attacks, and transform into a powerful Zombro form to smash foes. Explore four character classes and a skill tree based on your diet – and remember, you are what you eat! How you play is driven by how you choose to eat. The carnivorous Gorivore or vegan Slaughterer of the Soil that have their own unique abilities and perks, changing how you defeat enemies and navigate levels. Customize your character with every choice and every bite. Maximize your build for your playstyle, run the world again with a different diet for a new challenge, and team up with a friend in co-op to ramp up the bullets and the calories. Features: • Devour enemies to powerup your character, weapons, and abilities! • Chow down on everything - enemies, walls, even bullets! • Play solo or with a friend in local co-op. • Four character classes (Carnivore, Herbivore, Omnivore, and Robovore - which means you eat metal) that have their own unique abilities and perks. • Gorge yourself on 50 Levels. • Customize your character with a deep, branching skill tree. • Loot powerful weapons with fun modifiers, like Spicy Critter Cannons and Organic Meat-Seeking Missiles! • Craft exotic new weapons by wolfing down special types of characters and enemies! • Eat enemies so you can burn calories to energize your skills and special attacks! • Use a highly advanced shield to protect yourself from oncoming fire or knock enemies away! • Earn action hero bandanas by fully completing each world! • Chew carefully - every enemy has its own nutritional information, and your body type will change based on the types of enemies you consume! • Transform into your powerful Zombro form and smash enemies into bite-sized bits! • Gobble up an exciting plot with a ton of sidequests!", "platform": "Nintendo Switch", "release_date": "August 13, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Mega Cat Studios", "publishers": "Graffiti Games", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=EZ82pqM66aA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155678-bite-the-bullet\n"}