{"altername_name": [], "name": "Black Bird", "overview": "A bird of happiness, or fowl fortune? Feathers black, all lives consumed! This is the tale of a young girl who dies one day on a street corner and is reborn as the ominous Black Bird. The bird is one of the great calamities, spoken of in the kingdom since ancient times. Become the calamity, ‘Black Bird’, and destroy the kingdom - What fate awaits this girl-turned bird? - Will you, the Black Bird, destroy the world? - Will this lively, fun-filled kingdom tread the path to destruction? **Game Features A darkly humorous world, built with loving care, pixel by pixel. Visuals which recall a classic era of gaming portray a rich, picture book world. Completing each stage will reveal more of the mysteries which shroud the dark, fairytale-like exterior. **A unique audio/visual mix combined in an action-packed shooting game Your enemies’ movement synchronizes with the operatic soundtrack, sung in a bizarre, fictional language, creating a truly unique experience. **8 different endings! A high score is the key to the real ending and unlocking the story’s secrets. Your skill will guide how the story concludes; practice really does make perfect! **Extra Features Galore! Unlock True Mode after completing the game to see new enemies, hidden bonus characters and more! Learn the combo system, bomb system and hidden characters, then mix and match to find your own play style. When you’re confident, aim for the top of the leaderboards in Score Attack. [Award History] BLACK BIRD received 2 awards at BitSummit Vol.6, a Japanese indie game festival held in 2018. The first is the \"Vermilion Gate Award\" which is the grand prix prize, and the second one is a music award: the \"Excellence in Audio Award\"! This is the best indie game from Japan in 2018!", "platform": "Nintendo Switch", "release_date": "October 18, 2018", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Onion Games", "publishers": "Onion Games", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "https://youtu.be/9ceQGqtv0ao", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156375-black-bird\n"}