{"altername_name": [], "name": "Blade Runner: Enhanced Edition", "overview": "LOS ANGELES - NOVEMBER, 2019 Westwood Studios, the company that brought Real-Time to strategy games with Command & Conquer, brings Real-Time to adventure games with the science fiction classic, Blade Runner. Armed with your investigative skills and the tools of the Blade Runner trade, you'll be immersed in a world that lives and breathes around you with breakthrough lighting and visual effects. Your ability to survive will be put to the test in the richest game environment ever created. Immerse yourself in the dark, gritty world of Los Angeles 2019, where you become both the hunter and the hunted. *Groundbreaking Real-Time story structure creates a unique experience every time you play *Interact with over 70 motion-captured characters, all with Artificial Intelligence (AI) and their own agendas *Stunning visuals, as well as atmospheric smoke, fog, fire and rain that affect your character in Real-Time *Top notch Hollywood talent from the original film including Sean Young, James Hong, Joe Turkel, Brian James and William Sanderson *Rich, ambient, multi-track audio environment creates an immersive gaming experience *Includes specially recreated cuts from the original Blade Runner soundtrack *Continually animating, full screen, high resolution cinematics and game play in millions of emulated colors *Dramatic camera movements - during gameplay - heighten the Blade Runner experience *Step into the role of a Blade Runner by utilizing the ESPER photo analysis machine, administering the Voigt-Kampff replicant detection test, flying in a police Spinner and analyzing clues with your Knowledge Integration Assistant (KIA) *Breakthrough Real-Time lighting, such as directional, color, volumetric, attenuated and animating effects Blade Runner: Enhanced Edition is a faithful restoration of the classic adventure game featuring: *Reconstruction and upressing of original Westwood VQA Videos *Cinematic Video frame rates updated from 15fps to 60fps *Modern HD Display *Enhanced “Knowledge Integration Assistant\" (KIA) and clue user interface *Enhanced Subtitle support *Modern gamepad support *SMAA Anti Aliasing *Anisotropic texture filtering", "platform": "Nintendo Switch", "release_date": "June 23, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "Nightdive Studios", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Blade_Runner_(1997_video_game)", "video_link": "https://www.youtube.com/watch?v=kDxS2jh76Kg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163156-blade-runner-enhanced-edition\n"}