{"altername_name": [], "name": "Blade Strangers", "overview": "A malevolent force known only as Lina is devouring data from a vast, interdimensional network of servers overseen by sentient computers called ”motes.” In desperation, the motes summon heroes from a variety of parallel game worlds to face off against each other in one-on-one combat. The tournament victor has the potential to be awakened as the Blade Stranger — the savior who can vanquish Lina and protect the motes from further harm! Developed by Studio Saizensen, Blade Strangers is a hardcore old-school fighting game. The streamlined four-button control scheme makes it easy for beginners to deal out damage from day one…but the intricate combos, counters and specials give tournament-caliber players plenty of opportunities for frame counting, chain construction and hit-box science. • Fighter roster includes popular characters from previous Studio Saizensen and/or Nicalis games, including Code of Princess EX, Cave Story+, the Umihara Kawase series and The Binding of Isaac: Afterbirth+. Other surprise entrants include the well-known indie superstars Shovel Knight and Gunvolt. • Accessible and intuitive controls designed to bring fresh blood to the ranks of fighting game players everywhere. • Play offline Story, Missions, Arcade and Versus modes or try to climb the leaderboards in the highly-competitive Online modes. • Tutorial and Training modes are available for beginner and advanced players. • Each character has alternate color settings and their own familiar “home” stage for players to select. • Proprietary development system transforms 3D models and animation into 2D spritework; every frame looks like a gorgeous anime drawing come to life!", "platform": "Nintendo Switch", "release_date": "August 28, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Studio Saizensen", "publishers": "Nicalis", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.67", "wikipedia": "https://en.wikipedia.org/wiki/Blade_Strangers", "video_link": "https://www.youtube.com/watch?v=ZDH8bgwaNlA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/120902-blade-strangers\n"}