{"altername_name": [], "name": "Bloody Rally Show", "overview": "Welcome to Bloody Rally Show – a head-on smash between frenetic top-down arcade racing and hyperviolent reality TV. You must drift, boost, and blast to keep the viewers entertained and your paymasters happy. Go full throttle and drive to survive! Includes local multiplayer mayhem for up to 4-players! • Story mode: Drive fast and dirty to complete seasons, earn cash and XP, and nab a place on the podium. Can you win your freedom and escape the Bloody Rally Show? • Deadly cars: Choose from a range of cars inspired by the infamous and banned-in-real-life Group B rally class. Upgrade and unlock new vehicles for an ever more reckless ride! • Infinite number of circuits: A mix of handcrafted and randomly generated racetracks means there’s always a new challenge, with endless layout possibilities, as well as various surfaces, weather conditions, and track hazards! • Participate in ‘Special Races’: Drive a huge car and cause maximum damage. Complete a race with the throttle stuck on 100%. Assassinate targets spectating trackside. All this madness and more! • Weapons: Enjoy the spectator splattering Pedestrian Cannon! Explode rivals with the shrubbery-tastic Homing Hedge! A variety of deadly weapons await in specific races and Battle mode • Compete with friends and rivals: Race and battle against up to four friends in local multiplayer for the most fun and chaos! Prove your driving prowess and claim a spot on the leaderboards! • Play as a pedestrian: Take a break from driving and head trackside with your camera. Find the perfect spot to take photos and get extra close to the action! Just try to avoid becoming roadkill…", "platform": "Nintendo Switch", "release_date": "November 4, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Kodo Linija", "publishers": "Digerati Distribution & Marketing", "genres": "Racing", "max_players": "4", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156308-bloody-rally-show\n"}