{"altername_name": [], "name": "BloodRayne Betrayal: Fresh Bites", "overview": "A Remastered 2D Hack N' Slash Adventure The Brimstone Society has summoned Rayne for one last mission to lead a group of soldiers into a giant underground castle to do battle against none other than her own father, Kagan. When her escort proves ineffective against Kagan’s supernatural forces, it’s up to Rayne to run, jump, cut, and feed her way through gruesome foes, deadly traps, tricky platforming sections, and horrifying bosses. It’s Rayne’s last job — will she “clean house” or find herself six feet under? Original developer WayForward has upgraded its 2011 classic 2D hack ‘n slash platformer with high resolution visuals, modern features, and all-new voice acting performed by original BloodRayne cast members Laura Bailey (Rayne) and Troy Baker (Kagan). Bloodrayne Betrayal: Fresh Bites distills the best parts of the BloodRayne series into a bloody, twitchy, action-packed 2D hack ‘n slash adventure through fifteen challenging stages. Features All-new voice acting • All-new A-List voice acting: Original BloodRayne cast members Laura Bailey and Troy Baker reprise their roles as Rayne and Kagan – alongside talented voice actors Todd Haberkorn and Patrick Seitz – to bring new life to the original written dialog. Enhanced visuals • Sharpened visuals and squashed bugs help make Fresh Bites the definitive Bloodrayne Betrayal experience. New Difficulty Options • Play with a newly rebalanced difficulty tuned for a fun and engaging experience, or sink your teeth into the punishing original difficulty mode if you’re looking for a tough-as-nails challenge.", "platform": "Nintendo Switch", "release_date": "September 9, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "WayForward", "publishers": "Ziggurat", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "", "video_link": "https://youtu.be/gdQaFhAFSDQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155765-bloodrayne-betrayal-fresh-bites\n"}