{"altername_name": [], "name": "Blue Fire", "overview": "A Dark World Awaits – Travel through the perished world of Penumbra to explore unique areas filled with diverse enemies, sharp 3D platforming challenges, quests, collectibles, and more. Embark on an extraordinary journey through the desolated kingdom of Penumbra and discover the hidden secrets of this long-forgotten land. Explore mystical temples, encounter survivors and take on strange quests to collect valuable items. Along your adventure, slash your way through daunting adversaries, roam across mysterious and abandoned regions, leap through deadly traps and ultimately master the art of movement. Features • A Haunting World – Travel through the perished world of Penumbra to explore unique areas filled with diverse enemies, sharp 3D platforming challenges, quests, collectibles and more. • Slash Your Way Through Great Adversaries – Encounter dangerous enemies with distinct fighting styles and partake in intense combat-platforming boss fights. • Encounter Peculiar Survivors – A long time has passed since Penumbra fell into darkness, but those that survived the kingdom’s fall will aid your journey to unlock valuable rewards. • Collectibles – Once a rich and lush kingdom, Penumbra is filled with many collectibles and items to discover, loot, collect, sell, trade and purchase. • Upgrades – No great warrior can battle the dangers lurking in Penumbra without the proper equipment. Upgrade your swords, collect valuable amulets and unlock new abilities to transform into a fierce fighter. • Lost in the Void – Far from Penumbra, there is a lost land called The Void. Find Void entrances throughout the world to uncover abstract platforming challenges that require great mastery to gather the valuable rewards hidden inside.", "platform": "Nintendo Switch", "release_date": "February 4, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Robi Studios", "publishers": "Graffiti Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=R0wPny3_8nQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155767-blue-fire\n"}