{"altername_name": [], "name": "Boomerang Fu", "overview": "COUCH MULTIPLAYER CHAOS Roast and toast your friends in lightning-fast rounds of cute physics combat for up to 6 players. Perfect for parties! STACK POWER-UPS TOGETHER Discover a ridiculous range of power-ups like explosive boomerangs, disguises and telekinesis. Then stack your power-ups together to form outrageous combinations! SIMPLE CONTROLS It only takes one stick and three buttons to pulverize your pals. Anyone can play immediately, but hardcore players will love mastering the advanced techniques of this lost martial art. Deflect attacks, recall dropped boomerangs, and curve your throws around corners to become a powerful boomerang assassin. OVER 30 ARENAS Journey to an edible world as you do battle in over 30 Kung Fu arenas, each filled with unique tools and traps. Jump over moving platforms and sneak through lush foliage. Trigger sliding walls to squish your foes. Dive between giant rolling pins and delight the Toaster King. TEAM UP Join forces with your buds to take on the ingenious AI opponents. Or squabble over the precious Golden Boomerang in a frantic alternative game mode. CHANGE THE RULES Play with only the power-ups you love. Turn off shields. Turn on friendly fire. You change the rules to suit your tastes! Boomerang Fu is best enjoyed with controllers. We support a variety of controllers including Xbox, PlayStation, Switch and many more. Remote Play Together over Steam. Please note: video quality and input lag will vary based on the speed of your internet connection and hardware.", "platform": "Nintendo Switch", "release_date": "August 13, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Cranky Watermelon", "publishers": "Cranky Watermelon", "genres": "Action", "max_players": "6", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/5P7rcsbNWcA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/152337-boomerang-fu\n"}