{"altername_name": [], "name": "Borderlands 3: Ultimate Edition", "overview": "Borderlands 3 Ultimate Edition is the quintessential Borderlands 3 experience, now on Nintendo Switch Make some Mayhem at home or on the go with the award-winning base game plus all six content add-ons and the full collection of bonus cosmetic packs! Blast through multiple worlds as one of four Vault Hunters—the ultimate treasure-seeking badasses of the Borderlands, each with deep skill trees, abilities, and customization. Play solo or join a friend in two-player online co-op to take on deadly enemies, score loads of loot, and save your home from the most ruthless cult leaders in the galaxy. Includes: • Borderlands 3 base game • Moxxi's Heist of the Handsome Jackpot* • Guns, Love, and Tentacles: The Marriage of Wainwright & Hammerlock* • Bounty of Blood* • Psycho Krieg and the Fantastic Fustercluck* • Designer's Cut* • Director's Cut* • 30+ cosmetic items *Each available as a separate download through the Nintendo eShop at no additional cost. Requires download and installation of Borderlands 3 base game to access. YOUR VAULT HUNTER, YOUR PLAYSTYLE Become one of four extraordinary Vault Hunters, each with unique abilities, playstyles, deep skill trees, and tons of personalization options. LOCK, LOAD, AND LOOT With bazillions of guns and gadgets, every fight is an opportunity to score new gear. Firearms with self-propelling bullet shields? Check. Guns that grow legs and chase down enemies while hurling verbal insults? Yeah, got that too. A MAYHEM-FUELED THRILL RIDE Discover new worlds beyond Pandora, each featuring unique environments to explore and enemies to destroy. Tear through hostile deserts, battle your way across war-torn cityscapes, navigate deadly bayous, and more! QUICK & SEAMLESS CO-OP ACTION Play with a friend in online co-op, regardless of your level or mission progress. Take down enemies and challenges as a team, but reap rewards that are yours alone—no one misses out on loot.", "platform": "Nintendo Switch", "release_date": "October 6, 2023", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "Take-Two Interactive", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Borderlands_3", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372852-borderlands-3-ultimate-edition\n"}