{"altername_name": [], "name": "Boulder Dash: 30th Anniversary", "overview": "New version of the legendary classic retro puzzle 260 all-new levels with advanced physics! Premium world by video-game legend Peter Liepa Gem Collectors, Dig This! Boulder Dash®-30th Anniversary™ finds our heroes, Rockford™, Crystal™ and others, facing a slew of new, exciting challenges in this legendary action puzzler. Dig through spectacular caves with 3D elements; avoid falling boulders; collect valuable gems and avoid nefarious enemies along the way. Discover treasure chests with rare collectibles and potent power-ups. With 260 exciting levels, 13 new, gorgeous worlds, and 10 playable characters, Boulder Dash-30th Anniversary is the best game in its 30 year history. The original Boulder Dash® was created by Peter Liepa with Chris Gray over 30 years ago and published by First Star Software in 1984. Boulder Dash®-30th Anniversary is the first, and only, game in the multi-million unit selling Boulder Dash series to include both a premium world designed by Peter Liepa and another by Chris Gray. While providing classic Boulder Dash core gameplay mechanics and features, Boulder Dash-30th Anniversary introduces exciting new elements such as diagonal movement, which opens up new and intriguing puzzles while creating a very different and organic look for the caves. Features Include: • 260 all-new levels with advanced physics! • 13 Never-before-seen worlds, with new creatures with 3D animations! • New multicolored gem combos, treasure chests, rare collectibles and spectacular power-ups! • Limited time special events with unique prizes! • Premium world by videogame legend Peter Liepa who returns to the game he created 30 years ago with 20 of the most mind-bending levels yet! • Play as Rockford™ or unlock 9 other playable male and female characters including Crystal™! • First Boulder Dash game ever to include diagonal walls and movement!", "platform": "Nintendo Switch", "release_date": "February 27, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "BBG Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155769-boulder-dash-30th-anniversary\n"}