{"altername_name": [], "name": "Boulder Dash Deluxe", "overview": "Gem collecting puzzle action in an update of the classic game! THE retro game and legendary action puzzler for players young and more experienced alike arrived, combining up-to date-graphics with original game features – spanning 35+ years of Rockford™ and his friends, digging though caves to collect gems - Boulder Dash® Deluxe! Created by two Canadian programmers in 1984, Boulder Dash has become one of the longest running videogame franchises! The original Boulder Dash® is a pioneering interactive game dating back to the early times of the home computer and video game era. Its many sequels have delighted and challenged casual and hard-core players of all ages and sexes for over nearly four decades. Boulder Dash® Deluxe takes you, together with the game character called Rockford™ into a myriad of new and exciting challenges. Dig through spectacular caves with 3D elements; avoid falling boulders; collect valuable gems and avoid nefarious enemies along the way. Discover treasure chests with rare collectibles and strong power-ups. Boulder Dash Deluxe includes 180 new exciting and unique levels. Plus, dig through 9 brand new worlds with high-end graphics and their own textures, dive into the Classic 1984 World with its caves or enjoy The Liepa World; a set consisting of 20 of the most mind-bending levels designed by the creator of the original 1984 Boulder Dash version and video game legend Peter Liepa. And, if that’s not enough, you will be challenged by 15 new special opponents ranging from Octopus to Snow Tiger. Boulder Dash® Deluxe truly is the pinnacle in 35+ years of Boulder Dash®! While providing classic Boulder Dash® core gameplay mechanics and features, Boulder Dash® Deluxe introduces exciting new elements such as diagonal movement, which opens up new and intriguing puzzles while creating a very different and organic look for the caves.  On top of legendary previous versions, Boulder Dash® Deluxe features include: • 180 all-new levels with advanced features! • Includes 20 levels from the original 1984 Boulder Dash version • 9 exciting, brand spanking new worlds with high-end graphics, having their own, unique textures, go to Macmarnua Sea or Urath Castle – or back in time to the Classic 1984 World with its caves • 15 new special opponents like Octopus, Shark Polar bear, and Snow tiger will keep your mind agile and you on your toes. • The Liepa World, a premium world by videogame legend Peter Liepa who returned to the game he created 35 years ago with 20 of the most mind-bending levels yet! • Full character customization of your game character Rockford™, e.g. shirt, pants, shoes, eyewear, headgear, hair, and facial hair • Languages: English, Spanish, French, German, Italian, Portuguese, Polish, Russian, Japanese, Simplified Chinese, Traditional Chinese!", "platform": "Nintendo Switch", "release_date": "September 9, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "BBG Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/RwUmUDnIWZM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155770-boulder-dash-deluxe\n"}