{"altername_name": [], "name": "Breathedge", "overview": "Breathedge is an ironic outer space survival adventure game. Take on the role of a simple guy called the Man who is just carrying his grandpa's ashes to a galactic funeral and suddenly finds himself in the middle of a universal conspiracy. - Welcome to Space A massive space hearse suffers a wreck in the deep space, leaving the area filled with debris, coffins, dead passengers, and yourself. Survive in this interstellar dump, uncover a global conspiracy, save the princess, and don’t break your fingers while tapping the keyboard as you travel around the world (keeping your display on for full immersion is advised). - Try to stay alive Space isn’t a joke (despite us trying to prove otherwise) and not dying is a challenge. Lose your progress in spectacular ways, including but not limited to suffocation, freezing, incineration, electrocution, depression, blunt trauma, and more. - Litter space with garbage you created It took a long time for our ancestors to develop because they had no electrical tape. You have it and you know how to use it. With this magical artifact, you can create a vast variety of useless objects and throw them out of the airlock! There are also many useful items to be created, but be careful as this may result in completing the game. - Fix and Decorate When all your neighbors just hover around in a vacuum doing nothing but playing dead, various tools and gears will help you become the worst noisy neighbor ever. Create a unique space station, provide it with oxygen and electricity, install all kinds of equipment from solar panels to a hamster farm, and turn it into a real bachelor pad by stuffing it with furniture mixed with all kinds of junk. - Honk! Honk! Yes, you heard that right, it’s your own private car horn! Besides that, you can assemble a small rocket, ride the dead or build a large space shuttle. Transportation helps you move faster, evade obstacles, and see the death screen after a head-on collision", "platform": "Nintendo Switch", "release_date": "April 6, 2021", "game_type": "Released", "esrb": "", "developers": "HypeTrain Digital", "publishers": "", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155192-breathedge\n"}