{"altername_name": [], "name": "Bridge Constructor: Ultimate Edition", "overview": "Bridge Constructor: Ultimate Edition includes the \"Bridge Constructor\" and both DLCs \"Slopemania\" and the \"Trains\" Expansion Pack! In Bridge Constructor, you can become an accomplished bridge builder without any formal training. Play 40 different levels, and build bridges over deep valleys, canals, or rivers. Stress tests reveal whether the bridge you build can withstand the daily stress of continual use from cars and trucks. You can choose between a range of materials for each individual bridge, such as wood, steel, cables, or concrete pillars. Use the appropriate materials and stay within budget to build the perfect bridge. Thanks to the choice of materials, you can build each bridge in any number of ways – your budget is the only limit. Set your imagination and creativity free! FEATURES: • 40 Levels • Now with free build mode • 5 Settings: City, Canyon, Beach, Mountains, Hills • Map with all unlocked worlds/levels • 4 different building materials: Wood, Steel, Cables, Concrete pillars • Color coded load indicator for different building materials • Two different load bearing levels: Car and Truck • High score per level In the SlopeMania add-on you find yourself on the Tiltin Islands, home to three brand new islands where you'll even be building your bridges inside colorful grottoes! The 24 tricky, never-before-seen levels will have you using sloping lanes to overcome the massive height differences. The \"Crazy Levels\" are the real brainteasers and require out-of-the-box thinking and unusual solutions. The \"Trains\" DLC lets you visit the \"Choonited Kingdom\" island group, with a total of 18 new levels across three islands. Build massive bridges that can withstand the enormous weight of the two new vehicles on offer – a commuter train and a heavily loaded freight train. The idyllic and beautifully designed landscapes will make the heart of every railroad fanatic skip a beat.", "platform": "Nintendo Switch", "release_date": "January 31, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "ClockStone", "publishers": "Headup Games", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153277-bridge-constructor-ultimate-edition\n"}