{"altername_name": ["Brigandine: Runersia Senki"], "name": "Brigandine: The Legend of Runersia", "overview": "The continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters. Select a ruler, compose your platoons of knights and monsters, and march to claim enemy bases. The player chooses how they will battle, so devise the best strategy to lead your nation toward continental conquest. How will your legend unfold? Time passes on Runersia in seasons, each one consisting of an Organization Phase and an Attack phase. During the Organization Phase, knights and monsters with various classes and skills are organized into platoons in preparation for the upcoming battles. During the Attack Phase, turn-based platoon battles take place on a map made up of hexagonal spaces. Make use of unit skills, elements, enclosure effects, terrain advantages, and other battle tactics to lead your side to victory! All nations, knights, and monsters in the game will continue to battle and grow as you do. The game is also packed with other ways to grow your armies such as class changes, equipment, and various items. Enemy nations aim to conquer the continent as well and will attack your bases to do so. The battle for the continent will differ with each playthrough. Accumulate stories and events from the six nations in the Records. After clearing the main mode, The Legend of Runersia, the Alternate Chapter challenge mode will be unlocked, allowing for even more replayability. Runersia - a continent blessed with mana showers from times of old. Five Mana Stones discovered long ago have been embedded into special armor called Brigandine, each one representing the ideology of the nation possessing it. These have come to be known as the Brigandine of Justice, Sanctity, Freedom, Glory, and Ego. The time now is Runersia 781, and a war looms on the horizon for five nations and a small tribe with incompatible ideologies. Six rulers and their rune knights will throw themselves into the conflict, each with their own hopes and expectations. Once the land has been unified under a single banner, memories from The Legend of Runersia will be reclaimed and the truth of what happened here on Runersia shall be revealed. In the free trial mode, you are able to play up to 10 seasons or until you control 7 or more bases. Save data cannot be transferred to the full version.", "platform": "Nintendo Switch", "release_date": "June 25, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Matrix Software", "publishers": "Happinet", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Brigandine:_The_Legend_of_Runersia", "video_link": "https://youtu.be/sUHMDjcD4sU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135729-brigandine-the-legend-of-runersia\n"}