{"altername_name": [], "name": "Bug Fables: The Everlasting Sapling", "overview": "Bug Fables is an adventure RPG following three heroes, Vi, Kabbu, and Leif, as they embark on an epic quest in Bugaria in search of treasure and immortality.! The game combines colorful platforming with the heroes' unique abilities as they explore a wide variety of areas in the kingdom. Battles are turn-based and make use of action commands that can enhance attacks. STORY: Hidden within the foliage of nature lies a small but prosperous continent - Bugaria. Insects from all over the world travel to it in search of the treasure scattered across it. The most sought after of these relics is The Everlasting Sapling! Eating just one of its leaves can grant even immortality! In search of this ancient artifact, a brave team of explorers - Vi, Kabbu, and Leif - will travel across many different environments. In order to do so, they must work together to clear puzzles, defeat strong enemies and help the general bug populace! FEATURES: - Seven lush chapters of story following the heroes across Bugaria! - Traverse vast overworlds that transition into turn-based combat! Use action commands with Vi's Beemerang, Leif's Ice Magic, or Kabbu's Horn to make attacks more effective or block enemy attacks! Turn the tide of battle with the Turn Relay feature to exploit enemy weaknesses with the power of teamwork! - Explore unique areas including: The Ant Kingdom, the treacherous Snakemouth Den, the picturesque Golden Hills, The Lost Sands, and Vi's home, the Bee Kingdom! - Utilize a cooking system to turn ingredients into items that can help you in battle! - Engage in a Tattle System that lets you hear your party interact with each other as they discover all the secrets Bugaria has in store! - Over 30 sidequests and 15 optional bosses!", "platform": "Nintendo Switch", "release_date": "May 28, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Moonsprout Games", "publishers": "DANGEN Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135730-bug-fables-the-everlasting-sapling\n"}