{"altername_name": [], "name": "Cardaclysm: Shards of the Four", "overview": "You are a dark wizard who shouldn't have tinkered with magic and spells way too powerful for you. But you did. And this time you messed up really bad: You've unleashed The Four Horsemen of the Apocalypse and their minions upon the World! Well done... So hurry, grab your magical cards and send them all back to their hellish dimension before the Apocalypse destroys everyone and everything - and much more importantly, before the old wizard council discovers what you have done... Cardaclysm: Shards of the Four is a procedurally generated collectible card game mixed with action RPG elements! Collect creature and spell cards throughout your journey and unleash their power if anyone opposes you! The game's world is endlessly generated, there's always something new to explore! Battle Collect, combine and unleash the great powers of monsters, mystical creatures and magical spells in turn-based card battles! There are more than 200 cards in Cardaclysm: Shards of the Four, each with its own unique abilities, art and 3D animation! Biomes Face and fight your opponents in arenas located in different biomes: Make your way through burning deserts, eternal ice or dense jungles - but watch your step: Deadly monster encounters are lurking behind every corner! The Pub Visit the Interdimensional Pub between your quests: Take up and complete challenges, trade powerful cards and store your excess spells in your personal chest until you use them in your next epic card battle against the forces of the dark realms! • Encounter 5 factions and over 200 cards, each with its own unique abilities, art and 3D animation • Equip your hero with over 40 artifacts • Battle five mythic bosses, each with its own unique take on game mechanics • Explore endlessly generated worlds in different biomes • Complete challenges and trade cards in the Interdimensional Pub you visit between quests", "platform": "Nintendo Switch", "release_date": "August 13, 2021", "game_type": "Released", "esrb": "", "developers": "Elder Games", "publishers": "Headup GmbH", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160439-cardaclysm-shards-of-the-four\n"}