{"altername_name": [], "name": "Chaos Code: New Sign of Catastrophe", "overview": "Chaos Code -New Sign of Catastrophe- now appearing on the Nintendo Switch! Enjoy high speed 2D combat with a wide variety of special moves, anytime and anywhere! Chose from a robust roster of 16 unique characters, including a government agent, a ninja, a magical girl, a manga artist, an android and more! Every fight is unique with selectable attacks, movement styles and color options making each character your own! Choose from 6 different battle modes, including Arcade, Versus, and Mission Mode. – Arcade Mode Progress through the story, experiencing each individual character’s tale. – VS Mode Battle it out against the CPU or another player. – Survival Mode Fight one battle after the other with only one health bar. – Practice Mode Set various parameters to help you learn characters’ moves and to practice combos. – Mission Mode Take on a variety of missions set for each character. – Score Attack Mode Fight against the computer with regulated settings and compete for the highest score. *This product does not support online play or ranking. Aside from battles, there is also the “Collection Mode” where you can view all unlocked CGs and movies to your heart’s content. You can also unlock more contents in this mode using the Chaos Coin earned from the various battle modes. Unlock them all and dive into the world of Chaos Code!! Human Civilization has reached its apex, and begins its expansion into outer space. The scientist Arthur Tesla has finished the development of Chaotics, a new type of energy that defies all current understanding. Then, just as Chaotics came to be the world’s chief energy source, Professor Tesla suddenly disappears. All he leaves behind are the mysterious words…”CHAOS CODE” Assumed to be somehow related to Chaotics, the Earth-Union government offers a massive cash prize for any discoveries that would unravel the mystery of those words. With the appearance of not just prize-seekers, but those who seek to control Chaotics, those who wish to topple the government, and the violently confused, the fight for the “CHAOS CODE” begins!", "platform": "Nintendo Switch", "release_date": "March 26, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "FK Digital", "publishers": "Arc System Works", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Chaos_Code", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160449-chaos-code-new-sign-of-catastrophe\n"}