{"altername_name": [], "name": "Chicken Assassin: Reloaded", "overview": "Fight your way as Mean Mcallister, the baddest chicken in town, through multiple hordes of enemies to save your girlfriend in this hilarious, strategic button-mashing, action- RPG. Chicken Assassin is a fast paced action-RPG with an outrageous storyline filled with over-the-top humor that boasts a myriad of colorful enemies and visually stunning levels and environments. Prepare to give your hand an intense workout as you battle a slew of eclectic adversaries and encounter special bosses in this frenetically action packed game! You play as Mean Mcallister, the living embodiment of what would happen if you combined Rambo, Foghorn Leghorn, a bottle of hot sauce, and a case of energy drinks together. When the evil mastermind Spritzel and the Henchmen abduct your girlfriend, Candy, you embark on a frantic journey to save her, leaving mayhem and destruction along your path. As you progress, you can upgrade Mean with various fighting styles and skills, access an arsenal of weapons to dole out punishment, and customize clothing that boosts your stat attributes. Buck Buck, mothercluckers… Features • 11 Epic Missions - Punch, slash, and shoot with Mean Mcallister through glorious missions, including a new mission with an epic barbarian tribe - “The First Siege!” • Endless Mode - Survive an onslaught of the most difficult enemies in a brand new game mode that will test your endurance...you may want to use the bathroom before attempting • Over 450+ unique items - Who doesn’t like loot? • Visually stunning environments and gorgeous art filled with hidden characters and easter eggs - Our stuff belongs in a museum • Boss Raids - Feel like a challenge? Take on special bosses along the mission path for special loot. Only the fastest button-mashers should apply! • Deep Customization - Mix and match different clothing and weaponry loadouts to boost and customize Mean Mcallister’s stats and overall look • Rooster Tales - Achievement system that rewards you with moola...so that you can buy more stuff • Black Market - It’s always good to know a guy, who knows a guy, who can get you what you need for the right price", "platform": "Nintendo Switch", "release_date": "July 19, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "OneShark", "publishers": "Akupara Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=jJJsPzY_EiI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156394-chicken-assassin-reloaded\n"}