{"altername_name": [], "name": "Children of Zodiarcs", "overview": "Children of Zodiarcs is a story-driven, tactical RPG set in the fantasy realm of Lumus; a world divided by affluence and poverty. Take control of Nahmi and her fellow outcasts, utilising a brand new deck and dice based combat system to strike a blow to the noble Lords’ and Ladies’ unquenchable thirst for profit. Story Professional thieves on the trail of an ancient relic, the group infiltrates the glittering halls of a corrupt noble’s private chambers in pursuit of their target, narrowly escaping the wrath of the city guards at every turn. Desperate to find an escape, they seek refuge in the city’s seamy slums and brave the sunless pits of the underworld. Out to get them are heavily armed city guards, rival gangs and psychotic families of subterranean cannibals. Abandoned by the system and used by selfish criminals, these young companions will be forced to come to terms with their own reality. But be warned - in the world of Children of Zodiarcs, no one escapes unscathed! Features Combat Cards Each of your party members’ attacks & abilities are bound to combat cards. Drawing different cards during battle provides you with ever changing combat possibilities every time you fight! Empower Cards through Dice Once you’ve chosen your attack, physics based dice allow you to roll for bonuses! Favoring symbols over numbers, these dice deliver attack, defence, healing, and special ability modifiers. Influencing Lady Luck To add yet more layers of stratagem to Children of Zodiarcs, you can craft dice to favour your play style, and re-roll up to two dice every time you throw. You need not fear being at Lady Luck’s mercy! A World Full of Characters Along the way you’ll come to learn about Nahmi - stolen from her homeland as a child, Brice - forced to survive on the mean streets of Torus; Zirchhoff - a charismatic bandit leader who employs young orphans to do his bidding: as well as many more mischief makers. Building Decks Each playable character comes with their own customisable deck. This allows you to tailor their skillset to the types of attacks and abilities you want to have in your hand during the heat of combat. A Fully Orchestrated Score Children of Zodiarcs’ music captures the feel of tactical RPG classics with its fully orchestrated soundtrack composed by the award winning team at Vibe Avenue. Join Nahmi and her team in a harrowing tale of the downtrodden’s struggle for survival in a world where mystical forces are overlooked; and the people in power are solely concerned with profit. Do you have what it takes to overthrow a corrupt system?", "platform": "Nintendo Switch", "release_date": "March 27, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Cardboard Utopia", "publishers": "Plug In Digital", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151304-children-of-zodiarcs\n"}