{"altername_name": [], "name": "Chroma Squad", "overview": "Chroma Squad is a Tactical RPG where five actors decide to start their own show and conquer the hearts of spectators, inspired by the Power Rangers television show. The five actors record a few episodes in a season before getting involved in a boss fight, the Finale. Fights, combos and moves provide points, which are calculated in term of experience, spectators and fan power. Episodes cost money to produce (actors are getting paid, equipment is used), but each successful one can provide cash and items (dropped by villains) to ensure further combats and to buy or craft improvements. Between each episode, it is possible to change the marketing campaign, according to different strategies (retaining audience, getting more cash flow or fans). Cast actors, purchase equipment and upgrades for your studio, craft weapons and giant Mechas out of cardboard and duct tape. Once the cameras are rolling, you will control your cast of five colored-jumpsuit-clad warriors in dramatic, turn-based battles! • CUSTOMIZE YOUR TV STUDIO: hire actors, upgrade your gear, do marketing, craft weapons, costumes and giant cardboard robots! • TACTICAL RPG COMBAT WITH A TWIST: combine your heroes’ abilities with Teamwork maneuvers! • IN-DEPTH RPG SYSTEMS with skill trees, random equipment, crafting, and branching storyline with 3 different endings! • GIANT MECHA COMBAT: destroy the city to save the city! • A LOVE LETTER TO POWER RANGERS, TOKUSATSU AND THE JAPANESE SERIES OF OUR CHILDHOODS! • DELICIOUSLY-ANIMATED PIXEL ART AND A CHIPTUNE SOUNDTRACK THAT SHINES LIKE JUSTICE!", "platform": "Nintendo Switch", "release_date": "August 1, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Seaven Studio", "publishers": "Plug In Digital", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156639-chroma-squad\n"}