{"altername_name": [], "name": "Clustertruck", "overview": "Clustertruck is a very fast first-person platformer where a character needs to reach a goal by hopping on top of a moving column of speeding trucks. Movement resembles trick jumping or parkour through the quick succession of actions, air control, the ability to double jump, dash, sprint and hanging on for a high launch and so on. Each level is a short course based on \"the floor is lava\" principle; as soon as the ground is touched the level is lost. The main campaign consists of 90 levels grouped per ten for the different worlds: desert, forest, winter, laser, medieval, ancient, sci-fi, steampunk and hell. Each world introduces new elements such as multiple groups of trucks driving in different directions, gaps, moving structures, time limits, swinging hammers, flamethrowers, lasers, cannons shooting trucks and so on. Levels are unlocked gradually. While the main levels are always identical, because of the physics and player actions the gameplay is never completely the same. Based on speed and style, points are earned. These can be used to unlock movement and utility abilities. Only one of each can be equipped at all times. Movement abilities are air dash, disrespected blink (teleportation), double jump, grappling hook, jetpack, levitation, truck boost, and trucker flip. The utility abilities are back truck, epic mode, portable truck (a projectile that spawns a truck to land on), supertruck, time slow, and trucksolute zero (freezes all trucks). Each ability has a recharge time. There is an in-game editor and integration with the Steam Workshop to create and share levels with other users. The best times can be compared on global leaderboards. There is Twitch streaming integration with audience participation where viewers can vote for events in real-time. Events include bouncy trucks, thin trucks, slower or faster speed, altered gravity and so on. The developers can influence the Twitch streams with their own commands if they are sent with the official Landfall Twitch account, influencing time and gravity, and changing colours.", "platform": "Nintendo Switch", "release_date": "March 15, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Landfall Games AB", "publishers": "tinyBuild LLC", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Clustertruck", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112837-clustertruck\n"}