{"altername_name": [], "name": "Commandos 2: HD Remaster", "overview": "Relive the real-time tactics masterpiece that defined the genre like no other for the first time on Nintendo Switch™: Originally developed by the legendary Pyro Studios, Commandos 2 - HD Remaster is a true homage to one of gaming’s most celebrated masterpieces. Experience Commandos 2 Men of Courage like never before in high definition with reworked controls, UI and tutorial. Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of notoriously demanding missions set in World War II. Go covert into various environments based on authentic World War II locations and lead your team of commandos against overwhelming odds, operate covertly and turn the tide of war. Features: • Re-imagined in HD with reworked controls, modernized UI and an overhauled tutorial. • The Commandos series’ first appearance on Nintendo Switch™: rotate the environment 360 degrees, move seamlessly in and out of buildings, submarines, planes and underwater, and zoom in and out of the environment. • Interactive environments: steal enemy uniforms and weapons, climb poles, swing from cables, swim, utilize vehicles, and climb in/out of buildings, ships and planes. • Control nine unique commandos, each with different skills and specializations including green beret, sniper, demolition expert, diver, seductress and thief. • Authentic WWII scenarios: 10 missions spanning 9 different environments in night and day, with realistic weather effects. • The choice is yours: how you tackle each mission is up to you. Experiment with skills and weapons in a challenging “against the odds” gameplay style. • WWII vehicles and weapons, including jeeps, tanks, trucks, ships, bazookas and flame-throwers.", "platform": "Nintendo Switch", "release_date": "December 4, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Yippee! Entertainment", "publishers": "Kalypso", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/148344-commandos-2-hd-remaster\n"}