{"altername_name": [], "name": "Corpse Factory", "overview": "CORPSE FACTORY is a psychological thriller visual novel, with full English voice acting performed by an all-star cast. Become part of the story and influence the ending of this spine-chilling tale. Immerse yourself in the darkness with an atmospheric original soundtrack, with a vocal performance by Emi Evans and music composed by Alec Shea. DISCLAIMER This game contains scenes of violence, as well as depictions of mental health conditions such as severe anxiety and depression. It also deals with themes of suicide. STORY //TOKYO, IN THE NEAR FUTURE: Whispers and rumors are spreading through the city like wildfire. Murmurings of a bizarre website have started to pique the interest of more than a few people—people willing to take extreme risks in order to fulfill their darkest desires. Corpse Girl's Website supposedly allows users to request the death of someone they know. All that is required is a photo of the proposed victim. Once an image is uploaded, the website promises to snuff out the victim's soul within a matter of days. Victims of the website apparently receive a photograph of their own corpse before they are killed. Photos are time stamped with a date... Perhaps a predicted time of death? The website's authenticity is questionable at best. It has become an interesting topic of conversation and nothing more. And yet... When people start dying in odd ways across the city, the website instantly returns to the limelight. All of the recent victims were found in possession of strange photos—photos of their own corpses, received only hours before they died... FEATURES + Gorgeous anime artwork + Full English voice acting, starring Erika Harlacher, Faye Mata, Sean Chiplock, Brianna Knickerbocker, Aleks Le and more + A haunting original soundtrack composed by Alec Shea, with vocals performed by Emi Evans on the opening theme + Multiple endings + Unlockable image gallery VOICE CAST Erika Harlacher as Noriko Aleks Le as Kojiro Brianna Knickerbocker as Aoi Faye Mata as Tomoe Sean Chiplock as Shinya Kaiji Tang as Junpei Anairis Quiñones as Emi Lizzie Freeman as Yuriko June Yoon as Fujikawa Aimee Smith as Kotomi Alec Shea as Kenji", "platform": "Nintendo Switch", "release_date": "June 29, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "RIVER CROW STUDIO", "publishers": "RIVER CROW STUDIO", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=cUEJe3x2R9E", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164333-corpse-factory\n"}