{"altername_name": ["クレヨンしんちゃん 『オラと博士の夏休み』 ～おわらない七日間の旅～", "Shin chan: Me and the Professor on Summer Vacation -The Endless Seven-Day Journey-", "Shin chan: Mi verano con el profesor -La semana infinita-"], "name": "Crayon Shin-chan Ora to Hakase no Natsuyasumi: Owaranai Nanokakan no Tabi Switch", "overview": "English : Shin-chan's summer vacation begins. Shin-chan and the Nohara family have decided to spend their summer vacation in Kyushu. A week of life begins in the small town of Asso. In the morning, do gymnastics to the radio! It's the beginning of the day. Surrounded by abundant nature, you can catch rare insects, catch fish in nearby streams, and pick up wild plants. I record the fun events in my picture diary every day. Shin-chan deepens exchanges with the people of the town while helping the store and making newspapers. Of course, I also met a beautiful old lady ...! It was supposed to be a great summer vacation full of memories, but ... A mysterious event begins to occur from the encounter with a strange doctor. For some reason, my new friends are Kasukabe's friends. There are ninjas and dinosaurs in the town ...! ?? A slightly mysterious summer vacation experience adventure woven by Shin-chan and the Nohara family in \"Asso\", which is rich in nature . Japanese : しんちゃんの夏休みがはじまる。 夏休みを九州で過ごすことになった、しんちゃんと野原一家。 小さな町「アッソー」で、一週間の生活が始まります。 朝は、ラジオに合わせて元気に体操！　１日の始まりです。 豊かな自然に囲まれて、めずらしい虫をつかまえたり、近くの小川で魚を釣ったり、山菜を取りにいったり……。 楽しかった出来事は、毎日絵日記に記録します。 お店のお手伝いや、新聞づくりなどをしながら、町の人々とも交流を深めていくしんちゃん。 もちろん、きれいなおねいさんとの出会いも……！ 思い出いっぱいの、最高の夏休みになるはずだったのですが…… ちょっと変わった博士との出会いから、不思議な出来事が起こり始めます。 新しくできたお友達は、なぜかカスカベのお友達と瓜二つ。 町には忍者や恐竜のすがたが……！？ 自然豊かな「アッソー」で、しんちゃんと野原一家が織りなす、 ちょっと不思議な夏休み体験アドベンチャー。", "platform": "Nintendo Switch", "release_date": "July 15, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "Millennium Kitchen", "publishers": "neos", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Shin-chan:_Me_and_the_Professor_on_Summer_Vacation", "video_link": "https://youtu.be/oLrCa1-oQ7o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158967-crayon-shin-chan-ora-to-hakase-no-natsuyasumi-owaranai-nanokakan-no-tabi-switch\n"}