{"altername_name": ["Cyanide & Happin Freakpocalypse (Episode 1)"], "name": "Cyanide & Happiness: Freakpocalypse", "overview": "Taking place in the Cyanide & Happiness universe, you play as a weird, unpopular ginger-headed orphan, and it's time to save the world. Or, maybe make things even worse. As Coop \"Go Away, Weirdo\" McCarthy, all you want to do is make the world a better place. The trouble is: Nobody likes you, school sucks, you can't find a prom date, everybody bullies you (including your teachers), and your attempts to help only makes things worse. Will you escape high school alive? Who will love you? Why is this game called Freakpocalypse? Find the answers to these questions and more by looking at, talking to, and touching everything within the Cyanide & Happiness universe. This game is part 1 of Coop’s trilogy of tragedy: • In this point-and-click adventure, control Coop in his quest to be the hero he always wanted to be by helping the people of Netherton! Talk to, touch, and look at everything in your environment! That sexy looking clock? Ask it to prom! That rotting piece of fruit? Touch it! Jump into the Cyanide & Happiness universe: • Did we mention the sheer amount of fully-voiced freaks and friends you’ll see from some of your favorite animated shorts? Feast your eyes on familiar faces as you fetch, find and frolic through your environment! Meet famous folks like Ted Bear, Shark Dad, Señor Cleanfist, and more! Help with a wide variety of side quests: • The citizens of Netherton need help. Like, a LOT of help. Fortunately(?) for them, there’s Coop! Enjoy the full gameplay experience by finding dangerous markers, buying frozen drinks, and trying to make people less miserable! (Or at least hate you less) Discover a plethora of costumes, easter eggs, and secrets • Netherton is… Charming, if you look in the right places! Explore the town and discover a ton of different clothes, easter eggs and hidden details while you avoid death to freaks and bullies! Unlock special achievements for how good (or bad) you are at exploration! Enjoy the hallmark Explosm style • True to the signature art style, Freakpocalypse includes animated shorts that’ll bring you right back to the cartoon series that started it all! On top of that, listen to a set of catchy, original tracks that give life (or death) to your atmosphere! • Coop's main storyline can be completed in just a few hours, but if you explore more and see all of Netherton, it can take much more than that, even days!", "platform": "Nintendo Switch", "release_date": "November 3, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Explosm", "publishers": "Serenity Forge", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=WCCvfbmB6PA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/194949-cyanide-happiness-freakpocalypse\n"}