{"altername_name": [], "name": "Dandy Dungeon: Legend of Brave Yamada", "overview": "One Dandy Man Stands Up… …Against Evil …For love! Yamada-kun (Age 36) is a programmer at a major game publisher. He hates his job. Deep into every night, alone in his apartment, he works on his own game: it's an RPG, and he is the hero, Brave Yamada! One day, he falls in love at first sight with his new neighbor Maria-chan and in an effort to nurture these feelings, adds Princess Maria into his game! Will Yamada-kun and Maria-chan find love? Is destiny pre-programmed, or randomly generated? Is love a bug or a feature? Find out in this unique RPG from Onion Games! [What is Dandy Dungeon?] *A roguelite RPG, fusing retro aesthetics with modern ideas and offbeat love-comedy! *Yamada-kun, builds a dungeon of delusions and delves right in! *Tune in to a musical mix of chiptunes and humming?! *Completely re-balanced for play on consoles! *New ranking system: become the bravest Yamada in the world! *Loot dungeons, evolve weapons, collect Dandy armour sets and catalog monsters [How to play] To clear a floor of a dungeon, use your controller or finger to draw a path to guide the Hero between the entrance and the exit. Use healing items and attack or defense spells with proper timing to keep the Hero alive and fighting! Clear all floors of a dungeon to get treasure! Clear all floors with a path covering every square to get a perfect bonus! Each 5x5 floor is packed with treasures, traps, monsters, items, and surprises! [Music] Keiichi Sugiyama’s unique mix of chiptunes and humming compliments Yamada’s retro-themed world perfectly! He is joined by Enka BOSSA’s founder and singer, Caorinho Fujiwara, who composed the Japanese theme song: “Gyakkou Zinsei” (Life Against the Tide) and mystery singer Nagasa Bonus, whose smooth voice flows over the chiptunes of the English version’s theme song: ”Retrograde life”.", "platform": "Nintendo Switch", "release_date": "June 27, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Onion Games", "publishers": "Onion Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118337-dandy-dungeon-legend-of-brave-yamada\n"}