{"altername_name": [], "name": "DARIUSBURST CS CORE + TAITO/SEGA Pack", "overview": "Burst into the depths of parallel space! New combatants join the fray! DariusBurst CS Core + Taito/Sega Pack features the CS and DLC modes from \"DariusBurst Chronicle Saviours\", previously released on other platforms. *The Original, Original EX, Chronicle and Event modes contained within AC Mode are not included. New Features: - 6 New Areas in CS Mode Enjoy a new, expanded chronicle, stretching across 225 stages from Darius Year 1906. - Replay Mode In addition to displaying the top scores in each mode, a replay can be downloaded to view the top players' playthroughs. Replays are available for the no.1 players in each leaderboard. - Ghost Score Playing any stage for which you have replay data will display a ghost replay revealing where you can improve you own score. *You can select a ghost from either the top player's score or your own high score. - Arcade-style force feedback One of the attractions of the original DariusBurst AC cabinet are the powerful vibrations created by the in-seat speaker, which are reproduced here via the controller. The cabinet vibrations were not merely mirroring the sound's volume but were set via a special signal separate from the music and sound effects, and Zuntata has tuned the home version to produce a close estimation of the arcade. - DLC Mode Includes 6 ships from various Sega and Taito games! Night Striker (Taito) Metal Black (Taito) RayForce (Taito) Space Harrier (Sega) Galaxy Force II (Sega) Fantasy Zone (Sega) *Only the Taito and Sega packs are playable and there are no plans for further DLC. If you already own Darius Cozmic Revelation and/or Darius Burst Another Chronicle EX+, the modes featured in those releases are not repeated here.", "platform": "Nintendo Switch", "release_date": "October 27, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Pyramid", "publishers": "Taito", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=8hLfL5fS6jY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/169818-dariusburst-cs-core-taitosega-pack\n"}