{"altername_name": ["Dark Quest 2"], "name": "Dark Quest II", "overview": "Turn Based Dungeon Crawler! Play together with your friends! Dark Quest 2 is a turn based RPG where you control a party of heroes on your epic quest to defeat the evil sorcerer and his minions. The game features a party based system where you control a group of heroes, an isometric hand-drawn art style, dice based mechanics and much more. Each map is designed to take you through an adventure that will test your party's strength, courage and sanity as you go deeper and deeper into the castle in search for the chambers of the evil sorcerer. • Single-Player Campaign Play a story driven campaign that takes you through a series of adventure on your epic quest to defeat the evil sorcerer. • Multiplayer Drop-in / drop-out CO-OP for up to 3 players! • Turn Based Mechanics Every turn each of your heroes in your party can take one single action. Play wise and carefully or fall captive in the eternal prison of the sorcerer. • Assemble a Party Control a group of heroes each with their own personality and strengths. Use the unique strengths of each character and work together to defeat the minions of the evil sorcerer. •Enter a world of fantasy and adventure Explore twisted mazes, find hidden doors and fight bloodthirsty orcs! • Village Stay with the old masters and learn new powers, craft new weapons and mix potions that improve the capabilities of your heroes. • Skull of Fate In the darkest dungeons of the castle, when left with no hope your last and only way out will be to roll the skull of fate and reveal your twisted fate.", "platform": "Nintendo Switch", "release_date": "February 27, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Brain Seal Ltd", "publishers": "Brain Seal Entertainment", "genres": "Adventure", "max_players": "3", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151305-dark-quest-ii\n"}