{"altername_name": [], "name": "de Blob", "overview": "The evil I.N.K.T. Corporation has invaded Chroma City, using their machines to suck the color out of the environment and transforming the happy Raydiants into subversive Graydiants. Only de Blob can right things, by restoring things to their former glory and coloring the Graydients to restore them to their happy selves, foiling I.N.K.T.'s evil scheme in the process! De Blob is an action game based on a Windows game called The Blob, created by students to promote their city. Your job is to roll into color-filled machines, which fill you with that color, and then touch buildings, walls, billboards, trees and Graydiants to restore their color. You can mix colors by rolling into two different primary colors (for example, blue and yellow gives you green). Some buildings are secured and cannot be colored simply by touching them - instead, de Blob jumps inside them and the player must shake the Wii Remote to fill them with color. Each area has gates that are sealed up - these can be opened by earning enough points. Points can be earned for all sorts of things - painting blocks of buildings, freeing Graydiants, completing challenges, and more. Once the player has earned enough points, they'll open up the exit to the level and can leave whenever they wish. There are also hazards for de Blob - water will wash off your color, and you'll steadily lose your supply of paint if you remain in it. There are also ink pools and I.N.K.T. agents which stain you black if you let them. When black, any of your colored objects that you touch lose their color, and your supply of paint drains much faster than normal.", "platform": "Nintendo Switch", "release_date": "June 26, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Blitworks", "publishers": "THQ Nordic", "genres": "Adventure", "max_players": "4", "cooperative": "No", "rating": "3.78", "wikipedia": "https://en.wikipedia.org/wiki/De_Blob", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104479-de-blob\n"}