{"altername_name": [], "name": "Dead in Vinland: True Viking Edition", "overview": "DEAD IN VINLAND is a survival/management game, mixed with RPG and adventure elements, about a Viking family trying their best to survive on a mysterious island. This “True Viking” edition comes with all the DLCs released! Exiled on a faraway and unknown land, lead Eirik and his family on their quest to survive. Manage their physical and mental health, explore the island, organize your camp and deal with other human beings. Some will help you, and some will be less... friendly. Unveil the esoteric mysteries of Vinland. They could save your life… or lead you to your demise. This True Viking Edition includes the 3 DLCs for Dead In Vinland: The Valhund, Battle of the Heodenings, and Norse Side Stories. KEY FEATURES Deep survival management simulation: find and gather resources, secure a supply of food, take care of the mental and physical health of your characters, fight diseases and wounds, ration your water supplies, endure the elements (storm, drought, rain…). Challenging: the game is turn-based so you have time to take the best decisions, but the challenge is high! You’ll have to adapt to the crisis the game throws at you, with your own reasoning. The Valhund! Get your own dog for your camp that will help your characters in many ways. Heodening Mode: An endless, sanboxy, survival mode, letting you customize your starting party and even their skills and Traits! Choose how you play! 3 regular difficulties (Nice Vacation, Survival, and Exteme conditions), and you can even create your own rules thanks to the custom difficulty settings! Will you take on the “True Viking” challenge? Build your camp: expand your shelter with 18 activity stations, each one with its own mechanics. Craft more than 130 upgrades and dozens of items to give you precious bonuses. Choose well, you won’t be able to craft everything. Manage a community: 14 playable characters, each one with their own strengths, flaws and stories. Influence how their relationships evolve with meaningful dialog choices, achieve one of the 12 possible romances or kick annoying characters from your camp and recruit new ones. And some surprises! With the “Norse Side Stories” DLC included, there are many dialogues between the secondary characters! Explore the island: 150 areas to discover with hundreds of objects to interact with. Unveil the many secrets of the island and its beautiful, hand-painted landscapes. Live your own adventure: complete 70 non-linear quests to reach the end of the game. Depending on your choices, learn about what happened to your characters after the end. Full RPG system: 5 health states to care for, 20 skills to develop, more than 600 character traits, 100 items to collect, 30 diseases and 20 wounds to die from… Customize your characters: choose from 5 randomly generated special traits every time they level up. Turn-based tactical combat: quick and deadly 3 vs 3 battles against Björn’s minions. 5 unique playable character classes, each with its own set of fighting skills, and 5 passive classes.", "platform": "Nintendo Switch", "release_date": "July 11, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "CCCP", "publishers": "Plug In Digital", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156854-dead-in-vinland-true-viking-edition\n"}