{"altername_name": [], "name": "DEATHRUN TV", "overview": "You'll experience real-time blistering speed and bullet-dodging action as you compete for glory...assuming you’re able to survive in this 2D bullet hell where only “likes” really count. Coming to you from the largest studio ever constructed...The show where contestants risk it all to gather likes from audiences watching all over the world; 24 hours a day. The entertainment never ends! With breakneck speed, bullet dodging action and lots of guns, you'll have to survive swarms of rabid mutants to progress and level up your contestant. Twin-stick bullet hell action will test your reflexes through each arena. FIGHT EPIC BOSSES Meet Eyeball, Zangbeef the Bear Wrestler, Elite Gaurd and many more. A variety of unique and crazy bosses await you, leading to intense and challenging battles! GET LIKES, GET MUTATIONS, GET STRONGER Getting those precious likes and leveling up your likability will be rewarded with an ever-changing roster of mutations to choose from including exploding bodies and big heads. UNLOCK COOL WEAPONS State of the art studio and proprietary technology will reanimate your body ensuring that you can try again and again, and again and again...Each run offers new challenges and new opportunities to gain fame, you'll also unlock crazy new cool weapons each time you die! BURN…EVERYTHING. Have you always dreamed of barbecuing monsters? If so, you've come to the right game show. ESCAPE BEFORE IT’S TOO LATE At the end of each room, deadly traps and explosives will start to fall, so hurry out before the studio self-destructs and you with it!", "platform": "Nintendo Switch", "release_date": "June 1, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "Laser Dog Games", "publishers": "Merge Games", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=tWSnFi3OS9U", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163368-deathrun-tv\n"}