{"altername_name": [], "name": "Death or Treat", "overview": "Join Scary in the HallowVerse to make things great again! Recently, the Halloween spirit is missing and GhostMart may be on the brink of bankruptcy. Clark Fackerberg, founder of FaceBoo! has started to distribute Storyum: a drug that absorbs the will and hope for Halloween from the inhabitants of HallowTown. Now, with the purpose of restoring the spirit of Halloween and his trade, Scary must destroy FaceBoo! and its 3 divisions; Darkchat, Deviltube and RipTok \"Death or Treat\" is a 2D action-roguelite and hack & slash, with handpainted environments and traditional animation. Explore all the worlds and defeat hordes of enemies using different weapons and skills. You will play as Scary, the owner of Ghost Mart, leader in manufacturing candies for Halloween. Discover huge worlds, explore new maps and try to survive the hordes of enemies. It’s not an easy task, every world is even more tricky than the other. Starting with Darkchat, Riptok, Deviltube, and last but not least FaceBoo!, the ultimate epic frontier. Combat is one of the fundamental pillars of Death or Treat. Choose your favorite weapon style (fast, heavy or ranged) and face a real horde of enemies in the purest hack'n slash style: fly through the air and attack the crowd with force, move nimbly and look for their weak point. Each one of the stores that you will find in HallowTown can provide different profit for your enterprise. You can create new weapons at Frank's Forge, or buy healing potions at DetoxBucks. Our vampire shopkeeper, Joe Bite Them, will help you get new empty slots for your inventory, and the Pumpkin guys will teach you how to craft magic spells. Finally, go to Pumpkin© to trade your ingredients for more candies!", "platform": "Nintendo Switch", "release_date": "May 11, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "Saona Studios", "publishers": "Perpetual Europe", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370667-death-or-treat\n"}