{"altername_name": ["Project Xenon Valkyrie", "Demetrios - The BIG Cynical Adventure", "Bundle Demetrios / Xenon Valkyrie"], "name": "Demetrios: The BIG Cynical Adventure / Project Xenon Valkyrie+", "overview": "Two very different games from the developers Diabolical Mind and CowCat: Demetrios - The BIG Cynical Adventure is a point-and-click puzzle adventure game. Xenon Valkyrie+ is a rogue-lite platformer game with slash 'em up and shooting elements. Demetrios - The BIG Cynical Adventure: The Journey of an Idiot! Bjorn Thonen, a slob of an antique dealer living in Paris, is robbed one night after coming home drunk. Forced to conduct his own investigation with the help of his neighbor Sandra, he ends up involved in a murky, mysterious affair. Features: • A long, varied, standalone adventure (8 to 12 hours of gameplay) • Over 15,000 lines of dialog • Hand drawn art in Full HD • A high level of interactivity • Multiple, fun mini-games integrated into the story • In-game hints : Search and collect hidden cookies on every screen! • Fully translated into English, French, Spanish, Italian, German and Russian Xenon Valkyrie+: A rogue-lite platformer game in which you must fight to the deepest part of a moon and halt the plans of a wicked witch. With traditional graphics and high quality chiptune music, level up and get the amazing power of the Xenon Valkyrie! Features: • Rogue-lite platformer with a great story • Many worlds with different routes • 3 heroes with unique skills • 100+ items • Multiple bosses and enemies • RPG elements • Several endings and secrets • Quality Chiptune music • Hard gameplay and Permadeath", "platform": "Nintendo Switch", "release_date": "March 31, 2020", "game_type": "Released", "esrb": "Not Rated", "developers": "COWCAT", "publishers": "COWCAT", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372449-demetrios-the-big-cynical-adventure-project-xenon-valkyrie\n"}