{"altername_name": [], "name": "Demons of Asteborg", "overview": "Demons of Asteborg is an action-platform game with elements of Metroidvania. Play as Gareth and stop Zadimus, the powerful demon who wants to take his revenge on Asteborg. An original and challenging new 2D game, mixing action, small puzzles and strategy, this 16-bit homage will bring back many memories for retro fans. THE STORY Long ago in the Kingdom of Asteborg, a war broke out, pitting humans and demons against each other in a bloody battle. Sagramor, a powerful mercenary, and Maria, a sorceress with fighting magic, joined forces to defeat the demonic army. Sagramor found a way to lock the demons in an alternate dimension, at the cost of his own life. His sacrifice earned him the title of \"Legend of Asteborg\". Shortly before the end of the war, Maria gave birth to a child named Gareth. She died 4 years later. Gareth was then taken in by the royal orphanage, and Bohort, the leader of the armed troops, saw in him an invaluable potential. He trained him from an early age to become a formidable warrior. Decades later, Zadimus, the former leader of the Demons, who survived the great war, found a way to reopen the portal to the parallel dimension in order to free his fellow Demons and declare war on the humans in order to take back the Kingdom of Asteborg. As Gareth, now the royal guard of Asteborg, you will go on an adventure, braving the lands of the kingdom and its dangerous lands populated by bloodthirsty monsters. Along the way, you'll learn more and more about the ancient war and your identity. But beware, Zadimus won't let you get away with it...", "platform": "Nintendo Switch", "release_date": "August 1, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Neofid Studios", "publishers": "Neofid Technology", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.58", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Um33iEUuUyA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154367-demons-of-asteborg\n"}