{"altername_name": [], "name": "Demon Turf: Neon Splash", "overview": "Woah! Beebz and her friends were sucked into the neon splattered world of a painting and need to get the heck outta there! Can you escape these dangerous & surrealist environments, using your platforming skills, to get back home? FEATURES: - This painting is no joke! Explore these surreal worlds, filled with bright neon colors, and enjoy the intoxicating combination of 2D & 3D art! - Beebz will focus on what she does best! Platforming! Maintain a constant momentum with no stopgaps or combat, it's all about the platforming that is faster & better than ever before! - A unique checkpoint system, tweaked to perfection! Place your own checkpoints at any time with no limit! Retreading is for losers! - Lots to do! Explore 10 finely crafted levels with a plethora of unique challenges and hazards that are constantly introduced to you at a record pace! - Setpiece levels with a fun narrative to boot! After all, Beebz didn't get sucked into the painting alone and her friends certainly are characters! - A ton of additional goals for you to complete, such as: Collecting all the sweets in a level, finding the hidden vinyl which unlocks 10 more remix levels & getting all the trophy times! - Remix levels?! You betcha! And don't be fooled, these are expertly crafted to be entirely new levels with brand new challenges! Better bring your A-game! - Who knows what awaits you if you complete the game 100%? We do, and it's pretty sweet, so you should do it. - 6 finely tuned modifications you can buy with your collectables: Sweets! Only the best of the best, such as mods that add an extra hit point, tweak or add new movesets etc. They even change your looks! - Leaderboards, baby! That's right, compete for the best times across the world and show off your mettle! - Photo Mode! Look, at this point it's mandatory and Beebz is really good at taking selfies! So snap away! - Settings galore! Seriously, this thing's packed with options, so customize your game the way YOU want it to be!", "platform": "Nintendo Switch", "release_date": "April 14, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Fabraz", "publishers": "Playtonic Friends", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ZnGvIpPF7YM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161155-demon-turf-neon-splash\n"}