{"altername_name": [], "name": "Demon Turf", "overview": "The Demon World is inhabited by all kinds of nasties... Most of them lumped into gangs battling for dominion, each led by its own head honcho. Yet even these bad dudes are no match for the Demon King himself! Instead, the task falls to Beebz, a young demon barely a thousand years old, who decides it’s time for her to kick every turf leader’s butt and become the Demon Queen herself. • A unique aesthetic combining the expressiveness of 2D illustrations with the depth and sense of exploration 3D environments can offer! • A world chock-full of humor and style, from the music accompanied by the protagonist’s rapping to the colorful characters inhabiting the world! • A unique take on progression! Take a victory lap and explore previously beaten levels to discover their liberated state, with plenty of mechanical and environmental changes to uncover. Or take some time off in the hub town taking on sidequests and other distinct challenges instead. • Pull off some clever platforming combinations or get physical with a special physics-driven combat system that ramps up the chaos and fun. Push, pull and spin your enemies out of your way. • A different take on checkpoints, freeing the player to place them wherever they want. Show off without them for a perfect run, or place one in preparation for a challenging section. • Unique challenges like the “Photo Hunt” mode where you’re tasked to take pictures of hidden locations & surprising moments! Or simply take pictures and selfies for fun and share them across all social media! • An awesome collection of purchasable mods that can be combined in clever ways to completely change your playstyle! Or you could buy some dyes & pets instead, the world's your oyster! • Tons of carefully crafted levels that constantly introduce new challenges as well as engaging bosses full of character and life! Until Beebz gets to them... From the makers of Slime-san comes their newest creation! The team used everything they learned from their 2D platformer to elevate this 3D platformer to the next level!", "platform": "Nintendo Switch", "release_date": "November 4, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Fabraz", "publishers": "Playtonic Friends", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156309-demon-turf\n"}