{"altername_name": [], "name": "Deponia Doomsday", "overview": "Deponia Doomsday Is a humorous quest in which the player will need to solve puzzles and advance through an interesting plot. This game is a continuation of the trilogy about Deponia and a strange anti-hero - Rufus, for whom we have to play. The plot of the game begins with the fact that we see a strange picture of how an aged Rufus with many scars and a gray mustache is trying to save Deponia from the monsters that have flooded her. After countless attempts, he decides that the only way to do it is to destroy the planet. Making his way through numerous squads of savages, he still achieves his goal and destroys Deponia, sacrificing himself and the whole planet. But as it turns out that this is just a dream and the main character wakes up at home and tries to understand whether all the events really happened in a dream or not? Leaving the house, he discovers a mad scientist and a time machine. Having entered into a dialogue with a stranger, Rufus learns that his name is McChronicle and he is studying time travel. McChronicle has done things and opened several time portals that link time periods, thereby wreaking havoc on Deponia's world. The player will have to embark on a journey with a mad scientist in a time machine to figure out what these temporary portals are.. An exciting storyline, interesting puzzles and addicting gameplay await you that will draw you into Deponia's world for ten hours. Enjoy the continuation of the cult quest trilogy, explore new worlds, enjoy improved graphics and animations, explore new flora and fauna, and a funny narration will not let you get bored in this enchanting adventure.", "platform": "Nintendo Switch", "release_date": "December 23, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "Daedalic Entertainment", "publishers": "Daedalic Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Deponia_Doomsday#:~:text=Deponia%20Doomsday%20%20%20%20Developer%20%28s%29%20,1%20Mar%20...%20%203%20more%20rows%20", "video_link": "https://www.youtube.com/watch?v=paCcly7uIqM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158755-deponia-doomsday\n"}