{"altername_name": [], "name": "Diablo III: Eternal Collection", "overview": "Diablo III is a dungeon crawler action role-playing game developed and published by Blizzard Entertainment. It is the third installment in the Diablo franchise, and was released for Microsoft Windows and OS X in May 2012, for the PlayStation 3 and Xbox 360 in September 2013, and for the PlayStation 4 and Xbox One in August 2014. In the game, players choose one of seven character classes – Barbarian, Crusader, Demon Hunter, Monk, Necromancer, Witch Doctor, or Wizard – and are tasked with defeating the Lord of Terror, Diablo. An expansion pack, titled Reaper of Souls, was released for the PC versions of the game in March 2014, and was later released for consoles as part of the Diablo III: Ultimate Evil Edition version in August 2014. The Diablo III: Rise of the Necromancer pack was released for the Windows, macOS, and latest-generation console editions of the game in June 2017. Diablo III: Eternal Collection, combining Reaper of Souls and Rise of the Necromancer, was released for PlayStation 4 and Xbox One in June 2017, and for the Nintendo Switch in November 2018. Diablo III received critical acclaim, although its always-on DRM feature was criticized. The game set a new record for fastest-selling PC game by selling over 3.5 million copies in the first 24 hours of its release, and was the best selling PC game of 2012, selling over 12 million copies. By August 2015, that number had grown to over 30 million.", "platform": "Nintendo Switch", "release_date": "November 2, 2018", "game_type": "Released", "esrb": "M - Mature", "developers": "Blizzard Entertainment", "publishers": "Blizzard Entertainment", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Diablo_III", "video_link": "https://www.youtube.com/watch?v=w6JMXXk6No4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/112533-diablo-iii-eternal-collection\n"}