{"altername_name": [], "name": "Dimension Drive", "overview": "Dimension Drive is a space shooter that challenges your skills in entirely new ways. Play two games at once on this dual battlefield madness set on a comic book universe! Dimension Drive is a Dual-Battlefield space shooter with a teleportation mechanic. It seamlessly combines shooting and puzzle mechanics. Dimension Drive will teleport you into a comic book styled sci-fi space opera set in a multidimensional universe. The Ashajuls, a cruel multidimensional alien race, are attacking our universe. Fight as Jackelyne Tywood (a.k.a. Jack) in The Manticore, a legendary ship capable of teleporting across space and dimensions. Uncover the mysteries of your past and the origin of the Dimension Drives with your trusty friend and A.I., \"V.E.R.A.\", at your side. Features A New Type of Shoot’Em Up: Dimension Drive is a Dual-Battlefield vertical Shoot’Em Up with a focus on smart, quick teleporting. Unlock several weapons by finding secret data cubes in the levels and improve your arsenal for the ultimate fight. Choose the best weapon for each level. Rich Sci-fi Adventure: Unfold the secrets of the Dimension Drives and your past, teleport across the multiverse fighting the ultimate threat, and meet new races and allies! Clever mix of mechanics: A seamless combination of levels focusing on strategic shooting and real-time puzzles will make you question what you know about shoot'em ups. 2 games on your screen: Multitask and single-handedly fight 2 shoot’em ups side-by-side. 4 difficulty modes: Normal, Hard, Extreme and Insane! Offer different challenges for different play styles. Play with shields in Normal, or go to the old-school route with one hit kills in Hard and Extreme. If you are up for the challenge try Insane and try your luck at beating the game with one single hit. Mirror Dimension: Finished the 13 levels of the campaign? Play the Mirror Dimension levels. 13 extra levels in this New Game+ mode. Single player and local co-op: Play solo or enjoy our unique take on 2 player mode: total cooperative where both players share everything down to their lives, play as a team or die. Comicbook art style: Video game meets comic. Experience the story of Jack through the motion comics and awe at the colour rich in-game comic art style. Who said space was black? Energy management: The Manticore is powered by the Dimension Drive energy. Carefully strategize and decide when and where are the best places to teleport. Advanced scoring system: Obtain the best score in the leaderboards. Teleportation! (We said that already, didn't we?)", "platform": "Nintendo Switch", "release_date": "December 7, 2017", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "2Awesome Studio", "publishers": "2Awesome Studio", "genres": "Shooter", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107468-dimension-drive\n"}