{"altername_name": ["Makai Senki Disgaea 5"], "name": "Disgaea 5 Complete", "overview": "This entry to the legendary Disgaea series tells a tale of revenge, and of rebellion. As a new and terrible Overlord named Void Dark seeks to enslave the countless Netherworlds, one young demon has stood to end his reign-Killia. In Disgaea 5, players lead Killia and his tenacious army of rebels on their dark and dangerous path to vengeance. Filled with more over-the-top action and hilarious writing than ever before, Disgaea 5's damage numbers are surely headed for the record books. Features: * Alliance Attacks: New to the Disgaea series, your relationship with your teammates influences a new battle system called Alliance Attack. These special moves are only available to main characters and only when their relationships are appropriately aligned. * Recruitment: A familiar feature for Disgaea faithful, this system lets you choose from over 40 races and jobs, and identify new party members with the exact traits you desire. * Revenge Mode: The Revenge Mode empowers your characters with bonus stats when they've become fed up of their allies being beat on. * Explore the Netherworlds: While previous games in the series have shown a glimpse of the darkness that is the Netherworlds, Disgaea 5 takes you to a myriad of those dark lands. * Languages: Enjoy English and original Japanese voices, and French and English in-game text! * Includes Laharl's and seven additional side-stories. Join past Disgaea characters for exciting post-game content! * Add seven great characters to your squad not found in the original retail release including Nisa, Girl Laharl, and more!", "platform": "Nintendo Switch", "release_date": "May 23, 2017", "game_type": "Released", "esrb": "T - Teen", "developers": "Nippon Ichi Software", "publishers": "NIS America", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.89", "wikipedia": "https://en.wikipedia.org/wiki/Disgaea_5", "video_link": "https://www.youtube.com/watch?v=Nifiow7chgU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/80625-disgaea-5-complete\n"}