{"altername_name": [], "name": "Distrust", "overview": "A helicopter crash left a group of explorers stranded near an Arctic research station. The survivors will have to resist the nightmares of dead frost and hunger. As they try to escape the dangers of the long dark polar night and find the way to the shelter of the abandoned station, all they are doing is sinking deeper into a nightmare scenario. When they fall asleep, they attract a terrifying force that sucks the life out of their bodies, but the longer they battle exhaustion and stay awake, the less likely they are to survive. Guide the explorers through a randomly generated station, overcome the severe climate and fight the unfathomable! MYSTERIOUS ANOMALIES WAITING IN THE WINGS They come out of nowhere and disappear instantly. They may be faster than light or may crawl slowly till they get near enough to strike. What are they? What do they want? THE ENDLESS NIGHT AND EXTREME CLIMATE Explore and research the abandoned station, gather and craft the tools and open the supply boxes so you don’t starve from hunger and cold. PROCEDURAL GENERATION A randomly generated base turns every new playthrough into a unique adventure. 15 SURVIVORS TO CHOOSE FROM Every character has unique skills and abilities to fit any survival strategy of yours. AN ABSORBING NARRATION WITH TONS OF PLOT TWISTS AND QUESTS TO COMPLETE What is that force that inhabits the station? Is that an alien from the outer space or a mythical ancient creature from the from the depths of the centuries? Or is that a result of a failed scientific experiment? Survive to learn the answer! ALTERED PERCEPTION OF REALITY As the explorers try to sleep just enough to stay alive, they slowly go mad and eventually reach the point where they can no longer trust their senses and tell the difference between reality and a hallucination.", "platform": "Nintendo Switch", "release_date": "July 16, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Cheerdealers", "publishers": "Alawar Premium", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156863-distrust\n"}