{"altername_name": ["DNF Duel"], "name": "DNF Duel: Who's Next", "overview": "THE SEEDS OF VOLITION BRING FORTH A CHALLENGER! Action fighting at its extreme! One of the most popular and widely played RPGs in the world, Dungeon and Fighter is now back as a 2.5D action fighting game. Choose from 16 charming characters, each with their distinct skills and personalities. Outsmart, outplay, or downright beat up your opponents and become the master of the Ultimate Will! DNF Duel flawlessly reinterprets the iconic classes from the classic Dungeon and Fighter RPG. Whether it’s the lightning-fast and flashy gunshots of the sly Ranger or the uninhibited raw power of the frenzied Berserker, each character’s iconic traits have been heightened and reworked. A total of 16 unique characters are available: Berserker, Striker, Grappler, Inquisitor, Dragon Knight, Ranger, Hitman, Kunoichi, Enchantress, Vanguard, Swift Master, Ghostblade, Troubleshooter, Crusader, Launcher, and an unlockable Hidden Character. 17 years of lore is integrated within the storytelling and character development of DNF Duel, supported by the stunning graphic details that merge seamlessly with the stage designs of Arad. Enjoy your duels in 8 diverse stages: Sky Tower, Oceanic Express, Moonlight Tavern, Hendon Myre, Ghent City of God, Saint Horn, Zelva, Ruins. DNF Duel takes the fighting game genre to a whole new level with its unique combat system and tactics. Each character has their signature moves and strengths, which are further accentuated by their Awakening effects. Don’t forget to keep track of your MP Gauge and White Damage Gauge, lest your opponent catches you by surprise! Story Mode allows you to play through each character’s origin story, offering a fully immersive experience into the world of Dungeon and Fighter. Customize your player profile, and unlock exclusive wallpapers and sounds in the Gallery! 【Modes & Features】 ■ Online Mode: Ranked Match, Player Match, Ranking ■ Local Mode: Free Battle, Story Mode, Arcade Mode, Survival Mode ■ Practice Mode: Training Mode, Tutorial ■ Collection: Player Profile, Replay Library, Gallery, Glossary 【Supported Languages】 ■ System: English, Korean, Japanese, Chinese (Simplified, Traditional), Spanish, German ■ Voiceover: Korean, Japanese, Chinese", "platform": "Nintendo Switch", "release_date": "April 20, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Arc System Works", "publishers": "Nexon America", "genres": "Fighting", "max_players": "2", "cooperative": "Yes", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/DNF_Duel", "video_link": "https://www.youtube.com/watch?v=f7y-VHByCR0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368085-dnf-duel-whos-next\n"}