{"altername_name": [], "name": "Don't Forget Me", "overview": "Where are you? *Who* are you? As amnesiac Fran, you awake from a mind-consuming reverie on the doorstep of one of the world’s foremost experts in memory manipulation. Taken in by the kindly Bernard, you begin your life anew, diving into the minds of patients to uncover and copy their memories.. But it’s not long before the secrets you left behind catch up with you...and the fate of the world comes knocking at your door. Inspired by games like Her Story and The Red Strings Club, Don’t Forget Me combines classic adventure gameplay with a modern puzzle system. Enter the minds of patients and use deduction to access their memories and progress your story. Mnemonic Detective: Become the detective through an intricate puzzle system designed to test your observation and deduction skills. Each new patient requires you to consult your own knowledge of their interests and history and assign keywords to explore their memories and reveal their secrets. Remembrance of the future: Set in a world both startlingly different and strangely familiar to our own, Don’t Forget Me’s enchanting characters draw you into a universe with a deep history and exciting future. Join Fran and Bernard as they pick apart this world’s mysteries and prove there is hope left for mankind. Retro-futurism: With a spellbinding soundtrack of original jazz and synthwave music alongside gorgeous pixel art and charming characters, Don’t Forget Me immerses the player in a unique vision of the future, a future whose path you can still change. Features: A unique vision of the future set to an original jazz and synthwave score. Unique text based puzzle system, where observation and empathy are as important as logic and reason. Decision based gameplay that will test the limits of your morality.", "platform": "Nintendo Switch", "release_date": "September 16, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "The Moon Pirates", "publishers": "The Moon Pirates", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=bJ2emStZTww", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168046-dont-forget-me\n"}