{"altername_name": ["Dragon Quest XI S", "Dragon Quest 11 S: Echoes of an Elusive Age Definitive Edition", "Dragon Quest XI S Sugisarishi Toki o Motomete", "Dragon Quest XI S: Streiter des Schicksals", "Dragon Quest XII S: Les Combattants de la destinée Édition ultime", "Dragon Quest XI S: Echi di un'era perduta: Edizione definitiva", "Dragon Quest XI S: Ecos de un Pasado Perdido: Edición Definitiva", "ドラゴンクエストXI 過ぎ去りし時を求めて S"], "name": "Dragon Quest XI S: Echoes of an Elusive Age: Definitive Edition", "overview": "You are the Luminary, the hunted hero who will protect the land from destruction in the latest RPG from the iconic Dragon Quest series. With a ragtag band of adventurers, you’ll engage in well-balanced, turn-based battles and embark on quests across the kingdom of Erdrea. Forge gear, develop party members’ skills, and alter their outfits without changing gear in this edition of the game! This version also lets you ride and attack with monsters on the field to earn experience points, as well as change between HD or 16-bit visuals, symphonic or synth music, and English or Japanese audio. Complete the tale with new character-focused stories, and travel to past Dragon Quest worlds! Across the land, you’ll meet the mysterious Tockles - creatures that allow you to visit 2D, 16-bit versions of areas from popular entries in the series like Dragon Quest IV and Dragon Quest VIII! It’s fun to see these classic worlds reimagined in retro style, meshing perfectly with the main game’s 2D mode. Like all past Dragon Quest games, this one’s character designs are based on the signature style of famed artist Akira Toriyama. Paired with the voiced dialogue, the rich personalities of your most loyal companions and fiercest enemies are brought to life, so you can fully immerse yourself in this quest to discover the Luminary’s true heritage and awaken your power. For a greater challenge, start the game with the Draconian Quest setting, and capture your favorite moments with Photo Mode!", "platform": "Nintendo Switch", "release_date": "September 27, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Square Enix", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.44", "wikipedia": "https://en.wikipedia.org/wiki/Dragon_Quest_XI", "video_link": "https://youtu.be/O0K942h4BDE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119550-dragon-quest-xi-s-echoes-of-an-elusive-age-definitive-edition\n"}