{"altername_name": ["勇者鬥惡龍 1+2+3合集", "Dragon Quest 1+2+3 Collection"], "name": "Dragon Quest / Dragon Quest II: Luminaries of the Legendary Line / Dragon Quest III: The Seeds of Salvation", "overview": "Three legendary RPGs come to Nintendo Switch in the Dragon Quest I + II + III Collection from Square Enix. Whether you're a veteran fan in need of a nostalgia trip, or a newcomer to the series looking for a fresh take on an old classic, there's something here for everyone! Dragon Quest The peace of fair Alefgard has been shattered by the appearance of the nefarious master of the night known as the Dragonlord, and the Sphere of Light, which for so long kept the forces of darkness in check, has been stolen! It is time for you, a young warrior through whose veins flows the blood of the legendary hero Erdrick, to set out on a quest to vanquish the Dragonlord, and save the land from darkness! Dragon Quest II: Luminaries of the Legendary Line A century has passed since the events of the first DRAGON QUEST, during which time the descendants of the hero of Alefgard have forged three new nations. But the peace they have known is no more. Demon hosts summoned forth from the darkness by High Priest Hargon have brought the land to the brink of ruin once again. Now, the young prince of Midenhall must set out to find the other two descendants of Erdrick so that together they might defeat the nefarious Hargon and restore peace to their world. Dragon Quest III: The Seeds of Salvation On the morning of your sixteenth birthday, you are charged with a seemingly impossible task by the King himself: to assume the mantle of your father Ortega, the hero of the land of Aliahan, and slay the Archfiend Baramos, master of darkness! What trials await you, intrepid hero, as you set out on a quest not even your legendary father was strong enough to complete?", "platform": "Nintendo Switch", "release_date": "October 24, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=JSLCkPNgiA0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124166-dragon-quest-dragon-quest-ii-luminaries-of-the-legendary-line-dragon-quest-iii-the-seeds-of-salvation\n"}