{"altername_name": [], "name": "Dreamscaper", "overview": "By night, delve into your subconscious and discover powerful artifacts to conquer your nightmares. By day, explore Redhaven and build relationships to unlock dream powers. DREAM. DIE. WAKE. REPEAT. Dreamscaper is an endlessly replayable Action Roguelike with a waking/dreaming gameplay cycle. By night, delve deep into your subconscious, facing nightmares in an ever-changing world filled with unique items, abilities, and challenges. By day, explore the city of Redhaven, build relationships and unlock permanent upgrades in order to take on the next dream stronger than ever. - Features - Lean into the nightmares and make the rush of permadeath your ally. Use lucid powers to manipulate the elements, warp space, and even control time itself. Battle bosses that embody Isolation, Fear, Negativity, Loss, and more. Upgrade a multitude of surreal items and discover powerful artifacts. Live Cassidy's waking life and uncover the mystery of her story. - MASTER DEEP COMBAT SYSTEMS - A rich, expansive combat system that rewards skilled play. Use careful positioning, exact timing and quick reflexes to defeat foes with an abundance of combat options. Each weapon class in Dreamscaper is unique, from rending the earth below your nightmares to whipping a yo-yo into their faces. You’ll have a myriad of ways to approach combat. Enemies and bosses in Dreamscaper are representations of Cassidy's most negative emotions. Vanquish those deadly foes to clear the dark miasma surrounding her. - OVERCOME THE NIGHTMARE - Adventure through beautiful, haunting dreams to discover untold secrets, vanquish nightmares, and upgrade your gear all while uncovering Cassidy’s story as you plunge through her subconscious. Each dream is another peek into Cassidy’s memories and experiences. Live Cassidy's waking life and forge friendships with the people around her. Empower Cassidy with their hopes and memories to dispel the darkness of her nightmares.", "platform": "Nintendo Switch", "release_date": "August 5, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Afterburner Studios", "publishers": "Freedom Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155822-dreamscaper\n"}