{"altername_name": [], "name": "Duel Princess", "overview": "This is a side-scrolling tower defense game where you lead your units from your own castle towards the Princess' castle and capture it. There are roguelite elements that lets you enjoy building new decks each time you play the story mode. There are also many sexy rewards that men all over the world can enjoy! There are roguelite elements that lets you build decks based on your own choices! The stages of each princess you are up against are made up of multiple grids. Players must fight small fry enemies, which will appear in each square. Players can earn a lot of rewards through the 'Elite' grids, but enemies are also more powerful there. 'Shop' grids lets you buy and enhance units, and 'Camp' grids are where you can explore and earn rewards to increase your unit's level. The objective is to defeat the princess waiting for you at the end of the stage by building up your deck and using various battle tactics. There are also roguelite elements that lets you enjoy building new deck each time you play. Carefully select cards you get from battles and events to create your very own, unique deck! The goal is to attack the enemy's castle by summoning units from the cards in your hand. You can summon units from your own castle by consuming 'Mana', which can be accumulated over time. There are three types of units: close-range, medium-range, and long-range. These three types have a three-way relationship in terms of their advantages and disadvantages, so the key to success is choosing units according to the enemy's type. Additionally, if you have the same unit in yoru hand, you can activate 'Override\" to combine the two to further strengthen them. Skills can be activated during battle when the skills gauge, which can be filled over time, is full. Each princess has one skill that is unique to her. Building a deck according to the princess' skill is also one of the keys to success! The game has been removed from Nintendo Switch eShop worldwide for undisclosed reasons. Owners of the game can still play it.", "platform": "Nintendo Switch", "release_date": "January 13, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "querate", "publishers": "", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=c4wgYhJkCMI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158849-duel-princess\n"}