{"altername_name": [], "name": "Duke Nukem 3D: 20th Anniversary World Tour", "overview": "Frag like it’s 1996 – this time with even more asses to kick! Join the world’s greatest action hero in Duke Nukem 3D: 20th Anniversary World Tour as he saves Earth once again, saving babes across the globe. Blast your way through hordes of ugly aliens in four classic Duke Nukem 3D episodes. An all-new fifth episode from the game’s original episode designers includes a new weapon, new music from the game’s original composer, and all-new lines from the original voice of Duke. -Switch enhanced: Come to grips with Duke with gyroscopic aiming support, motion controls, and HD Rumble, only on Nintendo Switch -Campaign co-op: Enjoy the full campaign with up to eight(!) players in ad hoc multiplayer or with Nintendo Switch Online -Dukematch: Frag your friends in Duke’s take on classic deathmatch, playable with up eight players over ad hoc multiplayer or with Nintendo Switch Online -New episode: Created by the original episode designers, Allen Blum III and Richard “Levelord” Gray! -New weapon: Duke Nukem roasts aliens with the Incinerator -New Duke Voiceover: Enjoy colorful new Duke talk alongside high-fidelity re-recordings from Duke Nukem’s original voice actor, Jon St. John! -New music: The score for Episode 5 was maestro’d by Duke’s theme song author and original game composer, Lee Jackson! -Remastered: Play with the original 1996 look, or enjoy a remastered look in True 3D with higher fidelity and framerate", "platform": "Nintendo Switch", "release_date": "June 23, 2020", "game_type": "Released", "esrb": "M - Mature", "developers": "Gearbox Software", "publishers": "Gearbox Publishing", "genres": "Shooter", "max_players": "8", "cooperative": "Yes", "rating": "3.88", "wikipedia": "https://en.wikipedia.org/wiki/Duke_Nukem_3D#Console_versions_and_add-ons", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/133300-duke-nukem-3d-20th-anniversary-world-tour\n"}