{"altername_name": [], "name": "Dungeon Limbus", "overview": "A young woman who manages a mysterious blacksmith's shop and a village of resurrection that she meets on the border between death and life. Adventure deep into the dungeon in search of lost memories. Repeated deaths will make you stronger. 1. Different spaces between death and life A mysterious world that stays for a while between death and resurrection. This blacksmith living in a different space will hand over his weapons to you. You can make stronger weapons with the crystal collected in the dungeon. You can request weapons in advance for the next generation. Aiming to clear various quests Please decide the goal of the play. 2. Growing village together When rescued the peoples in dungeon you can enjoy more food. We hire friends with special abilities. You can also develop new magic skills. The growth of the village will lead to your growth. 3. Strategic play using magic skills A variety of magical skills that add strategic features to the turn-based game. You can move immediately across walls or install traps. You can attack enemies at long distances or move fast. It's not a simple recovery and attack, but a variety of magical skills. Enjoy strategic play. 4. Support for your peers They opened the locked door, and they lit up the lights, They look for stairs, etc. We've got a lot of different capabilities. You can hire up to three people. By combining your peers, you can play strategically for yourself. The Dungeon Limbus is a turn-Roguelike Let's capture the dungeon while growing the village and its weapons through repeated deaths. ·It's Simple play of turn-only operation performed on tile maps ·Character growth through equipment and weapons production ·Use of friends, magic skills, and cooking through the village card deck configuration ·Fun differently every time with random maps of various themes ·Strategic battle with giant bosses with battle patterns ·Collection elements and multi-endings that you can enjoy for a long time Even if you die, you will come back to life again... Is this a blessing or a curse? Go on an adventure now to find the answer!", "platform": "Nintendo Switch", "release_date": "December 28, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "GameIn", "publishers": "Troooze, Inc.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Ks0-qcz82E4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156774-dungeon-limbus\n"}