{"altername_name": [], "name": "Dungeon Encounters", "overview": "An otherworldly labyrinth has suddenly appeared on the outskirts of a quiet town. Make clever use of your abilities to chart the depths, overcome obstacles and defeat your foes in thrilling battles! From some of the key development team behind the legendary FINAL FANTASY franchise, DUNGEON ENCOUNTERS is a dungeon exploration RPG where you must strategize to survive. The streamlined interface gives you the freedom to prepare and manage your party as you strive to reach the final floor. With a minimalist design philosophy, the deliberately streamlined visuals and presentation allows you to focus wholly on the challenging and fun gameplay mechanics. A formidable 99 floor dungeon beneath the earth awaits you! During your expeditions, you'll discover rare and powerful items, meet lost adventurers who might just become new allies, and come face-to-face with deadly monsters. You will need to use trial and error to reach the deepest levels of the dungeon, making use of your best strategies and tactics. Do you have what it takes to overcome the numerous trials that await you and discover the dungeon's secrets? ■Events By uncovering and visiting spaces with white numbers, you may obtain items, unlock and change abilities, restore your party to health, find hidden merchants, and much more. Battle encounters, marked with black numbers, are hidden throughout the map. However, they can be revealed with a special ability, allowing you to choose when and where to engage your enemies. Previously discovered events will be recorded in the Event Log, a valuable resource that allows you to reference past experiences to tackle future challenges. ■Battles Test your strategies in thrilling battles, featuring the Active Time Battle (ATB) system made famous by the FINAL FANTASY series. Under the direction of Ito Hiroyuki, creator of the ATB system, battles play out in real-time, utilizing a polished and refined iteration of this classic design, which promises exciting, challenging combat. ■Map The blank map awaits you, and by exploring and investigating every tile on each level, you will be awarded ability points. Navigate obstacles, including secret passages and hidden traps, and conquer the dungeon!", "platform": "Nintendo Switch", "release_date": "October 14, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155823-dungeon-encounters\n"}