{"altername_name": [], "name": "Dungeon of the Endless", "overview": "A thrilling mix of dungeon defense and roguelike. Dungeon of the Endless is the award-winning Rogue-Like Dungeon-Defense game, in which you and your team of heroes must protect the generator of your crashed ship while exploring an ever-expanding dungeon, all while facing waves of monsters and special events as you try to find your way out... WHAT’S BEHIND THE DOOR? A few hundred condemned criminals were being shipped to the Auriga system on board the prison hulk “Success”. While this was presented as a chance to earn back their place in society by working hard for the common good, they understood that in fact they would be slave labour, sent to colonize an unexplored planet. All they knew about Auriga Prime was what the probes told them: it had water, temperate zones, plant life, and plenty of metals in the crust. In fact, the planet Auriga once hosted a major settlement of the galaxy-travelling ancestors known as the Endless. In addition, the planet was still orbited by a functioning (and well cloaked) defensive system, which sprang eagerly to life upon the arrival of the Success. Within a few minutes, the ship was nothing but a few large chunks of metal falling toward the planet. Luckily, every set of holding cells also functioned as an escape pod, so the ship let itself disintegrate and the surviving prisoners fell bruised but (temporarily) alive and (momentarily) safe to the planet below. Safe, that is, until they realized that they had crashed through some sort of Endless facility, all the way down to a sub-basement so deep and ancient it might as well be called a dungeon… Gather A Team • Form a team of heroes, each with their own strengths (and psychoses) • Equip them, deploy them, and earn powerful abilities • Manage the balance between ex-prison inmates and guards Build Your Defenses • Use the Dust you gather to power the rooms • Use scarce resources to help your team survive • Build minor and major modules to hold off waves of monsters • Decode Endless ruins to discover life-saving technologies Open the Door • Each door is a danger; prepare yourself and your team for anything • Explore and discover an infinity of levels and layouts • Carry your crystal through waves of monsters to the exit of each level • Fight your way to the surface to discover the truth about Auriga The game also includes the following content: •Deep Freeze •Death Gamble •Rescue Team •Organic Matters", "platform": "Nintendo Switch", "release_date": "May 15, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Amplitude Studios", "publishers": "Playdigious", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156601-dungeon-of-the-endless\n"}