{"altername_name": ["地球防衛軍4.1"], "name": "Earth Defense Force 4.1: The Shadow of New Despair", "overview": "Earth Defense Force 4.1: The Shadow of New Despair (地球防衛軍4.1 - often simply referred to as EDF 4.1) is a third-person shooter video game, and part of the Earth Defense Force series. Set in a world where Earth is under attack by giant insects and other extraterrestrial threats, players join the Earth Defense Force (EDF) to repel these invaders and save the planet. Features: • Huge Enemy Varieties: Battle against giant insects like ants, spiders, and bees, as well as formidable robots and towering kaiju-like creatures. • Expansive Arsenal: Over 800 weapons to choose from, ranging from assault rifles and rocket launchers to specialized tools like the Air Tortoise missile. • Four Unique Classes: Players can choose between four classes, each with distinct abilities and playstyles: Ranger: The standard infantry unit with balanced mobility and firepower. Wing Diver: A jetpack-equipped female warrior who excels in airborne combat but has limited energy. Air Raider: Specializes in calling in airstrikes, placing turrets, and supporting allies. Fencer: A heavy-duty class wearing powered exoskeletons, capable of wielding massive weapons. • Dynamic Destruction: Environments are fully destructible, allowing players to level entire buildings and landmarks. • Co-op Gameplay: Players can team up with friends in online cooperative multiplayer, working together to defeat the alien onslaught. • Hordes of Enemies: Experience the chaos as hundreds of enemies appear on screen simultaneously, leading to intense and action-packed gameplay. • Epic Battles: Fight against massive motherships, underground tunneling monsters, and dragon-like creatures in large-scale confrontations. • Engaging Narrative: The game offers a compelling storyline, mixing humor with the desperation of defending Earth from an overwhelming foe. • Customization: Equip your character with different weapons and items tailored to your preferred playstyle. • Challenging Difficulty Levels: Multiple difficulty levels ensure that both newcomers and series veterans can find an appropriate level of challenge.", "platform": "Nintendo Switch", "release_date": "December 22, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "Sandlot Games", "publishers": "Bandai", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Gg1NTFcOe_k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372460-earth-defense-force-41-the-shadow-of-new-despair\n"}