{"altername_name": [], "name": "Elderand", "overview": "Only the strong will conquer this gruesome action platformer with RPG elements. Through the darkness and madness, promised glory awaits. Heads will literally roll in this gruesome, retro-inspired action platformer, where only the strong will survive in brutal, skill-based combat against terrifying creatures. Wield a variety of killing instruments and abilities to test your metal against towering, bone-chilling bosses. Explore a twisted Lovecraftian world shrouded in darkness and madness. RPG elements allow you to customize your battle experience to your liking, from your character’s appearance to skills, stats, and weapons. Glory and riches await those who can spill the required blood and guts to collect it. Key Features: • Wield an arsenal of killing devices, including whips, swords, daggers, axes, bows, and more. From a magical staff that shoots bursts of energy to a giant sword, different weapons have different stats and capabilities, so find the ones that you enjoy battling beasts with the most! • Satisfying Metroidvania-style exploration meets terrifying Lovecraftian creatures in this detailed hand-drawn pixel world with glorious gothic aesthetics and handcrafted level design. • RPG elements let you customize your experience to best suit your play style, from your character’s appearance to their skills, stats, and weapons. • Collect loot from exploration and fallen enemies and then use it to upgrade your weapons via crafting. • Travel to the many corners of this perilous land, such as an inviting village with merchants, a forest, a temple prison, floating islands, a cursed Cathedral, and the hellscape that is Elderand itself. • More than 60 different enemy types and around a dozen bosses for your slaying pleasure. • Collect lost letters and other correspondence from the poor souls who came before you to learn more about the darkness taking hold of this grim land.", "platform": "Nintendo Switch", "release_date": "February 16, 2023", "game_type": "Released", "esrb": "M - Mature", "developers": "Mantra", "publishers": "Graffiti Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=MTnFLFhrVSY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367723-elderand\n"}