{"altername_name": [], "name": "Elliot Quest", "overview": "Elliot can’t die—but he’s still running out of time. In Elliot Quest, the victim of a rare curse must find a cure before he’s transformed into a demon. After Elliot’s wife disappears, he falls sick and attempts to take his own life--only to discovers that he can’t die. Plagued by nightmares and growing weaker by the day, Elliot seeks out a local Sage, who tells him that he’s the victim of a rare curse. A demon called a Satar is slowly consuming Elliot’s vitality. If Elliot can’t find a cure to the curse before it’s too late, he will become a Satar. His only hope is to ask for the help of one of the island’s Guardians, who have kept the Satar from taking over Urele. Elliot can’t die—but he’s still running out of time. Gameplay: Elliot Quest is an adventure/RPG where players explore the mysterious Urele island in search of an ancient demon. With 5 dungeons to conquer, 16 bosses to defeat, and countless treasures to discover and hidden areas. Well-balanced gameplay easy to pick up but challenging to master. Elliot Quest features: • An expansive island to explore with over 16 unique bosses • Customize your character with an engaging Level Up System • Chain attacks to make enemies drop more items • Experiment with different magic attacks to defeat Elliot’s enemies • Solve puzzles to find hidden crystals and access secret areas • Hunt powerful monsters to find powerful weapons • 3 unique endings based on your decisions • Well-balanced gameplay that’s easy to pick up but challenging to master", "platform": "Nintendo Switch", "release_date": "October 19, 2017", "game_type": "Released", "esrb": "", "developers": "Ansimuz Games", "publishers": "Ansimuz Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "https://en.wikipedia.org/wiki/Elliot_Quest", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/92264-elliot-quest\n"}