{"altername_name": ["Espgaluda II : Black Label", "Espgaluda II: Be Ascension: The Third Bright Stone of Birth"], "name": "Espgaluda II", "overview": "■ Story Galuda is a biological weapon that connects the Holy Spirit and humans through alchemy and mechanical engineering. The military nation \"Shinra\", which gained the power of Galuda, was destroyed by the two Galuda \"Ageha\" and \"Tateha\" that they created. Three years have passed since that war. After an experiment that touches on contraindications, \"Soma\" has artificially acquired Galuda's abilities. And the only Galuda who was born, \"Asagi\" who was the assassin of King Soma. \"Tsubame\" and \"Janome\" who are also artificial Galuda and prince and princess of Soma country chasing Asagi. Then, Ageha and Tateha head to rescue Asagi to stop the tragedy. The battle with the true Galuda and the built Galuda is about to begin. ■ Characteristic battle system The ultimate power to bring out the true power of Galuda, \"Ascension\" and \"Awakening Death World\". At the time of Ascension, the characters and genders of the main characters are changed in order to bring to the surface the personality and appearance of the fused \"Holy Spirit.\" When activated, it develops a barrier and delays the time it flows to the outside world, so the scroll speed of the screen and the speed of enemy aircraft and bullets are extremely reduced. Therefore, even beginners can easily avoid high-speed bullets and dense barrage, and advanced players can earn a large amount of scores, which is an integrated offensive and defensive game system. ■ Features * Three characters with different attack characteristics * Novice mode prepared for beginners and arrangement mode prepared exclusively for the home version * Highly reproducible arcade mode and high-quality game mode * Simultaneous recording of new game rules and a black label version developed by another added girl * Screen setting options that can be enjoyed in vertical mode * Sounds that color the game world, created by Manabu Namiki and other sound creators who are highly regarded around the world.", "platform": "Nintendo Switch", "release_date": "September 9, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "Cave", "publishers": "Livewire", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "4.83", "wikipedia": "https://en.wikipedia.org/wiki/Espgaluda_II", "video_link": "https://www.youtube.com/watch?v=nwTmVoUBwgA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154685-espgaluda-ii\n"}