{"altername_name": ["世界樹の迷宮I・II・III HD REMASTER"], "name": "Etrian Odyssey Origins Collection", "overview": "Create endless adventure with the Etrian Odyssey Origins Collection! Explore the rich beginnings of this RPG franchise with remasters of three timeless adventures that inspire players to go on a journey of discovery, mapping deep dungeons, and building customized parties for exploring and engaging in tactical combat. Play as the leader of a guild of adventurers, searching for rare treasures and secrets within the depths of a vast, sprawling labyrinth. Traverse and draw a map of the environment while encountering enemies large and small in turn-based combat, then return to town to rest, sell materials for better equipment, and manage your party, selecting from a collection of heroes to build the right team for the job. Etrian Odyssey Origins Collection Features: - Survive a vast, labyrinthian forest on the edge of a peaceful village in Etrian Odyssey HD, journey to a floating castle in the sky in Etrian Odyssey II HD, and be transported to an oceanic paradise and rumors of a drowned city in Etrian Odyssey III HD. - Touch screen mapping functionality for the Nintendo Switch™: Plot your progress through the labyrinth, drawing walls and placing icons to note special events and resources - Newly remastered graphics, remastered soundtrack and quality of life improvements including difficulty selection and save slots - Easy access to the Monstrous Codex, quest log and skill tree - Maximize your adventuring by optimizing your party, choose the character classes that work for your playstyle", "platform": "Nintendo Switch", "release_date": "June 1, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Atlus", "publishers": "Sega", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369372-etrian-odyssey-origins-collection\n"}