{"altername_name": [], "name": "Event Horizon: Space Defense", "overview": "Build and command your starbase in an endless journey. Choose every detail of your playstyle from hundreds of ships, weapons, modules and upgrades. You are under attack! Set in the captivating Event Horizon universe, this hardcore game puts you in control of a massive space fleet at war with over twelve alien factions. Make the best decisions in two crucial phases: strategic building and adrenaline-fueled battles. You will have to trace your own path to victory from a large variety of possible items, features and actions. You should also travel to hunt giant space worms, investigate helpful beacons and scavenge wreckages for new assets. There is no end to the game, the stronger you become, the stronger your enemies will be. The war lasts forever - defend your station at all costs! Features: - Over 100 unique spaceships - Progressively unlock them, from small frigates to capital vessels - Fully modular ships - Change the internal layout to use different weapons, add more armor and much more… - Massive fleet battles – Fly right into the action to defend your station against dozens of alien invaders - Exploration - Scavenge wreckages and abandoned cargo for blueprints and scraps, encounter giant space worms - Investigation - Travel to beacons to help cargo ships under attack or destroy an enemy space station - Unlimited upgrades - Ships can be expanded and repainted for looks, and modules features can be upgraded - Never-ending gameplay – Fight forever, the stronger your base is, the stronger are the invaders", "platform": "Nintendo Switch", "release_date": "December 13, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Drageus Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155833-event-horizon-space-defense\n"}