{"altername_name": ["Fall Guys: Ultimate Knockout"], "name": "Fall Guys", "overview": "Fall Guys (formerly Fall Guys: Ultimate Knockout) is a platform battle royale game developed by Mediatonic. It was released by Devolver Digital for Microsoft Windows and PlayStation 4 on 4 August 2020. Following their acquisition of Mediatonic, the publishing rights were transferred to Epic Games, who are set to release the game for Nintendo Switch, PlayStation 5, Xbox One and Xbox Series X/S on 21 June 2022. On the same date Fall Guys will switch to a free-to-play model with full cross-platform play support. A massively multiplayer party game with up to 60 players online in a free-for-all struggle through round after round of escalating chaos until one Fall Guy remains! Up to 60 players compete in matches with battle royale-style gameplay. Players, represented as jellybean-like figures, move around a three-dimensional playing field, with additional moves such as jumping, grabbing/climbing, or diving to assist gameplay. The aim is to qualify for subsequent rounds by successfully completing each of the randomly selected mini-games. Certain mini-games involve running towards a finish line at the end of the map, playing tag with other players, while others add elements of teamwork. On every mini-game, obstacles appear around the map for added complexity. Players who are too slow, who fall into pink slime, or who fail certain requirements for a mini-game, are eliminated. On the final round, the remaining few players compete in a final match with a randomised mini-game designed for a smaller player size. The winner of the match is the last player standing. https://youtu.be/2CT7eZ1ydPs https://fallguysultimateknockout.fandom.com/wiki/Fall_Guys:_Ultimate_Knockout_Wiki", "platform": "Nintendo Switch", "release_date": "June 21, 2022", "game_type": "Released", "esrb": "E - Everyone", "developers": "Mediatonic", "publishers": "Devolver Digital", "genres": "Beat 'em Up", "max_players": "60", "cooperative": "Yes", "rating": "3.25", "wikipedia": "https://en.wikipedia.org/wiki/Fall_Guys", "video_link": "https://youtu.be/YqPqmP93PPE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162728-fall-guys\n"}