{"altername_name": [], "name": "Fantasy General II: Invasion", "overview": "Fantasy General II: Invasion is the reimagination of the strategy game classic from the 90s! Armies once again draw battle-lines on the war-torn land of Keldonia, and a new generation of commanders will test their bravery and tactics against each other. Fantasy wargaming is back! True to the tradition of the original game, Fantasy General II is all about turn-based battles. Lead over 75 different unique unit types, including powerful heroes. Take into consideration terrain, weapons and armour, magical effects, morale, and the balance of forces, make a plan, execute it, and vanquish your enemy, forging your reputation as a savage war-leader. The battles Battle after battle, you will need to make decisions and develop your army. The young clan members will need to be trained, and as they gain enough experience, even the greenest recruits can be turned into champions. But beware: costly victories can be worse than a defeat… when battle-hardened units perish, so does their progression and experience. Each unit comes with their specific abilities, arms and armour, and they can be equipped with magic artefacts you find during battle and upgraded with gold and resources that you need to plunder from your enemy. The clans A confederation of autonomous hill-land tribes, who value their independence and will fight fiercely for it. Field axemen, berserkers, spearmaidens, trolls and shamans, summon ancestor spirits and mighty elementals or train nimble stag riders and deadly werebears or recruit mercenaries from longbowmen to centaurs. The Empire The most powerful realm on the face of Aer. Face the mighty Legions of the Empire and their magical creations from dragon cannons to golems as well as the Undead hordes they bring to battle, or fight harpies, lizard people and great dragons on your way. The World The world of Aer is filled with beauty and wonders. From the cold, magic-rich highlands of Fareach, home to the player’s Barbarian Clans, to the Borderlands with their fertile river valleys and deep woods where witches and monsters still roam free; from the Sunken Land, submerged through a great Cataclysm and filled with treacherous swamp and Lizardfolk, to the refined and temperate Empire to the South, home to wondrous cities and built upon undead labour. Your campaign will see you fight across very different battlefields, requiring variable tactics and army composition.", "platform": "Nintendo Switch", "release_date": "October 21, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Owned by Gravity", "publishers": "Slitherine Software", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155849-fantasy-general-ii-invasion\n"}