{"altername_name": [], "name": "Farming Simulator 23: Nintendo Switch Edition", "overview": "Grow crops, grow your agricultural empire! Become a modern farmer to operate more than 100 authentic machines by Case IH, CLAAS, DEUTZ-FAHR, Fendt, John Deere, KRONE, Massey Ferguson, New Holland, Valtra & many other acclaimed manufacturers from around the world - offering a wide range of farming activities. Choose what kind of farmer you want to be! There’s a lot more to do after plowing, removing weeds, harvesting crops, or collecting eggs from chicken coops: Produce valuable goods made from your harvest to expand your flourishing business with new factories and production chains! Don’t worry - there is always time to relax and walk around your vast arable land while visuals change through the atmospheric seasons. New and improved in-game tutorials show you the ways of the farm if you’re new to country life. Start farming and let the good times grow! Features: • Operate realistic tractors, harvesters, field sprayers, and more • Cultivate fields with a variety of crops, or harvest grapes and olives on the hillside • Start logging with heavy forestry equipment • Establish production chains and use powerful trucks for transport • Tend to farm animals like cows, sheep, and now: chickens! • Enjoy tons of possibilities on two new maps, including collectibles • New gameplay features also introduce plowing and weeding • A tutorial mode, AI helper & a new autoload feature for logs/pallets assist you on your farm", "platform": "Nintendo Switch", "release_date": "May 23, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "Giants Software", "publishers": "Giants Software", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=hv1bezKv6Gc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371087-farming-simulator-23-nintendo-switch-edition\n"}