{"altername_name": ["零〜月蝕の仮面〜", "Project Zero 4 ~Tsukihami no Kamen~"], "name": "FATAL FRAME: Mask of the Lunar Eclipse", "overview": "Unforgettable Horror “FATAL FRAME: Mask of the Lunar Eclipse” was released in Japan in 2008 as the fourth game in the FATAL FRAME series. Following the remastering of “FATAL FRAME: Maiden of Black Water,” the series masterpiece is being brought back to life with upgraded graphics. ■ About the Game A group of children mysteriously disappeared during a festival on Rogetsu Isle. Although they were found, they had lost their memories. Now they have returned to the island as teenagers. The girls rely on the Camera Obscura, a camera with the power to capture and seal away unthinkable horrors, and the faint beam of their flashlight while exploring various locations and fending off the ghosts that attack them as they attempt to discover the truth of their haunting past. ■ Features -Improved Graphics In-game movies and character models have been improved to make the story and characters more appealing. In addition, the graphics have been improved for each platform. The rendering of shadows and the beam of the flashlight has been refined so players can experience more realistic horror. -New Snap Mode Pose characters and ghosts freely to create haunting memories in the new snap mode. Perhaps you may even take unexpected spirit photos by accident... -New Costumes The original costume lineup has been altered slightly, and new costumes have been added. Change the characters' costumes to experience the investigation in different ways.", "platform": "Nintendo Switch", "release_date": "March 9, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "KOEI TECMO AMERICA", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Fatal_Frame:_Mask_of_the_Lunar_Eclipse", "video_link": "https://www.youtube.com/watch?v=ic9bAVlgBaI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/169797-fatal-frame-mask-of-the-lunar-eclipse\n"}