{"altername_name": [], "name": "Fate/EXTELLA: The Umbral Star", "overview": "Experience lightning-fast battlefield action across an epic story! In the digital realm of SE.RA.PH, the Holy Grail War is over, but the land's new ruler faces challenges and threats from all sides. The servants now find themselves drawing up tense and unlikely alliances, preparing for a conflict that may tear SE.RA.PH apart...or destroy it entirely. Key Features: A Variety of Fate Universes Collide The famous Fate EXTRA series strikes a path to a new stage with Fate/EXTELLA: The Umbral Star. Not just Fate/EXTRA Servants, but characters from Fate/stay night, Fate/Apocrypha, Fate/Grand Order, Fate Zero and other Fate series will make appearances. You can enjoy the game in Japanese audio with English subtitles. Chinese, Korean, and Japanese text is also available. A Brand-New Story from the Series' Author, Kinoko Nasu As the original creator of Fate/stay night and the scenario writer of Fate/EXTRA, Kinoko Nasu has created a completely new scenario for Fate/EXTELLA. The universe and characters of Fate will evolve. A Large Story Told from Different Perspectives In Fate/EXTELLA, the story will be told from the independent perspectives of three heroine Servants. Various side stories are also included, creating a structure that will shed light on the main story. A New Way to Battle As a unique action game in the Fate series, the player will be able to control a Servant and perform various moves. On top of that, a powerful \"Form Change\" ability has been added to transform your Servant. Engage in intense battles, on the ground or in mid-air, to annihilate the enemy forces.", "platform": "Nintendo Switch", "release_date": "July 25, 2017", "game_type": "Released", "esrb": "T - Teen", "developers": "Marvelous", "publishers": "Marvelous", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/Fate/Extella:_The_Umbral_Star", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107467-fateextella-the-umbral-star\n"}