{"altername_name": [], "name": "Final Fantasy VII & Final Fantasy VIII Remastered: Twin Pack", "overview": "Final Fantasy VII Final Fantasy VII, the timeless classic loved by a legion of fans, is now available with a number of helpful extra features! Experience an epic adventure beyond imagination, culminating in the final battle to decide the fate of the planet. The world has fallen under the dominion of the Shinra Electric Power Company, a sinister corporation that has monopolized the planet’s very life force as Mako energy. In the urban megalopolis of Midgar, an anti-Shinra rebel group calling themselves Avalanche have stepped up their campaign of resistance. Cloud Strife, a former member of Shinra’s elite SOLDIER unit now turned mercenary, lends his aid to the rebels, unaware that he will be drawn into an epic battle for the fate of the planet while having to come to terms with his own lost past. The following extra features are included: - 3x speed mode - Ability to turn battle encounters off - Battle enhancement mode Final Fantasy VIII Remastered It is a time of war. The Republic of Galbadia, under the influence of the sorceress Edea, mobilizes its great armies against the other nations of the world. Squall and other members of SeeD, an elite mercenary force, join hands with Rinoa, a resistance fighter, to fight against Galbadia’s tyrannical rule and to prevent Edea from fulfilling her ultimate goal. This product is a remaster of Final Fantasy VIII, featuring multiple enhancements including additional options to customize your gameplay experience and difficulty, such as: - Battle assist options (HP, ATB gauge, and Limit Break boosts) - Game speed boost (x3) - No random encounters Final Fantasy VII & Final Fantasy VIII Remastered Twin Pack (Multi-Language) comes in a single cartridge with no download required.", "platform": "Nintendo Switch", "release_date": "November 25, 2019", "game_type": "Released", "esrb": "", "developers": "Square Enix", "publishers": "Square Enix", "genres": "", "max_players": "", "cooperative": "No", "rating": "3.6", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153363-final-fantasy-vii-final-fantasy-viii-remastered-twin-pack\n"}