{"altername_name": [], "name": "Final Fantasy IX", "overview": "Selling over five million copies since its release in 2000, FINAL FANTASY IX proudly returns on Nintendo Switch! Experience the adventure once again with characters and pre-rendered movies featured in high definition, as well as a new booster system with a selection of various modes such as \"high speed\" or \"no encounters\"! ■Story Zidane and the Tantalus Theater Troupe have kidnapped Princess Garnet, the heir of Alexandria. To their surprise, however, the princess herself yearned to escape the castle. Through a series of unusual circumstances, she and her personal guard, Steiner, fall in with Zidane and set out on an incredible journey. Meeting unforgettable characters like Vivi and Quina along the way, they learn about themselves, the secrets of the Crystal, and a malevolent force that threatens to destroy their world. ■Gameplay Features ・Abilities Learn new abilities by equipping items. When fully mastered, these abilities can be used even without equipping items, allowing for nearly endless customization options. ・Trance Fill your Trance gauge as you sustain hits in battle. When fully charged, your characters will enter Trance mode, granting them powerful new skills! ・Synthesis Never let items go to waste. Combine two items or pieces of equipment together and make better, stronger items! ・Minigames Whether it's Chocobo Hot and Cold, Jump Rope, or Tetra Master, there are plenty of minigames to enjoy when you're not off saving the world. You can even earn special item rewards! ■Additional Features ・7 game boosters including high speed and no encounter modes ・Autosave ・High-definition movies and character models", "platform": "Nintendo Switch", "release_date": "February 13, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "GUILD STUDIO Inc.", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Final_Fantasy_IX", "video_link": "https://www.youtube.com/watch?v=V9GMKshn0Ck", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116491-final-fantasy-ix\n"}