{"altername_name": ["Fire Emblem: Fuuka Setsugetsu"], "name": "Fire Emblem: Three Houses", "overview": "War is coming to the continent of Fódlan. Here, order is maintained by the Church of Seiros, which hosts the prestigious Officer’s Academy within its headquarters. You are invited to teach one of its three mighty houses, each comprised of students brimming with personality and represented by a royal from one of three territories. As their professor, you must lead your students in their academic lives and in turn-based, tactical RPG battles wrought with strategic, new twists to overcome. Which house, and which path, will you choose? The game features the refined gameplay the Fire Emblem franchise is known for. Command a party of warriors to move and fight on a grid-based battlefield and, for the first time in the series history, assign battalions of troops to support individual units in battle. As a professor, you are responsible for teaching your students and improving their skills in their academic lives and in battle. These may be school assignments, but the stakes are very real. Your students’ lives depend on your leadership. It’s up to you to guide each of them, so that they may wield a variety of weapons, master the study of magic, and acquire special skills such as horsemanship. But there’s more to being a professor than commanding armies. Freely roam Garreg Mach Monastery and the academy within it, while interacting with talented students to build relationships and gather intel. After meeting one enigmatic girl named Sothis… you’ll come to realize that she appears only within your mind. What other mysteries await? - The Officer’s Academy is home to three houses: The Black Eagles, The Blue Lions, and The Golden Deer… Which house will you choose? - As a professor, lead students in their academic lives and on the battlefield - A turn-based, tactical RPG that puts new twists on strategic battling - For the first time in series history, battalions of troops follow individual units to support them in battle - Freely roam Garreg Mach Monastery, interact with students in a variety of ways—over lunch, even—to bond and gather intel - As a female or male professor, you’ll meet House Leaders and future rulers Edelgard, Dimitri, and Claude", "platform": "Nintendo Switch", "release_date": "July 26, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Intelligent Systems", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.35", "wikipedia": "https://en.wikipedia.org/wiki/Fire_Emblem:_Three_Houses", "video_link": "https://www.youtube.com/watch?v=rkux5h0PeXo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117709-fire-emblem-three-houses\n"}