{"altername_name": ["Fit Boxing: Hokuto no Ken – Omae wa Mou Yaseteiru"], "name": "Fitness Boxing: Fist of the North Star", "overview": "Improve your daily exercise habits, get into shape, and draw back the curtain on a new, legendary body! While retaining the basic features of Fitness Boxing, this new installment adds characters and settings from the world of Fist of the North Star for truly effective workouts! ■Fist of the North Star Characters Are Your Instructors The Fitness Boxing series is a boxing exercise game that utilizes the Joy-Con™ to let you throw different punches in the same way as in a rhythm game, while receiving directions from in-game instructors voiced by popular voice actors. In Fitness Boxing Fist of the North Star, Kenshiro, the protagonist of Fist of the North Star, and his rivals guide the player as instructors. ■New \"Battle\" Mode A new \"Battle\" mode has been added that lets you defeat enemies in the same way as in a rhythm game. The game contains two modes that let you experience workouts with a greater emphasis on action: Outlaw Battle, in which you take down scores of outlaws with your punches, and Boss Battle, in which you fight Kenshiro's rivals such as Raoh. ■Music and Costumes that Further Boost the Fist of the North Star Experience Background music is absolutely essential for exercise. The game features not only Fist of the North Star classics like AIO TORIMODOSE!!, TOUGH BOY, YURIA EIENNI, and SILENT SURVIVOR, but also original songs tailored to each character for a total of 20 songs. Characters' outfits can be changed to fit your mood. Many original outfits are available, so check out all the new outfits never before seen in Fist of the North Star. ■Popular Fitness Boxing Features Left Unaltered With the purpose of helping to promote exercising at home and making exercise a daily habit, the game, naturally, continues the use of the series's popular support features such as the alarm and the ability to exclude actions that you struggle with.", "platform": "Nintendo Switch", "release_date": "March 2, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Imagineer", "publishers": "Imagineer", "genres": "Life Simulation", "max_players": "2", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "https://youtu.be/8VUja7LaJww", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/183202-fitness-boxing-fist-of-the-north-star\n"}