{"altername_name": [], "name": "Flippin Kaktus", "overview": "When the vicious Calaveras drug cartel raids his home, Kaktus breaks bad in a hardcore vendetta journey to save his foster family. The combat-focused action is filled with enemies, explosions, and an abundance of pop culture-fostered elements. GO ON A RAMPAGE You can choose the way you want to fight your enemies – the end justifies the extreme measures you'll need to take. Use Kaktus's rage mode to make sure the thugs get what they deserve. Fuel up with tequila and other adrenaline-pumping substances to annihilate the cartel into oblivion. OR DO THINGS QUIETLY. If you don't want to find yourself directly fighting the bandits without a plan, you can use the many options available – dodge bullets, equip different armor, use the interactive environment, and set traps to get rid of enemies in a more subtle way. Would you prefer to do things quietly and sabotage their actions in a sneaky way? Then this is the perfect option for you. ADDICTIVE GAMEPLAY. In each of the game's levels, you'll find a variety of options that will allow you to take down the bad guys, whether you do it Rambo-style or more tactically. Combine environmental effects and insane kills, or sneak up and kill them one by one. The goal is simple – dominate them all. NOSTALGIA IS KEY: Immerse yourself in 11 unique, beautifully hand-crafted levels inspired by Latin American aesthetics, classic retro games, and critically-acclaimed VHS action flicks. RETRO! Enjoy a uniquely composed soundtrack that fuses authentic mariachi, rock, and synthwave, explore artist-inspired graphic novels to engage more deeply with the story, and solve every puzzle as you connect all the dots in this thrilling desperado odyssey.", "platform": "Nintendo Switch", "release_date": "May 12, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "No Gravity Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163185-flippin-kaktus\n"}