{"altername_name": ["飛翔鮫! 鮫! 鮫! -TOAPLAN ARCADE GARAGE-"], "name": "Flying Shark! Shark! Shark!: Toaplan Arcade Garage", "overview": "The beast of the ocean, drive in the sky! Flying Shark! Shark! Shark! -Toaplan Arcade Garage- (飛翔鮫！鮫！鮫！ -TOAPLAN ARCADE GARAGE-) has been remade! The 9th \"M2 Shot Triggers\" is a reproduction of the shark series from the arcade vertical shooter \"Toaplan\". \"Flying Shark\" (1987) was well received for its simple rules and exquisite difficulty, and had a great influence on the subsequent vertical scrolling shooting games. And the sequel, \"Shark!\", which features flashy shooting that covers the screen. Plus, \"Shark! Shark!\" (1989) is included! [For both experienced shooters and beginners] In addition to the \"arcade mode\" that is a complete reproduction of the arcade version, both titles are equipped with a \"SUPER EASY\" mode that has been adjusted so that even beginners can enjoy it! Even those who have never touched the original can play casually! [A lot of support functions] The \"M2 gadget\" displayed on the left and right of the game screen alerts the enemy that appears from the player's blind spot, and captures information such as the location of hidden items and the item information that will appear next. With new discoveries to those who have played the original! [Aim for the hero of the game center] The popular \"Arcade Challenge\" mode in the \"M2 Shot Triggers\" series is also installed this time! Each stage is divided into small areas and you practice with the rewind function! Practice hard and aim for an arcade no-continue clear! You are a very difficult shark! shark! shark! Can you clear it?!! ★ Purchase privilege ★ As a bonus for \"TOAP LAN ARCADE GARAGE\" series fans, the Toaplan puzzle game \"Teki Paki\" is also included!", "platform": "Nintendo Switch", "release_date": "April 28, 2022", "game_type": "Released", "esrb": "", "developers": "ToaPlan", "publishers": "M2 Co., Ltd.", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Flying_Shark", "video_link": "https://www.youtube.com/watch?v=b0KOEjYZXZk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161493-flying-shark-shark-shark-toaplan-arcade-garage\n"}