{"altername_name": [], "name": "Flynn: Son of Crimson", "overview": "The Peace of Rosantica is Threatened Once Again The peaceful and beautiful island of Rosantica is under threat once more by a relentless evil. The magical barrier between Rosantica and The Scourge has started to crack, allowing dangerous creatures to slowly seep back in to try and take over the island. Flynn stumbles upon this invasion and discovers he must stand up against The Scourge to stop its spread into Rosantica. Accompanied by his mythical companion Dex, Guardian Spirit of the Land, Flynn will be challenged by the evil from The Scourge and its powerful overlord. Classic 2D Action Platformer Flynn: Son of Crimson is a handcrafted 2D action platformer that will take you on a journey of discovery and conflict as you learn to master the art of Crimson Energy. Help Flynn and Dex save Rosantica before the evil from The Scourge claims his home. Flynn and Dex Summon your mythical companion and protector Dex in times of need and fight alongside her as you work to save Rosantica. Dex will excel in crushing tough walls and slashing/biting her way through hordes of enemies. She’s the best doggo a boy like Flynn could hope for! The bond between Flynn and Dex is one of friendship, mutual protection and love for one another. With the imminent threat coming from The Scourge, Flynn and Dex charge snout-first into battle. Explore Rosantica and The Scourge World Explore Rosantica and its unique regions, each filled with ancient mysteries to be discovered. Collect relics along your journey and uncover new paths as you fight your way to victory. The Scourge is a dark world, filled with hate, trying to infest and destroy the beauty of Rosantica. You will need to enter this sinister world to take on Zealock, Lord of this dimension, and his mysterious dagger wielding warrior, Rozia. Embrace the Power of Crimson Energy Flynn discovers he has powers he never knew about from a lineage that is a mystery. Discover the power of Crimson Energy and help Flynn to master this new part of him. The Crimson Sword, a staple in Flynn’s arsenal, is the first weapon of Crimson energy gifted to Flynn by the Goddess Sorrell during a great time of need. Unlock piercing dashes and uppercuts to destroy those nasty foes. The Crimson Axe demands precise timing and enemy prediction, trading the quick cuts of the crimson sword for a weighty windup. Use the axe to crush your enemy’s shields, and smash brittle walls to access new areas with brute force. The Crimson Claws are a swift and energetic set of weapons used to stagger enemies with high attack speed and air superiority. Unleash your inner wildcat with unique wall jumping and spiral drill attacks to tear into enemies at a rapid pace. Become a True Master of the Elements Elemental Magic in the form of fire, ice, and lightning will be unlocked through a natural mutation with the flora of Rosantica.", "platform": "Nintendo Switch", "release_date": "September 15, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Studio Thunderhorse", "publishers": "Humble Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=yI4RrxB5S6k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154740-flynn-son-of-crimson\n"}