{"altername_name": ["FM23 Touch"], "name": "Football Manager 2023 Touch", "overview": "Football Manager 2023 Touch empowers you to take charge of the world’s biggest football clubs by zoning in on the essential areas of football management. You'll start by creating your managerial avatar and style, and then it's time to showcase your skills on the tactics board. Plug and play with some of football’s most popular playing styles, such as Gegenpress and Tiki-Taka. Work with your backroom team to level up your player recruitment. With a dream squad full of global superstars and wonderkids, it won’t be long until you’re racking up trophy wins at home and abroad. On Matchdays, you’ll dictate the tempo. Accelerate your progress with the ‘Instant Result’ option or savour the action with a range of camera angles from the digital dugout. FM23 Touch features a host of new additions, including: ENHANCED MATCHDAY CONTROL Feel closer to the action than ever before with a revamped match experience. Time the big tactical calls to perfection with a streamlined user interface that immerses you in the on-pitch drama. GET YOUR MESSAGE ACROSS Make your voice heard with brand-new Team Talks. Use a wide range of reactions to capture every emotion and become a difference-maker in any situation. CHRONICLE YOUR CAREER Your headline-making moments are now more memorable than ever. The Dynamic Manager Timeline is a visualisation of your career achievements that grows as you strive for the top of the game. BIG EUROPEAN NIGHTS Test your skills against Europe’s best in the UEFA club competitions, including the UEFA Champions League, the UEFA Europa League and UEFA Europa Conference League, fully licensed this year. With remodelled Cup Draws and authentic Matchday branding, those big European nights are at your fingertips. Many more features are ready for you to discover throughout the game.", "platform": "Nintendo Switch", "release_date": "November 14, 2022", "game_type": "Released", "esrb": "", "developers": "Sports Interactive Limited", "publishers": "Sega", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167739-football-manager-2023-touch\n"}