{"altername_name": [], "name": "Forever Forest", "overview": "In a world conquered by darkness, in a forest that never ends, the fate of the Wyld rests on the shoulders of a brave hero with orange fur and a magical mask. Together you will set forth on an epic journey to carry the last ray of light from the deepest south to the darkest north. You need to survive in a hostile environment, compete for food and avoid predators as you explore dense underwood, stony deserts, treacherous swamps and ancient ruins in a magnificent forest brimming with dangers, wonders and surprises. As you overcome all obstacles, you will evolve from defeating more and more enemies to become the true king of the Wyld. Forever Forest is a unique blend of exploration, survival and adventure games that will challenge everything you thought you knew about mobile games: * A procedurally generated 3D world with a clear progression to the north and an unlimited extension to the east and west provides hours of playtime. * A variety of different creatures that interact organically with each other and with their environment and require different tactics to defeat them in combat. * Berries and mushrooms of different shapes and colors provide nourishment and temporarily enhance abilities. Of course, the player can also devour other creatures. * New abilities can be acquired by collecting the masks of defeated enemies and trading them in at mythical shrines to prepare for the challenges that lay ahead. * Different habitats with their own vegetation, population and weather blend into each other to create eight distinct zones that shape the forest. * Dynamic lighting creates an additional challenge and requires players to move carefully in dark zones until they find the next temple of light and cast away the darkness.", "platform": "Nintendo Switch", "release_date": "January 14, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Mad About Pandas UG", "publishers": "Fictive Studio", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156884-forever-forest\n"}