{"altername_name": [], "name": "Forgive Me Father", "overview": "Draw your boomstick and obliterate Lovecraftian abominations in this unique FPS! Watch your madness level which dynamically changes and gives you additional power. Choose your skills depending on your play style and use them to fight against the eternal evil. Explore a Lovecraft-inspired world that is full of secret areas, and uncover its story to solve the mystery of this crazy place. Feeling of a classic FPS from the 90s. Timelapse animations, opponents and elements of 2D in a 3D environment; first aid kits, non-reloading weapons, powerups and dynamic combat with numerous enemies. Unique combat experience. With scripture or a camera in one hand, and weapons powered by an unknown substance in the other, face the challenge of maintaining your humanity. It is up to you to decide how your equipment evolves, and to find ways of defeating hordes of unpredictable opponents. Dynamic Madness system. Directly influencing both the audio-visual experience and gameplay, its effect varies depending on the state of your mind. A comic book artstyle. Hand-drawn graphics designed to maintain a distinctive look; any screenshot from the game could be a part of a new comic book! Lovecraftian atmosphere. Feel the dread and horror the works of H.P. Lovecraft are renowned for. Surrounded by the occult and forces of eternal evil, experience hopelessness, madness, confusion, and the burning need to find answers and bring back some semblance of reason and sanity to the world. Varied level design and bestiary. A diverse, entirely hand-made world, full of enemies ranging from possessed civilians to eldritch monsters straight out of your worst nightmares. Two playable heroes. Experience the story as either a priest or a journalist, each with their own, unique development tree.", "platform": "Nintendo Switch", "release_date": "September 28, 2023", "game_type": "Released", "esrb": "M - Mature", "developers": "Byte Barrel", "publishers": "Fulqrum Publishing", "genres": "Horror", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=zbRop5fhiac", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372550-forgive-me-father\n"}