{"altername_name": ["Friday the 13th: The Game"], "name": "Friday the 13th: The Game: Ultimate Slasher Edition", "overview": "Jason is back! For the first time ever, you will have the opportunity to play as Jason Voorhees, the most infamous killer in horror. Stalk your prey, ambush them and strike fear in the hearts of so many hapless victims as you become the legend himself! Friday the 13th: The Game includes a variety of kills, new and familiar, that will help you set the tone for the Jason that you want to be. Jason is equipped with a terrifying array of abilities, giving you the control of a hunter at the height of his game. These are his woods and he knows them all too well. Jason will not only feed off the fear of his victims but will become stronger as the night progresses. The darker the night, the more terrifying he becomes! Play as Jason from your favorite movies, including: • Friday the 13th, Part II • Friday the 13th, Part III • Friday the 13th, Part VI: Jason Lives • Friday the 13th, Part VII: New Blood • Friday the 13th, Part VIII: Jason Takes Manhattan • Jason Goes to Hell: The Final Friday How Will You Survive? The entire focus of Friday the 13th: The Game is multiplayer. Survival is entirely up to you, the player, as you either stealthily hide from Jason or work together as a team to fight or escape. Playing as a counselor is all about risk and reward, giving players multiple means of triumph over Jason! Want to hide in the woods as you wait for the police? Perhaps you want to band together and try to take on Jason as a group? Maybe you and a friend decide to fix the boat on the lake and escape, while leaving everyone else to their fate? There are endless opportunities to survive the night but every choice has a consequence. No single strategy will ever be reliable, forcing players to adapt and change each time they begin their long night in Camp Blood! Be wary, you never know when or where Jason is going to strike! Play as the Counselors! Each counselor trope will have their strengths and weaknesses, affording players the chance to excel in certain situations. Find the counselor that best suits your play style or come up with various strategies to win against Jason! Players will have the chance to continually update and improve their characters through unlocks, customization and improvement! The more you play, the more you adapt and become a better all-around counselor!", "platform": "Nintendo Switch", "release_date": "August 13, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "Black Tower Studios", "publishers": "Gun Media", "genres": "Horror", "max_players": "8", "cooperative": "Yes", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/Friday_the_13th:_The_Game", "video_link": "https://www.youtube.com/watch?v=c7kHvmim6i0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134547-friday-the-13th-the-game-ultimate-slasher-edition\n"}