{"altername_name": [], "name": "From Space", "overview": "That's no bubblegum army, that's an endless horde of menacingly pink aliens taking over our planet! Enough sweet talk, grab your gear, we need you and your squad to defeat the pink pests! YOUR MISSION: Liberate Earth from the Alien horde! MISSION TOP #1: Squad Up! While you can play From Space solo (if you're brave enough) you'd be wise to invite some friends to help you out. With online play you can create a four-person squad. Look, there's a lot of those pink pests out there so the more people, the better. Oh, and with a squad, you'll have some witnessess to tell everyone how awesome you are. It's basically a win-win scenario. MISSION TIP #2: Shoot, Explode & Stab With a variety of weapons (Rocket Launchers, Miniguns, Flamethrowers and more!) there’s no excuse not to annihilate those aliens! Build your ideal spec and use tactical items such as grenades and mines, or slow down the hordes with barbed wire and machinegun turrets. Remember to scavenge the world for loot, you'll need it! MISSION TIP #3: You’re special, so pick your specialist skill! No matter what type of player you are, there’s a wide range of characters in From Space's roster, each with their own unique ability and weapons. Find the perfect balance with your friends as you build the ultimate super squad. MISSION TIP #4: Don’t just stand there, Level-up! As you level-up, you’ll be able to attach special perks to your character, helping you to master the art of destroying aliens. You'll need to find ways to combat increasingly more powerful aliens, and perks will help you accomplish all of your pink alien squashing dreams. Need to rethink your strategy? No problem! We like innovators! Perks can be swapped around, even between your squad! MISSION TIP 5#: The apocalypse has never been so much fun... so have fun! We’re going to level with you... an alien threat is terrifying, terrifyingly fun! Look, the world is already pretty beat up as it is. Who's going to notice if you cause a little bit more destruction while saving the day? People have insurance it's fine...", "platform": "Nintendo Switch", "release_date": "November 3, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "Triangle Studios", "publishers": "Curve Digital Publishing", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168845-from-space\n"}