{"altername_name": [], "name": "Full Void", "overview": "Unchain humanity from a rogue AI using all your skills before it's too late. Set in a dystopian future, Full Void is a 2D Cinematic Puzzle Platformer telling the story of a young teenager alone in a hostile world controlled by a rogue AI. Fight your way through puzzles and obstacles to uncover the story that surrounds this broken, run down society, where only children are still free. But for how long? A pure hand-drawn pixel art adventure that will keep you on your toes from the very beginning, with a few jump scares and a thrilling atmosphere but still suitable for all ages as it does not feature any gore or violence. Full Void is a spiritual successor to classic cinematic puzzle platformers of the 80s and 90s, with a modern twist, innovative visual and gameplay mechanics. Along with traditional puzzles, you can use your hacking skills to interact with elements of the game and make your way through this hostile world full of creatures continuously on the verge to get you. In a 2D world, aspects of 3D have been integrated both in the gameplay and visuals. The game features hand-drawn pixel art graphics and custom animations that are integral part of the gameplay, along with dynamic lighting, minimalistic sound design and immersive cutscenes for an atmosphere that will keep you on your toes from the very beginning. Full Void tells a story of oppression and isolation through the environment and gameplay with the support of compelling ambient sounds and old-school Amiga MOD music. Visually, each screen has been composed and drawn with care and passion, designed to inspire awe and a sense of uncertainty. With no side scrolling in the game, moving from one screen to another can sometimes require a leap of faith. Full Void is a game for the whole family. A compelling interactive story that will challenge your mind and touch your heart. Features - Environmental Storytelling;- Original, hand-drawn pixel art; - Interactive cut-scenes all hand drawn and animated - Ability to hack machinery to solve puzzles; - Immersive and intense atmosphere; - Minimalistic sound design - Compelling, Amiga MOD sounds; - Dynamic lighting - Not too \"retro-style\" check points :)", "platform": "Nintendo Switch", "release_date": "September 12, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "OutOfTheBit", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372249-full-void\n"}