{"altername_name": [], "name": "Fury Unleashed", "overview": "A combo-driven roguelite platformer where you shoot your way through the pages of an ever-changing comic book and get more powerful the more dead-on your play is! MAIN FEATURES • Ever-changing comic book – Explore the pages of a living comic book where ink is your most valuable resource and each room is a comic panel. Find out why John Kowalsky, creator of acclaimed Fury Unleashed series, is having a creativity crisis and see if you can help him deal with it. • Gameplay-impacting combo system – Kill enemies quickly enough to unleash your fury and rip through everything in your way without getting injured. Learn to play flawlessly and beat the entire game in one epic combo! • Game customization options – Choose either the challenging Hard mode (which will put your skills to the test) or Easy mode (where you can adjust the difficulty parameters any way you want). Beat Hard mode to unlock access to even harder Incredible and Legendary modes. Disable blood and gore if you don't like it, or if there are young children around. Go solo or bring in a friend for a local co-op session. Choose your hero's skills to match your playstyle and modify their appearance to your liking! • Roguelite with soft permadeath – Discover worlds created by a mix of hand-designed levels and procedural generation algorithms. Choose the best items to assist you in your playthrough and unlock permanent upgrades when you die for your subsequent runs. • Inspiring environments – Play through the pages of visually distinctive comic books and dive into the creator's sketchbook. Master each enemy's behavior patterns and overcome a total of 40 bosses.", "platform": "Nintendo Switch", "release_date": "May 8, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Awesome Games Studio", "publishers": "Awesome Games", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155854-fury-unleashed\n"}