{"altername_name": ["Grim Guardians: Demon Purge"], "name": "Gal Guardians: Demon Purge", "overview": "When a demon's castle darkens the land, two sisters challenge its halls. Together they can break the curse. In order to save their school after it turns into a massive demonic castle, two \"Demon Hunter\" sisters slash and shoot their way through this 2D action adventure. Players can swap between control of both characters on the fly, each with entirely different skillsets. Proceed through the castle while confronting the demonic bosses that await deep within. Each boss yields new weapons to wield, allowing for more varied exploration and opening up new routes. ■Swap out on the fly as you traverse through the demonic castle! Take control of both the tag-team Kamizono siblings. Make the most of long-distance focused Shinobu and close-range brawler Maya Kamizono as you make your way through the castle. Each sibling has a range of unique sub-weapons, giving you a wealth of options to switch your strategy up whenever the time calls for it. Don’t hesitate to make use of them so long as you have Weapon Points in stock! In the event that one of the siblings falls in battle, they can be resuscitated freely with \"Sister Rescue\"—provided you can make it back to where they fell. ■Defeat bosses to obtain new sub-weapons, opening up a whole new layer of exploration! Defeating bosses will yield new sub-weapons, providing the siblings with exciting new abilities. These sub-weapons also open up new routes and means of exploration in the castles. ■Enjoy the story your way with \"Pure\" or \"Refined\" voice tracks! Gal Guardians' story focuses on two main aspects: the mystery behind the school's transformation, and the whereabouts of the other students. Enjoy the original experience in \"Pure\" mode with all of the original Japanese voices for story mode, or choose “Refined” for English voice acting focused on the action, tailored for fans of the genre. ■Adjust the difficulty to your playing needs with the unique Style system! A total of 3 different styles—\"Casual\", \"Veteran\" and \"Legend\"—are available for selection, allowing players to adjust the difficulty to their needs. This can be changed at any time after beginning the game with no drawbacks. What's more, co-op with both Shinobu and Maya will be possible should two controllers be available. It's possible to jump-in at any time during the game, so don't hesitate to invite friends along on your journey to conquer this mysterious demonic castle.", "platform": "Nintendo Switch", "release_date": "February 6, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Inti Creates", "publishers": "Inti Creates", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.8", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=2ozM1s5PRiM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368121-gal-guardians-demon-purge\n"}