{"altername_name": ["Garden Story"], "name": "Garden Story", "overview": "Unify a broken community as the newly-appointed Guardian of The Grove. Traverse a vibrant island to combat invasive Rot, inspire its inhabitants, and rebuild your home. You won't have to do this alone: fruity friends await, ready to lend a hand! Concord, the youngest grape in The Grove, is now a Guardian, and it’s their job to help restore the island. That’s a lot to shoulder for a grape barely off the vine… and more than a few inhabitants are skeptical they have what it takes. Fortunately, Concord has friends like Elderberry, Rana, and Fuji on their side! With their help, you can take on the dangerous Rot and find ways to encourage other residents to assist in the efforts. The Grove is your home, and your work will affect change for the better! Protect your friends, gather precious materials, and repair social ties and structures by bringing the fruits, fungi, and frogs of each village together as they work to fend off the Rot that threatens to destroy your home for good. Guide Concord’s restoration efforts and earn the trust of the community: help others with their problems, and they’ll offer you help in turn! There’s plenty of work to be done, but don’t forget to take time and appreciate this lush world and the fruits of your labor. Listen to the sweet and catchy music of the island, relax in The Grove’s cozy and inviting atmosphere, cultivate gardens and libraries, and enjoy the delightful personalities you’ll meet along the way.", "platform": "Nintendo Switch", "release_date": "August 11, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Picogram", "publishers": "Rose City Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://youtu.be/uh2_SdmW8SQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158093-garden-story\n"}