{"altername_name": ["Gear Club Unlimited 2"], "name": "Gear.Club Unlimited 2", "overview": "The most successful racing game of Eden Games studio is back on Nintendo Switch With the pedal to the metal, race along more than 1800 miles of races! On the mountainside, through a nature park, in the middle of the desert or along the coast, defend your position over the course of more than 250 races, including championships, missions and challenges. As you progress through the races, admire the growing collection of cars in your personal garage. Gear.Club Unlimited 2 has more than 50 licensed cars from the world’s most famous manufacturers, such as the Porsche 718 Boxster, 918 Spyder, 911 GT2RS, Dodge Viper, Lotus 3-Eleven or McLaren 720s. Personalize them and make them unique! You can change their appearance with the paint and bodywork, or change their driving performance with engine tuning. You would be nothing, however, without your Club! Create and manage it with your friends, recruit the best drivers and take on rival clubs from all over the world, reach the top of the podium and enjoy exclusive content reserved for the best players. No more borders. Drive with freedom! Features: • A huge playing area that includes more than 250 races, located in four rich and diverse environments. • Players begin with 51 famous racing cars made by some of the finest manufacturers in the world, including Porsche, Lotus, McLaren, Koenigsegg and Bugatti. • In the story mode, save the family team from bankruptcy by taking on charismatic riders of all nationalities. • Players can create and manage their Club and recruit the best drivers that cross their path. They are free to challenge rival clubs from around the world to see their crew’s name appear at the top of the leaderboard. • Players can manage and personalize their garage, as well as their racing cars, which can be visually customized and performance-tuned! • Play alone or with friends: the game features a local multiplayer mode with a four-way split screen.", "platform": "Nintendo Switch", "release_date": "December 4, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Eden Games", "publishers": "Microïds", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "3.79", "wikipedia": "https://en.wikipedia.org/wiki/Gear.Club_Unlimited", "video_link": "https://www.youtube.com/watch?v=XokbRhzqF3w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/109979-gearclub-unlimited-2\n"}