{"altername_name": [], "name": "Gefragt Gejagt: Das Spiel", "overview": "Hunter or hunt - who will ultimately go out of the studio as the winner? You have it in your hand! Experience the show up close. Finally, as a candidate, you can compete against one of the hunters or take the role of the hunter yourself and show the candidate that you have what it takes to be a real hunter. Play with up to three friends and decide completely free how you want to split up. As in the real show, you want to compete against the hunter and show Sebastian Klussmann, Sebastian Jacoby or Klaus Otto Nagorsnik? No problem! You want to prove to your friends that you are the real hunter? Then take its place and play against them. For this we have prepared a special hunter and a special hunter that you can take over to really sweat the candidates. It chases begin! The show is moderated, as in the original by Alexander Bommes. The original voices from the hunters Klussmann, Jacoby and Nagorsnik are also there and give the game real show feeling. - Everything is possible: games as a candidate or hunter - General knowledge: Over 4,500 questions from 25 categories: There is really something for everyone here. - Pure adrenaline: Evidence of what you really know under time pressure. Here you feel like in the real show! - All together: games with up to three friends. Anyone who takes on what role is up to you. - \"Mr. Klussmann, you have an interesting shirt again today\": The small stitching between moderator and hunter are of course also included - Original votes: Both Alexander Bommes and Sebastian Klussmann, Sebastian Jacoby and Klaus Otto Nagorsnik speak their characters personally", "platform": "Nintendo Switch", "release_date": "October 29, 2021", "game_type": "Released", "esrb": "Not Rated", "developers": "bitComposer Entertainment AG", "publishers": "BANDAI NAMCO Entertainment Europe", "genres": "Quiz", "max_players": "4", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=x4bTSY631yo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161344-gefragt-gejagt-das-spiel\n"}