{"altername_name": [], "name": "Ghostbusters: Spirits Unleashed: Ecto Edition", "overview": "Ghostbusters: Spirits Unleashed Ecto Edition will include the game and all four of the DLC Drops from 2023. This is a fun, multiplayer game perfect for all skill levels. Four proton pack wielding Ghostbusters attempt to catch a Ghost haunting unique locations in asymmetrical multiplayer battles (online or offline). As players progress, they will unlock cosmetics and upgrades for both Ghostbusters and Ghosts to evolve their gameplay experiences. The look and feel will deliver to fans an immersive experience in the universe, allowing them to play out their Ghostbusting fantasies. Whether hunting or haunting, the game is easy to learn and fun to master! This is an asymmetrical game of hide and seek. In true form to IllFonic’s past titles, this title is a 4v1 setup where players will either play as part of a team of new Ghostbusters or a singular Ghost. This game will allow players to enjoy the game solo or with up to four friends. It will have an online and offline single-player mode available in the form of bot assisted play. Ghostbusters: Spirits Unleashed Ecto Edition has all the iconic gear and gadgets, from Proton Packs to PKE Meters and Ghost Traps, that fans would expect and new gamers to the universe will enjoy when playing as a Ghostbuster. Ghosts have multiple abilities in their arsenal, like possessing objects, of course sliming, and more, that make haunting all the various locations a blast to play. In addition, many will recognize the Firehouse and Ray’s Occult Books that act as the game’s hub. This is where players will choose missions, customize their characters, practice firing their proton packs, and explore all there is to learn. And yes, you will hear the original film actors reprising their roles as Ray Stantz and Winston Zeddemore, along with some new friends!", "platform": "Nintendo Switch", "release_date": "October 19, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Illfonic", "genres": "Action", "max_players": "5", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373588-ghostbusters-spirits-unleashed-ecto-edition\n"}