{"altername_name": [], "name": "Gimmick! Special Edition", "overview": "Save the day as a platform-bouncing, star-shooting cutie pie in this long-lost NES™ gem! An old-school challenge enhanced for the modern player SUNSOFT's NES™ classic Gimmick! returns in this long-wished-for Special Edition from City Connection. Experience a stunning physics-based platformer with updated features like online leaderboards, achievements, a time attack mode, save and quick load, a rewind function, a gorgeous gallery (with cartridges, art, and scanned manuals), and more. Stellar platform physics with a bouncing star Explore a physics-based playground that was way ahead of its time. As the cute youkai Yumetaro, use your star-summoning powers to tackle complex challenges with creativity and finesse. Your wonderful star will help you reach hidden spots, traverse cliffs, and pull off trick shots that outwit even the toughest baddies! Discover a hidden NES™ treasure Gimmick! was exclusively released on Famicom™/NES™ in Japan and Scandinavia in the early ‘90s. It pushed the console to its limits and the Japanese cartridge featured SunSoft 5B, a custom sound chip that let Masashi Kageyama compose a star-studded soundtrack. Gimmick! remains one of the most valuable (and rarest) NES™ cartridges ever made. The Scandinavian version was called “Mr. Gimmick”. Uncover secrets in a race against time! Gimmick! Special Edition features a time attack mode for speedrunners, and completionists can hunt for secrets all throughout the game. Unlock a wonderful surprise by finding everything. For a hard-core challenge, disable all quality-of-life features in \"Serious Mode\" to crank up the excitement!", "platform": "Nintendo Switch", "release_date": "July 6, 2023", "game_type": "Released", "esrb": "EC - Early Childhood", "developers": "City Connection", "publishers": "Bitwave Games", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=BAIderjHiW8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370670-gimmick-special-edition\n"}