{"altername_name": ["グノーシア"], "name": "Gnosia", "overview": "The Gnosia lie - pretending to be human, they’ll get in close, trick and deceive, and then eliminate one victim at a time... The crew of a drifting spaceship, facing off against a mysterious and deadly threat known as the “Gnosia” and having no idea who among them is really the enemy, formulate a desperate plan for survival. The most suspicious among them will be put into “cold sleep” one by one, in an effort to rid the ship of Gnosia. Gnosia is a Sci-Fi Social Deduction RPG in which you will engage in discussion with a variety of unique characters, with the aim of identifying the Gnosia among the group. Players will have to use what information they can gather during the discussions to ascertain whom they think is Gnosia and then vote to put them into cold sleep. As you progress, your abilities will improve - but so will those of the crew. As the numbers of crew members, Gnosia, and various “roles” increase, it will become increasingly difficult to determine who is telling the truth. Work in collaboration with or against other crew members to ensure your survival until the end. Features: ・Repeatedly play through “loops”, triggering special events to unravel mysteries in a uniquely original narrative. Certain events will unlock new commands for you to use during discussions. ・Step into a variety of roles to develop different character builds. Your stats will determine how effectively you can sway the group’s opinion or lie, and will also affect your likelihood of being selected for cold sleep. ・Engage with an engrossing and eclectic cast of characters and experience randomly triggered events, each one unique to its subject. Character events will reveal information about your crewmates in the form of special “Notes”.", "platform": "Nintendo Switch", "release_date": "April 30, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Petit Depotto", "publishers": "Playism", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Gnosia", "video_link": "https://www.youtube.com/watch?v=3HcOMGI6IyQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372447-gnosia\n"}