{"altername_name": [], "name": "Go Vacation", "overview": "There are all sorts of exciting ways to explore the island, from horseback to buggies, snow mobiles to inline skates. And to add to the fun, up to 4 players* can enjoy visiting and discovering every corner of the island together! If you're playing multiplayer, each player can use just one Joy-Con controller. Experience hours of fun and something new every day. Customize your character, costumes, vehicles and even pets! Daily presents and challenges mean that you will want to keep coming back to the island of Kawawii to explore more terrain and play through activities all over again. Mii or in-game characters of friends and family may show up, and if they do, you can compete against them anytime. Or customize your very own villa by earning over 450 pieces of furniture. Kawawii Island is a paradise resort with 50+ co-op and competitive activities Explore four huge paradise resorts: Marine, City, Snow, and Mountain on horseback, underwater, or a variety of other vehicles Enjoy leisure activities like scuba diving, horseback riding, and sea fishing Try out extreme sports like skydiving, surfing, and skateboarding Compete to be the best at a variety of other fun activities like skiing, beach volleyball, and tennis Up to 4 players* on one system or local wireless**, with variety of control styles, including motion control Share a Joy-Con controller with a friend for instant multiplayer fun The Joy-Con Wheel accessory is optional for steering vehicles (sold separately) Customize your character with outfits and choose a dog companion from various breeds Daily presents include new breeds of dogs or costumes Daily challenges appear in sets of three across the island New on Nintendo Switch Marine & Mountain fishing with 30+ species of fish 40+ types of animals to photograph and store in your in-game photo collection Find boxes filled with rewards dropped by a plane", "platform": "Nintendo Switch", "release_date": "July 27, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Bandai Namco Studios", "publishers": "Nintendo", "genres": "Sports", "max_players": "4", "cooperative": "Yes", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Go_Vacation", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/104400-go-vacation\n"}