{"altername_name": [], "name": "Graze Counter GM", "overview": "A refreshing and highly re-playable bullet hell style shooter that WANTS you to play dangerously! \"Graze\" past enemy bullets to charge your \"Graze Counter\", then unleash it upon your enemies as a highly deadly attack! Ride the razor's edge of life and death in this high-risk high-reward danger oriented arcade-style shooting game. [Gameplay] A top-down scrolling 2D shooting game where you charge your gauge by getting dangerously close to enemy fire, then unleash it as a powerful enemy obliterating \"Graze Counter\"! Each ship has a \"Counter Gauge\" that charges by being in close proximity to enemy bullets. You then use this charge to unleash powerful attacks. Destroying enemies with these special attacks gives you stars which are collected and used to build the \"Break Gauge\".Once the break gauge reaches MAX, you can activate \"Break Mode\" for a temporary yet intense firepower boost! Test the limits of your destructive power with these highly deadly counter techniques! [Features] - 7 total stages consisting of 5 stages + 2 alternate stages. Including a continuous \"All Stages\" mode. - 4 difficulty levels. - 4 unique story modes featuring fun interactions between the game's variety of characters. - 2 default ship types + 14 unlockable types totaling 16 to choose from! Including popular STG-loving Vtubers Hatsuki Hachimiya and Tomoko Machinery as playable guest ships! - Boss rush mode featuring all bosses, and a bonus extreme difficulty stage. - 30 part mission mode that teaches you the tips and tricks of the game as you play. - Archive Mode where you can view illustrations and game world lore that unlocks as you progress through the game. - Features a remastered version of the original game's highly rated soundtrack including a brand new song! - Includes the bizarre bonus mini game \"Laser Maidens 2\".", "platform": "Nintendo Switch", "release_date": "January 19, 2023", "game_type": "", "esrb": "E - Everyone", "developers": "", "publishers": "Sanuk", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.67", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168799-graze-counter-gm\n"}