{"altername_name": [], "name": "Greak: Memories of Azur", "overview": "Take control of three-siblings on an epic adventure to save the Courine's from the Urlag invasion in this hand-drawn 2D adventure. Greak: Memories of Azur is a side scrolling single-player game with hand-drawn animations. You will take the role of three siblings: Greak, Adara and Raydel to guide them through the lands of Azur. Alternate control between them and use their unique abilities to escape from the Urlag invasion. Greak is the name of the main character, and the smallest brother of three. He belongs to a magical race called the Courines, which are currently under the attack of an enemy invasion from a faction called the Urlags. This battle has been going on for a long time, and the Courines are starting to flee their own lands. Greak's goal is to reunite with his brother (Raydel) and his sister (Adara) and then escape the lands of Azur by Building an Airship piece by piece. Throughout the game, you will find each sibling in different scenarios, and once you do, they will join the adventure and help you progress through the game. • Hand-Drawn Art and Animation: Enjoy a captivating story line about family, home and union in difficult times while you discover colorful and expressive scenarios. • Specially Crafted Puzzles: Solve specially crafted puzzles to find and collect the missing pieces of an Airship through an Interconnected and World. • Unique Gameplay: Alternate between the three characters and use their different abilities to explore the Magical lands of Azur. • Fast- Paced Combat: Discover new areas and fight against a wide variety of enemies to rescue the Courines from the Urlag invasion. • Live Orchestra Soundtrack: Enjoy the expressive and atmospheric music themes specially created to experience a unique adventure.", "platform": "Nintendo Switch", "release_date": "August 17, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Navegante Entertainment", "publishers": "Team17 Software", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155867-greak-memories-of-azur\n"}