{"altername_name": [], "name": "Growtopia", "overview": "BE AWARE! This is a game about collecting and protecting items while playing and chatting with actual human beings from all around the world. Your items CAN and WILL be stolen if you don't keep them safe. That is part of the gameplay and stolen items will not be restored. All of the items necessary to prevent theft are available in the game. USE THEM WISELY! Note: There is a Personal Controls area in the Options menu - it allows you to disable the In App Purchase and Tapjoy Offer Wall options as well as block chat with other players. Growtopia is a creative sandbox platformer MMO where you can: * BUILD anything you can imagine – houses, dungeons, songs, artwork, puzzles - even a subterranean base on mars! * COLLABORATE with new and old friends from around the world (over 20 million player accounts in the same universe - no shards!) * PLAY mini-games - parkour, surgery, quizzes, fishing, firefighting, fight crime, PVP battles, races, CTF, live music jams, ghost hunting, build steam machines and more * PROTECT items using an innovative lock system which allows you to give access to friends * PLANT seeds to grow trees * SPLICE seeds to discover thousands of amazing items, with new items added constantly * TRADE items in our secure trading system * EXPLORE a universe of over 500 million user-created worlds, all persistent and connected to each other * COMMUNICATE using a full chat, friends list, and messaging system * EARN a single in-game currency entirely through gameplay * See classic pixel graphics, optimized for small and large screens * Original soundtrack by Cory Mollenhour ** Note: This is a freemium game that has optional In-App Purchases! ** Didn't get your gems or having a problem? Email us at support@growtopiagame.com, we'd love to help!", "platform": "Nintendo Switch", "release_date": "March 28, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Hamumu Software", "publishers": "Ubisoft", "genres": "Life Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165421-growtopia\n"}