{"altername_name": [], "name": "Hard West", "overview": "Welcome to the Wild West as you've never seen before. Follow Warren on his descent into the darkest recesses of the human soul, and try to survive in a world full of hard choices and even harder consequences. Because in this world, death is a constant presence and the black pacts which you make with forces beyond human comprehension will forever haunt all those around you. Journey deeper into the world of Hard West and meet a colorful cast of playable characters whose fates are intimately intertwined with yours. Together you will need to make divisive choices to uncover the ultimate plans of the ancient powers at play, as you unravel a deep narrative storyline featuring multiple endings depending on the choices you make during the game. FEATURES - A Unique “Weird” West World: Explore a world where Western legends meet demons, arcane rituals, and satanic cults and where the dead can walk the Earth again. For a price. - Compelling Combat: Control 1-4 squad members in turn-based combat encounters and master a range of powerful western-inspired special abilities - Choice and Fate: Experience a deep story where decisions made during and between combat scenarios will resonate through future events and change the ultimate fates of a divisive group of colorful characters - Luck of the Draw: Use a combat system that goes far beyond pure probability by featuring luck as a unique guardian of engaging and challenging combat - Dynamic Cover: Change the flow of combat thanks to an extensive cover system which allows for the creation of effective cover from objects in the environment - Shadow Spotting: Locate out of sight enemies by the shadows that they cast, along with the sounds they make - Ricochets: Utilize Metal objects to shoot beyond the line of sight for increased tactical combat options, and diversified planning - 40 Historically Inspired Weapons", "platform": "Nintendo Switch", "release_date": "March 7, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "CreativeForge Games S.A.", "publishers": "Forever Entertainment", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118496-hard-west\n"}