{"altername_name": [], "name": "Has-Been Heroes", "overview": "Has-Been Heroes is a roguelike action game featuring a band of heroes on a quest to escort the King's twin princesses to magic Academy. The game combines strategy and action into a mix where you control three characters and focus on combining spells and items for devastating combo effects! Has-Been Heroes features a young rogue, a wishful wannabe hero, who stumbles across a pair of old, battle-worn heroes. They receive the ultimate quest from the King - escort his precious twin princesses to Princess Academy, on the far side of the world. Eager for heroics, the young rogue joins the band of heroes and the trio put their best foot forward. As the heroes travel across the world, they come across a wide variety of enemies - ranging from bad-breath skeletons and zombies to evil spirits, the meanest of all enemies (100% evil!). Each enemy type (and enemy subclass) has specific attributes and immunities - evil spirits cannot be hit by melee attacks, for example, so the player needs to make them hittable by using spells of a certain type. New characters are unlocked during the course of the game. The new heroes are each unique with custom attributes and a set of different starting items/spells that give the player an edge in combat - or a vulnerability. - Each run is unique with random encounters, spell and item drops, as well as regions. - The game features 200 items and 100 spells to unlock. Only a fraction of these are available in the first run, and obtaining new items and spells is a game changer for the player. - Death in Has-Been Heroes is a common occurrence and permanent, and the player has to start over. However, death comes bearing gifts, literally! - Over 100 hours of gameplay - Has-Been Heroes has a story that keeps on growing as the player plays and completes the game. - New story layers are added with each playthrough. - 2D art style with visually stunning spell effects.", "platform": "Nintendo Switch", "release_date": "March 28, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "Frozenbyte", "publishers": "GameTrust Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.12", "wikipedia": "https://en.wikipedia.org/wiki/Has-Been_Heroes", "video_link": "https://www.youtube.com/watch?v=yYA0PiCoRng", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79453-has-been-heroes\n"}