{"altername_name": ["Hyakki Castle"], "name": "Haunted Dungeons: Hyakki Castle", "overview": "SUMMARY A full-scale real-time dungeon RPG exploring a mysterious castle set in the 18th century, during the Edo Period of Japan. Now with a 2 Party System where you can divide into parties and move separately, a feature not seen up until now in real-time dungeon RPGs. New strategies and ways of solving puzzles by dividing the party and attacking enemies, a new evolution of real-time dungeon RPGs! STORY Hyakki Castle is set in the Edo Period of Japan, and the castle is on an island of exile where criminals are sent. Doman Kigata, a prodigy sorcerer who schemed to overthrow the Shogunate and place a death curse on a leader, has been captured and sent to the island. One day decapitated heads were sent to Edo Castle. It was the barely recognizable form of Hyakki Castle guards and criminals. \"My offering to you, contents: 3 heads - The Lord of Hyakki Castle\" News of a mystical castle appearing on Hyakki Island had already reached the Shogunate's search team. Iemune, the current Shogun of the time, believed this to be the doing of Doman Kigata. The investigation of Hyakki Castle and the assassination of Doman Kigata were appointed to 4 secret agents (the player)... FEATURES \"The 2 Party System\" is a new system in which the parties can be divided. • It is possible to divide the parties of 4 into 2 parties (2:2 people or 1:3 people) at any given time. (* Only when party is together.) • Divide your team into 2 parties and take out strong enemy monsters with a pincer attack, or lure enemies with 1 party while getting items with the other. New strategies that have never been seen before in real-time dungeon RPGs! A new trick for solving mysteries with the 2 Party System! • Divide into 2 parties to work your way through various traps. Use one team to open a door with a switch, while another party passes through the door to get an item, and then go back to maneuvering with the first party... • The player's instinct and judgment will be tested far more than real-time dungeon RPGs of the past by solving mysteries with 2 parties! View of the World ~ A true Fantastical World of Japan created by a Japanese studio ~ A slew of creepy monsters, such as the \"Yokai\" of ancient Japanese literature, have been brought back to life, ready and waiting for the player at \"Hyakki Castle\"! When making characters the player can choose from traditional Japanese classes, such as Samurai or Ninja, and can choose from different races, such as Oni or Tengu. The player can choose from different traditional Japanese classes such as Samurai, Ninja, Monk, etc. Different races, such as Oni, Tengu, and Nekomata, can also be chosen, each having their own special ability. The player can set skills they've acquired, such as attacks and spells! Each character can equip up to 4 \"actions\" at the same time, such as attacks, defenses, projectiles, and spells. Death over dishonor... \"Seppuku\", a skill where you take your own life! All of the player's characters commit Seppuku, in which they all take their own lives. Seppuku is an act of the Japanese Way of the Samurai, in which one takes their own life to protect their honor. Choose an honorable death by Seppuku over the dishonor of being killed! (Dead characters will be revived at a save point inside the castle.)", "platform": "Nintendo Switch", "release_date": "August 30, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Asakusa Studios", "publishers": "Happinet", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156913-haunted-dungeons-hyakki-castle\n"}