{"altername_name": [], "name": "Haven", "overview": "Two lovers gave up everything and escaped to a lost planet to be together. An RPG adventure about love, rebellion, and freedom. Yu and Kay have escaped to a forgotten planet, leaving everything they knew behind. Play the two lovers as they settle into an unknown world. Glide over the fragmented planet looking for parts and material to fix your ship and make it a cosy home. Enjoy moments of everyday life as a relatable couple while cooking meals, crafting and collecting precious resources to make it to the next day. Fight against those trying to tear you apart by synchronizing actions in combat, finding the perfect timing and rhythm, while controlling both characters and battling to keep them and their relationship alive. Key features: • Play two characters at the same time while exploring a fragmented planet, fending off enemies or building your relationship • Make the choice about what's worth sacrificing to stay together, and if you're willing to give up everything else for love • Glide over the grass, gather flow and clean the rust as you explore this dreamy planet and uncover secret areas • Meet the planet’s creatures, who are both friends and foes Fight as the two characters in real time and relying on tactical sense and timing • Immerse yourself in a romantic space adventure, the saga of two lovers trying to stay together against all odds • Play a relatable couple in an intimate relationship, treated with maturity and humor Immediate to play, accessible, a pause in a busy day, a game that will make you smile • A solo game that you can also play with a friend or romantic partner: a second player can join or drop out anytime in local co-op to share the adventure • The original soundtrack by renowned electro musician DANGER heightens the game’s emotional experience.", "platform": "Nintendo Switch", "release_date": "February 4, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "The Game Bakers", "publishers": "The Game Bakers", "genres": "Adventure", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155872-haven\n"}