{"altername_name": ["Heaven Dust II", "Heaven Dust"], "name": "Heaven Dust Collection", "overview": "Heaven Dust Collection combines two fan-favorite survival horror games: Heaven Dust and its sequel, Heaven Dust 2 - a love letter to classic 90s survival horror games and all retro loving gamers. Heaven Dust: When you awake, you find yourself in a mansion, where was the secret research center, is now a maze full of horrible zombies and deadly traps. You'll have to escape by overcoming your fears, collecting items, solving innovative puzzles and revealing the cruel truth. In 1970, a scientific investigation team found a new virus in the blood samples from a primitive tribe called \"Torkue\" in New Guinea. Some scientists think it will help to reveal the secret of immortality and they called it \"Heaven Dust\". It turns out that it's not really a gift from Heaven, it opens the gate to hell instead. After the research center in New Guinea was destroyed in an accident related to the mutant virus, they brought \"Heaven Dust\" to the USA, then the researches were carried out entirely by their subsidiary company StarDust. A disaster is just unfolding... Features: • Thrilling and immersive exploration-horror experience • Challenging story-integrated puzzles • Retro-inspired graphics and gameplay • A hopeless story with different endings. Maybe you'll get the good one? Heaven Dust II: \"Are you ready to escape from hell again, Steve?\" After a press conference, a virus outbreak happens in the mysterious First Research Center. In the meantime, deep inside the institute, Steve wakes up from his cryogenic pod. He finds himself trapped in a living hell, surrounded by zombies, again. He must fight his way out even when the dreadful truth is also approaching... Features: • Enhanced production value: Better graphics and effects, providing a brand new experience for players of the first game. • Twice the content of the first game, prepare to embark on a 10-hour journey! Collect and combine, use various items to solve puzzles. Upgrade your inventory. Weapons no longer occupy space. • Evolved combat system: Fight your way out with a dagger, submachine gun, shotgun, and grenades. Modify your weapons, upgrade them to the limit. Choose your weapon to counter different enemies, plan your strategy, seek their weak points and destroy their defenses. • Except ordinary zombies, all kinds of mutated monsters had joined the battle too: Heavily armored Bone Fiend, regenerating Blood Fiend, approaching boomlad. And, of course, epic boss fights. • Engaging plot, fun brain teasers. Players need to make an ultimate choice: Two escape routes will lead you to two different endings. • Casual, Normal, and Expert difficulties for you to choose, suited to all players.", "platform": "Nintendo Switch", "release_date": "February 22, 2023", "game_type": "Released", "esrb": "Not Rated", "developers": "One Gruel Studio", "publishers": "Super Rare Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=e34fnJrCd-w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371017-heaven-dust-collection\n"}