{"altername_name": [], "name": "Hellpoint", "overview": "Hellpoint is a dark and challenging action RPG set in a heavily atmospheric sci-fi universe where the line between science and occult is blurred. Once a glorious pinnacle of human achievement, the Irid Novo station is now devastated, completely overrun by evil interdimensional entities and dominated by the will of malevolent Cosmic Gods. You are a creation of the cryptic Author, crafted and sent to investigate Irid Novo in an attempt to figure out the unholy series of events that led to the strange incident known as The Merge. • Space station Irid Novo is a massive interconnected structure full of hidden shortcuts, numerous secrets, secrets within those secrets — and you get to explore it all. There are various paths you can take throughout your journey, and more dread and shivers as you deepen into the station’s darkest corners. • Dozens of melee and ranged weapons and armor pieces to suit your playstyle. Every weapon has its unique special ability to unlock once you master it. • A fascinating world in the aftermath of a massive quantum cataclysm, with story and lore deeply rooted in classic and modern sci-fi films. Goosebumps-inducing soundtrack! • The space station orbits in real time around the ominous black hole, triggering various dynamic events such as modified enemy stats and positions, boss appearances and horde assaults. • If you are struggling, get someone to join you in a couch co-op session, or call for assistance online. The loot is shared, and the experience of local player two is saved and not watered down.", "platform": "Nintendo Switch", "release_date": "February 25, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Cradle Games", "publishers": "tinyBuild Games", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155873-hellpoint\n"}