{"altername_name": [], "name": "Homebody", "overview": "A survival horror puzzle game with haunting memories of the past... Homebody is a nostalgic survival horror game where you catch up with old friends and try not to get murdered. Emily and her college buddies have gathered at a remote rental house to watch the Perseid meteor shower. They try to rekindle the bonds they once had, but lingering emotional wounds and social anxieties leave Emily feeling more alone than ever. When the power suddenly goes out, it’s almost a relief. But under the cover of darkness, a mysterious killer picks them off one by one. If Emily can’t find a way out, she’ll be trapped in this nightmare forever. Evade the killer, solve the house’s devious puzzles, and reconnect with your friends. Escaping the house may seem impossible at first, but with each attempt to put the pieces together, the bloodstained picture becomes more and more clear. A Nostalgic Trip: Inspired by retro horror games and classic 80s slasher films, Homebody sets the scene for a thrilling evening. This retro-but-modern game pulls players through a deeply strange and emotional experience. An Unsettling Getaway: Emily and her friends gather for the annual viewing of the Perseid meteor shower. But with relationships strained and anxieties high, what should be a relaxing weekend quickly goes awry, turning even darker as a mysterious killer picks them off. Just One Night Together… or Is It? After a bloody night, Emily wakes back up in the foyer. Realizing something is horribly wrong, Emily must find an escape, no matter what it takes. Learn more about Emily’s relationships with choice-driven dialogue. Stealthily explore the house, moving quietly and hiding in closets to evade the killer’s responsive AI. Death may be inevitable, but knowledge never dies. Use an in-game journal to track the clues and puzzle solutions, piecing together this mysterious event. Devious Shifting Puzzles: With continually changing challenges in the house, puzzles will require strategic and creative thinking to solve. But be careful and work quickly, time continues to tick on and the unpredictable killer stalks the house looking for Emily and her friends.", "platform": "Nintendo Switch", "release_date": "June 1, 2023", "game_type": "Released", "esrb": "M - Mature", "developers": "Game Grumps", "publishers": "Rogue Games Inc", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=lM8RpT4FAmM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370205-homebody\n"}