{"altername_name": [], "name": "Horned Knight", "overview": "Horned Knight is a challenging 2D action-platformer where you must overcome all fears, enemies, and traps as the Hero Knight. Rewrite destiny, with your trusty sword, young Knight! Horned Knight reintroduces the Golden Age of arcade gaming in a hardcore, retro-styled 2D action platformer that pulls no punches. Play as the hero knight, and use your sword to rid the castle of ghouls and undead lurking in the dark. Filled with multiple levels, responsive controls, and puzzle-like combat, Horned Knight emboldens the player to conquer unique pixel art obstacles with the support of generous checkpoints and an invigorating soundtrack. In Horned Knight, calculated movement and agility is key. One small misstep can lead to your demise through 32 pulse pounding levels, offering various challenges from fireball wielding skeletons to venomous snakes, spike traps, pools of lava, and much more! Accessible and responsive controls make it easy to jump, air-dash, and slash your way through an area. Master the jumping wall climb technique and timed slashes to ensure your hero saves the greater realm! Make sure to hold onto the knight’s heart pieces; his life depends on it! Overcome gigantic bosses and uncover secrets leading to unknown paths to find more heart pieces, so you can continue on your marvellous adventure. If your heart pieces deplete, it’s back to the last checkpoint for you to prove your worth, knight! Horned Knight's features include: • 32 levels across 4 worlds • Tons of monsters and bosses to show your might • Tight controls: easy to play, hard to master • Beautifully pixel art animated graphics • Exciting action gameplay • Intense boss battles with challenging patterns and epic scale • 2 difficulty modes appropriate for all types of players―from story and setting lovers to hardcore action enthusiasts • An amazingly diverse castle to explore with different environments", "platform": "Nintendo Switch", "release_date": "February 26, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "2kSomnis", "publishers": "2Awesome Studio", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=tYLyDFvAVlY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370209-horned-knight\n"}