{"altername_name": [], "name": "Horse Tales: Emerald Valley Ranch", "overview": "Your vacation at your aunt’s turns out to be far from what you expected. Your once grand family property has fallen into ruins and you find yourself facing a huge challenge. How to return your ranch to its former glory? Get caught up in a beautiful horseback adventure! Explore the vast wild stretches surrounding you, meet the residents of the peninsula and forge friendships. Discover the secrets hidden on the island, Breed, tame and train horses – each with their own strengths and characteristics – and take part in thrilling races. Your aunt has really let the family estate fall into disrepair – what remains of the once glorious stud farm is now rubble and ruins, and you are the only one who can do anything about it. Fortunately, you are not alone in your endeavor: In the mayor’s son Gabriel, the local woodsman Mattéo and the architect and master craftswoman Noella, you quickly find invaluable allies to rebuild what once was and make it better than ever before. It is now up to you to restore your family’s name to its former glory – and perhaps even to gain the respect of the prestigious Félix family. Set off on a poetic horseback adventure and relish the feeling of total freedom in a vast open world. Gallop through various, enchanting landscapes, along the seashore, in the forest, near a coral lagoon, and more. Who knows, maybe you will discover a few secrets as you explore them. Along your rides, you will meet new friends, and complete many missions and quests to save your family’s legacy! Restore your ruined family ranch to its former glory by rebuilding and personalizing it with various buildings, stables, horse care facilities, supplies and decorations. During your epic story, you will come across many animals, including wild horses. Learn how to tame and mount them, each one being unique, with different abilities, personality traits, preferences and training needs. Develop your skills as a horse rider, take care of your horses, train them and breed them to add the finest steeds to your stud farm. By breeding strategically, you will be able to enhance their abilities and obtain unique coat colors for your mounts. • A horseback adventure in a captivating open world. • Breed the finest horses according to their stats, characteristics, and colors. • Personalize your ranch: build, improve and personalize your ruined ranch with a variety of buildings and decorations. • Gather resources, meet new friends, and complete quests to save your family’s legacy.", "platform": "Nintendo Switch", "release_date": "November 3, 2022", "game_type": "Released", "esrb": "", "developers": "Microids", "publishers": "Microids", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167980-horse-tales-emerald-valley-ranch\n"}