{"altername_name": [], "name": "Hot Wheels Unleashed 2: Turbocharged", "overview": "Buckle up for the most exciting races with the world's raddest cars! WE DID IT AGAIN! If you thought the first chapter was awesome, well, buckle up because we are going to blow you away with incredible new features! MORE WHEELS FOR YOUR FUN First things first: make room on your virtual shelf because you can access more than 130 vehicles, and even more varieties! Yes, not only Hot Wheels™ Originals, but also Hot Wheels™ Monster Trucks and vehicles from the entertainment world. Now you can also ride motorbikes and ATVs, each with their own unique racing style to take on every track in the most strategic way! A brand new system will define the vehicles’ category, which can be upgraded with the dedicated skill tree that will directly affect their performance. Watch your car become unstoppable! NEW PLACES TO CALL HOME Whether it's the backyard of a house in the suburbs or a mini-golf course in a village in the Wild West, your tracks will be surrounded by the most stunning environments! Discover 5 brand new locations, master their secrets, and you'll feel right at home both there and on the podium. New terrains are another fantastic new entry that will make your races even more exciting and challenging. Grass, sand and more will directly affect the handling of the vehicle: something to keep in mind when you’ll choose your ride. Strategy plays an even bigger role now! SHOW OFF YOUR MOVES Before impressing your opponents with a great victory, leave them speechless with new crazy moves! In addition to Drift and Boost, now you can show off your Lateral Dash and Single or Double Jump. Use them wisely and at the right time to bump into your rivals and kick them off the track… or simply to avoid those barriers! And with the new Jumps you can skip the traffic ahead and also find new secret shortcuts! JUST THE WAY YOU LIKE IT Are you a daredevil who turns every race into pure adrenaline? Or maybe you're the type who likes to test their limits? Did you say “fan of huge crashes”? Well, HOT WHEELS UNLEASHED™ 2 - Turbocharged brings to the table all of that and much more. Different game modes for whatever “fun” means to you, off and online. UNLEASH YOUR CREATIVITY! The most acclaimed editors are back! Create the track of your dreams with the powerful Track Editor, or use the best creations from the community! And of course, beautiful tracks call for awesome cars. The new and improved Livery Editor is what you need: with new tools like the Stickers Editor you can design and save patterns and shapes, to create your masterpiece. We are sure the best one will come from your imagination! IT’S A WHOLE NEW STORY Literally. The new campaign mode features a brand new and original story-driven adventure! The city is under attack and only you can save it from the creatures. How? Easy, winning exciting dedicated races and challenges! Ok, it won’t actually be that easy… but it will surely be exciting! So get ready to be not just a winner, but a real hero!", "platform": "Nintendo Switch", "release_date": "October 19, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "Milestone", "genres": "Racing", "max_players": "12", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373401-hot-wheels-unleashed-2-turbocharged\n"}