{"altername_name": [], "name": "Hyper Jam", "overview": "Hyper Jam is a fresh new arena brawler with a dynamic perk drafting system that makes each match different from the last. The hard-hitting fusion of lethal weapons, stackable perks, furious combat, and a killer synthwave soundtrack makes Hyper Jam a multiplayer experience that'll keep you coming back for more. FURIOUS COMBAT Hyper Jam features fast-paced multiplayer arena gameplay for 1 - 4 players. Annihilate your opponents round after round using katanas, rocket launchers, sledgehammers, and more. PERK DRAFTING After every round, players choose new perks that stay with them for the rest of the game, stacking and combining with their existing ones to create more powerful effects. A wide pool of distinctive perks ensures no two games are ever the same. PLAY YOUR WAY Gather your friends and play together using a combination of Pro Controllers, dual Joy-Con™ and even single Joy-Con! Battle it out in free-for-all or team up together, try out different game modes, and make your own rules with mutators! ONLINE AND LOCAL WIRELESS Take on your friends at home, or test your skills against others online or nearby using Local Wireless. Cross-platform matchmaking means even more challengers to face! AI BOTS Hone your skills against AI bots or team up with your friends. Customize bot difficulty, game rules and more to create your own challenge. '80s AESTHETIC Play as a strong selection of '80s-inspired characters on a variety of beautiful and dangerous arenas, ranging from a sun-drenched Miami hotel rooftop to a gritty Neo-Tokyo subway. KILLER SYNTHWAVE SOUNDTRACK An addictive soundtrack featuring Carpenter Brut, Dance With The Dead, Meteor and more will keep hearts racing as you blow each other to bits.", "platform": "Nintendo Switch", "release_date": "April 17, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "Bit Dragon", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://youtu.be/zoDqmk0B17Q", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163992-hyper-jam\n"}