{"altername_name": [], "name": "Hypercharge: Unboxed", "overview": "Cooperative First and Third-Person Shooter including Multiplayer (Split-screen/Online) with Wave based Tower Defense mechanics. Play as an Action Figure and fulfill the mission of Sgt. Max Ammo. Your task is to prevent the HYPER-CORE from being destroyed. If it’s destroyed, you can bid farewell to your human friends. They’ll forget about you. It’ll be like you never existed. Work together and win, for the future of toys everywhere! Game Features: * Co-op - Fight for Toy-kind, together. Squad up with 3 other players in Online / Local Co-op and save the HYPER-CORE from total annihilation. * PvP – Plastic vs Plastic. Go head-to-head against other small soldiers as you fight to become top of the scoreboard. * Single-player - Not every hero needs a team. Are you a lone wolf and prefer to play offline on your own? Don’t worry, clever Player Bots have you covered. * Split-screen - Old school. Buddy up on the sofa and blast the enemy as a team. (4-player Split-screen when connected to the dock). * Explore - The Sky is your limit. Well, the top shelf is. Unlimited freedom to scavenge each environment for credits, coins, batteries and if you’re skilled enough collectibles. * Fortify - Defend what you swore to protect. Build turrets, traps, walls and fight off evil hordes of weaponized toys. Watch out for the T. Rex. * Progression - Just because you’re small, doesn’t mean you can’t look the part. Earn XP, unlock unique skins and customize your action figure and weapon. * Strategies – The Art of Defense. Discuss tactics with your squad and plan out the best form of defense. Teamwork is crucial if you want to earn the highest tier rewards. * Difficulty – A choice for the whole family. With Casual, Regular and Expert, there’s always a mode to suit your level of skill. * No Pay-to-Win - Because, what’s the point? We value our players and promise to listen to your feedback. * Official Soundtrack - Over 20 incredible unique music tracks. Venture into the vibrant and colorful world of HYPERCHARGE: UNBOXED through the original in-game soundtrack.", "platform": "Nintendo Switch", "release_date": "January 31, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Digital Cybercherries", "publishers": "Digital Cybercherries", "genres": "Action", "max_players": "8", "cooperative": "Yes", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155878-hypercharge-unboxed\n"}