{"altername_name": [], "name": "Ion Fury", "overview": "Shelly “Bombshell” Harrison takes on a quest to slay evil transhumanist mastermind Dr. Jadus Heskel in the streets of Neo DC. She leaves a trail of carnage throughout huge, multi-path levels filled with gigantic explosions, more secret areas than we can count, and inhuman foes behind every corner. There’s no regenerating health here; stop taking cover and start running and gunning. Shelly’s crusade to take down Heskel’s army will see her leave destruction in her wake with a wide arsenal of weapons, complete with alternate fire modes and different ammo types. Ion Fury laughs at the idea of mandatory checkpoints and straight paths through shooting galleries. But, just because this is a true old-school first-person shooter doesn’t mean we've ignored all the good new stuff the last two decades have brought. Headshots? Hell yeah. More physics and interactivity? You betcha. 3DRealms, Voidpoint and 1C Entertainment have taken the best of both worlds and cooked it all into a bloody stew. Features: • The true successor to classic shooters such as Duke Nukem 3D, Shadow Warrior, and Blood. • Experience the original BUILD engine on steroids, pumped up and ready to rock again after 20 years! • Duck, jump, climb, swim, and blast your way through 7 exciting zones packed with multiple levels of mayhem! • A beautiful game world assembled from thousands of hand-crafted textures and sprites • An awe-inspiring arsenal of devastating weapons, including multiple ammo types and alternate fire modes. Tri-barreled revolvers, grenade launchers, and heat-seeking smart bombs are your best friends! • The classic '90s FPS action you love, meshed with modern inventions like locational damage and seamless level transitions • ZERO PROCEDURAL GENERATION. All levels are hand made and full of multiple paths, cool effects, and complex set pieces! • Thumping soundtrack comprised of true tracked module music, in authentic FastTracker 2 format", "platform": "Nintendo Switch", "release_date": "May 14, 2020", "game_type": "Released", "esrb": "M - Mature", "developers": "Voidpoint", "publishers": "1C Entertainment", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "3.88", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155883-ion-fury\n"}