{"altername_name": [], "name": "Iro Hero", "overview": "In a world where humans are used as power supplies, only one man has the will to change it all! Iro Hero is a vertical shoot ’em up with beautiful pixel art graphics inspired by many old-school classics. Staged across 9 action-packed levels, Iro Hero features a unique and fresh approach to the popular color polarity mechanic, with interactive level elements, color zones, reflective surfaces and much more. Encounter 10 different types of enemies with over a hundred different behaviors, and defeat 10 final bosses in the vein of classic arcade games. Unlock special skills throughout the game to help you land a final blow or escape from desperate situations. Story The year is 2306. A century after the Nyagu taught mankind how to obtain electricity from their inner energy, enterprises started to exploit humans in farms to produce energy. What had started as a gift became a curse, reducing people to nothing more than simple power supplies... Only when his mother dies in one of these farms, Iro realizes he has the power to change the order of things. Features: • Experience a color polarity system, with a twist to puzzles and smart decision making. • Discover an exciting story that takes place across 9 action-packed levels. • Encounter 10 different types of enemies with more than one hundred different behaviors. • Defeat 10 final bosses in the vein of classic arcades. • Unlock special skills, offering many creative and strategic options. • Acquire upgrades to increase the firepower and capabilities of your spaceship.", "platform": "Nintendo Switch", "release_date": "June 7, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Artax Games SL", "publishers": "eastasiasoft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=qCsSDurxGlU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/132073-iro-hero\n"}