{"altername_name": [], "name": "Itorah", "overview": "Guide Itorah through a fantastic world inhabited by strange masked beings. You are the only human left in a world full of masks. Mankind has vanished and Itorah seems to be the last of her kind! To uncover her past she will have to pick up her loud-mouthed axe and fight her way through lush forests, dangerous temples, stormy cliffs and more hand-painted biomes. Their innocent quest for knowledge quickly turns into a mission to save this strange new world from its biggest threat: A mysterious plague that threatens to consume everything. Features: Hand-Crafted Quality: Explore a beautifully realized world inspired by South and Central American landscapes, each lovingly hand-painted by the development team to breathe life into the world of Nahucan. Fluid controls: Enjoy a staggering amount animations that truly bring ITORAH and her amazing range of abilities to life in the hands of players. Good ol’ Fashioned Platforming: When she isn’t hacking and slashing her way across the landscape, ITORAH will need to keep her jumping and dodging skills as sharp as her ax as she conquers progressively more difficult puzzles and platforming challenges. Challenging bossfights: Face Nahucan's voracious fauna and imposing boss fights Unravel the Mystery: Is ITORAH the only human left, and if so, what happened to everyone else? Get to the bottom of the mystery with plenty of exciting twists and turns along the way as the brave young warrior battles her way through lush forests, ancient temples, and more on her quest to save Nahucan! Make Friends Along the Way: As the old saying goes, the “real treasure is the friends we made along the way”. Meet a bunch of odd, quirky characters who may or may not help Itorah on her quest. Captivating sound design: ITORAHs lovingly crafted, dynamic soundtrack invites to lose yourself in the beauty of Nahucan.", "platform": "Nintendo Switch", "release_date": "April 21, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Grimbart Tales", "publishers": "Assemble Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=4QXbo_CPt0o", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368278-itorah\n"}