{"altername_name": [], "name": "Jack Move", "overview": "Jack Move is a unique blend of gritty cyberpunk story telling, turn based battles and beautiful modern pixel art. Take on the role of Noa, a vigilante hacker determined to rescue her kidnapped father and take down the overreaching Monomind corporation. Story They whisper her name on the streets: Solares. A mysterious veteran of the Data Wars, Noa Solares keeps the fight against the Corporations alive as a vigilante hacker-for-hire, empowering the downtrodden and undermining those with power. When she receives an emergency message from her estranged father - the eccentric Dr. Abner Solares, whose wife's death spurred him to become the leading researcher of 'digital reanimation' - Noa is thrust into a world of murder, kidnapping, dark research, and the corporation that would steal it for their own ends: Monomind. What starts as fight to save your father will become a fight for the future of mankind itself... Cyberspace Battles Jack Move features beautifully animated, exciting and tactical turn based battles. Customise the software of your Cyber Deck to switch roles mid battle, balancing offence, defence and buffs. Choosing which software you load during battle is the key to victory! Hardware upgrades can help boost your stats, increase the amount of software you can install or give Noa extra abilities. Features • Gorgeous “Hi-Bit” pixel art inspired by retro RPG’s and enhanced with modern techniques. • Battle your foes in cyberspace. Take them down using a multitude of sweet hacking software. • Explore the dangerous world of Monocity-1 and take down Monomind, the evil mega corporation that controls it. • Play as Noa Solares, a sassy hacker out to save her father and the world. • Fight your way through a bunch of dungeons filled with allsorts of cyberpunk villany. Street punks, gangsters, corporate militia, secret service agents, and horrific cyber-experiments-gone-wrong will all be battling against you!", "platform": "Nintendo Switch", "release_date": "September 22, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "So Romantic", "publishers": "HypeTrain Digital", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Jack_Move", "video_link": "https://www.youtube.com/watch?v=0yOLVvhsJFw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/237583-jack-move\n"}