{"altername_name": [], "name": "Jet Kave Adventure", "overview": "Jet Kave Adventure brings everything you love about 2.5D platformers. Enjoy the skill-based action, challenging boss fights, clever secrets and thrilling set-pieces in a game where the Stone Age and science fiction collide. Meet Kave, the jet-powered caveman. A has-been chief banished by his own tribe, he stumbles upon… a jetpack! The device turns him into the only prehistoric man who stands a chance against “the alien invader” – a rather unlikable guy from the sky who’ll readily kick off a disastrous volcanic eruption just so he can repair his spaceship. So begins Kave’s quest to save the whole island and prove his worth to the tribe. Who needs double jumps when you’ve got a jetpack?! This piece of extraterrestrial tech is a real game changer – both for Kave and the player. Master jet-fueled platforming and fly over pitfalls, smash through walls, knock out enemies, and manipulate objects as you halt the alien threat once and for all. GAME FEATURES: ● Save the island and Kave’s honor in a playful “Stone fiction” adventure ● Jetpack through 36 colorful levels riddled with hazards and rich with secrets ● Use your trusty club and alien jetpack to smack and whack 30 types of enemies ● Show what you’re made of in breakneck flight sequences and boss fights ● Master jet-fueled platforming to find collectibles and upgrade your gear ● Enjoy a 2.5D adventure platformer tailor-made for Nintendo Switch™!", "platform": "Nintendo Switch", "release_date": "September 17, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "7Levels", "publishers": "7Levels", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=uEHs7hnNxB0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/119147-jet-kave-adventure\n"}