{"altername_name": [], "name": "Joe Dever's Lone Wolf", "overview": "Lone Wolf is back, as a video game with a brand-new story, a deep combat system, stunning graphics and much more! Make meaningful choices and carve your own path through this epic non-linear adventure. Test your strength in dynamic turn-based battles, prove your skill with the lock-picking minigame and accept the challenge of wits posed by the mysterious Shianti Cube! The author Joe Dever has played an active role in the development of the game. The story he has written fits with the original continuity, but it also sheds a new light on Lone Wolf’s world, Magnamund! For Sommerlund and the Kai! KEY FEATURES • A brand-new adventure written by Joe Dever, with a deep and dark redesign of Lone Wolf, his world and his enemies. • A seamless experience that includes all 4 acts of the story. Discover what happened at the frontier village of Rockstarn, explore the Sunken Forest and unveil the secrets of the Shianti Temple. Then, take the fight to the enemy storming the fortress of V’taag. Are you ready to write your own destiny? • A real medieval tome with hand-drawn illustrations. • Create your character and try out different combinations of Kai Disciplines, traits and gear. • Write your own story through multiple choices. • A real combat system, where your prowess really counts –no random number table or dice to throw! • Wield Lone Wolf’s signature weapon, the Sommerswerd, to unleash devastating attacks that can change the tide of any battle! • 3 different difficulty levels to make the fighting experience more accessible -or more challenging! • Play again, make different choices and explore new paths and fighting styles!", "platform": "Nintendo Switch", "release_date": "February 16, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Forge Reply", "publishers": "Forge Reply", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Joe_Dever's_Lone_Wolf", "video_link": "https://www.youtube.com/watch?v=03SUJquE72U", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118506-joe-devers-lone-wolf\n"}