{"altername_name": ["Jumanji : Le Jeu Vidéo"], "name": "Jumanji: The Video Game", "overview": "Unissez vous dans l'aventure et le rire dans le jeu rempli d'action Jumanji, alors que vous essayez de survivre au défi ultime pour ceux qui veulent quitter leur monde. Seuls vous et trois de vos coéquipiers pouvez restaurer les YOUWELS et sauver Jumanji. Alors allez en ligne, rassemblez des amis pour jouer sur écran partagé ou allez seul avec des compagnons de l'IA. Il y a une armée de pilleurs maléfiques à enregistrer, des bêtes mortelles et des pièges à éviter, et des ajustements cool à déverrouiller. Et avec les héros Dr Bravestone, Ruby, Mouse et Prof. Oberon comme avatars, vous savez que vous avez les compétences uniques et les défauts hilarants pour sauver la journée. Caractéristiques : Retour dans la jungle : Jouez les héros du film Dr Bravestone, Ruby, Mouse et Prof. Shelley dans une nouvelle aventure d'action 3D hilarante. Faites équipe : Travaillez en mode en ligne ou en mode écran partagé avec jusqu'à trois amis ou membres de l'équipe d'IA pour vaincre des ennemis, survivre à des pièges mortels et sauver le monde. Endroits dangereux : Le monde de Jumanji s'étend avec de nouveaux environnements de montagne, de ville et de jungle, beaux mais mortels. Aventure sans fin : Alors que vous perfectionnez vos compétences et vos stratégies et que vous déverrouillez de nouvelles tenues et de nouvelles armes, les Jumanji ne sont plus jamais les mêmes deux rounds.", "platform": "Nintendo Switch", "release_date": "November 8, 2019", "game_type": "Released", "esrb": "Not Rated", "developers": "Bandai Namco Entertainment", "publishers": "", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=jAUO5sUAjeU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161297-jumanji-the-video-game\n"}