{"altername_name": ["Kathy Rain", "Kathy Rain: Director's Cut"], "name": "Kathy Rain: The Director's Cut", "overview": "A Detective Is Born… Set in the 90's, Kathy Rain: Director's Cut is a re-imagining of the original story from 2016. Kathy is a strong-willed journalism major who must come to terms with her troubled past as she investigates the mysterious death of her recently departed grandfather. “Conwell Springs. I never thought I’d return to this place...” Armed with her motorcycle, a pack of cigs, and a notepad, Kathy delves into a local mystery surrounding her hometown that will take her on a harrowing journey of emotional and personal turmoil. “I ... feel strange. Am I dreaming?” As she follows the trail of clues left by her grandfather, questions emerge: What was Joseph Rain really looking for that night all those years ago? What turned him into a mere shell of a man, confined to a wheelchair? What secret did a suicidal young artist take with her to the grave, and why are so many people in Conwell Springs going mad? The truth is dark, sinister, and yours to uncover… Features: • Compelling narrative with an eerie plot set in the 90's • Gorgeous low res pixel art • 40+ hand-drawn environments • 4,000+ lines of fully-voiced dialogue • English voice acting directed by Wadjet Eye Games' Dave Gilbert • Atmospheric original soundtrack Director's Cut Features: • Extended storyline with a prolonged ending, hundreds of lines of additional dialogue, and multiple new areas to explore • Several new major puzzle chains and many small additions and tweaks of existing puzzles • Enlarged game environments to fill up the entire screen without any black bars on the sides • Made countless visual improvements, such as more character animations, better lighting/shadows, and extra weather effects • Controller support done right. Lean back in your chair and take smooth direct control of Kathy, with no messy cursor getting in the way • Expanded and remixed soundtrack by the original composer, Daniel Kobylarz • Five brand new motorcycle designs to unlock and customize", "platform": "Nintendo Switch", "release_date": "October 29, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Clifftop Games", "publishers": "Raw Fury", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Kathy_Rain", "video_link": "https://www.youtube.com/watch?v=5aW1YcrEc0M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370233-kathy-rain-the-directors-cut\n"}