{"altername_name": [], "name": "Kentucky Route Zero: TV Edition", "overview": "At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip. KENTUCKY ROUTE ZERO: TV EDITION is a magical realist adventure game in five acts, featuring a haunting electronic score, and a suite of hymns and bluegrass standards recorded by The Bedquilt Ramblers. Rendered in a striking visual style that draws as much from theater, film, and experimental electronic art as it does from the history of videogames, this is a story of unpayable debts, abandoned futures, and the human drive to find community. Originally published episodically over a span of years, the TV Edition collects all five acts along with the \"interludes\", which were originally published separately, available now on Nintendo Switch™ for the first time. Also for the first time, it has been painstakingly localized for French, German, Italian, Japanese, Korean, Russian, and Spanish (both European Spanish and Latin American).", "platform": "Nintendo Switch", "release_date": "January 28, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Cardboard Computer", "publishers": "Annapurna Interactive", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.58", "wikipedia": "https://en.wikipedia.org/wiki/Kentucky_Route_Zero", "video_link": "https://www.youtube.com/watch?v=JxcUZU0vtLE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/146717-kentucky-route-zero-tv-edition\n"}