{"altername_name": [], "name": "KeyWe", "overview": "The mail must flow! Welcome to KeyWe, the cute and chaotic co-op postal puzzle game where the mail must flow, and it’s up to you to keep things running! Play as Jeff and Debra, two small kiwi birds and the newest hires at the Bungalow Basin Telepost Office. With no hands to help them, the two must work together to jump, flap, peck and butt-slam their way across an interactive landscape of levers, buttons and bells to get the mail delivered on time. From the Dropoff Depot and the Shipping Floor, all the way to the Telegraph Desk and the Cassowary Coop out back, the Telepost is a well-oiled mail-processing machine...well, usually. Overcome Occupational Hazards: Brave inclement weather (and even weirder stuff) while waddling through the Telepost’s various mailrooms to ensure the residents of Bungalow Basin get their post. From swirling sandstorms and blizzards, to carnivorous plants and paranormal activity, it’s all in a day’s work for Jeff and Debra. Team Up or Be Your Own Boss: Take control of both Jeff and Debra, and test your post processing skills in single-player mode, or team up with a friend to tackle mailroom mayhem in online and local co-op modes. No matter how you play, you’ll have a little extra guidance from the Telepost’s capable staff – a vibrant cast of postal professionals ready to help your kiwis complete their tasks. Collect Stamps to Customise Your Kiwis: Coordinate your kiwis to get messages sent as fast as you can. You’ll earn Stamps at the end of each postal shift, which can be used to unlock new wardrobe accessories to customise Jeff and Debra, making them the best-dressed mail birds in Bungalow Basin. Get creative with hats, facewear, backwear, hairstyles and feather patterns – there's no dress code at the Telepost! Keep an Eye Out for Collectibles: All sorts of weird things have fallen into the nooks and crannies of the Telepost over the years, and curious kiwis can solve hidden puzzles to find Collectibles that reward special cosmetics. Experience More Mayhem with Overtime Shifts: And don’t forget you can earn Stamps from doing extra chores at the Telepost. Feed and exercise the cassowaries, plug up the leaky pipes in the basement, make sure the bubble wrap supply is quality controlled and build colleague morale with winter snowball fights; these are just some of the exciting overtime adventures that await!", "platform": "Nintendo Switch", "release_date": "August 31, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "Stonewheat & Sons", "publishers": "Sold Out", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/KeyWe", "video_link": "https://www.youtube.com/watch?v=gAJxd5OtGGk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370681-keywe\n"}