{"altername_name": [], "name": "Kingdom Rush: Origins", "overview": "The most addicting tower defense game returns in an all-new prequel adventure - welcome to Kingdom Rush Origins! Kingdom Rush Origins is the third installment of the award-winning Kingdom Rush saga, loved by millions and earning accolades from gamers and critics around the globe. Take a trip back to the beginning, before Vez’nan ever thought to threaten the kingdom with the gem of power, and experience even more of the lightning-fast, exceptionally captivating gameplay that made the franchise a cornerstone of essential tower defense games. In this exciting prequel, command your elven army and defend mystical lands from sea serpents, evil sorcerers, and wave after wave of gnoll tribesmen, all with the help of brand-spankin’ new towers, heroes, and spells to fend off every last baddie. Kingdom Rush Origins packs in a treasure trove of new content and features while keeping the signature look that millions have come to love. GAME FEATURES - Re-enter the world of Kingdom Rush: visit mysterious elven forests, magical faery realms, and even floating ruins of an ancient metropolis! - Unleash the power of the elves with brand new towers and troops! Elf Archers, Mystic Mages, Stone Druids, and the Elven Infantry make up the backbone of your army. - Discover 8 new specialized tower upgrades with over 18 abilities! Vanquish your enemies with elven marksmen, runed bears, magic-wielding wizards, and even giant animated trees. - Take up arms against 45 new enemies and engage in epic boss battles! Face hordes of Gnolls, giant spiders, and the terrible Twilight army. - Master and upgrade 16 legendary heroes and their awesome powers and spells! - Rain lightning, summon reinforcements, and use each hero’s unique power to obliterate scores of enemies! - Immerse yourself in hours of gameplay with over 80 achievements, with three difficulty modes for the newbs and veterans alike. - Play different game modes - Classic, Iron, and Heroic - and prove your mettle as a master tactician. - Study your enemies and your towers with an in-game encyclopedia.", "platform": "Nintendo Switch", "release_date": "September 17, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Ironhide Game Studio", "publishers": "Ironhide Game Studio", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155895-kingdom-rush-origins\n"}