{"altername_name": [], "name": "Kingdom Hearts: Melody of Memory", "overview": "Kingdom Hearts: Melody of Memory is a rhythm action game featuring both single and multiplayer gameplay. Players press buttons with the right timing to get an Excellent, Good, or Miss, depending on the timing. A Miss affects the player's health, which causes the game to end when it has run out. Players work to level up the characters' health and attack power, with each character having two types of ranged and melee attack abilities. The main single player mode is World Tour, which is the \"story campaign\" of the game. Each song is categorized into a stage, either Field Battle (world exploration tracks), where players complete songs rhythmically in each world, and face appropriate enemies in each stage from the original games in which the song is based on, Memory Dive (tracks associated with a specific character or uses vocals), where players replay stages from past games in music video-like sequences with gameplay similar to Field Battles, and Boss Battle (tracks associated with bosses), where players face bosses from the series. After songs have been completed, they can be replayed individually. Melody of Memory features three-person parties, of which there are four different groupings. Once new parties have been unlocked, they can be used at any time. Disney characters serve as guest members in their specific themed worlds, bringing different sounds and symbols to the gameplay. King Mickey serves as a fourth party member, assisting the player with healing and additional rhythm points when activating the \"Summoning Star\" item.Traversal between each of the worlds is done through the Gummi Ship, a system used in previous mainline Kingdom Hearts games. Melody of Memory features the series' Beginner, Standard, and Proud difficulties, while each stage has three play options available: Basic; One Button, which removes button complexity and allows party members to auto-attack; and Performer, which adds additional enemies and button sequences. Each stage features various objectives to complete, that award material to unlock new songs and items. Clearing stages unlocks a music and cinematic scene player. Multiplayer modes include Double Play co-op mode, where players compete locally together playing as Sora and Riku to get the highest collective score, COM versus, where players compete against the computer to get a high rank three times out of five, and versus mode, where players compete against each other online or with local multiplayer (Nintendo Switch only) for the best score in a best 2 out of 3. This mode features \"tricks\", which are used to disrupt the other player, once at the beginning of the track and again towards the end. There are 10 different types of tricks, with co-director Masanobu Suzui saying they make completing the songs \"more tricky and complicated\" given how players can combine the tricks. Winning in versus mode increases a player's ranking and awards two collectible cards, while the runner-up receives one. The Nintendo Switch version of the game features a free-for-all battle royal mode, where up to eight players can compete against each other in local multiplayer. The gameplay of Melody of Memory has been compared to Theatrhythm Final Fantasy.", "platform": "Nintendo Switch", "release_date": "November 13, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Kingdom_Hearts:_Melody_of_Memory", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/147229-kingdom-hearts-melody-of-memory\n"}