{"altername_name": [], "name": "L.A. Noire", "overview": "A dark and violent crime thriller set against the backdrop of 1940’s Los Angeles. Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right, Phelps must unravel the truth behind a string of arson attacks, racketeering conspiracies and brutal murders, battling the L.A. underworld and even members of his own department to uncover a secret that could shake the city to its rotten core. Utilizing revolutionary facial animation technology that captures every nuance of an actor's facial performance in astonishing detail, L.A. Noire blends the breathtaking action of chases and shootouts with true detective work for an unprecedented interactive experience. Solve brutal crimes, plots and conspiracies inspired by real crimes from 1947 Los Angeles, one of the most corrupt and violent times in L.A. history. Search for clues, chase down suspects and interrogate witnesses as you struggle to find the truth in a city where everyone has something to hide. • Includes the complete original game and all additional downloadable content plus new collectibles and detective suits to unlock, each with unique special abilities. • Features an array of new enhancements specifically for Nintendo Switch™ gaming including a Joy-Con™ mode with gyroscopic, gesture-based controls, HD rumble and new wide and over-the-shoulder camera angles, plus contextual touch screen controls for portable detective work.", "platform": "Nintendo Switch", "release_date": "November 14, 2017", "game_type": "Released", "esrb": "M - Mature", "developers": "Rockstar Games", "publishers": "Take-Two Interactive", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.92", "wikipedia": "https://en.wikipedia.org/wiki/L.A._Noire", "video_link": "https://www.youtube.com/watch?v=if4mC2mLBWY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/102046-la-noire\n"}