{"altername_name": [], "name": "Labyrinth of Zangetsu", "overview": "Fight Japanese folklore inspired Yokai and navigate through winding labyrinths in an enthralling dungeon crawler! Monotone illustrations combined with strikingly beautiful jet black Japanese ink painting create an entirely unique and striking art style. As you navigate each labyrinth, your environment illustrates in real time, revealing characters and secret paths... Explore a variety of underground and above ground dungeons around the city to hunt for Ink Beasts and cleanse the area. A World Blackened By The Ink Of Ruin! In the fortress city of Ido, you are tasked with traveling the treacherous area, 'Chaingung', overrun by 'The Ink of Ruin'. As one of these selected 'Ink Destroyers', you must fight to conquer the hordes of terrifying Ink Beasts who plague the residents of Ido. Born from the Ink of Ruin, the Ink Beasts take over the bodies of those they encounter to increase their numbers. Join the brand of chosen warriors as they venture out to defeat the Ink Beasts causing this destruction. Tokinokuni, the city's leader, has commissioned a quest for carefully selected individuals from all over the world, known as ‘Ink Destroyers’, to cleanse the most dangerous areas. Build and customize a team of six warriors to plunge into the depths of Ido's deepest, darkest labyrinths. Customize each character individually, selecting their appearance, adjusting their stats and equipping them with the best weapons and amour you can scavenge. Face a wide variety of terrifying Ink Beasts based on traditional Japanese folklore, including demons, yokai and ghosts. Encounter these monsters through enthralling turn-based battles, where your characters positioning is key. Strategically select and organize your team, your three front characters attack the demons while the three back characters defend and parry the enemies attacks", "platform": "Nintendo Switch", "release_date": "September 29, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Acquire", "publishers": "Acquire", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368279-labyrinth-of-zangetsu\n"}