{"altername_name": [], "name": "Lamentum", "overview": "Lamentum is a pixel art survival-horror game set in New England in the mid-nineteenth century. To solve the dark secret at the heart of Grau Hill Mansion, you will have to immerse yourself in a nightmare world full of terrible creatures. Guide Victor Hartwell, a young aristocrat on a desperate journey to cure the deadly disease that afflicts his beloved wife, Alissa. Their last hope resides in the darkened halls of Grau Hill Mansion whose Earl has uncovered ancient secrets and forgotten sciences. He claims he can heal Alissa, but… at what price? Grau Hill mansion will open its doors and immerse you in a world of nightmares where you may be trapped forever. During your nightmarish journey you will meet other characters and strange beings. Think carefully about who you trust and who you don’t… every decision you make can have important consequences. Lamentum will have different endings depending on Victor’s decisions during the game. Lamentum strives to be a replayable experience, dedicated players will be in for a challenge to obtain the best possible end. Features: • To defend against the dangers that haunt him, Victor will have many melee and ranged weapons at his disposal. • The world of Lamentum is full of nightmare creatures, each of them with different behaviors and attacks. • Creatures are not the only danger in Grau Hill Mansion, there are traps that will reward your ingenuity or punish your mistakes with death, dangerous puzzles, and lethal environments.", "platform": "Nintendo Switch", "release_date": "August 31, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Obscure Tales", "publishers": "Neon Doctrine", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=p6yxsAt-cQA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370259-lamentum\n"}