{"altername_name": ["El Profesor Layton: El Misterioso Viaje de Layton: Katrielle y la Conspiracion de los Millionarios Edicion Deluxe", "Laytons Mystery Journey Katrielle to Daifugou no Inbou DX"], "name": "Layton's Mystery Journey: Katrielle and the Millionaires' Conspiracy Deluxe Edition", "overview": "Layton's Mystery Journey: Katrielle and the Millionaires' Conspiracy is revamped as \"Deluxe Edition\" with multiple improved features! Solve puzzles at home or on the go with Layton's Mystery Journey: Katrielle and the Millionaires' Conspiracy - Deluxe Edition. In this entry of the Layton series, the famous Professor Hershel Layton has gone missing, and it is up to his daughter Katrielle - a smart and spirited young lady with a knack for arriving at the truth in spite of paltry evidence - to take center stage as the new protagonist. She is aided in her endeavors by a colorful cast of characters new to the series, including a young student named Ernest Greeves who acts as her assistant, and Sheryl, a talking dog who begins as Katrielle's first client, but quickly becomes her sidekick. The Deluxe Edition offers more than 40 brand-new puzzles, in addition to puzzles refined from the original Nintendo 3DS version of the game, an improved screen layout, enhanced graphics, new outfits and all previously released DLC. And because it's on Nintendo Switch, Layton's Mystery Journey: Katrielle and the Millionaires' Conspiracy - Deluxe Edition marks the first time the Layton series can be played at home on a TV, making it a great way for friends and family to get in on the puzzle-solving action adventure.", "platform": "Nintendo Switch", "release_date": "November 8, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Level-5", "publishers": "Level-5", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.7", "wikipedia": "https://en.wikipedia.org/wiki/Layton's_Mystery_Journey", "video_link": "https://www.youtube.com/watch?v=D0oxhzqWh9A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123265-laytons-mystery-journey-katrielle-and-the-millionaires-conspiracy-deluxe-edition\n"}