{"altername_name": ["LEGO Los Increibles"], "name": "LEGO The Incredibles", "overview": "The gameplay is very similar to the previous Lego installments, with puzzles designed for younger players, various waves of fighting enemies and, of course, two players cooperative gameplay. The game allows the player to control various super-heroes and villains alike from both films (including supers that have appeared in neither film but are listed in the National Supers Agency database in the special features of The Incredibles' videodisc release), each with their own special abilities and superpowers. For example, Mr. Incredible has super-strength and invulnerability, Elasti-Girl can shape her body in many ways, Violet can turn invisible and create a force field, Dash can run at incredible speeds and Jack-Jack has a large variety of powers just like in the movies, from turning into a human torch or monster, to telekinesis and teleportation. The game also includes various Pixar characters, such as Flik from A Bug's Life, Merida from Brave, Lightning McQueen from Cars and Woody from Toy Story. The open-world of the game is set in two fictional cities, Municiberg and New Urbem, very close to each other. Apart from the typical gold bricks puzzles, quests and challenges, the game adds a new feature called the Crime Wave, where the player travels to a specific area of one of the cities which is under assault from super-villains and their minions. The player must complete all the quests given by the people in the area to complete the Crime Wave. Usually, the final quest is about defeating the super-villain. There are 10 Crime Waves in total and 5 super-villains to defeat. 3 are taken from the movies: Bomb Voyage, Underminer and Syndrome, while 2 are new original characters: Brainfreezer and Anchor-Man. The game also has a complex character customiser similar to the one from Lego Marvel Super Heroes 2. It is located inside Edna Mode's home.", "platform": "Nintendo Switch", "release_date": "July 13, 2018", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "TT Fusion", "publishers": "WB Games", "genres": "Platform", "max_players": "2", "cooperative": "No", "rating": "2.62", "wikipedia": "https://en.wikipedia.org/wiki/Lego_The_Incredibles", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114480-lego-the-incredibles\n"}