{"altername_name": [], "name": "Let's Sing 2019", "overview": "Solo, duet or with friends – let your talent shine. Let's Sing 2019 includes hits by world-famous artists such as Shawn Mendes, Rita Ora, Passenger and Dua Lipa. Sing along to these and other smash hits by ABBA, Bruno Mars and Queen – it'll be a blast! Ready, set... Sing! The all-new Let's Sing 2019 is finally available for PC. Sing along to 30 international hits including Shawn Mendes' \"There's Nothing Holdin' Me Back\", Rita Ora's \"Anywhere\" and ABBA's legendary dance hit \"Mamma Mia\". Other smash hits featured include DNCE's \"Cake by the Ocean\", Martin Garrix & Dua Lipa's \"Scared To Be Lonely\" and Lorde's \"Green Light\". Full playlist: Zedd ft. Maren Morris & Grey – The Middle Dua Lipa – New Rules Rita Ora – Anywhere DNCE – Cake By The Ocean Martin Garrix & Dua Lipa – Scared To Be Lonely Bruno Mars – 24K Magic Clean Bandit ft. Zara Larsson – Symphony Lorde – Green Light ABBA – Mamma Mia Shawn Mendes – There's Nothing Holdin' Me Back Starley – Call On Me (Ryan Riback Remix) Lady Gaga – Perfect Illusion Auli'i Cravalho – How Far I'll Go Felix Jaehn ft. Jasmine Thompson – Ain't Nobody (Loves Me Better) Passenger – Let Her Go Lou Bega – Mambo No. 5 No Doubt – Don't Speak Everything But The Girl – Missing (Todd Terry Club Mix) Sheryl Crow – All I Wanna Do 4 Non Blondes – What's Up? Queen – I Want It All Bon Jovi – Livin' On A Prayer Bananarama – Cruel Summer Bruno Mars ft. Cardi B Finesse (remix) Nicky Jam & J Balvin – X Michael Schulte – You Let Me Walk Alone Portugal. The Man – Feel It Still Kygo & Selena Gomez – It Ain't Me Jonas Blue ft. William Singe – Mama Tom Walker – Leave a Light On Whether you're a die-hard music lover, a devotee of duets or a fan of online competition, Let's Sing 2019 has something for you. CLASSIC – Compete with your friends for the high score or try to beat your own best score FEAT. – Sing duets with a friend or with the song artist MIXTAPE – Create your own song medley WORLD CONTEST – Challenge the best singers online JUKEBOX – Need a break from singing? Just listen to your favourite songs Let's Sing 2019 has something for everyone – how you play is up to you!", "platform": "Nintendo Switch", "release_date": "2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Voxler", "publishers": "Plug In Digital", "genres": "Music", "max_players": "4", "cooperative": "Yes", "rating": "1.5", "wikipedia": "", "video_link": "https://youtu.be/mv_Ud-wo2Uw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124617-lets-sing-2019\n"}