{"altername_name": [], "name": "Lichtspeer: Double Speer Edition", "overview": "In a land filled with Penguin Vikings, Wurst Zombies, and Hipster Ice Giants, survival is an art. Fortunately, an ancient champion with an elegant weapon has been summoned to please the Gods and restore balance to the universe. Grab your lightspear, become a Germonaut, and traverse lands straight out of Germanic myths. Survive with style and expand your powers to fight for the glory and amusement of the almighty Gods. AIM. SHOOT. KILL. DIE. THE LICHTGODS DEMAND IT. This is LICHTSPEER. A ONE-OF-A-KIND MIX Experience an über fantastisch mix of arcade action and lightspear-throwing simulation. THUNDEROUS TEAMWORK Fight for the glory, hand-in-hand with your four-legged friend in a Nintendo Switch™ exclusive co-op mode. WUNDER BOSS BATTLES Battle a diverse legion of gargantuan wunder bosses – exploit their weaknesses and smash them into pieces! AN ANCIENT GERMANIC FUTURE IS HERE Discover the lands of an ancient Germanic future and fight a horde of Biedermeier beasts from another dimension – Wurst Zombies, Evil Spacedwarfs, Skater Walruses, you name it. SHOW OF YOUR LICHTMAISTER SKILLS Decapitate your enemies with headshots, execute special attacks, and generate zuper massive combos to improve your score and impress your friends! BOMBASTISCH SOUNDTRACK Rave to a bombastisch space soundtrack by Marcin Sonnenberg, from electro space marches to the vibrating sounds of tecnocumbia. RAGE QUIT AND NEW GAME+ MODES Want more? Rise to the challenge and see if you’ve got what it takes to beat the cruel, nerve‑racking Rage Quit and New Game+ modes.", "platform": "Nintendo Switch", "release_date": "September 7, 2017", "game_type": "Released", "esrb": "", "developers": "Lichthund", "publishers": "Crunching Koalas", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118523-lichtspeer-double-speer-edition\n"}