{"altername_name": [], "name": "Livestream: Escape from Hotel Izanami", "overview": "Can three streamers get away from the sudden chase of a mysterious mascot and escape from an abandoned leisure hotel with their lives? In this side-scrolling action-adventure game, you'll need to scour the inside of an abandoned hotel, looking for clues to solve the mystery of the hotel and ensure your escape from a mysterious, murderous mascot intent to kill. The fate of the girls' lives will change dramatically depending on your actions in the game. Online streamers Mio Ikoma, Nana Sakurai and Azusa Shiraishi travel to the locally famous haunted resort, the Hotel Izanami, at Nana's request to shoot a video there. It would be a film shoot at an average haunted location with no particular legend attached. To finish shooting without a hitch and get an end result that was vaguely horror-esque...was all they wanted. During filming, Mio gets separated from the group, and suddenly gets attacked by a mascot costume that has come to life. From that point on, the trapped girls are at the mercy of numerous horrors throughout the hotel. Why is a mascot trying to harm them, and why have they been shut in to the hotel with no escape? Can the three girls escape from the hotel with their lives? A livestream set in an abandoned hotel begins... ■Run from the mysterious mascot chasing you, and escape from the abandoned hotel! While exploring the inside of an abandoned hotel, a mascot swinging a bloody hatchet suddenly appears and starts chasing after the three streamers! When you encounter the mascot, run away quickly, hide yourself, and escape from its pursuit. One hit from the mascot's hatchet will lead to instant death (game over). ■Use hints and items to help you find clues on how to escape! While exploring the hotel ruins, you will come across various items and hints. Search every nook and cranny of the rooms to get items and hints that will help you survive! Some items will greatly change the fates of the girls... ■Is this a curse?! The livestreaming girls are cornered by the descent of a life-threatening horror! You'll be met with various frights while exploring the hotel ruins. Investigate your surroundings to get hints and use items you find to help the girls escape from desperate situations. You can even touch the girls, regardless of their plight... Is this also the work of the curse?! ・Mio Ikoma　(CV:Haruka Yamazaki） ・Nana Sakurai　(CV:Asuka Nishi） ・Azusa Shiraishi (CV:Satsumi Matsuda） ・Character Design:Waon Inui ・Scenario:C-Garden,Inc. ・Producer:Yujiro Usuda", "platform": "Nintendo Switch", "release_date": "April 15, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "qureate", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Cj-h2wHnvI4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156728-livestream-escape-from-hotel-izanami\n"}