{"altername_name": [], "name": "Loop8 Summer of Gods", "overview": "Entrez dans la peau de Nini, un adolescent fraîchement débarqué sur Terre arrivant dans la pittoresque ville japonaise d’Ashihara en août 1983. Explorez la ville, liez-vous d’amitié avec ses habitants, et affrontez les Kegal dans des combats au tour par tour dont l’issue dépendra des relations que vous aurez tissées et des décisions que vous aurez prises. Utilisez les connexions spéciales de Nini avec les dieux pour réinitialiser le monde, et chaque boucle permettra à Nini et à ses alliés de revivre le 8e mois jusqu’à ce qu’ils puissent régler le problème, ou que les Kegal ne les battent pour de bon. Il ne reste plus qu’un mois avant la fin du monde, comment passerez-vous chaque jour ? ■Vivez une vie ordinaire, combattez des ennemis extraordinaires Tissez des liens avec les habitants d’Ashihara tout en protégeant la ville de la menace constante des Kegai, et répétez le cycle pour découvrir comment vos actions quotidiennes peuvent impacter votre combat dans le monde d’en bas, et inversement. ■Des choix pouvant changer le monde L’IA du système basé sur les émotions de Loop8 réagit à chaque action que vous effectuez et chaque décision que vous prenez. Les émotions et les histoires des personnages changeront énormément en fonction de vos choix, rendant chaque partie totalement unique. ■Une vue pittoresque du Japon rural Votre aventure se déroule dans un lieu nostalgique et magnifiquement reproduit d’un village rural japonais. Rendez-vous au restaurant du centre-ville pour recharger votre énergie ou visitez les boutiques pour renforcer votre lien avec les autres personnages. ■Revivez le passé pour changer le futur Bien que la date de l’extermination de l’humanité se rapproche toujours plus, le sortd’Ashihara est toujours entre vos mains. Retournez régulièrement au début du mois d’Août, modifiez vos actions et découvrez comment elles changent le cours des choses dans plusieurs épilogues différents.", "platform": "Nintendo Switch", "release_date": "June 6, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Sieg Games", "publishers": "Marvelous Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Loop8:_Summer_of_Gods", "video_link": "https://www.youtube.com/watch?v=s_8DwcpVGz0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369672-loop8-summer-of-gods\n"}