{"altername_name": [], "name": "Lost Ruins", "overview": "Only the Cutest Survive! Lost Ruins is a 2D side-scrolling survival action game, where you play as a young girl that has awoken in a strange and foreign place without her memories. With the aid of weapons, spells and tonics, and the guidance of the magical and mysterious Beatrice, you will explore a dark and dangerous world, battle hideous monsters, and topple incredible bosses. A young girl wakes up in a dimly lit dungeon without any of her memories. Surrounded by horrible, bloodthirsty monsters, the girl is rescued by the magician, Beatrice. With Beatrice’s help, the girl goes on a perilous journey to find answers, and unlock the secrets of the Lost Ruins. Engage in Combat: Combat in Lost Ruins is both strategic and methodical. Slash away at enemies, burn them to a crisp, or even deflect their projectiles back at them. Arm yourself with a variety of swords, axes and other assorted medieval weaponry, and hack monsters to pieces. Master Spells: For those with an affinity for magic, Lost Ruins allows you to cast a variety of spells through wands, tonics, and scrolls. Burn monsters, freeze bosses, and heal yourself when in danger. Choose what works for your playstyle and make a magic casting character that’s totally your own. Choose Your Accessories: The world of Lost Ruins is a dangerous one and being armed to the teeth with awesome weaponry is sometimes not enough. That’s where accessories come in. Accessories are unique pieces of equipment with all manner of effects. One accessory might protect you against fire, while another might heal you when you’re poisoned. The right combination of accessories can create different strategic options for your adventure. Make Use of the Environment: As you explore the depths of Lost Ruin’s dimly lit dungeons, you will find that while everything around you might bring about your death, you can also use the environment around you to your advantage. Elements within the world will react with other elements realistically. Flammable liquids will be set ablaze when in contact with lit lanterns. Ice magic will freeze bodies of water, making them dangerously cold. The more you understand the environment and how to use it to your advantage, the more dangerous you will become.", "platform": "Nintendo Switch", "release_date": "June 6, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "Altari Games", "publishers": "DANGEN Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=i3A8XJAdBoc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368958-lost-ruins\n"}