{"altername_name": [], "name": "LOVE", "overview": "Love is a brutal minimalist platformer. You run, you jump, and you lay down your own checkpoints. The player is assigned 100 lives and is tasked with steering a white 5x8 stick figure through sixteen levels of increasingly difficult jumping puzzles, often broadly inspired by classic 8- and 16-bit games. Avoid spikes, navigate platforms, and try hard not to fall. The key feature is in the checkpoints. The player needs to not only master the jumping physics but to exercise good judgment in placing checkpoints -- as at the risk of replaying a large part of the level, the player must weigh the value of personal time and frustration versus the commodity of the character's remaining lives. The visuals are extremely simple and low-resolution, running on a resizable 160x120 pixel display. Backgrounds generally consist of black and one other color -- black serving as navigable space, and the other color serving as solid surfaces -- with all sprites white against that background. The maps tend to avoid overt tiling patterns, each level instead consisting of a large two-color illustration. The music consists of chilly, high-energy tracker compositions. Love has been released in many versions over the years, its earliest versions later rebranded Love Classic. For a while the developer distributed a separate build called Love Custom which was distinguished by its level design toolkit. At the same time as the earlier releases were renamed Love Classic, the newest build was named Love+. As of 2014 the level editor has been incorporated into the build formerly known as Love+, which has in turn been reset to the game's original name, Love.", "platform": "Nintendo Switch", "release_date": "February 14, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Fred Wood", "publishers": "Mokuzai Studio", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Love_(2008_video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117894-love\n"}