{"altername_name": ["Luigi Mansion 3"], "name": "Luigi's Mansion 3", "overview": "Luigi’s invited to the towering Last Resort hotel, but when Mario and friends go missing, our green-clad hero will have to conquer his fears to save them! Slam, blow away, and vacuum up ghosts with the all-new Poltergust G-00, and join forces with Gooigi to overcome the puzzling contraptions and mischievous boss on each themed floor. And that’s just the Last Resort. Enter the ScareScraper for 8-player local wireless or online co-op gameplay. See if you can defeat all the ghosts, rescue all the toads, or clear other objectives before time runs out... in the ScareScraper! And for more mini-game madness, compete on teams at the ScreamPark! Whether you play with friends or wander the hotel alone, you’ll be sucked in by the atmospheric music and ghoulish décor of every cobwebby corner you explore. Why not take in the cinematic sights and sounds with a friend? In the main adventure, you and a friend can play together as Luigi and Gooigi in two-player co-op! Gooigi can walk on spikes, slip through tight spaces, and help Luigi overcome obstacles he can’t tackle alone. Never hurts to have a friend in this hotel; it may not be very spooky, but Luigi begs to differ! • Catch ghosts and solve puzzles to rescue Mario and friends in the Last Resort hotel • Utilize the functions of the all-new Poltergust G-00: Pummel ghosts with a Slam, break through defenses with the Suction Shot, and blow back groups with a Burst • Luigi can call upon and control Gooigi, his all-green doppelganger, who can do what Luigi can’t • Change between Luigi and Gooigi in single player, or let a friend play as Gooigi for 2-player co-op • Up to 8 players can work together to ascend the Scarescaper via local wireless or online • It’s Team Luigi vs. Team Gooigi in a mini-game battle to see which is the ultimate team of ghost hunters", "platform": "Nintendo Switch", "release_date": "October 31, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Next Level Games", "publishers": "Nintendo", "genres": "Adventure", "max_players": "8", "cooperative": "Yes", "rating": "4.41", "wikipedia": "https://en.wikipedia.org/wiki/Luigi%27s_Mansion_3", "video_link": "https://www.youtube.com/watch?v=ErJcRy67gps", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/121964-luigis-mansion-3\n"}