{"altername_name": [], "name": "Lumberhill", "overview": "A crazy multiplayer party game where lumberjacks try to get their tasks done and nature fights them every step of the way. Race against the clock, fulfill tasks, fight wildfires, pirates, and extremely annoying monkeys as you travel around the world and through time. Play in co-op, pvp, or solo mode! Lumberjacks Versus Absolute Chaos Sharpen your axe, call up your team, and iron your flannel! You’re going to need your best teamwork skills because nature is united in getting in your way. In this chaotic race against time, you’ll have to chop wood and chase animals back into their pens to fulfill tasks…sounds easy, but it’s not when there are meteors, dinosaurs, and nature itself set on stopping you. To succeed you’ll have to race against the clock, find unorthodox paths through the map, work together as a team, and most importantly—be prepared for anything! Through Time and Around the World If there’s a tree, there’s work for a lumberjack. Get ready for an incredible ride that will take you to the most unexpected periods and parts of the world and beyond! You’ll get to explore new settings with unique events and mechanics as you progress and meet new animals—big and small, rude and cute that you’ll either want to cuddle or hide in the bushes from. Throughout your journey you’ll also unlock tons of fun, new skins to really make for some crazy screenshots. Multiplayer Modes for Everyone Whether you’re on the same sofa or miles apart, you can join axes and get to work: Lumberhill supports both local and online co-op! Feeling mischievous? Switch to PvP and chase your friends across the map (and off it!) as a ram or furious hog to keep them from fulfilling tasks. Want to see what you can accomplish alone? Chill out and enjoy a solitary journey in solo mode. In Lumberhill you will: ● Put your teamwork skills to the test with up to 3 additional friends in local or online co-op or pvp, or play alone in solo mode ● Have your butt kicked by nature ● Complete orders in a wide variety of challenging, time-limited levels ● Deal with chaotic random events such as wildfires, meteor showers, and pirate attacks ● Unlock new exciting worlds and a wide variety of skins as you progress ● Find unexpected routes and ways of doing things ● Throw pandas around and evade dinosaurs ● Probably kick your friends off the map by accident a lot (or on purpose—we don’t judge)", "platform": "Nintendo Switch", "release_date": "April 15, 2022", "game_type": "Released", "esrb": "", "developers": "ALL IN! GAMES", "publishers": "", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164460-lumberhill\n"}