{"altername_name": [], "name": "Mario vs. Donkey Kong", "overview": "Mario vs. Donkey Kong returns to the gaming world as a side-scrolling puzzle-platformer exclusively for the Nintendo Switch. This title is a remake of the 2004 Game Boy Advance game that shares its name. Visually, the game has undergone a significant transformation; Moving away from the original's pre-rendered visuals and the subsequent series' plastic, cartoony aesthetics, the remake embraces a modern art direction. This contemporary approach draws inspiration from \"Super Mario 3D World\" and its representation within \"Super Mario Maker 2.\" Furthermore, the game introduces a fresh logo design for the esteemed Donkey Kong series. Feature List: 3D Models: Unlike its predecessor which utilized pre-rendered sprites, the remake showcases full 3D models. Animated Cutscenes: The storytelling is enhanced with fully animated cutscenes, offering more dynamism than the original's static frames. Redesigned Characters: Updated designs for characters like Tane Pakkun, which have transformed into mechanical Fire Piranha Plants. Toy Ninjis now bear a resemblance to the current design of regular Ninjis, and Brickmen feature movable bricks over their eyes for added expression. Multiplayer Mode: For the first time, players can venture with a friend with the addition of Toad as a second playable character. Language Options: The game has broadened its accessibility with translations in Chinese (Simplified and Traditional), Dutch, and Korean – languages that were absent in the original. It also includes Canadian French and Latin American Spanish translations.", "platform": "Nintendo Switch", "release_date": "February 16, 2024", "game_type": "", "esrb": "", "developers": "Nintendo Software Technology", "publishers": "Nintendo", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Mario_vs._Donkey_Kong_(video_game)", "video_link": "https://www.youtube.com/watch?v=5sPwqplxHXc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372463-mario-vs-donkey-kong\n"}