{"altername_name": [], "name": "Mech Mechanic Simulator", "overview": "Mechs are our future! What happens when cars are no longer around? Gigantic robots take over! Powerful, destructive and strong... They are used in sports, at war... and for you, they are moneymakers. Become a Mech Mechanic and open your own workshop to dismantle, fix and rebuild gigantic robots. Every mech has its own special purpose and as a Mech Mechanic not only will you be able to diagnose, repair or change the parts but also paint, update and accommodate mechs for their new function. Even if you’re the best Mech Mechanic in the world, you’ll find the parts that are unfixable. Do what you can with what you’ve got, but if you find some junk among your parts… dismount it and order new ones. If you don’t like wasting things, don’t worry! Mech Mechanic Simulator lets you remanufacture and renew the parts. It’s your choice: sell, recast or restore your parts! Gain some respect among other corporations and get access to more advanced machinery. But be careful, it’s not that easy. You’ll have a lot of expenses. Raw materials and equipment are not cheap, the quality of your parts can drop rapidly, and some of the customers have really high demands. If you don’t want to be put out of business, you’ll have to make your workshop look good as well. Can you maintain a good reputation? Become an expert in your field and compete with the most powerful corporations of the future. Who’s going to produce the most modern, technologically advanced mech? Make sure it’s you! Game features: Personalized mechs Various parts, paints and stickers Mini-games Black market deals and offers Many workstations", "platform": "Nintendo Switch", "release_date": "April 8, 2022", "game_type": "Released", "esrb": "E - Everyone", "developers": "Polyslash S.A.", "publishers": "Console Labs S.A.", "genres": "", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163188-mech-mechanic-simulator\n"}