{"altername_name": [], "name": "Mega Man X Legacy Collection 1 + 2", "overview": "The celebrated Mega Man X series returns! Play as Mega Man X - the powerful evolution of classic fighting robot Mega Man - as he battles a variety of deadly bosses known as Mavericks in eight exhilarating action-platformer games. Mega Man X Legacy Collection includes the legendary 16-bit titles and the series’ exciting foray into 32-bits: Mega Man X, X2, X3, and X4. The heroic robot grows stronger as he takes down Mavericks and steals their weapons, and also has the ability to dash and wall jump for thrilling, fast-paced combat. Mega Man X’s mysterious friend, Zero, also joins the fray as a playable character later in this collection. Mega Man X Legacy Collection 2 also spans two gaming eras, showcasing the evolution of the series with Mega Man X5, X6, X7, and X8. A third playable character, Axl, joins the cast in X7 and X8 as the series jumps into a new realm of 3D character models and environments. In addition to eight iconic Mega Man X titles, both Mega Man X Legacy Collection and Legacy Collection 2 come with an armory of new features. Test your Maverick-hunting skills in the new X Challenge mode, which pits players against two deadly bosses in a series of two-on-one battles. Think you can take down the slippery Chill Penguin and hulking Frost Walrus simultaneously? Give it your best shot! Additionally, Mega Man X Legacy Collection includes a huge museum filled with rare production art, catalogs of classic merchandise, a playlist of nostalgic commercials, and more. The collection also includes an animated a prequel film starring the origins of Mega Man X villain, Sigma. This is the ultimate way to experience the complete, high-octane Mega Man X series.", "platform": "Nintendo Switch", "release_date": "July 24, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=yOqrmI3IWRY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/158198-mega-man-x-legacy-collection-1-2\n"}