{"altername_name": [], "name": "Mercenaries Wings: The False Phoenix", "overview": "Mercenaries Wings: The False Phoenix, blends turn-based strategy, old-school aesthetics and a tale of war, betrayal and magical forces! Mercenaries Wings: The False Phoenix challenges your tactical nous across a lengthy and challenging campaign. The Kingdom of Dryden has an incredible history thanks to the story of a Phoenix facing down enemies generations ago; now, buoyed by that legacy, King Harold continually seeks conflict. Follow the tale of a band of mercenaries, working for coin but then challenged to consider whether their actions, and those of King Harold, are what is best for the land. What follows is a story of war, betrayal, magical lore and redemption for a nation! A tactical RPG in the finest traditions of the genre, Mercenaries Wings: The False Phoenix requires you to carefully utilise varied units and their abilities. Set Leaders to change the flow of battle, level up your units, change classes, manage equipment and make the key choices that will be the difference between victory and defeat! An adventure that will take many hours to complete, Mercenaries Wings: The False Phoenix will challenge even the most careful strategists. Features: ● An all-new standalone story in the Mercenaries series, this adventure offers many hours of entertainment. ● Carefully crafted tactical RPG action. ● Choose a Leader for each battle, level up units, change class types and pick the right equipment. ● Follow the twists and turns of the tale that includes war, magical beasts and leadership challenges! ● Featuring character illustrations by Kazama Raita!", "platform": "Nintendo Switch", "release_date": "October 29, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "RideOn Japan", "publishers": "CIRCLE Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.67", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=b3iOQsej56c&t", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/123214-mercenaries-wings-the-false-phoenix\n"}