{"altername_name": ["Mercenaries Blaze"], "name": "Mercenaries Blaze: Dawn of the Twin Dragons", "overview": "Mercenaries Blaze: Dawn of the Twin Dragons is a tactical RPG from Rideon, and is the 5th ‘Mercenaries’ title on Nintendo Switch! Experience a lengthy and challenging story campaign, an enthralling tale full of emotive writing, plot twists and high stakes moments. Grow with your team by clearing strategic turn-based battles, with many optional missions and details to consider – which class will you upgrade for each character, and what equipment or skills will you prioritise? Developer Rideon’s highly-regarded turn-based strategy battles are carried out from an isometric viewpoint, and are characterized by increased depth as you position characters not just in terms of elevation and enemies, but also to maximise attacks and defence depending on the direction you face. Varied weapons and skills are all tools that need to be utilised smartly for the best results. New to the series for Mercenaries Blaze: Dawn of the Twin Dragons are fully 3D Battle Maps, along with improved visuals and audio. Character designs are from Mr. Masayoshi Nishimura, with the varied cast telling an exciting and surprising story. Features: ● Experience an amazing story with two distinct paths and a diverse cast of characters. ● Lots of optional battles that allow you to see more of the world and level up your team. ● 3D Battle Maps, giving greater control and depth in strategic play. ● Use Blaze Exceed, a key power that can turn the tide of battle. ● Incredible depth beyond battles, as you carefully manage equipment, skills and classes for your team.", "platform": "Nintendo Switch", "release_date": "December 17, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "RideOn Japan", "publishers": "CIRCLE Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.8", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=I1OvrB_8IvA&t", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/152923-mercenaries-blaze-dawn-of-the-twin-dragons\n"}