{"altername_name": [], "name": "Metal Unit", "overview": "Metal Unit tells a tragic story of human survivors and their battle against monsters and machines to regain control of their planet. The Earth is under siege from all directions, with ancient beings emerging from underground and alien machines descending from space. The fate of the planet hangs in the balance, but you can help tilt the odds by playing as Joanna, a new soldier capable of wearing the powerful M-Unit suit. Follow Joanna on her epic journey to save humanity and get revenge on her traitorous sister that has taken up arms with the alien race. Key Features: • Action-Packed Battle System – You can dash to evade enemies or go on the offensive and chain multiple weapon attacks together to perform devastating combos. The wide of range of melee and ranged weapons at your disposal also give you the ultimate flexibility to take out enemies any way you see fit. • Huge & Diverse Environments – You can choose to explore the sprawling surface of the planet or delve deep inside mysterious dungeons. Traveling around the world will progress the story, while going underground offers bigger rewards that may come at a heavy price... • Your Decisions Matter – The characters in Metal Unit will suffer through corruption, betrayal and death. But your decisions carry significant weight in key dialogues and certain actions during the game. • Roguelite Elements – Upon death the game will convert all equipped items into permanent research points. The points can then be used to unlock new items and skills. You will constantly receive weapons of varying utility and will need to adapt your strategy to match your current equipment.", "platform": "Nintendo Switch", "release_date": "June 17, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "JellySnow Studio", "publishers": "Neowiz Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156779-metal-unit\n"}