{"altername_name": [], "name": "MindSeize", "overview": "Transfer your mind into a MAG and set out to an epic Action-Adventure with Sci-Fi setting! Aiming to save your daughter, an even bigger threat emerges... Fast-paced combat and extensive exploration awaits, inspired by a wide range of Metroidvania-classics! Private investigator M.C. Fox is chasing a dangerous criminal organization called The Ascended on unexplored planets, who appear to seize minds of various strong-willed individuals across the universe. A confrontation between M.C. and their leader severely injured him, leaving the investigator crippled and the mind of his daughter seized. This leaves him with little but one choice: Hunting down the leaders of The Ascended with the help of his trusted crew and a robotic body called MAG: The Mind-Action-Gear! Key Features: ・Classic 2D-action with a modern twist - Smooth and fast-paced action with beautiful hand-drawn 16-bit pixel graphics, mixed with atmospheric music and hard-hitting sound effects. ・Explore mysterious planets - Travel to 4 different and unique planets, unravel their secrets and fight the dangers within. Remember to take a break once in a while, and interact with the crew on your ship. ・Upgrade your MAG - Buy and find different mods, weapons and abilities that bring versatility to your MAG's combat capability. Many of them being optional and well-hidden! ・Delve in to the world of MindSeize - Follow the narrative written by a professional script writer, meet a wide cast of unique characters and read the expansive log-book about the planets and their fauna.", "platform": "Nintendo Switch", "release_date": "September 29, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Kamina Dimension", "publishers": "First Press Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155942-mindseize\n"}