{"altername_name": [], "name": "Miraculous: Rise of the Sphinx", "overview": "Paris needs a hero! Once again, the city of lights is in trouble as it faces a new menace—the most threatening sentimonster ever created is about to take control! As you take on the personna’s of the globally renowned superheroez Ladybug and Cat Noir, you’ll need to unveil the diabolical plan hatched by archvillain Hawk Moth—and squash it! Immerse yourself into the magical world of Miraculous and level up your superpowers as you embark on your biggest journey yet! Key Game Features: • Epic Adventure! Immerse yourself in an original story as you take control of everyone’s favorite heroes, Ladybug and Cat Noir. • Team Up! Experience the thrill of teamwork as you battle villains and de-evilize akumas together in local co-op. • More Villains! Come face to face with familiar villains Hawk Moth, Gamer, Weredad, and Mr. Pigeon, and some new enemies too! • Discovery! Explore the streets of Paris as Marinette and Adrien and uncover the story behind their alter-ego’s Ladybug and Cat Noir. • Super Gadgets! Use Ladybug’s fast flinging yo-yo and Cat Noir’s magical versatile staff to swing or vault into battle! Upgrade the gadgets to unlock powerful new moves! • Master Fu! Visit your friend and mentor Master Fu whose words of wisdom help you to learn new powers. • Kwami Shop: Discover the many treasures of the Kwami shop as you unlock never-before-seen artwork, music, and more. • Friendship Quest: As Marinette and Adrian, you’ll need to catch up with your friends for clues to progress the story and unlock special friendship moments.", "platform": "Nintendo Switch", "release_date": "October 25, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Game Mill Publishing", "publishers": "Game Mill", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=svqO1cnQSM8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166583-miraculous-rise-of-the-sphinx\n"}