{"altername_name": [], "name": "Missile Dancer", "overview": "Taking inspiration from the likes of Eighting's Soukyugurentai and Taiti's 'Storm' series of shooters, Missile Dancer is a vertically-scrolling shmup with simple yet addictive mechanics; holding down your shot button causes a targeting circle to expand around your craft, and any enemies caught in this circle will be considered 'locked-on'. Release the button, and a flurry of missiles will destroy all targeted foes, Macross-style. Your standard shot, meanwhile, is a bit weedy and is best used to deal with incoming enemy missiles, which cannot be targeted by your own. Blowing up enemies releases gems which can be collected to boost your score further, and you're rewarded for chaining together missile barrages. Set across eight levels – each with its own epic boss battle at the end – Missile Dancer is a purebred, old-school shooter. The levels and sprites designs look like they've been lifted straight from an early '90s arcade shooter, while the music and sound effects are similarly nostalgic – not to mention effective. Scoring points is the aim of the game, as getting to the end of those eight levels won't take you very long (on the 'Normal' difficulty, at least – the higher levels are much more challenging), and the developer has included a 'Caravan' mode which tasks you with scoring as many points as possible in a three-minute time limit. Because the next wave of enemies is only released in this mode when you've finished those already on-screen, there's a lot of room for clever and tactical play, which massively expands the longevity of the game. It's a shame, then, that the leaderboard included is local only, and not online. Missile Dancer can be played co-operatively with a second person on Switch, and has an English language option which delivers some amazing 'Engrish' text – another faithful throwback to the '90s arcade scene, you could argue. There's also a TATE mode, but at the time of writing it only turns the screen 90 degrees counter-clockwise, which means you can't fully insert your Switch into the Flip Grip accessory (the screen needs to be turned 90 degrees clockwise for that). It's no biggie, though, and we'd imagine the developer will fix this in a future update.", "platform": "Nintendo Switch", "release_date": "June 25, 2020", "game_type": "Released", "esrb": "", "developers": "TERARIN GAMES", "publishers": "TERARIN GAMES", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=gjBx5XfCrvk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/144411-missile-dancer\n"}