{"altername_name": ["Monster Rancher 1 and 2 DX"], "name": "Monster Rancher 1 & 2 DX", "overview": "The full experience of “Monster Rancher” and “Monster Rancher 2” in one package! [The DX features] ・All save slots available from the beginning! ・Freeze up to 20 monsters! ・Exclusive monsters from different countries added to the game! (“Monster Rancher 2”) ・Added the \"Fast Forward\" mode that allows you to skip through some scenes and \"Training Records\" to keep the record of your previous actions! [“Monster Rancher” and “Monster Rancher 2” Features] ● Raise, train, and battle just like in the original! You can acquire, train, and battle with all kinds of monsters just like in the original “Monster Rancher” games. On the Nintendo Switch™, you can train monsters anytime, anywhere, and also take advantage of the online features of the game. ● Compete against monsters trained by other players Download monsters raised by breeders all over the world and play against them. You can even share one of your Joy-Con with another player to play against each other. ● Evolving from the original series Based on the feedback from the series fans, some of the most requested improvements have been incorporated into the game, making it more comfortable to play while maintaining the fun of the original. ● The New Monster Generating System! One of the most unique features of the original game, which allowed players to acquire monsters by importing CDs, has been replaced with a new music database that can be used to generate monsters by searching CD titles! This is your chance to raise the rare monsters that you couldn’t acquire before!", "platform": "Nintendo Switch", "release_date": "December 9, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "Koei Tecmo America Corp.", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157217-monster-rancher-1-2-dx\n"}