{"altername_name": ["Monster Prom XXL"], "name": "Monster Prom: XXL", "overview": "Be Your Worst Self There’s only 3 weeks left until prom and you haven’t got a date yet..and you’re a monster. But that’s okay ‘cause at your high-school everyone else is too! These are the stepping stones into the world of Monster Prom: XXL - the bundled up, content filled edition of Monster Prom, a one-to-four player competitive dating sim that will have you thinking: I never knew I was into that! Content Complete: Monster Prom: XXL contains both the Second Term DLC, as well as all seasonal content released throughout the game’s lifespan. Check out brand new characters, new events, secret endings and countless other ways to explore the (after)life of a love-struck high school monster! Competitive dating sim: Nothing makes the heart grow fonder than a little competition. Set your gaze on one of the sweethearts, but if you share your romantic tastes with your friends, be ready for some stiff competition. Couch Multiplayer for one-to-four people: Play by yourself, with a significant other or with your favourite group of friends. Easy to pick up and play: No learning required, just have your heart strings ready for tugging. Hundreds of events & unique items: Rise to the top of the high-school popularity food chain by taking part in hundreds of events that branch out into situations with 1000+ multiple outcomes. When the going gets tough, swing by the shop and check out all the unique items that may come in handy when facing your future prom date. Characters easy to fall in love with: With 8 fully fledged lovable classmates at your fingertips, go ahead and meet, pick and find out just what makes them tick. Fantastically funny writing: All's fair in love and war, except maybe taking yourself too seriously. Through whimsical, postmodern humor, written by Cory O’Brien, Maggie Herskowitz and Julián Quijano, there is no topic Monster Prom won’t make fun of, including itself. Gorgeous art: There’s never a dull moment while exploring the beautifully crafted world and characters drawn by Arthur Tien. Freedom of choice: In Monster Prom the game experience is unaffected by gender or sexual orientation, since finding love is already hard enough.", "platform": "Nintendo Switch", "release_date": "May 21, 2020", "game_type": "Released", "esrb": "M - Mature", "developers": "Beautiful Glitch", "publishers": "Beautiful Glitch", "genres": "Party", "max_players": "4", "cooperative": "Yes", "rating": "2.5", "wikipedia": "https://www.wikiwand.com/en/Monster_Prom", "video_link": "https://www.youtube.com/watch?v=TRdXGWMjGZc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167683-monster-prom-xxl\n"}