{"altername_name": ["Moon"], "name": "Moon: Remix RPG Adventure", "overview": "Moon begins with the protagonist, a small boy, playing a new role-playing game (RPG) called \"Moon\" (a.k.a. \"Fake Moon\") on his \"Gamestation\". The game begins with the player controlling the Hero of Fake Moon in a 10-minute game-within-a-game, Fake Moon being something of a parody of Japanese RPGs (JRPGs) of the 16-bit era. Convoluted JRPG stories are skewered by the minutes of a nonsensical backstory, which Boy skips through before the player can read it. Queen Aphrodite has been abducted and taken to the moon. The perpetrator, Dragon, will wreak millions of calamitous years upon the people of Love-De-Gard with her power. Yet, the people have produced a hero who must travel to Dragon Castle and destroy the beast. After playing through a few typical RPG scenes (random battles, an airship sequence, etc.), the boy is ordered by his mother to go to bed and obediently does so. However, the television on which he was just playing Fake Moon switches back on by itself, and the boy is sucked into the world of Moon, a land called \"Love-de-Gard.\" Its people and its story resembles Fake Moon's. The player must explore a vast world named Love-De-Gard. A dragon has swallowed the moonlight, with calamitous consequences. Castle Love-De-Gard houses the King's room, the Minister's room, the throne room, hallways, the balcony, the soldiers’ room, and the King's toy room. In Castle Town, Boy finds Fountain Square, a floristry, a general store, a bakery, a bar, and Yoshida's home. At Rainbow Rocks, there is Granny's house, Tao's hiding place, the rainbow machine, and Boy's house (which was formerly Nikka's and Pokka's house). In Tropical Field, one discovers Whaleshell Cove, Ossan's Cave, Tamaya's, American House, Windmill Hermitage, and Eco-Club Headquarters. One sees, in the Valley of the Wind, Twilight Canyon, Splitting Sunbeam Road, and Wildcat House. There is Mushroom Forest, which contains Burrn Hall, Adder's House, Mushroom Forest itself, and a haunted house. Within Technopolis, Boy sees Doctor Steinhager's office, Technopolis proper, Club Techno, and the V.I.P. Room. Bali Bali is its own location, as is the moon.", "platform": "Nintendo Switch", "release_date": "August 27, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Love-de-Lic", "publishers": "Onion Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Moon:_Remix_RPG_Adventure?oldformat=true", "video_link": "https://www.youtube.com/watch?v=FClNYk5Pbdw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/140008-moon-remix-rpg-adventure\n"}