{"altername_name": ["MK1"], "name": "Mortal Kombat 1", "overview": "It’s In Our Blood! Prepare yourself for the rebirth of the fighting genre as the Mortal Kombat universe is resurrected in Mortal Kombat 1. The iconic fighting series that once defined an entire generation of gamers is back, bringing with it a renewed vision of the Mortal Kombat world, intricately redesigned with updated graphics and immersive gameplay dynamics. Step into a brutal battleground where every fighter is driven by a singular goal: victory at any cost. Features: Revived Roster of Fighters: Mortal Kombat 1 pays homage to the original lineup of fighters that stole the hearts of players worldwide. Witness the rebirth of legends like Scorpion, Sub-Zero, Liu Kang, and others, each brilliantly redesigned and equipped with unique abilities and signature moves. Innovative Fighting Mechanics: Experience innovative fighting mechanics that bring a breath of fresh air to the Mortal Kombat series. Combo chains, juggle mechanics, and a refurbished fighting system provide a rich and deep combat experience, offering both newcomers and veterans a chance to prove their mettle in the newly reborn Mortal Kombat universe. Revamped Visuals and Sound: Immerse yourself in the meticulously crafted environments adorned with unprecedented details and dynamic lighting, complemented by a soundtrack that honors the series' heritage while introducing new, evocative scores to pump adrenaline into every fight. Fatalities – Reimagined: Mortal Kombat wouldn't be complete without its signature fatalities. Witness the revival of the most brutal finishing moves in gaming, reimagined and brought to life with heart-stopping realism that will leave players both horrified and exhilarated. Engaging Storyline: While the essence of Mortal Kombat 1 Reborn lies in its fighting mechanics, the revamped storyline offers a deeper dive into the lore of the Mortal Kombat universe. Experience the tales of vengeance, betrayal, and honor as you uncover the secrets behind the Mortal Kombat tournament, witnessing the events that shaped the destinies of your favorite characters. Rich Multiplayer Experience: Test your skills against players from around the globe in the robust online multiplayer mode. Engage in ranked matches, build your reputation, and rise through the ranks to become a legend in the Mortal Kombat community. Training and Tutorial System: Whether you are a new player looking to enter the Mortal Kombat universe or a veteran seeking to hone your skills, the revamped training and tutorial system provides all the tools necessary to master the complex mechanics and emerge victorious in battle.", "platform": "Nintendo Switch", "release_date": "September 19, 2023", "game_type": "", "esrb": "M - Mature", "developers": "NetherRealm Studios", "publishers": "Warner Bros. Interactive Entertainment", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "2.83", "wikipedia": "https://en.wikipedia.org/wiki/Mortal_Kombat_1", "video_link": "https://www.youtube.com/watch?v=jnMo1SUTal8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371921-mortal-kombat-1\n"}