{"altername_name": [], "name": "Moto Rider GO: Highway Traffic", "overview": "Moto Rider GO: Highway Traffic brings to you a compelling and satisfying traffic dodging experience in the world! Features: - Licensed Husqvarna and KTM motorcycle models - Choose from the fastest high-performance motorcycles! - Enjoy extreme 3D visuals! - Prove your skills in hardcore challenges! - Upgrade your speed, breaking level, and add extra lives! - Make near traffic misses discovering 4 unique locations: Suburbs, Desert, Snow, and Night City - Ride your motorcycle on a highway, interstate, or the autobahn! - Discover plenty of bike tuning options! ENDLESS GAMEPLAY Head out and race as fast as you can to become the new moto rider in the world! Race the traffic and complete the challenges to get real among the competition. Jump on your racing bike and ride on the endless busy roads and highways! Make near traffic misses discovering 4 unique locations: Suburbs, Desert, Snow, and Night City in 4 different modes! Ride your motorcycle on a highway, interstate, or the autobahn. Never forget that riding a motorcycle can be fun, but it can also be dangerous! Roads and highways are full of speeding cars – they can bother you! SELECTION OF HIGH-PERFORMANCE MOTORBIKES Have you ever wanted to ride a motorcycle in real life? Great! It's about time to test your skills and decide on the motorcycle category you would choose – extremely fast superbike, epic chopper motorcycles, or modified high-performance versions of off-road motorcycles! Every bike has its own individual extras: total lives, near miss bonus, high-speed bonus, or wrong way bonus. A TON OF TUNING AND CUSTOMIZATION OPTIONS Go to the garage and select one of the licensed, high-performance motorbikes. Tune your vehicle and customize its appearance. Choose your favorite body color and slap on some well-designed decals! Give your rides your own style. Increase your motorbike's speed, breaking level and add extra lives – these will all have a definite impact on your bike's performance.", "platform": "Nintendo Switch", "release_date": "June 30, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "T-Bull", "publishers": "T-Bull", "genres": "Vehicle Simulation", "max_players": "1", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "https://youtu.be/7Sec6OWUrxY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160577-moto-rider-go-highway-traffic\n"}