{"altername_name": [], "name": "MotoGP 19", "overview": "MotoGP™19 celebrates the passion for motorsports! The official videogame of the most popular motorcycle championship in the world is back with a new chapter full of surprises! OFFICIAL 2019 CONTENT All the adrenaline of the 2019 season right in your hands!Race with all the official riders of the MotoGP™, Moto2™, Moto3™, Red Bull MotoGP™ Rookies Cup classes and the new MotoE™ on 19 different tracks. HISTORIC RIDERS All the passion of the MotoGP™ from the 500 2-strokes to the Modern Era.Access the Historical Challenges mode and relive the most exciting rivalries trough time attacks and specific scenarios to recreate the moments that shaped the history of the MotoGP™. - More than 50 legendary riders - Over 35 bikes - 3 additional historical tracks NEURAL AI Compete with a faster, smarter and more accurate AI based on machine learning that will identify your actions and react accordingly. The best racing experience ever is waiting for you! DEDICATED SERVERS The addition of dedicated servers has made playing online more fun than ever! Challenge your friends in different modes: - Public Lobby: create a fully customisable lobby (number of laps, weather, sessions) or scroll through the list of lobbies available and pick your favourite one; - Private Lobby: create a custom event and challenge your friends; - Race Director: choose the starting grid, give penalties and direct the race! CUSTOMISATION and GRAPHIC EDITORS Free your imagination with new tools and make your rider unique! Create your style by choosing from the most complete selection of accessories and brands ever and have fun with the new graphic editors! Combine fonts and shapes to customise your helmet, lower back patch and racing number or download the ones created by other players! CAREER Designed for all types of players, from rookies to veterans of the series!Choose whether to follow Career and climb the leaderboards, right up to MotoGP™ or to focus on the Pro Career and race like a real pro! BIKE DEVELOPMENT Improve your bike's performance during dedicated tests in Career, working on different technical aspects: - Traction Control System; - Engine Brake; - Anti-Wheelie System; - Engine; - Chassis. Plan your strategy to be the best: just like in a real championship, you have a limited number of new engines and tyres available. The third season of the MotoGP™ eSport Championship is waiting for you. Will you make it to the podium?", "platform": "Nintendo Switch", "release_date": "June 6, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Milestone", "publishers": "", "genres": "Racing", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154012-motogp-19\n"}