{"altername_name": ["MotoGP™23"], "name": "MotoGP 23", "overview": "The official game of the MotoGP™ is back with tons of new developments. Open the throttle, pass your opponents and cross the finish line. Live the dream of being the next champion with the new MotoGP™23, more amazing and challenging than ever! Compete in the three official championship categories MotoGP™, Moto2™ and Moto3™, step into the shoes of your favorite rider and head to the track to experience the adrenaline of the 2023 season. NEW CAREER, NEW CHALLENGES Embark on your path to set the record: make your debut in Moto3™ and depending on your results, climb the rankings and go up a class. In the motorsport world, every decision counts! Influence the trend of a season by planning your career in a way that best suits you. Develop your bike to get increasingly improved performance and also keep the most experienced opponents at bay, win your position on the official team by beating the leading rider, or change teams to prove that what makes the difference is not the bike, but you! Use Social Media during the game to establish relationships between teams and with other riders, but be careful! Any friendly rivalry started in the community will continue on the track. ANYTHING CAN HAPPEN The feature highest in demand is now in the game: dynamic weather will not only make the races more realistic, but also more unpredictable. MotoGP™23 IS FOR EVERYONE Discover the new neural aids system that uses artificial intelligence to intervene in the most critical moments of your race and guarantee you a custom-made experience without taking the control of your bike away from you. Do you want to get ready for the challenges of the 2023 season in the best possible way? Pop over to the MotoGP™ Academy and perfect your performance with specific training for every circuit. NEVER GO UNNOTICED Rider stickers, helmet and number: customize your MotoGP™ experience by using four essential graphic editors and show off a unique style to leave your mark as you cross the finish line!", "platform": "Nintendo Switch", "release_date": "June 8, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "Milestone", "publishers": "Milestone", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=0ebBuFz44LQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370784-motogp-23\n"}