{"altername_name": [], "name": "Mozart Requiem", "overview": "It's 1788 and Mozart is in Prague. He is giving the inaugural showing of his famous opera, Don Giovanni. The plaudits he receives are universal, but very quickly the events that are shaking the capital of Bohemia will take his mind off the music. Far from the footlights, a terrible conspiracy is underway, designed to de- throne Joseph II, Austro-Hungarian Emperor and Mozart's benefactor. Left bereft and manipulated, the musical prodigy finds himself plunged into the heart of a grand conspiracy! With murders, sinister intrigue and occult ceremonies going on all around, only his genius will allow him to get to the bottom of this hideous plot! Join Mozart as he must find his way through 18th century Prague, find the clues and solve the great mystery. Displayed in stunning 3D third per- son, Mozart will need to use all his genius to uncover the various plots, dis- cover how and who has committed various crimes and clear his name be- fore he is charged with Murder! Key Features • Full 3D third person gameplay with portions in first person. • Features the historical city of Prague modeled accurately on period maps. • Actual characters, personalities and intrigue from historical records. • Dozens of puzzles to solve. • Complete dialog development and intelligent conversation while interacting with the characters. • Player must finish writing some of Mozart’s masterpieces to eventually solve who is behind the murders. • Conduct the Prague Symphony as part of the gameplay with a 3D controller. • Features licensed and original scored music of the master Wolfgang Amadeus Mozart. • Designed as the first in a series of “PERSONA INTERACTIVA” products. • Mozart has 24 hours to unravel one of the greatest mysteries ever.", "platform": "Nintendo Switch", "release_date": "September 6, 2022", "game_type": "Released", "esrb": "", "developers": "Hoplite Research", "publishers": "Hoplite Research", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/237597-mozart-requiem\n"}