{"altername_name": [], "name": "Myastere: Ruins of Deazniff", "overview": "There are still ruins in the world that no one knows about.Eliminate the evil that stirs in the depths through investigative action! \"Myastere -Ruins of Deazniff\" is a spring wire action game that explores ruins. Aaurae, a member of a special ruins investigation team, begins her investigation in the vast underground ruins, making full use of her revolver and wire launcher! Collect historical remains \"Relics\" and get closer to the mystery hidden in the ruins! 【Story】 The year is 20XX, in a dark forest in a certain country. In a dark forest in a certain country, the Kingdom's Intelligence Department discovers the source of \"Myastere,\" a magical substance with a miasma that emanates from this world. The Kingdom decided to dispatch the Royal Special Relics Investigation Department, a specialized organization to investigate the source of Myastere. Aaurae=Mawkish, a member of the 3rd Research Department's research team, went to the site to investigate. The high concentration of Myastere causes the animals to go berserk, and modern technology loses its power. In addition, the ruins are being exposed by a group of thieves known as the \"Deazniff\". Seeing the devastation, Aaurae can feel her heart burning a little. Shaking off the hardships that came her way, he continued her investigation. Deep underground, the ruins of a different civilization spread out. The revolver and wire, cast in the age of mythology, shine brighter as if it helps Aaurae. Thwarted by the deepening mystery and the Myastere that consumes the world. Aaurae still doesn't know about the shadow of the \"Holy Order,\" which has fallen and is no longer mentioned in the official history. 【Features】 ◆Metroidvania-style action with revolvers and wires that will keep you on the edge of your seat! ◆Switch between multiple ammunition and weapons to fight enemies and to pass traps to strategically advance your investigation! ◆A steampunk and ruins investigation story with a cool protagonist and full voice acting throughout! ◆There are many grimoires, relics, and key items to acquire skills. Aim for full completion! ◆The story will change depending on the order of the areas you investigate. What will happen to you?", "platform": "Nintendo Switch", "release_date": "April 15, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Studio Saizensen", "publishers": "Digimerce", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155958-myastere-ruins-of-deazniff\n"}