{"altername_name": [], "name": "NASCAR Heat: Ultimate Edition+", "overview": "NASCAR Heat Ultimate Edition+, the official video game of the 2020 season, the world’s most popular stockcar racing series puts you behind the wheel and challenges you to become the NASCAR Cup Series champion. Features the 2020 official teams, drivers, cars and schedule from the three NASCAR National Series as well as the Xtreme Dirt Tour, racing on 39 authentic tracks. Ultimate Edition+ includes everything in NASCAR Heat 5 Ultimate Edition, plus the 2021 NASCAR Cup Series Cars Roster and 2021 primary paint schemes. Featured content includes 2020 Throwback and Playoff paint schemes, Tony Stewart as a playable character, plus more! FEATURES: • Career Mode – Progress through the feeder series (Xtreme Dirt, Gander Trucks and Xfinity Series) to reach the NASCAR Cup Series or jump right in and start at the top. • Improved Stats – Track your progress through the Career with more detailed and improved statistics offering far more insight. • Gameplay Enhancements – Improved AI, more player camera options and DNFs. • Brand-new Testing Mode – Perfect your racing lines and experiment to find the best car setup for each track. • Challenge Mode – Brand-new Online Challenge Mode gives you unique race scenarios to complete with a variety of gameplay. • Official Tracks – 39 authentic tracks for you to race on across the various series, including Daytona International Speedway, Indianapolis Motor Speedway, Indianapolis Motor Speedway road course and Talladega Superspeedway, plus 9 dirt tracks. • Multiplayer – Race online with up to 16 players or enjoy local split-screen multiplayer with a friend. • Paint Booth – Even more enhancements, including new number fonts and schemes.", "platform": "Nintendo Switch", "release_date": "November 19, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "704Games Company", "publishers": "Motorsport Games", "genres": "Racing", "max_players": "16", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156699-nascar-heat-ultimate-edition\n"}