{"altername_name": [], "name": "NBA 2K18", "overview": "FEATURES RUN THE NEIGHBORHOOD The future of sports career modes has arrived, allowing you to play the game the way you like. Build your career in NBA games, hit the courts in The Playground Park, join the Pro-Am circuit, or explore the shops and venues in an all-new open neighborhood setting. Featuring new MyPLAYER upgrade and endorsement systems, our biggest cast of characters to date including NBA players, and so much more. The Road to 99 The overarching meta-game that rewards users for improving their MyPLAYER’s overall rating, regardless of which modes they choose to play. Featuring a unified badge system across Pro-Am, Park and your NBA journey in MyCAREER, your attributes, animations and badges all combine to define your play style on your road to a 99 overall rating. Updated Create A Player Create the MyPLAYER you want, whether scanning your face with the MyNBA2K18 mobile app or building something custom using our preset options. Hairstyles have been updated with numerous new options to choose from, and body weight and height are more accurately represented to ensure the unique look you want for your MyPLAYER. MyTEAM Collect player cards featuring NBA legends from yesterday and today, and compete in a variety of online and offline modes. Super Max Construct a salary-capped team and compete against other users of similar ability in a new season mode. With a limited salary cap to distribute among 13 players, you’ll have to be strategic in selecting your lineup for each round. Prizes are awarded based on your performance each round, ensuring that every game matters. Pack & Playoffs An all-new draft mode that challenges you to build the best possible 5-man team from packs you’ll open before each round. Compete against other users’ drafted teams and advance to earn better prizes. With Pack & Playoffs, it’s a new lineup and a new experience every round. Schedule Challenges Play through a 30 game schedule for each of the 30 NBA teams. Earn MyTEAM points and prizes as you work your way through 900 unique challenges based on the 2017-18 NBA schedule. ELITE GAMEPLAY New Motion System The new motion system brings player control to a new level of realism. Now, dribbling and off the ball movement are no longer driven by animations. This groundbreaking technology dynamically creates animations to deliver the best gameplay experience possible. You are now in complete control. Improved Shot Meter Hit shots more consistently thanks to an improved shot meter, featuring multiple feedback points for more precise shot timing. GRAPHICS & PRESENTATION Improved Player Accuracy Countless hours of work have been put in to make every NBA player look and feel like their real-life counterparts, down to the smallest details including scars, stretch marks, and even faded tattoos. The player body system has been completely redesigned to accurately match the physique of every player in the league, and player faces have been rebuilt from scratch to show more details and respond more realistically to light. Laser Scanned Uniforms & Accessories Laser scanned uniforms from all 30 NBA teams accurately depict each design down to the smallest stitch. Using True Color Technology, team colors have never been more pure & authentic, and whites have never popped so brightly. And with the overhauled player body system, uniforms fit accurately for each specific body type. To round out the complete on-court look of an NBA player, users will enjoy the largest collection of scanned shoes and accessories in NBA 2K history. Special Guest Commentary The biggest roster of broadcasting talent in sports videogame history gets even bigger. Future Hall of Famers and former NBA 2K cover athletes Kobe Bryant and Kevin Garnett join the booth on a rotating basis to lend their expertise to the broadcast, bringing the total number of in-game broadcasters to 13. LEGENDARY TEAMS All-Time Teams The greatest players in NBA history from all 30 teams, together on All-Time franchise rosters for the very first time. Compete in Play Now to find out which franchise’s All-Time Team reigns supreme, or challenge all 30 All-Time Teams in MyTEAM’s All-Time Domination mode. Classic Teams Play with 62 of the NBA’s greatest teams from the past, including 17 new additions. Pit your favorite classic roster against current NBA teams, replay epic Finals matchups, find out if Shaq & Kobe can compete with the great Lakers teams of the past, or matchup the ’97-98 Bulls against the ’15-16 Warriors to settle the argument once and for all. The possibilities are endless. MyGM/MyLEAGUE MyGM: The Next Chapter For the first time in a sports game, MyGM introduces a narrative-driven, story-based franchise experience that maintains all of the user control and team building aspects that fans have come to love over the years. Your path will be determined by the choices you make and the answers you provide at many key points in the narrative. Make the story your own, and build a winner! MyLEAGUE 2K’s fan-favorite franchise mode allows users complete customization over their league. Choose the number of games and teams, adjust the league settings, and apply your custom setup to a single season, multi-season or online experience. Or, skip the regular season and jump right into to the Playoffs. True-To-Life League Structure & Rules Both MyGM and MyLEAGUE feature numerous updates to match real-life NBA rules, including many from the new Collective Bargaining Agreement. Negotiate player contracts that work best for your franchise and each player, including Super Max & “Bird Rights” deals for elite players, Over-38 contracts for older players, and two-way contracts for younger players. Manage your roster by using the Stretch Provision to minimize the Salary Cap when you waive a player, or develop younger talent in the G-League or by stashing them overseas. Simply put, the most detailed and authentic franchise experience on the market puts you in the hot seat as an NBA GM like never before.", "platform": "Nintendo Switch", "release_date": "September 19, 2017", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Visual Concepts", "publishers": "2K Sports", "genres": "Sports", "max_players": "10", "cooperative": "Yes", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/NBA_2K18", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/101540-nba-2k18\n"}