{"altername_name": [], "name": "NeverAwake", "overview": "\"NeverAwake\" is a nightmarish twin-stick shooter with a unique worldview and original game rules. The girl fights against vegetables, dogs, school friends, and other things she hates. What does the girl see at the end of the battle? And will she be able to wake up? ■About NeverAwake \"NeverAwake\" has a unique worldview with its high quality hand-drawn graphics and beautiful animations. The enemies are not demons...but vegetables and dentists that the girl hates. Things and creatures that everyone has had a bad experience with at one time or another become monsters and attack the protagonist \"Rem\". With over 80 levels, dozens of bosses, and a unique gameplay system that allows players to retry many levels, NeverAwake is suitable for both beginner shooters and experts. Combine a multitude of weapons and accessories to fight off the monsters in your nightmares. The ending of this title will change depending on the player's dedication. Please play and see what the girl sees at the end of the battle. ■Features ・Kick the veggies, dentists, and other monsters out of the way and blow away the painful memories of your childhood! ・A unique world view set in the \"inside of a girl's nightmare\" ・Beautiful hand-drawn graphics and animations ・Unique game rules and high retryability ・Fast-paced gameplay and powerful boss battles ・More than 80 levels and dozens of tricky bosses ・Numerous weapons and accessories, and builds that combine them ・Great storytelling and multiple endings", "platform": "Nintendo Switch", "release_date": "January 19, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Neotro Inc", "publishers": "Phoenixx", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.62", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=N0HD3hnqmMU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168800-neverawake\n"}