{"altername_name": ["New Pokemon Snap"], "name": "New Pokémon Snap", "overview": "Photograph Pokémon in their natural habitats as you adventure through unknown islands! Seek out and take in-game pictures of Pokémon in their native environments in the New Pokémon Snap game, only for the Nintendo Switch system! You'll even discover behaviors and expressions you've never seen before when you encounter and research lively wild Pokémon. Explore environments, take in-game pictures and fill your Pokémon Photodex Travel to unknown islands with beautiful scenery like lush jungles and sandy beaches. The Pokémon pictures you take there will be used to build your very own Pokémon Photodex! This brand-new game brings the gameplay of the 1999 Pokémon Snap game for the Nintendo 64 system to life on the Nintendo Switch system with unknown islands to discover and different Pokémon to see! Photograph lively wild Pokémon in their natural habitats as you research and explore unknown islands. Journey through a variety of environments such as beaches and jungles to capture previously-unseen Pokémon behaviors. The photos you take can also be used to fill out your very own Pokémon Photodex! See a different side of Pokémon in a new photo-snapping adventure, only on Nintendo Switch Research various Pokémon in their natural habitats and capture Pokémon behaviors that you’ve never seen before Explore unknown islands with scenery like lush jungles and tropical beaches throughout your journey Take in-game photos to make your very own Pokémon Photodex", "platform": "Nintendo Switch", "release_date": "April 30, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "Bandai Namco Entertainment", "publishers": "Nintendo", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.33", "wikipedia": "https://en.wikipedia.org/wiki/New_Pok%C3%A9mon_Snap", "video_link": "https://youtu.be/Mq8Kn6mhUxA", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/147704-new-pokemon-snap\n"}