{"altername_name": [], "name": "NEW Joe & Mac: Caveman Ninja", "overview": "Back to the past, we're landing in prehistorical time! Dive back into Joe & Mac's adventures, the quirky duet ready to smash everything ontheir way to save their village, even dinosaurs! We’re back in the distant Past, when “Rock & Roll” was just about rocks and “Fast food”, a dinner that you couldn’t catch. 2 cave dudes named Joe & Mac live in a peaceful and cool village. Cool it was, until a bogus bunch of Neanderthal snatched all the village’s women. It’s now up to Joe & Mac to save them all, and fight against deadly dinosaurs and carnivorous plants in this crazy and colorful action-platformer from Jurassic time, with completely redesigned graphics! The HD version of this famous arcade game is still fun and quirky, but also longer, better, faster, stronger… - A BRANDNEW DESIGN: Experience a full and faithful remake of the arcade original game with new graphics, new sounds, and better control for an unprecedented experience - NEW MODES: 2 modes are at the menu, the arcade Mode (Remake) and an extended mode that will bring you a longer game experience. - CO-OP MODE: one pre-historical dude may not be enough, ask a friend to play with you to share a stronger adventure. - EACH MODE WILL HAVE NEW FEATURES: a training mode, a boss rush mode, a score attack mode and, to play faster than ever, a speedrun mode ! ALL these features FOR A funny, colorful, and quirky GAME, and A challenging and full of content GAME FOR ALL kind of players", "platform": "Nintendo Switch", "release_date": "November 24, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Microids", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=Lkg1IBf__kk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167692-new-joe-mac-caveman-ninja\n"}