{"altername_name": [], "name": "Nightmare Reaper", "overview": "This retro-inspired FPS with looter shooter and rogue-lite elements breaches the wall between classic and modern gameplay. “Nightmare Reaper is a thrilling, gory, blast-from-the-past that hits all the right spots.” - Screen Rant \"Nightmare Reaper has a creative story, punchy edge-of-your-seat action and a deep, entertaining arsenal. This is one bad dream you won't regret ripping and tearing your way through.\" - Gaming Nexus A dark and violent meld of retro and modern action games, inspired by the classic 2.5D first-person shooters of the 90s, with elements of modern looter shooters and roguelites. Intense and addictive gameplay Tons of enemies are crammed in open-ended levels full of surprises, geysers of blood, and treasure. You rise to prevent her doom and duke it out with nightmares to reap salvation in blood. FEATURES: ▪ That’s progress! - Use the gold you find to purchase tons of character upgrades and new abilities via minigames. ▪ Choice Paralysis - Gather 80 unique weapons containing a funky mix of attributes randomized from over 30 enchantment types. ▪ Necrotic Optimism - Unleash carnage to the tune of music and audio by the great Andrew Hulshult. ▪ Memory Hole - Uncover a non-intrusive but mysterious story. ▪ More Than a Nightmare - Explore many game modes, and pick the one you like. ▪ Dream Logic - Progress through the nightmarescapes that mix manual and random level generation. ▪ Digging Up Memories - Enjoy tons of random events and find all the secrets. ▪ Soundtrack by the great Andrew Hulshult.", "platform": "Nintendo Switch", "release_date": "May 18, 2023", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "Feardemic", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369134-nightmare-reaper\n"}