{"altername_name": [], "name": "Nintendo Labo: Toy-Con 03: Vehicle Kit", "overview": "Nintendo Labo is an immersive experience kit in which the consumer is required to make pre-designed creations from the accompanying cardboard parts. After it's creation, each item has its specific (mini-) game accompanied on the Nintendo Labo Vehicle Kit Software that's packed inside. Additional experiences can be accessed via the online community, providing alternative game-play experiences using the standard Labo parts or creative solutions of the community itself, by using non-provided card-board pieces. The creations that can be made with the vehicle kit can be used in a virtual explorable world by air, sea and land and consist of: Toy-Con Car: Assembly of the available parts creates a steering wheel with indicators and gear shift, which needs one of the Joy-Cons. Also included is a pull-ring for stunts and acrobatics. The whole set-up controls the car on-screen Toy-Con Plane: Assembly of the available parts creates a joy-stick which controls the pitch, yaw and roll of the controllable airplane on-screen. One of the Joy-cons is needed. Toy-Con Submarine: Assembly of the parts creates the main steering house of the submarine, which controls the main movements of the submarine and it's grappling hook on-screen. One of the Joy-cons is needed Toy-Con Pedal: Assembly of the parts creates a gas pedal, with help of one of the Joy-Cons, which can be used to control a car on screen Toy-Con Key: A Joy-con in a simple housing to activate and act like a start key for any of the above vehicles. This Vehicle kit also can be used to connect and interact with Mario Kart 8 Deluxe to control every vehicle type in the game. Only the Car, Pedal and Key are needed.", "platform": "Nintendo Switch", "release_date": "September 14, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Education", "max_players": "2", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/Nintendo_Labo#Vehicle_Kit", "video_link": "https://youtu.be/JPngtzn_UYo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/143115-nintendo-labo-toy-con-03-vehicle-kit\n"}