{"altername_name": [], "name": "Nintendo Labo: Toy-Con 01: Variety Kit", "overview": "Nintendo Labo is an immersive experience kit in which the consumer is required to make pre-designed creations from the accompanying cardboard parts. After igs creation, each item has its specific (mini-) game accompanied on the Nintendo Labo Variety Kit Software that's packed inside. Additional experiences can be accessed via the online community, providing alternative game-play experiences using the standard Labo parts or creative solutions of the community itself, by using non-provided card-board pieces. The creations that can be made with the variety kit are: Toy-Con RC Car: Using the Switch control screen to power the player's RC Car, controlled by vibrations in the Joy-Con controllers and guided along a magnetic path using the IR motion camera in the right Joy-Con controller. Toy-Con Fishing Rod: Using the Switch control screen as a cinematic ocean setting, a mini-game which sets the player on a ocean fishing trip and attends the player on a catch by vibrating rigorously. Toy-Con House: Using the Switch control screen to display an house's interior, with a mystical creature inside. The player can interact with it by playing and feeding it. Other interactions include titlting the house and re-arranging the interior. Toy-Con Motorbike: The cardboard stencils form the handle-bars of a dirt-bike. One of the Joy-Cons inserted in the right handle-bar, acts as the throttle. The Switch control screen displays the track from a third-person perspective and let's the player ride along a rally-cross track. Toy-Con Piano: Interacting with the piano, one can play and record various compositions.", "platform": "Nintendo Switch", "release_date": "April 20, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo", "publishers": "Nintendo", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Nintendo_Labo#Variety_Kit", "video_link": "https://youtu.be/LWjHVVDpg48", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/143114-nintendo-labo-toy-con-01-variety-kit\n"}