{"altername_name": [], "name": "Nocturnal", "overview": "Are you prepared to awaken the Guardian of the Enduring Flame that resides within you? Nocturnal is an intense action-adventure hack and slash game. Players will assume the role of Ardeshir, the valiant soldier of the Enduring Flame, who embarks on a perilous journey to reclaim his home island of Nahran from the engulfing Darkness that has seized it. A mysterious and foreboding Mist veils the island, presenting both a threat and an opportunity for those brave enough to explore its secrets. To save Nahran, players must wield the power of fire, a force capable of repelling the deadly Mist, unveiling hidden paths, and unlocking potent abilities. Every choice matters as you fight to illuminate the darkness and restore the island to its former glory. Features: • Dynamic Protagonist: Step into the shoes of Ardeshir, a warrior with a fiery spirit and a destiny to fulfill. • Rich Lore: Delve deep into the rich and vibrant lore that surrounds Nahran and its mysterious Mist. • Fire Wielding Mechanics: Utilize fire as both a weapon and a tool to carve your path through Nahran. • Challenging Enemies: Face off against a wide variety of enemies, each presenting unique challenges that test your combat skills. • Mysterious Mist: Navigate through areas enveloped in the mysterious Mist, unveiling secret locations and gaining powerful abilities. • Phoenix Statues: Discover Phoenix statues scattered across the island, offering new abilities and stat boosts through offerings of ashes collected from defeated enemies and explored environments. • Ability Enhancement: Enhance Ardeshir’s abilities as you progress through the game, adapting your playstyle to the ever-evolving challenges. • Resource Management: Collect and strategically manage resources to improve your chances of survival in the harsh environment of Nahran. • Immersive Soundtrack: Lose yourself in the evocative soundtrack, composed to enhance the game’s atmospheric settings and pivotal moments Speed-Run Mode: • Timed Challenges: For players seeking an added challenge, the Speed-Run mode offers timed challenges encouraging rapid completion of the game’s stages. • Leaderboards: Compete with players around the world, climbing the leaderboards as you hone your speed-running skills.", "platform": "Nintendo Switch", "release_date": "June 7, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Sunnyside Games", "publishers": "Dear Villagers", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=UdFGqIsXFmQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372027-nocturnal\n"}