{"altername_name": [], "name": "NOT A HERO: SUPER SNAZZY EDITION", "overview": "Professional assassin turned amateur campaign manager Steve is charged with cleaning up the city by an anthropomorphic rabbit and mayoral candidate from the future named BunnyLord. Now Steve and his expanding roster of dubious heroes must wield their unique skills to shoot, slide, dive, and take cover behind a political platform built on ethics, accountability, and an inordinate amount of gunfire. Eliminate the criminal underworld of the city’s three major districts and persuade undecided voters to your cause, tackling the issues that matter by putting a gun in the mouth of those issues. Through the power of ISO-Slant™ technology and a wasted youth, London-based developer Roll7 (OlliOlli) delivers the greatest 2¼D cover-based indie shooter of all-time, ever. Next Level Shootouts – Use reasonable force unreasonably in a dynamic mix of run-and-gun gameplay and cover-based shootouts. The intuitive quick-snap cover system lets you slide, roll, and dive into cover, dodging enemy fire before fighting back with tackles, executions, and 100s of bullets. Roster of Not Heroes - Select between 9 different heroes, each with their own distinct gameplay style and crime murdering abilities. Blast the city’s scum through doors with Cletus’ a shotgun, slice them in half with Kimmy’s katana dash, or simply bash crime in it’s terrible face with Ronald’s hammer. Dynamic Missions – Go ham on primary objectives and (sometimes random) secondary goals but be prepared for unexpected mid-level events that turn the tables on the anti-heroes in an instant. SWAT teams, gun-toting elderly, helicopter gunships, pandas, pugs and suicidal samurais stand between you and victory.", "platform": "Nintendo Switch", "release_date": "August 2, 2018", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "Devolver Digital", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwiG1YuO-Nr2AhVKT98KHUCJBjEQFnoECAoQAQ&url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FNot_a_Hero&usg=AOvVaw3nSm-CvyVK2-5xp_8qZHQO", "video_link": "https://youtu.be/-nsqCMxsGGs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160562-not-a-hero-super-snazzy-edition\n"}