{"altername_name": [], "name": "Nuclear Blaze", "overview": "Nuclear Blaze is a dynamic 2D Action game in which the player plays as a firefighter air-dropped in the middle of a mysterious burning facility. A huge fire is raging and you are sent on the spot to stop it. Business as usual for a highly-trained and experienced firefighter such as yourself. Air dropped right in the middle of this blazing inferno, your main mission objectives are to contain the fire, investigate its causes and look for survivors. The unexpected discovery of a secret military facility is quickly going to send a monkey wrench in your plans. Unravel the truth behind the existence of Site 16 and A-█████. Access to that information may require authorization clearance ████ and ██ though… In addition to the game’s main mode, Nuclear Blaze also includes a special Kid Mode created with younger players (aged 3 and up) in mind. This mode has its own specific - and easier - levels, an immortal hero, simplified controls (with auto-aim) and tons of helicopters and trucks! Nuclear Blaze’s console version also includes the “Hold my Beer” Mode which adds hidden areas in all levels as well as new threats that require a more precise and tactical approach. On consoles, gamers will get the complete Nuclear Blaze experience! Features -Unique 2D firefighting game -Smooth controls and gameplay mechanics -Beautiful pixel art graphics -Finely tuned difficulty settings -Kid Mode with special levels and controls created for younger players -“Hold my Beer” Mode adding hidden areas as well as new threats and tactical elements -Hidden cats to save", "platform": "Nintendo Switch", "release_date": "April 28, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Red Art Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368667-nuclear-blaze\n"}