{"altername_name": [], "name": "Oddworld: Soulstorm", "overview": "As 300 freshly liberated slaves celebrate their escape from the industrial megacomplex of RuptureFarms, a new menace rises. They will soon discover that, although their physical bonds were broken, they are far from free. Join the revolution as you guide their saviour, Abe, on an almost impossible journey to uncover the truth behind the generations of disinformation and misleading news that have brainwashed his people. Scavenge for items and craft powerful tools, arm your followers and choose to attack the enemy head on or to take a stealthier approach to unlocking each of the four possible endings to this epic tale. Will Abe find a way to heal his friends and finally win their freedom? What other horrors will they uncover on their deadly journey through dusty canyons, abandoned mines, immense container yards and cavernous train terminals? Is this merely the next step towards liberation or is it really the end of the line? Only you can give them the hope they need to find out. Action-Adventure Platformer: Evolving the platforming genre by adding RPG-lite elements with player agency to play as they like, whether aggressively or passively. Narrative: A dark storyline with a twisted sense of humour that shines a light on the ironies that exist in the human condition. 2.9D: Epic environments with massive scale to explore by going into the world, rather than being limited to the traditional side scrolling platformer sense. Quarma (think Karma): Quarma is a real time feedback feature that reflects your actions in the game and your actions will influence the outcome of the game. Scavenger’s Economy: Pickpocket enemies, loot lockers, sift through trash cans to acquire resources. Exchange them at vending machines to get products that give you more agency in how you chose to conquer the game’s many challenges. Crafting: Use scavenged resources and vending machine products to craft items to use as weapons or tools against characters and obstacles. Strength in Numbers: The more followers you save, the stronger the uprising becomes. Gift crafted items to followers. It’s up to you to decide whether they will be aggressive or passive. Gameplay: A 2.9D action adventure platformer. First time playthrough is 15 hours. Achievement hunters and perfectionists can easily play for dozens of hours. Leaderboards: All levels offer a tallying system, leaderboards, achievements and badges.", "platform": "Nintendo Switch", "release_date": "November 8, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "Oddworld Inhabitants", "publishers": "Microids", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Oddworld:_Soulstorm", "video_link": "https://www.youtube.com/watch?v=6LooOHLWKDw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166563-oddworld-soulstorm\n"}