{"altername_name": [], "name": "ONI: Road to be the Mightiest Oni", "overview": "Are you ready to face the trials and emerge as the Mightiest Oni? In ONI: Road to be the Mightiest Oni, delve deep into the mystical realms of Kisejima Island, where the borders between the physical and spiritual worlds blur. Assume the role of Kuuta, the sole survivor of the Demon King's army, accompanied by his spirit partner Kazemaru. Embark on a one-of-a-kind action-adventure quest to unlock dormant powers and become the mightiest Oni in this incredibly immersive game crafted with vibrant and unique artwork by KENEI DESIGN. Features: • Unique Co-op Action: Control both Kuuta and Kazemaru, utilizing their unique abilities in tandem to overcome challenges and defeat enemies. • Spirit Battles: Engage in battles where Kazemaru extracts spirits from enemies for Kuuta to conquer, adding a fresh twist to combat dynamics. • Challenging Terrains: Navigate through Kisejima's three distinct areas, each offering different challenges and opportunities to grow stronger. • Dynamic Growth: Choose from a variety of leveling up methods, including evading monsters in adrenaline-fueled tag games or gathering clusters of mushrooms to upgrade your weaponry. • Mystic Kisejima Island: Explore the small yet mystical island, a place rich with history and ancient demons ready to test your might. • Epic Backstory: Unravel Kuuta's legacy as the last of the demon warriors, set in a land where legends of battles with Momotaro reverberate. • Engaging Characters: Kuuta: Step into the shoes of a determined demon warrior wielding a mighty club, ready to carve out a path of victory. Kazemaru: Partner with the enigmatic spirit Kazemaru, with the unique ability to manipulate and destroy enemy spirits. • Captivating Artwork by KENEI DESIGN: Traverse beautifully designed landscapes, from dazzling meadows to ominous forests, brought to life by the solo creator behind KENEI DESIGN. Gameplay Modes: • Solo Adventure: Play through an epic narrative filled with trials and discoveries, immersing yourself in the rich lore of Kisejima Island. • Co-op Play: Join forces with a friend to take on the trials together, mastering the unique abilities of both Kuuta and Kazemaru for a collaborative gameplay experience. • Additional Features • Escort Missions: Protect and guide valuable assets safely across the island's perilous landscapes. • Weapon Upgrades: Enhance Kuuta's club with the help of resources found throughout the island, tailoring it to your fighting style.", "platform": "Nintendo Switch", "release_date": "March 9, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Kenei Design", "publishers": "Clouded Leopard Entertainment", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=NLyFEQbiuIg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/367762-oni-road-to-be-the-mightiest-oni\n"}