{"altername_name": [], "name": "Overwatch: Legendary Edition", "overview": "The Future Is Now. Are You With Us? Overwatch: Legendary Edition includes: • The full game • 5 Legendary Hero Skins • 5 Epic Hero Skins • 5 Origin Hero Skins Begin your Watch Join the fight for the future in the world of Overwatch® and choose your hero from a diverse cast of soldiers, scientists, adventurers, and oddities. Bend time, defy physics, and unleash a dizzying array of extraordinary powers and weapons. Engage your enemies in iconic locations from around the globe in the ultimate team-based shooter. Experience the Extraordinary Speed up and slow down time. Rain destruction from above in an experimental, jet-powered armor suit. Stalk your prey as a wraith-like assassin that can appear anywhere, anytime. Unleash powers such as Dragonstrike, Transcendence, Graviton Surge, and so much more. Every hero has a unique set of devastating, game-changing abilities. Play Heroes, Not Classes Every hero has a unique perspective on the battlefield and a story behind how they arrived there. You are a champion of a bygone age wielding his punishing rocket hammer in the service of honor, a robotic monk committed to healing the rifts between man and machine, a genetically engineered gorilla who also happens to be a brilliant scientist, and many, many more. Fight for the Future...Together Teamwork is imperative for survival as you enter the fight with friends and comrades. Careful coordination will prove the difference between victory and defeat as your team combines the formidable powers at your disposal to devastating effect. Shift Your Perspective Just when it seems like your team is destined to go down in defeat, switch heroes on the fly and change the course of the battle. But don’t forget that your opponents can do the same. Master the game within the game as both teams shift strategies and change heroes to try to gain the upper hand. The World Is Your Battlefield Protect the secrets of the mysterious Temple of Anubis in Egypt, safely escort an EMP device through King’s Row in London, and do battle at many other unique locations. Every map has its own distinct feel with unique gameplay and team-based objectives.", "platform": "Nintendo Switch", "release_date": "October 15, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Blizzard Entertainment", "publishers": "Blizzard Entertainment", "genres": "Action", "max_players": "12", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130421-overwatch-legendary-edition\n"}