{"altername_name": [], "name": "Part Time UFO", "overview": "Part Time UFO is a physics-based puzzle video game developed and published by HAL Laboratory. It was released for Android and iOS in Japan on November 14, 2017 and worldwide on February 26, 2018. An expanded port with new features was released for Nintendo Switch, published by Nintendo, on October 28, 2020 In Part Time UFO, players control a sentient UFO named Jobski, who resembles a small flying saucer and is equipped with a large claw similar to a UFO catcher. The player can choose between several missions, presented as part-time jobs Jobski can take on. Each job involves using the claw to grab and lift objects, then carrying and placing them into designated areas. These include such tasks as placing a farmer's produce in his truck, organizing cheerleaders into a pyramid, or helping a museum curator reconstruct a dinosaur skeleton. Specific objects will blink to indicate they are required to complete the job, with an on-screen counter showing how many required objects still need to be placed. Many puzzles require careful weight distribution when placing objects, as uneven structures will collapse under their own weight and will need to be reconstructed. The weight of an object can also affect Jobski's flight, making it difficult to carry without dropping it or bumping into other objects. Each job must be completed within a designated time limit to receive bonus points, with the remaining time increasing slightly when an object is placed in the score zone. Once all objects have been placed, the game will test the structure to see if it can stand under its own power for five continuous seconds; if it does not collapse, the job is completed. Each job also has three bonus objectives the player can complete: one for finishing within the time limit, and two additional tasks that vary with each job, such as placing objects in a specific order or adding an optional object to a structure. Upon completing a job, players are scored based on their remaining time and the number of bonus objectives completed, and earn money based on their score. Money can in turn be spent on costumes that alter Jobski's appearance, including one based on Qbby from the BoxBoy! series. Several costumes also give Jobski a special ability that can affect gameplay when worn, such as faster movement speed or the ability to more easily carry heavy objects. Players also earn medals from each bonus objective completed, which are used to unlock new jobs and special costumes that cannot otherwise be purchased. The Nintendo Switch version of the game adds several new features. In \"Treasure Island\" mode, players are given a limited time to explore an ancient ruin and retrieve all the treasure contained within. In \"Tower of Infinity\" mode, players are constantly given new items to stack and must attempt to create the tallest tower possible without letting it collapse. The Switch version also includes three additional jobs, a second more difficult variant for each job, support for two-player cooperative play, and an achievement system called \"Feats of Glory\" that unlock animated illustrations.", "platform": "Nintendo Switch", "release_date": "October 28, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "HAL Laboratory", "publishers": "Nintendo", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Part_Time_UFO", "video_link": "https://www.youtube.com/watch?v=KJgs0lAWZ3I", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155148-part-time-ufo\n"}