{"altername_name": [], "name": "Party Hard 2", "overview": "Welcome back to the extended Party Hard universe! Choose from hundreds of ways of dealing with noisy partygoers, incidentally destroy a drug syndicate, and save the Earth from an alien invasion. May the chickens be with you! You just want to get some sleep... But it's 3am, and once again your neighbors are having a loud party. You have to finally put an end to it–by any means. The craziest party stopping stealth-strategy game is back! Party Hard 2 stays true to its crazy party crashing roots while introducing tons of shiny features: • Dozens of new traps including combos: use different substances that react with each other. Why not set a chain reaction with water and electricity? • 4 playable characters with entirely unique play styles, stats, and abilities! • 14 sprawling levels featuring 2 boss fights • 27-track OST • Brand new crafting system and dozens of items to combine: why not a lighter and a can of gasoline? • Take out multiple targets simultaneously with the powerful Multi-Kill ability! • Scan the room for targets and useful objects using Party Vision! • Interact with NPCs: get an NPC drunk, bribe punks, or make someone pee their pants in fear! • Different objectives that match your playstyle! It's your call if you want to choose only objective-sensitive non-civilian targets. Killing everyone works, too. Your playstyle may effect the progression of the game, specifically unlockables. • Local co-op is back! Stop parties, with a friend! • Brand new 3D visuals and lighting effects • An intriguing story of vengeance and redemption. Yes, with a twist and a fugitive circus bear.", "platform": "Nintendo Switch", "release_date": "September 8, 2020", "game_type": "Released", "esrb": "M - Mature", "developers": "Pinokl Games", "publishers": "tinyBuild", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=eVtFckioqjk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160388-party-hard-2\n"}