{"altername_name": [], "name": "Pig Eat Ball", "overview": "INSANE, Action Adventure about eating, getting fat, and barfing on things. Fight, eat, and solve your way through 200+ action levels using amazing, neo-arcade gameplay! King Cake, the dessert-headed monarch, has decided it’s time for his daughter to get married, but she other plans! The King has devised “The Royal Games” in which the winner will marry Princess Bow. Since she can’t talk her father out of it, Bow decides to put on a disguise and enter the competition herself. Along the way, she discovers a nefarious plot that threatens all life aboard the Space Station Kingdom. Can she get to the bottom of things before it’s too late… and win the Royal Games at the same time? TWISTED ARCADE GAMEPLAY Get bigger as you eat. Barf to squeeze down to size. Barf on anything that moves. Reap the rewards. EXPLORE INTRICATE WORLDS Giant interconnected overworlds are filled with strange life, and secret rewards. Travel to five completely unique areas including Sushi Gardens, Kitchen Chaos, and Astro Farm. HAND-CRAFTED CHALLENGE Each hand-made, non-procedural level has a unique hook or puzzle from dodging alien bulls, spitting bombs, eating flying pies, or bowling while on conveyor belts—there’s always something new. MASSIVE, WILD BOSSES Nearly a dozen bat-barf crazy bosses will be coming your way. How will you beat the Accordion Centipede? Or a living pile of nachos? Use your BRAIN, your SKILLS, and your MOUTH! INCREDIBLE SOUNDTRACK Amazing tunes to get you into this surreal world! ONE-OF-A KIND POWERUPS Throughout the Space Station Kingdom there are dozens of special Disguises. These look cool and also give you special abilities! Each Disguise has a Pro and a Con. Swap Disguises to find the best one for each situation. OPEN-ENDED ANTICS Charming Pillbugs roam these space stations. They may want to play a nice game of tennis, or may steal your balls! Watch out for their lawn darts, bombs, flying pies, and tractors! Barf on them, bump them, torch them, or knock them into open space. Don’t worry they can hold their breath a long time! HOURS OF ADVENTURE The main story is 8-12 hours alone on the first playthrough. Getting the “Gold Medal” for quick completions on each level opens a special CHALLENGE SECTION in each world! WILD CHARACTERS Talk to dozens of interesting aliens on your journey including Cupcake people, Scrounger Goblins, sentient shrimp, and of course your insane father King Cake. MANIC MULTIPLAYER MAYHEM The 4-player, OFFLINE couch competitive mode is the definition of PARTY TIME. Dozens of custom levels give you a variety of goals to compete to win. Casual and Hardcore players can boost it out, bumping bums, barfing blobs, and belching balls!", "platform": "Nintendo Switch", "release_date": "October 18, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Mommys Best Games", "publishers": "Mommys Best Games", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156464-pig-eat-ball\n"}