{"altername_name": [], "name": "Pixel Cup Soccer: Ultimate Edition", "overview": "With fast-paced gameplay, Pixel Cup Soccer is just the fun part of soccer! Play it alone or locally with up to 8 friends, you can choose whether to play competitively, cooperatively, or even both! It features great pixel art and soundtracks that evoke nostalgia of the glory days of the 80s and 90s arcade games. Move, pass, and shoot the ball to victory! You will learn to play in one minute, but it takes much longer to master it. The simple controls enable a rich set of features such as charging and aiming your shots, directing your corner kicks and throw-ins, shooting lobs, slide tackles, and more. Play Modes: Friendly Match Competitions Career Mode Party Mode Penalty Kicks Features: Simplified controls for casual players. Simple to pick up and enjoy, with clean and challenging gameplay. Retro-style art resembling old games and evoking nostalgia. Women’s Soccer. Penalties, Free Kicks. Fouls with injured players, yellow and red cards. Career Mode: Build your own team from the ground up. Climb to the top. Play leagues D, C, B, A, Country Cup, International Cup and become the Champion in the Club Global Cup! The Board of Directors of the club has put you in charge of the important decisions of the Club! You will be the General Manager and Coach of the club. The teams can be fully customized (name, players, shirt colors, club flag, etc.) Competitions: Global Cup and Women's Global Cup American Cup and European Cup Global Cup 1930 (evoking the first international cup) OlymPixel Cup (men and women) Pixel League D, C, B, A, and Tournament Tactical panel, to manage substitute changes, team formation, and attitude. Deep gameplay mechanics: short pass, long pass, etc., aiming when shooting, controlled shot or lobs, player skills. Lots of Animations (overhead kick, scorpion kick, scissors kick, diving header, etc.) Challenging AI. Teams with very different game-playing styles (ie: Catenaccio like Italy or Tiki-Taka like Brasil). Many game settings, including Zoom Level, Slow motion, Assisted mode, etc", "platform": "Nintendo Switch", "release_date": "December 26, 2022", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "Batovi Games Studio", "genres": "Sports", "max_players": "8", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168525-pixel-cup-soccer-ultimate-edition\n"}