{"altername_name": [], "name": "Please Teach Me Onedari Shogi", "overview": "The Onedari Girls are Shogi novices. When they face a difficult situation, they request a “Do-Over” or “Hint.” Accept their requests to get along with the girls! When you get to know them better, you will receive a special treat... Equipped with a function that helps you feel like you can teach the girls Shogi even if you are a beginner! Shogi game for adults.   ■ Onedari Girls Your girlfriend in 2.5 dimensions! Satou Airi - Birthday: March 4 - Height: 149 cm (4’10”) - Measurements: B88, W59, H85 (cm) (B: 35, W: 23, H: 33 (in)) - Likes: Games, animation, theater, baking sweets - Dislikes: Vegetables - Comments I started to cosplay! Please get to know me much better!! Please take care of me!   Mighty rabbit Uno Yui - Birthday: January 5 - Height: 165 cm (5’5”) - Measurements: B80, W58, H88 (cm) (B: 31, W:23, H: 35 (in)) - Likes: Rabbits, strawberries, the color pink, idols, chocolates, sushi - Dislikes: Bugs, asparagus, coriander leaves, celery, hot days - Comments: I’m Yui Uno. Please call me “Uno-chan.” It would make me so happy to get to know you better! OK! Let’s do it again!   Ideal mistress-type cosplayer Hanamiya Inori - Birthday: January 18 - Height: 164 cm (5’4”) - Measurements: T92, U70 (under-bust), H95 (cm) (T: 36, U: 28, H: 37 (in)) - Likes: Cosplay, sushi, chocolate! - Dislikes: Bugs, ghosts, vegetables! - Comments: I’m Inori Hanamiya, a half-Japanese and half-Chinese cosplayer. I would be happy if you played with me! Be nice to me!   Attention The language used in this game is Japanese.", "platform": "Nintendo Switch", "release_date": "", "game_type": "", "esrb": "", "developers": "SilverStarJapan", "publishers": "SILVERSTAR", "genres": "", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118716-please-teach-me-onedari-shogi\n"}