{"altername_name": ["ポケモン不思議のダンジョン 救助隊DX", "Pokémon Mundo Misterioso: Equipo de Rescate DX", "Pokemon Mystery Dungeon: Rescue Team DX", "Pokémon Mystery Dungeon: Retterteam DX"], "name": "Pokémon Mystery Dungeon: Rescue Team DX", "overview": "Become a Pokémon. Brave the mystery dungeons. What if you woke up one day, and you were a Pokémon? You can meet and recruit over 400 Pokémon in a dungeon-crawling adventure within their world! Build a rescue team to take on mysterious, changing dungeons and strategically plan your moves as you venture forth to make the Pokémon world a safer place... and uncover your true purpose along the way. As you recruit Pokémon, these trusty teammates will need somewhere to stay, so build rescue team camps to house, manage, and strengthen your Pokémon friends. Think hard about who is right for the job and how to approach each mysterious dungeon as you prepare a rescue team. You’ll move a single square at a time or use Auto mode to speed up movement until you engage other Pokémon in turn-based battles - but don’t forget about Pokémon strengths, weaknesses, and potential rare qualities! Even the most capable rescue teams need help sometimes, so if you find yourself in trouble you can send a rescue request to other players online, or use an offline password system. This version adds Mega Evolved Pokémon, gorgeous watercolor-inspired graphics, and more! Get comfortable in being a Pokémon, there’s a lot of work to do.", "platform": "Nintendo Switch", "release_date": "March 6, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Spike ChunSoft", "publishers": "Nintendo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Mystery_Dungeon:_Rescue_Team_DX", "video_link": "https://www.youtube.com/watch?v=4AkX8QUJ7dM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/124196-pokemon-mystery-dungeon-rescue-team-dx\n"}