{"altername_name": ["Pokémon Strahlender Diamant", "Pokémon Diamant Étincelant", "Pokémon Diamante Lucente", "Pocket Monsters Brilliant Diamond", "Pokémon Diamante Brillante", "Pokemon Brilliant Diamond"], "name": "Pokémon Brilliant Diamond", "overview": "Revisit the Sinnoh region and story of Pokémon Diamond Version Experience the nostalgic story from the Pokémon Diamond Version game in a reimagined adventure, Pokémon Brilliant Diamond, now on the Nintendo Switch system! Adventures in the Pokémon Brilliant Diamond game will take place in the familiar Sinnoh region. Rich in nature and with mighty Mount Coronet at its heart, Sinnoh is a land of many myths passed down through the ages. You’ll choose either Turtwig, Chimchar, or Piplup to be your first partner Pokémon and then set off on your journey to become the Champion of the Pokémon League. Along the way, you’ll run into the mysterious organization Team Galactic, and be able to encounter the Legendary Pokémon Dialga. Explore the revamped Grand Underground or put on a Super Contest Show The Underground from the Pokémon Diamond Version game has been powered up and is now called the Grand Underground. Here, you can dig up valuable treasure and Pokémon Fossils, create your own Secret Base, and catch Pokémon in places called Pokémon Hideaways. When you aren’t exploring in the Grand Underground, enter a Super Contest Show! Super Contest Shows are popular events in the Sinnoh region, each put on by four performers and their partner Pokémon, who work together to dance and show off their performance skills. You can also adventure in the Grand Underground or put on a Super Contest Show with other players through the local* communication or online** communication of your Nintendo Switch system! Walk with your Pokémon, change up your style, and customize your Poké Balls Choose a Pokémon that you’ve befriended during your journey to walk along behind you in the game. In the relaxing Amity Square you can walk with up to 6 Pokémon! Depending on the Pokémon, you’ll see different gestures or ways of walking, and when you talk to your Pokémon, it will respond. You’ll also be able to add your own personal style! Choose a variety of outfits and coordinate tops and bottoms. Some are based around Pokémon motifs and others change your hairstyle. You can even use Capsule Decoration to add stickers to customize the effects that appear when your Pokémon comes out of its Poké Ball!", "platform": "Nintendo Switch", "release_date": "November 19, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "ILCA", "publishers": "Nintendo", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.18", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Brilliant_Diamond_and_Shining_Pearl", "video_link": "https://youtu.be/1pDI8Scph44", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150705-pokemon-brilliant-diamond\n"}