{"altername_name": ["Pokemon Let's Go, Eevee!", "Pokemon: Let's Go, Eevee!", "Pokémon: Let's Go, Evoli!"], "name": "Pokémon: Let's Go, Eevee!", "overview": "Take a Pokémon journey to the Kanto region with your steadfast partner, Eevee! Become the best Pokémon Trainer as you battle other Trainers, Gym Leaders, and the sinister Team Rocket. Catch Pokémon in the wild using a gentle throwing motion with either a Joy-Con controller or a Poké Ball Plus accessory, which will light up, vibrate, and make sounds to bring your adventure to life. You can also use button controls in Handheld Mode. Share your adventure with family or friends using a second Joy-Con or Poké Ball Plus. You can even connect to the Pokémon GO app using a compatible smartphone to bring over Pokémon originally discovered in the Kanto region! Explore the vibrant region of Kanto - home to beloved characters like Brock, Misty, and the nefarious trio Jessie, James, and Meowth! Throughout the story, your bond with your partner Pokémon grows stronger as you care for it and travel together. See the world in style by customizing Eevee and your Trainer with a selection of outfits. True-to-size wild Pokémon roam around in the game - catch them like a real Pokémon Trainer by using timing and a well-placed Poké Ball. Battle and trade with other players who own the game via local wireless or online. Go on a stroll with your favorite Pokémon in your Poké Ball Plus to level them up, and to receive in-game rewards after returning them to the game. Connect to Pokémon GO to transfer caught Kanto-region Pokémon, including Alolan and Shiny forms, as well as the newly discovered Pokémon, Meltan, from that game to this one!", "platform": "Nintendo Switch", "release_date": "November 16, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Game Freak", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "2", "cooperative": "Yes", "rating": "4.24", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon:_Let%27s_Go,_Pikachu!_and_Let%27s_Go,_Eevee!", "video_link": "https://www.youtube.com/watch?v=9jRtpMKLsts", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107865-pokemon-lets-go-eevee\n"}