{"altername_name": ["Pokemon: Let's Go, Pikachu!", "Pokemon Let's Go, Pikachu!", "Pokémon Let's Go, Pikachu!"], "name": "Pokémon: Let's Go, Pikachu!", "overview": "Take a Pokémon journey to the Kanto region with your energetic partner, Pikachu! Become the best Pokémon Trainer as you battle other Trainers, Gym Leaders, and the sinister Team Rocket. Catch Pokémon in the wild using a gentle throwing motion with either a Joy-Con controller or a Poké Ball Plus accessory, which will light up, vibrate, and make sounds to bring your adventure to life. You can also use button controls in Handheld Mode. Share your adventure with family or friends using a second Joy-Con or Poké Ball Plus (sold separately). You can even connect to the Pokémon GO app* using a compatible smartphone to bring over Pokémon originally discovered in the Kanto region! Explore the vibrant region of Kanto—home to beloved characters like Brock, Misty, and the nefarious trio Jessie, James, and Meowth! Throughout the story, your bond with your partner Pokémon grows stronger as you care for it and travel together. See the world in style by customizing Pikachu and your Trainer with a selection of outfits. True-to-size wild Pokémon roam around in the game—catch them like a real Pokémon Trainer by using timing and a well-placed Poké Ball. Battle and trade with other players who own the game via local wireless or online**. Go on a stroll with your favorite Pokémon in your Poké Ball Plus to level them up, and to receive in-game rewards after returning them to the game. Connect to Pokémon GO* to transfer caught Kanto-region Pokémon, including Alolan and Shiny forms, as well as the newly discovered Pokémon, Meltan, from that game to this one! • Become the best Pokémon Trainer on an adventure with Pikachu! • Encounter Pokémon in the Kanto region and beloved characters like Brock and Misty as you foil the plans of Jesse, James, Meowth, and the rest of Team Rocket • Play the entire game in Handheld Mode, with a single Joy-Con controller, or the Poké Ball Plus accessory which will light up, vibrate, and make sounds to bring your adventure to life • Take your Pokémon for a stroll in Poké Ball Plus to level them up, and to receive in-game rewards after returning them to the game. • Gently shake Poké Ball Plus to hear a Pokémon that has been put inside from Pokémon: Let's Go, Pikachu! or Pokémon: Let's Go, Eevee! • Every Poké Ball Plus contains your very own Mythical Pokémon Mew! • Share a Pokémon adventure together anytime, anywhere on one system by using another Joy-Con controller or Poké Ball Plus accessory (sold separately) to catch and battle alongside another player! • Connect with the Pokémon GO* app on compatible smartphones to transfer caught Kanto-region Pokémon, including Alolan and Shiny forms, as well as the newly discovered Pokémon, Meltan! • Connect Poké Ball Plus to the Pokémon GO app to catch Pokémon in the real world and gather items from Poké Stops without viewing your smartphone screen—while carrying a Pokémon from the Pokémon: Let's Go, Pikachu! or Pokémon: Let's Go, Eevee! games • Battle and trade with other players who own the game via local wireless or online** • Other online features include Mystery Gifts", "platform": "Nintendo Switch", "release_date": "November 16, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Game Freak Inc.", "publishers": "Nintendo", "genres": "Adventure", "max_players": "2", "cooperative": "Yes", "rating": "4.13", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon:_Let%27s_Go,_Pikachu!_and_Let%27s_Go,_Eevee!", "video_link": "https://www.youtube.com/watch?v=9jRtpMKLsts", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107867-pokemon-lets-go-pikachu\n"}