{"altername_name": [], "name": "Pokémon Sword Expansion Pass", "overview": "If you purchase the Pokémon Sword + Pokémon Sword Expansion Pass bundle, you’ll be able to receive a Pikachu Uniform and an Eevee Uniform, plus 100 Poké Balls as a special purchase bonus. Galarian Slowpoke appears! You can encounter it in Wedgehurst Station, and you can use an item found on The Isle of Armor to evolve it into Galarian Slowbro and an item found on The Crown Tundra to evolve it into Galarian Slowking! Begin your adventure in the Galar region AND discover newly-added areas, The Isle of Armor and The Crown Tundra, with the Pokémon Sword + Pokémon Sword Expansion Pass! This bundle includes both the base Pokémon Sword game and the Pokémon Sword Expansion Pass, which gives you access to two new areas, newly discovered Pokémon, and stories of growth and exploration! Begin your adventure as a Pokémon Trainer by choosing one of three partner Pokémon: Grookey, Scorbunny, or Sobble. Then embark on a journey in the Galar region, where you’ll challenge the troublemakers of Team Yell, while unraveling the mystery behind the Legendary Pokémon Zacian and Zamazenta! Explore the Wild Area, a vast expanse of land where the player can freely control the camera. Team up with three other players locally or online in the multiplayer co-op Max Raid Battles* in which players will face off against gigantic and super-strong Pokémon known as Dynamax Pokémon. Continue your Pokémon Sword adventure in The Isle of Armor and The Crown Tundra, two new areas to explore that will be added to the Galar region as part of the Pokémon Sword Expansion Pass! Each area offers a different adventure, where you’ll be able to visit the far reaches of the Galar region and meet the people and Pokémon that live there. You’ll also see some familiar Pokémon that didn’t appear in the Galar region beforeKeep the adventure going with your existing Pokémon Sword save data and jump into this expansion to Pokémon Sword!", "platform": "Nintendo Switch", "release_date": "November 6, 2020", "game_type": "DLC", "esrb": "E - Everyone", "developers": "Game Freak", "publishers": "Nintendo", "genres": "Adventure", "max_players": "8", "cooperative": "Yes", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Pok%C3%A9mon_Sword_and_Shield", "video_link": "https://www.youtube.com/watch?v=ayIZaCMKpYE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163666-pokemon-sword-expansion-pass\n"}