{"altername_name": ["Pokemon Unite"], "name": "Pokémon UNITE", "overview": "Team up and take down the opposition in Pokémon’s first 5-on-5 strategic team battle game! Join Trainers from around the world as they head for Aeos Island to compete in Unite Battles! In Unite Battles, Trainers face off in 5-on-5 team battles to see who can score the most points within the allotted time. Teamwork is key as you and your teammates defeat wild Pokémon, level up and evolve your partner Pokémon, and knock out the opposing team’s Pokémon to prevent them from scoring points. Put your teamwork to the test, and take home the win! • BATTLE IN STYLE: Take to the field while looking your best in Holowear! Thanks to a special technology developed using Aeos energy, Trainers can deck out their Pokémon in a variety of holographic outfits—with new styles arriving regularly! • UNITE MOVES: Unleash the true power of your Pokémon with Unite Moves! Leverage these all-new Pokémon moves, which are only possible while in Unite Battles, and turn the tide of even the direst situations. • RANK UP: Looking to prove how skilled you are? Participate in ranked matches, and earn points as you climb up the global leaderboard! • COMMUNICATION IS KEY: Even the most skilled Trainers recognize how important communication is to their team’s success. Leverage signals, quick-chat messages, and—for the first time in a Pokémon title—voice chat to communicate and stay in sync with your team. • CROSS-PLATFORM PLAY: Play with Trainers around the world on the Nintendo Switch™ system or on a compatible smartphone thanks to cross-platform support. Trainers may use their Pokémon Trainer Club account or Nintendo Account on both Nintendo Switch and mobile to easily keep their progress synced between devices.", "platform": "Nintendo Switch", "release_date": "July 21, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "The Pokémon Company", "genres": "Action", "max_players": "10", "cooperative": "Yes", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=j86TTIMWBYY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156196-pokemon-unite\n"}