{"altername_name": [], "name": "Police Simulator 2023", "overview": "This new police simulator offers you gigantic cities to explore, several types of missions and countless vehicles, upgrades and officers. Drive around the open world maps or get out of the car, control your officer and have fun in our ultimate police simulator game. Pick your favorite car and complete missions or just free-roam the huge maps. You will have a wide selection of vehicles to choose from, ranging from regular cars and classic police cruisers to more exotic supercars and hypercars. You can even drive some massive SWAT trucks! Complete the various missions in our new 2022 Police simulation game. The Chase mission is one of the most exhilarating driving experiences you can have: chase and hit the suspect’s car until you get to arrest them. If you like some more relaxed driving you can try the police escort mission or help your squad stop suspect vehicles with spike strips in the roadblock mission. If you enjoy giving out tickets, try the Parking and Radar missions. You can also go Undercover with a special set of challenges, unique to our next-gen police simulator. Feel the thrill of the car chase in the Fugitive mission or quietly drive behind the suspect car from a distance in the Follow mission. You can also complete Stakeout missions, in which you take photos of illegal activities. Features: -Amazing selection of different types of vehicles. -Different police officers. -Explore gigantic cities (4 times larger than before). -8 mission types with more coming your way! -Realistic Controls -Realistic vehicle features and physics. -Visual tuning options and Police cruiser upgrades. -Amazing next-gen graphics with weather effects, rain, fog. -Ultra-realistic city traffic (cars, vans, trucks, motorcycles, bicycles). -Pedestrian traffic makes the city feel alive.", "platform": "Nintendo Switch", "release_date": "November 7, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "SC Ovilex Soft", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167143-police-simulator-2023\n"}