{"altername_name": [], "name": "Prison Princess", "overview": "Lead two captured princesses to solve puzzles and escape the Demon King's castle. Your actions alone as a hero will decide their fates, and your own! A ghostly sliver of your former self, can you rescue the princesses? A new escape game experience, with cute girls, puzzles, and 'special' events. ＜Instruct the princesses and lead them to their escape!＞ The hero has no physical body and so he can't investigate things or solve puzzles on his own. He needs to ask the princesses to act for him. ＜Clues you find will be instrumental to disarming traps, and making your escape!＞ In order to get the princesses to escape, you're gonna need to deal with a lot of traps and puzzles. But to solve them, you're going to need to scour the room from top to bottom, and get all the items and hints! You, the hero, will have your cleverness tested at every turn! ＜No touching, no glancing and don't get distracted! The princesses will have to 'put themselves out there' if they want to solve the puzzles! ＞ There are many traps which will require the princesses to get their hands, feet, just about every other part of them dirty! There's a time limit for the puzzles, so you have to concentrate on the traps without getting distracted by the women in compromising positions before you! And forget about clicking on them! You all might enjoy it but focus or they'll scold you! So, keep your eye on the prize, suppress the desire to interact with the princesses, and disarm those traps, just like a real savior of the world should! But the hero's actions in this regard just might affect the fates of all three of you...", "platform": "Nintendo Switch", "release_date": "January 30, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "qureate", "publishers": "qureate", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=y3WFWdQlp-I", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/164001-prison-princess\n"}