{"altername_name": [], "name": "Prodeus", "overview": "Prodeus is a first-person shooter of old, re-imagined using modern rendering techniques and technology. Experience the quality you’d expect from a modern AAA game, designed with retro aesthetics and gameplay that invoke the tech-imposed limits of older hardware. The game features a hand-crafted campaign from industry FPS veterans, co-op and competitive multiplayer play drawing on classic modes*, a fully integrated level editor, and a built-in community map browser for instantaneous action with nearly limitless levels to play. Get ready to paint the walls red. This is the Boomer Shooter you’ve been waiting for. FEATURES: Retro look, modern era Shooters past and present collide with graphics that combine today’s high-quality 3D tech with retro visuals. Experience over-the-top explosions of lo-fi pixels and hi-tech particle effects as you clash against the Prodeans and forces of Chaos. Pure retro FPS chaos Steel yourself for fast and frantic nonstop action. Blast and blaze your way through hordes of chaos-spawned creatures using an arsenal of classically over-the-top weapons. Raining red Splatter the steel walls and alien halls with the blood of your enemies. Experience the gory thrills of the elder shooters, dialed up to 11 thanks to Prodeus’s delightfully demented dismemberment system. Community-crafted levels Discover new arenas through a built-in browser filled with community-created maps, and keep the visceral combat fresh. Multiplayer Mayhem Team up and go head-to-head in a variety of multiplayer modes. Take on the campaign in 4-player co-op, and dive into the fray in 16-player Deathmatch, Team Deathmatch, CTF, and more—then take things to the next level by creating and sharing custom game modes. Frag to the Music Burst blood vessels listening to a supercharged metal soundtrack by retro FPS composer Andrew Hulshult that dynamically changes gears to accompany your actions.", "platform": "Nintendo Switch", "release_date": "October 7, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "Humble Games", "genres": "Shooter", "max_players": "16", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Prodeus", "video_link": "https://www.youtube.com/watch?v=pV0Cv4Ji2vw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166047-prodeus\n"}