{"altername_name": [], "name": "Project Nimbus: Complete Edition", "overview": "Paint the Sky with Fire : High Speed Mech Action! Project Nimbus is a high-speed mech action game set on a devastated future Earth, where the player maneuvers a weaponized humanoid general-purpose Battle Frame. Engage enemy units with various weapons and defeat huge bosses and unique ace pilots! Fly the skies with 360 degrees of freedom, and battle enemies with a variety of weapons and techniques, from smart missiles to the blade charge. Experience the battle as a young ace pilot destined for legendary status. ■ High-speed battle action, piloting heavily armored Battle Frames through the war torn skies. ■ Twenty-six missions in a variety of locations, including floating cities, ocean fortresses, mountain bases, futuristic prisons, and battles in space. ■ Over a dozen playable Battle Frames with weapons including smart missiles, energy blades, particle cannons, floating energy shields, railguns and autonomous psychodrones. ■ A sprawling storyline with battles between three different factions over a war-torn futuristic planet: the US-lead CFN, the Russia-led UCN, and the shadowy terrorist Children of Fallen Nations. ■ Complex bosses each with a unique fighting style, including orbiting nuclear battle mechs, bands of deadly pilots, and weaponized flying ships. ■ Missiles, rail guns and cannons for long range combat...energy blades and blade rushes for melee! ■ Bonus Survival Mode lets you choose from an entire hangar of Battle Frames, and then you must battle endless waves of enemies with increasing power. ■ WARFRONT mode includes massive replayability with six unlimited mission modes including Base Defense, Interception, and Assassination. Six levels of pilot (including Legendary) and Battle Frame customization will keep you playing for hours more.", "platform": "Nintendo Switch", "release_date": "May 16, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "GameTomo", "publishers": "GameTomo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156331-project-nimbus-complete-edition\n"}