{"altername_name": [], "name": "Quake II", "overview": "Developed by id Software in 1997, Quake II is a critically acclaimed first-person shooter that introduces an entirely new science fiction narrative and setting. Now, experience the authentic, enhanced and complete version of the original. Features Experience the Military Sci-fi FPS, Enhanced Get the Original Mission Packs: The Reckoning and Ground Zero Play the All-New Expansion “Call of the Machine” Get Quake II 64 for Free Enjoy Online & Local Multiplayer/CO-OP Play Together with Crossplay Motion Aiming Ready Experience the Original Game, Enhanced Enjoy the original, authentic version of Quake II, now with high-definition widescreen resolution support, enhanced models, improved enemy animations and gore, improved and restored AI behaviors, enhanced cinematics, dynamic and colored lighting, anti-aliasing, depth of field, the original, heavy rock soundtrack by Sonic Mayhem, and more. Play the Intense Military Sci-fi Campaign Mankind is at war with the Strogg, a hostile alien race that attacked Earth. In response, humanity launched a strike on the Strogg homeworld...it failed, but you survived. Outnumbered and outgunned, fight your way through fortified military installations and shut down the enemy's war machine. Only then will the fate of humanity be known. Get Both of the Original Mission Packs Quake II includes both original mission packs: “The Reckoning,” featuring 18 campaign levels and 7 deathmatch maps, and “Ground Zero,” featuring 15 campaign levels and 14 deathmatch maps. Mission Pack: The Reckoning In the first official expansion pack for Quake II, you are part of an elite commando force that must infiltrate a Strogg site. Once inside, you must scour industrial landscapes, crawl through waterways and air ducts, navigate treacherous canyons teeming with vicious mutants, stow away on an alien spacecraft, and destroy the enemy's secret moon base. Mission Pack: Ground Zero In the second official expansion pack for Quake II, you, and a few marines are the lucky ones. You've made it to the surface of Stroggos in one piece and are still able to contact the fleet. The Gravity Well, the Strogg's newest weapon in its arsenal against mankind, is operational. With the fleet trapped around Stroggos, only 5% of ground forces surviving, and that number dwindling by the second, your orders have changed: free your comrades and destroy the Gravity Well. Play the All-New “Call of the Machine” Expansion A brand-new Quake II experience from MachineGames consisting of 28 campaign levels and one multiplayer deathmatch map. In the depths of Strogg space lies the Machine, a singularity capable of collapsing the fabric of reality. Fight across time and space to find the Strogg-Maker, destroy it, and change the destiny of man and machine. Get Quake II 64 for Free Enjoy all 19 campaign levels, 10 multiplayer deathmatch maps, and an additional, original soundtrack in this release of the original Quake II 64. Enjoy Online & Local Multiplayer and CO-OP Fight the hostile Strogg through the gritty, military sci-fi campaign and expansions in 4-player online or local split-screen co-op, and compete in pure, retro-style combat with support for 16-player (online) or *4-player (local split-screen). Bot support for offline and online DM and TDM modes included. Play Together with Crossplay Play the campaign and all expansion packs cooperatively or go toe-to-toe in multiplayer matches with your friends regardless of platform! Motion Aiming Ready Improve your gunplay with an option that allows you to aim using gyro controls. The option can be used in conjunction with the control stick for the perfect blend of immersion and accuracy.", "platform": "Nintendo Switch", "release_date": "August 10, 2023", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "Bethesda", "genres": "Shooter", "max_players": "16", "cooperative": "No", "rating": "3.8", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371012-quake-ii\n"}