{"altername_name": [], "name": "Railway Empire: Nintendo Switch Edition", "overview": "United States, 1830: ‘The New World’ is in its ascendancy. Industry is booming, and the race is on to establish the most dominant and powerful rail empire in all of North America. It’s time to outthink and outmaneuver your competitors as you lead your company into the 20th century! In Railway Empire, you will create an elaborate and wide-ranging rail network, purchase over 40 different trains modelled in extraordinary detail, and buy or build railway stations, maintenance buildings, factories and tourist attractions to keep your travel network ahead of the competition. You’ll also need to hire and manage your workforce if you want to ensure an efficient train service, whilst also develop over 300 technologies ranging from mechanical improvements to the trains themselves to workplace infrastructures and advanced amenities as you progress through five eras of technological innovations. However, you can’t just build and research your way to the top – the competition never sleeps, and to keep your business on track you’ll have to survive against up to three rival tycoons. To get to the top you may have to resort to more cutthroat tactics as you attack and sabotage your opponents through raids and industrial espionage. The Railway Empire – Nintendo Switch™ Edition features the additional content Mexico, The Great Lakes and Crossing the Andes unlocking new scenarios on regional maps, additional soundtracks, locomotives as well as introducing the night & snow mode. Features: - Exploit the economic opportunities of the United States in an extensive campaign, working your way step by step from coast to coast across this great continent. - Lead your Railway Empire to success by establishing a comprehensive rail network and optimizing transportation of passengers and goods. - Master challenges and objectives through a range of scenarios, or create your perfect railway network in construction mode without any financial pressure. - Over 40 historically accurate locomotives and more than 30 different wagons can be acquired over the course of the game, and must be put to use in the best way in order to take advantage of their strengths and weaknesses. - Invest in over 300 new technologies across five different eras to progress and maximize the potential of your rail network. - Compete with up to three rival companies, and even sabotage their efforts with the use of bandits and spies. - Includes the additional content: Mexico, The Great Lakes and Crossing the Andes", "platform": "Nintendo Switch", "release_date": "June 19, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Gaming Minds Studios", "publishers": "KalypsoMediaGroup", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156007-railway-empire-nintendo-switch-edition\n"}