{"altername_name": [], "name": "Railgrade", "overview": "RAILGRADE is a management sim about using railways to transport resources and power industry on an off-world colony. As an administrator working on behalf of the Nakatani Chemicals corporation, it’s up to you to help restore industrial production following a disastrous collapse of the planet’s infrastructure. Construct intricate railway networks and use the power of trains to connect vital industries with the resources they require. Manage inputs and outputs to optimise production, and create efficient supply chains using multi-level tracks and a variety of unique engine types. Combine strategic decision-making with creative construction in order to rebuild a thriving industrial colony. Succeed, and you might just impress your corporate overlords enough to be allowed back home to earth. • Use effortless construction tools to instantly build and manage an intricate network of interconnected railway routes • Create efficient supply chains by connecting industrial sources and placing dozens of busy trains on the map • Customise your trains using different engines and freight types, with hundreds of unique engine and cargo combinations • Optimise your train set-up and place tracks strategically to navigate challenging environmental terrain and create the most effective delivery route possible • Control the flow of resource production through careful management of inputs and outputs. Watch out for bottlenecks to keep trains and their precious cargo moving • Invest in the growth of your cities, or use zeppelins to export goods for extra profit • Admire your fleet of trains with the cinematic view mode • Help restore prosperity to an industrial colony across a single player campaign with over 50 missions • Spend tokens awarded by each mission and use them to unlock new industries, upgrades and options • Challenge yourself in bonus side missions. Explore arid deserts in search of oil supplies, or develop a rocket launch program • Show off your most impressive railway setups with a photo mode that includes a variety of filters and visual options", "platform": "Nintendo Switch", "release_date": "September 29, 2022", "game_type": "Released", "esrb": "E - Everyone", "developers": "Minakata Dynamics", "publishers": "Epic Games", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167447-railgrade\n"}