{"altername_name": [], "name": "RayStorm x RayCrisis HD Collection", "overview": "Regarded as two of the most important and beloved shoot ‘em ups TAITO has ever released and the more advanced successors of RayForce – RayStorm and RayCrisis – have certainly carved their own path in arcade gaming history. Released in 1996 and ported to several consoles, including the SEGA Saturn, PlayStation and XBOX 360, RayStorm takes place in a parallel universe to RayForce and RayCrisis, where humanity has expanded its space colonies all the way to Orion’s Belt. Unfortunately, the rebellious colony of Secilia overthrows the government and plans to obliterate the earth and all the people on it. To counter it, Earth sends out a covertly-developed fighter codenamed the R-Gray (that’s you, buddy) in hopes of penetrating the Secilian atmosphere and obliterating Secilia’s base of operations. Set in a cyberspace environment, RayCrisis was originally released in 1998 for TAITO G-NET arcade hardware, and marked a stylistic departure from the rest of the series, featuring for the first time 3D graphics. A prequel to RayForce, it details the events during the time in which the supercomputer called Con-Human gained sentience and rebelled against its human creators. While the Earth is being demolished, a cyberspace hacker launches a desperate assault to jack into the supercomputer’s virtual core and cease its insanity. It is up to you and the Waveriders to keep the malicious AI from causing any more chaos – even if it could be too late, the least you can do is ensure that no more lives are lost in the real world by ending it in the digital realm. Relive the excitement of epic battles in outer and cyber space with this new collection, featuring not only RayStorm and RayCrisis, with their polygon-based 3D graphics and striking art styles, but also their HD remastered versions. All of this is accompanied by the unforgettable soundtrack composed by TAITO’s legendary sound team, ZUNTATA.", "platform": "Nintendo Switch", "release_date": "June 30, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "M2,", "publishers": "ININ Games", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370186-raystorm-x-raycrisis-hd-collection\n"}