{"altername_name": [], "name": "Real Boxing 2", "overview": "Take the fight to the next level in award winning Real Boxing™ 2. Train hard, fight harder. Prove your worth in the career and multiplayer mode. Discover a whole new world of combat sports games. As a newbie boxer, challenge experienced opponents and try to win and score a KO! Explore the world of boxing and make your way to the top. You can become the boxing champion, the best warrior of all time! So get ready to punch, and punch hard! Discover what you’re made of, and try to climb to the top. Become the ultimate champion! Use jabs, hooks, uppercuts & combine them into devastating combos. FEATURES: CHOOSE YOUR STYLE OF BOXING Before you KO your opponent, you need to improve your fighting skills! Adjust your boxer's stats to match your playstyle and level up quickly to unlock new abilities that will help you in fights to come! Equip powerful boosts to make your dream come true. As in all fighting sports, it's best to enter the punch-out and serve a smackdown with style, so gear up - equip one of tens of boots, trousers and gloves. Get ready - a KO is in the air! PLAY MINI-GAMES Train your fighter in exciting mini games that reflect real life boxers’ training and develop your character! You need to leave a lot of sweat in your training hall to be a champion. No one said it would be an easy challenge! CREATE THE ULTIMATE BOXING FIGHTER Real Boxing 2 allows you to customize your fighter! Choose your outfit, get a new tattoo and even change your haircut. Adjust all the aspects of the fighter’s body, from mass and muscle sculpture to nose shape. BATTLE AGAINST UNIQUE BOSSES Take on the unique type of challenging opponents! Clown? Check. Santa? Yeah, he's there. Golem from the shard of a mountain? You bet. Defeat them all and claim their epic gear! So, do you like fighting games: boxing, wrestling, MMA? Join the club, create your boxer, and start your boxing career - get into Real Boxing 2 – the ultimate experience among fighting games", "platform": "Nintendo Switch", "release_date": "November 26, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Vivid Games", "publishers": "QubicGames", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=KLtNQNV4BYg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156861-real-boxing-2\n"}