{"altername_name": ["Record of Lodoss War: Deedlit in Wonder Labyrinth"], "name": "Record of Lodoss War: Deedlit in Wonder Labyrinth", "overview": "Record of Lodoss War -Deedlit in Wonder Labyrinth- is a 2D action-exploration \"Metroidvania\"-style game developed under the close supervision of original creator Ryo Mizuno, depicting the previously unknown story of Deedlit and the events leading up to Record of Lodoss War: Diadem of the Covenant. Both fans of Record of Lodoss War and all-new players alike can fully enjoy this latest installment in the series. ■ Story Deedlit awakens suddenly in a mysterious, unknown place. Where am I? Why am I here? With nobody around to respond, her questions are met with only silence. Seeking answers, Deed eventually sets off on foot, alone… ■ Game Features Sword and Arrow Attacks: Use your sword for powerful melee attacks against enemies within range, or employ projectile attacks using your bow and arrows against those farther away. Swappable Equipment: Freely equip and utilize swords and arrows obtained along the way. The powerful weapons and tools you acquire can be used to your advantage throughout your journey. You can also sell off weapons you no longer need. Swappable Elemental Spirits: Alternate among a selection of useful elemental spirits to change Deedlit’s various attributes. While using Sylph, the wind spirit, wind-based attacks do less damage. When the flame spirit Salamander is in use, fire-based attacks do less damage. Raise Elemental Spirit Levels: You can raise the levels of your elemental spirits by absorbing the “Soul Screams” generated when attacking and defeating enemies. Each spirit’s level is displayed as Deed’s own power level. When a spirit’s level has maxed out at 3, HP will be automatically recovered.", "platform": "Nintendo Switch", "release_date": "January 28, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "Team Ladybug", "publishers": "Playism", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.5", "wikipedia": "https://en.wikipedia.org/wiki/Record_of_Lodoss_War:_Deedlit_in_Wonder_Labyrinth", "video_link": "https://www.youtube.com/watch?v=FdmKbXx6gtU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/159460-record-of-lodoss-war-deedlit-in-wonder-labyrinth\n"}