{"altername_name": [], "name": "Red Siren: Space Defense", "overview": "We are in the future, raw material resources on the Earth have been depleted. With the support of civil society and modern robotics, the private companies have colonized the surrounding planets and utilizing their natural sources worldwide. Since the new mining technology is not achievable for everybody, lots of people are organized in groups, building robots and looting the planets. War is inevitable. In response, the Exacorp established Red Siren combat squad to battle raiders, eliminate tanks and fight against mechs. As a young soldier of the Red Siren battleship you have to defend the bases , destroy the enemies and eliminate all of the powerful robots who want to win this war and rule the world at all costs. The outcome of the warfare is in your hands! Red Siren: Space Defense is a space war game with futuristic robots, tanks, spaceships, war mechas and huge battle machines! Enjoy the amazing visuals, realistic effects, exciting battles, challenging missions… the real robot warfare! Discover marvelous planets, defend the base building, destroy all of the enemy’s robots, tanks and mechas! Hunt down the enemy space ships with your massive weapon arsenal. Unlock new levels in four different worlds, try every ship, weapon and upgrade them to be a real robot destroyer! Try to demolish all of your enemies as fast as you can, accomplish missions to get prizes and rank up! Complete all of the achievements! In this battle you have to fight throught the world against tanks, walkers , flying robots, war-planes, a loads of enemies with different arms and missiles! Throw multiple bombs, blast them with your plasma gun, launch your missiles and keep shooting. The strategy is up to you, but no matter what: crush their forces and stop the invasions all over the world!", "platform": "Nintendo Switch", "release_date": "June 4, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "isTom Games", "publishers": "isTom Games", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156010-red-siren-space-defense\n"}