{"altername_name": ["レムナント：フロム・ジ・アッシュ"], "name": "Remnant: From the Ashes", "overview": "Remnant: From the Ashes is a third-person survival action shooter set in a post-apocalyptic world overrun by monstrous creatures. As one of the last remnants of humanity, you'll set out alone or alongside up to two other players to face down deadly enemies and retake what was lost. With over 100 varieties of enemies, 20 epic bosses, and endless possible combat scenarios, it’s going to take everything you’ve got to make it out alive. A Remnant of Mankind: The world has been thrown into chaos by an ancient evil from another dimension. Humanity is struggling to survive, but they possess the technology to open portals to other realms and alternate realities. They must travel through these portals to uncover the mystery of where the evil came from, scavenge resources to stay alive, and fight back to carve out a foothold for mankind to rebuild... Endless Fantastic Realms Await: Explore dynamically-generated worlds that change each time you play through them, creating new maps, enemy encounters, quest opportunities, and in-world events. Each of the game’s four unique worlds is filled with monstrous denizens and environments that will provide fresh challenges with each playthrough. Adapt and explore… or die trying. Scavenge. Upgrade. Specialize: Overcome tough-as-nails enemies and epic bosses throughout hostile environments to earn experience, valuable loot and upgrade materials you can use to build a wicked arsenal of weapons, armor, and modifications to approach each encounter dozens of unique ways. Strength in Numbers: Invading other worlds to seek an end to the Root is dangerous and survival is far from guaranteed. Team up with up to two other players to increase your chances of survival. Teamwork is necessary to make it through the game’s toughest challenges… and unlock its greatest rewards.", "platform": "Nintendo Switch", "release_date": "March 21, 2023", "game_type": "Released", "esrb": "M - Mature", "developers": "Gunfire Games", "publishers": "THQ Nordic", "genres": "Adventure", "max_players": "3", "cooperative": "Yes", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Remnant:_From_the_Ashes", "video_link": "https://www.youtube.com/watch?v=RT26UZ-cgHc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372451-remnant-from-the-ashes\n"}