{"altername_name": [], "name": "Remothered: Tormented Fathers", "overview": "Remothered: Tormented Fathers is the pure and realistic survival horror video game. A game by Darril Arts, directed by Chris Darril, developed by Stormind Games. Psychology plays a huge role within the game: heroes and enemies are atypical and the line between good and evil is blurred. The plot is rich of unpredictable twists, but touching at the same time. The development of the game is similar to that of a film narration, where the player perfectly identifies himself with the character. The soundtrack, composed by Nobuko Toda and Luca Balboni, enhances the terrifying atmosphere of the game. The story revolves around Rosemary Reed, a fascinating 35-year-old woman, who reaches Richard Felton’s house, in order to investigate on the disappearance of a girl called Celeste. The woman is greeted by Gloria, the nurse who takes care of old Richard. When Dr. Felton understands Rosemary’s true intentions, the dread begins.   KEY FEATURES Remothered: Tormented Fathers is the first title of the long-awaited 3rd person game trilogy. A web of lies where murders and obsessions come to life. A revolutionary experience created for survival horror fans. - Many ways to survive - The endless combinations of game dynamics make the experience available to every gamer: stealth, action, strategic, hide ‘n run. Deceive your stalker and block him in another area of the house. Attack your enemy and make your items more powerful. Carefully study the behaviour of your stalker and his path. Don’t get too close to your enemy, act like an unperceivable shadow, hiding yourself from his sight. Or just mix these dynamics together. - Psychological plot - Characters in the story are everyday people that turn themselves into scary monsters. - Movie-like cutscenes - Thanks to his impressive direction, Chris Darril puts into play a story rich of complex life-like characters.   Audio clues - Use the soundtrack and the 3D audio sound effects to understand when your stalkers are getting closer. - No health bars - Your body is the only way to understand how you are doing. - Realistic puzzles - Environments and characters have been conceived to be realistic and credible. - Top-notch soundtrack - Nobuko Toda and Luca Balboni wrote the music for the game. - Real-time loading - Explore the mansion without worrying about empty moments or boring loading times.   In addition, the Nintendo Switch™ version of the game presents these extra features: - A free integrated Artbook that players will unlock the first time they finish the game. This Artbook will contain the characters, locations and storyboard sequences’ concept art, collected items during the game, wireframes and 3D models of the mansion and characters. - Controller’s vibration. - Spatialized audio.", "platform": "Nintendo Switch", "release_date": "August 30, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "Stormind Games", "publishers": "Darril Arts", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118726-remothered-tormented-fathers\n"}