{"altername_name": [], "name": "REZ PLZ", "overview": "Death is just part of the adventure! REZ PLZ is a pixel art puzzle platformer with a new twist on co-op and single player gameplay: Kill your brother to solve puzzles and conquer dungeons. Join apprentice wizard brothers Arcan and Zeph as they fight the forces of Dark Arcanum armed with little more than the Resurrection Scroll, a tool they can use to bring each other back to life. As you progress, you will unlock new spells that grant diverse abilities to conquer the increasingly difficult challenges ahead. CO-OP PLAY: REZ PLZ puts a unique spin on the traditional co-op concept. Instead of trying to keep each player alive through each level, you must strategically kill each other to solve puzzles and defeat enemies. Use the Resurrection Scroll to bring Arcan and Zeph back to life. DEATH AROUND EVERY CORNER: Death is everywhere in REZ PLZ, and can come from a multitude of one-hit deaths, ranging from being sliced in half, eaten by creatures, burned alive and more. UNLOCK MAGICAL SPELLS: Unlock new spells to conquer the increasingly difficult challenges ahead, but be careful because these brothers are poor at magic and one bad spell can mean death! UNLOCKABLES: Explore and find a bevy of unlockable cosmetic items and unlockable challenging gauntlet levels to customize your gameplay. Challenge yourself further with bonus modes such as PVP foot race. STORY: REZ PLZ tells the story of Arcan and Zeph, two young apprentice wizards. When their school is overrun by evil forces, the duo has to work together to defeat the evil wizards of Dark Arcanum. The catch: They’re both terrible at magic. Although Arcan and Zeph learn spells along the way, their progress is slow. When they die, the Resurrection Scroll brings them back to life.", "platform": "Nintendo Switch", "release_date": "July 15, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Long Neck Games", "publishers": "Graffiti Games", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=AcKH6VhlQDY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369118-rez-plz\n"}