{"altername_name": [], "name": "River City: Rival Showdown", "overview": "River City Ransom is back, rebuilt from the ground up! Rekindle old rivalries and relive past rumbles through a completely revamped story! The 1989 retro classic River City Ransom has muscled up and doubled down on modern innovation! Tightened controls, improved backgrounds, and even online play -- this version has it all and more! Throw in a 2D fighting game mode to the mix, and River City has never been more action-packed! ■ Craft your own story and unlock various endings in single player mode! Brand new story events await as you battle through three days of hot-blooded high school hostilities! Characters and dialogue change with each completed event, culminating in a variety of unique endings. Uncover sinister plots and protect your turf at all costs! The fate of River City is in your hands! ■ Utilize flashy new special techniques to send your adversaries packing! Stone Hands, Dragon Feet -- Kunio already has quite an arsenal up his sleeve. Bring even more bravado to the brawl with an array of fresh, never-before-seen macho maneuvers! And that's not all! Ultra moves make their return, with enough firepower to bring any would-be challengers to their knees! ■ Play against friends in the 2D fighting game mode! \"Double Dragon Duel 2023\" (or DDD for short) is an all-new 2D fighting game bundled in at no extra cost. Select from a bountiful roster of hardened hitters and connect with friends both near and far to see who is the top dog on campus! And the word on the street is that even more unlockable characters await those who can find them...!", "platform": "Nintendo Switch", "release_date": "October 12, 2023", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Arc System Works", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373134-river-city-rival-showdown\n"}