{"altername_name": [], "name": "Road Fury", "overview": "Unleash your fury on the highway and shoot down everything that moves! Road Fury is an endless 2D shooter. Using a simple navigation system you weave your way through the traffic, overtaking the slower cars on the road and shooting anything in your way. You win coins for each car you destroy, the larger cars offering a bigger reward. Some vehicles may also leave behind power-ups to help you along your way. At the end of each level you’ll encounter an end of level boss who’s trying to shoot you off the road. Dodge their bullets and make each of your shots count! Keep playing until your health falls to zero. If you get hit by bullets or hit other cars you will lose car health. Periodically you’ll encounter roadworks - avoid these at all costs! The car’s weapons continuously shoot, so there are no weapons to control - the player’s focus is to weave around other cars collecting the coins and power ups: - Laser: maximum damage to the other vehicles - Nitro: give your car that extra speed boost - Magnet : brings all the coins to you When you’re ready you can take a pit-stop to the shop and use your coins to upgrade your wheels. You can upgrade any of the six upgradable items for your car: - Shield - makes your car last longer - Guns - the better your guns the more damage they do - Side Guns - triple your weapons reach by shooting out the sides of your car too - Magnet - increase the length of time the magnet power-up operates for - Nitro - increase the length of time the nitro power-up operates for - Laser - increase the length of time the laser power-up operates for Progression & Challenge The player can pick from one of three cars; the player begins with only one car unlocked. The second and third cars only become available after a series of challenges have been achieved relating to the level, total distance travelled and number of cars destroyed. Once the challenges have been achieved, the player can use their coins to buy the car. As the player progresses th", "platform": "Nintendo Switch", "release_date": "April 22, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Inlogic Games", "publishers": "Funbox Media", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156023-road-fury\n"}