{"altername_name": [], "name": "Rock of Ages 2: Bigger & Boulder", "overview": "Just like the title says, Bigger and Boulder cranks up the surrealism and gameplay to be, well... BIGGER AND BOULDER. With an emphasis on the chaotic new 2-vs-2 multiplayer, new time periods, and improved graphics, physics, and destructibility powered by Unreal Engine 4, players will need to be ready for some intense rocking and rolling.  Rock of Ages II: Bigger and Boulder features:  - ACE Team’s Trademark Quirkiness - The Monty Python-esque humor is turned up to 11, as players literally rock and roll through the ages. Humorous animated vignettes will also make a return in full force, so famous historical figures beware!  - An Emphasis on Multiplayer - A little friendly competition never hurt anyone, so that’s why ACE Team decided to improve the multiplayer feature of the game. Play with up to four players online in a 2v2 match to the death with the ability to customize banners and colors for your “units.” Oh, and did we mention that opposing tracks can now intersect each other?  - A Positively Absurd Art Style - Just like in the original game, ACE Team has created various levels inspired by the greatest art periods in history.  Players will gaze upon exquisite art from the Egyptians, Late Gothic and Early Renaissance era, Surrealist movement, as they carve a path of destruction with their rolling rocks of doom!   - Improved Physics and Destructible Environments - With upgraded physics and even more things to be cracked, crushed, flattened, and slammed, rolling various rocks down a hill has never been a more pleasant experience! - Utter Chaos - With the addition of brand new defensive units and unique boulders with special traits, chaos reigns supreme so be sure not to take each turn for granite.", "platform": "Nintendo Switch", "release_date": "May 14, 2019", "game_type": "Released", "esrb": "Not Rated", "developers": "ACE Team Software", "publishers": "Sega of America", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118767-rock-of-ages-2-bigger-boulder\n"}