{"altername_name": [], "name": "Rocket League", "overview": "Rocket League's gameplay is largely the same as that of its predecessor Supersonic Acrobatic Rocket-Powered Battle-Cars. Players control a rocket-powered car and use it to hit a ball that is much larger than the cars towards the other team's goal area to score goals, in a way that resembles a soccer game, with elements reminiscent of a demolition derby. Players' cars have the ability to jump to hit the ball while in mid-air. The players can also pick up a speed boost by passing their cars over marked spaces on the field, enabling them to quickly cross the field, use the added momentum to hit the ball, or ram into another player's car to destroy it; in the latter case, the destroyed car respawns moments later. A player may also utilize boost when in the air to propel themselves forward in flight, allowing players to hit the ball in the air. Players can also perform quick dodges, causing their car to do a short jump and spin in a given direction, which can be used to nudge the ball or gain positioning advantage over the other team. Matches are typically five minutes long, with a sudden death overtime if the game is tied at that point. Matches can be played from between one-on-one up to four-on-four players, as well as casual and ranked. Rocket League also includes a competitive ranked online mode, where players compete in various tiered ranks within game seasons, with victories or losses raising or lowering a player's rank, respectively. The game includes a single-player \"season\" mode, with the player competing with computer-controlled players. An update in December 2016 introduced \"Custom Training\" sequences that can be created by players and shared with others on the same platform; players are able to specify the ball's path and the presence and skill of opponents on the field as to practice specific shots-on-goal over and over.", "platform": "Nintendo Switch", "release_date": "November 14, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "Psyonix", "publishers": "Psyonix", "genres": "Racing", "max_players": "6", "cooperative": "No", "rating": "4.15", "wikipedia": "https://en.wikipedia.org/wiki/Rocket_League", "video_link": "https://www.youtube.com/watch?v=E-npTExzey0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/91347-rocket-league\n"}