{"altername_name": [], "name": "RollerCoaster Tycoon 3: Complete Edition", "overview": "Build the park of a lifetime and rediscover the critically acclaimed rollercoaster simulation bestseller. Brought to life in this new Complete Edition, relive the full RollerCoaster Tycoon 3 experience or dive in for the first time and feel the thrill of a genre-defining classic, complete with both Soaked! and Wild! expansion packs. Your Park. Your Way Whatever you want to create, RollerCoaster Tycoon 3 gives you the tools and freedom to build the amusement park of your dreams. Manage like a tycoon and make your way to the top Control park finances, shops, services and staff to succeed in dozens of scenarios. Become a true tycoon and embark on your promising new career, or create your ideal park without money woes in sandbox mode. Satisfy your guests’ needs and keep your park running smoothly to succeed. Get ready to get ‘Soaked!’ and venture into the ‘Wild!’ This complete edition includes all content from both Soaked! and Wild! expansion packs. Relish the added challenge of creating and managing exhilarating waterparks and spectacular animal habitats. Reimagined for Nintendo Switch Experience a reimagined interface on the go with intuitive new controls designed to help you build the ultimate theme park anytime, anywhere. Ride the Rides Ride your creations with RollerCoaster Tycoon 3’s signature coaster cam. Packed full of content You’re free to fill your bustling park with more than 300 coasters and rides, 500 scenery pieces, 60 shops and services, and 20 animals to rear and raise. Peep Designer Create your own guests and experience your creations through their eyes MixMaster Wow your visitors with custom laser light and firework displays to delight and dazzle.", "platform": "Nintendo Switch", "release_date": "September 24, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Frontier Developments", "publishers": "Frontier", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156031-rollercoaster-tycoon-3-complete-edition\n"}