{"altername_name": [], "name": "Romancing SaGa: Minstrel Song: Remastered", "overview": "The original Romancing SaGa -Minstrel Song- included many of the SaGa series trademark elements, such as the Glimmer and Combo mechanics and was considered to be the epitome of the series when it first released. The free scenario system that lets you create your own storyline remains at the core of the game, letting you select one of eight protagonists with completely different origins and backstories, then set off on a unique journey. This remastered edition has evolved in all areas, featuring upgraded HD graphics and numerous enhancements to improve playability. This makes it highly recommended for both fans of the original and newcomers to the SaGa series. ------------------------------------------------------------------ ■Story The gods created man and man created stories. The primordial creator Marda brought forth the land of Mardias. In ages past a mighty battle rocked this land, when Elore, the king of the gods, fought three malicious deities: Death, Saruin and Schirach. After a long and drawn-out struggle, Death and Schirach were sealed away and rendered powerless, with the final deity Saruin also trapped through the power of the Fatestones and the noble sacrifice of the hero Mirsa. Now 1000 years have passed since that titanic battle. The Fatestones lie scattered across the world and the gods of evil are resurgent once more. Eight heroes set off on their own journeys, as if guided by the hand of fate. What tales will these adventurers weave across the vast tapestry of Mardias? You are the only one who can decide! ------------------------------------------------------------------ ▷New Elements In addition to a full HD graphical upgrade, various new features expand the gameplay even further. ■The sorceress Aldora can now be recruited! The sorceress Aldora, who once traveled together with the legendary hero Mirsa, appears in her original form. Experience new events where she recounts the journeys of Mirsa first hand. ■Unique and interesting characters now made playable! Fan-favourite Schiele finally joins your adventures and characters such as Marina, Monica and Flammar can now also be recruited. ■Enhanced bosses! Several bosses now appear as super powerful enhanced versions! Take on these terrifying adversaries to a new arrangement of the battle music score. ■Improved playability! Various new features have been added to make your play experience even more convenient, such as a high speed mode, mini maps, and a “New Game +” option that lets you carry over your progress when you play through the game again. ■And even more... ・New classes to expand the breadth of gameplay.", "platform": "Nintendo Switch", "release_date": "December 1, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167573-romancing-saga-minstrel-song-remastered\n"}