{"altername_name": [], "name": "Root Film", "overview": "Root Film is a thrilling adventure game with visual novel elements. Follow Rintaro Yagumo as he is selected to be the director for the rebooted \"Shimane Mystery Drama Project”, a TV series which was cancelled for an unknown reason 10 years ago. His excitement for this amazing opportunity is quickly curbed when a horrible murder interrupts their location scouting process. Follow him and a cast of unique and memorable characters as they are drawn deeper into a thrilling mystery. Become your own detective as you unravel the truth through investigative gameplay mechanics, adding a new layer onto the visual novel formula. Beautifully hand-drawn illustrations From character designs to environments, Root Film is brought to life by gorgeous artwork. Every scene becomes picture perfect, with meticulous detail and a carefully curated color pallet. Travel across the Shimane prefecture Visit multiple locations spanning the entire Shimane prefecture as you try to find out the truth about \"Shimane Mystery Drama Project”! Become your own detective The ‘Intuition’ mechanic allows players to acquire keywords during in-game conversations. Once activated, ‘Intuition’ reveals words on screen that are essential to investigations and confrontations. Face off against suspects After collecting enough keywords, you can confront suspects in ‘Max Mode’ to resolve a mystery. In this fighting-game like face-off, you must ensure that enough evidence has been collected before the confrontation to successfully bring suspects to justice.", "platform": "Nintendo Switch", "release_date": "March 19, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Kadokawa Games", "publishers": "PQube Limited", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "https://en.wikipedia.org/wiki/Root_Film", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160749-root-film\n"}