{"altername_name": [], "name": "Saints Row: The Third: The Full Package", "overview": "Saints Row®: The Third™ - The Full Package gives you control of the Saints at the height of their power, and you live the life to show for it. Put the wildest chapter of the Saints Row saga in the palms of your hands for the first time on Switch. You bring the fight to Steelport, a sordid city of sin drowning in sex, drugs, and (a lot of) guns. This is your City. These are your rules. Years after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobblehead dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrity status has not gone unnoticed. The Syndicate, a legendary criminal fraternity with pawns in play all over the globe, has turned its eye on the Saints and demands tribute. Refusing to kneel to the Syndicate, you take the fight to Steelport, a once-proud metropolis reduced to a struggling city of sin under Syndicate control. Take a tank skydiving, call in a satellite-targeted airstrike on a Mexican wrestling gang, and defend yourself against a highly-trained military force using only a sex toy in the most outlandish gameplay scenarios ever seen. Saints Row®: The Third™ - The Full Package is the definitive release of one of gaming’s most beloved entries, playable on a Nintendo system for the first time ever with new features for Nintendo Switch™.", "platform": "Nintendo Switch", "release_date": "May 10, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "", "publishers": "koch Media", "genres": "", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Saints_Row:_The_Third", "video_link": "https://www.youtube.com/watch?v=kv-6oWgssg0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/115211-saints-row-the-third-the-full-package\n"}