{"altername_name": [], "name": "Sam & Max Beyond Time and Space", "overview": "Join the Freelance Police on a bizarre adventure from the North Pole to the Fountain of Youth, from outer space to Hell and back. Sam & Max: Beyond Time and Space is a remastered version of Telltale’s second season of episodic Sam & Max games, lovingly updated by a small team of the original developers. Sam is a six-foot canine detective with a nose for justice. Max is a hyperkinetic rabbity-thing with a taste for mayhem. Together, they’re the Freelance Police—an irreverent comedy duo whose esoteric crime-fighting style has been entertaining comic book and video game fans for more than thirty years. In this five-episode collection of interconnected cases, Sam & Max are back on the crime beat in a showdown with Santa Claus, a race to subdue a giant volcano, and a faceoff with a Eurotrash vampire. And then things get even weirder. Is paranoid shopkeeper Bosco on to something with his talk of a grand conspiracy? Is diner proprietress Stinky hiding the truth about what happened to her grandfather (also named Stinky)? Will flaky neighbor Sybil Pandemik ever find true love? Did someone say… BIRTHDAY?! Hop into the DeSoto for a hilarious outing that won IGN’s Adventure Game of the Year award the first time around and now looks and sounds better than ever, with gorgeous HD graphics, overhauled lighting and lip-sync, finessed cinematography, remastered audio, and eight all-new musical tracks featuring live jazz musicians. Zombies will dance. Mariachis will sing. A giant battle robot will trash the streets. And when their friends’ lives are on the line, Sam and Max will risk their very souls to set things right.", "platform": "Nintendo Switch", "release_date": "December 8, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Skunkape Games", "publishers": "Skunkape Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/Sam_%26_Max_Beyond_Time_and_Space", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157148-sam-max-beyond-time-and-space\n"}