{"altername_name": [], "name": "Sam & Max Save the World", "overview": "Sam & Max Save the World is a graphic adventure video game developed by Telltale Games. The game was originally released as Sam & Max: Season One before being renamed in early 2009. Save the World was developed in episodic fashion, comprising six episodes that were released for Microsoft Windows over the course of late 2006 and early 2007. The episodes were initially distributed online by GameTap and Telltale Games themselves, although the later retail releases of the game were published by The Adventure Company and JoWooD Productions in North America and Europe respectively. A Wii port of the game was published in late 2008, and an Xbox Live Arcade version was released in mid-2009. A remaster of the game by Skunkape Games was released in December 2020 for Nintendo Switch and Microsoft Windows, and in August 2021 for Xbox One. Based on Steve Purcell's comic book series Sam & Max, the game follows the title characters Sam and Max—self-styled vigilante private investigators, the former an anthropomorphic dog and the latter a \"hyperkinetic rabbity thing\"—through several cases involving a hypnotism conspiracy. Each episode features one case with a contained story, with an underlying plot running through the series. The game was announced by Telltale Games in 2005 following the cancellation of Sam & Max: Freelance Police by LucasArts in the preceding year; many of the employees at Telltale Games were members of the Freelance Police development team.", "platform": "Nintendo Switch", "release_date": "December 2, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Telltale Games", "publishers": "Skunkape Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Sam_%26_Max_Save_the_World", "video_link": "https://www.youtube.com/watch?v=vIajN-DDmIk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154217-sam-max-save-the-world\n"}