{"altername_name": [], "name": "Sea of Solitude: The Director's Cut", "overview": "Adventure through a beautiful and troubling world where nothing is as it seems, to confront and conquer your fears. Kay knows monsters. Monsters that you know, too. Loneliness, depression, and abandonment take on the form of frightening beasts and fantastical creatures in the award-winning Sea of Solitude, an action/adventure game revisited for Nintendo Switch™, now as The Director’s Cut. Adventure through a beautiful and troubling world where nothing is as it seems, to confront and conquer your fears. Featuring a deeply moving script by Cornelia Geppert, Sea of Solitude: The Director’s Cut takes you through a drowned city where light has been submerged in darkness, and metaphorical creatures evoke painful emotions that Kay must face and overcome. Journey with Kay by boat and on foot, navigate harsh landscapes, solve puzzles and confront the monsters to help her find her inner peace and her sea of solitude. Experience an ever-evolving world rendered in lush visuals and supported by a mesmerizing score, and bring to the surface the inner strength that lies within us all. Nominee, “Games for Impact” at The Game Awards 2019 Winner, “Most Significant Impact” at the Games for Change Awards 2020 Key features: - An emotional adventure — Sea of Solitude: The Director’s Cut takes you on a beautiful and heart-pounding action-adventure with Kay, a girl so hopeless that she has turned into a monster. Guide her through the tempest towards tranquility as she faces off against relentless beasts of her own making who want to see her capsize and drown, unless she can summon the inner strength to face them. - A beautiful and troubling universe – Set in a fantastical drowned world, explore the unique and ever-changing environments by swimming, running and navigating, encountering monsters and overcoming challenging obstacles along the way. - Only for Nintendo Switch™ — With features exclusive for Nintendo Switch™, immerse yourself in the world of Sea of Solitude: The Director’s Cut with a customizable photo mode, gyroscope integration, and more that brings the director’s vision to life like never before. - Updated from 2019 version – The Director’s Cut features a rewritten script, a new cast of voice actors, and augmented cut scenes and animations that convey the narrative and gameplay experience in the most complete way.", "platform": "Nintendo Switch", "release_date": "March 4, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Jo-Mei", "publishers": "Quantic Dream", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156043-sea-of-solitude-the-directors-cut\n"}