{"altername_name": [], "name": "SEGA AGES Columns II", "overview": "This is the second installment of the smash hit puzzle game fascinated by beautiful jewel graphics. Arrange three or more jewels in the vertical and horizontal, and keep many rules for erasing them one after another. You can enjoy two types of games, the one-player game “Flash Columns” and the “Competitive Columns” that have become stage clear. In this Nintendo Switch ™ version, the difficulty level, network battles & addition of online rankings, as well as the new one-player mode “Infinite Columns”, the first column “Columns I” can be played as they are. Is added, and it becomes one volume full score that can enjoy various columns. Arcade Mode – “Flash Columns”: a stage clear-style game where you match jewels to eliminate them – “VS Columns”: aim for chains to push up the opponent’s field; by eliminating the skull that appears after a certain period of time, the floor will rise and the field will get smaller – New element: a stage select feature has been added to Flash Columns, allowing you start from any of the 70 stages – New element: a “Skull Cut” option has been added, which stops the appearance of skulls – New element: the second player’s field can be flipped 180 degrees and the Switch placed on the floor / table to play VS Mode face-to-face – New element: “Stage Design” option has been added, which allows you to set the design of the field and jewels to your liking – either “Random” or “Columns I” Infinite Columns – New mode – The basic rules are the same as Arcade Mode’s Flash Columns – Rather than a stage clear-style game, it is an endless play-style game – After a certain amount of time passes while playing, jewels will be added to the bottom row so that the floor gradually rises – By eliminating flashing jewels, all jewels of the same color will be eliminated Columns I – Enjoy endless play based on the origin of the series, the original Columns (Genesis / Mega Drive version) – When you start the game, you can choose from three background songs – This is the same Columns included with the paid “Game Pack” add-on for the Yakuza 0 Companion App for PS Vita Network VS – Compete against online players across the country in Arcade Mode’s VS Columns Jewel Box – Check the status of the stages you have cleared in Arcade Mode’s Flash Columns – Depending on your level of achievement, you will be able to see brief profiles for Round Girl and Round Boy, the characters that appear in the opening movies of SEGA Ages titles", "platform": "Nintendo Switch", "release_date": "August 8, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "M2 Co., Ltd.", "publishers": "Sega of America", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118884-sega-ages-columns-ii\n"}