{"altername_name": ["Sense"], "name": "Sense: A Cyberpunk Ghost Story", "overview": "Inspired by classic adventure games and the origins of the survival horror genre, Sense – A Cyberpunk Ghost Story celebrates the slow, cerebral creep of dread instead of relying on over-the-top action or jump scares. With careful attention to pacing, atmosphere and storytelling, this futuristic tale seamlessly blends 2.5D exploration and problem solving with suspenseful ghost encounters that act as paranormal glitches in our own reality. In Neo Hong Kong, 2083, a young woman named Mei Lin Mak is dragged into a maelstrom of supernatural horror. As she peers into the century old mystery, Mei is forced to question her perception of reality and her trust of her cybernetic eyes. Under the neon lights of a cyberpunk cityscape, the ruins of the Chong Sing Apartments hide a bloody secret illuminated by the traditions of Chinese folklore and innovations of the industrial future. If there is any hope of escaping this nightmare, Mei Lin must explore this complex, piecing together stories of 14 lost souls and discovering the truth of her own family curse. Features: • Survive the horror using adventure mechanics and exploration. • Experience a beautiful, erotic hand-painted art style with Eastern and Western influences. • Unlock additional outfits, some of which alter interactions throughout the game. • Keep track of the immersive lore with a convenient journal feature. • Discover multiple New Game+ modes, alternate endings and hidden extras! • Get in the mood with a visceral cinema-length soundtrack.", "platform": "Nintendo Switch", "release_date": "January 27, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Top Hat Studios", "publishers": "eastasiasoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "https://en.wikipedia.org/wiki/Sense:_A_Cyberpunk_Ghost_Story", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150824-sense-a-cyberpunk-ghost-story\n"}