{"altername_name": [], "name": "Shadows Over Loathing", "overview": "Mobsters, monsters, and mysteries — welcome to Shadows Over Loathing, the shady side of an already black-and-white world, and a follow-up to the award-winning West of Loathing. Your Uncle Murray has requested your aid at his antique shop in Ocean City, but upon your arrival the old man is nowhere to be found. Your investigation into his disappearance and the artifacts he’s been collecting takes a turn when you stumble across some shadowy plots (and a bunch of squirming eldritch tentacles) that threaten to bring about the end of the world. Explore a sprawling open world chock full of danger, quests, puzzles, and stick figures in this single-player comedy adventure/RPG set in the prohibition era of the Loathing universe. See how many enemies you can stuff into a phone booth as the athletic Pig Skinner, control the curds and whey of the cosmos as the cunning Cheese Wizard, or march to the beat of your own inscrutable purposes as the hip Jazz Agent. Features: - Thousands and thousands of jokes, gags, and goofs - A bunch more locations, items, friends, foes, and familiars than West of Loathing - The same quality line art you’ve come to expect, but way more of it - Superior stick-figure customization - Strategic turn-based combat (but only if you want it) - A corrupt government for you to overthrow at your leisure - Authentically baffling 1920s slang - Multiple cursed antiques - Inappropriate fishing - Non-Euclidean horrors from beyond the edges of the screen - A time-travel side-quest given to you by your future-self - An infinitely tall building - Sentient math, talking frogs, and pettable cats - No booze, as far as the feds know", "platform": "Nintendo Switch", "release_date": "April 19, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "Asymmetric", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368443-shadows-over-loathing\n"}