{"altername_name": [], "name": "Shadowrun: Dragonfall: Director's Cut", "overview": "Shadowrun: Dragonfall - Director’s Cut is a standalone release of Harebrained Schemes' critically-acclaimed Dragonfall campaign, which first premiered as a major expansion for Shadowrun Returns. The Director's Cut adds a host of new content and enhancements to the original game making it the definitive version on consoles of this one-of-a-kind cyberpunk RPG experience. Man Meets Magic & Machine In 2012, magic returned to our world, awakening powerful creatures of myth and legend. Among them was the Great Dragon Feuerschwinge, who emerged without warning from the mountains of Germany, unleashing fire, death, and untold destruction across the countryside. It took German forces nearly four months to finally shoot her down - and when they did, their victory became known as The Dragonfall. It’s 42 years later - 2054 - and the world has changed. Unchecked advances in technology have blurred the line between man and machine. Elves and trolls walk among us, ruthless corporations bleed the world dry, and Feuerschwinge’s reign of terror is just a distant memory. Germany is splintered - a stable anarchy known as the “Flux State” controls the city of Berlin. It’s a place where power is ephemeral, almost anything goes, and the right connections can be the difference between success and starvation. For you and your team of battle-scarred shadowrunners, there’s no better place to earn a quick payday. Now, a new threat is rising, one that could mean untold chaos and devastation. One that soon has you and your team caught on the wrong side of a deadly conspiracy. The only clue: whispers of the Dragonfall. Rumors that the Great Dragon Feuerschwinge may still be alive, waiting for the right moment to return… Key Features A Classic, Story-Driven cRPG adapted to consoles: Dragonfall hearkens back to the golden age of computer RPG’s with a novel-like branching narrative full of sharp prose and deep character development. Immerse yourself in a smart, 20+ hour campaign with a diverse cast of all-too-human characters. A One-of-a-Kind Cyberpunk Setting: Experience the unique “Tech meets Magic” dystopian future of Shadowrun, a fan-favorite game setting. Shadowrun: Dragonfall - Director’s Cut is the perfect entry point to the setting for those with no prior Shadowrun experience, while providing plenty of classic Shadowrun characters and tech for veteran players to sink their teeth into. Command Your Team: Lead a small team of shadowrunners - each with their own outlook, motivations, and backstory. The members of your team are designed to play contrasting roles during missions, and each has a distinct set of skills, abilities, strengths, and weaknesses. But it’s not all about the mission - each team member also has challenges to face in their own lives, which you can choose to brush aside or play an important part in. Gripping, Turn-Based Tactical Combat: When you’re running the shadows, every turn matters. Choose your actions wisely - move to better cover, charge into melee, or lob a fireball into a crowd of enemies. With over 200 weapons and spells at your disposal, every turn is filled with meaningful choices. Skill-Based Character Progression: Choose a starting character archetype and build from there! Street Samurai and Physical Adepts use advanced combat skills to dominate the battlefield, Shamans and Mages summon powerful allies and cast deadly spells, while Riggers and Deckers provide critical technological support, projecting their consciousness directly into drones and computer systems. Shadowrun: Dragonfall’s classless skill system allows you to grow your character in any direction you choose. Updated/Redesigned UI: To better experience this cult-classic on consoles, the UI has been redesigned to meet the needs of console players!", "platform": "Nintendo Switch", "release_date": "June 21, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "Harebrained Schemes", "publishers": "Paradox Interactive", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Shadowrun:_Dragonfall", "video_link": "https://www.youtube.com/watch?v=vKCEbwAJXTY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163245-shadowrun-dragonfall-directors-cut\n"}