{"altername_name": [], "name": "Shantae", "overview": "Shantae is a platform-adventure game, in which players play as the eponymous Shantae, a half-genie who must travel across various areas in order to stop the evil lady pirate Risky Boots. Shantae's default attack involves using her hair like a whip. Shantae can also use gems obtained from defeated enemies to purchase items, such as life-restoring potions and damaging items with various uses, as well as learn upgraded combat moves. The game features five towns, with various areas filled with enemies and obstacles in between them. In order to progress through the game, Shantae must seek out various characters who will open up dungeons, with each dungeon containing a guardian genie that will teach Shantae a new dance. By using these dances, Shantae can transform herself into different animals, including a monkey that can climb on walls, an elephant that can smash objects such as boulders and tree stumps, a spider that can climb across webbing in the background, and a harpy that can fly in mid-air. Shantae must use these abilities to reach new areas or find hidden items. The game features a day and night cycle, with enemies becoming stronger during the night. During nighttime, players can collect hidden fireflies, with a reward available for collecting them all. Other collectible creatures include Warp Squids, which are squid-shaped items hidden within dungeons, and which can be given to larger mother squids in each town in exchange for the ability to instantly warp there. Finally, heart vessels can be obtained to increase Shantae's maximum health. The game also features various mini games, such as dancing or gambling, in order to earn additional gems.", "platform": "Nintendo Switch", "release_date": "April 22, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "WayForward Technologies", "publishers": "Limited Run Games", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.58", "wikipedia": "https://en.wikipedia.org/wiki/Shantae_(video_game)", "video_link": "https://www.youtube.com/watch?v=05FyZZj5dKM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151177-shantae\n"}