{"altername_name": [], "name": "Shining Resonance Refrain", "overview": "Shining Resonance Refrain is a Japanese role-playing game developed by O-Two Inc. and published by Sega. Originally developed by Media.Vision, it is an entry in Sega's Shining series of video games, and an expanded and remastered version of the Japan-only Shining Resonance released for the PlayStation 3 in 2014. While the original PS3 release was not translated into English, Refrain was released in July 2018 for Microsoft Windows, Nintendo Switch, PlayStation 4, and Xbox One platforms. The game follows Yuma Ilvern, who holds the Spirit of the Shining Dragon, an ancient Dragon who died in an ancient war. At the start of the game, Yuma is held captive in Gaelritz Prison with an attempted rescue mission by Sonia Blanche and Kirika Towe Alma on the way. After a confrontation with Excella Noa Aura and her three spears, Yuma summons the Blade of the Shining Dragon, the Vanderhorn. They then manage to escape on the back of the Shining Dragon after Yuma transformed into him and return to Marga, the capital of Astoria. When he wakes up back as Yuma, he joins Astoria in their war against the Empire alongside the Dragoneers and the Princess of Astoria in an attempt to achieve peace for their people. The game plays as a traditional J-RPG with action-based battles. Interactions between the main character and others affect their \"relationship level\"; talking while resting or camping initiates special story scenes, which in turn can lead to dating scenes the following day. It received mixed reception upon release, according to review aggregator Metacritic, but saw more popularity in Japan.", "platform": "Nintendo Switch", "release_date": "July 10, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Media.Vision", "publishers": "Sega", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Shining_Resonance_Refrain", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118755-shining-resonance-refrain\n"}