{"altername_name": [], "name": "Signalis", "overview": "Searching for dreams inside of a nightmare Awaken from slumber and explore a surreal retrotech world as Elster, a technician Replika searching for her lost partner and her lost dreams. Discover terrifying secrets, challenging puzzles, and nightmarish creatures in a tense and melancholic experience of cosmic dread and classic psychological survival horror. Fatal exception SIGNALIS is set in a dystopian future where humanity has colonized the solar system, and the totalitarian regime of Eusan maintains an iron grip through aggressive surveillance and propaganda. Humanoid androids known as Replikas live among the populace, acting as workers, civil servants, and Protektors alongside the citizens they are designed to resemble. The story of SIGNALIS begins as a Replika named Elster awakens from cryostasis in a wrecked vessel. Now stranded on a cold planet, she sets out on a journey into depths unknown. Classic survival horror gameplay Experience fear and apprehension as you encounter strange horrors, carefully manage scarce resources, and seek solutions to challenging riddles. Cold and distant places Explore the dim corners of a derelict spaceship, delve into the mysterious fate of the inhabitants of a doomed facility, and seek what lies beneath. A dream about dreaming Discover an atmospheric science-fiction tale of identity, memory, and the terror of the unknown and unknowable, inspired by classic cosmic horror and the works of Stanley Kubrick, Hideaki Anno, and David Lynch. A striking vision Wander a brutalist nightmare driven by fluid 3D character animations, dynamic lights and shadows, and complex transparency effects, complemented by cinematic sci-fi anime storytelling.", "platform": "Nintendo Switch", "release_date": "October 27, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "rose-engine", "publishers": "Humble Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Signalis", "video_link": "https://youtu.be/4KFiOp2o4L8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168023-signalis\n"}