{"altername_name": ["Sky Gamblers: Air Supremacy 2"], "name": "Sky Gamblers: Air Supremacy II", "overview": "THIS IS THE ULTIMATE JET FIGHTER COMBAT GAME! With an extensive single player campaign and delightful multiplayer modes, the non-stop action will keep you at the edge of your seat! Sky Gamblers: Air Supremacy 2 is a dogfight simulator taking its roots from the original classic hit. Rich combat mechanics and a spot-on balance between simulation and arcade make it accessible to all player types and allows for a personalized experience with varied control schemes and play styles. The single player campaign takes the player into a dark and grim future where air supremacy is all that prevents the world balance of power from collapsing. The 14 missions take you through different challenges across the world with both air to ground and air to air engagements. Action takes place across multiple locations from dense urban areas like San Francisco and Rio de Janeiro to lush locations like archipelagos and sandstone pillars. Each map has its own vibe and set of challenges while favoring different flight styles. Online multiplayer allows players to compete in real-time in a variety of game modes and truly push your skills to the limit. Features: 18 different aircraft choices, each with 4 load-out variants Extensive story driven campaign spanning across 14 missions Online multiplayer with up to 7v7 battles Three difficulty levels for replay challenge Customizable paint jobs and jet badges 7 custom game modes on 7 different maps with varied objective layout Varied arsenal of missiles and rockets Easy to use evasive flight maneuvers", "platform": "Nintendo Switch", "release_date": "March 24, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Atypical Games", "publishers": "Atypical Games", "genres": "Action", "max_players": "14", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=NE6YduD1owc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160728-sky-gamblers-air-supremacy-ii\n"}