{"altername_name": ["Sonic Colours: Ultimate"], "name": "Sonic Colors: Ultimate", "overview": "Join Sonic in the high-speed adventure of a lifetime! The evil Dr. Eggman has built a gigantic interstellar amusement park bursting with incredible rides and colorful attractions–but he’s powering it with a captured alien race called “Wisps.” Use Sonic’s lightning speed to free the Wisps and learn the secrets of their amazing powers as you explore six unique colorful worlds, each filled with dangerous enemies and hurdles to overcome. Now with stunning upscaled visuals, additional features, a new game mode, and enhanced gameplay–it's the Ultimate Sonic Colors experience. Sonic will be tested on this exciting journey to free the Wisps - but with their help, and yours, it's a test he'll pass with flying Colors! SONIC SPEED AND NON-STOP ACTION Accelerate to adrenaline-pumping super speed, zoom across challenging worlds, and maneuver through hazardous obstacles. Time your attacks perfectly to charge your Boost and reach Super Sonic speeds. INTERSTELLAR AMUSEMENT PARK Explore and adventure through immersive environments, like a Sweet Mountain filled with delightful sweets or an Aquarium Park filled with sea life and countless pools–all centered around a mysterious astro-amusement park. WISP POWER-UPS Transform Sonic by harnessing the magnificent alien power of Wisps to defeat enemies and discover the secrets of the interstellar amusement park. Pass through solid objects and discover alternate paths using the new Jade Wisp. BETTER THAN EVER Available on all platforms and now more colorful than ever with enhanced visuals and graphics (4K on PlayStation and Xbox), refined controls, and many more gameplay upgrades. 'RIVAL RUSH' MODE Put your skills to the test and go head-to-head with Metal Sonic. Outrun Metal Sonic to unlock rewards!", "platform": "Nintendo Switch", "release_date": "September 7, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "Blind Squirrel Entertainment", "publishers": "Sega", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "4.24", "wikipedia": "https://en.wikipedia.org/wiki/Sonic_Colors", "video_link": "https://www.youtube.com/watch?v=Z3MCqTdsVKc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/152758-sonic-colors-ultimate\n"}