{"altername_name": ["South Park: The Fractured but Whole: Standard Edition"], "name": "South Park: The Fractured but Whole", "overview": "A new power is rising to combat this evil. An entire squad of superheroes will rise, led by a nocturnal scavenger sworn to clean the trash can of South Park society. The kids are playing superheroes, and Cartman is determined to turn Coon and Friends into the biggest superhero franchise of all time. However, the villainous Professor Chaos emerges with an evil plan to eliminate Coon and Friends. The heroes need to work as a team to fight the chaos and terror that that grips the town. From the creators of South Park, Trey Parker and Matt Stone, comes South Park™: The Fractured But Whole™, a sequel to South Park™: The Stick of Truth™, winner of 25 video game awards. Players will once again assume the role of the New Kid. As the newest member of Coon and Friends, you must create your own superhero, build up your notoriety, and use your superpowers to save South Park. Only then will Coon and Friends take their rightful place as the greatest team of superheroes ever assembled, and get the movie deal they so richly deserve. In a city gripped by chaos, Coon and Friends rise to save the day. PLAY SOUTH PARK ANYTIME, ANYWHERE The outrageously offensive superhero adventure is now available on Nintendo Switch. Enjoy the full South Park: The Fractured But Whole RPG adventure anytime, anywhere. A HERO'S ORIGIN REVEALED Every hero has a beginning. Are you an alien, a high-tech wonder, or a genetically altered mutant? Create your own one-of-a-kind costume, craft your origin story, and build out your unique superpowers to become the hero this city needs. EXPLORE SOUTH PARK AT NIGHT Not only has South Park grown with new places to explore and new characters to discover, but when the sun sets, havoc and chaos reign as the seedy underbelly of South Park comes alive. At night, a whole new world opens up where your alter ego can harness its powers to do whatever it takes to save the town. COON AND FRIENDS, ASSEMBLE! Recruit up to 12 members of Coon and Friends to your cause, including Mysterion, The Human Kite, and the infamous Coon himself. Combine your special powers with the heroes from Coon and Friends to eliminate anyone that gets in your way and defeat the dark power that has spread its evil tentacles over South Park. AN OUTRAGEOUS RPG ADVENTURE An all-new dynamic combat system offers new opportunities to manipulate time and space on the battlefield, and a revamped looting and crafting system gives you the freedom to develop and refine your powers as you progress through the game. Find loot hidden throughout the land and follow recipes to craft your own outrageous equipment to aid you in battle. AUTHENTIC SOUTH PARK This highly anticipated sequel features more than twice as much content as South Park™: The Stick of Truth™. Created, written, voiced, and directed by Trey Parker and Matt Stone, South Park™: The Fractured But Whole™ is authentic, interactive South Park at its finest – hilarious, outrageous, and a whole lot of fun.", "platform": "Nintendo Switch", "release_date": "April 24, 2018", "game_type": "Released", "esrb": "M - Mature", "developers": "Ubisoft Studio SF", "publishers": "Ubisoft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.06", "wikipedia": "https://en.wikipedia.org/wiki/South_Park:_The_Fractured_but_Whole", "video_link": "https://www.youtube.com/watch?v=E1hicf2zVkk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/111963-south-park-the-fractured-but-whole\n"}