{"altername_name": [], "name": "Space Marshals 2", "overview": "Tactical Combat & Stealth action in Outer Space. The sci-fi wild west adventure in outer space continues with Space Marshals 2. This tactical top-down shooter puts you in the shoes of specialist Burton in his struggle against the criminal elements of the galaxy. This isn’t your ordinary dual-stick shooter. The emphasis is on tactical combat and stealth, rather than just spraying bullets, and there’s a story! TACTICAL COMBAT Use the environment to your advantage. Avoid attacks by taking cover. Flank enemies for extra efficiency, but avoid getting flanked yourself! Use the tools of the trade to gain an edge - frag grenades, flash bangs, drones, gun turrets, proximity mines and much more… STEALTH Choose your approach carefully. Some say running into the fray, guns blazing, isn’t always the answer. Use distractions to single out opponents. Use stealth takedowns and silenced weapons to covertly reduce the enemy numbers. Hack gun turrets to turn on their masters. Lure different enemy factions together and let them fight each other. LOAD-OUT & GEAR Choosing your load-out is a big part of your tactics. In addition to body armor and grenades you can carry one two-handed and one single-handed weapon - and there’s something for everyone. Shotguns, handguns, assault rifles, sniper rifles, crossbows, energy weapons, throwing axes and more. - Tactical top-down shooter - Gorgeous. stylistic HD graphics - 20 missions with performance based rewards. TAMI is watching you! - Wide selection of weapons and gear. Over 70 different weapons. - Multiple factions to fight – or pitch against each other", "platform": "Nintendo Switch", "release_date": "August 19, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Pixelbite Games", "publishers": "Pixelbite AB", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154755-space-marshals-2\n"}