{"altername_name": [], "name": "Space Stella: The Unknown Planet", "overview": "Aliens invaded the planet that mankind was pioneering, and the exploration team went missing. The search team left to determine the cause, but their spaceship was attacked and only the main character survived. He fights a desperate battle to survive and find out the secret. Enjoy exciting TPS games using a variety of play modes and hot weapons that are released in level-up. · It is a TPS-style action and shooting game that is easy to operate and full of excitement. · Enjoy SF-style high quality graphics. · It's an interesting story game in which the protagonist overcomes a crisis and fights aliens during space exploration. · There are vast and diverse worlds such as the interior of the spaceship, the background of the SF design, and extraterrestrial planets. · There are story mode and additional mode, so you can enjoy them more fun. · [EPISODE] mode fights for mission clear according to the story. · [WAVE] mode requires you to defeat aliens that appear every certain time by yourself. · [INFINITY] mode requires you to defeat aliens who constantly rush and hold out for as long as possible. ·If you clear the mission stage, you can increase your experience and level up. ·You can use new weapons by leveling up. ·You can enjoy a thrilling battle with the spectacular 3D graphic effect. ·There is an element of fun collection that collects weapons of various future designs. ·Enjoy the fun of growing up to upgrade characters and weapons. Being the main character of Space Stella, wipe out aliens and clear all missions. The last ending with a secret is waiting for you! Prolog The Earth's scientific civilization develops to an ultra-high degree and establishes space civilization. In addition, thanks to the development of the warpgate device, interplanetary movement has become very fast, and humans can easily reach the distant universe. Meanwhile, an unknown planet is discovered, and mineral resources that humans can use for millions of years are discovered there. Humans sent an exploration team to develop the planet and built colonies to study and extract its resources... One day, the exploration team disappeared and communication was cut off. It feels unusual on Earth, and a search team including combatants is dispatched to investigate the disappearance of the exploration team and rescue them. But...", "platform": "Nintendo Switch", "release_date": "January 13, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "HitGames Studio", "publishers": "Troooze, Inc.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=XWvoOmqBK88", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/157381-space-stella-the-unknown-planet\n"}