{"altername_name": [], "name": "Sparklite", "overview": "Sparklite is an action-adventure set in the whimsical and ever-changing land of Geodia. Battle foes in top-down action using an arsenal of gadgets, guns, and gear. Explore dangerous corners of the procedurally generated world, take down titans of the mining industry, and harness the power of Sparklite! Everything in the world of Geodia is tied together by Sparklite... it's the life force of the planet, and the inhabitants have learned how to channel it safely. The blue, glowing ore can be harnessed providing a low-level, rechargeable power source. Or, for those brave or greedy enough, it can be consumed for a surge of power with grave consequences. Geodia’s self-titled \"Baron\" has devised a plot to mine the world’s Sparklite core to meet his own ends. Mining Sparklite in large quantities, the Baron repurposes the ore to fuel his powerful war machines, but the pollution from the consumed Sparklite is corrupting the world. Animals have turned into violent monsters, and the environment is rotting away. The stricken land of Geodia has a natural defence in its Sparklite core. Periodically, the core causes a Disruption which rearranges the world, setting back the Baron’s efforts. Our heroine, Ada, must stop the Baron before he can obtain the core and gain the power to create a new world in which he has ultimate power. A plucky mechanic, Ada will need to use her cunning and skills to defeat the Baron’s henchmen across five distinct zones. Ada will have to work with Geodia’s weird and wonderful inhabitants if she’s to face the Baron and put paid to his deadly plans before it’s too late. Our hero, Ada, must travel to each zone of the world to shut down the Baron’s Digsites before it’s too late... Key Features • Stunning visuals - Intricate pixel art aesthetic inspired by retro classics • Original soundtrack - GameCube inspired soundtrack by composer Dale North (Wizard of Legend) • Explore the world of Sparklite - Five beautiful, procedurally generated biomes • Invent your arsenal - Invent gadgets to solve puzzles and defeat enemies • Battle bosses - Take on the Baron Mining Corp and its formidable gremlin Titans • Meet the locals - Befriend the people of Geodia and help build The Refuge • Hunt collectibles - Discover collectibles scattered throughout the world • Buddy up! - Rescue Ada’s robotic sidekick to play local assistive co-op with a friend", "platform": "Nintendo Switch", "release_date": "November 14, 2019", "game_type": "", "esrb": "E10+ - Everyone 10+", "developers": "RedBlue Games", "publishers": "Merge Games", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122641-sparklite\n"}