{"altername_name": [], "name": "Spartan", "overview": "King Leo kicks platforming back to the arcades! Sparta, 500 BC. The city-state's weapons, armor and gold have mysteriously vanished. Magical portals begin to appear throughout ancient Greece. As a king and the world's most fearsome warrior, Leonidas sets out to discover who is behind the threat, and recover everything that was stolen. You, are King Leo. And your aim is to make whoever is responsible and whatever stands in your way, rue the day they crossed your path. Block, stomp, run, jump, fall, climb, cling, push, spring & slice your way to victory. Outsmart intelligent enemies, tread carefully through obstacles and use your wits to defeat bosses in epic battles. THIS.. IS.. Spartan! FEATURES • Immerse yourself • Powered by UE4. • Memorable atmospheric soundtrack with ethnic overtones. • Crisp and detailed handcrafted art. • Hyper-smooth 2D physics based mesh animations. • Fun, intelligent and reactive enemies. • A huge variety of traps and obstacles. • Non-linear Levels No matter which path you choose, you can always return to any point. Feeling greedy and want to go back and collect all of the coins? No problem! There is no area you cannot return to. But remember to plot your routes and keep track of where you've been, because without retrieving all of the artifacts or chests you won't be able to activate the magical escape portal. Not happy with your score? You can replay any level, any time, once it’s been unlocked. • Pixel-perfect controls When the margin for error is small, responsive controls are a sheer delight. You command, and King Leo executes with lightning speed. You say \"Jump!\", and he says \"How high?\" If your reflexes are fast enough, his reflexes will be fast enough. Every step counts and every move is in your hands. Clocking in at a stable 60fps, \"Spartan\" leaves gamers no excuse to not succeed. • 20+ Hours of Gameplay More, if you want to unlock the entire gallery and learn some ancient Greek words! With 4 distinct worlds and 24 challenging levels, you'll find yourself proclaiming: \"Tough, but fair!\" 100% Indie. Created by two brothers.", "platform": "Nintendo Switch", "release_date": "April 1, 2018", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Sinister Cyclops", "publishers": "Sinister Cyclops", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156192-spartan\n"}