{"altername_name": [], "name": "Speed 3: Grand Prix", "overview": "EXPLOSIVE AND HIGH-SPEED ARCADE TRACK RACING FOR EVERYONE Get on the circuit and show that you’re the best driver of all time! Pick your favorite formula racing car and make your way to the first spot in all seasons to claim the championship title. Drive recklessly to take down the competition and let them all bite your dust! LEAD THE PACK ALL AROUND THE WORLD Make them all know you’re the one leading the pack. Fuel the rivalry as you take it up against others to conquer the world of circuit racing. Race through the American wastelands, tear up the asphalt of the German circuit, compete in the British countryside and drift through the neon-filled streets of Tokyo! It’s up to you to become a true motorsport legend! FEATURES: • Adrenaline-fueled and intense high-speed arcade circuit racing! • Take down the competition with explosive and spectacular style! • Rank at the top of each season to establish your reputation as the world’s greatest driver. • Intuitively easy and accessible car handling, designed for players of all ages and kinds. • Manage your car damage, as before you know it: you’ll be burning more than just rubber. • Go on a world tour around the best tracks the world has to offer, experiencing various weather effects, all brought to you in top visual quality! • Play together in split-screen local multiplayer and show them who’s the best, as you challenge anyone and anywhere! • Unlock a multitude of bonus cars, ranging from muscle cars, tuners, super sport and exotics, to crazy, hot rods and nitro racing monsters. • Keep improving your driving skills in the addictive Ghost Mode! • Challenge your personal records and achieve new all-time high scores on each track!", "platform": "Nintendo Switch", "release_date": "November 10, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Lion Castle", "publishers": "Orange One", "genres": "Racing", "max_players": "2", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156059-speed-3-grand-prix\n"}