{"altername_name": [], "name": "Star Ocean: The Second Story R", "overview": "TWO WORLDS, ONE FATEFUL ENCOUNTER. The highly acclaimed second instalment in the STAR OCEAN series, returns as STAR OCEAN THE SECOND STORY R. Brought to life with a unique 2.5D aesthetic, which fuses 2D pixel characters and 3D environments, this remake includes everything that made the original release so great while adding new elements too! Experience new battle mechanics, full Japanese and English voice overs, original and re-arranged music, fast-travel and so much more! Discover the definitive version of a classic but modernized JRPG that’s perfect for newcomers and long-time fans alike. STORY Space Date 366 - A Federation officer finds himself transported to a mystical planet. While searching for a way home, an encounter with a young girl draws him into a quest to save her people, just as an ancient prophecy foretold... Choose your path and witness an awakened destiny. KEY FEATURES - Fantasy and Science Fiction collide in a unique visual style From dangerous dungeons to bustling towns, the world of STAR OCEAN THE SECOND STORY R is depicted in a stunning 2.5D style that combines beautiful 3D graphics with nostalgic 2D pixel characters. - Experience a story with dual protagonists Start your journey with either Claude or Rena. Depending on your choice, the perspectives and the allies you can recruit will change. Get to know party members via the unique Private Actions system, grow relationships and unlock various endings. New character illustrations have also been created by long-term series artist Yukihiro Kajimoto. - Thrilling, visually explosive battles! Enjoy fast-paced combat and use new mechanics to strategically defeat foes. “Break” by continuously dealing damage and order your allies to follow-up with an Assault Action to deal massive damage. - Pair powerful gear with a plethora of skills Customize party progression with a large selection of skills, including Cooking, Art, Metalcraft, and many more. Build up to Specialty levels and master the enhanced Item Creation system to craft ultimate equipment with different effects. - Japanese and English voiceover All event scenes are now fully voiced using the same voice cast from the original game. In addition, the dialogue from STAR OCEAN SECOND EVOLUTION (2008) is also included and can be selected. - An iconic soundtrack rearranged by Motoi Sakuraba All tracks have been re-composed, including full-band performance and strings sound. Exploration and movie scenes themes also have new recordings that take them to even greater heights. - 3 difficulty modes Pick EARTH for a relaxing journey, GALAXY for a satisfying challenge or UNIVERSE… if you’re brave enough to really put your skills to the test.", "platform": "Nintendo Switch", "release_date": "November 2, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Gemdrops", "publishers": "Square Enix", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.25", "wikipedia": "https://en.wikipedia.org/wiki/Star_Ocean:_The_Second_Story", "video_link": "https://www.youtube.com/watch?v=pxvsS0MV-cY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373981-star-ocean-the-second-story-r\n"}