{"altername_name": [], "name": "Star Horizon", "overview": "Experience fast action, thrilling levels, spectacular explosions and lots of pew-pew-pew. Star Horizon is a reboot for the on-rails space shooter genre. KEY FEATURES: ▪ Immersive action – engage in fast-paced, immersive space battles. ▪ Upgrade your ship – buy upgrades and finish your enemies in multiple, fun ways. ▪ Fun story - experience a mature story of a man and his AI spiced up with absurd and dark humour ▪ Choices & consequences – make quick decisions – do you help your friends but fail your mission? Do you aid a space merchant and engage in a fight? Consequences of your choices alter the flow of the story. ▪ 256 space ships, 10 missions, 3 bosses, 16 types of equipment, 10 enemies. STORY: A struggle between the Inter Galactic Corporation (a.k.a The Federation), which controls the entire galaxy, and the Rebels continues... You assume the role of John, a simple private space-pilot in the service of the Federation. Well.. the word “pilot” might be an overstatement. John’s ship AI – which he calls “Ellie” - takes almost all control of the ship. The space battles are coordinated by Motherships and “pilots” serve the mere role of the shooters (as the AI can’t ‘kill’). Inter Galactic Corporation is about to turn the tide of the war but an accident happens. Your Mothership is blown up into pieces which makes Ellie go crazy. It puts John into hibernation and wakes him up several years later in a completely different setting. What really happened? What is the AI up to? Will the two - John and Ellie - change the fate of the Universe?", "platform": "Nintendo Switch", "release_date": "May 14, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Tabasco Interactive", "publishers": "No Gravity Games", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/130437-star-horizon\n"}