{"altername_name": [], "name": "Star Ocean: First Departure: R", "overview": "Space Date: 346 From a power yet undiscovered, a new generation will be born. Our tale begins on the primitive planet of Roak where Roddick lives in the peaceful and uneventful town of Kratus. As a member of the village’s local “Defence Force” tasked with the protection of Kratus, Roddick learns of a mysterious disease that has broken out in the neighbouring town. Those infected turn to stone, but continue to live on in a petrified state. Roddick, along with his two friends Millie and Dorne, make their way to the neighbouring town. Informed of a cure for the sickness, they head to Mt. Metorx where a healing herb is rumoured to grow. When they reach the summit, the party encounter Ronyx and Ilia, who appear before them in a pillar of light. Thus, the story of STAR OCEAN begins... Illustrations based on the designs from the original (Super Famicom) version have been newly drawn by Katsumi Enami, the artist behind the character illustrations for STAR OCEAN Last Hope. Players can now select their preferred illustrations by switching between the First Departure and First Departure R versions during gameplay. The original Japanese voice cast returns with newly recorded dialogue for a fully voiced experience. Players can freely switch between their preferred voicever options: English (PSP), Japanese (First Departure), and Japanese (First Departure R). Enjoy quality of life improvements like 2x speed mode and newly balanced battle mechanics.", "platform": "Nintendo Switch", "release_date": "December 5, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=wH2VJXy0C78", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/122666-star-ocean-first-departure-r\n"}