{"altername_name": [], "name": "Star Wars: Knights of the Old Republic", "overview": "Four thousand years before the events depicted in the Star Wars movies, the political and ideological situation is not much different from what we have seen in the prequel trilogy: the Republic and the Jedi Order are fighting against two powerful Sith lords, Darth Revan and his apprentice, Darth Malak. It is said that the former was successfully defeated by the Jedi, and that Darth Malak betrayed his mentor and is planning to take on the Republic by himself. His aggression is so successful that some Jedi have decided to join his ranks. A seemingly ordinary soldier of the Republic is traveling aboard a space ship that is attacked by Darth Malak's minions. Narrowly escaping, the soldier meets a female Jedi named Bastila, one of those who have fought Darth Revan in the decisive battle. With her help, the soldier must learn to become a Jedi, stop Darth Malak, and discover the truth about his or her own past. Knights of the Old Republic is a role-playing game that uses the Star Wars D20 rule system, which is similar to the 3rd Edition of Dungeons & Dragons. Character development and combat are handled similarly to BioWare's previous RPGs such as Baldur's Gate series. Combat engine follows similar \"real-time with pause\" rules. There are only three active combatants on the player's side (as opposed to six in Baldur's Gate). Several characters join the party and can be switched at the player's will. Eventually, the protagonist will have to train at the Jedi academy to earn a lightsaber and force moves. Force powers include stun, force pull (which pulls opponents or objects toward the player-controlled character), the Jedi Mind Trick, which persuades people to see things the player's way, and many others. The player has various weapons at his or her disposal, from the lightsaber to blasters, grenades, ion rifles, etc. Throughout the game, the player will visit many Star Wars locations that appeared in the movies, such as Kashyyyk, the homeworld of the Wookiees, the desert planet of Tatooine, and others. Interacting with characters in various ways and performing side quests influences the protagonist's stand with the forces of Light and Darkness. The player can turn the main character into a flawless Jedi, a ruthless Sith, or anything in between. Some of the player's choices influence major events that occur within the storyline.", "platform": "Nintendo Switch", "release_date": "November 11, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "BioWare", "publishers": "Aspyr Media", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.29", "wikipedia": "https://en.wikipedia.org/wiki/Star_Wars:_Knights_of_the_Old_Republic", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156456-star-wars-knights-of-the-old-republic\n"}