{"altername_name": [], "name": "Star Wars: Knights of the Old Republic II: The Sith Lords", "overview": "In this standalone sequel to the award-winning RPG STAR WARS: Knights of the Old Republic, the Sith Lords have hunted the Jedi to the edge of extinction and are on the verge of crushing the Old Republic. With the Jedi Order in ruin, the Republic’s only hope is a lone Jedi in exile struggling to reconnect with the Force. Lead a diverse crew of unique allies, make difficult choices with far-reaching consequences, and decide your destiny. Will you follow the light side and save the Galaxy, or succumb to the dark side and bring it all down… *A Standalone Sequel* Experience the follow-up to the acclaimed original RPG STAR WARS™: Knights of the Old Republic™ in this epic story set in the darkest days of the Old Republic. *Choose Your Destiny* Discover your past and make difficult choices that aren’t as clear-cut as “good or evil”. Each decision can have a significant impact on your story and your squad. Will you uphold the Jedi Order, or lead the Galaxy to ruin? *Master the Force* Choose from three different classes of Jedi, each with access to specific Force powers, and customize your characters with unique skills and abilities. *Lead Your Crew* Command a party of diverse crewmates, each with their own strengths, alignments and nuanced back stories. Your actions will influence your crew’s destinies, but not everyone may agree with the choices you make…", "platform": "Nintendo Switch", "release_date": "June 8, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "Aspyr Media", "publishers": "Aspyr Media", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.83", "wikipedia": "https://en.wikipedia.org/wiki/Star_Wars_Knights_of_the_Old_Republic_II:_The_Sith_Lords", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/162928-star-wars-knights-of-the-old-republic-ii-the-sith-lords\n"}