{"altername_name": [], "name": "Star Story: The Horizon Escape", "overview": "Join the journey of a funky space-archaeologist, who crashed on an unknown planet. A text, turn-based adventure RPG in which your choices actually matter. Talk, explore, fight, make decisions to find your way out! The archaeological research mission faced some unexpected difficulties. Your spaceship crashed. Can you escape from this planet? But how? No one can help you. You are here all alone. Or not? Do you have a plan? Will you find what it takes to be a hero? Star Story: The Horizon Escape is a turn-based, adventure game with text-rpg elements. Tune into the story of the aspiring space-archaeologist Van Klik on his mission to the mysterious planet of Horizon! Non-linear plot development, 24 alternative endings Your choices define the story. Totaly. Some will turn out better than others, some will be worse, and some will be straight up hilarious. You are here to find the real true ending among all of your possible destinies and become a hero. Or maybe something more... Text-based gameplay The core classic. Dive into the storie and find a way to exploit EVERY possible situation. Did you know that if you throw a lockpick at an attack droid, it will decide that you are stupid and will deactivate? Build your character, choose your alignments, learn the lore of the world. You will need it all to succeed. Game mechanics The story will throw a mix of dialogues, choices, turn-based battles, puzzles, weapon and resource crafting, technology research and more at you. You will use all you can to survive the challenging world of Horizon. Turn-based philosophy The player decides on the pace he wants to play the game at. Everything is turn-based. There is no time-limit for making decisions, no quick-time events, no rush: you can take any amount of time to make your move. Beautiful world Enjoy the wild and crazy sceneries of the Horizon world. Deserts, jungles, cities, underground caverns… the list goes on. Colorful characters Meet the locals! Who is more to your liking? Side with “Bullet King” and uncover an ancient cryptic artifact. Or choose to undermine his brutal regime and make the local revolutionary your friend. Or leave them and go try to play romance with the alien girl? Or blow up the planet? Or… You get it!", "platform": "Nintendo Switch", "release_date": "July 12, 2018", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Evil Corporation Games", "publishers": "Evil Corporation Games", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156068-star-story-the-horizon-escape\n"}