{"altername_name": [], "name": "STAY COOL, KOBAYASHI-SAN!: A RIVER CITY RANSOM STORY", "overview": "A short while after the events of \"Downtown Nekketsu Monogatari\"... Reiho High School, where the battle took place, has these Big Four, who are feared by all the others schools around. And at the top of the Big Four, reigns only one man: Masao Kobayashi. Here's one of his stories. Back in middle school, a mysterious event led him to meet a boy named Mizoguchi, who was actually a Time Regulator, going after an evil organization that has disrupted the time-space equilibrium. After finding out that Kobayashi has a hint of mysterious power in him, Mizoguchi has them set out together to take this evil organization down. So, when Kobayashi's friend gets abducted by the evil organization, He puts on a calm face while burning with rage inside. He has got to go rescue his friend and bring an end to this evil organization. ■Original staff members! The original directors of Nekketsu Kōha Kunio-kun (aka Renegade): Yoshihisa Kishimoto and Downtown Nekketsu Monogatari (aka Street Gangs/River City Ransom): Mokeke Sekimoto, are teaming up to bring you a new reckless action game ! ■Funny and nostalgic pixel art! When hearing \"Kunio-kun\", pixel art characters is the first thing that comes to mind. Nice, cute and nostalgic pixel art. ■20 different endings! Depending on your actions in-game, you can trigger a different ending. Do you think you could complete the game to see every one of them? ■Collect the ★ and power-up! You can actually spend the ★ you have collected in-game to enhance your characters and equip them with items. Let's play the game and become the strongest! ■Quite the chatterbox! All characters have been voiced for this game! Enjoy the very talkative encounters between them!", "platform": "Nintendo Switch", "release_date": "November 7, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Arc System Works", "publishers": "Arc System Works", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=gAEUVIUWMJ4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/161127-stay-cool-kobayashi-san-a-river-city-ransom-story\n"}