{"altername_name": ["Steampunk Tower 2"], "name": "Steampunk Tower II", "overview": "Steampunk Tower 2 is a unique tower defense game set in the alternative Steampunk universe. There is a dragged-out world war with the enemy never seen before. Lord Bingham is coming back to the world arena and he needs a skilled commander. There is a secret base hidden in the mountains of Spain, with ginormous aircraft Carrier transporting the Battle Tower under your authority and also a team of specialists who execute special assignments. Game Features: • The sequel to the unique tower defense game - Steampunk Tower! More turrets, more enemies, aircraft Carrier, giant map of Europe… everything as in tower defense games. • Dynamic battles! Each turret has its own specifics and its unique super shot. • Stronger enemies! Enemies have acquired extra armour but their weak spots have also appeared. • Test super weapons and special bonuses that will increase your chances of success in a battle. • Humungous bosses! You can’t beat these steam monsters on the first try. • Secret Steampunk city! Build scientific research laboratories, warehouses and factories for building new turrets and upgrade Tower. • War for the territories! Control the factories to produce component parts for your turrets. • Team of professionals! Send your agents on special missions to get extra resources. • Many storyline missions throughout Europe! Find a way to defeat the enemy and get into the heart of enemy territory for the final stroke. • Trains! Develop railway network for transportation of agents and resources. Can’t Steampunk be without trains?!", "platform": "Nintendo Switch", "release_date": "December 4, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "DreamGate", "publishers": "Drageus Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156069-steampunk-tower-ii\n"}