{"altername_name": [], "name": "Steve Jackson's Sorcery!", "overview": "The Crown of Kings has been stolen. You, a lone adventurer, must cross the wilds to get it back—armed only with a sword, a spellbook of wild magic, and the power to choose which path you take. Brave the deadly Shamutanti Hills to reach Kharé, a city of bandits on the brink of revolution. Navigate the Baklands, a wilderness adrift in time, to reach the Fortress of Sorcerers. Can you learn the secrets of sorcery well enough to outwit the Archmage himself? Adapted from legendary designer Steve Jackson’s multimillion-selling gamebook series and massively expanded by the award-winning narrative studio inkle, Steve Jackson’s Sorcery! is a truly epic interactive adventure that bends its story around every choice you make, big and small. Features: • Forge your own path. Go where you want in a vast world spread across four enormous maps. • Weave your magic. Over fifty weird and wonderful spells await, that can send the narrative off in unpredictable directions. Talk to creatures, read minds, glue enemies to the ceiling or turn them to stone, fly, float, and more… • Swindle the swindlers. Play to win at Swindlestones, a game of cunning and deceit, where you can earn gold as well as crucial information. • Find your Spirit. Select your God from a pantheon of deities, all with their own quirks and powers • Fight to survive. Battle hundreds of creatures with unique turn-based fighting that balances raw strength against cunning. • Explore every avenue. Don’t like where you ended up? Curious about the path not taken? Rewind to any point in the story to try a different way. • Spin your unique story. The game’s powerful storytelling engine allows for thousands of choices, all of which are remembered and can alter what happens next. No two playthroughs are the same. • Play it again. New Game Plus mode unlocks tougher challenges and deeper secrets.", "platform": "Nintendo Switch", "release_date": "June 23, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "inkle", "publishers": "No Gravity Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163249-steve-jacksons-sorcery\n"}