{"altername_name": ["STRIKERS 1999"], "name": "STRIKERS 1945 III for Nintendo Switch", "overview": "This hardcore shooter was Psikyo's challenge to the world! STRIKERS 1945 III is a vertical-scrolling shooter game that first appeared in arcades in 1999. This game is the culmination of the best parts of the STRIKERS series and comes with new features as well. Players earn technical bonuses by destroying a boss's core at a very close distance. They can also earn chain bonuses by collecting flashing medals in succession. Time to work on drawing up tactics for a better score! Don't forget to check out the awesome mechanical designs and animations, too! The legendary Psikyo Bullets are coming for you! The game comes with options you can tweak to your liking. Pick your preferred difficulty, max lives, max continues, key controls, and screen orientation to make the game just right for you. Don't forget about the new online rankings! Do you have what it takes to become the best STRIKER in the world? Planes: Five fighters (+ more?) are at your service, each with unique abilities. \"P\" items power up your unit and add sub-weapons to it. \"B\" items give you bombs that deal area damage to clear out enemies or help with emergency escapes. Store up your gauge to unleash a powerful super shot! ARCADE Mode: Four difficulty tiers are available - Easy, Normal, Hard, and Very Hard. There will be local rankings for each plane in each difficulty mode. There will be local rankings for each plane in each difficulty mode. Options: Play in vertical screen mode for that nostalgic arcade experience! Two additional screen filters for your enjoyment. Lives can be set between 1 to 9, whereas continues can be set between 0 to infinity. Freely configure your preferred keys for shots, auto-shots, or bombs. Vertical screen mode is playable even in landscape orientation. You decide your style! SCORE ATTACK: This mode has a fixed difficulty and number of lives. Serious challengers only! Submit your high scores to compete with players from around the world! Online rankings can be viewed from the options menu.", "platform": "Nintendo Switch", "release_date": "August 3, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "Zerodiv", "publishers": "CITY CONNECTION", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=QdqNs3HWkPs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163648-strikers-1945-iii-for-nintendo-switch\n"}