{"altername_name": [], "name": "Stubbs the Zombie in Rebel Without a Pulse", "overview": "In Stubbs the Zombie, the player plays as a zombie, and the primary goal is to kill humans and devour their brains. Eating brains gives back a certain amount of lost health to the player as well as converting those humans into zombies, causing them to fight alongside the player. The player has the option of beating an enemy to death with melee strikes or to transform them into zombies. Stubbs' zombie state prevents him from wielding any conventional weapons, and instead wields a variety of improvised weaponry and combat techniques, most of which are done using a specific body part as explosives or makeshift devices. Stubbs can drive a wide variety of vehicles, such as cars, tractors and tanks. All of the aforementioned improvised weapons, excluding Stubbs' hand, will convert enemies they kill into zombies. Stubbs can herd zombies which are in range by whistling. Since there is a limit to how many zombies will follow him at a time, Stubbs can guide the rest by sending whole groups of zombies in a direction with a single shove. Stubbs' zombie followers can kill humans and eat their brains, just like Stubbs can, and any human killed by one of his minions will also turn into a zombie. An enemy that fires upon a zombie in a group will attract the attention of all the rest of the zombies. Crowds of zombies serve as a great shield when approaching enemies armed with ranged weapons and are needed for sowing the necessary chaos and confusion into a difficult melee.", "platform": "Nintendo Switch", "release_date": "March 16, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Wideload Games", "publishers": "THQ Nordic", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Stubbs_the_Zombie_in_Rebel_Without_a_Pulse", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/168825-stubbs-the-zombie-in-rebel-without-a-pulse\n"}