{"altername_name": [], "name": "Sunless Skies: Sovereign Edition", "overview": "THE SKIES ARE YOURS Captain a spacefaring steam locomotive, as a new Victorian empire takes to the stars! Lead your hapless crew into trouble – and out of their minds. Barter for barrels of time. Smuggle souls. Pause for cricket and a cup of tea. Unfettered by gravity, the Victorian Empire reaches across the skies. The stars are the Judgements: vast intelligences that govern all things. But they are dying. Create your past. Choose who you were before you became a skyfarer. Most of your captains will die. Each will leave their mark on the world. Explore a beautiful, hostile world. This is a standalone story set in the Fallen London universe, as seen in Sunless Sea. Improve your locomotive. It is all that stands between you and the Heavens. Populate your ship with officers. Fight marauders. Survive starvation, madness and terror. Will you support Her Majesty's empire, or the rebels who mean to dismantle London’s rule? Pick your side wisely, for you might be the one to tip the balance of power… Features: ● 800,000+ words of intertwining stories, inspired by CS Lewis, Jules Verne, HP Lovecraft and HG Wells ● Four regions to explore: celestial wilderness, impossible industrial empire, pagan midnight expanse, and the domain of the dead ● Real-time combat against horrifying celestial foes and merciless pirates ● Upgrade your engine with bizarre equipment and powerful weaponry ● Build a lineage of captains as each dies, or reload your most recent captain ● Collect pets: the Useless Cat, Perfect Pangolin and more", "platform": "Nintendo Switch", "release_date": "May 19, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Failbetter Games", "publishers": "Failbetter Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156070-sunless-skies-sovereign-edition\n"}