{"altername_name": [], "name": "Super Bomberman R", "overview": "A fast paced 1 to 8 player party action game that fully utilizes the new and unique Nintendo Switch! Bomberman, the iconic party-battle game, is returning as \"SUPER BOMBERMAN R\" on the Nintendo Switch and will be released alongside the launch of the new system for home and on-the-go fun! Dive into the simple yet addictive gameplay in SUPER BOMBERMAN R by controlling the main character, placing bombs, and battling enemies and rivals with a modern visual style including 3D stages and photo-realistic graphics. Take out CPU-controlled adversaries in 'Story' mode to clear a series of 50 unique stages in order to save the galaxy. SUPER BOMBERMAN R also makes full use of the Nintendo Switch's first of its kind system capabilities which allows gamers to play where ever, whenever and with whomever they choose. Players can go head-to-head in a heated \"Battle\" mode where up to eight players are dropped within a maze until the \"last man standing\" is declared the winner. All iconic Bomberman elements return to the game including a dynamite list of items found within the destructible areas of each maze. Removing a wall will often reveal a power-up to extend the rage of the explosion or endow Bomberman with a useful skill including faster movement, the ability to kick or throw bombs and more! As players gain ever more devastating capabilities, they must use all their skill and ingenuity to ensure their opponents get caught in a blast while avoiding it's fiery touch! - +50 levels of single player or Co-Op maps! - 3D stages with dynamic environments. - Bomberman's siblings and known enemies are back with rich personality. - Battle mode for maximum of 8 players, local battles, and online battles. - ESRB Rating: EVERYONE 10+ with Cartoon Violence", "platform": "Nintendo Switch", "release_date": "March 3, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "Hexa Drive", "publishers": "Konami", "genres": "Action", "max_players": "8", "cooperative": "No", "rating": "3.39", "wikipedia": "https://en.wikipedia.org/wiki/Super_Bomberman_R", "video_link": "https://www.youtube.com/watch?v=f98ZwgzYyig", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/79450-super-bomberman-r\n"}