{"altername_name": [], "name": "Super Robot Wars V", "overview": "In the New Correct Dimension the star ship Yamato, aided by the Crossbone Vanguard, embarks on a desperate quest to reach the distant Iscandar star system for the only hope to save an Earth dying from the Gamillas' Empire's planet killer weapon. In the AD Dimension Might Senpuuji, the richest boy on the planet, fights against criminals in Nouvelle Tokyo while the girls of Arzenal island, stripped of all rights because of their inability to manipulate Mana, protect the world from incursions of dragons in order to pay for their continued existence. In the Universal Century Dimension a broken world, ravaged by endless war between the Federation and Neo Zeon and the global ecological disaster of Third Impact, attempts to heal as the independent military group Mithril investigates the source of Out Of Place technology derived from the Whispered: people aware of technology that does not exist. Behind the scenes god-like figures secretly manipulate the events of the three Earths to their own goals, with no regard for the innocent lives lost in the process. Super Robot Wars V is a standalone title in the long-running series, marking the 25th anniversary of the Super Robot Wars franchise. This entry also marks the first appearance of Space Battleship Yamato in the SRW series, which is notable for not actually having any robots.The player starts by selecting their point-of-view character, either the washed up pilot haunted by his past failures Souji Murakumo, or the out of her depth rookie with no experience Chitose Kisaragi. This pilot can be renamed, and depending on the pilot their reactions during cutscenes, and some missions, will change. During a routine mission the pilot will chance upon the experimental mecha suit VangRay, falling into the Yamato's crew and joining them on their journey across space and dimensions. As in past SRW games SRW V follows the game flow of Base mode, followed by Adventure mode, followed by Scenario mode, and then back again. In Adventure mode the player watches the events of the storyline play out, occasionally making a decision of which storyline route to follow. In Scenario mode the player deploys their forces to defeat their opponents or achieve specific objectives. In Base mode the player spends currency earned in Scenario mode to upgrade their units. Pilots level up with experience from enemy defeats, gaining stats and learning new Spirits that can temporarily boost abilities. Defeating opponents also award Tactical Points, which can be used to buy additional ranks of stat boosting Skill Programs. Unlike past games Pilots do not naturally learn any Skill Programs with levels, but Tactical Points also belong to a single pool instead of being awarded per-pilot, so they can be used to power up any pilot. Tactical Points are also used to purchase exclusive and incredibly powerful Power Parts from the Factory, provided their requirements have been met during Scenario mode. Money from combat can be used to Customize mecha, boosting their stats. Some pilots can be swapped between mecha, but only within their respective franchises: e.g. a Gundam pilot can pilot other mobile suits, but can not pilot a Mazinger unit. In Scenario mode the player selects from available battleships and units, places them on the map, and then attempts to complete the objective, typically destroying all or a specific enemy unit, or reaching a destination. While attacking the defending unit is allowed to counter attack if it has an attack that can reach the attacker. Some Skill Programs also allow units to join in with nearby attacks, or leap to the defense of an ally. One new feature for this entry is the ability to use any Spirit ability at any time, including if the unit has already completed their action or even during the enemy turn. This mostly serves to make the game easier. Every Scenario has an optional objective which typically serves to make the primary objective more difficult to achieve. Completing this optional objective rewards an SR point and a token amount of Money. If at least 75% of available SR points have been achieved the game will shift into Hard mode, reducing reward money and boosting enemy stats. The player can also choose to play on Beginner mode which locks difficulty on Standard, removes SR points, but still automatically awards the Money bonus with every level. Returning from Super Robot Wars OG: The Moon Dwellers is the sound edit feature, allowing the player to select any theme song for any unit in their force, including individual songs per attack. MP3s on a memory card (for Vita) or external drive (for PS4) can even be imported, allowing any unit to have literally any music for its attacks.", "platform": "Nintendo Switch", "release_date": "February 23, 2017", "game_type": "Released", "esrb": "T - Teen", "developers": "B.B.Studio", "publishers": "Bandai Namco Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Super_Robot_Wars_V", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156082-super-robot-wars-v\n"}