{"altername_name": [], "name": "Super Alloy Ranger", "overview": "Super Alloy Ranger is a 2D side-scrolling action game. Play as Marksman Kelly or Combat Robot No.2 to challenge different levels within the dangerous Machine Empire and unlock new weapons. Use Kelly’s shooting and No.2’s deathblows to defeat abnormal Machine Bosses! -BACKGROUND- While chasing the fortune worthy criminal Lamos on their Alloy Ranger, Space Hunters Kelly and Rambos were trapped by the protective field of the abandoned planet Tanwada. Just as they were struggling to find a way out, robot sisters “No.2” and “No.3” appeared out of nowhere and had asked to join them on their adventure! Meanwhile, a mysterious program infected the mechanical army on planet Tanwada and led to their continuous self-evolution. -MAIN FEATURES- Classic 2D Action Platform Levels Utilize various movement techniques to conquer the challenging levels; running, jumping, dashing, mid-air dash, wall climbing and double jumps. Use them wisely to track down the wanted criminal; this could be in sunken cities, the freezing Sea of Frost, the endless Abyssal Mines and many more places. Whatever it takes, you will find out the truth and head back with victory! -Multiple Combat Methods- Shooting expert Kelly can shoot different bullets based on the Attribute chip he was equipping. He can also enhance the effect of ammunition through charging! The energy core on his combat uniform can slowly increase the energy needed for special weapons! Combat Robot No.2 has more attack methods than you think! Claws, swords, spears and many more, find out what it can do by unlocking various Attribute Chips. It will also collect energy from every hit made on the enemy. Once they have accumulated enough energy, a powerful deathblow will be released based on the Attribute Chip it was equipping. You never know how helpful this could be; it may even turn the situation around! -Gigantic Boss Enemies- Mechanical Aircraft, Aggressive Underwater Robots, a Battle Fortress that is digging towards the core of the planet and an enormous Humanoid that was produced in the Machine Arsenal… At the end of each level, there is always a dangerous mutant Machine Boss waiting for you to challenge. Try your best to defeat them in the barrage! -Dynamic Pixel Animation- With reference to many exquisite pixel art, Super Alloy Ranger seek to strive for details when it comes to this relatively abstract form of art. At the same time, strive to create a world that is more fun and exquisite! -Features- Classic side-scrolling mode of operation, dodge the bullets while jumping, dashing and climbing to progress with the level. · Many hidden pathways are waiting for you to explore. Both characters have many weapons and combat styles up for selection. Challenge gigantic boss enemies in dangerous barrages. Combining the characteristics of horizontal shooting and horizontal breakthrough. On top of that corresponding combat mechanism is added to the game! Fun and exquisite pixel animations.", "platform": "Nintendo Switch", "release_date": "April 28, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "Alloy Mushroom", "publishers": "Neverland Entertainment", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=ihpVfVY3BIc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/369892-super-alloy-ranger\n"}