{"altername_name": ["Super Mario Bros Wonder"], "name": "Super Mario Bros. Wonder", "overview": "The next evolution of Mario fun! Experience Mario like never before with the transformative powers of Wonder Flowers in the groundbreaking Super Mario Bros. Wonder! These revolutionary elements introduce a plethora of whimsical and bizarre occurrences. Be prepared to watch pipes spring to life, create mayhem as a massive Spike-Ball, and delve into many more surprises! Welcome to the Flower Kingdom: Your beloved team of Mario and pals are off to the vibrant Flower Kingdom, situated not too far from the renowned Mushroom Kingdom. In an unfortunate turn of events, King Bowser morphs into a formidable flying fortress, spreading disorder and panic in this once peaceful land. It is up to our gallant heroes to thwart his plans and restore peace and joy to the Flower Kingdom in this enchanting new escapade! Share the wonder with friends and family: You can team up with up to three friends locally on one Nintendo Switch system and race though these worlds together, or play with others online! Stages: The game has six different worlds, as well as a central area to which all of them connect, Petal Isles. Each level contains at least two Wonder Seeds, one of which is obtained by finding the level's Wonder Flower and reaching the end of the Wonder Effect section, and the other obtained by reaching the end of the level and grabbing the Goal Pole. Adventurers with a keen eye may discover an elusive third Wonder Seed, tucked away in concealed exits. Furthermore, brace yourself to find three 10-flower tokens hidden in each stage, a nostalgic nod to cherished collectibles from previous iterations including Star Coins and Green Stars, adding an extra layer of excitement and challenge to your exploration. Get ready to explore a realm filled with wonders and joyous discoveries in this fresh take on a beloved classic, ensuring hours of fun and camaraderie as you share the wonder of Mario with friends and family!", "platform": "Nintendo Switch", "release_date": "October 20, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo EPD", "publishers": "Nintendo", "genres": "Platform", "max_players": "4", "cooperative": "Yes", "rating": "4.77", "wikipedia": "https://en.wikipedia.org/wiki/Super_Mario_Bros._Wonder", "video_link": "https://www.youtube.com/watch?v=JStAYvbeSHc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371985-super-mario-bros-wonder\n"}