{"altername_name": [], "name": "Super Mario RPG", "overview": "The Super Nintendo classic adventure is back on Nintendo Switch, and it's better than ever before! Enter (or revisit) this world of eccentric allies and offbeat enemies in an RPG for everyone. Mario, Bowser, and Peach partner up with an oddball group of heroes to save Star Road and stop the troublemaking Smithy Gang. This colorful RPG has updated graphics and cinematics that add even more charm to the unexpected alliance between Mario, Bowser, Peach, and original characters Mallow and Geno. Explore the vibrant environments with your party and jump towards your next goal! Run into monsters to enter turn-based battles with your party of three. Press the button at the right time for a satisfying dose of extra damage or helpful guard. Features: Turn-Based Combat: A significant departure from other Mario games, Super Mario RPG features a turn-based combat system where players choose their actions from a menu. Timed Hits: A unique feature in the combat system where players can deal extra damage or reduce damage taken by pressing a button at the correct time during an attack or when defending. Expansive World: Players can explore a vast world filled with a variety of environments, from Mario's familiar home terrain to entirely new landscapes. Diverse Cast of Characters: Apart from Mario, players will team up with other memorable characters including Mallow, Geno, Bowser, and Princess Peach, each having unique abilities in battle. Character Progression: Characters gain experience points through battles, which help them level up and become stronger, gaining new abilities in the process. Puzzle Elements: The game introduces a variety of puzzles and challenges that players need to solve to progress through different stages, combining elements of strategy and wit with traditional RPG gameplay. Engaging Storyline: The game has a rich narrative, filled with humor and heartwarming moments, building on the familiar Mario storyline while introducing new characters and plot twists. Mini-Games: Scattered throughout the game are a variety of mini-games that players can engage in, providing a break from the main storyline and a chance to earn extra rewards.", "platform": "Nintendo Switch", "release_date": "November 17, 2023", "game_type": "", "esrb": "E - Everyone", "developers": "ArtePiazza", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.78", "wikipedia": "https://en.wikipedia.org/wiki/Super_Mario_RPG", "video_link": "https://www.youtube.com/watch?v=e_kuPoLw9Wc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372021-super-mario-rpg\n"}