{"altername_name": [], "name": "Table Top Racing: World Tour: Nitro Edition", "overview": "The Ultimate Pint-sized, Powered-Up, Combat Racer! Split-Screen game play both Online and Offline! Get behind the wheel of 16 ultra-cool, miniaturized racing cars and engage in combat-racing like no other. Master over 30 table-top race tracks and over 180 events in a bid for glory, then take the battle Online* and compete with the best in the world. On Nintendo Switch you can bring a friend too! Race offline or online with two new split-screen game modes. Go head-to-head in “Splitscreen Vs. Battle” mode and take on the A.I. or get online with “Splitscreen Online” mode and take on the world! Crush your enemies with 8 cunning 'Power-ups' and 6 unique 'Weapon Wheels' and blast your way to victory! Pint-Sized, Powered-Up Racing has never looked so good or been so much fun. KEY FEATURES ✔ 2 Player Split-screen Gameplay both Offline and Online* ✔ 8 Players Online* multi-player combat racing ✔ 9 Unique Game play modes spread throughout the Championships ✔ 32 Table-top race tracks set in 8 themed locations (4 circuits per location) ✔ 16 Super-cool, fully upgradable, iconic miniature Race Cars ✔ Over 180 unique race events to challenge your skills. Over 25 hours gameplay! ✔ 8 Cunning \"Power-Up Weapons\" designed to attack and slow opponents or protect yourself ✔ 6 Unique “Weapon Wheels” help you get an edge over your rivals ✔ Funky exclusive break-beat soundtrack by producer Wes Smith of Juice Recordings", "platform": "Nintendo Switch", "release_date": "May 1, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Playrise Digital", "publishers": "Greenlight Games", "genres": "Party", "max_players": "8", "cooperative": "No", "rating": "1", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156098-table-top-racing-world-tour-nitro-edition\n"}