{"altername_name": ["Tails of Iron"], "name": "Tails of Iron: Crimson Knight Edition", "overview": "Set in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart. As you explore the deceivingly charming world, you’ll encounter a cast of unique companions, ready to aid you in your adventure. And you’ll need all the help you can get, whether that’s new meal recipes, blueprints to forge deadly weapons and armour, or even a land-chugging, armour-plated mole mobile! Overcome your fears. Rescue your brothers. Restore Your Kingdom. Your tail has begun… Master Brutal Combat From frog zombies to gargantuan grubs - and everything in-between - the Kingdom is awash with danger. To overcome each perilous encounter, you’ll need to study your opponent’s attacks and react accordingly! Thankfully, there’s a range of deadly abilities at your disposal, including parry bashes and fatal executions, not to mention ranged attacks with your nifty bow and arrow. Explore a Treacherous Kingdom Fully accompanied by the deep, raspy narrations of Doug Cockle (voice of Geralt of Rivia from The Witcher), prepare to embark on an epic adventure across the mediaeval-fantasy Rat Kingdom. Complete side quests and faction hunts for some additional gold-on-the-side, or join forces with a sharp-eyed companion to help even the playing field. Customise your Attack Adapt Redgi’s combat style to the task at hand. Heavy armour may provide better protection but can you really afford to slow down your dodge-roll? And then there’s the question of weapon; axes pack a punch, while spears are quick and nimble. Perhaps you’d prefer the all-round performance of a trusty broadsword? Overcome Savage Boss Fights While danger lurks around every toadstool, you’ll need to keep your wits sharp and your blade sharper when it comes to the devastating boss fights. Cold-blooded in every sense of the word, these oversized amphibians each present their own unique combat challenge, and you’ll need more than a good set of armour to come out on top. Brew Recipes, Craft Weapons, Forge Armour Redgi’s keep is also home to his brothers, Rem-Rem, Bam-Bam and Dug. Rem can cook up a health-boosting feast with ingredients found throughout the world, while Bam can craft new weapons and armors from special blueprints you’ll uncover… if you look hard enough. And then there’s Dug, who’ll update you about new quests available throughout the Kingdom. Features: • Master brutal combat, inspired by the souls-like genre, featuring dodge-rolls, parry bashes, and fatal executions! • Explore a vast and treacherous Kingdom, comprising six distinct biomes, each with its own hidden paths and secrets • Immerse yourself in the compelling story, narrated by the deep, raspy Doug Cockle (voice of Geralt of Rivia from The Witcher) • Customise your attack style with a vast array of distinct weapons and armour • Assemble a band of brave companions, ready to aid you on select missions • Complete side quests to earn additional gold-on-the-side • Unearth special blueprints to forge new and powerful weapons • Collect rare ingredients to cook up health-boosting feasts • Overcome savage boss fights against the Frog Clan’s deadly, oversized generals • Lose yourself in the gorgeous and lovingly-crafted 2D hand-drawn art style.", "platform": "Nintendo Switch", "release_date": "September 17, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Odd Bug Studio", "publishers": "United Label", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/Tails_of_Iron", "video_link": "https://www.youtube.com/watch?v=SbYRybJjgLw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155107-tails-of-iron-crimson-knight-edition\n"}