{"altername_name": [], "name": "Tangledeep", "overview": "Tangledeep combines the 16-bit graphics and polish of classic RPGs with elements from roguelikes and dungeon crawlers to create a magical experience for players of all skill levels. Trapped in underground villages with no memory of the world at the surface, you must survive an ever-changing labyrinth to discover what lies above.  Experience rich, tactical, turn-based gameplay as you explore a sprawling dungeon that’s different each time you play. Tangledeep features a customizable job system and hundreds of collectible items that allow you to approach each playthrough in a totally new way!   KEY FEATURES * Master deep, tactical turn-based combat across 12 unique jobs with over 100 skills. * Choose between three game modes – including Adventure Mode, which removes the pain of permadeath. * Capture nearly any monster in the game and raise them in the Monster Corral as a pet, or breed them with other monsters! Make your experience easier, harder, or just plain wackier with over 15 included Game Modifiers. * Share some of your progress between characters by using the banking system and planting magic trees. * Explore ITEM DREAMS, randomized mini-dungeons where anything goes, and power up your gear! * Take in the scenery – comprised of beautiful 16-bit graphics and carefully handcrafted maps! * Relax to a beautiful soundtrack inspired by the most legendary RPGs of the 16-bit era, composed by award-winning composer Andrew Aversa – joined by Hiroki Kikuta, Grant Kirkhope, and Norihiko Hibino!   NINTENDO SWITCH™ EXCLUSIVE CONTENT Encounter and capture strange new creatures throughout the dungeon, such as the spiky Hardshell Snapper and frosty Polarattler! Explore a new area at the start of your adventure, Riverstone Waterway, with its unique biome and challenges! Redesigned controls and interface specifically for Joy-Con™ and Nintendo Switch™ Pro Controller!", "platform": "Nintendo Switch", "release_date": "", "game_type": "", "esrb": "", "developers": "Impact Gameworks", "publishers": "Impact Gameworks", "genres": "", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118843-tangledeep\n"}