{"altername_name": [], "name": "Terraria", "overview": "The very world is at your fingertips as you fight for survival, fortune, and glory. Delve deep into cavernous expanses, seek out ever-greater foes to test your mettle in combat, or construct your own city - In the World of Terraria, the choice is yours! Blending elements of classic action games with the freedom of sandbox-style creativity, Terraria is a unique gaming experience where both the journey and the destination are as unique as the players themselves! •Touch screen support to quickly navigate inventory and add more finesse in building, digging and combat (two Joy-Con™ controllers required per player) •Up to 8-player online play (Nintendo Switch Online membership required) •Over 300 enemies to combat, defeat, and plunder for loot •Over 20 Bosses and Events to truly test the player's skills •Endgame Celestial Invasion Event and the Moon Lord final boss encounter • Over 20 Biomes and Mini-Biomes to explore, both above and underground – from lush forests to barren deserts to dungeons, the underworld, and even the terrifying Corruption await! •New Expert Mode designed to provide new challenges for even the most seasoned Terraria veterans - with the promise of greater rewards •Updated crafting with multiple added item options •Over 20 NPCs to discover, each providing their own benefits and unique style •More than 800 new items to discover – bringing the total item count to more than 3500! •In-depth building options that are easy to learn, but allow for amazing feats of architecture in the hands of a master", "platform": "Nintendo Switch", "release_date": "June 27, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Pipeworks", "publishers": "505 Games", "genres": "Sandbox", "max_players": "8", "cooperative": "Yes", "rating": "5", "wikipedia": "https://en.wikipedia.org/wiki/Terraria", "video_link": "https://www.youtube.com/watch?v=9DwRYw2g9Sc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116586-terraria\n"}