{"altername_name": [], "name": "Tetris Effect: Connected", "overview": "Tetris Effect: Connected is Tetris® like you've never seen it, or heard it, or felt it before—an incredibly addictive, unique, and breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time, from the people who brought you the award-winning Rez Infinite and legendary puzzle game Lumines. Music, backgrounds, sounds, special effects—everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing, making any of the game's 30+ stages and 10+ modes something you'll want to experience over and over again. A challenge for the mind and a feast for all the senses, Tetris Effect: Connected is the perfect excuse to play Tetris again... and again...and again, and again, and again and again and again and again and again and again and... - Includes Cross-Platform Multiplayer! Players on different platforms can easily join Friend Match rooms with the new Room ID feature. - Spectator Mode is available in Friend Matches. A room can contain up to 8 total people. - Includes the “Zone” mechanic, where players can stop time (and Tetriminos falling) by entering “the Zone” and either get out of a sticky situation that could otherwise lead to “Game Over,” or rack up extra line clears for bonus rewards. - Multiplayer mode \"Zone Battle,\" which shakes up traditional 1-on-1 Tetris gameplay via the time-stopping Zone mechanic made famous in Tetris Effect. - A \"Connected\" co-op mode, where up to three players can literally connect their Tetris playfields together and play as one. - Over 30 different stages, each with its own music, sound effects, graphical style and background that all evolve and change as you play through them. - Ranked and unranked play, matchmaking, and player progression for unlockable avatars.", "platform": "Nintendo Switch", "release_date": "October 8, 2021", "game_type": "Released", "esrb": "E - Everyone", "developers": "Monstars", "publishers": "Enhance", "genres": "Puzzle", "max_players": "8", "cooperative": "Yes", "rating": "4.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156541-tetris-effect-connected\n"}