{"altername_name": ["Mi'pu'mi' Collection", "The Lion's Song", "The Flower Collectors", "The Lion's Song, includes The Flower Collectors"], "name": "The Flower Collectors, includes The Lion's Song", "overview": "2 great games from developer Mi'pu'mi' in one convenient package. The Flower Collectors: A detective mystery set in the political powder-keg of Barcelona in 1977. Barcelona, 1977. An ex-cop in a wheelchair witnesses a murder, and teams up with a young ambitious journalist to bring the truth to light. With camera, binoculars and transmitter in hand, uncover the town’s secrets from your balcony in this soul-searching detective mystery. One stormy night, you witness a murder. Determined to uncover the truth, you form an unlikely alliance with young ambitious journalist Melinda and start your investigation. Together, you’ll solve a complex mystery by unravelling the secrets of unsuspecting neighbours. Inspired by classic crime noir films and games like Campo Santo's Firewatch, The Flower Collectors is a detective story with a whole lot of heart. Features: • Solve a captivating murder mystery with an unusual storyline • Meet a host of colourful anthropomorphic characters in a lush, atmospheric world • Investigate using your binoculars, camera and transmitter to uncover neighborhood secrets from your balcony • Create a crime chronology to figure out whodunnit • Interrogate priests, beggars, club singers and nosy old ladies alike • Dive into the unique setting of post-Franco Barcelona in the 70ies • Emphasizes characters, world building and narrative over skill challenges The Lion's Song: Award-winning episodic adventure series. \"The Lion’s Song\" is a narrative adventure game. It is steeped in early 20th century history and focuses on a cast of Austrian artists and scientists with each episode taking a closer look at their intimate struggles with creativity and inspiration. \"The Lion’s Song” is set against the backdrop of early 20th century Austria with every episode following a different character. Each character possesses an exceptional mind and the game draws players into a story of personal struggle for creativity, human connections and inspiration: a talented composer suffering from writer's block just before her breakthrough concert, an up-and-coming painter growing through his challenges and a brilliant mathematician trying to make her voice heard in a men's world. The choices players make in \"The Lion’s Song” will have a direct impact on the story lines of all future episodes and ultimately determine if the protagonists do find the success they are working for.", "platform": "Nintendo Switch", "release_date": "June 10, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Mi'pu'mi Games", "publishers": "Mi'pu'mi Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=1vxE6fDopuw", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370745-the-flower-collectors-includes-the-lions-song\n"}