{"altername_name": [], "name": "The Last Remnant: Remastered", "overview": "Last released in 2008, The Last Remnant captured the hearts and minds of gamers with its enthralling story, countless characters and intricate battle system. Now this cult classic RPG is back with a Remastered version and is coming to Nintendo Switch with even more beautiful graphics, enhanced via an updated game engine. There exists a world woven together by four races: Mitra, Yama, Qsiti, and Sovani. In this world, mysterious objects called \"Remnants\" have existed since ancient times. Who created these objects? When? And for what reason? No one knew nor had the means to know, but continued to extract and use their colossal power. However, the Remnants' immense power gradually caused the world to fall out of balance. As further separation tore apart those who rule and those who follow, a war broke out―the beginning of a long and endless strife. A thousand years later, this story begins. ■ Distinct Battle System A command-style battle with ever-changing scenarios Coming in contact with enemies on the field will trigger battles. Strategize and make full use of the commands that change constantly depending on the positions and state of friendly and enemy forces. Morale of friendly forces greatly affects the outcome of battle In battle, morale expresses the spirit of individuals and groups of both friendly and enemy forces. Higher morale has advantageous effects such as increasing the attack stat to deal more damage, or decreasing damage dealt by the enemy.", "platform": "Nintendo Switch", "release_date": "June 10, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "GUILD STUDIO Inc.", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/The_Last_Remnant", "video_link": "https://www.youtube.com/watch?v=VZXkiV1YmTQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116503-the-last-remnant-remastered\n"}