{"altername_name": [], "name": "The Elder Scrolls: Blades", "overview": "The Elder Scrolls: Blades is a free-to-play action role-playing game developed by Bethesda Game Studios and published by Bethesda Softworks. It is a spin-off of The Elder Scrolls series, set following The Elder Scrolls IV: Oblivion and preceding The Elder Scrolls V: Skyrim. Blades is an action role-playing game played from a first-person perspective. The game was designed specifically for mobile devices and features nearly unavoidable one-on-one combat, which is engaged by tapping, swiping, or using virtual dual-stick controls via touch screen. Unlike the majority of the installments in the series, which are primarily built on open world and world map features, the game's overall design is linear, due to the challenges and limitations of mobile devices. Another distinction is that the abilities of sneaking around non-playable characters, moving corpses, and hiding/storing/stealing items were not included in the game. Combat includes using melee weapons, magic spells, and ranged attacks. Regarding the use of magic, the player can equip up to three different magic spells to use during combat. The game features dungeons that are both hand-crafted by designers and procedurally generated. Players can customize and level up their characters to enhance their abilities. Blades features three main game modes: Abyss, Arena, and Town. Abyss offers a roguelike experience in which the player must attempt to get as far as possible in an endless dungeon. Despite not being connected to the game's story, the endless dungeon is ideal to gain experience and strength for the player. Arena is a player versus player multiplayer mode in which two players battle against each other. Town is the game's main mode, which is a hub area where the player can receive quests and meet non-player characters to progress the story. The player's hub town initially starts destroyed and they are tasked with rebuilding and upgrading it, which consequently unlocks more quests and NPCs. Players can visit their friends' hub towns.", "platform": "Nintendo Switch", "release_date": "May 14, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Bethesda Game Studios", "publishers": "Bethesda Softworks", "genres": "Action", "max_players": "2", "cooperative": "No", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/The_Elder_Scrolls:_Blades", "video_link": "https://www.youtube.com/watch?v=AwttY9vrR4g", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/206784-the-elder-scrolls-blades\n"}