{"altername_name": ["The Letter"], "name": "The Letter: A Horror Visual Novel", "overview": "To what ends will one go in order to survive? When seven people fall prey to a vicious curse, they discover that the true threat rests not within the shadows, but within their own hearts and minds. The Letter: A Horror Visual Novel is an interactive horror-themed drama inspired by classic Asian horror films. Told through an immersive branching narrative, the game casts players in the ever-shifting roles of seven characters as they find themselves entangled in a mystery that’s plagued Ermengarde Mansion for centuries. The choices you make will shape and drive the story forward. Will you mend a relationship on the verge of collapse, or will you let it fall apart? Will you risk saving someone despite the consequences you could face or leave them to meet a gruesome end? Beyond the horror themes of The Letter: A Horror Visual Novel, there is heavy emphasis on character development and interaction. The fate of each of these individuals is in your hands. Features: • Discover a sprawling narrative of more than 700,000 words! • Make key decisions that directly impact the story’s course • Play as 7 different characters, each with unique motives and personality • Explore more than 80 backdrops, 100 CGs and 50 epilogue variations • Customize your experience with optional quick-time events and English voiceovers • Enjoy animated sprites and scenes that breathe life into your surroundings • Utilize a journal feature that jots down clues and tracks events in chronological order", "platform": "Nintendo Switch", "release_date": "December 15, 2021", "game_type": "Released", "esrb": "M - Mature", "developers": "Yangyang Mobile", "publishers": "eastasiasoft", "genres": "Horror", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=qfP4Eqgu_zk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371872-the-letter-a-horror-visual-novel\n"}