{"altername_name": [], "name": "The Captain", "overview": "You are Captain Thomas Welmu, a Spacefleet science officer, lost on the other side of the galaxy. Dark forces are en route to Earth to destroy our planet - and you are carrying the only thing that can stop them. Race back home across the galaxy. Collect new friends on your journey. Make new enemies. You won't be able to save everyone. Who will you leave behind? Which civilizations will you save - or destroy - along the way? The decisions are all up to you. You are... the Captain! Travel the Galaxy! Will you plot the shortest route home or take a detour to use an experimental new technology with a wormhole? Is a distant distress signal worth investigating or should you use your time to raise funds to upgrade your engine? It's All Up to You, Captain. Explore new worlds! Will you interfere with a pre-space civilization? Will you discover the terrible secret at a covert military base? Will you deliver a dying life-form's brain back to its people? Or use it to upgrade your ship? Engage in epic space battles! Or avoid them entirely? The galaxy is a dangerous place. Will you shower aggressive encounters with a barrage of Type 2 Vacuum Rockets? Or let them taste the wrath of your freshly polished Plasma Gun? ...or will you choose to slip by and hope nobody notices? Repair and upgrade your ship! Those pesky pirates have damaged your sweetheart. Should you go cheap and repair her yourself? Or spend the money and let the professionals do it right? Is it time to buy a brand new Shield Buster? Or perhaps a couple of convenient nuclear warheads? Collect new friends or make new enemies! Will you sacrifice a friend for the greater good? Will you rat out an undercover cop for a chance to get home quickly? Will you keep a life-changing truth from someone so they'll hang out and be your friend? A galaxy full of tough choices! Will you gain access to the vault with explosives or is there a less intrusive way? Will you figure out how to pull off an undercover heist using a new consciousness transmitter? Ever wanted to try escaping an automated maximum-security prison in space? Will you look fabulous in tight pink swimwear?", "platform": "Nintendo Switch", "release_date": "December 20, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Sysiac Games", "publishers": "Flyhigh Works", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/playlist?list=PLcWidTBAT6B64NHUsw4G3FoGLBf8fjVSH", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371329-the-captain\n"}