{"altername_name": [], "name": "The Walking Dead: A New Frontier", "overview": "A New Frontier is the third season of Telltale's adaptation of The Walking Dead comic book series. It continues the previous games' concept as a narrative-driven title where most of the game is presented as a series of cinematic story scenes. Player interaction is limited to dialogue options during conversations, Quick Time Events in action scenes, and free movement and minor puzzle-solving elements in some environments that can be explored freely. It is an episodic series that comprises five installments released over time: Ties That Bind Part One Ties That Bind Part Two Above the Law Thicker than Water From the Gallows The first two episodes where released simultaneously. As before, choices are carried over between episodes and lead to different events and experiences. This season has two playable protagonists, Javier Garcia and also Clementine, returning from the first two seasons. It starts with a flashback where Javier and his family are introduced prior to the zombie apocalypse. Then four years later in the present day Javi is on the road with Kate, his brother's wife, his nephew Gabe and his niece Mariana. They are constantly on the move to stay ahead of a large Walker herd, stopping for food, gas and resources wherever they can. The game's events kick off when they decide to stop at a junkyard. Soon, Clementine is introduced and she meets Javi, along with a large cast of new characters. What happened to Clem between the second and the third season is revealed through a series of interactive flashbacks, interspersing the present day events. Clem's character is shaped through the player's choices in all the previous games: what she experienced, who she shot or saved, where she went etc. These choices have led to 42 separate paths that could be followed. This third season handles that by allowing players to import saves from the previous seasons so the choices are carried over. For new players or those who lost their saves, there is the option to either have her background story be generated automatically, or to reshape it by answering a number of questions at the start of the game. Most of the mechanics and game elements return. Visually an identical style is used. This title supports Crowd Play, a feature first introduced in Batman: The Telltale Series, where an online audience can vote or suggest choices to experience and steer the game as a group. This game entry covers the third season as a whole, either because it is the only option to purchase the game (PC) or because it is available as a compilation (PS4 and Xbox One). For other platforms such as Android, iOS and also PS4 and Xbox One episodes are available separately. The first episode is bought as the base game and the others as DLC, either as individual purchases or as a season pass.", "platform": "Nintendo Switch", "release_date": "January 21, 2020", "game_type": "Released", "esrb": "M - Mature", "developers": "Telltale Games", "publishers": "Skybound Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155186-the-walking-dead-a-new-frontier\n"}