{"altername_name": ["Cristal Oscuro: La Era de la Resistencia: Tactics.", "Jim Henson's The Dark Crystal: Age of Resistance - Tactics"], "name": "The Dark Crystal: Age of Resistance Tactics", "overview": "UNITE THE CLANS: In The Dark Crystal: Age of Resistance Tactics, you will lead a fledgling resistance of Gelfling against their oppressive overlords, the Skeksis, across more than 50 unique turn-based tactics RPG battles. Along the way, you will recruit and customize new allies by assigning them jobs, modifying their abilities, and outfitting them with equipment to ensure victory. With 14 playable characters, including familiar faces from the classic film and the new Netflix original series, build your own teams and devise winning strategies to overthrow the rule of the Skeksis and restore light to the Gelfling homeworld of Thra! The Dark Crystal: Age of Resistance Tactics is an upcoming turn-based strategy game for Nintendo Switch, PlayStation®4, Xbox One, PC and Mac (via Steam)! LEAD THE RESISTANCE: A Twisted Fairy Tale Full of mystical creatures from faraway lands, experience an expansive fantasy story through the vibrant world of Thra, where innocent Gelfling lives are consumed for their essence by the nefarious Skeksis. Unite the Gelfling tribes and drive the rebellion to success, or defeat... Strategic Tactical Battles Decades of developer experience building strategy games brings multi-layered, tactical role-playing game combat. Units can be customized for specific fights with unique gear and varied abilities across an expansive job system. Use guile, planning, and cunning to overcome superior foes. The Clans of Thra Thra is full of a variety of Gelfling homesteads and unpredictable environments, from arid deserts to lush forests, each as dangerous as they are wondrous. Brave the wild lands of the Gelfling clans to unite them and obtain unique strategic benefits.", "platform": "Nintendo Switch", "release_date": "February 4, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "BonusXP", "publishers": "En Masse Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.25", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=DEHiAYN09os", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/248279-the-dark-crystal-age-of-resistance-tactics\n"}