{"altername_name": [], "name": "The Jackbox Party Pack 9", "overview": "The Jackbox Party Pack 9 is a party pack in The Jackbox Party Pack franchise. Jackbox Games announced The Jackbox Party Pack 9 on February 11, 2022. The first game, Roomerang, was announced on February 18, 2022. A total of 6 \"Inside the Box\" episodes were held, talking about the gameplay of the game. On August 16, the gameplay of the game was shown on the RHAP channel. On April 22, the second game, Fibbage 4, was announced on the PAX stream and Jackbox Games video, and on August 28, the gameplay of the game was shown on the Stumpt channel. On June 13, the third game, Nonsensory, was announced on the Twitch stream and on a video on the Jackbox Games YouTube channel, and on August 16, the gameplay of the game was shown on the Smosh Games channel. On the Jackbox Games stream about the early look at The Jackbox Party Starter it was announced that the fourth game will be announced on June 24 and it was Junktopia, and on August 12, the gameplay of the game was partially shown on the OutsideXbox channel. The fifth and final game, Quixort, was announced on July 15 on the Jackbox Games YouTube channel, but on August 26, the gameplay of the game was shown on the Swiftor channel. On August 30, Jackbox Games showed the official trailer. For the first time ever, Jackbox Games will take part in Steam Next Fest from October 3 to October 10. During this window of time, it was possible to download The Jackbox Party Pack 9 demo from the Steam store page and try out abbreviated rounds from three of the new games in the pack. After the fest ends, the demo is no longer be available for download. On August 18, information about the game was published on the official website. The game was released on October 20, 2022, it was announced on September 27. October 24, 2022, the soundtrack was released on Bandcamp.", "platform": "Nintendo Switch", "release_date": "October 20, 2022", "game_type": "Released", "esrb": "E - Everyone", "developers": "Jackbox Games", "publishers": "Jackbox Games", "genres": "Party", "max_players": "", "cooperative": "Yes", "rating": "4.33", "wikipedia": "https://jackboxgames.fandom.com/wiki/The_Jackbox_Party_Pack_9", "video_link": "https://youtu.be/q7ffJQyTC6Q", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167720-the-jackbox-party-pack-9\n"}