{"altername_name": [], "name": "The Legend of Zelda: Link's Awakening", "overview": "Link has washed ashore on a mysterious island with strange and colorful inhabitants. To escape the island, Link must collect magical instruments across the land and awaken the Wind Fish. Explore a reimagined Koholint Island that’s been faithfully rebuilt in a brand-new art style that will entice fans and newcomers alike. Battle enemies as you conquer numerous dungeons and uncover the hidden secrets of the island. Encounter Super Mario enemies like Goombas, Piranha Plants, and more, and interact with unique locals who help Link on his adventure. As you clear dungeons throughout the main story, earn dungeon rooms (Chambers), then arrange them into custom layouts in the all-new Chamber Dungeon. Place your dungeon entrance, Nightmare room, and everything in between as you try to fulfill objectives and play through a new dungeon. Tap compatible amiibo figures to earn more Chambers and and additional Chambers throughout the game in updated mini-games, such as the river rapids, trendy game, and fishing. FEATURES: As Link, explore a reimagined Koholint Island and collect instruments to awaken the Wind Fish to find a way home Explore numerous dungeons, riddled with tricks, traps, and enemies, including some from the Super Mario series Meet and interact with unique locals to get help on your adventure Listen to a reawakened soundtrack that helps bring life to Koholint Island Earn Chambers (Dungeon Rooms) and arrange them to complete objectives in the all-new Chamber Dungeon. Complete dungeons throughout the story to earn their rooms for the Chamber Dungeon. Earn additional chambers in mini-games and by tapping any amiibo figure featuring a Legend of Zelda character.", "platform": "Nintendo Switch", "release_date": "September 20, 2019", "game_type": "Released", "esrb": "E - Everyone", "developers": "Grezzo", "publishers": "Nintendo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.52", "wikipedia": "https://www.wikipedia.org/wiki/The_Legend_of_Zelda:_Link%27s_Awakening_(2019_video_game)", "video_link": "https://www.youtube.com/watch?v=PtC6U8hOZTk&ab_channel=NintendoofAmerica", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118410-the-legend-of-zelda-links-awakening\n"}