{"altername_name": [], "name": "The Next Penelope: Race to Odysseus", "overview": "The Next Penelope: Race to Odysseus is a top-down racing game including a storyline, featuring characters from Homer's Odyssey and other famous Greek myths and putting them into a futuristic setting similar to the TV series Ulysses 31. Penelope, wife of the missing Odysseus and current ruler of Ithaca, has to search for her husband due to a divine extortion of Poseidon, God of the Sea. In order to save her kingdom's people she has no choice but to travel the galaxy in the hope of finding Odysseus somewhere out there... The core of the game is a racing simulation, similar to Micro Machines. You can steer your spaceship to the left and right, but you have no direct influence on the speed of the ship; instead booster arrows, magnetic fields or special ship equipment will temporarily accelerate or decelerate your ship. Between the races you can navigate a world map where you can select the next planet to explore or extra missions after you have finished the main storyline. When selecting a new planet you will usually get access to some new equipment for your ship, some of which is quite unexpected for a racing game: • the Plasmagun to shoot enemies • the Smashboost to temporarily increase your speed and smash enemies and obstacles • the Teleport for teleporting your ship over short distances (e.g. to avoid obstacles or reach secret places) • a Harpoon to \"catch\" your enemy or remove obstacles • Vampire Mines to drop mines and regain some health and • the Black Crystal to convert enemy projectiles into experience points. Each planet features three tracks, embedded into the game's storyline: the first track is usually used to get familiar with your new equipment, the second one is often a conventional race against AI opponents and the third one contains a level boss you have to defeat. Only when you finish all three tracks the world is solved: the equipment will be added to your ship permanently and is available in the other worlds (at least if no special rules disables it). Be careful about using the equipment though. Using it will decrease your energy bar, which is equivalent to a health bar: When it's empty you will have to restart the track. Being hit by enemy missiles or crushing into walls / enemies will also decrease the energy bar. Fortunately levels often contain pads which will refill the bar while driving over them, or you can use the Vampire Mines to regain some energy if an enemy hits your mine.", "platform": "Nintendo Switch", "release_date": "December 21, 2017", "game_type": "Released", "esrb": "E - Everyone", "developers": "Aurélien REGARD", "publishers": "Plug In Digital", "genres": "Action", "max_players": "4", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118809-the-next-penelope-race-to-odysseus\n"}