{"altername_name": [], "name": "The Elder Scrolls V: Skyrim", "overview": "Epic Fantasy Reborn Winner of 200+ Game of the Year Awards, Skyrim arrives on the Nintendo Switch console. The open-world adventure from Bethesda Game Studios where you can virtually be anyone and do anything, now allows you to go anywhere—at home and on the go. New features include motion controls, gear based on the Legend of Zelda series, and amiibo compatibility. Dragons, long lost to the passages of the Elder Scrolls, have returned and the future of Skyrim hangs in the balance. As Dragonborn, the prophesized hero born with the power of The Voice, you are the only one who can stand against them. Live another life, in another world—from battling ancient dragons, exploring rugged mountains, building a home, or mastering hundreds of weapons, spells and abilities. For the first time ever, go into battle Legend of Zelda style: fight with the Master Sword, guard with the Hylian Shield, while wearing the Champion's Tunic. The game also includes official add-ons—Dawnguard, Hearthfire, and Dragonborn. The legendary open-world masterpiece from Bethesda Game Studios comes to the Nintendo Switch system Includes all content from official add-ons: Dawnguard, Hearthfire, and Dragonborn Uncover the mystery behind the return of the dragons in a massive open world to explore any way you choose Live another life, in another world and create your own custom character, and do virtually whatever you want. Choose from hundreds of weapons, spells, and abilities. The character system allows you to play almost any way you want and define yourself through your actions Your decisions matter in a world that changes dynamically based on your choices Use motion controls to battle with melee weapons, aim your bow, or pick locks, exclusively on Nintendo Switch", "platform": "Nintendo Switch", "release_date": "November 17, 2017", "game_type": "Released", "esrb": "", "developers": "Bethesda Game Studios", "publishers": "Bethesda Softworks", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.38", "wikipedia": "https://en.wikipedia.org/wiki/The_Elder_Scrolls_V:_Skyrim", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107470-the-elder-scrolls-v-skyrim\n"}