{"altername_name": [], "name": "The Swords of Ditto: Mormo's Curse", "overview": "The Swords of Ditto: Mormo's Curse is a compact action RPG that creates a unique adventure for each new hero of legend in the relentless fight against the evil Mormo. Explore a delightful but dangerous overworld, brave menacing dungeons, and improve your hero in a charming village, during your quest to overcome the evil that plagues the island. Unleash the mystical Sword of Ditto and grab a co-op friend for an unforgettable adventure filled with delightful characters, extraordinary loot, and heroic battles! Key Features: Unique Adventures Linked Together: Each adventure becomes its own legend, both distinct from those that came before it and part of a heroic legacy that bind together. The deeds, successes, and failures of each hero's adventure have implications for those that follow including the ability to find weapons and recover loot from history’s fallen heroes. Solo & Cooperative Adventuring: Battle Mormo and her evil armies alone or summon a brave friend to take up arms alongside you in local co-op mode. Fear not, even less experienced adventurers will find help from their fellow heroes through the magic of a good old-fashioned revival hug! Weapons, Items, & Stickers: Wield the traditional sword and bow combo alongside the decidedly less traditional vinyl record Frisbee, magic golf club, and colossal foot from the heavens to put Mormo and her legions back on their heels. Collect and equip stickers to boost up your hero and add perks to their gear to become powerful enough to banish the wicked sorceress.  Main Quests and Secret Side Missions: Approach your legend however you see fit by battling through dungeons in any order, completing side missions through dark caverns and deep wells, or confront Mormo right from the start for the ultimate challenge.", "platform": "Nintendo Switch", "release_date": "May 2, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Onebitbeyond", "publishers": "Devolver Digital", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.5", "wikipedia": "https://en.wikipedia.org/wiki/The_Swords_of_Ditto", "video_link": "https://www.youtube.com/watch?v=tYKu7XVoThI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118819-the-swords-of-ditto-mormos-curse\n"}