{"altername_name": [], "name": "The Battle Cats Unite!", "overview": "Now you can enjoy The Battle Cats with two players! Two players working together! Stand up against the Dog Army! Two players against each other! Show the power of your Cat Army! cat tickets that you collect as you progress through the game. *There are no additional charges in this game. ◆More stage than ever! In addition to the \"World Arc,\" \"Future Arc,\" and the \"Cosmos Arc,\" set on a journey to find the legendary cat in the \"Legend Stages.\" There are also daily stages and plenty more to do! ◆Take a break from the battle and play the mini-games for a change of pace! As you progress through the stages, mini-game opportunities will appear every once in a while, and depending on your score in the mini-game, you can earn items and leadership skills. There are four types of mini-games in total. Only the luck of the draw will tell what will be chosen! Features of \"Two Player\" Play ◆Work together to bring out the best in your character! All stages can be played by either one or two players. In two-player mode, five characters can be shared in a battle. Even if you're stuck in a stage by yourself, you won't be afraid if you play together! ◆Get your heads together and fire the Boosted Cannon! In a two-player game, the Cat Cannon collects the power of both players and releases it all at once! If you time it perfectly and get a \"Victory!\", the power is twice as strong as usual! The degree of synchronization between the two players will bring about a game changer! ◆Two against one! Battle against cats vs. cats In the battle mode, characters clash against each other! Use the new \"Trait Cannon\" feature to maximize your cat's abilities! The more you know about your characters, the stronger you'll become!", "platform": "Nintendo Switch", "release_date": "December 9, 2021", "game_type": "Released", "esrb": "", "developers": "Ponos", "publishers": "Bandai Namco Entertainment", "genres": "Strategy", "max_players": "2", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/373684-the-battle-cats-unite\n"}