{"altername_name": ["The Last Door"], "name": "The Last Door: Complete Edition", "overview": "The Last Door: Complete Edition includes eight terrifying episodes of occult and otherworldly horror inviting you to investigate Victorian England’s deepest, darkest secret. Featuring new scenes and puzzles, enhanced graphics, unlockable extras, and remastered sound. Feel what it’s truly like to be alone in the dark with this low-res, high-suspense point-and-click horror adventure, winner of multiple Best Games of the Year awards. Explore ancient manors, decaying tenements, and twisting underground warrens with little but a lamp and magnifying glass to guide you. Set in Victorian England, when Jeremiah Devitt receives a letter from his old schoolmate Anthony Beechworth with a hidden, cryptic message, he knows something is wrong. His journey to an abandoned manor is only the beginning as he starts to remember a long-buried secret from his youth, discovering things man was not meant to know, and opening doors that should have remained closed… Features: • Follow Jeremiah Devitt as he unravels the mysteries deep buried within his own psyche • Unique low-res visuals that create a rare and unnerving immersive look and feel • Includes all the episodes, extras and bonus content • Original orchestral soundtrack composed by Carlos Viola • Inspired by the works of H.P. Lovecraft and Edgar Allan Poe • Set in real locations, and deeply tied to real events, folklore and local culture", "platform": "Nintendo Switch", "release_date": "May 22, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "The Game Kitchen", "publishers": "Plug In Digital", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/The_Last_Door", "video_link": "https://www.youtube.com/watch?v=bKuRvwICtuY", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/370261-the-last-door-complete-edition\n"}