{"altername_name": ["Illustrated Book of the Strongest King of Different Species: Battle Colosseum", "異種最強王図鑑 バトルコロシアム", "Ishu Saikyou Ou Zukan: Battle Colosseum"], "name": "The Strongest King Encyclopedia: Battle Colosseum", "overview": "Ishu Saikyou Ou Zukan: Battle Colosseum (The Strongest King Encyclopedia: Battle Colosseum) offers an exhilarating journey of myth, science, and unmatched rivalry in this creature battle management game. Taking inspiration from the massively successful picture book series, Saikyou Ou Zukan (異種最強王図鑑), this game transports players to a futuristic world where the strongest creatures from various realms are brought to life with groundbreaking augmented reality technology in 3D. Become a Researcher and Train the Strongest Creatures: You assume the role of a researcher at the renowned \"Strongest King Research Lab.\" Your mission? To train and lead creatures from across different realms and time periods to victory in an epic tournament that seeks to crown the \"Strongest King.\" From monsters and \"yokai\" to animals and extinct creatures, you have a rich pool of combatants at your disposal. Unimaginable Dream Battles Realized: The game brings to life battles you have only imagined in your wildest dreams. Witness the raw power and ferocity as an African Lion goes head to head with a Tyrannosaurus Rex, or the tenacity of an Asian Giant Hornet as it takes on an African Elephant. Each battle promises to be a showcase of strength, agility, and unique abilities, offering a viewing experience that is both thrilling and unprecedented. Intense Battle Scenes: Each tournament unfolds with intense battle scenes that will keep you on the edge of your seat. Train your creatures diligently and watch them defend their honor in the battle arena. Witness the spectacle as they employ unique strategies, showcasing fierce attacks and stout defenses, in their bid to emerge victorious and claim the title of the \"Strongest King.\" 24 Different Species with Biological Data: The game not only offers heart-pounding action but also serves as an educational tool, introducing players to a plethora of creatures, each accompanied by real biological data. Players have the opportunity to learn intricate details about 24 different species, including their habitats, strengths, and weaknesses, fostering a rich understanding of these creatures while enjoying the game.", "platform": "Nintendo Switch", "release_date": "December 15, 2022", "game_type": "Released", "esrb": "Not Rated", "developers": "Nippon Columbia", "publishers": "Nippon Columbia", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=zZ4cpnJkz5k", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/372025-the-strongest-king-encyclopedia-battle-colosseum\n"}