{"altername_name": [], "name": "The Escapists 2", "overview": "Take the Ultimate Prison Sandbox Anywhere! Bust out anywhere, with anyone on the Nintendo Switch™. Team up with another inmate for local two player split screen mode, taking a Joy-Con™ each to either team up to break out, or work against one another to determine who’s the quickest convict to make an escape. Risk it all to breakout from the toughest prisons in the world. Explore the biggest prisons yet, with multiple floors, roofs, vents and underground tunnels. You’ll have to live by the prison rules, attending roll call, doing prison jobs and following strict routines; all the while secretly engineering your bid for freedom! Your prison escape antics will take you from the frosty Fort Tundra, to a train hurtling through the desert, and even to the final frontier! Escape Team Assemble! Unite with up to 3 friends to create the ultimate online escape crew and engineer the wildest escapes yet! By working together you’ll be able to create even more elaborate and daring plans. Feeling competitive? Dive into the versus mode and show that you’ve got the skills to break out of any prison faster than your friends can. If all else fails, settle your rivalry in the court yard with a prison punch up! Create YOUR Con! It’s time to make your prisoner truly yours. Choose from a massive array of customisations to make your character unique to you. It’s important to look stylish whilst you mastermind your escape. Craft your Escape! Being in prison forces you to be creative and work with the limited tools at your disposal. You’ll have to combine everyday objects like soap and socks to craft new weapons and tools to help you achieve your goal. Steal forks from the cafeteria to chip a tunnel in your room, and craft a poster from magazines and duct tape to hide the evidence. You’ll soon learn that duct tape solves (almost) everything! Prepare for a fight! The Escapists 2 introduces a brand new combat system to make every prison brawl more exciting and interactive. You’ll have to block and tie together chains of attacks whilst strafing around your locked on targets to gain the upper hand in combat. Make sure your visit the gym first to build up those muscles! New ways to escape! As the prisons get tougher you’re going to have to get more creative with your escape plans. There’s a ton of options to tackle almost any prison escape. Features • 10 Prisons • 2 player split-screen play, and up to 4 player co-operative and versus online multiplayer • Drop-in/Drop-out Online/Split screen multiplayer • Over 300 customisations • Multi-storey Prisons", "platform": "Nintendo Switch", "release_date": "January 11, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Mouldy Toof Studios", "publishers": "Team 17 Digital Ltd", "genres": "Role-Playing", "max_players": "4", "cooperative": "Yes", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/The_Escapists_2", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117952-the-escapists-2\n"}