{"altername_name": [], "name": "The Amazing American Circus", "overview": "Build your deck, amaze your audience and build a circus empire! Your worst fear is the audience’s indifference. Your best weapon is a dazzling amusement. Your artists are your army. Behold, the circus came to town! In The Amazing American Circus, you’ll build a circus empire from scratch. Flesh and blood opponents, as well as characters known from the American folklore, will stand in your way to success. As a novice owner of a small and run-down circus, you’ll have to face giants of this industry, like Ringling Bros. and P.T. Barnum. Can you defeat them? Explore the USA The United States was a new, developing country with settlers steadily pushing the American frontier… To reach their public at the time, showmen had little choice but to travel light and fast. You will visit legendary places and meet real historical characters being a part of the American circus heritage. Entertain the Audience! Deliver a perfect show in a special card duel between you and the audience. Their boredom is your enemy, and your performances and tricks are the best weapons. Choose your cards wisely and try to figure out the mood of the crowd. What’s attractive in the deep South won’t necessarily work in the industrialized North! Gather a unique Troupe! As the traveling Circus owner, you desperately need to look for new troupe members while competing with other circuses. You will gather an exotic crew of strange individuals who will perform for you, but can you deliver the best shows around while traveling from coast to coast? Manage and Expand your Circus Camp! The Amazing American Circus brings a unique blend of RPG, tycoon, and a card game. Build a strong deck of cards, improve your troupe’s stats, and manage your circus camp. Unlock new wagons and gain access to new skills, buffs, and items. The Amazing American Circus in numbers: - 200+ hand-illustrated cards - Recruit and train over 15 different types of circus artists, among them mimes, strongmen, and acrobats - 8 different circus wagons to upgrade (18 unique upgrades altogether) - 32 different types of audience, whom you have to attract and entertain - 90 cities and towns to visit - 21 story-related side quests - 16 Misfits to collect in Bizarre Baazaar wagon - 4 powerful opponents to defeat (one per region) - the legendary P.T. Barnum, Buffalo Bill, Queen Victoria, and more... - 1 but epic adventure akin to Baz Luhrman’s musicals, Ennio Morricone’s westerns, and the classic road movies - 60 minutes of a soundtrack inspired by country and folk music from different parts of the USA", "platform": "Nintendo Switch", "release_date": "September 16, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Juggler Games", "publishers": "Kablater", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/155729-the-amazing-american-circus\n"}