{"altername_name": [], "name": "The Great Ace Attorney Chronicles", "overview": "Immerse yourself in a dramatic yet charming and witty world of evidence-gathering, deduction and courtroom battles with this double-pack of the adventures of rookie lawyer Ryunosuke. Set in late 19th century Japan and England, each title features five murder-mystery episodes filled with all the drama, laughs, twists, and “turnabouts” you’ve come to expect from the legally labyrinthine legacy of Ace Attorney. Join Ryunosuke Naruhodo, ancestor of series mainstay Phoenix Wright, as he attempts to uncover the secrets behind an international criminal conspiracy and solve a hauntingly baffling cold case, while tackling a series of tricky trials along the way. Dozens of hours of attorney action awaits you! In the course of each case, you’ll speak to witnesses, examine evidence and clues, and attempt to deduce the dastardly intent behind the crime before proceeding to the courtroom. In court, you will hear testimonies, cross-examine witnesses, and present evidence. And of course, it wouldn’t be an Ace Attorney game if you couldn’t shout “OBJECTION!” when you know you’ve got the facts and evidence needed to contradict the prosecution’s claims and prove your client’s innocence. The game includes a convenient assistance feature in case you hit a dead end in your investigation, so even if this is your first Ace Attorney game, you can get into your amateur sleuthing adventures with ease! Will you be able to crack these clever cases? The game is afoot!", "platform": "Nintendo Switch", "release_date": "July 27, 2021", "game_type": "Released", "esrb": "T - Teen", "developers": "Capcom", "publishers": "Capcom", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.3", "wikipedia": "https://en.wikipedia.org/wiki/The_Great_Ace_Attorney:_Adventures", "video_link": "https://www.youtube.com/watch?v=68dOTCiez5I", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/149845-the-great-ace-attorney-chronicles\n"}