{"altername_name": [], "name": "The Warlock of Firetop Mountain: Goblin Scourge Edition!", "overview": "CHOOSE YOUR OWN ADVENTURE Battle, sneak, and charm your way through thousands of story options as you play through over a dozen major quests, each unique to a different Hero. SIMULTANEOUS TURN-BASED COMBAT Experiment with a slew of interesting battle strategies! Each Hero comes with their own set of attacks and manoeuvres. Poison, crossbows, holy magic, or a good old sword and shield – however you want to take down your enemies, there’s sure to be a Hero to suit! Venture forth, kill monsters and earn Souls to prove your might and unlock all eighteen Heroes. WHICH HERO WILL YOU TAKE INTO THE MOUNTAIN? Will you play as the noble and experienced adventurer Alexandra of Blacksand? Or perhaps take the pious and righteous path of battle-priest Landov Lowan? Forego the risks of combat with evasive sleep-bomb manouveurs as Krea Datura! Or get straight to the punch with hard-hitting rhino-man Twenty-Three. BEAUTIFULLY CRAFTED MINIATURES Encounter the nostalgic aesthetic of classic tabletop RPGs by playing with over 100 handsomely painted character and monster miniatures as you explore the depths of Firetop Mountain. GOBLINS, GOBLINS, GOBLINS! The Hill Goblins of Firetop Mountain have been unleashed on to the realm of Allansia! This special Goblin Scourge Edition features three additional adventurers whose stories are intricately woven into the Goblin Scourge. Explore the dangerous caverns and uncover the mysteries of Scarclaw’s evil minions! PLAY AS A MONSTER IN THE GAUNTLET Sick of fighting on the side of good? No problem! Play as one of Zagor’s evil minions – Slime Beast, Giant Rat, Skeleton Warrior and more – in a combat-heavy, story-light quest. Battle your way deep into the mountain, striving to earn as many Souls as possible in a single dungeon run!", "platform": "Nintendo Switch", "release_date": "September 13, 2018", "game_type": "Released", "esrb": "T - Teen", "developers": "Tin Man Games", "publishers": "Tin Man Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118867-the-warlock-of-firetop-mountain-goblin-scourge-edition\n"}