{"altername_name": ["The Coma 2: Vicious Sisters", "The Coma: Recut"], "name": "The Coma: Double Cut", "overview": "The epic survival horror series, \"The Coma: Recut\" and \"The Coma 2: Vicious Sisters\" is now available in a terrifying double pack. The Coma: Recut: The Coma is back, recut and remastered. Explore this horror-fest of the Korea indie cult classic with an all new visual upgrade and mechanics. The Coma 2: Vicious Sisters: Vicious Sisters is an atmospheric, story-driven game. Immerse yourself in the warped Sehwa district as you encounter an engaging cast of characters, solve puzzles, discover revealing clues, and fight for survival against a relentless psycho. Gameplay: Run & Hide: With no escape in sight, Youngho must roam the halls of his school at night searching for a way out. During this journey he will encounter many threats hell-bent on killing him. Explore: This twisted reality of your high school knows no kindness. Use maps, notes, and tips from other characters to navigate your way through the world and figure out how you became trapped in such a bleak place. Survive & Escape: Everything is out to get you. Youngho will have to avoid a persistent killer, lashing tentacles, and more to survive the school. Unfortunately, health is in short supply, and if you're not careful, you will die. Collect Clues: As Youngho, you must navigate through the three connected buildings of your high school using your wits. Along the way, you will find unlockable art, notes, and easter eggs that expand on The Coma universe. Oh yeah, did we mention the relentless killer, traps, and inevitable game overs? Features: • 2D hand illustrated visuals • A unique infusion of Korean horror in the survival-adventure genre • Listen carefully to footsteps revealing the killer’s approach • Run and hide from the world’s most relentless psycho-killer • Avoid poisonous tentacles and clawing shadows as you explore • Discover notes and clues that illuminate the mystery of Sehwa High • Work together with the others who are trapped here. But can they be trusted? • Crouch in the shadows during intense moments as the Killer searches for you • Reveal the startling mystery of your school through maps, notes, and exploration", "platform": "Nintendo Switch", "release_date": "August 31, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Devespresso Games", "publishers": "Chorus Worldwide", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=MdbypOkwYzg", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371954-the-coma-double-cut\n"}