{"altername_name": ["This is the Police 2"], "name": "This is the Police II", "overview": "Interpret the law as you see fit in This Is the Police 2, sequel to the acclaimed noir drama This Is the Police! Run the sheriff’s department, manage your cops, investigate, interrogate, incarcerate, make tough decisions – and try to keep out of prison yourself! – in this story-driven mixture of adventure and strategy, set in a cold border town riven with violence. Welcome to Sharpwood, where people know their neighbors by name and faithfully keep to their traditions, no matter how barbaric those traditions might be. Smugglers, gangs, and screaming populists call this town their home. Despair grows like a cancer, hand in hand with violence. It’s a hell of a job for the new sheriff, Lilly Reed (voiced by Sarah Hamilton, of the celebrated adventure saga The Longest Journey). She’s struggling to maintain order and peace, while her subordinates are uncouth men who aren’t used to taking commands from a young woman. But everything changes when a mysterious stranger calling himself Warren Nash appears in Sharpwood. And no one knows what he'll bring to the town: salvation or perdition. Features: Jump into a surprising mix of gameplay styles. Just like its predecessor, This Is the Police 2 draws on different genres and mechanics, merging them into a one-of-a-kind story driven experience – this time adding even more unexpected twists. Is it an adventure game? A strategy? A simulation? A management game? A visual novel? A puzzle? It’s all of these, and more! Participate in a harsh story where no one is completely innocent. The people of Sharpwood are ignorant and cruel. Poverty and hunger are met with increased outbursts of domestic crime, all while the inaction of the authorities has the townspeople relying on “forest spirits” and archaic religious cults. Constant problems with the food supply have delivered the town into the hands of local smugglers, many of whom are former military. Accuse the innocent, make deals with criminals, torture the ones who won’t go along willingly – you can do whatever it takes to make things go your way. Keep your friends close, and your enemies closer. Your subordinates aren’t just some resource; they are living people with their own strengths, weaknesses, fears and prejudices – and you'll have to reckon with all these things in order to survive. The same goes for the rest of townspeople: in Sharpwood, everything’s built on personal relationships, and you never know when being friends with the local butcher or business associates with the morgue owner might save your life.", "platform": "Nintendo Switch", "release_date": "September 25, 2018", "game_type": "Released", "esrb": "M - Mature", "developers": "Weappy Studio", "publishers": "THQ Nordic", "genres": "Action", "max_players": "", "cooperative": "No", "rating": "2", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/118851-this-is-the-police-ii\n"}