{"altername_name": [], "name": "This Is the Police", "overview": "Dive into a deep story of corruption, crime and intrigue. Take the role of gritty Police Chief Jack Boyd, and come face to face with the ugly underbelly of Freeburg, a city spiraling the drain. Will Jack reach his retirement with a nice stack of bills, or will he end up broken ... or worse? Manage your staff, respond to emergencies, and investigate crimes in a city on the brink of chaos. The mafia underworld maneuvers behind the scenes, sinking their claws ever deeper into the city, even as the mayor is ready to exploit every situation to his political advantage. Choose your approach to each situation as it unfolds. Sometimes you’ll be responding to a developing crisis at a crime scene, or negotiating with Freeburg’s crime bosses. Sometimes you’ll find yourself dodging questions in the press room, or even the occasional cross-examination in the witness box. Can you keep this pressure cooker from exploding, at least for long enough to stash away a nice retirement nest egg? • Your mission is clear: make $500,000 in 180 days, before Jack Boyd reaches retirement. How? That’s up to you! • Decisions, decisions! This Is the Police is all about a dark story and how you react to it. Whatever you decide, your choices will influence the game – and the fate of Jack Boyd. • The Good, the Bad, and... the Ugly? The Chief of Freeburg's Police Department deals with all kind of people. It is up to you to find the bad guys, and decide how to deal with them. • Carry out your duties. As head of Freeburg PD, Jack deals with all sorts of challenges every day: responding to emergencies, managing his officers, defending the department against City Hall and a corrupt mayor, and much more. • Solve Investigations and gather evidence against the criminal gangs of Freeburg. • Deal with the competing powers of the city. Everyone offers you favors, and each one comes at a price. • Rich and fully voiced story: Jack Boyd is portrayed by Jon St. John, the voice of Duke Nukem.", "platform": "Nintendo Switch", "release_date": "October 24, 2017", "game_type": "Released", "esrb": "M - Mature", "developers": "Weappy Studio", "publishers": "Nordic Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/This_Is_the_Police", "video_link": "https://www.youtube.com/watch?v=aBCZt0qCaS8", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/101546-this-is-the-police\n"}