{"altername_name": [], "name": "To the Moon", "overview": "To the Moon is an interactive storytelling and adventure game developed and published by Freebird Games. It was originally released for Microsoft Windows in November 2011, with ports later being released for Mac OS X, Linux, Android, iOS and Nintendo Switch. The story follows two doctors who offer to fulfill a dying man's last wish using artificial memories. The game features relatively few gameplay mechanics, with the player controlling the two doctors, exploring the narrative and solving puzzles as they try to reconstruct the dying man's memories in order to fulfill his wish. The game was designed by Kan Gao using the RPG Maker XP toolkit. Development started in 2010, when Gao was struck by questions of mortality following his grandfather's life-threatening condition. To the Moon would become Freebird Games' first commercial product, following smaller, experimental games released for free on the studio website. The game was updated later to include free downloadable content, called \"minisodes\", to give more context to the main characters. In 2014, Freebird Games released A Bird Story, a short \"minisode\" that connects To the Moon with its sequel, Finding Paradise. While criticized for its lacking gameplay, To the Moon received praise for its narrative and music, thematic material and emotional power. The game was nominated for several awards by gaming outlets, earning \"Best Story\" from GameSpot's 2011 end-of-year awards. Retrospectively, To the Moon is highly regarded by critics and players alike for its story, with some considering it as an example of artistic expression in video games. An animated film adaptation is in development, and will be partially scripted and supervised by Gao.", "platform": "Nintendo Switch", "release_date": "January 16, 2020", "game_type": "Released", "esrb": "E - Everyone", "developers": "Freebird Games", "publishers": "X.D. Network Inc.", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/To_the_Moon", "video_link": "https://www.youtube.com/watch?v=RGEovo2mdIc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/134301-to-the-moon\n"}