{"altername_name": [], "name": "Tray Racers!", "overview": "The world ended... But the fun didn’t! Race solo, or with your pals across the adorable post-apocalyptic world of Tray Racers! From the creators of PHOGS!, Tray Racers! is a free-to-play racing game set in a vibrant post-apocalyptic world. Armed with nothing but your trusty tray, you play as a ragtag kid speedster - race solo or with up to 16 players through a wacky playground of randomly-generated sand dunes, cute critters, bouncy cactus forests and more! Surf the sizzling sands. Dazzle your pals with tray tricks. Hitch a ride on a giant worm. And outspeed your friends to become…the ultimate Tray Racer! For gamers of all ages! ❤ RACE Hold onto your butts! It’s time to race… Surf the dunes on your very own tray Race solo or in online multiplayer (with up to 16 players!!) Embrace your inner daredevil with *bonus speed* for near misses Goof off with silly emotes Pull off ✨cool ✨ tray tricks & combos Perfect for parties with pals ❤ EXPLORE Discover a dazzling desert-world! When the world ended, the people of Tray Racers! found a better, more sustainable way to live. Together, and in better harmony with nature. Every race takes place on a unique, randomly-generated track - with weird and wonderful vistas, hazards, creatures, and surprises from a mix of bizarre & beautiful post-apocalyptic biomes. Featuring: Bouncy cactus forests Wacky wastelands Cute bugs & other critters Chaotic Canyons Sustainable solarpunk settlements Herds of GIANT Camellos & More! STYLE Race in style! Give your racer a makeover with... Sick Threads Gnarly Hairstyles Custom tray paint-jobs & More! CHILL Get cute and cozy at the Camp Hang out with friends between races at the chilled-out Camp lobby Host a jam sesh with the Camp’s musical instruments Ponder your place in the universe under a starry night’s sky Pet *everything* with a dedicated ‘pet-the-thing’ button (There’s a friendly creature in the Camp called Scrump and we love him…) Wholesome vibes Made with ❤ by an indie team A positive take on the apocalypse that celebrates all things eco, kindness & community No way to hinder other players while racing (winning isn’t everything!) Characters that make you go awwwwwwww", "platform": "Nintendo Switch", "release_date": "April 13, 2023", "game_type": "Released", "esrb": "E - Everyone", "developers": "", "publishers": "Bit Loom", "genres": "Action", "max_players": "16", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/368090-tray-racers\n"}