{"altername_name": [], "name": "Triangle Strategy", "overview": "Triangle Strategy is a tactical role-playing game developed by Netchubiyori and Artdink, and published by Square Enix. Nintendo published the game for Nintendo Switch outside Japan. Development is led by Tomoya Asano, producer of the Bravely Default and Octopath Traveler games. The game is a turn-based tactical role-playing game in the vein of Fire Emblem or Final Fantasy Tactics. The player takes turns moving characters from their party across a grid-based playing field in which computer-controlled opponents must be attacked and defeated. Each character has a set value for movement range and attack power and range per turn based on their inherent attributes, and alterable ones, such the terrain they are position on, and weapons or armor they are equipped with. Characters must be positioned to attack opposing forces, which deplete their health points; losing all health removes a character from the battlefield. In addition to attacking opposing forces, certain parts of the environment may also be attacked; for example, a fire attack could be used to attack an opponent, or used to burn down an area cottage to change the terrain. Story scenes in between battle directly affect game flow; the game presents the player with decisions with different values related to morality, liberty, and utility, and decisions made affect things such as which characters will support or oppose the player's cause, and alter the course of the battles and story scenes.", "platform": "Nintendo Switch", "release_date": "March 4, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "ArtDink", "publishers": "Nintendo", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.27", "wikipedia": "https://en.wikipedia.org/wiki/Triangle_Strategy", "video_link": "https://www.youtube.com/watch?v=7nhTJ-Evv_U", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/159652-triangle-strategy\n"}