{"altername_name": [], "name": "Turrican Anthology Vol. I", "overview": "The Turrican series was created by Factor 5 back in 1990. The first two games in this collection, Turrican and Turrican 2, were released on the Amiga and started the legacy of the well-known series. A must-play for any retro game fan! Super Turrican followed in 1992 and developed some key features of the series. Players can now also check out the Super Turrican Director’s Cut which adds new content with the extension of an existing stage and the addition of one completely new extra level. As last entry in the Turrican Anthology Vol. 1, the new Mega Turrican Score Attack comes with an extra level completing this full action-packed Turrican experience! The sensational Turrican series was celebrated as a ground-breaking video game series, mixing exploration with non-stop action, and one of video game's finest soundtracks by legendary German composer Chris Huelsbeck. Play through the history of Turrican's finest moments and discover new, additionally added features! Additionally added contents: • A map feature allowing you to scan the whole map • The ability to turn different map layers on and off • Various enhancements on the original map like real-time and overlay maps • Different soundtracks to choose from: emulated, original remastered by Chris Huelsbeck himself or Turrican Soundtrack Anthology music • The option to choose either Amiga, Console or modern controls • Unlockable cheats • Jukebox for each game + Bonus Jukebox • A gallery with never-seen-before concept art • Manual scans for all games • Improved rewind support • Selectable covers for each game Games Included: Turrican (Amiga) Turrican 2 (Amiga) Super Turrican (SNES) Super Turrican Director's Cut (SNES) Mega Turrican Score Attack (Genesis/Mega Drive)", "platform": "Nintendo Switch", "release_date": "July 29, 2022", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "ININ Games", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://turrican.fandom.com/wiki/Turrican_Anthology", "video_link": "https://www.youtube.com/watch?v=CcGtqRaWNJ0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/163558-turrican-anthology-vol-i\n"}