{"altername_name": [], "name": "Turrican Anthology Vol. II", "overview": "The Turrican series was created by Factor 5 in 1990. Turrican 3 and Mega Turrican were developed and released in 1993 for Amiga and Mega Drive/Genesis and diverged from the original Turrican formula. With the implementation of the Plasma Rope, the player could now grapple and swing across the stage. Super Turrican 2 introduces a new look and feel, including vehicles like the desert buggy and motorcycles. The new Mega Turrican Director’s Cut comes with a secret level unlocked from the start. The last entry to complete the Turrican Anthology Vol. 2, Super Turrican Score Attack adds a completely new large level! The sensational Turrican series was celebrated as a ground-breaking video game series, mixing exploration with non-stop action, and one of video game's finest soundtracks by legendary German composer Chris Huelsbeck. Play through the history of Turrican's finest moments and discover new, additionally added features! Additionally added contents: • A map feature allowing you to scan the whole map • The ability to turn different map layers on and off • Various enhancements on the original map like real-time and overlay maps • Different soundtracks to choose from: emulated, original remastered by Chris Huelsbeck himself or Turrican Soundtrack Anthology music • The option to choose either Amiga, Console or modern controls • Unlockable cheats • Jukebox for each game + Bonus Jukebox • A gallery with never-seen-before concept art • Manual scans for all games • Improved rewind support • Selectable covers for each game Games Included: Turrican 3 (Amiga) Mega Turrican (Genesis/Mega Drive) Mega Turrican Director's Cut (Genesis/Mega Drive) Super Turrican 2 (SNES) Super Turrican 1 Score Attack (SNES)", "platform": "Nintendo Switch", "release_date": "2022", "game_type": "Released", "esrb": "", "developers": "", "publishers": "ININ Games", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://turrican.fandom.com/wiki/Turrican_Anthology", "video_link": "https://www.youtube.com/watch?v=IsYeFutMHcE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/167532-turrican-anthology-vol-ii\n"}