{"altername_name": ["TY the Tasmanian Tiger HD + TY the Tasmanian Tiger 2: Bush Rescue HD: Bundle", "TY the Tasmanian Tiger HD + TY the Tasmanian Tiger 2: Bush Rescue HD"], "name": "TY the Tasmanian Tiger HD / TY the Tasmanian Tiger 2: Bush Rescue HD", "overview": "G'day mate! Here's a mega bundle of Tasmanian goodness containing the first two games in the TY the Tasmanian Tiger series, both in glorious HD. Ripper! TY the Tasmanian Tiger HD: Join TY on an adventure to free his family from the DREAMING and stop the nefarious evil genius Boss Cass from removing mammals from the top of the food chain. To help you on your quest, you've got a \"beaut\" arsenal of boomerangs, sharp teeth, and the help of a few friends! So don’t be a galah - let's head down under, and have a corker of a time! TY the Tasmanian Tiger 2: Bush Rescue HD: The evil Boss Cass is up to his old tricks. After breaking out of Currawong Jail, this feathered villain has re-instated himself as the dictatorial ruler of Cassopolis, a high-tech island home to lizards and birds. TY the Tasmanian Tiger 2: Bush Rescue HD offers platform gamers a huge open environment to explore by foot and vehicle. Throw boomerangs, bite, smash and glide your way around the Australian Outback and stop the evil plans of the wicked Boss Cass and help the good folk of the little country town of Burramudgee. Features: • Explore from the beach to the desert to the billabong and beyond in a huge open world of old-school 3D platforming glory. • Arm yourself with 20 different boomerangs including the classic Ironbark, Flamerang and two NEW rangs! • Brand new photo-mode. • A wide variety of vehicles like the Fourbie, cart, and mechs. • 7 Levels of two-player split-screen cart racing. • Improved camera & graphics; including updated shadows, reflections and HD resolutions. • New Gamemode called \"Hardcore Mode\" • Character customization with NEW skins for TY and paint jobs for the Fourbie!", "platform": "Nintendo Switch", "release_date": "October 29, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Krome Studios", "publishers": "Krome Studios", "genres": "Adventure", "max_players": "2", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371882-ty-the-tasmanian-tiger-hd-ty-the-tasmanian-tiger-2-bush-rescue-hd\n"}