{"altername_name": [], "name": "Unusual Findings", "overview": "It’s the 80s and the Christmas is coming, Vinny, Nick and Tony are young and their new cable signal descrambler just arrived. That same night while trying to decrypt a pay per view adult channel, they pick up the distress signal of an alien spaceship crash-landing in the woods near their town… Things only get weirder as they realize that the towering alien is killing very specific members of their community! Explore the world oozing with nostalgia, check the Video Buster Store for clues, challenge other kids at the Laser Llamas Arcades, go learn a new trick at The Emerald Sword comic store, try to get along with the punk looking Lost Guys at their hideout or even dare to ask THE BULL, the quintessential 80s Action hero, for some help! Follow the story that pays tribute to 80s classics like The Goonies, The Explorers, Monster Squad, The Lost Boys, They Live, Terminator, and Aliens among others and a gameplay that combines mechanics of Point and Click masterpieces like Full Throttle with its own unique twist and more. Your decisions do matter, and the way you make these three friends interact with each other increasingly affects their friendship and the whole story, changing the way they solve the game puzzles, the locations they visit, the answers they find, the story, everything. Uncover the truth hidden behind the alien invasion… well sort of. Why here? Why is it killing locals? How can the boys stop it? Will they tune in the adult channel after all? The answers to these and other questions… in Unusual Findings.", "platform": "Nintendo Switch", "release_date": "October 12, 2022", "game_type": "Released", "esrb": "T - Teen", "developers": "", "publishers": "ESDigital Games", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=cptwXGnjM6w", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/166158-unusual-findings\n"}