{"altername_name": [], "name": "Urban Trial Playground", "overview": "Backflip from the rooftops, over palm trees and sand dunes in ‘Urban Trial Playground’ and become the ultimate stunt racer! This new installment of the stunt bike racing series is moving the action from city streets, straight to the sunny and colorful beaches of California, mixing in even crazier tricks, flips and combos than ever before. It’s a game of speed, balance and style! Independent front and rear brake controls allow players to pull off stoppies and front flips as well as sliding into huge skid burns on the track! With a vibrant, sun-soaked background and chilled out atmosphere setting the scene for some truly breathtaking stunts, get ready to flip, trick and roll over palm trees and golden sands dunes. EVERY LEVEL IS YOUR PLAYGROUND Urban Trial Playground levels are designed as a surface able to be used to perform tricks and stunts, combining your best moves into multi-score combos. BECOME THE ULTIMATE CHAMPION Urban Trial Playground has been created to provide countless hours of action for fans of adrenaline and freestyle fanatics. Combine tricks in unique and virtually endless combos to grind your score and rise to the top of leaderboards! DIFFERENT GAME MODES Freestyle & Time Trial modes will include online leaderboards across the 50+ game levels. You can also challenge your ghost in Time Trial mode: watch your best runs and try to beat them by perfecting different and faster routes or performing even crazier tricks. Take advantage of the Nintendo Switch's built-in multiplayer functionality and race against friends or family in competitive modes with 2 players split screen play in Time Trial or Tag modes. CUSTOMIZATION IS THE KEY TO WIN WITH STYLE UTP features 5 customizable bikes that you can not only upgrade the look of but also the engine, brakes and vital parts, which impact how the bike controls. A wide variety of customization for your bike and rider will allow you to personalize your style and score new records in true California style!", "platform": "Nintendo Switch", "release_date": "April 5, 2018", "game_type": "Released", "esrb": "E - Everyone", "developers": "Teyon", "publishers": "Tate Multimedia", "genres": "Racing", "max_players": "2", "cooperative": "Yes", "rating": "4", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=qPfXpHkFlGU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116500-urban-trial-playground\n"}