{"altername_name": [], "name": "Valley", "overview": "Valley is a first-person game focused on the exploration of a valley in the Canadian Rocky Mountains. The player's character, either male or female, is an explorer determined to track down an ancient relic called the Lifeseed, said to hold the power to shatter worlds. After an entrance through a cave, a mysterious valley is reached, filled with strange, glowing creatures and orbs, in a lush environment. At the same time there are traces of civilization through vehicles and structures. Early on in the game a crate is found with a L.E.A.F. (Leap Effortlessly though Air Functionality) suit inside that is equipped right away. It is an experimental suit developed for a type of soldiers for the Pathfinder program of the company Pendulum, originally meant to help fight World War II in Europe. The L.E.A.F. suit opens up the two main gameplay elements: freedom of movement and the ability to control life and death. The suit allows for high jumps and gaining speed by going down slopes. When jumping at a fast speed large gliding jumps with air control are possible, reminiscent of the Tribes games. These actions can be performed at any time, but often fast sequences are mixed with slower ones based on exploration, both outdoor and indoor. While most of the game is linear, many of the levels are very large and can be explored in any direction. Many suit abilities become available gradually, such as the Icarus Boost (double jump), Lake Skipper (run over water for a short time), Viper Coil (swing with a hook), gaining traction on metal tracks, moving up vertical, metal surfaces and so on. The second main function of the suit is to control life and death. Special suit abilities require energy to operate and recharging is possible by picking up glowing orbs in the environment. Bolts of energy can also be shot to bring animals and trees back to life. The opposite is also possible: energy can be extracted from the environment, killing nature and creatures. None of these actions is permanent and can be reversed at any moment. The valley itself also acts as the character's health system. When the character dies, a technique called quantum death is used, meaning the character returns in one of many parallel realities, but at the cost of the valley's health. The valley dies with you. This means that more trees and animals die and the valley's health can be restored by spending energy to bring back more to life. There are many collectibles in the environment, such as acorns, encouraging exploration. These are usually found below trees that are brought back to life and are used to open special doors. There are also many hidden crates, containing notes of characters, acorns, medallions used for another type of entrance, energy refills and permanent energy upgrades. Energy can also be extracted from certain devices and can be used to kill a type of shadow enemies and strange, floating anomalies. Most levels each introduce a new type of environment, mixing nature with caves and technological facilities. All unlocked abilities are however present at all times. A compass with a marker near the top of the screen is used to keep track of the main objective.", "platform": "Nintendo Switch", "release_date": "March 7, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Blue Isle Studios", "publishers": "Blue Isle Studios", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/154599-valley\n"}