{"altername_name": [], "name": "Various Daylife", "overview": "An all-new adventure x daily life RPG from SQUARE ENIX, created by the development team that worked on OCTOPATH TRAVELER and BRAVELY DEFAULT. ■Story In the year 211 of the Imperial Era, a new continent was discovered. Explore its every last corner as a settler of Antoecia, while living your life to the fullest in the city of Erebia. ■Features • Character growth through everyday work VARIOUS DAYLIFE features over 20 job classes and more than 100 types of work for those jobs to perform. Since you’ll be able to increase your strength through physical labor or improve your magic with more mentally taxing tasks, you can shape your character how you see fit depending on your choice of work. • Overcome dungeons with skilled management Choose what limited rations, items and camping gear you can pack in your bags as you leave the safety of the city to confront the unknown. You'll battle monsters, bad weather, and food spoilage out on the various frontiers of Antoecia. When the going gets tough, will you press onward, or retreat to explore another day? You’ll have to make these kinds of decisions as you trailblaze a way across the continent, where none have trod before. • Innovative Battle System – The Three CHAs Introducing a twist to the traditional job-and-ability, turn-based battle, with a unique system that relies heavily on working together with your allies. CHANGE your foes' conditions, build up a CHAIN of attacks and seize your CHANCE at inflicting heavy damage!", "platform": "Nintendo Switch", "release_date": "September 13, 2022", "game_type": "Released", "esrb": "E - Everyone", "developers": "Square Enix", "publishers": "Square Enix", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://en.wikipedia.org/wiki/Various_Daylife", "video_link": "https://www.youtube.com/watch?v=ir8ocpJTYHs", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/237253-various-daylife\n"}