{"altername_name": ["Warlocks 2: God Slayers"], "name": "Warlocks II: God Slayers", "overview": "Become a mighty Warlock in this action-packed, humorous RPG and slay the arrogant Gods that dared to stand in your way. Challenge them alone or with up to 4 friends in local co-op. In God Slayers you take on the role of one of the members of The Order of Warlocks. This time around you’ll have to face a much bigger threat, than in the original game. By slashing hordes of shadow monsters in the past, Warlocks have angered the Gods, who now turned against them. In result, you can now either give up, ask for mercy and then quietly die, as “mercy” is not a word easily found in Dark Gods’ vocabulary. Or you could release all your godlike powers instead and make the Gods pay for their betrayal. Be sure though, that they’re not willing to go without a fight and they’ll throw at you all kinds of seemingly hilarious pixel art opponents. Don't be fooled by their funny looks however as rest assured, they’ll use any means necessary including their special skill sets to take you down. With the aid of giant bosses they will bring your skills to the test. Slay or get slain. There’s no other way. In Warlocks II: God Slayers you’ll find: ● Hilarious pixel art with hand-drawn animations; ● Dynamic hack'n’slash experience in solo and local co-op; ● More than 40 types of challenging enemies that work together to take you down, using their unique skill sets; ● Extensive maps with tons of randomly generated loot to be picked up; ● 5 different types of Warlocks to pick up from, each with their own abilities to unlock throughout the game; ● 8-10 hours of gameplay to complete the adventure with one Warlock ● Varied powerful and enormous bosses only waiting to get slain.", "platform": "Nintendo Switch", "release_date": "June 7, 2019", "game_type": "Released", "esrb": "T - Teen", "developers": "Fat Dog Games", "publishers": "QubicGames", "genres": "Action", "max_players": "4", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156129-warlocks-ii-god-slayers\n"}