{"altername_name": [], "name": "Warplanes: WW2 Dogfight", "overview": "In Warplanes: WW2 Dogfight players get the chance to take a seat at the controls of a historical airplane and feel the power of its engines and experience the rush of adrenaline flowing through their veins while facing an enemy plane up in the air. In each of the campaigns for Great Britain, USSR, and Germany, gamers will be able to test their flying skills during deadly encounters with enemy fighters: protecting ground structures from bombers, fighting over the sea to weaken enemy navy, or piloting bombers to destroy strategic targets. Players with a tactical approach will also be able to build a base – by constructing additional hangars and supporting structures and then ensuring their safety by building anti-aircraft artillery and barrage balloons. There’s all this, plus over 30 historical airplanes at their disposal: from classic fighters to light and heavy bombers which they can fly, repaint, customize, and upgrade. Included in the collection are the Spitfire, Hurricane, Lancaster, II-2 “Shturmovik”, La-5FN, Ju-87 “Stuka”, Fw 200 “Condor”, and a Nintendo Switch™ exclusive – the Curtiss P-40 Warhawk. Warplanes: WW2 Dogfight offers easy-to-learn gameplay with intuitive controls and user-friendly flight mechanics. The game features precise graphic design, with detailed 3D models and amazing special effects, making the entire air combat experience more immersive. English, Russian, and German radio chatter adds to the mood as players fly into the atmosphere of a World War 2 dogfight.", "platform": "Nintendo Switch", "release_date": "February 21, 2019", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "7Levels", "genres": "Flight Simulator", "max_players": "1", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113400-warplanes-ww2-dogfight\n"}