{"altername_name": ["Witch Spring 3 Re:Fine: The Story of the Marionette Witch Eirudy", "마녀의 샘 3 Re:Fine"], "name": "WitchSpring 3 Re:Fine: The Story of Eirudy", "overview": "WitchSpring 3 Re:Fine is an enhanced rerelease of the mobile game WitchSpring 3. A traditional turn-based RPG, it follows the witch Eirudy who lives alone in a magic forest to escape persecution from humans. Her self-imposed exile ends when she meets a human who had stumbled his way into her forest while escaping from guards, and she becomes drawn into his life. Eirudy's loneliness doesn't just extend to her story. She's the only playable character in the game, and the turn-based battles are primarily fought with Eirudy alone versus the enemies. She can, however, repair her puppets and bring them into battle with her as supporting characters; each puppet features a limited set of actions and can be brought in for a limited number of turns, so players need to choose their allies carefully. Although battles are more or less traditional, Eirudy doesn't grow her statistics through them; she only obtains items. Instead, there are two primary ways players can grow over the course of the game. Training regimens, which players can do in limited amounts over the course of the game, allow players to target specific statistics to improve. Items can also permanently improve Eirudy's statistics, and they can only be obtained by crafting them. Eirudy can collect rare incredients via exploration and battling different enemies, allowing players to choose the course of their journey in order to optimize finding the different crafting ingredients she needs. Re:Fine updates the original game with updated graphics and brand-new voice acting for its core cast. It also features a new game mechanic: doll summoning. Complementing the puppet mechanic in the original game, it allows players to collect a large cast of supporting characters who can be summoned to perform one-time special actions during battles.", "platform": "Nintendo Switch", "release_date": "December 17, 2020", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "IKINAGAMES", "publishers": "ININ Games", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153826-witchspring-3-refine-the-story-of-eirudy\n"}