{"altername_name": [], "name": "Wolfstride", "overview": "Get wrecked in this immature grown-up RPG about a trio of troublemakers stumbling their way through a giant mecha tournament. Wolfstride is a role-playing game about three former partners-in-crime coming to a turning point in their lives. When they inherit a junkyard mecha called Cowboy, they reunite to enter the planet’s most elite mecha competition: the Ultimate Golden God Tournament. Each member of the team lends their unique experience as they prepare to outwit the best mecha opponents from around the world. Between dog-mechanic Duque, mecha pilot Knife Leopard, and jack-of-all-trades Dominic Shade, the core crew’s got just about everything covered. That is… until their simple mission to make money unfolds into a deep, slow-burning exploration of their complex lives, the dark choices of their past, and their inevitable fate. THE HANGAR The hangar is Duque's domain. Repairing damage between battles is just the beginning. Swap out parts, install upgrades, and add new weapons to improve Cowboy and perfect the custom loadout designed to beat your next opponent. RAIN CITY Take the role of exiled former Yakuza, Dominic Shade, to explore every quirky corner of Rain City. A half dozen establishments introduce a kaleidoscope of characters, each offering support, a job, or a biting insult to your journey. THE ARENA Enter the arena to fight it out in giant robots one on one. The turn-based battle system rewards preparation and strategy. Move carefully to get in the best position to attack and keep the enemy off-balance. Target attacks to wear down your opponent or go on the defensive when the fighting gets too hot.", "platform": "Nintendo Switch", "release_date": "May 10, 2022", "game_type": "Released", "esrb": "M - Mature", "developers": "OTA IMON Studios", "publishers": "Raw Fury", "genres": "Fighting", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=tSIGZy_qg7M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/374102-wolfstride\n"}