{"altername_name": [], "name": "Wonder Boy Asha in Monster World", "overview": "One person and one animal, working together for a great adventure! The adventures of Asha and Pepeloglu begin! Asha, the warrior protagonist of the game, is involved in a serious incident that will affect the survival of her world. Our green-haired heroine doesn’t have to save the world all alone, and sets off on an adventure with her cute flying friend, the blue Pepelogoo. Asha and the Pepelogoo have to work together to become the heroes the world needs them to be. The road ahead is long - will they be able to save their world? ■A side-scrolling action game that is light and easy to play. The action is fast and challenging, but the game is tuned for easy retrying, making it easy to try again. ■Call it, grab it, throw it, move it, her blue buddy Pepeloglu. Join forces with your partner to overcome gimmicks and powerful enemies. ■Various action levels High mountains, volcanoes, ice worlds, the sky... Let's run through the various areas with Peperoglu. ■Explore the vastness of the world! The vast world is full of unknown encounters, events, and discoveries. Even if you've cleared a stage once, you might discover something if you visit it again. ■Power up Asha and you'll be ready for the difficulties! By acquiring items and equipment, you can strengthen your attack and defense capabilities. Get ready to face the powerful enemies. A full remake of \"Monster World IV,\" the action RPG masterpiece released in the 90's, by the staff of the time! We hope you will enjoy the reborn \"Wonder Boy: Asha in Monster World\" with new visuals and sound adjustments. ■Staying true to the series legacy For Wonder Boy - Asha in Monster World, the original staff from the former Westone Bit Entertainment gathered together to create a game that stays true to the spirit of the original games. The team is led, and directed, by the creator of the Wonder Boy series, Ryuichi Nishizawa and supported by Shinichi Sakamoto (sound), Maki Ōzora (character design) and Takanori Kurihara (creative management). You can't get more Wonder Boy than that", "platform": "Nintendo Switch", "release_date": "May 28, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "MONKEY CRAFT", "publishers": "STUDIOARTDINK", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3.33", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/151884-wonder-boy-asha-in-monster-world\n"}