{"altername_name": [], "name": "World of Tanks: Blitz", "overview": "Action-packed MMO with PvP tank battles. Meet this Legendary free-to-play 3D Tank Shooter for Nintendo Switch™! Become part of a community of players from across the world. Join this modern 2020 shooting game and battle 7x7 on your own or with friends, research and upgrade armored vehicles, use various tactics from aggressive onslaught to stealthy survival, and win. Pick a tank and become a battlefield hero! GAME FEATURES • An enormous world of tanks numbering over 350 unique and exclusive combat vehicles with thoroughly elaborate 3D models! Historically accurate vehicles, experimental tanks based on blueprints of famous engineers, and armored monsters from popular alternative universes fight together here! • Dynamic 7x7 battles with different modes in over 25 battle arenas. Each combat encounter is unpredictable as the outcome depends on you and your team. • Jam-packed action! In-game events feature rare vehicles as rewards and battles with dramatically different gameplay. Become an invisible (and not only) hero of battle arenas in Mad Games. Challenge yourself to a test of survival in Realistic Battles. Or... become a mighty force as a little battle duck for April 1! • A shooting game with a well-developed progression system. Research vehicles from Tier I tanks to monstrous Tier X machines. Change guns, pick equipment, wear camouflage, and increase your survival odds. Tune your combat vehicle to suit your playstyle and strike opponents with the sheer force of your steel war machine! • Spectacular 3D graphics that automatically optimize to your device. Enjoy the eye-catching features of every battle arena, highly detailed tank models, massive explosions, and flying, blown-off turrets. Manual settings will help you find the balance between a fantastic picture and high FPS. • Teamplay! Join forces with your friends in platoons, become a clan member to battle alongside like-minded players in Rating battles, and participate in tournaments with prizes! Coordinate your actions and strike the enemy as one! This shooting game is free-to-play. Learn more at https://wotblitz.com/ 2020 Wargaming.net", "platform": "Nintendo Switch", "release_date": "August 26, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Wargaming Group", "publishers": "Wargaming Group", "genres": "Action", "max_players": "14", "cooperative": "Yes", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156136-world-of-tanks-blitz\n"}