{"altername_name": [], "name": "Worms Rumble", "overview": "Worms Rumble is Worms like you’ve never played it before, with intense, real-time, arena-based 32 player cross-platform combat. Get ready for Deathmatch and Last Worm Standing modes where you’re only ever a Holy Hand Grenade away from death! Use a variety of fan-favourite weapons like the Bazooka, Shotgun and Sheep Launcher plus all-new additions to the armoury to bring the pain to your invertebrate opponents as you climb the ranks. Customise your worm, take part in challenges and seasonal events and experiment with new ways to play in The Lab. This is Worms, reinvented. The First Real Time Worms! You won’t find any turn-based combat in Worms Rumble. Every round is in REAL TIME! If your enemy is raining fire upon you, give them heck right back! 32 Player Cross Platform Multiplayer Play with friends online across console and PC. With Deathmatch and Last Worm Standing solo and squad battle royale modes available at launch! Classic Weapons with New Ways to Play Arm yourself with new and returning fan-favourite weapons! With classics like the Bazooka, Holy Hand-grenade and Sheep launcher and the all-new Hammerhead, Plasma Blaster and Rocket shield. Events, Challenges and ‘The Lab’ Take part in seasonal and community events, and daily challenges for additional XP and in-game rewards. And experiment with new gameplay mechanics and weapons in The Lab. Each week brings new experimental game modes with new fun ways to play! Player Customisations Earn XP and in-game currency to unlock and purchase weapon skins, outfits, accessories and emotes! Mix and match to create your own personal style on the battlefield.", "platform": "Nintendo Switch", "release_date": "June 23, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "Team17 Software", "publishers": "Team17 Software", "genres": "Action", "max_players": "32", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156137-worms-rumble\n"}