{"altername_name": [], "name": "WWE 2K BattleGrounds", "overview": "The world of WWE is your battleground with all-new, over the top, in-your-face arcade action as your favorite WWE Superstars and Legends battle it out in outlandish interactive environments around the world. Compete in your favorite match types with an arsenal of exaggerated maneuvers, special abilities, and devastating power-ups, including Steel Cage, Royal Rumble, Fatal Four Way and more, as Mauro Ranallo and Jerry “The King” Lawler call all the mayhem! Are you ready to enter the battleground? Brawl Without Limits! Take your favorite WWE Superstars and Legends into battle with unrestrained, unhinged, and in-your-face pandemonium! Pull off over-the-top moves and use your special abilities to destroy your opponent while battling in interactive environments! Battle It Out Across the Globe! Play through an all-new story mode told through original comic strips, alongside Paul Heyman and Stone Cold Steve Austin and help lead the charge to find the next WWE Superstars! Battle as unique and colorful new characters against established WWE Superstars to test your mettle and show your skills while unlocking new characters and Battlegrounds along the way. It’s Your Battleground! Make WWE 2K Battlegrounds your own with tons of customizable parts as you create, customize, and edit your own original created characters and Battlegrounds! Loads of Match Types! Wage war in a wide variety of your favorite match types with fun, new twists, including Steel Cage, Royal Rumble, Fatal Four Way and the all-new Battlegrounds Challenge! Local and Online Battles! Compete in Online Tournaments or stake your claim as King of the Battleground and survive the online melee against players from around the world! Plus, battle it out in local multiplayer and dominate your friends!", "platform": "Nintendo Switch", "release_date": "September 18, 2020", "game_type": "Released", "esrb": "T - Teen", "developers": "Saber Interactive", "publishers": "2K Games", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "3.69", "wikipedia": "https://en.wikipedia.org/wiki/WWE_2K_Battlegrounds", "video_link": "https://www.youtube.com/watch?v=7abZ9z3XNh0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/140267-wwe-2k-battlegrounds\n"}