{"altername_name": [], "name": "WWE 2K18", "overview": "The biggest video game franchise in WWE history is back with WWE 2K18! Featuring cover Superstar Seth Rollins, WWE 2K18 promises to bring you closer to the ring than ever before with hard-hitting action, stunning graphics, drama, excitement, new game modes, additional match types, deep creation capabilities, and everything you’ve come to love from WWE 2K. Be Like No One. Most Realistic WWE Video Game Ever! The most realistic WWE video game experience just became more intense with the addition of eight man matches, a new grapple carry system, new weight detection, thousands of new animations and a massive backstage area. A brand-new rendering engine also gives WWE 2K18 a visual overhaul and will bring the drama of WWE to life like never before! MyCAREER A new MyCAREER experience puts you on the path to greatness as you journey along on the road to WrestleMania. Explore WWE like never before through free-roaming, conversing with WWE Superstars, forming alliances, making enemies, seeking out quests, and strategizing for upcoming matches. Road to Glory Can your MyPlayer make it to the WWE Hall of Fame? Introducing the all-new Road to Glory! Compete with opponents online to improve your MyPlayer by earning unlockables, boosts and upgrades all while securing your entry into Special Events that are held alongside real-life WWE special events, such as pay-per-views. Dynamic Creation Suite Customize WWE like never before with an even deeper set of customization tools and the new Custom Match option! The robust Creation Suite also offers even more detailed features for Create-a-Superstar, Create-a-Video and Create-an-Arena. Seriously, THE BIGGEST ROSTER EVER! Dominate the ring with TONS of your favorite WWE, NXT and legendary Superstars! We’re not kidding, WWE 2K18 offers the most complete roster of the biggest and brightest WWE Superstars to ever grace a WWE ring!", "platform": "Nintendo Switch", "release_date": "December 6, 2017", "game_type": "Released", "esrb": "T - Teen", "developers": "Visual Concepts Entertainment", "publishers": "2K Sports", "genres": "Fighting", "max_players": "6", "cooperative": "Yes", "rating": "3.36", "wikipedia": "https://en.wikipedia.org/wiki/WWE_2K18", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/101548-wwe-2k18\n"}