{"altername_name": [], "name": "Yu-Gi-Oh! Master Duel", "overview": "Yu-Gi-Oh! Master Duel. Experience the next generation of Yu-Gi-Oh! – a digital trading card game! Finally, the \"Yu-Gi-Oh!\" digital card game you've been waiting for! The definitive edition of the competitive card game that has been evolving for over 20 years! Duel at the highest level against Duelists from all over the world. Get ready: it's time to Duel! ------------------------------------------------------------------------------ [About \"Yu-Gi-Oh! MASTER DUEL\"] Now you can play the \"Yu-Gi-Oh! TCG,\" digitally, anywhere. Fast-paced Duels with stunning HD graphics and a new, dynamic soundtrack! Get ready to challenge Duelists around the world! ◇ Play Duels at Any Level! The full Yu-Gi-Oh! experience is available for anyone at any Skill Level. Don't worry if you're a new player or if you haven't Dueled in a while, the in-game tutorials will teach you the basics on how to play the Yu-Gi-Oh! TRADING CARD GAME. You'll be given a Deck when you finish to help you start your journey! Collect new cards as you progress through the game to power up your Decks! ◇ Rotating Tournament Formats Mix it up and put your Dueling skills to the test! A wide variety of events and tournaments will be available for players. Build and Duel with different Decks utilizing 10,000+ unique cards and special rules unique to Tournaments! Choose the tournament YOU want to Duel in and aim for that number one spot! ◇ Uncover the Stories Behind the Cards The Solo Mode guides you through storylines of the themes from the Yu-Gi-Oh! TCG. Hone your Dueling skills by completing the stories. Recommended for beginners, returning players, and those of you who are interested in learning more about the lore of the world of the Yu-Gi-Oh! TCG. ◇ Features Link with the mobile app \"Yu-Gi-Oh! Neuron.\" View Decklists from Duelists worldwide and improve your own Deck! Try the sample draw feature to simulate what cards you could get in your first hand! [About \"Yu-Gi-Oh!\"] \"Yu-Gi-Oh!\" is a popular manga created by Kazuki Takahashi that was serialized in SHUEISHA Inc.'s \"WEEKLY SHONEN JUMP\" since 1996. Konami Digital Entertainment Co., Ltd. provides a Trading Card Game (TCG) and console games, based on \"Yu-Gi-Oh!\" created from the original manga, that has been enjoyed around the world. [Recommended for the following players] TCG players Yu-Gi-Oh! DUEL LINKS players Players who enjoy competitive gameplay ------------------------------------------------------------------------------ This game contains in-game purchases of virtual currencies used for gaining in-game items at random.", "platform": "Nintendo Switch", "release_date": "January 18, 2022", "game_type": "Released", "esrb": "", "developers": "", "publishers": "Konami", "genres": "Board Game", "max_players": "1", "cooperative": "No", "rating": "4.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/160203-yu-gi-oh-master-duel\n"}