{"altername_name": ["Yu-No: Kono Yo no Hate de Koi o Utau Shōjo"], "name": "Yu-No: A Girl Who Chants Love at the Bound of this World", "overview": "Yu-No: A Girl Who Chants Love at the Bound of this World is a Japanese-style adventure game, also known as a visual novel, originally released in 1996 for the NEC PC-98, and later ported to the Sega Saturn and Windows. In 2017 a remake was produced for the Playstation 4 and Playstation Vita, with completely redrawn HD graphics and rearranged music, while maintaining the same story and game structure. The 2019 Nintendo Switch port included these new features as well. Takuya Arima is a young student whose father, a famous historian and teacher, mysteriously disappears. Some time later he receives a parcel from his father containing a Reflector device and instructions on how to use it. The device would allow Takuya to travel to parallel worlds. At first he doesn't take it seriously, but soon realizes that the device works indeed, effectively allowing him to experiment different alternative realities and travel between them. Unique to the game, is the A.D.M.S. (Auto Diverge Mapping System), which is a visual representation of the several branches formed from decisions taken in the story, helping the player understand where he can explore new possibilities as well as go back, if something goes wrong. Similar systems would later be used in many other games of this genre. The original PC-98 game contained erotic content that have been heavily toned down in the PS4/Vita/Switch versions, which contains no nudity or explicit sex scenes. Similarly to what was edited in the Sega Saturn version. Although adult innuendo is still present, with several adult themes such as incest.", "platform": "Nintendo Switch", "release_date": "March 14, 2019", "game_type": "Released", "esrb": "M - Mature", "developers": "5pb.", "publishers": "Spike Chunsoft", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "https://en.wikipedia.org/wiki/YU-NO:_A_Girl_Who_Chants_Love_at_the_Bound_of_this_World", "video_link": "https://youtu.be/megbxFqGy80", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/135436-yu-no-a-girl-who-chants-love-at-the-bound-of-this-world\n"}