{"altername_name": ["Zero Fire - Toaplan Arcade Garage -", "Zero Fire - TOAPLAN ARCADE GARAGE -"], "name": "Zero Fire: Toaplan Arcade Garage", "overview": "The legends \"Zero Wing\" and \"Hellfire\" that scorch the universe, which are spun again, are completely reprinted! A complete reprint of the two major \"horizontal\" shooters from \"M2 Shot Triggers\", which has been well received by players for its high degree of portability and \"Toa Plan\", the leading arcade shooter. Pre-sonar beam that can capture enemies and items, \"Zero Wing (1989 work)\" featuring realistic graphics, 4 types of shots are the key to clearing, and \"Hell\" is attractive with a strategy like a puzzle game. Fire (1989 work)” is included. [Both first-timers and those who have been playing at arcades] In addition to the \"arcade mode\" that is a complete reprint of the arcade version, both titles are equipped with a \"SUPER EASY\" mode that has been adjusted so that even beginners can enjoy it! Even those who have never touched the original can play casually! In addition, both titles have different versions with different game systems, and overseas versions are also recorded by switching regions. [Understand all hidden items and hidden elements! ] The \"M2 gadgets\" displayed on the left and right of the game screen are full of functions that support strategy, such as displaying the current progress, alerts for enemies appearing from the player's blind spots, and detailed information on the appearance of hidden items! We will deliver new discoveries to those who played at the game center at that time! [Conquer difficult spots with repeated practice! ] The popular \"Arcade Challenge\" mode from the \"M2-Shot Triggers\" series is now available! Each stage is divided into small areas, so you can easily enjoy any scene. The rewind function enables efficient repetition practice! Once you've gained confidence, challenge Arcade Mode No Continue Clear!", "platform": "Nintendo Switch", "release_date": "July 20, 2023", "game_type": "Released", "esrb": "T - Teen", "developers": "M2 Co.", "publishers": "M2 Co.", "genres": "Shooter", "max_players": "2", "cooperative": "Yes", "rating": "3.5", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=IzAZP2tL_bo", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/371089-zero-fire-toaplan-arcade-garage\n"}