{"altername_name": [], "name": "Zombies Ate My Neighbors and Ghoul Patrol", "overview": "The cult classic Zombies Ate My Neighbors and its sequel make their long awaited return in Zombies Ate My Neighbors and Ghoul Patrol! Play these classics from the golden age of 16-bit gaming with new enhancements and never before seen museum features. Zombies Ate My Neighbors Hey, where's that scary music coming from? Yikes! It's Zombies Ate My Neighbors, where you appear in every demented horror flick ever to make you hurl ju-jubes. What are Zeke and Julie, our two wholesome teenage stars doing in a 16-bit game like this?! Trying to save the nice neighbors, cheerleaders and babies from a fate worse than polyester! Who could put this SLICE of suburbia in such goose-pimply hysteria? Zombies, relentless Chainsaw Maniacs, Mummies, Evil Dolls that just won't die, Lizard Men, Blobs, Vampires, Giant Ants, Martians and more. Will these crazy kids survive the night? Find your way through 55 horror-filled levels like a grocery store gone bad, a shopping mall awry, a mysterious island and your own back yard. Don't miss \"Weird Kids on the Block\", \"Mars Needs Cheerleaders\" and \"Dances With Werewolves\". You can fend off the freaks with a virtual candy counter of weapons like uzi squirt guns, exploding soda pop, bazookas, weed wackers and ancient artifacts. Also grab power ups-o-rama like secret potions and bobo clown decoys. Does this game ever end?! Ghoul Patrol Zeke and Julie, our intrepid teenagers, visit the Ghosts and Ghouls exhibit at the city library, where they find an old treasure chest containing an ancient spirit book. Naturally, they cannot resist reading it. Suddenly, a horrific snaggle-toothed spirit emerges. Now, this snarling phantom and his dastardly minions are infesting Metropolis and slithering their way into the history books, where they plan to rewrite history with their spooky ways. Only you have the power to go back in time to de-spook an encyclopedia of zombified historic dudes. Terminate, with prejudice, using crossbows, ping-pong ball machine guns, Martian \"Heatseeker\" guns, and more. Vaporize garbage can ghosts and ninja spirits, rescue bug-eyed librarians and wigged-out pirates, dodge flying books and adolescent-eating plants! Only our two heroes have the power to get the mighty beastly spirit back into his book and stop the madness. Ghoul Patrol to the rescue! NEW FEATURES • Save Feature: Quickly save your progress in either game and continue your adventure wherever and whenever you want • Museum Features: Watch a video interview with one of the original Zombies' developers or explore numerous galleries containing game art, previously unreleased concept images and marketing assets • 2 Player Mode: Play the game with two player local co-op • Achievements: Track your game progress with a set of achievements covering both games", "platform": "Nintendo Switch", "release_date": "June 29, 2021", "game_type": "Released", "esrb": "E10+ - Everyone 10+", "developers": "", "publishers": "Disney Interactive", "genres": "Horror", "max_players": "2", "cooperative": "Yes", "rating": "4.4", "wikipedia": "https://en.wikipedia.org/wiki/Zombies_Ate_My_Neighbors", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/153576-zombies-ate-my-neighbors-and-ghoul-patrol\n"}