{"altername_name": [], "name": "Crossed Swords II", "overview": "Crossed Swords II is a hack and slash action role-playing video game developed and published by ADK exclusively for the Neo Geo CD in Japan on May 2, 1995. The sequel to the original Crossed Swords, It is one of the few exclusive titles to be released for the console, as it was never officially released for either Neo Geo MVS (arcade) and Neo Geo AES (home) platforms. Taking place several decades after the events of the original game, the story follows a crew of three adventurers on a journey across the kingdom of Belkana to slay the returning demon warlord Nausizz, whose castle rises from hell once again and his servants are threatening to conquer the land by bringing chaos and destruction with his reign. Crossed Swords II is a hack and slash action role-playing game that is primarily played in a third-person perspective like its predecessor where players take control from either of the three warriors, each with their own unique advantages and disadvantages, on a quest to slay the returning demon warlord Nausizz who returns from the underworld after his previous defeat in order to conquer the kingdom of Belkana with his army of monstrous creatures across twelve acts in total. The sequel expands upon the original gameplay further by adding new elements and mechanics such as experience points to increase the experience level of their respective player character, a new button dedicated for jumping and dashing, giving the players extra abilities and the ability to dodge incoming enemy attacks, among other abilities to master. After completing each act, players can buy recovery items and new magic attacks, as well as increasing their experience level, via a shopkeeper with the gold collected. If the players are killed in action, a limited number of continues to keep playing are present for use before the game is over. In addition to the regular campaign, there is a survival mode where an endless array of monsters with different levels of strengths must be fought against until the players are defeated.", "platform": "SNK Neo Geo CD", "release_date": "May 2, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "ADK", "publishers": "SNK", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "3.29", "wikipedia": "https://en.wikipedia.org/wiki/Crossed_Swords_II", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/86809-crossed-swords-ii\n"}