{"altername_name": [], "name": "Crossed Swords", "overview": "Crossed Swords is a hack & slash action RPG arcade game developed by Alpha Denshi and published by SNK. It was released for the Neo Geo arcade system in July 1991 and later on Neo Geo console in October of the same year. Its gameplay was similar to SNK's earlier 1990 first-person shooter and beat 'em up game, The Super Spy, but with role-playing game elements and hack & slash combat instead of shooting and fist-fighting. The game allowed cooperative gameplay with up to two players on the same screen. As only the player characters' silhouettes are visible on screen as wire-frame models, much like Punch-Out!!, the game's perspective may be considered either first-person or third-person. The game was later cited as an inspiration for the 2010 first-person fighting game Rage of the Gladiator. A sequel of the game entitled Crossed Swords II was released in Japan on May 2, 1995 for the Neo-Geo CD, and was one of the few games designed specifically for the Neo-Geo CD, rather than being an arcade port. Crossed Swords requires correct timing and movement to progress. The basic rule for the game is to defend first before striking. The player wields both a weapon and shield and can strafe, as well as guard the upper or middle part of the body. Two different weapon strikes are available, a regular attack and a thrusting attack. Weapon-based magic can also be used. Multiple paths through the game are available and the player has an option to skip the first and second chapters freely.", "platform": "SNK Neo Geo CD", "release_date": "October 31, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "Alpha Denshi", "publishers": "Alpha Denshi", "genres": "Action", "max_players": "2", "cooperative": "Yes", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Crossed_Swords_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/85928-crossed-swords\n"}