{"altername_name": [], "name": "Metal Slug", "overview": "The awesome combat-shooting game is now out on CD-ROM in a super powered-up version! Along with the Arcade Mission (Arcade version), compete for the best clear time and longest achieved distance in the newly added Combat School Mode. The NEO GEO CD version of Metal Slug. It will blow you away! Charge! Metal Slug is a 1996 run and gun arcade video game originally developed by Nazca Corporation and released by SNK for the Neo Geo MVS. It is the first installment in the eponymous series. Set in 2028, players assume the role of Peregrine Falcon Strike Force soldiers Marco Rossi and Tarma Roving on a fight against the Rebel Army led by Donald Morden and overthrow his coup d'état to prevent a New World Order. Metal Slug was conceived by the same staff who created several titles at Irem that shared similar presentation such as In the Hunt and GunForce II, with the core concept during development being a simple but exciting side-scrolling shooter featuring a very easy control scheme and visuals inspired by the works of Hayao Miyazaki. Gameplay was originally more slower-paced, revolving around players controlling the titular tank instead of soldiers across shorter and less complex missions with a darker atmosphere, before the project was heavily overhauled after poor response during location test and the length was extended at the request of SNK to make the game attractive to home players while incorporating more platform elements into its design. Metal Slug garnered positive reception upon its initial launch from players and critics, being lauded for its sense of humor, fluid hand-drawn animation and fast-paced two-player action. The game was subsequently ported to other platforms by other third-party developers, featuring various changes and additions compared to the MVS original, in addition to being included on compilations and re-released through download services for other systems, among other ways to play it. Its success led to a franchise spawning multiple sequels, remakes and spin-offs. A direct continuation, Metal Slug 2, was released in 1998.", "platform": "SNK Neo Geo CD", "release_date": "July 5, 1996", "game_type": "Released", "esrb": "Not Rated", "developers": "Nazca", "publishers": "SNK", "genres": "Platform", "max_players": "2", "cooperative": "Yes", "rating": "4.10", "wikipedia": "https://en.wikipedia.org/wiki/Metal_Slug", "video_link": "https://www.youtube.com/watch?v=8ju8hdZpb-A", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75690-metal-slug\n"}