{"altername_name": [], "name": "Ninja Commando", "overview": "Ninja Commando is a vertical scrolling run-and-gun shooter video game developed by Alpha Denshi and published by SNK. It was first released for the Neo Geo in 1992 in cartridge format for arcades and homes, and was then released in 1994 for the Neo Geo CD. Gameplay: The overall gameplay is similar to this of the run-and-gun classic Ikari Warriors, with the players battling their way up the top-down perspective screen. The players can choose between three ninja characters, all with differing abilities. Each of them has fighting game-style input commands that unleash their scroll-based ninpo special moves. As usual in the genre, the game's stages end with boss battles. Plot: An elite group of three young Ninja Commandos (Joe Tiger, an American descendant of the Kōga-ryū ninja whose weapons are shuriken, Ryu Eagle, the 23rd descendant of the famous ninja Fūma Kotarō (from the World Heroes series), who is using ninja magic fireballs in combat, and Rayar Dragon, the female ninja of the group, a British girl who has learned the ways of the Iga-ryū ninjutsu and whose weapon is a bow with flaming spirit arrows) from around the world must team-up to stop the villain Spider and his Mars Corporation from using a time machine to destroy the past and control the future. The three heroes chase after their enemy in seven time periods, including the Sengoku period in Japan (where Ryu avenges his ancestor by killing Oda Nobunaga), Ancient Egypt (fighting a floating recreation of Tutankhamen), the Stone Age, China in the era of Three Kingdoms (fighting against Lu Bu), and World War II. Release: Ninja Commando was originally released for the Neo Geo arcade machines on May 29, 1992. The Neo Geo CD was released on October 31, 1994. The game has been re-released on the Wii's Virtual Console in North America on July 14, 2008 (though the Wii Virtual Console version, like most other Neo Geo games, only allows three continues per player, which makes the game very difficult to complete without saving progress). It was also re-released in December 2008 as one of five games in the PlayStation 2 game compilation ADK Damashii. The highest score is by Ian Albrecht with 177,150 points.", "platform": "SNK Neo Geo CD", "release_date": "December 29, 1992", "game_type": "Released", "esrb": "", "developers": "Alpha Denshi", "publishers": "SNK", "genres": "Shooter", "max_players": "", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Ninja_Commando", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/87353-ninja-commando\n"}