{"altername_name": ["Puzzle Bobble: Bust-a-Move", "Bust-A-Move"], "name": "Puzzle Bobble", "overview": "At the start of each round, the rectangular playing arena contains a prearranged pattern of colored \"bubbles\". (These are actually referred to in the translation as \"balls\"; however, they were clearly intended to be bubbles, since they pop, and are taken from Bubble Bobble.) At the bottom of the screen, the player controls a device called a \"pointer\", which aims and fires bubbles up the screen. The color of bubbles fired is randomly generated and chosen from the colors of bubbles still left on the screen. The fired bubbles travel in straight lines (possibly bouncing off the side walls of the arena), stopping when they touch other bubbles or reach the top of the arena. If a bubble touches identically-colored bubbles, forming a group of three or more, those bubbles—as well as any bubbles hanging from them—are removed from the field of play, and points are awarded. After every few shots, the \"ceiling\" of the playing arena drops downwards slightly, along with all the bubbles stuck to it. The number of shots between each drop of the ceiling is influenced by the number of bubble colors remaining. The closer the bubbles get to the bottom of the screen, the faster the music plays and if they cross the line at the bottom then the game is over. The objective of the game is to clear all the bubbles from the arena without any bubble crossing the bottom line. Bubbles will fire automatically if the player remains idle. After clearing the arena, the next round begins with a new pattern of bubbles to clear. The game consists of 32 levels.", "platform": "SNK Neo Geo CD", "release_date": "April 27, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Taito", "publishers": "SNK", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3.83", "wikipedia": "https://wikipedia.org/wiki/Puzzle_Bobble", "video_link": "https://www.youtube.com/watch?v=jXJJ5yBeCHI", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/95982-puzzle-bobble\n"}