{"altername_name": ["Sengoku Denshou 2"], "name": "Sengoku 2", "overview": "Sengoku 2 is a beat 'em up arcade game. It is the second game of the Sengoku series by SNK. It was ported to the Neo Geo and Neo Geo CD consoles. In 2009 the series was compiled on a CD titled Sengoku Anthology for the PlayStation 2 and Windows. The Neo Geo version was re-released on the Japanese Virtual Console in November 8, 2012 and for the PAL region on February 7, 2013. In 2017, the game was re-released as part of the ACA Neo Geo series for the Xbox One, followed by the PlayStation 4, and also on the Nintendo Switch and Windows 10 via Steam the following year. Gameplay: The gameplay is similar to Sengoku, except that the playable character is constantly armed with a sword for they which can initiate wide plane attacks and vertical slashes. Pressing both attack buttons together allows the character to block or dodge attacks. Another button combo gets the character to perform a special trick attack. The character can also jump and do jump attacks. Occasionally the character would be mounted on horseback and have to carefully hack and slash enemies during a canter. The player can transform the character into three different forms including, the armour-clad wolf, the shuriken-throwing ninja and the staff-wielding Tengu warrior for a limited time. Various collectible orbs heal the character's health or enhance the character's attack abilities and that of the different forms' capabilities. Plot: An evil warlord is intent on conquering the world, this time by the use of time travel to conquer every known important event in history. The two protagonists from the previous game are sent by a priestess from the past to battle the warlord's forces to restore the world's ages and ensure the warlord's conquest never succeeds.", "platform": "SNK Neo Geo CD", "release_date": "February 18, 1993", "game_type": "Released", "esrb": "", "developers": "SNK", "publishers": "SNK", "genres": "Fighting", "max_players": "", "cooperative": "No", "rating": "3.79", "wikipedia": "https://en.wikipedia.org/wiki/Sengoku_2", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/87361-sengoku-2\n"}