{"altername_name": ["Sengoku Denshou"], "name": "Sengoku", "overview": "Sengoku is a beat 'em up arcade game. It is the first game of the Sengoku trilogy by SNK. It was ported to numerous home consoles including the Neo Geo, Neo Geo CD, Mega-CD and Super Famicom while the latter version was later canceled in North America. The arcade version was part of SNK Arcade Classics Vol. 1 in 2008. The Neo Geo version was re-released on the Japanese Virtual Console in 2011, with the sequels for the North American Virtual Console on November 8, 2012 (Sengoku 2) and June 6, 2013 (Sengoku 3) and for the PAL region on February 7, 2013 (Sengoku 2) and September 5, 2013 (Sengoku 3). In 2009 the trilogy was combined together on a CD titled Sengoku Anthology for PlayStation 2 and Windows. Gameplay: A player has a maximum of six health points. When certain enemies are defeated, spirits of powerful forms are available to transform into. In the SNES version transformation cannot be toggled, but stays constant for a limited time. The three different forms are a samurai, an armour-clad wolf and a more agile ninja. These forms have a limited use. Their attacks and jumps differ from the original form and their powers are enhanced by any power-ups collected. Throughout the game the player would need to survive the hordes of enemies by collecting coloured orbs as power-ups. Five Green orbs heal one health point. A Red orb gives the player a single sword, a Cyan orb gives the player a double sword, the Purple orb gives the player a two-handed holy sword and a Yellow orb gives the player a limited magical attack. Plot: Centuries ago a cruel and insanely tyrannical warlord was defeated by the two elite Samurai but had sworn to return in the future. When he does he unleashes undead forces of feudal Japanese warriors to destroy the world and its people. The warlord is opposed only by the two protagonists, a ninja and a Western cowboy (named Ninja Dave and Cowboy Kev in the Neo-Geo version and named Dan and Bill in the SNES version), who turn out to be descendants of the two elite Samurai responsible for vanquishing the wicked warlord centuries ago.", "platform": "SNK Neo Geo CD", "release_date": "February 12, 1991", "game_type": "Released", "esrb": "", "developers": "SNK", "publishers": "SNK", "genres": "Beat 'em Up", "max_players": "", "cooperative": "No", "rating": "3.29", "wikipedia": "https://en.wikipedia.org/wiki/Sengoku_(1991_video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/93434-sengoku\n"}