{"altername_name": ["Shinsetsu Samurai Spirits: Bushidouretsuden", "Shinsetsu Samurai Spirits: Bushido Retsuden", "Shinsetsu Samurai Spirits: Bushidohretsuden", "Samurai Shodown R.P.G."], "name": "Shinsetsu Samurai Spirits: Bushido Retsuden", "overview": "Shinsetsu Samurai Spirits Bushidō Retsuden is a role-playing video game for SNK's Neo Geo CD system, which retells the events of Samurai Shodown and Samurai Shodown II in greater detail. It was ported to the Sega Saturn and PlayStation. Gameplay: A battle scene with Haohmaru facing two enemies. In this given moment, the player must choose a command for Haohmaru to perform. The basic setup of the game is very similar to most console RPGs, such as Final Fantasy. The characters roam an overworld, enter towns and dungeons, and get into battles, which occur on a separate screen. The menu options enable equipping of armor and accessories, as well as use of items. At the outset, the player is given the option to choose from six characters to be the \"main\" character of the story. The basic outline of the plot does not diverge greatly for any of them, but each had different dialogue ingame, and each also had unique special scenes which would go into greater detail of the character. In addition, to better adjust to character continuity, certain stories were modified slightly based on the selected chapter. Over the course of the game, two other characters can also join the party (unless the hero is Genjuro, who only gains a partner in his second story). In addition, the second chapter also introduces a new character, Shippuu no Reon (疾風の鈴音), whose name translates roughly to \"The Ringing of the Gale Winds.\" All characters from the first two Samurai Shodown games make an appearance, either as a temporary helper, plot device, or enemy. Combat includes an option to input the joystick motions for the various special moves manually, as in the arcade games, rather than simply selecting the moves from a list. While armor and accessories can be bought and equipped, each character has the same weapon throughout the game. Characters can visit blacksmiths to temper and strengthen their weapons. These smiths can also infuse the weapons with one of the game's various elements, which make the weapon's normal strikes and select special moves more effective against certain enemies.", "platform": "SNK Neo Geo CD", "release_date": "June 27, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "ADK", "publishers": "SNK", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "4.46", "wikipedia": "https://en.wikipedia.org/wiki/Shinsetsu_Samurai_Spirits_Bushidō_Retsuden", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23486-shinsetsu-samurai-spirits-bushido-retsuden\n"}