{"altername_name": ["Tokuten Oh", "Super Sidekicks: Tokuten-ou"], "name": "Super Sidekicks", "overview": "Super Sidekicks is a 1992 soccer arcade video game developed and published by SNK. It is the first installment in the eponymous series and the second soccer game released for Neo Geo MVS, succeeding Soccer Brawl (1991). Featuring an arcade-style approach to soccer compared to other games released at the time, the title allows players to choose any of the available game modes with AI-controlled opponents or other human players with the team of their choosing. Its gameplay uses a simplified two-button configuration. Headed by Eikichi Kawasaki, Super Sidekicks was developed by most of the same team that worked on several projects for the Neo Geo platforms at SNK. Though first launched for the MVS hardware, the game was later released for both Neo Geo AES and Neo Geo CD, in addition of being re-released through download services for various consoles. The title proved popular among players and garnered positive reception from critics; praise was directed towards the graphic presentation and fast gameplay but criticism was geared towards several aspects. It was followed by various sequels and a remake. Gameplay: Super Sidekicks is a soccer game that is played from a top-down perspective in a two-dimensional environment with sprites. Although it follows the same gameplay as with other soccer titles at the time and most of the rules are present as well, the game opts for a more arcade-styled approach of the sport instead of being full simulation, using a simplified control scheme. The tile features 12 teams divided into two groups which compete for the \"SNK Cup\": Group A (Germany, Italy, Spain, England, Mexico, Japan) and Group B (Argentina, Holland, Brazil, France, United States, South Korea). The players' team plays against all the others in their group, then it goes into an elimination tournament's semifinals and then the final to win the cup. There is an hidden mechanic in the game that affects single-player matches; During a free kick for the AI opponent, if the player has tapped button A for player two, the AI performs a short-shot while pressing the button A performs a longer kick. One noted mistake was that Spain's kit resembles Portugal's, which would not be featured until future entries. Another mistake is Mexico's uniform color, which was corrected in the sequels.", "platform": "SNK Neo Geo CD", "release_date": "1994", "game_type": "Released", "esrb": "Not Rated", "developers": "SNK", "publishers": "SNK", "genres": "Sports", "max_players": "2", "cooperative": "No", "rating": "4.04", "wikipedia": "https://en.wikipedia.org/wiki/Super_Sidekicks", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/86844-super-sidekicks\n"}