{"altername_name": [], "name": "The King of Fighters '97", "overview": "Despite the events at the end of the previous game, the KOF tournament was a huge commercial success and sparked a worldwide fighting craze. Within a few months of the tournament ending, various large corporations had held smaller KOF tournament qualifiers and constructed special KOF stadiums around the world, building the excitement up for the next tournament. News of the tournament spread through every form of media and fans and new fighters from across the globe come to watch the preliminary matches. All of the characters from the previous game return, with the exception of the Boss Team (which was disbanded after its first appearance), Kasumi Todoh (who went off to search for her father), and Mature and Vice (who were killed by Iori Yagami after he was possessed by the Riot of Blood at the conclusion of the previous game). Chizuru Kagura, the sub-boss in the previous game, takes Kasumi's place in the Women Fighters Team, while Geese Howard's underling Billy Kane, who previously participated in The King of Fighters '95 tournament, returns to join forces with female agent Blue Mary and wanted felon Ryuji Yamazaki (both from Fatal Fury 3) to form the unlikely \"'97 Special Team\". Iori returns as a Team Edit character along with Shingo Yabuki, a high school student who patterns his fighting style after his idol and reluctant mentor Kyo Kusanagi. An alternative version of Kyo with his pre-KOF '96 moveset also appears as a hidden character. Iori and Leona will fight as mid-boss characters in the Riot of the Blood curse depending of which characters the player is using. A team of all new characters also appears in the form of the \"New Faces Team\", consisting of bandmates Yashiro Nanakase, Shermie, and Chris. The New Face Team will be revealed to be the last three servants from Orochi during the Arcade Mode. Additionally, they fight as sub-boss characters having enhanced abilities than their common forms. Once they are beaten, Orochi will possess Chris's body to fight as the final boss character.", "platform": "SNK Neo Geo CD", "release_date": "October 30, 1997", "game_type": "Released", "esrb": "Not Rated", "developers": "SNK", "publishers": "SNK", "genres": "Fighting", "max_players": "2", "cooperative": "No", "rating": "3.70", "wikipedia": "https://en.wikipedia.org/wiki/The_King_of_Fighters_%2797", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/75756-the-king-of-fighters-97\n"}