{
  "name": "Body Slam: Super Pro Wrestling",
  "shortName": "body-slam-super-pro-wrestling",
  "description": "The object of <i>Body Slam: Super Pro Wrestling</i> is to defeat your opponent in the ring. You must use strength, strategy, and a hint of sneakiness. Each match consists of a series of four-minute rounds. There is an unlimited number of rounds, so the match continues until a player wins or until a draw is declared. The first wrestler to pin his opponent to the mat for a time of 3 seconds is the winner.<br><br>You control a wrestler selected from 12 different characters. Your opponent is controlled by another player or by the computer. If you choose a Tag-Team Match you and your opponent each control 2 wrestlers who take turns in the ring.<br><br>There are 26 possible moves - drops, kicks, punches, etc. Before each match, you choose 4 to 9 moves (depending upon your selected skill level) that you will use in that match. How many moves you can make during the match is determined by your selected skill level: the lower the skill level, the fewer the moves. Players may select different skill levels to handicap the match. The 12 wrestlers you have to choose from, have their relative strengths and weaknesses depending from their height, weight, strength, coordination, and ego.",
  "publishedBy": "INTV Corp.",
  "developedBy": "Realtime Associates, Inc.",
  "released": "Dec, 1988",
  "alsoFor": "Windows, Xbox 360 | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Wrestling",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/intellivision/body-slam-super-pro-wrestling",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Intellivision",
      "releases": [
        {
          "publisher": "INTV Corp.",
          "developer": "Realtime Associates, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Dec, 1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}