{
  "name": "Lady Bug",
  "shortName": "lady-bug",
  "description": "An action game in the same style as <a href=\"https://www.mobygames.com/search/quick?game=Pac-Man\">Pac-Man</a> but very very different. Players control a ladybug who must venture around different mazes collecting all of the food pellet &quot;x&quot;'s. In addition to there being regular lines of wall in the maze, there are also several rotating doors that can be used to trap enemies and escape. In fact these rotating doors are the key to survival in this game.  In the center of each maze is a different enemy insect hive that will spawn out enemy creatures. An new enemy creature is spawned every time the border around the screen makes a complete &quot;lap&quot;. Timers for the border vary upon the level, so later levels will generate new enemies faster, thus progression through the game brings smarter, faster and more quickly spawning enemies.<br><br>In addition to the collection of X's, each maze also contains a variety of powerups that come in three types: Poison, Letters and Hearts. Poison is deadly both to the player and the enemy. If the player is able to lure and enemy creature into a poison powerup, it will die and be removed from gameplay. Letters and hearts are powerups with multiple conditions: Collected at the right time they will add letters that will eventually spell words providing bonuses. However collected during the the improper time will only earn the player a few points. For most of the gameplay the colour of all powerups (except skulls which are unaffected) will be blue. But every few seconds it will cycle through yellow and then red colours. Grabbing a letter when flashing the colour will add it to that colour's word. The red word is &quot;SPECIAL&quot; and the yellow word is &quot;EXTRA&quot;. Spelling the word, EXTRA gains the player an extra life, and spelling the word, SPECIAL brings the player to a special bonus round.<br><br>Hearts are best used as blue powerups as they will act as multipliers for the X's being picked up, first as 2x, then as 3x and finally as 5x. Multipliers are lost when the player dies, but letter powerups are not.",
  "publishedBy": "Coleco Industries, Inc.",
  "developedBy": "Universal Co., Ltd.",
  "released": "Jun, 1983",
  "alsoFor": "Arcade, ColecoVision | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/intellivision/lady-bug",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Intellivision",
      "releases": [
        {
          "publisher": "Coleco Industries, Inc.",
          "developer": "Universal Co., Ltd.",
          "ported": "Coleco Industries, Inc.",
          "country": " United States",
          "releaseDate": "Jun, 1983",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/48843-lady-bug-intellivision-screenshot-title-screen.gif",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/48844-lady-bug-intellivision-screenshot-getting-ready-for-the-next.gif",
      "caption": "Getting ready for the next round..."
    },
    {
      "link": "/images/shots/l/48845-lady-bug-intellivision-screenshot-a-game-in-progress.gif",
      "caption": "A game in progress"
    },
    {
      "link": "/images/shots/l/48846-lady-bug-intellivision-screenshot-munching-on-x-s.gif",
      "caption": "Munching on X's..."
    },
    {
      "link": "/images/shots/l/48847-lady-bug-intellivision-screenshot-hiding-from-the-wandering.gif",
      "caption": "Hiding from the wandering enemies..."
    },
    {
      "link": "/images/shots/l/48848-lady-bug-intellivision-screenshot-game-over.gif",
      "caption": "Game over"
    }
  ],
  "cover": []
}