{
  "name": "All-Star Baseball 2004",
  "shortName": "all-star-baseball-2004_",
  "description": "This GBA release is different from the main console version <a href=\"https://www.mobygames.com/search/quick?game=All-Star+Baseball+2004\">All-Star Baseball 2004</a> for some game elements. This portable version offers both single-player and multiplayer modes with a full license for all 30 MLB teams, stadiums and more than 800 players. Game modes include Exhibition, Season, All-star game, Home run derby, Playoffs and World series. There is no Franchise mode. Multiplayer against a second player is supported through a link cable. Through the battery back-up, progress in the season, a collection of 250 trading cards that can be earned, player trades and roster changes are stored.<br><br>During the batting phase the swing is aimed using a large triangle indicator. The direction of the hit is then determined by rotating and tilting the triangle. A similar mechanic is used for pitching during defense. During field a base is chosen using the directional pad and optionally the CPU can take over to do this automatically. The AI behavior of computer-controlled players is quite different compared to the main console version. At any moment it is possible to make substitions or adjust the position of the field players.<br><br>A new feature compared to the 2003 version is the ability for CPU pitchers to throw outside the strike zone. The increase in the base runners' speed now also allows them to do doubles or triples. There are more animations for the players, for instance the pitcher follow-throughs and the batter walk-ups. There is more visual details as well, such as a scoreboard celebrations and typical stadium details such as waving flags. Audio-wise, play-by-play commentary is a new feature for this year's version.",
  "publishedBy": "Acclaim Entertainment, Inc.",
  "developedBy": "Acclaim Studios Manchester",
  "released": "2003",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "3rd-person (Other), Behind view, Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Baseball",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/all-star-baseball-2004_",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Acclaim Entertainment, Inc.",
          "developer": "Acclaim Studios Manchester",
          "ported": "",
          "country": " United States",
          "releaseDate": "2003",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}