{
  "name": "Barbie: Groovy Games",
  "shortName": "barbie-groovy-games",
  "description": "Barbie and her friends head out to the city to visit a couple hotspots. These hotspots turn out actually contain some mini-games that Barbie and her friends can partake in. One or two players can choose to play as Ken, Barbie, Christie, Teresa, or (in the GBA version only) Lea, Kayla, and Becky.<br><br>Each of the following mini-games has three difficulty levels (easy, medium, and hard).  \n<ul><li>There's an ice cream parlor with mini-game Four Scoops. Players try to create ice cream sodas by playing a <a href=\"https://www.mobygames.com/search/quick?gamegroup=Connect+Four+variant\">Connect Four variant</a>.<br><br><li>The music store contains the mini-game D.J. Booth, where players match compact discs back into their cases in this <a href=\"https://www.mobygames.com/search/quick?gamegroup=Concentration+variant\">Concentration variant</a>. The GBA features a 3x3, the PlayStation a 4x4 grid.<br><br><li>The jewelry store has the mini-game Gems and Jewels, where players are tasked with being the first to line up four gems that have either the same shape, color, size, or whether they're solid or hollow on a 4x4 grid. Players take turns, with one player choosing a gem for the other player to use and vice versa when it's the other players turn.<br><br><li>At the arcade, the mini-game Daisy Derby lets the player race a horse versus another horse. The mini game is basically a <a href=\"https://www.mobygames.com/search/quick?gamegroup=Hangman\">Hangman game</a> where players have to guess the letters in a word. Correct guesses move the player's horse forward while incorrect guesses move the player's opponent's horse forward.<br><br><li>The beauty salon contains the mini-game Bubble Machine, which is <a href=\"https://www.mobygames.com/search/quick?gamegroup=Bust-A-Move\">Bust-A-Move variant</a> where players shoot colored bubbles at other colored bubbles hoping to match three of the same color to make them disappear.<br><br><li>The dance studio contains the mini-game Conga Line, where players try to form the longest conga line in this <a href=\"https://www.mobygames.com/search/quick?gamegroup=Snake\">Snake game</a>.<br><br><li>The disco has the mini-game Groove &amp; Move where players make Skipper dance by pressing the directions the computer highlights. Players must be quick to press the correct directions to do the correct dance moves.<br><br><li>The park (GBA only) contains Tic-Tac-Toe played on a picnic blanket, which is the classic game of creating a line of three symbols on a 3x3 grid.<br><br><li>The beach (GBA only) contains Checkers, the classic board game, played in the American variant on an 8x8 board.<br><br><li>The farmers market (PlayStation only) contains Fruit Fallout, where fruit falls into baskets forming columns. Players have to connect 3 like fruits to make them disappear before the baskets overflow.<br><br></ul>\nThe Info Booth (PlayStation only) contains the high scores and instructions on how to play all of the mini-games. On the GBA, the instructions can be looked at before each of the mini-games and high scores are not saved. The PlayStation version also includes voice acting for all characters.",
  "publishedBy": "Vivendi Universal Games, Inc.",
  "developedBy": "Digital Illusions Canada, Inc.",
  "released": "Sep, 2002",
  "alsoFor": "PlayStation | Combined View",
  "genre": "Action, Puzzle, Strategy / tactics",
  "perspective": "1st-person, Side view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/barbie-groovy-games",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Board game, Cards / tiles, Falling block puzzle, Mini-games, Music / rhythm, Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Vivendi Universal Games, Inc.",
          "developer": "Digital Illusions Canada, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep, 2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/804457-barbie-groovy-games-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}