{
  "name": "Barbie as the Island Princess",
  "shortName": "barbie-as-the-island-princess__",
  "description": "<i>Barbie as the Island Princess</i> is a mini-game collection based on the 2007 animated movie of the same name. It is different from the <a href=\"https://www.mobygames.com/search/quick?quickSearch=047875754010\">Nintendo DS</a> and <a href=\"https://www.mobygames.com/search/quick?quickSearch=047875754034\">PC and console versions</a>. The game is set on a tropical island where Barbie, as the shipwrecked princess Rosella, is raised by her new family of animal friends and eventually rescued off the island by Prince Antonio. By progressing through the mini-games the princess moves from her island home to the prince's coastal castle. Next to the mini-games different outfits can be tried in the dressing room section of the game.<br><br>The mini-games include catching coconuts launched by an elephant, fishing with a net, rotating objects to match a shape, grabbing and stacking fruit before it falls down, bouncing a ball in the air, a &quot;Simon Says&quot; variant, a timed input game involving dancing, collecting flowers, connecting stars as a memory game, collecting birds, playing a song by selecting the right notes, getting rid of bugs in the garden and so on. Many games have a time limit and the game keeps track of the score. By doing well points can be scored to unlock accessories for the dressing room.",
  "publishedBy": "Activision Publishing, Inc.",
  "developedBy": "Human Soft Inc.",
  "released": "2007",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/barbie-as-the-island-princess__",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Mini-games",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "Human Soft Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}