{
  "name": "Battle B-Daman",
  "shortName": "battle-b-daman",
  "description": "<i>Battle B-Daman</i> is a game based on the B-Daman marble shooting toy produced in Japan by <a href=\"https://www.mobygames.com/search/quick?company=Takara\">Takara</a>, and more specifically the <i>Battle B-Daman</i> manga adaptation by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,1112508/\">Eiji Inuki</a>. The game follows Yamato Delgado who dreams of playing B-Daman, the traditional sports game of the B-Daworld. The goal is to battle various B-DaPlayers to compete in the Winner's Tournament. To get there he needs to find all parts of a Cobalt Blade.<br><br>The game is mainly about one-to-one battles between two robots interspersed with some story elements. By winning matches new parts become available offering customization options. The battles are played from a first-person perspective where the robot can only be moved left or right, firing coloured plastic balls to damage the opponent and avoiding the incoming attacks. There are two ways to battle: Direct Hit Battle or B-Daman Invasion. A button is used to shoot while a B-DaSpirit gauge fills up gradually. When the D-Pad shape starts blinking along with red triangles and different directions, the B button can be pressed along with the direction of the red triangle to launch a Special Attack. These Special Attacks vary throughout the game based on the B-Daman customization and equipment.",
  "publishedBy": "Atlus U.S.A., Inc.",
  "developedBy": "Zero One Corporation",
  "released": "Jul 26, 2006",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/battle-b-daman",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Atlus U.S.A., Inc.",
          "developer": "Zero One Corporation",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jul 26, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}