{
  "name": "Disney•Pixar Cars",
  "shortName": "disneypixar-cars__",
  "description": "<i>Disney•Pixar Cars</i> is a racing game based on the animated movie of the same name. The player takes the role of Lightning McQueen in his quest to win the Piston Cup. <br><br>There are two types of events: eleven regular races and four Piston Cup races. The regular races (involving racing either against the clock or against competition) take place on courses with curves, obstacles (e.g. road blocks and slow cars in the way) and pads which either increase or decrease Lightning's speed when driving over them. The Piston Cup courses are oval, without obstacles, and Lightning can build up a nitro boost by closely driving behind opposing cars. Winning a race unlocks the next event, still images from the movie and additional cars. However, each event has to be won with Lightning before another car can be used.<br><br>The camera moves with the course (for example the perspective is close to top-down when driving north and isometric when driving north-west) and is relatively close to the car. In order to know where to steer, the game shows a direction arrow before turns; optionally the player can also activate a reduced map with the course direction of the next few meters. Two buttons are used to speed up or brake.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Helixe",
  "released": "Jun 06, 2006",
  "alsoFor": "",
  "genre": "Racing / driving",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/disneypixar-cars__",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Helixe",
          "ported": "",
          "country": " United States",
          "releaseDate": "Jun 06, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}