{
  "name": "DOOM",
  "shortName": "doom",
  "description": "The Union Aerospace Corporation has been experimenting with teleportation technology on Mars' moons Phobos and Deimos. After early successes, something goes wrong. It seems the scientists have opened a gateway straight to Hell. Phobos base is overrun with demonic creatures, and the whole of Deimos simply vanishes. A squad of marines is sent to Phobos, but all except one are quickly slaughtered. It falls to the surviving marine to grab some guns and strike back at the demons.<br><br>id Software's follow-up to their genre-defining <a href=\"https://www.mobygames.com/search/quick?game=Wolfenstein+3D\">Wolfenstein 3D</a>, <i>DOOM</i> is another first-person 3D shooter: full-on action seen from the space marine's perspective. Like Wolfenstein, the game consists of distinct episodes, playable in any order. The first episode, <i>Knee-Deep in the Dead</i>, takes place in the Phobos base and is freely available as shareware. The full game continues on Deimos in <i>The Shores of Hell</i> and culminates in <i>Inferno</i>, the final episode which takes place in Hell itself (the Sega 32x version lacks this episode).<br><br>The basic objective in each level is simply to reach the exit. Since dozens of enemies stand in the way, the only way to get there is through killing them. Switches and buttons must be pressed to advance at certain points and often color-coded locked doors will block the way - matching keycards or skull keys must be found to pass.<br><br>The game's engine technology is more advanced than Wolfenstein's, and thus the levels are more varied and complex. The engine simulates different heights (stairs and lifts appear frequently) and different lighting conditions (some rooms are pitch black, others only barely illuminated). There are outdoor areas, pools of radioactive waste that hurt the player, ceilings that come down and crush him, and unlike Wolfenstein's orthogonally aligned corridors, the walls in <i>DOOM</i> can be in any angle to each other. An automap helps in navigating the levels.<br><br>Stylistically, the levels begin with a futuristic theme in the military base on Phobos and gradually change to a hellish environment, complete with satanic symbols (pentagrams, upside-down-crosses and portraits of horned demons), hung-up mutilated corpses and the distorted faces of the damned.<br><br><i>DOOM</i> features a large weapon arsenal, with most weapons having both advantages and drawbacks. The starting weapons are the fists and a simple pistol. Also available are a shotgun (high damage, slow reload, not good at distances), a chaingun (high firing rate, but slightly inaccurate in longer bursts) and a plasma rifle (combining a high firing rate and large damage). The rocket launcher also deals out lots of damage, but the explosion causes blast damage and must be used with care in confined areas or it might prove deadly to the player as well as the enemies. Two further weapons in the game are the chainsaw for close-quarter carnage, and the BFG9000 energy gun, that, while taking some practice to fire correctly, can destroy most enemies in a single burst. The different weapons use four different ammunition types (bullets, shells, rockets and energy cells), so collecting the right type for a certain gun is important.<br><br>The game drops some of Wolfenstein's arcade-inspired aspects, so there are no extra lives or treasures to be collected for points, but many other power-ups are still available. Medpacks heal damage while armor protects from receiving it in the first place. Backpacks allow more ammunition to be carried, a computer map reveals the whole layout of the level on the automap (including any secret areas), light amplification visors illuminate dark areas and radiation suits allow travel over waste without taking damage. Also available are berserk packs (which radically increase the damage inflicted by the fists) as well as short-time invisibility and invulnerability power-ups.<br><br>The enemies to be destroyed include former humans corrupted during the invasion, plus demons in all shapes and sizes: fireball-throwing imps, floating skulls, pink-skinned demons with powerful bite attacks and large one-eyed flying monstrosities called Cacodemons. Each episode ends with a boss battle against one or two especially powerful creatures.<br><br><i>DOOM</i> popularized multiplayer in the genre with two different modes: Cooperative allows players to move through the single-player game together, while Deathmatch is a competitive game type where players blast at each other to collect 'frag' points for a kill and re-spawn in a random location after being killed.<br><br>The 3DO and Sega32x ports lack any multiplayer modes, though the other ports retain the DOS versions multiplayer to varying degree. The various console ports all feature simplified levels and omit some levels, enemies and features from the original DOS release. The SNES and Gameboy Advance versions of the game actually use different engines and hence feature numerous small gameplay differences.",
  "publishedBy": "Activision Publishing, Inc.",
  "developedBy": "id Software, Inc.",
  "released": "Oct 26, 2001",
  "alsoFor": "3DO, DOS, Jaguar, Linux, PC-98, SEGA 32X, SNES, Windows | Combined View",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/doom",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "id Software, Inc.",
          "ported": "David A. Palmer Productions",
          "country": " United States",
          "releaseDate": "Oct 26, 2001",
          "ean13": "5 030917 014666",
          "comments": ""
        },
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "id Software, Inc.",
          "ported": "David A. Palmer Productions",
          "country": " United States",
          "releaseDate": "Oct 26, 2001",
          "ean13": "5 030917 014666",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/34206-doom-game-boy-advance-screenshot-start-screen.jpg",
      "caption": "Start Screen"
    },
    {
      "link": "/images/shots/l/34207-doom-game-boy-advance-screenshot-title-screen.jpg",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/34208-doom-game-boy-advance-screenshot-the-beginning-of-the-game.jpg",
      "caption": "The beginning of the game"
    },
    {
      "link": "/images/shots/l/34209-doom-game-boy-advance-screenshot-a-castly-doorway.jpg",
      "caption": "A castly doorway"
    },
    {
      "link": "/images/shots/l/34210-doom-game-boy-advance-screenshot-in-doom-it-s-fun-to-shoot.jpg",
      "caption": "In Doom, it's fun to shoot at nothing"
    },
    {
      "link": "/images/shots/l/34211-doom-game-boy-advance-screenshot-i-ll-walk-through-lava-to.jpg",
      "caption": "I'll walk through lava to get that medkit"
    },
    {
      "link": "/images/shots/l/34212-doom-game-boy-advance-screenshot-a-freaky-level.jpg",
      "caption": "A freaky level"
    },
    {
      "link": "/images/shots/l/34213-doom-game-boy-advance-screenshot-just-tryin-out-the-old-shotgun.jpg",
      "caption": "Just tryin' out the old shotgun"
    },
    {
      "link": "/images/shots/l/34214-doom-game-boy-advance-screenshot-doom-is-known-well-for-it.jpg",
      "caption": "Doom is known well for it' odd monsters"
    },
    {
      "link": "/images/shots/l/407951-doom-game-boy-advance-screenshot-like-its-sister-gba-port.png",
      "caption": "Like its sister GBA port of Doom II, all blood is now recolored green."
    },
    {
      "link": "/images/shots/l/407952-doom-game-boy-advance-screenshot-yep-even-the-decorative-corpse.png",
      "caption": "Yep, even the decorative corpse puddles."
    },
    {
      "link": "/images/shots/l/604754-doom-game-boy-advance-screenshot-old-good-body-armor.png",
      "caption": "Old, good body armor."
    },
    {
      "link": "/images/shots/l/604755-doom-game-boy-advance-screenshot-small-group-enemies-ii-episode.png",
      "caption": "Small group enemies - II episode, Inferno difficulty."
    },
    {
      "link": "/images/shots/l/604756-doom-game-boy-advance-screenshot-too-many-enemies-i-have-a.png",
      "caption": "Too many enemies... i have a little trouble."
    },
    {
      "link": "/images/shots/l/604757-doom-game-boy-advance-screenshot-shotgun-i-like-this-weapon.png",
      "caption": "Shotgun. I like this weapon."
    },
    {
      "link": "/images/shots/l/604758-doom-game-boy-advance-screenshot-exploding-barrel-can-kill.png",
      "caption": "Exploding barrel can kill some enemies."
    },
    {
      "link": "/images/shots/l/604759-doom-game-boy-advance-screenshot-classic-doom-monster-one.png",
      "caption": "Classic doom monster - one eye, big smile..."
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/13596-doom-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/13591-doom-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/9576-doom-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/57864-doom-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "France",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/57865-doom-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "France",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/116064-doom-game-boy-advance-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "France",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/186523-doom-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/186524-doom-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/186525-doom-game-boy-advance-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Game Boy Advance"
    }
  ]
}