{
  "name": "Ghosts 'N Goblins",
  "shortName": "ghosts-n-goblins",
  "description": "<i>Ghosts 'N Goblins</i> is a sideways scrolling action platformer spread over six levels, each of which must be completed within three minutes (or a life is lost), taking in forest, village, mountain and cavern settings with increasing difficulty.<br><br>Arthur the brave knight must rescue his beloved Princess from the Demon King Astaroth and his forces - amongst them are the various undead (ghosts, zombies), bats, ogres and goblins. Other challenges include moving platforms, ladders and water/fire hazards. <br><br>The player can walk left and right, jump, and is also equipped with a lance to use as a weapon. Getting hit by enemies causes Arthur to lose his armor and run around in his underpants, getting hit again will cause the player to lose a life. As in most games in this genre, the player can pick up power-ups such as daggers and bombs during the course of the game, giving the player greater firepower.",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Capcom Co., Ltd.",
  "released": "May 21, 2004",
  "alsoFor": "Amiga, Amstrad CPC, Android, Arcade, Atari ST, BREW, Commodore 16, Plus/4, Commodore 64, DOS, DoJa, FM-7, Game Boy Color, iPad, iPhone, NES, Nintendo 3DS, Nintendo Switch, PC-88, PlayStation 3, Wii, Wii U, Windows Mobile, Xbox 360, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/ghosts-n-goblins",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Capcom Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "May 21, 2004",
          "ean13": "",
          "comments": "Famicom Mini Series #18"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/464900-ghosts-n-goblins-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title Screen"
    }
  ],
  "cover": []
}