{
  "name": "Hot Wheels: Velocity X",
  "shortName": "hot-wheels-velocity-x_",
  "description": "Released in conjunction with a <a href=\"https://www.mobygames.com/game/ps2/hot-wheels-velocity-x\">version on console and PC</a>, <i>Hot Wheels: Velocity X</i> on Game Boy Advance is not an adaptation, but an entirely unique game. It shares the general concept and some characters, but has its own story, modes and gameplay style.<br><br>The evil MetaCog attacks Hot Wheels HQ, putting the engineers to sleep with his hypnotic headlight, stealing five cars along with five parts of a new prototype. The Professor finds that his robot Gear Head isn't affected by the hypnosis, so he modifies him to become a top racer, able to beat MetaCog and his gang bosses and recapture the stolen parts and cars.<br><br>In the game's main Story Mode, the player controls Gear Head through five different worlds of seven missions each. The missions include races (in which the only goal is to cross the finish line first), stunt challenges (performing moves during jumps for points) as well as other objective-based missions: these include finding objects in a level within a time limit, playing a game of tag with a bomb (putting it on an enemy car before it explodes), protecting another car that is on a special mission, and many more. The final level in each world is a confrontation against one of the gang bosses, involving a race followed by a combat duel against the boss.<br><br>Races and missions are seen from an isometric perspective. Controls can be adjusted between track-relative and car-relative. The tracks feature a lot of jumps, loops and corkscrews, through which cars automatically move - there is no falling off or failing a jump. Scattered around the tracks are power-ups, including various weapons (necessary for the combat missions, but also useful in all others), a shield, a repair kit and more.<br><br>Completing missions in Story Mode unlocks new cars (there is a total of 30 cars in the game, each with different ratings in speed, acceleration, traction and armor) and makes the completed levels available for the game's other modes. These include Race Mode which allows standard races with number of opponents and laps adjustable, with three tracks per world available. Challenge mode has two varieties per world: Battles require the player to destroy all other cars in the level within a time limit, Tag requires the player to tag all other cars without getting tagged back, also within a time limit.<br><br>There is an in-game database of cars, characters, power-ups and stunt moves whose entries are unlocked by moving through Story Mode. Game progress is saved via passwords. The game also features connectivity to the <a href=\"https://www.mobygames.com/game/gamecube/hot-wheels-velocity-x\">GameCube version</a>, which is the only way to unlock certain cars.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Saffire, Inc",
  "released": "Nov 12, 2002",
  "alsoFor": "",
  "genre": "Action, Racing / driving",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/hot-wheels-velocity-x_",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Saffire, Inc",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 12, 2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/146993-hot-wheels-velocity-x-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/146994-hot-wheels-velocity-x-game-boy-advance-screenshot-main-menu.png",
      "caption": "Main menu."
    },
    {
      "link": "/images/shots/l/146995-hot-wheels-velocity-x-game-boy-advance-screenshot-choosing.png",
      "caption": "Choosing a Hot Wheel model car."
    },
    {
      "link": "/images/shots/l/146996-hot-wheels-velocity-x-game-boy-advance-screenshot-race-grid.png",
      "caption": "Race grid."
    },
    {
      "link": "/images/shots/l/146997-hot-wheels-velocity-x-game-boy-advance-screenshot-using-a.png",
      "caption": "Using a slope as propulsion, the Hooligan? makes a long jump successfully!"
    },
    {
      "link": "/images/shots/l/146998-hot-wheels-velocity-x-game-boy-advance-screenshot-meanwhile.png",
      "caption": "Meanwhile, some cars are disputing a position during a curve..."
    }
  ],
  "cover": []
}