{
  "name": "Keitai Denjuu Telefang 2: Speed (Limited)",
  "shortName": "keitai-denjuu-telefang-2-speed-limited",
  "description": "In this second paired game in the <i>Keitai Denj? Telefang</i> series, a new T-Fanger named Kyou becomes involved in a struggle against the evil Denj? named Diablos, who wants to permanently cut off humanity's access to the Denj? world. Now that Diablos has killed all but one of the antenna trees, it's up to Kyou to stop him before the two worlds are completely separated, which would leave Kyou stuck in the Denj? world forever.<br><br>Gameplay is similar to the original pair of <i>Telefang</i> games, but with some added enhancements. Several new Denj? are available, and many old ones now have different evolution methods. Attacks now receive their own typing independent of the Denj?, meaning a monster with the right move can cover its own weaknesses in battle. New types of items are also introduced, including healing items and ones that increase the chance of a defeated Denj? sharing its phone number with Kyou. Lastly, befriended Denj? have their own friends, which may randomly appear to assist in battle even if Kyou has never met them before.<br><br>As with the earlier games in the series, <i>Speed Version</i> was released as part of a pair, with <a href=\"https://www.mobygames.com/search/quick?game=Keitai+Denj%c5%ab+Telefang+2%3a+Power+Version\">Power Version</a> being its counterpart. Certain Denj? are exclusive to one version or the other, and players can connect their games via Game Link Cable in order to trade and battle their collected Denj?.",
  "publishedBy": "Smilesoft Co.,Ltd.",
  "developedBy": "Natsume Co., Ltd.",
  "released": "Apr 26, 2002",
  "alsoFor": "",
  "genre": "Role-Playing (RPG)",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/keitai-denjuu-telefang-2-speed-limited",
  "visual": "",
  "gamePlay": "Japanese-style RPG (JRPG)",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Smilesoft Co.,Ltd.",
          "developer": "Natsume Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 26, 2002",
          "ean13": "4 542058 000114",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/873926-keitai-denjuu-telefang-2-speed-limited-game-boy-advance-screenshot.png",
      "caption": "Title Screen"
    }
  ],
  "cover": []
}