{
  "name": "Kid Icarus",
  "shortName": "kid-icarus",
  "description": "Far away in peaceful Angel Land lived a young angel warrior named Pit, who has been given the task of defeating the monstrous Medusa, who wishes to destroy Angel Land and all of the people, and she has started by kidnapping Palutena, the Princess of Angel Land.<br><br>Young Pit must rescue the Princess and restore peace to Angel Land. He will travel from the deep caverns of the Underworld to Medusa's palace in the sky on his journey, and deadly monsters will attack him every step of the way. But he has the power of the Gods on his side! A powerful bow and arrows, Water of Life, and Angel Feathers will assist Pit on his quest to destroy Medusa and save the princess!<br><br><i>Kid Icarus</i> is a platform game where the player goes through several vertically outlaid levels, shooting enemies with his bow on the way and collecting hearts they leave behind. Pit's bow can shoot both forward and upwards. As Pit continues upwards, more and more of the level ends up beyond the bottom of the screen and if Pit falls down out of the screen, he dies. <br><br>The levels contain doors which lead to chambers of various types - some chambers are filled with enemies, some are treasuries which allow Pit to obtain a power-up, some are stores where Pit can buy stuff, some will replenish his health, in some Pit will be able to take a test in hopes of getting a powerful weapon, and finally some chambers give Pit a chance of receiving a strength upgrade, therefore increasing the amount of damage his attacks deal. <br><br>Pit earns experience as he defeats enemies, and he gains levels from this experience. The more levels Pit has, the more maximum health he has. <br><br>Hearts taken from enemies are used in shops to buy various items and power-ups. Items include a protective shield which harms enemies, a more powerful bow, a mallet which allows you to smash the poor Palutena's warriors turned to stone who will later help you to fight a boss, a torch to see yourself in dark areas and others. ",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Nintendo R&amp;D1, Tose Co., Ltd.",
  "released": "Aug 10, 2004",
  "alsoFor": "Arcade, NES, Nintendo 3DS, Nintendo Switch, Wii, Wii U | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/kid-icarus",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Nintendo R&amp;D1",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 10, 2004",
          "ean13": "4 902370 509458",
          "comments": "Famicom Mini Series #24"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/465284-kid-icarus-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title Screen"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/251511-kid-icarus-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/258850-kid-icarus-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/258852-kid-icarus-game-boy-advance-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    }
  ]
}