{
  "name": "Looney Tunes: Back in Action",
  "shortName": "looney-tunes-back-in-action_",
  "description": "<i>Looney Tunes: Back in Action</i> on the Game Boy Advance is, like <a href=\"https://www.mobygames.com/game/ps2/looney-tunes-back-in-action\">its counterpart on consoles</a>, loosely based on the 2003 film. Bugs Bunny and Daffy Duck find the office of Mr. Warner at Warner Bros. taken over by bad guys, including Yosemite Sam, Marvin the Martian, Elmer Fudd and the Tazmanian Devil, all working for the evil Acme Corporation. Thankfully, other Looney Tunes characters have formed a resistance against Acme and can guide Bugs and Duffy to defeat Acme's nefarious scheme.<br><br>The game takes place over four large levels: the Wooden Nickel casino in Las Vegas, Area 52 in the Nevada desert, the Louvre in Paris and a temple in the jungle. Levels are displayed in an isometric view and players can switch between Bugs and Daffy at any time. The characters have slightly different abilities: Bugs can jump longer distances by flapping his ears and can get across the level by burrowing through rabbit holes. Daffy is the only one who can swim in water.<br><br>The goal in each level is to capture 12 &quot;munkeys&quot;. Other characters like Foghorn Leghorn or Egghead Jr. are always nearby to give hints on what to do next. To get to the munkeys, several smaller challenges must be met: solving a maze, racing or dueling other characters or leading enemies into a trap. Enemies like guards, cowboys (in the casino) or robots (at Area 52) always patrol the levels. Mailboxes dispense useful powerups to deal with them: throwing ammunition in the form of eggs, a special one-time-use dropping weapon (an anvil for Daffy, a piano for Bugs), an invincibility shield, and more.<br><br>Also lying about the levels are &quot;munnies&quot; (i.e. banknotes). Collecting enough of them opens up mini-games in which bombs drop from the sky and must be pushed off a platform before they explode. Fulfilling the quota of bombs without being blown up by one gains an extra life.<br><br>A boss fight against one of the four main bad guys concludes each level. The transition to the next level comes in the form of a racing game, seen from behind the player's car. The same bad guy just beaten in a fight must be beaten again, this time to the finish line. Winning on speed alone is impossible, powerups lying on the road must be used to slow down the opponent: these include bombs, shields, anvils, magnets, and more.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Warthog Games Ltd.",
  "released": "Nov 30, 2003",
  "alsoFor": "",
  "genre": "Action, Racing / driving",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/looney-tunes-back-in-action_",
  "visual": "2D scrolling, Isometric",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Warthog Games Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 30, 2003",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/144847-looney-tunes-back-in-action-game-boy-advance-screenshot-title.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/741398-looney-tunes-back-in-action-game-boy-advance-screenshot-meeting.png",
      "caption": "Meeting Daffy Duck"
    },
    {
      "link": "/images/shots/l/741399-looney-tunes-back-in-action-game-boy-advance-screenshot-received.png",
      "caption": "Received a letter"
    },
    {
      "link": "/images/shots/l/741400-looney-tunes-back-in-action-game-boy-advance-screenshot-lets.png",
      "caption": "Lets explore the casino"
    },
    {
      "link": "/images/shots/l/741401-looney-tunes-back-in-action-game-boy-advance-screenshot-there.png",
      "caption": "There's Foghorn Leghorn"
    },
    {
      "link": "/images/shots/l/741402-looney-tunes-back-in-action-game-boy-advance-screenshot-get.png",
      "caption": "Get down from there"
    },
    {
      "link": "/images/shots/l/741403-looney-tunes-back-in-action-game-boy-advance-screenshot-swimming.png",
      "caption": "Swimming"
    }
  ],
  "cover": []
}