{
  "name": "Meitantei Conan: Akatsuki no Monument",
  "shortName": "meitantei-conan-akatsuki-no-monument",
  "description": "<i>Akatsuki no Monument</i> is the second Detective Conan game for Game Boy Advance and features scenario mode as well as various mini-games. The main game story kicks off with Conan, Ran and Kogorou on their way to ceremony of a newly built resort by the sea. Kogorou Mouri, as a renowned detective (thanks to Conan), was invited to the opening ceremony, while Conan and Ran are just tagging along. As they arrive, the owner of the luxury resort asks them to look into the rumors about the land where the mansion was built on. The rumor is known as the so called &quot;village of suicides&quot;. Later that evening, as they check the buffet and meet many other invited guests, pleasantries are exchanged and small talks reveal little to nothing of interest... until, a body falls down on a sports car that was on the display in the lobby area. Coincidence, or is there really some truth to these rumors... Conan is taking up to find out the truth and discover the mystery behind this death as well as the rumors that are plaguing the area.<br><br>Main scenario gameplay offers easy and normal difficulty mode (which affect your time limit in solving mysteries) and consists of three main elements:\n<ul>\n<li> presentation - the story advances by presenting the newly obtained element in your investigation which is done during dialogues with characters and grants you bonus points for no mistakes as you present the right answer in as little time as possible (normal, critical and no hit are then displayed on the result screen)</li>\n<li> investigation - with Conan on the screen you can move the character through the rooms and select areas of interest with the round cursor (the hit bar is also displayed here which will give you a penalty upon re-investigating already seen areas)</li>\n<li> reasoning - putting in order events that have transpired so far, the player need to answer Conan's questions based on gathered evidence and investigation</li>\n</ul>\nAside from the scenario story, the main menu also offers:\n<ul>\n<li> shop - here, one can buy mini-games and album items with earned points from the scenario game</li>\n<li> mini-games - there re five different mini-games, each come with four levels, where player starts from level 1 and net levels become available upon completion of the one you are currently on</li>\n<li> album - various items that can be purchased from the shop with earned points, some of which include background artwork, character info and in-game music and sound effects</li>\n</ul>",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "",
  "released": "Apr 21, 2005",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "1st-person, 3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/meitantei-conan-akatsuki-no-monument",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 21, 2005",
          "ean13": "4 983164 733303",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/299767-meitantei-conan-akatsuki-no-monument-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/299768-meitantei-conan-akatsuki-no-monument-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/299769-meitantei-conan-akatsuki-no-monument-game-boy-advance-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    }
  ]
}