{
  "name": "Metal Max 2",
  "shortName": "metal-max-2",
  "description": "This is a sequel to <a href=\"https://www.mobygames.com/game/metal-max\">Metal Max</a>. The game is set in a futuristic world. An evil organization known as the Grapplers terrorizes the world, destroying entire cities if they notice a sign of resistance. The elders of Mado City invited four famous monster hunters to defend the city against the Grapplers. One of the hunters, Maria, brought a friend with her - this friend is you, the hero of the game. But even the hunters can't withstand the Grapplers' assault. Their leader, the giant machine-like Ted Broiler, kills Maria. You are left on your own, and you decide to fight the Grapplers and to become a hunter yourself.<br><br>The game is a Japanese-style RPG with random encounters and turn-based combat viewed from third-person perspective, like in <a href=\"https://www.mobygames.com/search/quick?gamegroup=Final+Fantasy+Series\">Final Fantasy</a> games. There are two kinds of combat in the game: standard character-to-character combat, and vehicle battles. vehicles can be purchased, equipped, and modified just like the characters themselves. Various vehicles have different special attacks, and there are plenty of items to collect that will upgrade and repair your vehicles. As a hunter, you can also hunt down various giant monsters that populate the world, and kill them for a reward.<br><br>The Game Boy Advance port has a few extra bounties and tanks added.",
  "publishedBy": "Now Production Co., Ltd.",
  "developedBy": "Crea-Tech Inc.",
  "released": "Jun 20, 2003",
  "alsoFor": "SNES, Wii | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/metal-max-2",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Now Production Co., Ltd.",
          "developer": "Crea-Tech Inc.",
          "ported": "Now Production Co., Ltd.",
          "country": " Japan",
          "releaseDate": "Jun 20, 2003",
          "ean13": "4 582104 070043",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1040137-metal-max-2-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title screen"
    }
  ],
  "cover": []
}