{
  "name": "Monster Rancher Advance 2",
  "shortName": "monster-rancher-advance-2",
  "description": "Monster Rancher Advance 2 is a monster raising sim where players can raise, battle, explore with any of 512 monsters. While it is the second Monster Rancher game on the Game Boy Advance system, it is not a true sequel, and does not require any knowledge of any other ranching games to play.<br><br>Players make monsters by entering letters, numbers, and punctuation characters into the in-game shrine. At the start, players have access to up to 4 spaces to enter words or characters. As they improve their rank as a trainer, they can access more spaces, up to a maximum of 8. Players may also bring monsters into the game from their Monster Rancher Advance game, or trade monsters with other Monster Rancher Advance 2 players through use of a second GBA and a link cable.<br><br>Players then raise their monster, deciding what foods to feed them, what drills to teach attributes at, what items to give them, what attacks to add in training, and which characteristics to add or remove at the Hospital. Monsters may become hurt or ill, and can be treated for a fee at the Hospital which also offers free checkups. Players start with a modest sum of money, and earn more by winning in-game tournaments, or by finding valuable items to sell on expeditions. <br><br>The storyline is one of the longest and most complex of any Monster Rancher game. Unlocking various types of monsters involves participating in a variety of events including storyline quests on expeditions, and battling in various tournaments. Players will see characters from older Monster Rancher games, and be introduced to new characters. Monsters now develop bonds with each other and can become friends with monsters within the game, and with monsters in other player's games via link cable use. Completing the storyline requires over 200 hours of gameplay.<br><br>Monsters do not die in this game, but they do face an enforced retirement age. When retired, they can coach other monsters to improve drills, and be used in combining to make stronger baby monsters with more attacks and better characteristics.<br><br>This game has several improvements over the previous Game Boy Advance game including: a counter system added to battles, RPG style expeditions, a monster buddy system, a more complex coaching for pay system, super coaches, the ability to add or remove characteristics, diseases, tag team battles, more hidden monsters, and a new breed of monster.<br><br>In 2 Player mode, monsters can battle against other player's monsters via the GBA link cable. Single monsters can face off against each other, or players can set up tag team battles.",
  "publishedBy": "Tecmo, Inc.",
  "developedBy": "Graphic Research Co., Ltd., Tecmo, Ltd.",
  "released": "Nov 18, 2002",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/monster-rancher-advance-2",
  "visual": "",
  "gamePlay": "Fighting, Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Tecmo, Inc.",
          "developer": "Graphic Research Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 18, 2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/61006-monster-rancher-advance-2-game-boy-advance-screenshot-monster.png",
      "caption": "Monster Rancher Advance 2"
    },
    {
      "link": "/images/shots/l/61007-monster-rancher-advance-2-game-boy-advance-screenshot-the-town.png",
      "caption": "The town menu of things to do"
    },
    {
      "link": "/images/shots/l/61008-monster-rancher-advance-2-game-boy-advance-screenshot-creating.png",
      "caption": "Creating a monster using the letters &quot;Mega&quot;"
    },
    {
      "link": "/images/shots/l/61009-monster-rancher-advance-2-game-boy-advance-screenshot-the-result.png",
      "caption": "The result of &quot;Mega&quot;"
    },
    {
      "link": "/images/shots/l/61010-monster-rancher-advance-2-game-boy-advance-screenshot-the-stats.png",
      "caption": "The stats of the monster regenerated using &quot;Mega&quot;"
    },
    {
      "link": "/images/shots/l/61011-monster-rancher-advance-2-game-boy-advance-screenshot-visiting.png",
      "caption": "Visiting AGIMA ... where you can set coaching stats, retire, and go on explorations"
    },
    {
      "link": "/images/shots/l/61012-monster-rancher-advance-2-game-boy-advance-screenshot-the-studio.png",
      "caption": "The Studio is where you can freeze a monster you are raising so you can raise another.  It is also where you can combine monsters to make a new monster."
    },
    {
      "link": "/images/shots/l/61013-monster-rancher-advance-2-game-boy-advance-screenshot-visit.png",
      "caption": "Visit the hospital to prevent illness and to cure any problems your monster gets"
    },
    {
      "link": "/images/shots/l/61014-monster-rancher-advance-2-game-boy-advance-screenshot-go-to.png",
      "caption": "Go to the Builder in the Square to expand your barn so it will hold bigger monsters"
    },
    {
      "link": "/images/shots/l/61015-monster-rancher-advance-2-game-boy-advance-screenshot-your.png",
      "caption": "Your Ranch is where you will do most things such as training and battling in tournaments"
    },
    {
      "link": "/images/shots/l/61016-monster-rancher-advance-2-game-boy-advance-screenshot-fighting.png",
      "caption": "Fighting in tournaments improves stats and fame as well as getting you more money"
    },
    {
      "link": "/images/shots/l/61017-monster-rancher-advance-2-game-boy-advance-screenshot-the-fight.png",
      "caption": "The fight begins!"
    },
    {
      "link": "/images/shots/l/61018-monster-rancher-advance-2-game-boy-advance-screenshot-attacking.png",
      "caption": "Attacking with Fire Punch, one of the first abilities of &quot;Mega&quot;"
    },
    {
      "link": "/images/shots/l/61019-monster-rancher-advance-2-game-boy-advance-screenshot-soul.png",
      "caption": "Soul Mates are available once you learn about them and try to make some friends"
    },
    {
      "link": "/images/shots/l/61020-monster-rancher-advance-2-game-boy-advance-screenshot-some.png",
      "caption": "Some of the stats you can see on your monsters include its winning record and its likes"
    },
    {
      "link": "/images/shots/l/61021-monster-rancher-advance-2-game-boy-advance-screenshot-explorations.png",
      "caption": "Explorations can be dangerous, but you can find some useful items"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/29704-monster-rancher-advance-2-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/29705-monster-rancher-advance-2-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Advance"
    }
  ]
}