{
  "name": "Phoenix Wright: Ace Attorney - Justice for All",
  "shortName": "phoenix-wright-ace-attorney-justice-for-all",
  "description": "Order in the court!  Phoenix Wright, <a href=\"https://www.mobygames.com/search/quick?quickSearch=013388320011\">Ace Attorney</a> is back for more defense attorney action!  Taking place a year after the events of the previous game, Phoenix encounters many faces from the previous game... some friends... some foes.  Using your keen deduction skill, and armed with the evidence, you'll be able to guide Phoenix through four new cases as you pick apart witnesses' inconsistencies and lies.<br><br><i>Justice For All</i> is a courtroom simulation and adventure game.  Players gather evidence and interrogate witnesses as they try to help Phoenix Wright prove his client's innocence.  New to the sequel is the addition of &quot;Psyche Locks&quot;, which cover a person when they are hiding a particularly dark secret.  You'll need to break open these locks by presenting enough evidence to convince the person to tell the truth.  In addition, Phoenix's courtroom blunders are now represented by a «soul energy» meter instead of set hit points.  This means that some mistakes can cost you a lot more than others!<br><br>Like in the previous DS version of the game, players can navigate through menus and items by using the stylus, as well as manage their inventory.  Also available is the optional method of evidence presentation: you can actually shout out &quot;HOLD IT!&quot;, &quot;OBJECTION!&quot; and &quot;TAKE THAT!&quot; into the microphone when you're ready to destroy the opposition's argument!",
  "publishedBy": "Capcom Co., Ltd.",
  "developedBy": "Capcom Co., Ltd.",
  "released": "Oct 17, 2002",
  "alsoFor": "Nintendo DS, Wii, Wii U, Windows | Combined View",
  "genre": "Adventure, Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/phoenix-wright-ace-attorney-justice-for-all",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Capcom Co., Ltd.",
          "developer": "Capcom Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Oct 17, 2002",
          "ean13": "4 976219 735902",
          "comments": "Best Price Release"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/465938-phoenix-wright-ace-attorney-justice-for-all-game-boy-advance.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/465939-phoenix-wright-ace-attorney-justice-for-all-game-boy-advance.png",
      "caption": "Intro"
    }
  ],
  "cover": []
}