{
  "name": "The Santa Clause 3: The Escape Clause",
  "shortName": "santa-clause-3-the-escape-clause",
  "description": "Based on the film of the same name, The Santa Clause 3: The Escape Clause sees players controlling Scott Calvin in a platforming game that follows the movies events. Beginning as him firmly in his role as Santa Claus, early levels are devoted to exploring icy levels at the North Pole, collecting cookies and milk while avoiding hazards like spiky ice and enemies. Players only need to reach the end of the levels to complete them, the game capping off most of its chapters with minigames like elves navigating a haywire workshop to build a scooter or playing as Santa flying his sleigh to deliver coal and presents to the appropriate households.<br><br>Villain Jack Frost aims to sabotage Santa's Christmas activities so he can steal the mantle of the legendary holiday figure for himself, leading to Scott Calvin having to navigate a few levels without his Christmas powers. Normally Santa can glide with his coat and attack with a jack-in-the-box, but Scott relies only on thrown snowballs to repel baddies and the double jump both he and Santa share for level navigation. Some levels will change away from the lax pace of free level exploration to add automatically scrolling screens to pressure players into fast movement.",
  "publishedBy": "Buena Vista Games, Inc.",
  "developedBy": "1st Playable Productions, LLC",
  "released": "Nov 01, 2006",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/santa-clause-3-the-escape-clause",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Buena Vista Games, Inc.",
          "developer": "1st Playable Productions, LLC",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 01, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}