{
  "name": "Shamu's Deep Sea Adventures",
  "shortName": "shamus-deep-sea-adventures",
  "description": "'Shamu's Deep Sea Adventures' is an action game where players must control Shamu the killer whale on a quest to save the SeaWorld theme park from the Greek god Poseidon (who plans to replace it with the lost city of Atlantis, as well as taking over the world).<br><br>The handheld games play much differently to the home console versions as players simply guide Shamu across a variety of levels using the control pad (or stylus for the Nintendo DS version) to swim, dash to defeat enemies and break objects, and even jump out of the water. Instead of a health bar, Shamu needs to collect plenty of crystals to protect him from a variety of enemies including puffer fish, sea anemones and even the evil Kraken. Voice acting is also absent in these versions and includes dialogue boxes instead for each character.<br><br>Each level is filled with crystals (to keep Shamu healthy), Atlantis tablets (important collectibles) and even treasure chests (in which finding every four unlocks a photo in the Art Gallery in the main menu). Most levels also include temporary objective items that Shamu can keep in the inventory to use later. The krill balls and oxygen bubbles are also omitted in the handheld games.<br><br><br><br><br><br>",
  "publishedBy": "Activision Publishing, Inc.",
  "developedBy": "Humagade Inc.",
  "released": "Nov 08, 2005",
  "alsoFor": "Nintendo DS | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/shamus-deep-sea-adventures",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "Humagade Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 08, 2005",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}