{
  "name": "Spy Hunter",
  "shortName": "spy-hunter_",
  "description": "The <a href=\"https://www.mobygames.com/game/ps2/spy-hunter___\">modern update</a> of the classic arcade game <i>Spy Hunter</i> was also adapted for the Game Boy Advance. It adapts roughly half of the console version's missions, albeit with completely changed level designs that fit with the Mode 7-style sprite scaling and rotation engine, and adds several unique gameplay modes of its own.<br><br>The player controls the advanced G-6155 Interceptor car to combat the evil Nostra Corporation. The game's main Normal Agent mode consists of seven different missions. Each mission has one primary and several secondary objectives, to be finished within a time limit. The primary goal must be met to unlock the next mission, the secondary goals are only necessary to unlock further game modes. Objectives include destroying certain targets, moving through slalom obstacles, avoiding civilian casualties, activating Satcoms by driving over them, making long jumps, and more. Various enemies will be on the road that can be attacked with the Interceptor's weapons, including machine guns, missiles and rail guns. There are also defensive weapons like smoke screens and oil slicks. The weapons can be either found as pick-ups on the road or by finding and driving into the classic weapons van.<br><br>The seven mission levels can also be played in Special Agent mode. This involves the levels being filled with chickens, with the goal being to drive over or shoot as many chickens as possible. An extra unlockable mode is Secret Agent mode. It is similar to the regular mission mode and features the same levels and objectives, but different placement of objects and enemies. Also unlockable is Arcade mode, a free run through a level with the goal to cause as much destruction as possible for a high score. The game also features a two-player mode via link cable. The players compete to either activate more Satcoms or kill more chickens.",
  "publishedBy": "Midway Home Entertainment, Inc.",
  "developedBy": "Midway Games, Inc.",
  "released": "May 17, 2002",
  "alsoFor": "",
  "genre": "Action, Racing / driving",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/spy-hunter_",
  "visual": "",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Midway Home Entertainment, Inc.",
          "developer": "Midway Games, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "May 17, 2002",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Midway Games Limited",
          "developer": "Midway Games, Inc.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Jun 28, 2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/66504-spy-hunter-game-boy-advance-screenshot-the-game-is-on.png",
      "caption": "The game is on!"
    },
    {
      "link": "/images/shots/l/66505-spy-hunter-game-boy-advance-screenshot-intro-picture.png",
      "caption": "Intro picture"
    },
    {
      "link": "/images/shots/l/66506-spy-hunter-game-boy-advance-screenshot-pick-your-type-of-game.png",
      "caption": "Pick your type of game"
    },
    {
      "link": "/images/shots/l/66507-spy-hunter-game-boy-advance-screenshot-then-choose-your-mission.png",
      "caption": "Then choose your mission as either a normal agent or a special agent"
    },
    {
      "link": "/images/shots/l/66514-spy-hunter-game-boy-advance-screenshot-drive-along-the-tracks.png",
      "caption": "Drive along the tracks as you complete various objectives"
    },
    {
      "link": "/images/shots/l/66515-spy-hunter-game-boy-advance-screenshot-change-your-vehicle.png",
      "caption": "Change your vehicle to drive on the water"
    },
    {
      "link": "/images/shots/l/66516-spy-hunter-game-boy-advance-screenshot-jump-the-jumps-to-get.png",
      "caption": "Jump the jumps to get power-ups such as weapons or just to see how far your can make it"
    }
  ],
  "cover": []
}