{
  "name": "Super Robot Taisen A",
  "shortName": "super-robot-taisen-a",
  "description": "After numerous conflicts around Earth, peace has finally come, if only temporarily. A race of extraterrestrials, Barm (???, from the animated series <i>T?sh? Daimos</i>), escaping their dying home planet, come to the Earth Orbit as refugees. While initially the Earth Federation was willing to accept them into the Space Colonies, the assassination of the diplomatic mission results in the war with the extraterrestrials. Meanwhile, an empire on the Moon declares independence and assaults the Federation, and the Mars Colony goes missing after an attack by an unknown enemy. On Earth, monsters of Dr. Hell (<i>Mazinger Z</i>) start rampaging through again. The only saving grace for the Federation is the 13th Independent Battalion, Londo Bell (from <i>Char's Counterattack</i>). However, none of the members of the team really know who sowed the seeds of war. The battalion bands together to find out.<br><br>This is the first game in the <i>Super Robot Wars/Taisen</i> franchise released for the Game Boy Advance. Graphics-wise, the game shares many similarities with the games in the Classic timeline, especially <i><a href=\"https://www.mobygames.com/game/super-robot-wars-f\">F</a></i> and <i><a href=\"https://www.mobygames.com/game/super-robot-wars-f-final\">F Final</a></i>. Units in combat do not have battle animations and they are drawn in the &quot;super-deformed&quot; style. In terms of gameplay, the game is a classic tactical RPG with many Japanese robot franchises. Unlike the previous entries in the series, the game introduces a loyalty system, where units that assist other units by way of support attack or defense can increase their damage or defense rate every time they do it. Also, defensive items such as shields now have their own separate HP bar.<br><br>Like other SRW games starting from <a href=\"https://www.mobygames.com/game/super-robot-wars-f\">F</a>, <a href=\"https://www.mobygames.com/game/super-robot-wars-f-final\">F Final</a> and <a href=\"https://www.mobygames.com/game/super-robot-taisen-\">Alpha</a>, players are given the option of choosing their main character and their robot type. Depending on the choice of the type of robot or choices made by the player character mid-game, the story can branch out in different directions. During intermissions, players can customize pilot skills and upgrade their current robot roster.",
  "publishedBy": "Banpresto Co., Ltd.",
  "developedBy": "A.I Co., Ltd.",
  "released": "Sep 21, 2001",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/super-robot-taisen-a",
  "visual": "",
  "gamePlay": "Tactical RPG, Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Banpresto Co., Ltd.",
          "developer": "A.I Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 21, 2001",
          "ean13": "4 983164 730920",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}