{
  "name": "Super Mario Bros. 2",
  "shortName": "super-mario-bros-2_",
  "description": "The Princess has been kidnapped by King Koopa (again) and it's up to Mario and Luigi to save her (again).  Not to be confused with the western <a href=\"https://www.mobygames.com/game/super-mario-bros-2\">Super Mario Bros. 2</a>, this sequel to <a href=\"https://www.mobygames.com/game/super-mario-bros\">Super Mario Bros.</a> is very much an expansion to the original, with many reused graphics and concepts, though new ones are also present.<br><br>Instead of offering a two-player mode as in the original, this game allows you to choose between a Mario mode and a Luigi mode, with each character handling differently.  Mario has tighter ground control, while Luigi has greater jumping capabilities.<br><br>Power-ups remain the same: Super Mushrooms grow a brother from small to Super size, Fire Flowers give them the ability to throw fireballs at enemies, Starman makes a character temporarily invincible, and a 1-Up Mushroom will give one more life.  New to this game is a power-down, a Poison Mushroom which will harm you as if it were an enemy.<br><br>The goal is still to survive from the left side of the level to the right, avoiding perils and bopping enemies along the way, progressing through a series of 8 worlds with 4 levels each.  That is, unless a warp zone is found allowing areas to be skipped.  There are new tricks that work for and against the player, though.  Some piranha plants will come out of their pipe even if you're standing right next to them, and bloobers now appear outside of the water.  Wind can be present to alter how jumps will behave.  Some warp zones will actually take the player to an earlier level instead of to a later one.",
  "publishedBy": "Nintendo Co., Ltd.",
  "developedBy": "Nintendo Co., Ltd.",
  "released": "Aug 10, 2004",
  "alsoFor": "NES, Nintendo 3DS, Nintendo Switch, Wii, Wii U | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/super-mario-bros-2_",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Nintendo Co., Ltd.",
          "developer": "Nintendo Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 10, 2004",
          "ean13": "4 902370 509434",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/464572-super-mario-bros-2-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title Screen"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/463437-super-mario-bros-2-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/463438-super-mario-bros-2-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Japan",
      "platforms": "Game Boy Advance"
    }
  ]
}