{
  "name": "Teenage Mutant Ninja Turtles 2: Battle Nexus",
  "shortName": "teenage-mutant-ninja-turtles-2-battle-nexus_",
  "description": "<i>Teenage Mutant Ninja Turtles 2: Battle Nexus</i> is based on the 2003 television series in the Turtles franchise. Like the <a href=\"https://www.mobygames.com/game/ps2/teenage-mutant-ninja-turtles-2-battle-nexus\">console game of the same name</a>, it is based on the events of season two of the series. It however adapts fewer storylines and presents them in unique side-scrolling gameplay.<br><br>The story is based primarily on the first two story arcs of the TV season: <i>Turtles in Space</i> and <i>Secret Origins</i>. The turtles are surrounded by a strange light and find themselves on a strange alien planet. After they rescue a robot who is hunted by soldiers and Triceratons, he tells them that he can help them get back home via the teleporter he built. Required for the vast distances however is the power of special crystals, so the four reptile dudes set out to collect them.<br><br>The game consists of five worlds of six levels each. Each world contains 100 crystals. Finishing a world and unlocking the next requires beating all levels and, depending on difficulty, collecting all (hard), 85 (medium) or no (easy) crystals. Before each level, players can select which of the four turtles to play, and any level can be played again with another character to try and find more crystals. The levels themselves are of one of four different gameplay types. The majority take the form of a platformer with beat'em up elements. Due to interference by the Shredder and Baxter Stockman, the turtles' weapons materialize some distance away from them, so the first order in the platform levels is to collect the current character's signature weapon. Enemies stand in the way and can be taken out or avoided by hiding in doorways. To get around, the turtles can climb poles and ledges and pull themselves up shafts. Taking out enemies may reveal keycards, which are needed to open certain doors. The crystals can be in plain sight or hidden in blocks that must be destroyed first. The four characters have different abilities, and some crystals can only be reached by a specific turtle. For example, only Donatello can enter dark rooms because he wears sensor goggles and only Raphael can scale walls with his sais. Several of the platform levels end with boss fights.<br><br>Next to the platform levels, there are three different kind of shooting levels. The hoverboard levels put one of the turtles on a hoverboard. The level scrolls automatically and enemies arrive from front and behind and can be shot at in both directions. The board can only stay airborne for a short time and will slowly glide downwards. It is slightly different with the hovercraft levels, which are similar to traditional arcade shoot'em ups. They also scroll automatically, and the craft can employ forward-firing lasers or a falling bomb to take out enemies. Both side-scrolling shooter level types occasionally end with boss battles. The final type of level takes place in space, with the action seen from a cockpit perspective. Lasers must be fired at enemy spacecraft, asteroids (to prevent collisions) and crystals (to pick them up).<br><br>Besides the main story mode, the game also includes two smaller modes which can be played solo or in multiplayer via link cable. Race mode has the four turtles racing each other on hoverboards. Crouching above certain areas gives a speed boost or lets one knock the other turtles off their board for a time. In battle mode, the goal is to collect a number of crystals in a small level within a time limit, with enemies also standing in the way. Beating a level ups the crystal threshold for another player. Both extra modes feature a number of levels that are unlocked in succession.",
  "publishedBy": "Konami Digital Entertainment, Inc.",
  "developedBy": "Hudson Soft Company, Ltd.",
  "released": "Oct 19, 2004",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/teenage-mutant-ninja-turtles-2-battle-nexus_",
  "visual": "2D scrolling",
  "gamePlay": "Platform, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Konami Digital Entertainment, Inc.",
          "developer": "Hudson Soft Company, Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Oct 19, 2004",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/325294-teenage-mutant-ninja-turtles-2-battle-nexus-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Austria , France , Germany , Italy , Spain , Switzerland  and United Kingdom",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/325295-teenage-mutant-ninja-turtles-2-battle-nexus-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Austria , France , Germany , Italy , Spain , Switzerland  and United Kingdom",
      "platforms": "Game Boy Advance"
    }
  ]
}