{
  "name": "Tonka On the Job",
  "shortName": "tonka-on-the-job",
  "description": "<i>Tonka On the Job</i> is a light simulation game that allows players to construct and operate vehicles based on the American Tonka franchise of toy trucks. Typical trucks such as Mighty Dump, Mighty Front Loader, Toughest Mighty, Mighty Cement Mixer, Mighty Crane and others are used in different scenarios to build foundations, dig canals, clear trees and more. Every job starts at the Tonka Garage by deploying a vehicle. The gameplay is shown from a bird's-eye view in small 2D-scrolling environments with dirt yards, cities, gravel pits and forests. Every vehicle has a specific use. For instance, Mighty Dump can carry up to four loads of dirt and can dump the load anywhere. Jobs gradually become more complex as more vehicles are available and the player has to switch between them to complete the task. For instance the Mighty Front Loader is used to pick up certain types of dirt to load it onto the Mighty Dump which can transport it more efficiently. Once deployed it is possible to switch between vehicles on the fly.<br><br>Sometimes additional tasks appear during a job with a time limit, such as unexpected fires that can be put out with the Rescue Fire Truck. Completing these is usually not required, but rewarded with bonus fuel. The performance per job is rated with up to three stars. Next to completing a job the game for instance also takes into account fuel efficiency, which is at its best if no redundant driving is done and the vehicle stays on the roads as much as possible. Later levels introduce dodging traffic. Special actions tied to specific vehicles also require more fuel. Most tasks have specific steps such as clearing, grading and constructing, but these do not always need to be completed in a fixed order. Often there are multiple approaches or solutions to get the job done.<br><br>The game can be played as a series of jobs or with freeplay for unlimited construction and destruction through deformable moments. The GBA version contains 11 trucks and the PC version 13. While the PC version has a much higher resolution with sharper graphics drawn in a different style, the content itself including the gameplay and scenarios is largely identical.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Webfoot Technologies, Inc.",
  "released": "Nov 17, 2006",
  "alsoFor": "Windows | Combined View",
  "genre": "Simulation",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/tonka-on-the-job",
  "visual": "2D scrolling",
  "gamePlay": "City building / construction simulation",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Webfoot Technologies, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov 17, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/959317-tonka-on-the-job-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title screen / Main menu"
    },
    {
      "link": "/images/shots/l/959319-tonka-on-the-job-game-boy-advance-screenshot-options.png",
      "caption": "Options"
    },
    {
      "link": "/images/shots/l/959320-tonka-on-the-job-game-boy-advance-screenshot-start-jobs-zone.png",
      "caption": "Start Jobs - Zone Select"
    },
    {
      "link": "/images/shots/l/959321-tonka-on-the-job-game-boy-advance-screenshot-job-select.png",
      "caption": "Job Select"
    },
    {
      "link": "/images/shots/l/959323-tonka-on-the-job-game-boy-advance-screenshot-getting-started.png",
      "caption": "Getting started"
    },
    {
      "link": "/images/shots/l/959326-tonka-on-the-job-game-boy-advance-screenshot-vehicle-s-special.png",
      "caption": "Vehicle's special ability"
    },
    {
      "link": "/images/shots/l/959327-tonka-on-the-job-game-boy-advance-screenshot-driving-around.png",
      "caption": "Driving around"
    },
    {
      "link": "/images/shots/l/959328-tonka-on-the-job-game-boy-advance-screenshot-remember.png",
      "caption": "Remember..."
    }
  ],
  "cover": []
}