{
  "name": "Wolfenstein 3D",
  "shortName": "wolfenstein-3d",
  "description": "<i>Wolfenstein 3D</i> is an episodic first-person shooter and a follow-up to the top-down infiltration game <a href=\"https://www.mobygames.com/game/castle-wolfenstein\">Castle Wolfenstein</a>. The game puts the player in the boots of  B.J. Blazkowicz, an allied spy. There are six episodes: the first distributed complete as shareware; the second and the third available after registration; and the three final missions (which happen before the events of the first episode) available in the Nocturnal Missions pack. <br><br>In the first episode (Escape from Wolfenstein), B.J. is captured, but overpowers a guard with the help of a concealed knife and manages to get out of his cell. Throughout the next nine levels the player guides B.J. searching for an escape from Wolfenstein, guarded by Hans Grosse. After returning to Allied territory, B.J. is given the instructions to Operation: Eisenfaust, where he has to stop Dr. Schabbs and his army of mutant prototypes before they are released into the battlefields. The final mission (Die, Führer, Die!) has a simple goal: infiltrate the bunker under the Reichstag, and terminate Hitler (in a robotic suit) himself.<br><br>The Nocturnal Missions are focused on the Nazi plans for chemical warfare, and start with Dark Secret, where B.J. hunts for lead researcher Dr. Otto Giftmacher. It's followed by Trail of the Madman, where the goal is capturing the war plans guarded by Gretel Grosse, and the final episode Confrontation, where B.J. meets General Fettgesicht, the planner for the chemical assault.<br><br>Each episode has nine levels (eight regular and a final boss level), plus a secret level activated by an hidden switch somewhere in the eight first levels. Regular levels often feature a maze-like appearance or large areas with many enemies (the number of them on each area depends on the difficulty level), where the player must reach the exit elevator. To do so, he must kill the enemies (while it's possible to move behind the guards' backs and even there's a slight bonus in attacking them from behind, most enemies have to be dealt with by fire power), and depending on the level, activate &quot;push walls&quot; and/or get silver and golden keys to open certain doors.<br><br>Many objects can be found in a level, from medikits, chicken meals, and even dog food (to restore health), ammo and treasures, which solely exist for points. There are four weapons (knife, pistol, machine gun and Gatling), all of them using the same bullets except the knife. The knife and the pistol are given at the start of the level, while the machine gun is either found (usually in secret areas) or picked up from SS troopers, and the Gatling is always dropped somewhere in the level. There are five kinds of enemies (excluding bosses) - Dogs (fast, but more a nuisance than life-threatening), Army Soldiers (dressed in regular brown outfit, not very powerful but usually found in large groups), Officers (dressed in white, armed with a very accurate pistol and tough to kill), SS Troopers (blue attire, armed with a machine gun and tough to kill), and Mutants (the rarest and toughest of regular enemies, pale-skinned troopers with green clothes and a machine gun stuck in their chest).<br><br>The player character has a number of lives; once he loses the last life, the game ends. To win extra lives, the player has to either find the 1-up item in the level or get 20,000 points (by killing enemies and capturing treasures or completing a level below the 'par' time while killing all enemies, finding all secrets by pushing walls, and collecting all treasure points).",
  "publishedBy": "BAM! Entertainment, Inc.",
  "developedBy": "id Software, Inc.",
  "released": "Apr 02, 2002",
  "alsoFor": "Acorn 32-bit, Browser, DOS, iPad, iPhone, Macintosh, PC-98, PlayStation 3, Windows, Xbox 360, Xbox One | Combined View",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/wolfenstein-3d",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "BAM! Entertainment, Inc.",
          "developer": "id Software, Inc.",
          "ported": "Stalker Entertainment",
          "country": " United States",
          "releaseDate": "Apr 02, 2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/96188-wolfenstein-3d-game-boy-advance-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/96187-wolfenstein-3d-game-boy-advance-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/96184-wolfenstein-3d-game-boy-advance-screenshot-the-german-shepherds.png",
      "caption": "The German shepherds are the weakest enemies you will encounter"
    },
    {
      "link": "/images/shots/l/96186-wolfenstein-3d-game-boy-advance-screenshot-the-gun-is-a-slow.png",
      "caption": "The gun is a slow weapon, just good enough for the first level."
    },
    {
      "link": "/images/shots/l/96182-wolfenstein-3d-game-boy-advance-screenshot-the-machine-gun.png",
      "caption": "The machine gun is a well-balanced weapon."
    },
    {
      "link": "/images/shots/l/96181-wolfenstein-3d-game-boy-advance-screenshot-the-chaingun-is.png",
      "caption": "The chaingun is the most powerful weapon."
    },
    {
      "link": "/images/shots/l/96183-wolfenstein-3d-game-boy-advance-screenshot-either-kill-or-get.png",
      "caption": "Either kill or get killed."
    },
    {
      "link": "/images/shots/l/96180-wolfenstein-3d-game-boy-advance-screenshot-pick-up-treasures.png",
      "caption": "Pick up treasures to increase your score."
    },
    {
      "link": "/images/shots/l/96185-wolfenstein-3d-game-boy-advance-screenshot-keys-enable-you.png",
      "caption": "Keys enable you to access to secured areas."
    },
    {
      "link": "/images/shots/l/610398-wolfenstein-3d-game-boy-advance-screenshot-aryan-blue-enemy.png",
      "caption": "Aryan blue enemy."
    },
    {
      "link": "/images/shots/l/610399-wolfenstein-3d-game-boy-advance-screenshot-verboten.png",
      "caption": "Verboten!"
    },
    {
      "link": "/images/shots/l/610400-wolfenstein-3d-game-boy-advance-screenshot-enemy-solution.png",
      "caption": "Enemy. Solution - tratatatatata!!!!"
    },
    {
      "link": "/images/shots/l/610401-wolfenstein-3d-game-boy-advance-screenshot-suprise.png",
      "caption": "Suprise!"
    },
    {
      "link": "/images/shots/l/610402-wolfenstein-3d-game-boy-advance-screenshot-nazi-treasure-s.png",
      "caption": "Nazi treasure's guardian"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/13589-wolfenstein-3d-game-boy-advance-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/13592-wolfenstein-3d-game-boy-advance-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Advance"
    },
    {
      "link": "/images/covers/l/189702-wolfenstein-3d-game-boy-advance-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Game Boy Advance"
    }
  ]
}