{
  "name": "World of Dragon Warrior: Torneko - The Last Hope",
  "shortName": "world-of-dragon-warrior-torneko-the-last-hope",
  "description": "<i>Torneko: The Last Hope</i> is the sequel to <a href=\"https://www.mobygames.com/search/quick?game=Torneko+no+Daib%c5%8dken%3a+Fushigi+no+Dungeon%0a\">Torneko no Daib?ken: Fushigi no Dungeon</a> and like that game, stars Torneko (aka\nTaloon), the merchant from <a href=\"https://www.mobygames.com/game/dragon-warrior-iv\">Dragon Warrior IV</a>. Having become rich and prosperous in the previous game by collecting treasures, Torneko eventually recovered the &quot;Joy Chest&quot; from the very bottom of the dungeon and had it enshrined at his shop. Peace had returned to the town for some time. After awhile, a mysterious stranger arrived and seemed concerned about the Joy Chest being outside the dungeon. At the same time, monsters started reappearing and different parts of the kingdom began turning into &quot;mysterious dungeons&quot;. It will be up to middle-aged Torneko, to fight through these strange places and help the king discover what has broken the peace.<br><br>Like other <i>Fushigi no Dungeon</i> games, <i>Torneko: The Last Hope</i> is a dungeon crawler viewed from the overhead. The dungeons are randomly generated. When venturing into dungeons, Torneko will find many items and fight monsters. He can freely move through the dungeons, but each movement or action of his is countered by those of the monsters (if they are present on screen). All actions are made in turns, so despite the illusion of walking and fighting in real time, the game is turn-based. There are all kinds of items in the dungeons including herbs which can be eaten or thrown, magic scrolls which can be read, swords and shields that can be equipped and staffs which can be waved until their charges are depleted. Players must also keep an eye on Torneko's hunger meter and eat regularly, otherwise Torneko will go into starvation and start losing hitpoints at a great rate.<br><br>There are several ways to leave a dungeon including death, an Outside Scroll, donating to a Priest or reaching the very bottom floor. When leaving the dungeon areas, Torneko's experience points and stats are lost. To make money, he must sell items he has collected from the dungeon, but may keep a couple of his items in the Storage Room for later use. Torneko's village initially starts small, but as progress in made in the game more and more services and shops will be attracted to it. Some examples of services include a Bread Baker, a Witch, a Blacksmith, a Builder and a Meldersmith.",
  "publishedBy": "Enix Corporation",
  "developedBy": "Chunsoft Co., Ltd.",
  "released": "Dec 20, 2001",
  "alsoFor": "PlayStation | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gameboy-advance/world-of-dragon-warrior-torneko-the-last-hope",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Game Boy Advance",
      "releases": [
        {
          "publisher": "Enix Corporation",
          "developer": "Chunsoft Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 20, 2001",
          "ean13": "4 988601 003568",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/162453-world-of-dragon-warrior-torneko-the-last-hope-game-boy-advance.png",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/162454-world-of-dragon-warrior-torneko-the-last-hope-game-boy-advance.png",
      "caption": "Start a new game"
    },
    {
      "link": "/images/shots/l/162455-world-of-dragon-warrior-torneko-the-last-hope-game-boy-advance.png",
      "caption": "Beginning your quest"
    },
    {
      "link": "/images/shots/l/162456-world-of-dragon-warrior-torneko-the-last-hope-game-boy-advance.png",
      "caption": "The story continues..."
    }
  ],
  "cover": []
}