{"altername_name": ["Castlevania: Rondo of Blood", "Castlevania: Rondo of Blood"], "name": "Akumajou Dracula X: Chi no Rondo", "overview": "Castlevania: Rondo of Blood (Akumajou Dracula X: Chi no Rondo) is a 2-D side-scrolling platformer with a gothic horror theme. Released in 1993, this game features the ability to save a player's progress, advances the plot via full-screen cutscenes, and utilizes CD audio tracks instead of the PC Engine's HUCard, producing a higher quality of musical audio. Set in the year 1792, you play as Richter Belmont, a vampire hunter. The dark priest Shaft has kidnapped Annette Renard, Richter's main love interest, and taken her to Castlevania along with a handful of other female victims. Wielding an ancestral whip imbued with holy powers to crush darkness, Richter heads out into the night alone to rescue the victims and deal out some justice, Belmont style. The game is divided up into multiple stages, some hidden, where the goal is to reach the end of each and (usually) face a boss monster. Along the way you may collect hearts from candles to power one of 6 different subweapons; the dagger, holy water, axe, cross, grimoire, and stopwatch. Each subweapon has a specific style of use and special \"Item Crash\" attack, which allows for an expensive but devastating super attack. Numerous hidden secrets may be found during the adventure, opening up pathways to new stages or leading to one of the four victims to rescue; one of which becomes a playable character after being freed. The victims Richter is able to rescue will affect which of the multiple endings you will see. Even if a maiden is missed, however, the player can return to any unlocked level later and take another shot at discovering any secrets they may have missed via the main menu's stage select. Rondo of Blood has great looking graphics, serves up multiple endings, plenty of secrets to discover, offers a decent difficulty level, and a delivers a quality soundtrack.", "platform": "NEC TurboGrafx-CD", "release_date": "October 29, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Konami", "publishers": "Konami", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4.61", "wikipedia": "https://en.wikipedia.org/wiki/Castlevania:_Rondo_of_Blood", "video_link": "http://www.youtube.com/watch?v=0BPn4hGmYts", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/16280-akumajou-dracula-x-chi-no-rondo\n"}