{"altername_name": [], "name": "Browning", "overview": "\"SEA SQUARE\", a gigantic man-made island on the Atlantic Ocean, an armed fortress controlled by a mysterious army. It is evident that they are developing the most evil weapon for slaughter to maintain and grasp its superiority of military power in the world. Joint forces have taken the motion for a special a action (irregular combat) and have prepared a mobile weapon \"BROWNING\", to destroy the ultimate weapon....according to the official blurb that is. Browning is a side scrolling action game that puts the player in a power suit and pits them against hordes of miscellaneous mecha with some very big guns. You walk and shoot, run and shoot and also fly and shoot, although flight time is limited due to the useless engineers failing to fit a large enough fan in your jetpack. After ploughing through a few screens of nasties, you are presented with a particularly unfriendly boss mecha who seems intent on aggressive negotiations. After quickly dispatching said boss, you are free to move on to the next level and do it all over again! You say... Browning isn’t apparently well liked in the gaming community. I have no idea about the background of this game but what I do imagine is that a lot of people might feel ripped off. The game sports maybe five generic enemies, and is only five levels long. Worse yet, most of them have the boss waiting just a few steps away from the starting point! As far as difficulty goes, the game is hard, but for the wrong reasons. Just the simple act of turning around requires a double tap of the directional button, and if you wanna run in that direction, well...let’s just say you are going to take a hit most likely. Worse, your “shield” can be fully depleted in two hits, it recharges slowly and once you lose it it’s gone and one single hit will make you explode, and force you to restart the stage with a “continue” (I don’t know if there is a limit to the continues in the game). And the rockets/jets that can make you fly real fast, even backwards, overheat constantly, so they’re not gonna be much help either. The game also does not feature any speedups or power ups/different weapon types that I know of. Overall, your worst enemy in the game will be the time limit. The first level boss can be completely destroyed by just ducking and shooting at it, but the last two levels have the tendency to have more then one boss. It’s especially heinous in Stage 4, where I pretty much had to resort to using a cheap trick and being lucky enough to fly over all the enemies in the level up to the boss without shooting them or getting hit once, and even then I had just 12 seconds to spare when I beat the two boss robots that come out once you beat the first one. Level 5 is a little less aggravating, but still, on my first try I blew the boss up 2 seconds before the end of the time limit, and before the game took note of the fact, I blew up (for some reason your employers blow you up if you don’t finish your task exactly as planned...sheesh, talk about punctuality). This is due to the fact that the final boss’s first weak points (the hands) only take damage when they feel like it. Most of the time you will just shoot at them and nothing will happen and then randomly they will start blinking when hit by your bullets for some reason. I still have no idea what that was about.", "platform": "NEC TurboGrafx-CD", "release_date": "February 7, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Riot", "publishers": "Telenet Japan", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.68", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/73060-browning\n"}