{"altername_name": ["Kawa no Nushitsuri: Shizen-ha"], "name": "Kawa No Nushi Tsuri Shizenha", "overview": "This installment in the fishing simulation series, of which the few localized games are known under the River King brand, is a hybrid between two different genres: the trademark fishing and traditional Japanese-style RPG. The simple story involves, as in many other River King games, a hero and his sister; this time, the sister was about to catch a fish that was essential for their village's prosperity, but hasn't returned. The quest for bigger fish is therefore combined with the quest for the lost sister, and the hero equips weapons and rods to aid him in both tasks... The RPG part of the game is old-fashioned for the most part, with \"world map\" navigation, dungeons, towns represented as icons, simple leveling up, etc. Random enemies (mostly animals) pop out on the world map and in dungeons; the battles are presented as simple enemy portraits, without a separate battle screen. A stand-out feature of the battles is the ability to move around a small dot and aim at the enemies' body parts; depending on where it is aimed, different amounts of damage will be inflicted. It is also possible to miss completely, with the dot wandering outside of the enemy picture. The fishing simulation part is integrated into the RPG gameplay: in towns, the player can buy fishing accessories (rods, nets, bait, etc.); on the world map, the player can navigate the character onto a river bank and start fishing using available accessories. Fish can be collected, sold, and used for a variety of purposes. A list of available fish with pictures can be viewed directly from the main menu.", "platform": "NEC TurboGrafx-CD", "release_date": "March 27, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Yuyu Co., Ltd.", "publishers": "Pack-In-Video", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106716-kawa-no-nushi-tsuri-shizenha\n"}