{"altername_name": [], "name": "Laplace no Ma", "overview": "The town Newcam, Massachusetts, 1924. On the outskirts of the town stands the Weathertop mansion. It was just an ordinary place until the last owner, Benedict Weathertop, started practicing black magic. He killed his parents and populated the mansion with all kinds of undead. Since then, nobody dared to approach the mansion. But a short while ago, two boys were found dead near this horrible place. Apparently, the boys had tried to enter the mansion. Another evidence pointed out that a girl followed them - but her body hasn't been found yet, and there is a slight hope she might be alive. This is where you, the hero of the game, decide to investigate the mystery, and to venture into the mansion... Laplace no Ma (Devil of Laplace) is a Japanese-style RPG with horror elements, somewhat similar to Sweet Home for NES. Unlike Sweet Home, this game is more oriented towards RPG gameplay. You are not stuck in the mansion, but can leave it, visit the town, and buy supplies. Later you also visit other locations such as a castle, etc. The battles are random, turn-based, and are viewed from first-person perspective. The hero of the game can recruit three other characters to the party of five available. Each character (including the hero, to whom you assign gender and class) belongs to one of the five character classes: Dilettante, Medium, Detective, Scientist, or Journalist. Dilettante is an all-around character with defensive magic, Medium is a kind of a black mage, Detective is a melee fighter, Scientist can construct powerful machines to perform various techniques, and the Journalist can take pictures of the monsters, which is the only way to gain money in the game.", "platform": "NEC TurboGrafx-CD", "release_date": "March 30, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Humming Bird Soft", "publishers": "Human Entertainment", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4.83", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106722-laplace-no-ma\n"}