{"altername_name": ["Linda^3", "Linda³"], "name": "Linda 3", "overview": "Linda³ Again is an esoteric JRPG that combines elements of psychological horror with monster collection. Neo Kenya is the name of a world that is in danger of being completely annihilated by an asteroid. The armies of Neo Kenya have searched for every conceivably way to prevent the coming catastrophe. When the inhabitants of the world turn to a dark god, their prayers and nightmares come true. The game was originally released for the PC-Engine in 1995 under the title of Linda³. Players start the game off with two characters, Linda and Ken. The story in the game is portrayed through a series of cutscenes, which for the most part are voiced. Action in the game is split up by events that show the deplorable nature of the characters in the face of impending doom. Three gameplay modes are offered at the beginning, and differ in difficulty and focus. Capturing monsters is the device used to advanced the plot. The combat in the game plays out similar to Dragon Quest. The combat is represented via text with sprites on the screen representing the enemies. As players capture different monsters, they can use them to give Linda and Ken new abilities and advance the plot. As players wander around the world collecting creatures the time in the game advances in real time. Players only have a set number of gameplay hours to bring as many creatures as possible back to the ship, or Ken and Linda will be left to die on the planet as everyone else evacuates. The game's story combines psychological elements with voodoo and the occult. The two main characters in the game are Ken, an army soldier tasked with the job of catching monsters; and his girlfriend Linda, who is used by the military as a surrogate for the god's plans. The inhabitants of the Neo Kenya called upon a god by the name of Anubis (a reference to the Egyptian lord of the underworld) in order to protect them from imminent destruction. Apparently answering their calls, the dark god sent an Ark similar to Noah's Ark. He demands that a man and a woman gather two of every animal on the planet. The army nominated Ken and Linda to achieve this task.", "platform": "NEC TurboGrafx-CD", "release_date": "October 9, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "AlfaSystem", "publishers": "NEC Home Electronics", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.17", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/113513-linda-3\n"}