{"altername_name": [], "name": "Mugen Senshi Valis: The Legend of A Fantasm Soldier", "overview": "Mugen senshi Valis also known as Valis: The fantasm soldier or Valis 1, is the first game of the Valis series, introducing the main protagonist, Yuuko Asou, and the worlds where the series takes place. Yuuko Asou starts another school day as normal. When school ends, it suddenly starts to rain, so Yuuko tries to find refuge. In doing so, she encounters a fellow student, Reiko Kirishima, who talks with her and leaves her with many unanswered questions. Inmediately afterward, Yuuko is attacked by a monster but a sword appears which she uses to protect herself. She tries to run home only to see that the entire city is being attacked by monsters. After defeating them, queen Valia appears in front of Yuuko telling her that the sword named Valis summoned her to save the dream world, Vecanti, from the claws of the evil emperor Rogles, so she can also save the human world. After being convinced by Valia, Yuuko starts to beat Rogles's generals one by one and get the phantasm jewels they carry, winning new powers. After beating them, Yuuko goes to Rogles's domains and arrives at his castle only to find that Reiko, who is under under Rogles's control, is guarding the entrance because of her dark emotions, Yuuko fights her and makes her regain consciousness but then Reiko agonizes. Before her death, Reiko tells Yuuko about her bad emotions and her hard life, believing that nobody cared about her, but Yuuko then says her that she truly cares for her and they become friends. Shortly after, Reiko dies in her hands. Then Rogles appears and challenges Yuuko to enter his castle and fight him. Yuuko does so and kills him, enraged by the death of her friend. After this, Yuuko goes home with the presentiment that she will return to Vecanti someday.", "platform": "NEC TurboGrafx-CD", "release_date": "March 19, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Riot", "publishers": "Riot", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=xmJUd_v5aTk", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/24119-mugen-senshi-valis-the-legend-of-a-fantasm-soldier\n"}