{"altername_name": [], "name": "Seiya Monogatari: Anearth Fantasy Stories", "overview": "A mysterious young woman with a baby was attacked during the Holy Night. She managed to escape, but collapsed and died in front of the church in the city of Yalem. But the baby survived, grew up, and eventually became a hero on a quest to avenge his mother's murderers and save the world. Seiya Monogatari: Anearth Fantasy Stories differs from most other role-playing games in several important aspects. The player creates the main character in a unique way: when the baby lies on the snow outside of the church, several people pass by. The player can choose to press the action button, making the baby cry and attracting the attention of these people. Depending on the timing of this \"baby action\", the hero will be adopted by different people, which make him belong to a different character class (fighter, thief, mage, or monk), and also lead to four entirely different prologues (once the hero turns fifteen, the four stories eventually merge into one). Instead of random battles - or even regular battles with wandering enemies - the game has pre-set battles, which occur much less frequently than in traditional Japanese RPGs. Winning the battles depends less on leveling-up and more on the actual tactics used during the battle. There are no levels in the game; instead, the characters gain better statistics depending on their actions during battles (e.g., using magic will increase magic power, etc.). The battles are turn-based and are viewed from a side-scrolling perspective. The game focuses on exploration, having large and complex locations as well as plenty of items of different categories that can be found if the player explores the game world properly.", "platform": "NEC TurboGrafx-CD", "release_date": "December 22, 1995", "game_type": "Released", "esrb": "Not Rated", "developers": "Media Works", "publishers": "Hudson Soft", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2.75", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106828-seiya-monogatari-anearth-fantasy-stories\n"}