{"altername_name": [], "name": "Super Darius II", "overview": "Super Darius II takes place sometime after the first Darius game. The colonized planet Darius is recuperating from its invasion from the alien Belser Army thanks to that game's heroes Proco and Tiat. Darius' inhabitants have since situated themselves on the planet Olga while Darius' societies, architecture and attacked areas were being repaired. The space flight Headquarters established on Olga picks up an SOS signal coming from Earth, where the first colonists originated before colonizing Darius. The signal included the description of alien ships similar to those of the Belser Army. Suspecting that these might be their remaining Earthling ancestors, the people of Darius sends both Proco Jr. and Tiat Young to help them. The Super CD-ROM version features an entirely new set of bosses, major changes to levels, and a fully arranged soundtrack including new songs. The game is set in the inner half of the solar system, and has the same branching level structure as Darius. The red/green/blue powerups from the first game return, and have the same function: respectively, upgrades to the \"missile\" main weapon and \"bomb\" subweapon, and a shield to absorb some damage. Two new power-ups were added: a yellow powerup that adds a new \"laser\" main weapon that functions somewhat similarly to the bombs, and a rainbow powerup that grants one upgrade to all the players weapons. Actually acquiring these powerups and the upgrade path is completely different from Darius: a formation of a specific enemy must be completely destroyed (and a given formation may not have a powerup), and every single powerup now grants some kind of upgrade. Further, the various weapons upgrade differently, though the shield upgrade the same as before. Another new feature in Darius II is the appearance of minibosses known as \"captains\"; large enemies that appear somewhere in the level before the main boss. In Darius II, these are all smaller versions of bosses from the first game, with similar abilities.", "platform": "NEC TurboGrafx-CD", "release_date": "December 23, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "A Wave", "publishers": "NEC Avenue", "genres": "Shooter", "max_players": "1", "cooperative": "No", "rating": "4.34", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/27341-super-darius-ii\n"}