{"altername_name": [], "name": "Tadaima Yuusha Boshuuchuu", "overview": "Tadaima Yūsha Boshūchū is a semi-humorous title that incorporates elements of role-playing and strategy board game. The game is set in a medieval fantasy land populated by various races; when the country is overrun by demonic invaders, the king cowardly avoids responsibility and puts the task of liberating it into the hands of a group of heroes. Four players (human or AI-controlled) select their characters, each representing an exotic race, and take them on a quest to free the land. Navigation is done in a board game style; each of the players rolls dice, which determines the amount of moves the character can make. Characters belong to different classes and have unique attributes, abilities, hit and magic points, etc. In towns the characters can rest, purchase magic spells of various levels and elemental disciplines, buy items, and hire companions in bars. These companions also come in many varieties (magic users, monks, barbarians, etc.), and it is necessary to create a balanced party with spellcasters, healers and physically tough characters to prevail. Fields the characters land on may lead to random events such as stats and money increase, as well as battles. The latter are handled in traditional Japanese-style, turn-based RPG fashion, viewed from a Final Fantasy-like perspective. The player inputs commands (attack, magic, item, etc.) until the enemies are defeated, at which point battle spoils are acquired. Towns are often overrun by tougher enemies and can be liberated by vanquishing them. Should two player-controlled parties meet each other on the same field, they can opt to fight each other.", "platform": "NEC TurboGrafx-CD", "release_date": "November 26, 1993", "game_type": "Released", "esrb": "", "developers": "Human Entertainment", "publishers": "Human Entertainment", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106858-tadaima-yuusha-boshuuchuu\n"}