{"altername_name": ["Atlas, The: Renaissance Voyager", "The Atlas"], "name": "The Atlas: Renaissance Voyager", "overview": "The Atlas is a multiplatform strategy/simulation video game developed by Artdink Development. The game is set during the Age of Discovery in the 15th century. There is a strict time limit of five years to discover mysterious lands that are 1,000 miles or 1,600 kilometres south of Portugal. Players can work for an admiral and can either change employment or even retire. Specialized names for the adventures, along with their characteristics and every kind of information possible is synthesized by the combination of certain attributes. The topographic features are created completely by random by a method of biosynthesis. Elements of war and plague affect the political stability in each of the game's regions. As the years progress in the game, trade and exploration play a role in impacting the in-game economy. Procurement, pestilence and contagious diseases are created through trade; decreasing the number of residents that reside in that particular town or city. These factors may also lead to the loss of vital trade ships. A contingent of information is used in order to enhance the illusion of being taken home. The map in the game is basically close to that of the parts of the Earth that were known in the 15th century. Encyclopedias can be found in the cities in addition to world maps and local specialties. Even animals can be found in the in-game towns. Strange life forms and primitive civilizations are randomly distributed on the map, they are described in the encyclopedia that covers the entire in-game universe. The truths that are accidentally synthesized will also players to get a mysterious world consisting of fictional things. The grotesqueness and strange phenomena can actually been seen and experienced.", "platform": "NEC TurboGrafx-CD", "release_date": "March 4, 1994", "game_type": "Released", "esrb": "Not Rated", "developers": "ArtDink", "publishers": "ArtDink", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "2.5", "wikipedia": "https://en.wikipedia.org/wiki/The_Atlas_(video_game)", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/100399-the-atlas-renaissance-voyager\n"}