{"altername_name": ["Ultra Box 2-gou"], "name": "UltraBox 2-gō", "overview": "The second installment in the Ultrabox game magazine-on-CD series contains the following mini-games: A continuation of Kamen Victor's adventures from the previous issue, this time not as a side-scroller, but as a top-down motorcycle driving game. The player collects hearts for speed boosts and has to avoid yakuza gangsters while trying to complete stages within limited time. The opening chapter of Cusuto, a story that deals with mysterious crystals left on the Earth by aliens, and focuses on the discovery of one of them by the archaeologist Royce E. Grant and his daughter. The game consists mostly of animated voiced cutscenes, with a very brief first-person dungeon exploration during which the player decides in which direction to go. A puzzle game that involves knocking down \"daruma\" dolls (so named as they originally depicted the famous Buddhist monk Bodhidharma), trying to trick the AI-controlled opponent into being left with only one doll in each column. A dating simulation game in which the player character meets three young women in a bar and has to choose the correct dialogue options in order to pursue a relationship. In addition, this volume contains the semi-interactive Mission School, which allows viewing Japanese uniformed schoolgirls with different backgrounds, previews of upcoming PC Engine games and a detailed database of existing ones, further astrological exploits with wrestlers (this time depicted with graphics rather than digitized photos), as well as a miscellaneous section with fan drawings.", "platform": "NEC TurboGrafx-CD", "release_date": "September 28, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Fun Project", "publishers": "Victor Musical Industries", "genres": "", "max_players": "", "cooperative": "No", "rating": "1.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114760-ultrabox-2-go\n"}