{"altername_name": ["Ultrabox Soukan Go", "Ultra Box Soukan-gou"], "name": "UltraBox", "overview": "UltraBox opens the line of game magazines released in a CD format exclusively for the PC Engine (TurboGrafx) console. The first volume contains the following mini-games: A very simple side-scrolling action game entitled Kamen Victor, in which the player character moves automatically, the player pressing the action button to jump, hitting enemies and avoiding hazards. UB64, a one-screen puzzle game in which the player has to move orbs on a grid diagonally by jumping over each other (similarly to checkers) and bringing them to the middle of the board. A mini-game in which the player has to rapidly press a button to take a picture of a woman. Depending on the player's skill, the woman will be photographed fully dressed, in revealing clothes, semi-naked, or as a skeleton. A virtual tour through the Harajuku area in Tokyo, which includes dating a young woman by selecting locations to travel to from a map. Another simple dating game, this time with an educational angle: the protagonist, aptly named Turbo Honda, meets a woman from New York and has to win her affection by selecting dialogue options in English. Bombtown Story, a digital comic taking place in an alternate universe reminiscent of \"film noir\" 1930's setting, but with all the characters being humanoid crocodiles. A love story develops as the player has to make a few decisions to affect the plot. Another digital comic, describing an ordinary man's desire to succeed as a jockey; player's interaction is restricted to a few occasions. In addition to games, the volume contains astrological speculations presented by a Japanese wrestler, a love horoscope, previews of upcoming PC Engine titles and a detailed catalogue of existing ones, a Japanese \"idol\" database, and a miscellaneous section with fan photos and drawings.", "platform": "NEC TurboGrafx-CD", "release_date": "June 15, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Fun Project", "publishers": "Victor Musical Industries", "genres": "", "max_players": "", "cooperative": "No", "rating": "3.5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114754-ultrabox\n"}