{"altername_name": ["Ultra Box 3-gou"], "name": "UltraBox 3-gō", "overview": "The third issue of the CD ROM game magazine for PC Engine contains the following mini-games: The Kamen Victor saga continues: this time, the brave hero pilots a flying motorcycle through side-scrolling shooter stages, complete with boss enemies and heart-shaped power-ups that enhance his defense. The second chapter of the retro-sci-fi tale Cusuto, which began in the previous installment. The protagonist in this chapter is a young man named Gilbert, who meets Royce and his daughter on his journey. The number of full-screen cutscenes has been greatly reduced, and the gameplay expanded to resemble a Japanese-style adventure with menu-based verb-object commands. The wrestler Rusher Kimura returns with his zodiac horoscope, which this time contains within a monopoly-like board game for up to four players. Players select wrestlers with different statistics and navigate them on a board with dice rolls. Various encounters alter their attributes and wealth, and some lead to battles, which involve selecting cards with attack and defense ratings written on them; having a higher rating results in inflicting damage on the opponent. In the dating game UB Club the player meets a young woman on a party, and has to select the right conversation choices in order to raise her \"love meter\" and successfully conclude the romance. Making of Dorayaki Quest is a simple game with humorous overtones, in which the player has to make the correct decisions in order to successfully produce a video game. Reverse 3 is a puzzle game. Red and blue squares appear on a board, and the player has to flip them in order to make adjacent squares change the color. The goal is to change all of the squares to the same color. Three stages of different sizes are included. Princess of PC Engine contains information about female characters from PC Engine games, e.g. the heroines of Valis series, Saya from Cosmic Fantasy, Tsunade from Tengai Makyō: Ziria, and others. This section also includes a sliding puzzle, a slot machine game (leading to another database in case of success), and a quiz that measures the player's affinities with the characters. Like in the previous installment, a detailed PC Engine game catalogue (with previews) and a section containing fan photography and drawings is includes.", "platform": "NEC TurboGrafx-CD", "release_date": "December 26, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Fun Project", "publishers": "Victor Musical Industries", "genres": "", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114800-ultrabox-3-go\n"}