{"altername_name": ["Ultra Box 5-gou"], "name": "UltraBox 5-gō", "overview": "The fifth volume of the UltraBox series contains the following mini-games: The retro sci-fi story Cusuto with its basic Japanese-style adventure gameplay concludes in this volume, depicting further adventures of Royce E. Grant and his friends as they encounter a mysterious alien crystal. The dating game is very similar to the one from the third installment; it is set in modern times and has the player selecting correct choices in order to raise the \"love level\" of three Japanese young women encountered on a beach and represented by digitized photos of actresses. The nearly-hentai sports game from the previous entry returns, featuring the same girl, but with a different activity: hurdling. The girl runs automatically; the player presses a button to make the girl jump over a hurdle, or directional arrows to slow down or speed up. Colored balloons float above the track; touching red ones increase the number of hurdles needed to complete a stage, while the opposite happens if a blue balloon is touched. The girl undresses after each stage, and runs topless in the last one. Dasaiyas is a horizontally scrolling shoot-em-up in which the player character flies on a board through Asian-looking urban stages, shooting at enemies with the basic weapon or dropping limited amounts of bombs. Each stage ends with a boss battle against fish-like spaceships. Tororo is a choose-your-own-adventure game where the protagonist wished to become an anime artist. The player can either go to a school or directly to a company's boss, depending on the player's choice. Further plot development is also influenced by the player's decisions. Two digital comics, one dealing with the life of an angel-like creature in heavenly spheres, and the other involving buying video games and playing them at home, evolve in accordance with the player's occasional input. Like in all the previous installments, a PC Engine game database and an art section with fan drawings are available.", "platform": "NEC TurboGrafx-CD", "release_date": "September 27, 1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Victor Musical Industries", "publishers": "Victor Musical Industries", "genres": "", "max_players": "1", "cooperative": "No", "rating": "5", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114802-ultrabox-5-go\n"}