{"altername_name": ["Ultra Box 4-gou"], "name": "UltraBox 4-gō", "overview": "The fourth installment of the CD ROM game magazine series contains the following mini-games: The retro sci-fi tale with minimalistic Japanese-style adventure gameplay, Cusuto, continues, as Royce E. Grant, his daughter, and Gilbert are searching for the mystical alien heritage, trying to evade the hostile military forces. Fone is a simple top-down role-playing game in Japanese style. The player controls a party of three characters, who are sent by the king to vanquish a newly reborn evil with the titular magic power. Automatic leveling up, equipment, random enemies, and first-person-view turn-based combat are all present. The dating game is this time set in the Edo period of the Japanese history, and has somewhat more extensive gameplay with location and conversation choices. The goal is the same as before: raise the \"love meter\" of a woman in order to fulfill a romance. Nobunaga no Yarō (which can be translated as \"The Jerk Nobunaga\"; an obvious pun on Nobunaga no Yabō) is a puzzle game very similar to UB64 from the first volume. The player has to move soldiers on a field in a checkers-like pattern (jumping over other soldiers diagonally) to make an army advance. A jumping rope game in which the player has to press a button at the correct time so that the girl won't trip on the rope. A bird is flying above the girl's head, dropping what appears to be excrements on her; if she is hit by those, the amount of rope-skipping needed to complete the stage increases. To avoid this predicament, the player can also press directional buttons to move the girl around. When on the ground, the unsavory objects turn into power-ups. The girl removes an item of her clothes after each successfully completed level, until she begins to jump naked. A simple stationary first-person shooter game, in which the player has to shoot a young woman who is trying to capture various wild animals. Shooting the animals, on the other hand, gradually leads to a Game Over. The woman undresses after each level. Like in the previous volumes, a detailed database of PC Engine games is included along with previous of upcoming releases. Miscellaneous section now also includes short digital comics along with pictures and other information.", "platform": "NEC TurboGrafx-CD", "release_date": "May 24, 1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Fun Project", "publishers": "Victor Musical Industries", "genres": "", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/114801-ultrabox-4-go\n"}