{"altername_name": ["ヴァリスⅢ"], "name": "Valis III", "overview": "Mugen senshi Valis III (夢幻戦士ヴァリス''Ⅲ, Mugen Senshi Varisu suri), also known as Valis III, is the third game installment of the Valis series. The game shows Yuuko's new adventure along her new companions: Valna and Cham. Story Long time passed since Yuuko's last battle. Yuuko's life seems peaceful but, meanwhile, the Dark world starts to get menaced to become disappeared in the void. So Its king, Glames, decides to take other worlds by force in order to keep the inhabitants from his world alive. But some of the dark world people oppose to the idea of using the force to take the worlds, so Glames starts to dispose them. As a consequence, a girl from the resistance of such world, Cham, decides to go to the human world and search for the Valis sword to use It against Glames who, in turn, posseses the counterpart of the Valis sword, the Leethus sword. After taking the sword, Cham tries to go back to the dark world but Yuuko stops her to find out why she wants her sword only to see the girl kidnapped by one of Glames's generals. After Yuuko beats him, Cham is freed an tells the Valis warrior about the situation and that Vanity is being invaded by Glames's army. Without wasting time, Yuuko and Cham make their ways to the dream world to see It in chaos due to the dark king's intromission as they find out that Valna has been also kidnapped by other of the generals. The heroines make their way to Valna and freed her. She then fights and beats her captor, then she says Yuuko to go to the temple where the widsom man, Nizetti, can give her the Valis armor's ultimate form unleashing all of Valis sword's power. Meanwhile, a strange figure allies with Glames. The three girls go there passing terrible tests and obstacles finally meeting with Nizetti who warns them that although having the sword's full power, Yuuko maybe won't win against Glames, but aside of all negative pronostics, she still decides to use the power. After doing so, they make their way to the dark world to confront Glames, not before getting onto the death world to find an awful surprise, the figure that allied with Glames reveals itself as Rogles, the antagonist from the first game who was supposed to be dead. He fights Yuuko and gets deffeated once again by her. The way continues as the protagonist fight Zalude and Asura. After his defeat, Asura reports them that Glames isn't on the dark world anymore and that he made his way into the human world showing that his generals were only making time for him to approach there. Yuuko and her allies part to the human world to find Glames's tower, they manage to get inside and Yuuko finally fights him. In the end, Glames expresses his last will to his opponents to maintain alive the dark world's inhabitants and to guard the Leethus sword, he dies minutes later. Yuuko then says to Cham and Valna to protect the survivors and goes to the sky with the two swords. She stays there guarding the two swords...apparently forever.", "platform": "NEC TurboGrafx-CD", "release_date": "September 7, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Shin-Nihon Laser Soft", "publishers": "NEC Home Electronics", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.86", "wikipedia": "https://en.wikipedia.org/wiki/Valis_III", "video_link": "https://www.youtube.com/watch?v=1zJoRvwnnX0", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9631-valis-iii\n"}