{"altername_name": [], "name": "Valis IV", "overview": "Mugen Senshi Valis IV (夢幻戦士ヴァリスIV, Mugen senshi Varisu fou) – also known as Mugen Senshi Valis 4: Akai Tsuki no Otome, Super Valis IV or Valis 4 – is the last of the main Valis series games. This game's events happen 15 years after those of Valis III and introduce a new protagonist: Lena Brande. Story Hundreds of years ago, the king Asfal from the Dark World had a son, Galgear, who was driven insane by the power of a ring that he inherited from his father, causing wars and widespread destruction in order to make that power grow constantly. Consequently, the gods imprisoned Galgear and his followers in a giant crystal and sank it under the seas. Many centuries have passed and the crystal emerges to the surface once again with Galgear and his army broken free, bringing an end to the short-lived era of peace enjoyed by Vecanti after Glames' defeat in Valis III. With his reign of chaos reestablished, Glames takes over Vecanti and starts to take over the human world also. Galgear then kidnaps Vecanti's current queen, Valna, and prepares her execution. Meanwhile, a resistance force in the dream world led by Cham tries to fight Galgear's regime but this seems to be useless. Lena, a member of the resistance, decides to rescue Valna along with her sister Amu. Although Cham isn't in accordance with her, she hears Yuuko's voice telling her to let Lena go. Having no other option, Cham teaches them some basic things and then stays behind in Vecanti guarding the city and the survivors. Lena and Amu manage to infiltrate Castle Vanity and defeat the first of Galgear's generals, Dhalgen. Then they find Valna and try to rescue her just to be stopped and injured by Galgear himself, meeting him personally for the first time. Just as he is going to deal the heroines the final blow, they are teleported away by a stranger who reveals himself to be Asfal, Galgear's father himself, who also wants to stop his son's evil regime. He tells Lena that the only thing that can defeat his son is the Valis sword, which isn't in this world anymore, and that they have to reach Valhalla in the sky in order to obtain It from Yuuko, the most recent Valis warrior and current guardian of the sword. After overcoming many obstacles, they meet Yuuko who warns Lena about the things she will have to live as a Valis warrior by showing her memories and asks if she still wants to become a Valis warrior. Lena answers decidedly that she will accept that destiny if she can save the three worlds from Galgear. Yuuko then tests her with satisfactory results and gives her the Valis sword and thus the Valis armor. Afterward, the three protagonists make their way into the human world to reach the giant crystal Galgear uses as his base. After beating many of his henchmen and his last two generals, they find Galgear trying to kill Valna once again. It seems to be too late to save her, but Amu steps in front of Galgear's axe throw, saving Valna's life but being mortally injured. Asfal releases Valna and holds off his son while Amu dies in her sister's arms. Lena then addresses Galgear, saying that she will put an end to him once and for all. Galgear challenges her to come and fight him in his lair, the red moon, where Asfal lived when he was king. Lena and Asfal open a path to the red moon where they fight Galgear, defeating him sucessfully. Asfal and Galgear apologize to each other respectively for all that has happened, after which Galgear dies in the arms of his father. Lena then goes to Amu's grave to pay her last respects and starts to walk toward the horizon, asking herself what will await in the future.", "platform": "NEC TurboGrafx-CD", "release_date": "August 23, 1991", "game_type": "Released", "esrb": "Not Rated", "developers": "Shin-Nihon Laser Soft", "publishers": "NEC Home Electronics", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.81", "wikipedia": "", "video_link": "http://www.youtube.com/watch?v=QZKZaLS-pn4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18270-valis-iv\n"}