{"altername_name": [], "name": "Valis II", "overview": "Mugen senshi Valis II (夢幻戦士ヴァリスⅡ, Mugen Senshi Varisu ni), Also known as Valis II, is the second main game from the Valis series. The game tells the events that happen after the first Valis game, revealing more reasons about why Yuuko was choosen to fight for the three worlds. Story Some time after the death of Rogles and Yuuko returned to her home in the human world, Vanity is tormented once again by a war between the new candidate to the dark world throne, Megas, Rogles's younger brother; and the resistance formed by the survivor soldiers from Rogles's army. For that reason, Reiko (already dead) appears as an illusion to tell Yuuko to go to the mentioned world and then to inform her about Megas. As result of the war, the human world becomes endangered as Yuuko fights against Rogles generals who want the power of the Valis sword to end with Megas's menace. After beating them, Yuuko goes to Valia's castle only to fight Megas's Army and a dead Valia who was apparently killed by Megas himself. In the mid of the dramatic situation, after this, the servants of the castle tell Yuuko that she is one of Valia's daughters and that her younger sister, Valna, lived in the castle with Valia while Yuuko was send to the human world. Seeing the gravity of the situation, they give Yuuko a new sword and armor: the Leethus sword and the Leethus armor. She goes to Megas's domains fighting more of his generals to finally infiltrate in his technologic tower base and reaches the emperor. After his defeat, Megas tells Yuuko that he, contrary to Rogles's resistance, wanted to destroy the Valis sword because he was afraid that its power would make him fall like it did with his brother Rogles. He starts to relate the story of how he became the dark emperor is. He was going to inherit the darkworld throne long ago from the hands of his father, Kaiza. But Rogles got jealous and made a scheme to kill Megas so he could became the darkworld's next king. Megas survived but had to repleace many of his body parts with machinery. Later he discovered that the one behind that conspiracy wasn't Rogles but Kaiza himself who, when discovered by Megas, banished him to a dimensional abyss from where he remained a long time growing a hatreness for his brother and his father. That's why he wanted to finish Rogles army's remains and dominate Vecanti. After Megas dies in her hands, Yuuko goes to Vecanti once again to be sure that her sister is safe and then returns to the human world once again, not before knowing that Valna is decided to fight by her side from there on.", "platform": "NEC TurboGrafx-CD", "release_date": "June 23, 1989", "game_type": "Released", "esrb": "Not Rated", "developers": "Shin-Nihon Laser Soft", "publishers": "NEC Technologies", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.92", "wikipedia": "https://en.wikipedia.org/wiki/Valis_II", "video_link": "http://www.youtube.com/watch?v=If7G441oQ78", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9630-valis-ii\n"}