{"altername_name": [], "name": "Virgin Dream", "overview": "A \"Pretty Girl Contest\" is held, which is more than just a regular beauty competition: within a year, a young girl should become a star. Beauty matters, but so does skill. As the manager of one of the young girls who wants to participate in the contest, the player has to do everything in his/her power to attain the goal, and help the disciple reach stardom! Virgin Dream is what is commonly called life simulation, a genre popularized by games such as the Princess Maker series. The player manages the life of the young girl with a specific goal in mind, which must be chosen from the main menu. The girl can strive to become a singer, a photo model, a school teacher, etc. The player then tries to alter her statistics accordingly to achieve the goal. The main activities on work days are divided into three groups: training, working, and learning. The learning category is the smallest one, but is also necessary for continuing the girl's normal school life. Training includes singing, arts, body building, sports, etc. Part-time jobs such as waitress, cook, private tutor, and even construction worker are available; the pay varies greatly, but so are the changes in parameters. On holidays, the girl is able to venture outside and explore the top-down city, which contains various shops, boutiques, offices, etc. Clothes and other accessories can be purchased. It is also possible to talk and bond with other girls, potential rivals, who live in the same dormitory. All this influences the heroine's parameters, for good and for bad.", "platform": "NEC TurboGrafx-CD", "release_date": "May 31, 1996", "game_type": "Released", "esrb": "", "developers": "C-Lab", "publishers": "Tokuma Shoten Intermedia", "genres": "Construction and Management Simulation", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106878-virgin-dream\n"}