{"altername_name": [], "name": "Yokoyama Mitsuteru Shin Sangokushi: Tenka wa Ware ni", "overview": "Tenka wa Ware ni is based on the Sangokushi manga by Mitsuteru Yokoyama, itself an adaptation of Eiji Yoshikawa's re-telling of the classic Chinese novel Romance of the Three Kingdoms by Luo Guanzhong. As such, the game includes plot elements and a few characters added by Yoshikawa or Yokoyama, but for the most part remains faithful to the general storyline of the Chinese novel and hence to the actual historical events of the Three Kingdoms Era. The gameplay is similar to that of Koei's Romance of the Three Kingdoms series, focusing on grand strategy and country management as well as on tactical battles. There is no scenario selection, but the player can choose between multiple warlords of the three kingdoms. The player then manages the province under control of the selected warlord. It is necessary to take care of the population and army, buying provisions, training officers, and publishing edicts. Diplomacy plays an important role: pacts and agreements can be made, and it is also possible to acquire new allies through various means. Invading (or being attacked by) another country leads to a large-scale tactical battle that takes place on hexagonal grids. The player navigates army divisions in turn-based fashion. Contact with an enemy division leads to yet another sub-mode, where the player controls units that form the division, positioning and navigating them on a smaller battle screen. The game also has a separate battle mode accessible from the main menu, where the player can recreate historical battles directly without going through grand strategy portions.", "platform": "NEC TurboGrafx-CD", "release_date": "November 20, 1992", "game_type": "Released", "esrb": "", "developers": "NAXAT Soft", "publishers": "Naxat Soft", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106833-yokoyama-mitsuteru-shin-sangokushi-tenka-wa-ware-ni\n"}