{
  "name": "Black/Matrix Advanced",
  "shortName": "blackmatrix-advanced",
  "description": "<i>Black/Mtrix Advanced</i> is an enhanced version of <a href=\"https://www.mobygames.com/game/blackmatrix\">Black/Matrix</a>. The game is set in a world which is controlled by demons, who have defeated the angels after a prolonged war. You control Abel, an angel who serves a female demon master (which you choose among several available characters in the beginning of the game). You and your master develop deep feelings for each other, but then your master disappears, and you decide to find her at all costs.<br><br>The Dreamcast release comes on 2 GDs (instead of the single CD of the original), and features many anime-style cutscenes that were not included in the Saturn version. Also, the story cutscenes which happen after the battle don't use the isometric battle engine any more, but are viewed from first-person perspective, with character portraits occupying a large portion of the screen. Other differences include the addition of two scenarios (12 instead of the original 10), a new difficulty level (Easy), different art for character portraits, several changes in battle locations, and new plot details.",
  "publishedBy": "NEC Interchannel, Ltd.",
  "developedBy": "Flight-Plan Inc.",
  "released": "Sep 29, 1999",
  "alsoFor": "",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/blackmatrix-advanced",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "NEC Interchannel, Ltd.",
          "developer": "Flight-Plan Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 29, 1999",
          "ean13": "4 513244 900273",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}