{
  "name": "Blue Stinger",
  "shortName": "blue-stinger",
  "description": "In the year 2000, a massive earthquake hits the Yucatan Peninsula region of Mexico, sending shockwaves throughout the area. A large, unknown island emerges from the depths of the ocean bordering this land with what appears to be a giant crater located near its center. American and Mexican government officials cordon off this new landmass and dispatch an investigative task force to the island. It is determined that the crater was created by the impact of the giant meteor that crashed into the Yucatan 65 million years before, wreaking havoc upon the Earth's ecosystem and bringing about a nuclear winter so devastating that it pushed the dinosaurs, the dominant land-dwelling lifeforms of the time, to complete extinction. Thus the island is named Dinosaur Island. Highly classified research of the island, the crater and what lies within it goes on for 17 years while a city is built to house and accommodate the researchers and workers. This research and the island's economy are dominated entirely by a large biotech corporation known as Kimra.<br><br>Eliot Ballade, an elite member of Kimra's Dinosaur Island ESER (Emergency Sea Evacuation and Rescue), is enjoying a day off aboard his friend's boat a short distance from the coast when suddenly a small meteor falls from the sky and descends toward Dinosaur Island. At the moment of impact, a mysterious dome of energy appears from the center of the island, expanding outwards at an astonishing speed towards Eliot's position. Just as the dome of energy approaches, a flock of hideous birds ram straight into the boat, causing Eliot to hurtle himself overboard just before the energy dome overtakes the boat, seemingly petrifying his friend still onboard. Hours later, Eliot awakens on the shore of Dinosaur Island and begins an investigation that will change his life forever. He begins to discover an uncontrollable madness unleashed in the meteor's wake, and as one secret uncovers another, he pieces together a horrifying revelation that could lead to the end of life on Earth.<br><br>The player controls rescue expert Eliot Ballade, or heavy weapons specialist Dogs Bower, as they wield hand-to-hand moves and 22 weapons in an adventure that will require them to swim, drive, climb, fight and blast through seven areas and 230 locations; solving puzzles, avoiding hazards and discovering and using up to 75 items, such as security cards and life ropes. The player can switch between the 2 characters at any time to utilize their different skills to their advantage: Eliot being able to handle 2 weapons at a time, swim and move quicker; Dogs being able to equip heavier weapons and last longer in a fight with his higher constitution. Along the way, the player will encounter certain situations where they will have the chance to rescue someone or perform some other task, usually receiving a new weapon or item upon completion; however, the game will go on even if the side-mission is not successful. The player will be aided by Kimra-Tech Security agent Janine King and the mysterious angel-like entity referred to as Nephilim as they battle mutated monsters and solve the mysteries of Dinosaur Island.<br><br>Blue Stinger controls much like most Survival Horrors of the time, but plays more like a straight-up Action title with Adventure elements. The player is encouraged to engage the enemies encountered, as not only do they drop coins which can be used to purchase health packs, new weapons and ammo; but they respawn upon re-entry of most locations, allowing for a technically infinite number of coins to be collected, and thus health and ammo. Even when the player does find themselves out of ammo, Eliot can equip himself from a number of unlimited-use melee weapons that are just as powerful as the ranged ones. Health packs, taking the form of food and drinks, must be used in realtime, the player having to ensure the safety of their character while the eating or drinking animation plays out. Though limited in scope, the island is fully open to explore and requires some backtracking as new items are found or developments are reached, as the player advances through a story progressed in game-engine cutscenes and radio chatter between Eliot, Dogs and Janine. Bosses are encountered regularly, some being stronger versions of more commonly-encountered enemies and playing out much like tougher battles with those; while others are unique and require the player to determine their behaviors and patterns to defeat them. Puzzles are mostly of the minor, find-the-item and use-it-in-the-right-place variety. Though environmental hazards appear in a number of locations, the game does not delve into Platformer territory as the actions required to pass these sections are either as simple as navigating around them or context-sensitive to the particular situations.<br><br>The Japanese version of the game featured a camera system that employed cinematic angles and perspectives intended to provide a more suspenseful experience. This system, however, was met with a negative critical reaction by some and was revamped by Activision into a behind-the-back third-person angle a-la Action-Adventure games for the US and European releases.",
  "publishedBy": "Activision, Inc.",
  "developedBy": "Climax Graphics",
  "released": "Sep 07, 1999",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Regional differences",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/blue-stinger",
  "visual": "",
  "gamePlay": "Fighting, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Activision, Inc.",
          "developer": "Climax Graphics",
          "ported": "",
          "country": " Italy, Spain, United Kingdom",
          "releaseDate": "1999",
          "ean13": "5 030917 009341",
          "comments": ""
        },
        {
          "publisher": "SEGA Enterprises Ltd.",
          "developer": "Climax Graphics",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 25, 1999",
          "ean13": "4 974365 500030",
          "comments": ""
        },
        {
          "publisher": "Activision Deutschland GmbH",
          "developer": "Climax Graphics",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Sep, 1999",
          "ean13": "5 030917 009365",
          "comments": ""
        },
        {
          "publisher": "Activision, Inc.",
          "developer": "Climax Graphics",
          "ported": "",
          "country": " Italy, Spain, United Kingdom",
          "releaseDate": "1999",
          "ean13": "5 030917 009341",
          "comments": ""
        },
        {
          "publisher": "Activision, Inc.",
          "developer": "Climax Graphics",
          "ported": "",
          "country": " Italy, Spain, United Kingdom",
          "releaseDate": "1999",
          "ean13": "5 030917 009341",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/17436-blue-stinger-dreamcast-screenshot-title-screen.jpg",
      "caption": "Title Screen"
    },
    {
      "link": "/images/shots/l/17437-blue-stinger-dreamcast-screenshot-elliot.jpg",
      "caption": "Elliot"
    },
    {
      "link": "/images/shots/l/17438-blue-stinger-dreamcast-screenshot-walking-along-the-dock.jpg",
      "caption": "Walking Along the Dock"
    },
    {
      "link": "/images/shots/l/17439-blue-stinger-dreamcast-screenshot-a-monster.jpg",
      "caption": "A Monster"
    },
    {
      "link": "/images/shots/l/17440-blue-stinger-dreamcast-screenshot-energy-restoring-hassy.jpg",
      "caption": "Energy Restoring Hassy"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/233131-blue-stinger-dreamcast-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/190099-blue-stinger-dreamcast-inside-cover.jpg",
      "scanOf": "Inside Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "Dreamcast"
    },
    {
      "link": "https://www.mobygames.com/images/covers/l/190100-blue-stinger-dreamcast-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/357235-blue-stinger-dreamcast-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/357236-blue-stinger-dreamcast-spine-sides.jpg",
      "scanOf": "Spine/Sides",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/233132-blue-stinger-dreamcast-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United States",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/8097-blue-stinger-dreamcast-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Italy , Spain  and United Kingdom",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/8098-blue-stinger-dreamcast-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Italy , Spain  and United Kingdom",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/63529-blue-stinger-dreamcast-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Italy , Spain  and United Kingdom",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/116554-blue-stinger-dreamcast-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Germany",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/116555-blue-stinger-dreamcast-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Germany",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/116556-blue-stinger-dreamcast-media.png",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Germany",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/6142-blue-stinger-dreamcast-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/6143-blue-stinger-dreamcast-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/74785-blue-stinger-dreamcast-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "Japan",
      "platforms": "Dreamcast"
    }
  ]
}