{
  "name": "Gundam Side Story 0079: Rise from the Ashes",
  "shortName": "gundam-side-story-0079-rise-from-the-ashes",
  "description": "<i>Gundam Side Story 0079: Rise from the Ashes</i> is a mech combat simulation set in the Gundam universe. Created to celebrate the 20th anniversary of the franchise, it presents an original story set during the One Year War between the Earth Federation and Zeon, parallel to the events of the first Gundam TV series. It takes place in Australia and stars the mobile suit team White Dingo, a guerrilla combat unit supporting the main forces of a Federation counteroffensive against the Zeonic forces.<br><br>The player controls Lt. Rayer, who along with his team mates Leung, Mike and Anita must fight Zeon in nine missions. Before each mission, briefings from Commander Hawkins and messages from the teammates are shown as FMV sequences. The squad of three mobile suits (Anita controls the OASIS hover truck) must be outfitted by choosing suits, weapons, and shields. Two suits are available from the start: RGM-79 and RGC-80, with the RGC more heavily armed and armored at the cost of reduced mobility. Further suits become available for special mission objectives later in the game. The choice of weapons includes various projectile and beam weapons, along with rocket launchers and grenades. Weapons differ in ammo (some have unlimited shots, others have magazines and thus a short reloading time), range and power.<br><br>Missions are seen from a first-person cockpit perspective, but also employ in-engine cutscenes to show plot developments. Mission objectives usually include the destruction of a specific enemy unit or structure, but goals can change mid-mission. Leung and Mike fight on their own but can also be given specific orders, including movement and search patterns, attacking specific enemies or defending friendly units. They can be given preferences for long- mid- or close-range combat. Anita's OASIS truck cannot attack or defend, but can be used to detect enemies on the map through a special radar scan. Enemies include all sorts of ground soldiers, tanks, aircraft and of course mobile suits as seen in the TV show, including Zakus, Goufs and Gelgoogs. <br><br>The player's suit is controlled via the directional pad for movement and the analog stick to look around. Double-pressing on the pad enables a quick dash via vernier thrusters. The thrusters can also be used to jump or hover, but can overheat and then require a cooldown period before becoming reusable. For ranged combat, the cockpit view can be switched to a sniping mode. Close combat against a mobile suit on the other hand automatically switches to a melee mode, in which the suits draw their beam sabers and duel it out.",
  "publishedBy": "Bandai America, Inc.",
  "developedBy": "BEC Co., Ltd.",
  "released": "Apr, 2000",
  "alsoFor": "",
  "genre": "Action, Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/gundam-side-story-0079-rise-from-the-ashes",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Bandai Co., Ltd.",
          "developer": "BEC Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 26, 1999",
          "ean13": "4 902425 733197",
          "comments": ""
        },
        {
          "publisher": "Bandai America, Inc.",
          "developer": "BEC Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Apr, 2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}