{
  "name": "Happy Breeding",
  "shortName": "happy-breeding",
  "description": "<i>Happy Breeding</i> (DC) also known as <i>Happy Breeding: Cheerful Party</i> (PS2) is a non-adult console port of a <a href=\"https://www.mobygames.com/game/happy-breeding\">Happy Breeding</a> adult visual novel for PC (Windows). While the original game had voice-acting, the console ports changed voice-actresses for some of the heroines. The story revolves around Takashi, who just started living on his own recently. One day, he finds a strange looking girl in his house and ends up living together, seeing how the house was too big for one person and all. It doesn't go too long before he finds himself living together with yet another girl, and yet another. All the girls are not entirely human and display animal traits such as dog's ears, cat's tails, and the likes. Thus his life on his own soon turns out more lively than he expected after leaving his parents. The game is a typical visual novel with basic features of the genre, static characters which only vary in poses, occasional animations such as rain effect, sound effect to indicate what is happening on the scene instead of seeing actual animations, fast-forward option during dialogues, and full voice-acting, but only for main heroines.",
  "publishedBy": "PrincessSoft",
  "developedBy": "Purple Software Ltd",
  "released": "Feb 27, 2003",
  "alsoFor": "PlayStation 2 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/happy-breeding",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "PrincessSoft",
          "developer": "Purple Software Ltd",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Feb 27, 2003",
          "ean13": "4 560101 361135",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}