{
  "name": "Irides: Master of Blocks",
  "shortName": "irides-master-of-blocks",
  "description": "<i>Irides: Master of Blocks</i> is a puzzle action game that is based on the concept of falling blocks, much like the famous games <a href=\"https://www.mobygames.com/search/quick?game=Tetris\">Tetris</a> and <a href=\"https://www.mobygames.com/search/quick?game=Lumines\">Lumines</a>.<br><br>In <i>Irides</i> the player's goal is to arrange four or more equally colored blocks next to each other. These squares will be continuously deleted from the play field in exchange for points. <br><br><i>Irides</i> features an exciting campaign with 28 carefully designed, individual levels. Each level has its own specific mission or challenge. The player is required to simply score a certain number of points, delete a certain number of squares, clear the play field from already existing squares, battle against time or recreate a shape of squares on the play field. In addition, the player can unlock four carefully hidden bonus levels, with more, secret challenges. <br><br>An important aspect of <i>Irides</i> are the more than 15 individual powerups. Most of these special squares can be used to your advantage and help you complete your specific mission. There are bomb squares, squares that delete a certain color, or drill a hole in the playfield, as well as squares that have to be deleted more then once, in order for them to disappear from the field. <br><br><i>Irides</i> is also OpenFeint enabled. Allowing players to challenge their friends for the highest score, interact with other players and friends in chat rooms or unlock achievements. <br><br>On top of that, <i>Irides</i> features some 30 minutes of music and sound effects, specifically designed for the game.",
  "publishedBy": "GOAT Store, LLC, The",
  "developedBy": "Mad Peet",
  "released": "Dec 12, 2009",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/irides-master-of-blocks",
  "visual": "",
  "gamePlay": "Falling block puzzle",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "GOAT Store, LLC, The",
          "developer": "Mad Peet",
          "ported": "",
          "country": " United States",
          "releaseDate": "Dec 12, 2009",
          "ean13": "",
          "comments": "Independent Dreamcast release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}