{
  "name": "Kimi ga Nozomu Eien",
  "shortName": "kimi-ga-nozomu-eien",
  "description": "<i>Kimi ga Nozomu Eien</i> is an adult visual novel in Japanese. The story revolves around the male high school student Takayuki Narumi. The game is divided into two chapters. The first one takes place between 6th July and 20th August 1998 and the second one is set three years later in 2001. The romantic story tells the relationship between Takayuki and Haruka Suzumiya, as they are set up on a date through friends. There is a dramatic incident and the consequences are then detailed in the second chapter.<br><br>The game follows a branching plot line through pre-determined scenarios with very limited player input. Most of the gameplay shows text along with character sprites against background art, but there are also sequences where CG artwork is used. All CG items are collected in a gallery available after completing the game for the first time. There are multiple endings based on a number of decisions. In total there are eight main plot lines to experience, based on the main eight female characters that can be encountered.<br><br>The original PC version is an adult version with sexual imagery. The Dreamcast and PS2 consumer ports do not contain the adult content.",
  "publishedBy": "Alchemist Co., Ltd.",
  "developedBy": "&Acirc;ge",
  "released": "Sep 26, 2002",
  "alsoFor": "PlayStation 2, Windows | Combined View",
  "genre": "Adventure",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/kimi-ga-nozomu-eien",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Alchemist Co., Ltd.",
          "developer": "&Acirc;ge",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Sep 26, 2002",
          "ean13": "4 519898 002240",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}