{
  "name": "Langrisser Millennium",
  "shortName": "langrisser-millennium",
  "description": "<i>Langrisser Millennium</i> is yet another installment of the long-running Japanese strategy RPG series. You control five main characters: Taji, a young boy whom was chosen as the ruler of the country Salem; Nei Lee Sun, the ruler of Chin, who helps Taji when he gets involved in a war; Masariva, a half-beast and a former slave who became a queen, but preferred the life of a wanderer; Rumaty Marf, the queen of the country Misla, on a quest for an angel who appeared in her dream; and Saryune, the ruler of Vidern, whose only desire is power. Those five rulers meet each other, when they get involved in a war with hostile countries. However, soon they learn a greater evil has appeared in the world - they must reach a faraway island to prevent the reincarnation of an evil god...<br><br>The gameplay of <i>Langrisser Millennium</i> is divided into &quot;Map Mode&quot; and &quot;Battle Mode&quot;. In map mode, you move your characters over a map, trying to reach enemy fortresses and to prevent the enemy to reach yours. Everything happens in real time: if you do nothing, the enemy will come and conquer your country. Once in battle mode, you control several teams. You only assign actions to the team leaders, while others fight automatically in round-based strategy combat.",
  "publishedBy": "Masaya",
  "developedBy": "Santa Entertainment",
  "released": "Nov 03, 1999",
  "alsoFor": "",
  "genre": "Role-Playing (RPG), Strategy / tactics",
  "perspective": "3rd-person (Other), Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/langrisser-millennium",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Masaya",
          "developer": "Santa Entertainment",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 03, 1999",
          "ean13": "4 988616 012012",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}