{
  "name": "Leona's Tricky Adventures",
  "shortName": "leonas-tricky-adventures",
  "description": "<h3>Steam Store Description (from <a href=\"https://www.mobygames.com/game/leonas-tricky-adventures/adblurbs\">Ad Blurbs</a>)</h3>Accompany Leona in a clever puzzle adventure to save the inhabitants of a strange but lovely world. Featuring fresh puzzle mechanics, wonderful retro graphics, lots of exploration and an excellent soundtrack by legendary game composer Chris Huelsbeck.<br />\n<br />\nLeona’s Tricky Adventures is inspired by a clever puzzle game mechanic which was briefly explored in the very early 90s but sadly faded from prominence shortly after. The basic task is to match two increasingly complex patterns using increasingly complex mechanics. While it can’t be directly compared to any contemporary game the mental skills required by the puzzles put them somewhere in between &quot;Picross&quot; and &quot;Bejeweled&quot; – and in our humble opinion they can easily stand up against those games.<br />\n<br />\nAll puzzles are embedded in a big and complex overworld full of exploration and humorous citizens constructed entirely using beautifully hand-drawn pixel graphics. Exploration and puzzle-solving is intertwined in clever and varied ways which draw you deeper into the game world.<br />\n<br />\nComicmakers M.Musal/B.Samuel provided the story and dialogue for Leona's world to make the storytelling and humorous aspects of the game just as compelling as the gameplay itself. The story is an integral part of the game and the overworld design directly builds on it to form a coherent product that is more than the sum of its parts.<br />\n<br />\nTo match the quality of the gameplay, Chris Huelsbeck and Fabian DelPriore composed a magnificient soundtrack as well as M.Musal/B.Samuel prepared al marketing material to round off the package.",
  "publishedBy": "KTX Software",
  "developedBy": "KTX Software",
  "released": "Jan, 2016",
  "alsoFor": "Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "Bird's-eye view, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/leonas-tricky-adventures",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "KTX Software",
          "developer": "KTX Software",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan, 2016",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/483560-leona-s-tricky-adventures-dreamcast-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "Worldwide",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/483559-leona-s-tricky-adventures-dreamcast-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "Worldwide",
      "platforms": "Dreamcast"
    }
  ]
}