{
  "name": "My Merry Maybe",
  "shortName": "my-merry-maybe",
  "description": "<i>My Merry Maybe</i> visual novel romance adventure game is a sequel to <a href=\"https://www.mobygames.com/game/my-merry-may\">My Merry May</a> visual novel in a similar style with other visual novels developed by KID. The game opens with the protagonist of the story, Hiroto Kishimori, a college student visiting a rural area for a teaching practice, driving together with a high-school principal at night in a rural area. While talking, they notice a white female silhouette on the road, barely managing to hit the breaks in time. Not sure whether what they saw was a real thing or a ghost, they exit the car only to find a young girl on the ground. They put her in the car and rush to the nearby town to find a doctor and help her regain her consciousness. After waking up at the school infirmary, in shock at first, she identifies herself as Rev, a humanoid artificial life form also known as Reprise. She has no memory of who her master is, an naturally, Hiroto ends up being her guardian until her owner is found.<br><br>The gameplay and user interface is similar with many other visual novels providing basic functions such as auto-play and pause, hide on-screen text to see background image and characters, message log which can be voice re-played, and many other game options which are almost identical to those in KID's <i>Memories Off</i> series. Aside from the player character, all other characters, male and female, feature full voice-acting. Characters change poses to depict different attitudes, but also include mouth animations during most of the dialogues.<br><br>As a direct sequel to <a href=\"https://www.mobygames.com/game/my-merry-may\">My Merry May</a>, <i>My Merry Maybe</i> continues the story which was originally planned as a trilogy. While both of the games are limited to Dreamcast and PlayStation 2 platforms, later PlayStation 2 release under the name <a href=\"https://www.mobygames.com/game/my-merry-may-with-be\">My Merry May with Be</a> includes both <i>May</i> and <i>Maybe</i> stories as well as additional scenarios.",
  "publishedBy": "KID Corp.",
  "developedBy": "KID Corp.",
  "released": "Jul 10, 2003",
  "alsoFor": "PlayStation 2 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/my-merry-maybe",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "KID Corp.",
          "developer": "KID Corp.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jul 10, 2003",
          "ean13": "4 933516 306242",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}