{
  "name": "Noiz2sa",
  "shortName": "noiz2sa",
  "description": "The official description for <i>Noiz2sa</i> is &quot;abstract shootem up game&quot;, and indeed it is. Noiz2sa takes the mechanisms of the &quot;mania shooter&quot; (the modern kind of shoot'em'up with extreme amounts of bullets on the screen at the same time) and removes all graphical touches. Instead, all graphics are rendered in flat polygons.<br><br>Your goal is to fly your ship through ten abstract levels while avoiding being hit by the barrages of enemy bullets. Unlike orthodox shooters, your ship is only vulnerable at its very core, the &quot;sweet spot&quot; if you will. As long as the trajectory of enemy bullets doesn't cut through the core of your ship, they will pass through you without hurting you. In order to better navigate the bullet clusters, you have a slow-down key which slows down your own movements so that you gain more precision.<br><br>Shooting down enemies makes them release green stars which give you bonus points, but no weapons upgrades or smart bombs are available; the goal is simply to survive using your plain cannon. In addition to the ten normal levels, there are four endless levels, where the aim is to survive as long as possible, thereby gaining a higher high score.<br><br>Noiz2sa makes use of the special BulletML markup language for defining bullet patterns.",
  "publishedBy": "ABA Games",
  "developedBy": "ABA Games",
  "released": "2004",
  "alsoFor": "Amiga, GP2X, GP32, Linux, Macintosh, OS/2, Windows | Combined View",
  "genre": "Action",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/noiz2sa",
  "visual": "",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "ABA Games",
          "developer": "ABA Games",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "2004",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}