{
  "name": "Redux: Dark Matters",
  "shortName": "redux-dark-matters",
  "description": "<h3>Steam Store Description (from <a href=\"https://www.mobygames.com/game/redux-dark-matters/adblurbs\">Ad Blurbs</a>)</h3><strong>Redux: Dark Matters</strong> is an ultra hot classic shmup and definitely a must have for every shmup fan. Released successfully at the beginning of 2014 as a brandnew Dreamcast game in limited edition - now the games comes as a beautiful super sharp 16:9/720p and 1080p full HD PC version on Steam for worldwide distribution right before the same year ends!<br><br>Redux: Dark Matters is a fast-paced space shooting game with fresh scoring elements and some review called the game a bastard-hard shooter. However, you have to master 7 stages with different ambiance which is indeed anything but easy - not yet spoken of the boss encounters. Always watch out since each and every thing is loaded with whatever to discover. Your ship is armed with rapid fire, sub-weapons, rockets and more - in other words with all you need to make it through - it depends on you!<br><br>The story takes place in the year 2067, when the “Space Force” organisation was exploring the galaxy for new strong and powerful materials to produce more powerful battle ships they discovered a space mine on a strange asteroid on the enemy territories. The scientists now began to analyze the material and concluded they had found the one material to build the best space ship ever.<br><br>One year later, the prototype was finished and the test results show unmatched battle power. However, the material seemed to be unstable and the use of the assembled ship was highly risky but since the Evil threat, was close to destroy the whole universe, the organisation was forced to let the ship fly.<br><br><strong>NOW</strong>, go to experience the highlights of the game - pilot your space ship, blast off the mechanized servants of evil and save the world! <br><br><strong>Game Features</strong><br>\u2028Superb Arcade Style Game Graphics<br>\u20287 Stages with Huge Boss Enemies\u2028<br>Tons of Weapons\u2028<br>Two player ships to choose from with different Weapons\u2028<br>Normal and Veteran Difficulty<br>\u2028Instant Respawn\u2028<br>Arcade Gameplay and Addictive Scoring System\u2028<br>Awesome Soundtrack Composed by Andre Neumann feat. Chris Huelsbeck!",
  "publishedBy": "Hucast Games ",
  "developedBy": "Hucast Games , KTX Software",
  "released": "Jan 27, 2014",
  "alsoFor": "Windows | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/redux-dark-matters",
  "visual": "2D scrolling",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Hucast Games ",
          "developer": "Hucast Games ",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 27, 2014",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}