{
  "name": "Roommate Asami: Okusama wa Joshik?sei",
  "shortName": "roommate-asami-okusama-wa-joshiksei",
  "description": "Asami Onohara is in most ways an average high-school girl; cheerful, outgoing, and just a bit clumsy. She has a secret, though: she's married to her physics teacher! Apart from her parents, nobody but the two of them know, and if they want to stay together, it needs to stay that way until she graduates.<br><br><i>Roommate Asami</i> is a spinoff of Datam Polystar's <a href=\"https://www.mobygames.com/search/quick?gamegroup=Roommate+%2f+Ry%c5%8dko+Inoue+series\">Roommate</a> series based on the manga <i>Okusama wa Joshik?sei</i> (My Wife is a High School Student) by <a href=\"https://www.mobygames.com/developer/sheet/view/developerId,508917/\">Hiyoko Kobayashi</a>. The game proceeds in standard visual novel fashion from point of view of the teacher, who must be named by the player. Each day is broken up into four segments, and at certain times it is possible to visit different locations around the city, which will cause different events to occur. During conversations, there are often points where the player must choose from multiple responses, which will affect the flow of the story and potentially lead toward different endings.<br><br>The Dreamcast &quot;Director's Edition&quot; features higher-resolution CG images and includes a bonus disc with drama tracks and voice data, but is otherwise identical.",
  "publishedBy": "Datam Polystar",
  "developedBy": "Datam Polystar",
  "released": "Nov 21, 2002",
  "alsoFor": "PlayStation 2 | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/roommate-asami-okusama-wa-joshiksei",
  "visual": "",
  "gamePlay": "Visual novel",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Datam Polystar",
          "developer": "Datam Polystar",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 21, 2002",
          "ean13": "4 932688 000354",
          "comments": "Dreamcast Collection release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}