{
  "name": "Samba de Amigo ver. 2000",
  "shortName": "samba-de-amigo-ver-2000",
  "description": "This game is the update to the original, maraca shaking, <a href=\"https://www.mobygames.com/search/quick?game=Samba+de+Amigo\">Samba de Amigo</a>. A lot more has been added than in most updates. A new hustle maneuver complements the six original ones giving life to a related mode of play requiring to shake maracas and assume poses in new manner; the song list has been nearly doubled, with many new songs such as Vamos de Carnaval, the theme from Rocky and even the Wedding March being included. All songs can optionally be played shaking and posing in the previous instalment's way, or rather in Hustle Mode: wholly different\ngame experiences follow from one or the other of the two of the choices.\nFor anyone who thought they had the original game mastered, there's a survival mode where you have to play through all 43 songs making a maximum of 8 mistakes in total. The Challenge mode is refreshed with new goals to achieve, as well as five secret stages intending to set the player before a more exacting challenge.\nThe core gameplay effectively remains the same as the original though. This game was only released in Japan.",
  "publishedBy": "SEGA Corporation",
  "developedBy": "Sonic Team",
  "released": "Dec 14, 2000",
  "alsoFor": "Arcade | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/samba-de-amigo-ver-2000",
  "visual": "",
  "gamePlay": "Music / rhythm",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "SEGA Corporation",
          "developer": "Sonic Team",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 14, 2000",
          "ean13": "4 974365 501310",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}