{
  "name": "Sega Swirl",
  "shortName": "sega-swirl",
  "description": "In an interesting publicity maneuver for their newly-released Dreamcast video game system, SEGA of America released a free game for the PC and DC platforms, <i>Sega Swirl</i> (also apparently to capitalize on the DC's logo, a Cinnabon-like swirl).<br><br>The object of the game is simple. A screen fills with multi-colored swirls, and then you must remove the whole screen. A swirl removed will also remove all neighboring swirls of the same color. Gravity affects the remaining swirls, and the whole mass contracts to the left of the screen as you remove more and more.<br><br>Scoring is based on combos or number of swirls removed simultaneously. Obviously, more swirls=higher points, but single swirls actually remove points. You have to play a balancing act between removing huge masses of swirls and being left with non-matching sets, or removing smaller sets and possibly missing out on a huge combo score.<br><br>In a foreshadowing of the (hoped for) coming day of PC/video game online convergence, PC and DC owners can play against each other- via e-mail.<br><br>PC owners can download the game for free, and SEGA offers it in two varieties- the standard version, and (refreshingly) a small sound-free version for people who don't want to be online for a long time. A separate sound pack is available for those who opt to not get the whole set in one fell swoop. DC owners can get the game free on various promo GD-ROMs SEGA has distributed.",
  "publishedBy": "SEGA of America, Inc.",
  "developedBy": "Tremor Entertainment",
  "released": "2000",
  "alsoFor": "Palm OS, Windows | Combined View",
  "genre": "Puzzle",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/sega-swirl",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Tile matching puzzle",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "SEGA of America, Inc.",
          "developer": "Tremor Entertainment",
          "ported": "",
          "country": " United States",
          "releaseDate": "2000",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}