{
  "name": "Striker Pro 2000",
  "shortName": "striker-pro-2000",
  "description": "European soccer game based around the UEFA license.  Effectively a merger between Rage software's <a href=\"https://www.mobygames.com/search/quick?game=Striker\">Striker</a> franchise and playstation/dreamcast evolution with Infogrames' <a href=\"https://www.mobygames.com/search/quick?game=UEFA\">UEFA license</a>. <br><br>UEFA Striker offered a mix of arcade and simulation style gameplay and a certification mode, where the player was tested for skills in order to unlock game modes.<br><br>The game featured many clubs from around the world in some form or another, but in it's primary game tournament mode was focused around European clubs.<br><br>In addition to simple and quick selection of a 'friendly match' the game supported the following tournaments:<br><br>Super Trophy - Featuring up to 32 teams drawn from a pool of over 40 of the most popular European teams.  In round 1 the 32 teams start off in four leagues, each playing the other teams within the league twice.  The top two teams from each league proceed to round two, similar to round one yet with two leagues of four teams.  The top two teams play the final, a tie resolved with extra time and then penalties.<br><br>National Team Qualifiers - a mode only unlocked when you reached 3/10 in certification tests.  Belgium and Holland were not included in the list of 49 teams split into 9 groups in a pre-defined way.  This was likely because the mode was designed to mirror the Euro 2000 competition, for which Infogrames did not own the license and so could not use the official name (the tournament was based in Holland/Belgium and they automatically qualified as a result).  The player could choose to player any one of those 49 teams, one home and one away match against the other teams in the same group...the top team going to the finals.  Group ties resolve by goal difference, scored then conceded.  The best of out of all those teams which placed second in the groups also goes forward.  The remaining eight second place enter a single knockout round, with four going through to the finals.<br><br>National Team Finals - Must have certified 3/10 and succeeded in the National Team Qualifiers.  The remaining 16 teams from the qualifiers (or a new selection), including Belgium and Holland are split into four groups of four, playing each group member once.  The top two teams proceed to a knockout format - Quarters, Semis and Finals.  Penalty shootouts settle ties.<br><br>Territories Cup - Certified 5/10 unlocks this mode, basically league play around various world locations - completion of each cup unlocks the next territory.<br><br>8/10 in certification mode unlocked a bonus competition.  The game also supported generic league and knockout tournament play, as well a classic matches - four preconfigured scenarios replaying historical matches.<br><br>English live commentary was from Ron Atkinson and Jonathan Pearce.\n",
  "publishedBy": "Infogrames North America",
  "developedBy": "Rage Games Ltd.",
  "released": "2000",
  "alsoFor": "PlayStation | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/striker-pro-2000",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Infogrames North America",
          "developer": "Rage Games Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "2000",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Infogrames Europe SA",
          "developer": "Rage Games Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "2000",
          "ean13": "3 546430 004845",
          "comments": ""
        },
        {
          "publisher": "Imagineer Co., Ltd.",
          "developer": "Rage Games Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Apr 06, 2000",
          "ean13": "4 965857 030654",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/155733-striker-pro-2000-dreamcast-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/155734-striker-pro-2000-dreamcast-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "Dreamcast"
    },
    {
      "link": "/images/covers/l/155731-striker-pro-2000-dreamcast-media.jpg",
      "scanOf": "Media",
      "packaging": "Jewel Case",
      "country": "United Kingdom",
      "platforms": "Dreamcast"
    }
  ]
}