{
  "name": "VMU Football",
  "shortName": "vmu-football",
  "description": "The first exclusively-downloadable Dreamcast VMU game, made available on the Dreamcast Network in September 1999, is a remake of the classic Mattel handheld LED football game, but in first person perspective. <br><br>The player is represented by a football at the bottom of the screen. Up to three defenders can be seen directly in front of the player, as far as 5 yards away. The player is tackled if a defender touches the ball. <br><br>The action is controlled via the Dreamcast VMU's directional pad. Pressing forward moves the player one yard forward, and pressing left or right moves the ball to the left or right of the screen. The player has 4 chances (downs) to make 10 yards. If a first down is made, another 4 downs are awarded. The object of the game is to run the ball in for a touchdown and beat the opponent.<br><br>On fourth down, the player can opt to kick the ball. If the user is inside fifty yards of the end zone, a field goal is attempted. Outside the fifty yard line, the ball is punted. Kick distance is determined via a mini-game where the user times a button press to a moving power bar.<br><br>There is no defense in this game. In a player vs. CPU game, the opposing team's offensive outcome (touchdown, field goal, punt, turnover) is determined at random. The game can also be played by two players, with a hand-off after each possession. It's perfect for when you're with a friend and waiting in line at a movie theater.<br><br>",
  "publishedBy": "SEGA of America, Inc.",
  "developedBy": "SEGA of America, Inc.",
  "released": "Sep 29, 1999",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/vmu-football",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "SEGA of America, Inc.",
          "developer": "SEGA of America, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 29, 1999",
          "ean13": "",
          "comments": "released online on Sega Dreamcast Network."
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}