{
  "name": "Xeno Crisis",
  "shortName": "xeno-crisis",
  "description": "<h3>Steam Store Description (from <a href=\"https://www.mobygames.com/game/xeno-crisis/adblurbs\">Ad Blurbs</a>)</h3><br>A port of the successfully crowdfunded Sega Mega Drive / Genesis title, Xeno Crisis is an arena shooter that can be played solo or in local co-op mode. Take control of battle-hardened marines embarking on a deadly mission to confront an alien menace and get home alive! Run and gun your way through thousands of adversaries as you explore the devastated research outpost, searching for survivors, and ultimately facing the origin of the outpost's demise.<br><br><br><br>Outpost 88 is divided into seven distinct areas, each being randomly generated with each play, meaning that your strategy must evolve on the fly if you're to succeed in your mission. Collect dog-tags from vanquished enemies to upgrade your equipment between areas and look out for special weapons which will give you a momentary advantage.<br><br>There are several weapons at your disposal, each with their own characteristics. Although your standard issue pulse rifle is perfectly capable of taking on the enemy, other weapons can give you advantages in certain situations, so picking them up is generally advisable - just don't run out of ammo!<br><br>As you progress through the colony you will come across many different enemies, each with their own traits and means of attack. Many of them can be gunned down without too much thought, but others will require the player to outflank them, attack them within a certain time window, or be avoided altogether!<br><br>At the end of each area you will be given the chance to exchange any dog-tags you've collected for upgrades ranging from extra health to weapon power-ups to extra continues. Which upgrades you go for will depend on your style of play.<br><br><br><br><strong>* A faithful port of the hit 16 bit game with added extras.<br><br>* Incredible pixel art from the legendary pixel artist, Henk Nieborg.<br><br>* Intense FM chiptune soundtrack by Savaged Regime, originally created for the YM2612!<br><br>* Two difficulty levels and three modes of play.<br><br>* Seven varied areas to traverse.<br><br>* Many different enemies to tackle.<br><br>* An arsenal of 10 weapons to master.<br><br>* Upgrade system allows you to change your tactics each playthrough.<br><br>* Play solo or local co-op with a friend! (2 player requires at least one controller)</strong><br><br>",
  "publishedBy": "Bitmap Bureau Ltd.",
  "developedBy": "Bitmap Bureau Ltd.",
  "released": "Jun 16, 2020",
  "alsoFor": "Genesis, Linux, Macintosh, Nintendo Switch, PlayStation 4, PS Vita, Windows, Windows Apps, Xbox One | Combined View",
  "genre": "Action",
  "perspective": "Bird's-eye view, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/xeno-crisis",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "Bitmap Bureau Ltd.",
          "developer": "Bitmap Bureau Ltd.",
          "ported": "",
          "country": " France, Germany, Spain, United Kingdom",
          "releaseDate": "Jun 16, 2020",
          "ean13": "5 060639 730278",
          "comments": "mail order release (Standard European version)"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}