{
  "name": "Yukawa Moto Senmu no Otakara Sagashi",
  "shortName": "yukawa-moto-senmu-no-otakara-sagashi",
  "description": "<i>Yukawa Moto Senmu no Otakara Sagashi</i> (or &quot;Former Director Yukawa's Treasure Hunt&quot; as the title translates to) was a promotional game released by Sega where 10,000 applicants could win a prize of ¥10,000 each. To do this the players had to use clues presented on the internet (using the Orange Dreamkey CD for internet access). All that was needed to enter was to purchase the game at certain retailers for the low price of ¥980. The promotional period was between March 20 through April 11, 1999.<br><br>In the game the player is cast as Sega's former Senior Managing Director <a href=\"https://www.mobygames.com/search/quick?quickSearch=Hidekazu+Yukawa\">Hidekazu Yukawa</a>, presented as a cartoon character. From a top-down perspective the player navigates between different screens and using a limited amount of digs with a shovel, Yukawa needs to find certain pieces of puzzles (all with a Dreamcast theme) to match the online hints given through the internet via the Dreamcast. If he manages to complete the correct picture, the player was eligible to enter the raffle where the prize money was at stake.<br><br>There is also a VMU mini-game included which could be downloaded to aid further in the quest and make digging for treasure faster.",
  "publishedBy": "SEGA Enterprises Ltd.",
  "developedBy": "SEGA Enterprises Ltd.",
  "released": "Mar 20, 1999",
  "alsoFor": "",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/dreamcast/yukawa-moto-senmu-no-otakara-sagashi",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Dreamcast",
      "releases": [
        {
          "publisher": "SEGA Enterprises Ltd.",
          "developer": "SEGA Enterprises Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Mar 20, 1999",
          "ean13": "4 974365 500252",
          "comments": "Distribution release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}