{
  "name": "7800 ProSystem",
  "manufacturer": "Atari",
  "type": "",
  "origin": "U.S.A.",
  "year": "1984, 1986 (full launch)",
  "production": "1992",
  "language": "Pole Position II (USA) - cartridge; Asteroids (Europe) ? in system memory; 32-in-1 (Australia and New Zealand) - cartridge",
  "keyboard": "1 detachable joystick with 2 fire buttons (USA); 2 detachable controllers including a pad and 2 fire buttons each (Europe)",
  "cpu": "6502c (custom, not 65C02)",
  "speed": "1.79 MHz",
  "coprocessor": "TIA (sound chip), Maria (graphics), Riot (I/O)",
  "ram": "4 KB",
  "vram": "",
  "rom": "4 KB (BIOS)",
  "text": "",
  "graphics": "320 x 200",
  "colors": "16 hues, 8 luminances each, 128 colors. 256 colors possible, 16 on screen at once.",
  "sound": "2 channels; POKEY sound chip option in cartridges (for additional or replacement 4 channels)",
  "size": "",
  "ports": "RF TV video output, 2 x controller ports, expansion port (not on all system revisions)",
  "power": "External power supply unit, 9v DC 1A",
  "price": "",
  "description": "\nThe Atari 7800 ProSystem was originally scheduled for release in late 1984, as the follow-up to Atari?s misguided 5200 SuperSystem, but didn?t see release until 1986, when it retailed for approximately $140 (USA). Instead of competing with comparatively weaker systems like the 5200 and Coleco?s ColecoVision, the later release date for the 7800 brought direct competition from the more robust Nintendo Entertainment System (NES), released in late 1985, and the Sega Master System (SMS), which, like the ProSystem, was released in 1986.\n\nIn late 1984, despite having had successful showings at trade events, an extensive and enthusiastic preview in one of the top video and computer game magazines of the day (Electronic Games), retail orders already taken, and warehouses full of stock, Atari management decided to shelve the system and its launch games in favor of their computer line when it became apparent to them - and seemingly everyone else in the industry - that the videogame depression had become an irreversible crash. Also put on the shelf was a redesigned Atari 2600 (VCS), dubbed the Atari 2600jr, due to its diminutive size. These moves have often been criticized in hindsight, but for those around at the time, it was clear that videogames were being supplanted by low cost and powerful personal computers as the more flexible game machines of choice, and a game system in the traditional sense simply wouldn?t be financially sustainable.\n \n\n\n",
  "shot": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;LEFT SIDE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800_l-side_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;7800 (EUROPEAN MODEL)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_1b.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRONT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_front.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRONT PORTS\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;These are the joystick ports and option switches\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_front_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;BOTTOM\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_bottom.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;RIGHT SIDE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_r-side.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;RIGHT SIDE #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_r-side_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;CONTROLLER PAD\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_controller_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;JOYSTICK UNSCREWED\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_controller_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800_us-box_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;EUROPEAN BOX\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_box_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;EUROPEAN BOX - BOTTOM\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/photos/atari_7800pal_box_2.jpg"
    }
  ],
  "advert": [
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT(1982) #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Osborne_1_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. ADVERT (1977) #2\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;An advert d\u0026eacute;dicated to Polymorphic BASIC language features and to a new version of the system named System 0.\u0026lt;br\u0026gt;\u0026lt;br\u0026gt; The \u0026lt;b\u0026gt;System 0\u0026lt;/b\u0026gt; was intended for the users who already have a S-100 Bus based system and wanted to transform it into a Poly 88 system. It consisted of the central processor card with ROM monitor, the video card and the cassette interface, all in kit form. Price: $525 \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Polymorphic_Poly88_Advert_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #18\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;As the picture is quite unreadable, we have replaced it with a plain text copy.  \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; In order to provide as much information as possible, we have selected the most frequently asked questions about MSI products for inclu\u0026shy;sion in our catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the MSI 6800 Computer\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What are the main differences between the MSI 6800 Computer and the MP 6800 Com\u0026shy;puter manufactured by Southwest Technical Products Corporation?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI 6800 Computer is bus compati\u0026shy;ble with the SWTP 6800 system. Both use the SS-50. bus architecture. However, the MSI 6800 overcomes the engineering disadvan\u0026shy;tages associated with the MIKBUG monitor, incomplete address decoding, interface ad\u0026shy;dresses in the middle of user memory, inade\u0026shy;quate power supply, and mother board capacity. The MSI 6800 system has a 20 amp power supply and a heavy duty mother board with 16 slots and gold-plated connectors. Our CPU Board has separate baud rate and system clocks, 4K of EPROM memory and a much improved MIKBUG compatible monitor. MSI interface cards bring all strappable options to a DB-25 connector on the rear panel via a rib\u0026shy;bon cable connector. This permits any terminal to be plugged into the computer without alteration of the interface card. Other advantages of the MSI 6800 are described in this catalog. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use my SWTP memory boards and interface boards in the new MSI 6800 Com\u0026shy;puter?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, since the bus architecture is identical, they will worlk fine. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI 6800 mother board and power supply only to beef up my SWTP 6800 system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, the MSI mother board (MB-1) has the same hole centers as the SWTP mother board and will mount easily in the SWTP chassis. However, the MSI interface adapter board (IA-1) must also be used to furnish an interface bus. The MSI power supply (PS-1) may also be used to replace the SWTP supply. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is the MSI6800 available wired and tested?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, see catalog listings. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Can I use the MSI CPU card in my SWTP 6800 system in order to gain a faster system clock and on board EPROM memory?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; Yes, however the MSI power supply should also be used in order to adequately supply the EPROM memory. A MIKBUG replacement monitor must also be used if interface ad\u0026shy;dresses used by MIKBUG are to be retained. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Questions About the FD-8 Disk Memory System\u0026lt;/b\u0026gt; \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; I have an SWTP 6800 System. What is needed to hook up your FD..a Floppy Disk Memory to my system?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD..a Disk Memory System interfaces to any microprocessor system via a single PIA chip. For the SWTP 6800 System, we furnish our PIA-1 interface card which plugs in directly to port 7 of the interface bus. A ribbon cable then plugs into the interface card and to the disk. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is provided with the FD-8 Disk System?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides a complete disk operating system software package for use with 6800 based microprocessor systems. The operating system gives the user the capability of having named files at three levels: object code files, source code files for the assembler, and BASIC files. The system contains a coresident as\u0026shy;sembler/editor which can pull source files from disk, assemble, and pass object code to either tape cassette or disk memory. Password pro\u0026shy;tection is available for both program as well as random and sequential data.\u0026lt;br\u0026gt; The new TSC editor is now available in a MSI FD-8 disk version. This excellent editor allows very long source files to be stored on disk, edited, and assembled with the object code being placed on disk as well.\u0026lt;br\u0026gt; In BASIC, both program as well as random and sequential disk data files are available. All files are named with optional password pro\u0026shy;tection. Other basic programs on disk can be chained to or called as subroutines from a parent program. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What charges are made for software, and what documentation do I receive?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The complete disk operating system, in\u0026shy;cluding the coresident assembler/editor are provided free of charge with the purchase of an FD..a Disk System. A $65.00 charge is made for MSI BASIC. An operating manual for disk oper\u0026shy;ating system, assembler/editor, and BASIC is provided. Partial source documentation is also provided for the input and output routines and other appropriate addresses. In addition, com\u0026shy;plete source documentation is provided for the disk driver subroutines and MINIDOS which allows the user to read or write any desired sector or number of sectors from any beginning disk location to any destination in computer memory. This enables the user to have access to the disk in his own assembly language pro\u0026shy;grams or by direct communication with the control terminal completely independently from the MSI disk operating system. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is it possible to interface the FD-8 Floppy Disk to microcomputer systems using the 8080, Z80, or 6502 processors? If so, do you provide the technical details on interfacing?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The FD-8 can be connected to any micro\u0026shy;processor via a single PIA chip interface. Elec\u0026shy;tronically, there is no difficulty in interfacing to any system since transfers between the disk and the host computer are carried out via a sector buffer RAM on the disk controller card. Information transfer is under the control of a crystal clock on the controller board, thus mak\u0026shy;ing the FD-8 completely independent from processor speed or clock frequency. It is possi\u0026shy;ble to interface the FD-8 using parallel data ports without a PIA chip, however, the software for interfacing has already been written for both 8080 and 6800 systems using a PIA interface. Since some of the ports are used bi-direction\u0026shy;ally, the PIA interface provides an overall sim\u0026shy;plifi9ation of the interfacing problem. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; What software is available for 8080 sys\u0026shy;tems?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; MSI provides complete source listings and documentation for MINIDOS and the disk driver subroutines which have been written for the 8080. This allows the user to have complete access to the disk to write any desired sector or number of sectors from any desired starting location to any desired destination memory address. A complete 8080 based disk operating system is not yet available. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;Q.\u0026lt;/b\u0026gt; Is your FD-8 Floppy Disk double density?\u0026lt;br\u0026gt; \u0026lt;b\u0026gt;A.\u0026lt;/b\u0026gt; The MSI Floppy Disk uses the GSI Model 110 drive which has the capability of operating in the double density mode. However, double density operation requires data to be written using a modified FM technique. This requires special data separator and data writing circuitry which is not contained within the present ver\u0026shy;sion of the FD-8. Double density version of the FD-8 will be introduced at a later time.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s18.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;First advert from \u0027Byte\u0027 magazine\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Tandy_Modele16_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH AD (JAN. 1980)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sord_m-serie_ad_gepsi.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;AN ADVERTISING FOR THE BM JR\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/bmjr.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;U.S. AD. (1983) #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;First advert - January 1983\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Oki_IF800_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;LOGABAX STICKER\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;What a quantum leap, Logabax!\u0026quot;\u0026lt;br\u0026gt; \u0026quot;I would say even more, what a quantum leap!\u0026quot;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;http://tintinomanie.chez.tiscali.fr/\u0026lt;/b\u0026gt; \u0026copy; Moulinsart\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Logabax_LX500_sticker_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;NEW ZEALAND AD. (1980)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Nice advert, but nothing seems right in the picture...\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;b\u0026gt;Murray Muffat\u0026lt;/b\u0026gt; from New Zeland\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Apple_II_Advertd_s5.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT APR. 1982\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Courtesy of \u0026lt;b\u0026gt;\u0026lt;a href\u003d\u0026quot;http://www.aci.com.pl/mwichary/\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;Attached\u0026lt;/a\u0026gt;\u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Tandy_Model3_Advert_s3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;PROMOTIONAL PICTURE\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/commodore-vic20_promo_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;IIE VERSION\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Promotional picture. Notice the dual floppy drive module on top of the case, inspired by the Franklin \u0026lt;a href\u003d\u0026quot;http://www.old-computers.com/museum/computer.asp?st\u003d1\u0026amp;c\u003d646\u0026quot; target\u003d\u0026quot;_blank\u0026quot;\u0026gt;ACE 1200\u0026lt;/a\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Roberto Isiri\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Microdigital_TK3000_ExtendedAd_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;SIL\u0027Z III\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Nice fish-eye picture of a Sil\u0027z III illustrating a 1982 article about Technologic Revolution in the french mag TeleSoft.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/leanord_silz3_pic_rev_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;1978 BROCHURE #8 \u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/MSI_6800_Brochure_s8.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;JAPANESE ADVERT (1991)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This japanese advert indicates that there were at least 3 different models sold...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/sega_teradrive_jap-ad_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;FRENCH ADVERT (JUNE 1985)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026quot;Thomson, you make me micro\u0026quot;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/thomson_mo5_tu-me-rends-micro_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;ADVERT #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;From the magazine \u0027Micro Sistemas\u0027 of March 1983 \u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;b\u0026gt;www.mci.org.br \u0026lt;/b\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Microdigital_TK85_Advert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;JAPANESE ADVERT #4\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;Thanks to \u0026lt;a href\u003d\u0026quot;http://osaki.cool.ne.jp/hc/computer/canon/canon.html#x07\u0026quot;\u0026gt;Handheld computer \u0026amp; Pocket calculator Museum\u0026lt;/a\u0026gt; for this picture\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/canon_x07_jap-advert_3.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;US ADVERT, OCT. 1985\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/NCR_PC6_Advert_s1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;HARD WORKING MAN\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;This promotional picture shows a man smiling while looking at his personal account...\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/thomson_to7_promotional-guide_serieux.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;MICROSOFT MULTIPLAN, APR. 1986\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Commodore_128_Advert_s4.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;64 BITS IN 1983?\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;After the optimistic 36 Mhz. speed, here is the 64 bits processing power... with 8 bits/Z80 cards. Here also, the 64 bits \u0027power\u0027 is obtained by putting eight 8 bits cards together in the case.\u0026lt;br\u0026gt; Not a very honest way to sell a computer that is no more than a classic S-100 / Z80 based system with some multi-user capabilities.\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/ibs_Betasystem_Advert_2.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;STRONG WOOMAN(1982)\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;Don\u0027t beleive this advert!\u0026lt;br\u0026gt; Please, look carefully at the quite horizontal shoulders of the woman who carries the Osborne (about 12 Kg). Either she is a champion of wrestling, or the Osborne case is empty. \u0026lt;br\u0026gt;\u0026lt;br\u0026gt; \u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/Osborne_1_Advert_1.jpg"
    },
    {
      "description": "\u0026lt;br\u0026gt;\u0026lt;font color\u003d\u0026quot;red\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;\u0026gt;\u0026nbsp;COMMERCIAL PAMPHLET  - PAGE #1\u0026lt;/strong\u0026gt;\u0026lt;/font\u0026gt;\u0026lt;br\u0026gt;\u0026lt;blockquote\u0026gt;... from Australia\u0026lt;p class\u003d\u0026quot;petitgris\u0026quot;\u0026gt;thanks to Richard Rogers\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;",
      "link": "http://www.old-computers.com/museum/adverts/centraldata_2650_flyers_1.jpg"
    }
  ],
  "hardware": [],
  "emulator": [
    {
      "platform": "Multiplatform emulator",
      "name": "MESS",
      "link": "http://www.mess.org/",
      "description": "This multi-system emulator, can emulate the Atari 7800"
    }
  ],
  "link": [
    "http://www.atariage.com/7800/faq/index.html?SystemID\u003d7800",
    "http://www.atariage.com/",
    "http://www.bigfishusa.com/7800/index.html",
    "http://atarihq.com/danb/a7800.shtml",
    "http://cat.asw.cz/~kubecj/7800tech.htm",
    "http://www.atari7800.org/",
    "http://www.atarimuseum.com/"
  ],
  "image": "http://www.old-computers.com/museum/photos/atari_7800_1.jpg",
  "builtInGames": "Pole Position II (USA) - cartridge; Asteroids (Europe) ? in system memory; 32-in-1 (Australia and New Zealand) - cartridge",
  "controllers": "",
  "media": "Cartridge, 32 KB Maximum",
  "numGames": "",
  "peripherals": "All Atari 2600 peripherals; Atari XEGS Model XG-1 Light Gun; Unreleased: Keyboard (which would allow use of Atari 8-bit computer peripherals, but not software), High Score Cartridge, Dual Controller Holder and 5200 Compatibility Module",
  "switches": "",
  "batteries": "",
  "buttons": "",
  "gun": ""
}