{
  "name": "Mega Man: Battle Chip Challenge",
  "shortName": "mega-man-battle-chip-challenge",
  "description": "Lan, Chaud, Dex and other characters from the <a href=\"https://www.mobygames.com/game/mega-man-battle-network\">Mega Man Battle Network</a> Universe prepare to duke it out in the Battle Chip GP!  Take control of your favorite character and face off against many opponents as you make your way to the head of the GP to reach the ultimate prize, an incredibly rare battle chip!<br><br>Gameplay is based around the Mega Man Battle Network series of games, in that players purchase and use various battle chips to combat their opponents.  However, unlike the main games, players do not have direct control over their Net Navi.  Instead, players pre-select their battle chips, and one of these chips are used in the battle against the opponent.  Once selected, the game automatically plays out the battle.<br><br>There is also a process called 'slotting in', which can be performed by pressing L or R during battle when your slot in gauge is full.  Slotting in allows you to use an additional battle chip during gameplay to assist you.  If successful, the chip will be used, and aid you with healing, dealing extra damage, and so on.",
  "publishedBy": "Capcom Co., Ltd.",
  "developedBy": "Inti Creates Co., Ltd.",
  "released": "Aug 08, 2003",
  "alsoFor": "Game Boy Advance, Wii U | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/wonderswan-color/mega-man-battle-chip-challenge",
  "visual": "Isometric",
  "gamePlay": "Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "WonderSwan Color",
      "releases": [
        {
          "publisher": "Capcom Co., Ltd.",
          "developer": "Inti Creates Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 08, 2003",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}