{"name": "Dead Heat Scramble", "overview": "You make your choice between a sand rail, a dune buggy or an off-road truck. Hit the A button to accelerate and hit the trail. In single play you race against the clock, but take your Game Boy and hook it up with another Game Boy and race directly with the other player. The road is rough and the turns are slick. The left and right arrows on the control pad are your steering wheel. Your mission is to avoid the obstacles as you race against the clock. Mow down the other cars in your way and you accumulate points. Each time you overtake another car you are presented with other challenges and opportunities: Capture a flying bottle of nitro and you increase your speed. Capture a runaway tire and you increase your steering ability. Catch up with the soaring clock and time stands still. Catch a bomb and you have fire power! The obstacles are tough and without acquiring these powers it will become impossible to simply maneuver around them and win! Survival of the fittest is the golden rule in DEAD HEAT SCRAMBLE! Players must choose between a dune buggy, a sand rail vehicle, and the incredible off-road truck. All races are strictly against the clock while the driver navigates through blockades on the road and other drivers that want to defeat the player. All of the ten courses must be unlocked in a linear fashion; all the races take place in a tube. Few power-ups exist in them game; including a chance to increase the player's nitro boost. There are ten stages in the entire game. No penalties are given for bumping into the other drivers; unlike real life. Each course is in the shape of a half-pipe.", "platform": "Nintendo Game Boy", "release_date": "April 20, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Copya System", "publishers": "Electro Brain", "genres": "Racing", "max_players": "1", "cooperative": "No", "rating": "3.89", "wikipedia": "https://en.wikipedia.org/wiki/Dead_Heat_Scramble", "video_link": "https://www.youtube.com/watch?v=1G4CFqePncE", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18041\n"}