{"name": "Dick Tracy", "overview": "Ace detective Dick Tracy stared at the glaring headline on the front page of the evening news with mixed emotions. Big Boy Caprice had escaped from prison and within hours a crime wave had hit Chicago the likes of which he'd never seen. It seemed that all the filth of the city had crawled out from beneath some slimy rock...the Brow, Pruneface, Flattop, and the rest of their ruthless cohorts were on the rampage again. But worst of all, that dirty dealing Big Boy had kidnapped Tess Trueheart!! Suddenly Tracy's two-way wrist radio broke the silence. \"Calling Dick Tracy! Calling Dick Tracy!\" He sprang from behind his desk and burst through the squad room door shouting, \"O.K. boys, let's go! This could be our lucky break!\" The game's introduction shows that Big Boy has escaped from the state penitentiary and kidnapped Tess, Tracy's love interest. The gameplay itself is purely level-based platforming, foregoing the overhead driving sequences of its NES counterpart. Stylistically, the Game Boy version bears a strong resemblance to the side-scrolling mode of the NES version. Dick Tracy can punch and use the same weapons (hand gun, Tommy gun, tear gas), as well as grenades (which will instantly kill all non-boss enemies on the screen). This game also shares some common music with the NES version. Each of the five levels contains 12 hidden pieces of a photograph used to solve a puzzle at the end of each level. At the end of each level, Dick Tracy would fight one of the antagonists from the film, including Shoulders, Flattop, and Pruneface). After defeating the boss, the player would need to solve the twelve-piece puzzle using the pieces found throughout the level to reveal a photo of the next boss to be pursued. If the puzzle could be solved within the allotted period of time, the player would be awarded a bonus life. For every two pieces placed correctly, the player would be awarded with one extra hit point. If any of the missing pieces were missed or if the puzzle isn't solved in time, then the game will automatically piece the whole image together (without any bonuses, of course). Then, Tracy would interrogate the fallen boss for where to search next for clues leading to Big Boy and Tess.", "platform": "Nintendo Game Boy", "release_date": "December 31, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Realtime Associates", "publishers": "Bandai", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "3.77", "wikipedia": "https://en.wikipedia.org/wiki/Dick_Tracy_(video_game)", "video_link": "https://www.youtube.com/watch?v=SRknxeYTP8M", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/18045\n"}