{"name": "Game Boy Gallery", "overview": "The original Game & Watch introduced millions of people to the world of Nintendo. Now Nintendo has put five of these classic titles onto one Game Boy cartridge to ensure maximum fun and frustration for players of all ages! BALL - You would like to work for a circus. Before being offered the job, you have to show you can juggle. To make the job easier, the circus provides you with some arm extensions. You start off juggling slowly but you need to get faster to impress your new employer. VERMIN - So you couldn't juggle. No problem. The local pest control company need a new employee. Moles are taking over the town and it's your job to hit the moles on the head as they surface. Be careful, the more you hit them, the angrier and faster they become. FLAGMAN - The previous job got under your feet so you try something more memorable. You are working at the local boating lake and your job is to hold up flags to let people know that their time is up. The school holidays have started and the lake is filling up. MANHOLE - Having left the boating lake, you take a job with the local council. All the manhole covers have been stolen and it is your job to block the manholes yourself, so that the public are not injured. The rush hour has started and the flow of pedestrians is increasing all the time. CEMENT FACTORY - You have now had four jobs, this is your last chance. You get a job on a building site. Unfortunately the automatic cement mixers are not working and the lorries are waiting for the cement. Your job is to control the mixers manually. As the cement falls you must flick the switches to send the cement down the chutes and onto the lorries. Be quick though, as the next bag of cement is on its way", "platform": "Nintendo Game Boy", "release_date": "April 27, 1995", "game_type": "Released", "esrb": "E - Everyone", "developers": "Nintendo R&D1", "publishers": "Nintendo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.38", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/23417\n"}