{"name": "Hello Kitty: Pocket Camera", "overview": "Hello Kitty Pocket Camera is an unreleased Hello Kitty and other Sanrio characters branded game in the Game Boy Camera series. This game was revealed during the 2018-2020 Nintendo, Microsoft data breaches. It is quite different to Game Boy Camera, The Legend of Zelda: Ocarina of Time Game Boy Camera and CoroCoro Comic Pocket Camera, because various menus and minigames are entirely different. Like the Pocket Hello Kitty; a virtual currency is required to play minigames known as Kitt. It curiously shares some music (minus the sound font and arrangement) with Mobile Trainer. These two facts may hint at some Denyusha involvement. Unlike the Zelda edition, which is a simple retheming of the regular Game Boy Camera, the Hello Kitty edition nearly completely reworked the menu system (doing away with the \"hiding\" of large amount of features under Start or Select menus) and features different minigames. Few similarities remain, but those that do are fairly recognizable, such as the on-screen keyboard, the \"Blue Danube\" slideshow music, and the Pocket Camera branding. After choosing Shoot, the topmost option in the main menu, the live view starts immediately. The D-Pad selects frames and special effects, but if holding Start adjusts the exposure instead. After taking a photo, the player can not only save or discard it, but also immediately print it. The View option starts immediately on a single photo thumbnail plus comment view, with a toolbar on the side providing intuitive access to full-screen viewing, stamps, printing, commenting, deleting, and copying. The Play option features scratch cards (costing 10 of the in-game currency Kitt; curiously the same currency from Pocket Hello Kitty), 15-tile sliding puzzles (25 Kitt), a slideshow with adjustable speed, and unlockable animations from which frames can be saved. The Options option provides access to the profile input feature (enhanced with a blood type option and three photos), seven card templates for printing out the profile, the Records feature which pays out Kitt, and the Link feature. The Link feature shows Sailor Hello Kitty (who has appeared in other media as well), but is also a play on Game & Watch Flagman. The Strawberry Channel is a series of six animations, as well as the Staff Credits. Animation 1 and the Staff Credits are available by default, and the rest are unlocked at various Kitt milestones. It is possible to take a photo of a frame from one of the animations in order to get photographs without using the camera; a substitute of sorts to the regular Game Boy Camera's Album-B not existing in this prototype. The main menu buttons are decorated with animated Hello Kitty and album icons. In general, lots of menus in the game feature Hello Kitty and other Sanrio characters (such as Tippy, also directly part of the Hello Kitty universe). For the Play option button, Hello Kitty switches between dress-up clothes including overalls similar to Mario. There are many unique stamps. The list is relatively extensive to strictly Hello Kitty characters at the time who did not class as part of other unique universes (such as My Melody): Hello Kitty, various depictions of her such as Angel Kitty, Mimmy, Dear Daniel, the policeman, the postman, the doctor, Cathy (now illegal), Fifi, Tippy, Rory, Mory, a Tinychum, Baby Daniel, Baby Mimmy, Baby Kitty, another teddybear, Tim and Tammy, Judy and Joey, another teddy bear with an apple, Thomas, Jodie, Tracy, Papa, Mama, Grandpa, Grandma, Baby Cathy, the Rubber Ducky, many other Hello Kitty themed objects, possibly others. The other stamps are face elements, such as eyes, glasses and hats, the kana, alphabets, numbers, other symbols like emoji, grammatical symbols, and a mobile phone emoji (three fonts each), followed lastly by some kanji and geometric shapes. The error screens are scenes featuring other Sanrio characters rather than Game Boy Camera's faces. (such as Badtz-Maru, Ijuuin Pandaba with Badtz-Maru and Good Hanamaru fighting over a book, and Badtz-Maru with Good Hanamaru; an exhaustive search is necessary to see if any other scenes exist in the ROM other than in the screenshots below). At least two tracks from this version are reused in the Mobile Trainer.", "platform": "Nintendo Game Boy", "release_date": "", "game_type": "Unreleased", "esrb": "", "developers": "Creatures, Inc.", "publishers": "Nintendo", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "https://tcrf.net/Proto:Game_Boy_Camera", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/165537\n"}