{"name": "Into the Blue", "overview": "If you have ever owned a Game Boy, you have almost certainly spent many hours with playing “Tetris”. And if you have ever played “Tetris”, you will almost certainly recognize some kind of resemblance when you first play “Into the Blue”. You will discover even more similarities if you compare it to “Tetris Attack”, a lesser known variant of the same principle. In both “Tetris Attack” and “Into the Blue”, you have a vertical playfield with panels raising from the bottom. The panels can be rearranged and will disappear if three (or more) matching panels are lined up in a horizontal or vertical row. The game is over if a panel touches the upper border of the playfield. But while it is true that “Into the Blue” and “Tetris Attack” play very similarly, it is still not correct to call “Into the Blue” a “Tetris Attack” clone. Actually, “Into the Blue” is based on a game that is even a few years older than “Tetris Attack” and features slightly different game mechanics. That game, a Sega Genesis title by the name of “Megapanel”, is widely forgotten today – probably because it was never released on any other systems and never made its way out of Japan. Although there is no proof that “Megapanel” inspired the creators of “Tetris Attack”, it seems reasonable to assume that they were familiar with the game and tried to improve it. So, what’s the point in porting an obscure old game from one obsolete game console to another? First of all, I wanted to create a game that in spite of being similar to many other Game Boy titles, adds something new to the Game Boy library. But just like in my earlier “Retroid” project, the main reason was to learn more about the Game Boy and its capabilities. The technical differences between “Into the Blue” and its predecessor “Retroid” may not be obvious for the average player, but under the hood, everything has changed. And while many of the technical changes do not directly affect the gameplay, there is at least one technical improvement everybody can see: “Into the Blue” offers a competitive two player mode that is accessible if two Game Boys are connected via the link cable. But enough being said – why should you read about a game you can actually play? Please, scroll back to the top of this page, download your copy and check it out now! “Into the Blue” features: 9 Speed levels 3 Difficulty levels 3 In-game songs (plus 1 title song) 1 Competitive mode for 2 players", "platform": "Nintendo Game Boy", "release_date": "2016", "game_type": "Homebrew", "esrb": "Not Rated", "developers": "Jonas Fischbach", "publishers": "Celestial Games", "genres": "Puzzle", "max_players": "2", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=UVF41Xo4rgU", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/116662\n"}