{"name": "Kaijuu Ou Gojira", "overview": "Kaijū-ō Godzilla (怪獣王ゴジラ King of the Monsters, Godzilla) is a 1993 action adventure game by Bandai for the Game Boy. It was released exclusively in Japan. The game is notable for featuring nearly every monster in the Godzilla franchise up until the time of its release. While the game does not feature a distinguishable story, the basic premise is that hundreds of monsters have arisen all over Japan and Godzilla is the only one who can defeat all of them. Human armies will attempt to slow down Godzilla and the other monsters' rampage. The game ends with a final battle between Godzilla and Super MechaGodzilla, with Godzilla emerging as the victor and retaining his title as the King of the Monsters. The game is a 2D side-scroller, with Godzilla being the only playable character. Godzilla can use a wide variety of attacks, including a punch, a kick, and a tail whip. He can also use his signature atomic breath, which can be fired up, down, or straight. Using the aforementioned attack drains him of his health. If Godzilla stops moving, his health gradually gets restored. Buildings on the background can sometimes be interacted with, and if destroyed, will sometimes refill Godzilla's health quickly. The game does not feature a save system, and it only allows the player to continue for three times if they are killed. There are five levels, with each level containing a final boss monster that Godzilla needs to defeat before he is able to progress further into the game. Aside from monsters, various human vehicles such as warships, gunships, fighter jets, and tanks also serve as enemies in the game. However, they do not deal significant damage to Godzilla and can be destroyed easily.", "platform": "Nintendo Game Boy", "release_date": "December 17, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "", "publishers": "Bandai", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://en.wikipedia.org/wiki/Kaijū-ō_Godzilla", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117216\n"}