{"name": "Pachinko Kaguya Hime", "overview": "A pachinko machine resembles a vertical pinball machine but it uses much smaller steel balls, while pinball games use a larger, captive ball. The pachinko balls are not only the active object but also the bet and the prize. The player loads one or more balls into the machine, then presses and releases a spring-loaded handle, which is attached to a padded hammer inside the machine, thus launching the ball into a metal track. The track guides the ball around the edge of the playing field, then when the ball loses momentum, it falls into the playing field from near the top. Some pachinko machines have a bumper to bounce the ball as it reaches the top, while other machines allow the ball to travel all the way around the field, to fall on the second time that it reaches the top. In either case, the ball enters the playing field, which is populated by a large number of brass pins, several small cups into which the player hopes the ball will fall (each catcher is barely the width of the ball), and a hole at the bottom into which the ball will fall if it doesn't enter a catcher. The ball bounces from pin to pin, both slowing the fall and making it travel laterally across the field. A ball that enters a catcher will trigger a payout, in which a number of balls are dropped into a tray at the front of the machine.The object of the game is to capture as many balls as possible. Pachinko Kaguya Hime is based around this game and offers many fun variants and machine types to play. If you want to control what machines you play, then during gameplay, on reaching a pachinko machine, press Start twice and enter one of the below button sequences.", "platform": "Nintendo Game Boy", "release_date": "October 9, 1992", "game_type": "Released", "esrb": "Not Rated", "developers": "Marionette", "publishers": "Coconuts Japan", "genres": "Casino", "max_players": "", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/117080\n"}