{"name": "Pokémon Blue Kaizo", "overview": "This is a far more challenging hack of Pokemon Blue, where you can obtain all 151 Pokemon in the First Generation. Numerous areas have been redesigned, many dungeons and routes are more treacherous than before. The default movesets are modified to ensure the pokemon become significant threats. The level curve has been estimated to be smooth. Wild Pokemon distribution is vastly improved, with levels fairly close to trainers. You can catch quite a variety of pokemon early on. All trade evolutions will evolve by level up. You can purchase ethers. Apart from Brock and Misty, and a couple of rival fights, all bosses will have full teams. Apart from giovanni, these will stick to their type themes with a wildcard in between. After koga, the trainer level curve varies a bit due to a fork in progression (such as going to silph co or seafoam islands), but the boss progression will be Giovanni, Sabrina, and Blaine. A good tip is to save rare candies, do not use them early on, as it becomes much harder to level up in the later stages. But once you beat Blaine, you can catch some very high leveled pokemon right before victory road, and you can obtain psychic types. Victory road will be the most difficult dungeon in terms of battles, as a good 95% of them will have full teams of six, and the cooltrainers will be particularly deadly, with some of the best teams in gen 1. But if you make it past victory road, you can purchase super cheap rare candies to get to level 100. And it is essential you get to level 100, because the Elite Four will be the hardest part of the game. You can obtain legendary pokemon, as well as a select few rare and extremely powerful pokemon in the Unknown Dungeon. One important update is that you cannot use revives or max revives during battles, so it will take a bit more skill to handle bosses. Also, certain items have been disabled. Another is fixing some maps and ethers are now much more affordable (but a bit more restricted). All in all, good luck.", "platform": "Nintendo Game Boy", "release_date": "December 28, 2014", "game_type": "ROM Hack", "esrb": "Not Rated", "developers": "SinisterHoodedFigure", "publishers": "", "genres": "Role-Playing", "max_players": "", "cooperative": "No", "rating": "3.75", "wikipedia": "", "video_link": "https://youtu.be/8fKEQ3Jm9wM", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/156742\n"}