{"name": "Sarakon", "overview": "This is a prototype build of Sarakon, a European puzzle game that was never released despite being fully completed. The game — along with ten other prototype ROMs — was sent to an anonymous researcher by a private collector. Looking to understand what they were sent, the researcher donated the files to Gaming Alexandria for inspection. Sarakon started life as a simple variant of Activision’s Shanghai published by Virgin Games in 1991 for the Commodore 64 and Amiga. The game was developed by Starbyte Software, a small German company started in 1988 by Klaus-Jürgen Kraft that worked with many members of the early German demoscene. Starbyte originally focused solely on home computer development, but as Nintendo’s consoles became more popular in Europe, the company dabbled in porting their games to console systems — Sarakon being one of them. The team tasked with porting Sarakon to the Game Boy was a small one, with Peter Sabath on programming , “R. Goede” on music, and Ingo Mesche on graphics. When asked about his work on the project, Ingo Mesche confirmed that the game was finished, but was unsure as to why it wasn’t released. He theorizes that it was due to Starbyte never getting a developer’s license from Nintendo. This would have been the responsibility of a publisher so it’s likely that Virgin Games or other publishers rejected the game for release. Shortly after Sarakon‘s completion, Starbyte became insolvent was forced to declare bankruptcy in 1992. They were soon bought out by another company — coincidently also called Starbyte — which let them, in the words of former developer Roman Werner, “take over the rights on published games without the need to pay their debts.” Sarakon for the Game Boy would make its first public appearance in an issue of the German magazine Video Games. It would also be its last. Since this preview in June 1992, two prototypes of the final game have surfaced: one in the hands of managing director Markus Scheer, and other being presented to you today by Gaming Alexandria.", "platform": "Nintendo Game Boy", "release_date": "", "game_type": "Unreleased", "esrb": "Not Rated", "developers": "Starbyte Software", "publishers": "", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "None", "wikipedia": "", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/150704\n"}