{"name": "Super Robot Taisen", "overview": "The very first installment of the Super Robot Taisen series is quite different from all of its successors; most notably, the robots are treated as sentient organisms, and all pilots are absent from the game. As the intro tells, they live on the planet of super robots, when a mysterious space creature know as Gil Gil Gan takes control of most the planet's inhabitants and launch a destructive war. The basic interface is like every other SRT game: your robots are placed out on a map grid with different terrain types. Placing the cursor above a robot and pushing a button brings up a menu with basic choices for movement, attack, status and special options. A similar menu is displayed if you move your robot close to an enemy unit, offering options to attack, use spiritual powers or negotiate. After all robots have moved, the turn is over, and the game switches to the enemy phase. All robots are licensed from two parties only – Sunrise and Dynamic – and when starting the game you may choose to start with the Gundam team, the Mazinger team or the Getter Robo team. One robot must be designated as the team leader, which allows you to upgrade its statistics with a number of points. If the leader robot is destroyed in battle, the game is over. Unlike later games, destroyed units are not repaired after a scenario is cleared, but may show up as an enemy unit later on. This puts a lot more emphasis on the negotiation command than later games, since a lot more enemy units may in fact turn out to be friends. Few of them will listen unless you have first brought down their HP to a minimal amount, though. Apart from HP, each unit has XP. Experience is gained for each enemy unit that is destroyed, and a level up adds to all aspects of your robot; speed, force, armor, HP and SP. SP, or spiritual power, is like MP in conventional RPGs, allowing a unit-specific set of ”spiritual commands” to be executed. These usually change game variables, such as force of attack, speed of dodging or health. Health is otherwise regenerated by putting a unit in one of the bases spread out on each map. When first entering a base, you gain a power-up item. These are fitted to your robots between scenarios and include new weapons and shields. Each battle is displayed as a small animation, but it is all very primitive compared to later games in the series, even on the Game Boy, with little movement apart from the bullets and lasers. Preceding each battle you have initiated yourself, you may choose your weapon. Weapons may be hand-to-hand or ranged. Ranged weapons are advantageous since your opponent may not fire back – this is true even of enemy units which possess ranged weapons of their own. All weapons have also properties for their accuracy and power, which are altered according to the terrain and whether enemies are at sea, on the ground or airborne.", "platform": "Nintendo Game Boy", "release_date": "April 20, 1991", "game_type": "Released", "esrb": "", "developers": "Winky Soft", "publishers": "Banpresto", "genres": "Strategy", "max_players": "1", "cooperative": "No", "rating": "2.7", "wikipedia": "https://en.wikipedia.org/wiki/List_of_Super_Robot_Wars_video_games#Tactical_role-playing_games", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/106114\n"}