{"name": "Zool: Ninja of the 'Nth' Dimension", "overview": "The game is a pure platform game, relying on smooth, fast-moving gameplay. Its protagonist is Zool, a gremlin \"Ninja of the Nth Dimension\" who is forced to land on Earth; in order to gain ninja ranking, he has to pass seven lands, beating a boss at the end of each of them. The game contains a number of embedded minigames, including several arcade games, a scrolling space shooter and a game accessible only by making Zool play a certain tune on an in-game piano or finding certain invisible warp points. Development and release ------------------------------------- Zool was intended as a rival to Sega's Sonic the Hedgehog. George Allen came with the idea of Zool as he was criticized on his previous game Switchblade II for having a lack of enemies. In development, Zool could cast spells to get him out of trouble by collecting potions. For example, Zool could escape from pits with high jump spells and cast a shadow spell to make a clone of him that follows his actions (thus doubling the fire power). In the final version, the spells were replaced with collectible powerups. The very early name for the project was Pootz. The soundtrack by Patrick Phelan overlaps with the Lotus 3 soundtrack and inspired several modern electro/techno remixes. The game was heavily hyped upon its initial release, including being bundled with the newly launched Amiga 1200, although not the AGA version with enhanced graphics which followed later. In 2000, the Amiga version of Zool was re-released as part of The Best of Gremlin compilation. Zool was also ported to the Atari ST, Game Boy, Sega Mega Drive/Genesis, SNES, Master System, Sega Game Gear, Amiga CD32, PC, and RISC OS platform, as well as for the arcade machines. The Amiga CD32 version has original red book audio tracks by Neil Biggin and has the option to have both sound effects and music. This and the Acorn Archimedes port are the only two incarnations of the original Amiga version to have this. Most computer ports are close to the Amiga original but the Genesis and SNES ports are very different with different levels which are smaller (likely due to shortage of RAM), different graphics and bosses. The SNES port is also very buggy with a low horizontal resolution, which makes it easier to run into enemies and being overall a slower game. Two young adult novels book based on the games, entitled Cool Zool and Zool Rules, were released in February 1995. They were written by Stan Nicholls and Ian Edginton and published by Boxtree. The Game Maker's Companion (APress, 2010), a book on hobbyist game development, contains step-by-step instructions on how to re-make the original Zool game using GameMaker: Studio.", "platform": "Nintendo Game Boy", "release_date": "January 1, 1993", "game_type": "Released", "esrb": "Not Rated", "developers": "Gremlin Graphics Software", "publishers": "GameTek", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "3.38", "wikipedia": "https://en.wikipedia.org/wiki/Zool", "video_link": "http://www.youtube.com/watch?v=kcjYQYfdJpQ", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/21180\n"}