{"altername_name": ["Saibā Naito"], "name": "Cyber Knight", "overview": "In the 24th century, mankind has gone into space. The crew of the starship Swordfish are in an engagement with space pirates when the battle takes a turn for the worse. In desperation, the crew activate their jump drive without a destination... and end up flung across the galaxy to the galactic core. The Swordfish however is badly damaged with many casualties including the captain. Only 26 of the crew survive, and of them only six are qualified for combat: The commander, two soldiers, a mechanic and a doctor and six giant \"Module\" mechanized suits available for them. These survivors locate planet Farworld, apparently colonized by humans. There they discover the colony is under attack by a relentless mechanical aliens dubbed \"Berserkers\". The crew of the Swordfish must fight back against the Berserkers and explore the galaxy for some means to return home. Cyber Knight is an RPG with a science-fiction theme of being lost in an alien galaxy. The game takes place in a top-down view for movement on planets and areas, a side-view for combat sequences and a first person menu system when aboard the Swordfish starship. The Swordfish can travel between stars, scanning worlds for information. If the ship is able to land on a planet, three crew members piloting three Modules (giant robots) can be selected to debark and explore the planet. Many planets will have towns or people living on them which can be talked to in order to uncover information. Different quests are assigned in order to find the items necessary to progress. There is no system of currency or buying items. Instead, many defeated Berserkers leave behind \"NeoParts\", which can be brought back to the Swordfish's lab. Analysis of these Neo parts unlocks enhances statistics (endurance, agility, accuracy, etc) for the Modules and new weapons for them to carry. The six modules are unique in statistics, and also the six pilots each carry different skills.", "platform": "NEC TurboGrafx-16", "release_date": "October 12, 1990", "game_type": "Released", "esrb": "Not Rated", "developers": "Compile", "publishers": "Tonkin House", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "3.83", "wikipedia": "https://en.wikipedia.org/wiki/Cyber_Knight", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/22599\n"}