{"name": "Beebris", "overview": "Beebris is a single-player puzzle game featuring several challenging game modes. Based on the popular tetromino arcade games, Beebris has 40 levels of difficulty, web-based high score tables and one-more-game addictiveness. It also has rather iffy controls in very early and later levels!<br><br>The four distinct game modes are:<br><br>BEEBRIS<br><br>This is the standard game mode. Points are scored by making complete horizontal lines of blocks in the Well. Greater scores can be obtained by ‘Quick-Dropping’ the tetromino - the higher the Quick Drop, the higher the score.<br><br>Once 10 lines have been completed, the level will increase and the game will speed up noticeably. This will continue to a point where it reverts back to slower speeds. As you continue further into the higher levels, you will see the start position of the tetromino becomes lower - the Well top has been lowered! The game ends when a tetromino is placed in a position above the Well top.<br><br> <br><br>BEEBRIS+<br><br>Gameplay is similar to the normal BEEBRIS mode but with the addition of new polyominoes for extra difficulty. These new shapes do not tessellate quite as easily as the regular tetrominoes. To offset this there is another special single-block - the Bomb! This block will complete the line of blocks it falls to even if the line is not<br>complete!<br><br> <br><br>ARCADE<br><br>This is similar to regular Beebris mode with some additions -<br>there are now 4 level types:<br><br>Normal<br>As with the regular game of Beebris, the object is to make<br>10 lines to advance to the next level.<br><br>Progressive Advance<br>The same as a Normal level but occasionally the game will<br>move all blocks in the Well upwards and insert a random<br>line at the bottom.<br><br>Random Blocks<br>The same as a Normal level but occasionally the game will<br>insert a new block into the well at a random position.<br><br>Pre-Built Well<br>The same as a Normal level but the Well will contain a<br>pre-selected pattern of blocks to start the level off with.<br><br> <br><br>ARCADE+<br><br>The same additions to Beebris+ apply here - new<br>polyominoes and the Bomb!<br><br>CONTROLS<br><br>GAME SCREEN<br><br>After the introduction and title screen, you will be presented with the all-in-one gameplay and control screen. To the left lies the Well - this is where the action takes place. The box to the right contains all the current game information. The game mode is indicated to the top left. Beneath this is the Next Block display area and off to the right the Current Level is displayed. The large 6-digit figure below shows the player Score.<br><br>GAME OPTIONS<br><br>Select game mode 1, 2, 3, 4 on keypad<br>Select starting level 6 & 9 on keypad<br>Reset game * and # on keypad<br><br>IN-GAME CONTROLS<br><br>Move tetromino left: Left D-pad<br>Move tetromino right: Right D-pad<br>Quick Drop tetromino: Down D-pad<br>Rotate tetromino: B or C D-pad", "platform": "Atari Jaguar", "release_date": "January 17, 2010", "game_type": "Homebrew", "esrb": "", "developers": "Reboot", "publishers": "", "genres": "Puzzle", "max_players": "1", "cooperative": "No", "rating": "3", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=HRJa0hmx43s", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/140610"}