{
  "name": "Sargon",
  "shortName": "sargon",
  "description": "The first great microcomputer chess dynasty began at the 1978 West Coast Computer Faire, where this chess game developed by a husband-and-wife team (on a footnote platform, the Z80-based Wavemate Jupiter III) took first prize.  Interest in their product prompted them to distribute photocopies of its source code for other Z80-derived home computers; the March 1980 issue of Recreational Computing converted it to work on 8080-based computers.  Then the magnetic media situation stabilized industry-wide, and the program began being available for purchase by people who didn't intend on typing it in.<br><br>The game itself can be played as a list of piece movements to board locations or, more human-friendily, as a graphical representation of a game board with pieces on it.  The artificial intelligence can easily be overcome by chess masters, but is sufficient to stump amateur players as often as not.<br><br>This first installment of <a href=\"https://www.mobygames.com/search/quick?gamegroup=Sargon+series\">the Sargon series</a> was available for the early champions of the microcomputer scene, the Apple II and the TRS-80, but by the time other machines began reaching people's homes, updated versions (<a href=\"https://www.mobygames.com/game/sargon-ii\">Sargon II</a> and <a href=\"https://www.mobygames.com/game/sargon-iii\">III</a>) had superseded this version, which was also sold for a wide variety of kit machines.",
  "publishedBy": "Hayden Book Company, Inc.",
  "developedBy": "",
  "released": "1979",
  "alsoFor": "Apple II, CP/M, Nascom, TRS-80 | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Text-based / spreadsheet, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/exidy-sorcerer/sargon",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Chess",
  "setting": "",
  "release": [
    {
      "system": "Exidy Sorcerer",
      "releases": [
        {
          "publisher": "Hayden Book Company, Inc.",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "1979",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}