{"altername_name": ["Disney's 102 Dalmatians: Puppies to the Rescue", "La carica dei 102: Cuccioli alla riscossa"], "name": "Disney's 102 Dalmatians: Puppies to the Rescue", "overview": "102 Dalmatians is a 3D platformer where you become a courageous Dalmatian puppy, who must rescue your family and friends from the clutches of Cruella De Vil. Disney's 102 Dalmatians: Puppies to the Rescue features beloved characters from 101 Dalmatians and new characters based on the upcoming 102 Dalmatians live action movie. The game follows the films' storyline loosely. The player can choose the role of one of two dalmatians, Oddball or Domino, who are out in the backyard looking for treasure. It is not long before the player realizes that a toy found buried in a park was made at one of Cruella de Vil's toy factories; this alludes to the fact that Cruella's toy sales are down, which ultimately leads to the problem in the storyline. Facing financial ruin from lack of sales, Cruella sets an evil plan in motion - to reprogram her toys to capture any pets in sight. Oddball and Domino are the only puppies in their family who have not been captured when they return from the park. Their parents, Dottie and Dipstick, set out to rescue their puppies, commanding Oddball and Domino to stay home and 'be good.' The puppies do not listen, and are soon out on their biggest adventure yet - to save their brothers and sisters, and their parents who are captured along the way.", "platform": "Sega Dreamcast", "release_date": "November 15, 2000", "game_type": "Released", "esrb": "E - Everyone", "developers": "Crystal Dynamics", "publishers": "Eidos Interactive", "genres": "Platform", "max_players": "1", "cooperative": "No", "rating": "4.03", "wikipedia": "https://en.wikipedia.org/wiki/Disney%27s_102_Dalmatians:_Puppies_to_the_Rescue", "video_link": "https://www.youtube.com/watch?v=9sc2viAE3n4", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/3355-disneys-102-dalmatians-puppies-to-the-rescue\n"}