{"altername_name": ["Eldorado Gate Dai-4-kan", "エルドラドゲートシリーズ 4"], "name": "Eldorado Gate Volume 4", "overview": "Long time ago, the god Dios created the Earth and humanity. But the king of demons, Razin, the seducer of mankind, rebelled against Dios and challenged him to a battle. Dios had the upper hand in this cosmic war and defeated Razin, sealing him in the underworld. Aware of his defeat, Razin split his body into twelve parts and scattered them across the world. He knew that one day those twelve parts will be reincarnated as human beings, and once they come together, Razin can be revived... El Dorado is a role-playing game (RPG) that consists of seven volumes - one volume is released every two months. The main story of the series deals with the lives of the twelve people that will later realize their part in the grand scheme. Aided by a mysterious man named Bantross, the protagonists have first to complete their personal quests, and to find each other among countless other people. The RPG features traditional dungeon-exploring, weapon-upgrading, and turn-based battles, that rely heavily on elemental weapons, equipment, and magic spells. The fourth volume contains chapters 9 to 11. In chapter 9, a fairy named Mima has to save her tribe from a terrible disease, annihilating evil gods who have sent it. In chapter 10, the king Alan asks Pamela to find his long-lost love. Pamela discovers that the king's beloved one had a son named Mamma. Awakened after years of slumber, Mamma decides to confront the evil king Mammoth, who was responsible for his tragic fate. In chapter 11, Mamma meets Elishin, and they go together to the town of Alambra. But Mamma is kidnapped by a female warrior named Gigi, and Gomez, Elishin, and their friends have to free him.", "platform": "Sega Dreamcast", "release_date": "April 12, 2001", "game_type": "Released", "esrb": "Not Rated", "developers": "Capcom", "publishers": "Capcom", "genres": "Role-Playing", "max_players": "1", "cooperative": "No", "rating": "2", "wikipedia": "https://en.wikipedia.org/wiki/El_Dorado_Gate", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/107273-eldorado-gate-volume-4\n"}