{"altername_name": [], "name": "Sister Princess Premium Edition", "overview": "Sister Princess Premium Edition (シスター･プリンセス プレミアム･エディション) is an adventure game for the Sega Dreamcast. The game itself plays out like a dating sim. Players have about a month to spend with the sisters with each day broken up into three segments: first is the free time period before noon, followed by the period after lunch and ending with another period of time before bed. During day time, the player can choose which of the girls he wishes to escort to school, if any. The period after lunch is similar to the one in the morning, with additional choices which allow the player to go to various places in town besides walking home with one of the girls. Every night before bed, the player will be allowed to check his e-mail and send replies. As the player continues to interact with the sisters, their reactions to their big brother will change accordingly until the ending. According to one source, there are two different endings for each sister: the normal ending and the \"non-blood relation\" ending. As the name would suggest, the special ending reveals that the brother-character and sister aren't actually related by blood. In the case of some of the older sisters, this can lead to the protagonist and \"sister\" marrying one another. In Sister Princess 1, the player can see two different endings for each sister, but Sister Princess 2 has four endings for each sister. The first two were the non-sibling relation and siblings-together ending and, if the player chooses one sister in the beginning but ends up with another sister, either of the other two endings for the first sister who the player does not choose appear (\"non-blood relation\" ending and \"still brother and sister forever\" ending also) but with a different story. Sister Princess is one of the few popular dating game series that does not feature hentai elements. Despite (or perhaps because of) this, a rival company known as GIGA decided to create the hentai knockoff Colorful Kiss. While this game features a different cast of characters (to avoid lawsuits), their setup and personalities are comparable. Colorful Kiss was popular enough to warrant the sequel Colorful Heart. It is important to note that these GIGA titles are ultimately incestuous.", "platform": "Sega Dreamcast", "release_date": "March 28, 2002", "game_type": "Released", "esrb": "Not Rated", "developers": "Stack", "publishers": "MediaWorks", "genres": "Adventure", "max_players": "1", "cooperative": "No", "rating": "4", "wikipedia": "https://segaretro.org/Sister_Princess_Premium_Edition", "video_link": "", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/127049-sister-princess-premium-edition\n"}