{
  "name": "Def Jam: Fight for NY",
  "shortName": "def-jam-fight-for-ny",
  "description": "<i>Def Jam: Fight for NY</i> is the sequel to the out-of-left-field <a href=\"https://www.mobygames.com/game/sheet/p,7/gameId,9307/\">Def Jam: Vendetta</a>.<br><br>The game opens with the person you beat in the previous game, D-Mobb, being arrested.  As the police are driving, an SUV comes out of nowhere and smashes into the car, setting D-Mobb free.  After a quick cutscene, it turns out the person who was driving the SUV was you, and you have now joined D-Mobb's crew.<br><br><i>Fight for NY</i>'s story mode takes you through the ranks, and pits you against tougher and tougher fighters.  You start off in D-Mobb's crew as a nobody and will have to work your way up, fighting off people from other crews, including D-Mobb's rival, Crow.  You'll take part mostly in one-on-one brawls, with the odd team match and free for all thrown in.<br><br>To aid you in fighting, you can use the environment to hurt your enemy.  You can smash people into wooden/cement walls, fences, or just whack them off of a wooden pillar.  Speakers, soda machines, garbage cans... All there to harm your enemy (or you).  Some objects are interactive, such as floodlights, which will change the lighting of the ring once someone's been thrown into them.  You have weapons at your disposal, usually a metal pipe, pool cue, and a broken bottle.<br><br>The crowd also gets into the action, which can be good or bad for you.  You can throw an enemy into a crowd and have them push him towards you; you can knock a stunned enemy into the crowd, and they will hold him down, giving you free shots; or you can throw an opponent into a part of the crowd holding a weapon, and they'll use the weapon against him.<br><br>There are five fighting styles available to you.  There is Street Fighting, which focuses on punches; Kickboxing, which focuses on kick attacks; Martial Arts, which focuses on speed, running, and acrobatic attacks; Wrestling, which focuses on standard wrestling moves, like bodyslams; and Submissions, which focus on wearing down a specific part of the enemy until that limb is damaged enough to earn a submission.<br><br>In addition to Story mode, you have Battle mode, which allows you to play with up to four players in different types of matches.<br><br><i>Fight for NY</i> has lots of unlockables.  Earning reward points from Battle matches, you can purchase new fighters or venues to fight in.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Electronic Arts Canada, AKI Corporation",
  "released": "Sep 20, 2004",
  "alsoFor": "PlayStation 2, Xbox | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "Wrestling",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/def-jam-fight-for-ny",
  "visual": "2D scrolling",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts Canada",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 20, 2004",
          "ean13": "5 030933 038776",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/119706-def-jam-fight-for-ny-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "United Kingdom",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/119707-def-jam-fight-for-ny-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "United Kingdom",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/188683-def-jam-fight-for-ny-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/188684-def-jam-fight-for-ny-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/188685-def-jam-fight-for-ny-gamecube-media.jpg",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    }
  ]
}