{
  "name": "Disney Sports Basketball",
  "shortName": "disney-sports-basketball",
  "description": "<i>Disney Sports Basketball</i> is the fourth and last in a series of GameCube-exclusive games that combine popular sports with Disney characters, offering three-on-three hoops.<br><br>Players can select from eight different teams, captained by the Disney characters Mickey, Minnie, Donald, Daisy, Goofy, Max, Huey, and Mortimer, with the two remaining players on each team filled by generic characters (except for Huey, who is joined by his brothers). Each team comes with its own home arena. Available playing modes include exhibition games (for up to four players), a 14-game season (7 home, 7 away games) and a Challenge Cup, which is a competition against six other teams in freely selectable order, followed by games against the &quot;bad guy&quot; teams of Mortimer and Pete. Winning the Challenge Cup unlocks the All-Star Game mode, for which teams consisting of only the star characters can be selected. A tutorial mode that teaches the game's controls in distinct lessons is also available.<br><br>Controls on the court are simple, with one button for shooting, one for stopping the dribble and keeping the ball away from the defender, and two for passing to the other two teammates. On defense, two buttons block and steal, and two switch to the other players. Scoring increases a power meter that when full, enables special moves and super dunks that net more points than usual. Going with the arcade flavor of the game, there are no fouls or free throws.",
  "publishedBy": "Konami of America, Inc.",
  "developedBy": "Polygon Magic, Inc.",
  "released": "2003",
  "alsoFor": "",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Basketball",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/disney-sports-basketball",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Konami Corporation",
          "developer": "Polygon Magic, Inc.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Dec 19, 2002",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Konami of America, Inc.",
          "developer": "Polygon Magic, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "2003",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}