{
  "name": "Disney's Donald Duck: Goin' Quackers",
  "shortName": "disneys-donald-duck-goin-quackers__",
  "description": "The evil wizard Merlock has kidnapped intrepid reporter Daisy Duck. Donald Duck wants to rescue her, and his friend Gyro Gearloose's latest invention, a teleporter, can help. Unfortunately, it can't reach Daisy directly due to a lack of power. To increase the energy, Donald must place weather vanes that catch gamma rays at the world's highest summits: the peak of Duckie Mountain, the Beagle Tower in Duckburg, and the flying mansion of Magica De Spell. Only then can the teleporter reach Merlock's temple so Donald can free Daisy.<br><br><i>Donald Duck: Goin' Quackers</i> on the PlayStation 2 and GameCube follows the same story, general gameplay style and level themes as the versions <a href=\"https://www.mobygames.com/game/dreamcast/disneys-donald-duck-goin-quackers\">on</a> <a href=\"https://www.mobygames.com/game/playstation/disneys-donald-duck-goin-quackers___\">other</a> <a href=\"https://www.mobygames.com/game/gameboy-color/disneys-donald-duck-goin-quackers_\">platforms</a>, but features unique level designs, enemies and gameplay mechanics.<br><br>The game is a platformer employing 3D graphics, offering three different styles of level in a manner similar to games in the <a href=\"https://www.mobygames.com/search/quick?gamegroup=Crash+Bandicoot+series\">Crash Bandicoot series</a>: the camera is either placed behind Donald as he runs forward, at his side (emulating classical side-scrolling platform gameplay) or in front of him in levels where he is chased by a giant hand and must run towards the screen.<br><br>Each level must be completed within a time limit. There are many holes and gorges Donald must jump over, traps to avoid, as well as enemies he can dispatch by hitting or jumping on top of them. Picking up 100 golden gears gains Donald an extra life while collecting five within a second or less spells out one letter of the word SPECIAL. Once the word is completed and the level finished, Donald's nephews will teach him a special move. These moves make him invincible for a short time and result in the gears being worth more when picked up. To activate a move, Donald must jump on three enemies in a row without touching the ground, then pressing the activation button to begin entering a unique button combination within three seconds.<br><br>When Donald is hit by an enemy or hurt by a trap, he gets in a grumpy mood (indicated by his trademark quacking) and the next hit means the loss of a life. Picking up a milkshake will restore his good mood and health, however. Should he find a glass of orange juice, he becomes Hyper Donald for a short time, allowing him to run over enemies and crash through walls to find hidden areas. Stashed away there (but also sometimes in plain sight) are golden threads. Picking up all three per level unlocks bonus costumes that Donald can change into in Gyro's lab.<br><br>Each of the four worlds features three or four levels, plus a training stage and a boss fight. The boss fights follow the classic template of each boss repeating an attack pattern that must be avoided, as well as a single weakness that can be exploited to finish them off.",
  "publishedBy": "Ubi Soft Entertainment Software",
  "developedBy": "Ubi Soft Divertissements Inc.",
  "released": "Mar 26, 2002",
  "alsoFor": "PlayStation 2, PlayStation 3 | Combined View",
  "genre": "Action",
  "perspective": "3rd-person (Other), Behind view, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/disneys-donald-duck-goin-quackers__",
  "visual": "2D scrolling",
  "gamePlay": "Platform",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Ubi Soft Entertainment Software",
          "developer": "Ubi Soft Divertissements Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "2002",
          "ean13": "3 307210 114365",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/153343-disney-s-donald-duck-goin-quackers-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Germany  and The Netherlands",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/153344-disney-s-donald-duck-goin-quackers-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Germany  and The Netherlands",
      "platforms": "GameCube"
    }
  ]
}