{
  "name": "Disney's Party",
  "shortName": "disneys-party_",
  "description": "From <a href=\"https://www.mobygames.com/search/quick?gamegroup=Mario+Party+series\">Mario Party</a> creator Hudson Soft comes a similar party game using the Disney license and characters.<br><br>For the main game modes (Game Board and Pairs), players can select from six characters: Mickey and Minnie Mouse, Donald and Daisy Duck, Goofy, and Billy the Ghost. Uncle Scrooge invites four of them to his theme park. At the beginning of the game, each character is handed a five-by-five game board, with randomized colors. The goal is to complete rows on the board (how many can be adjusted before a game) by putting items of the appropriate color on the board, with the first player to complete his board being the winner.<br><br>The characters move on a 3D game board. Movement is not made via dice but the so-called Wheel of Destiny. Players choose which space on the board they want to go to next. More players wishing for the same space increases its chances of being chosen. All characters then move to the selected space together.<br><br>There are 14 different types of space, including items, events, shops (which use crystals as currency), transportation to another part of the board, and mini-games. The mini-games, of which there are 30 different ones, are the main part of the game. All are played by all four characters together and include racing, shooting, image-matching, counting, pressing displayed button combinations, and many more. The goal is to collect a number of stars, with the player who reaches the number first being the winner. Power notes, which can either be found or bought in shops, can be used to give an advantage during a mini-game.<br><br>To reach the goal of completing the rows, found or bought items can be placed on the game boards upon winning a mini-game or reaching the appropriate space. Items can be put on other player's boards, too, to help or sabotage their efforts. Special items include ones that re-arrange the board grid or block off rows.<br><br>Once the set number of rows is completed, the main game ends, but a final challenge round follows, consisting of another mini-game and special awards for the likes of &quot;best item collector&quot; or &quot;best mini-game player&quot;. The player who completed the rows first starts with an advantage, but it is also possible for other players to win if they were better in the award categories. Completing the game unlocks collectible character cards, depending on the reached score.<br><br>Unlocked mini-games can be played on their own in the Mini-Game Mode, while Free Pass mode allows one to navigate around the game board freely and try out any attraction or game.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Neverland Co., Ltd.",
  "released": "Sep 17, 2003",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/disneys-party_",
  "visual": "",
  "gamePlay": "Board game, Mini-games",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Hudson Soft Company, Ltd.",
          "developer": "Neverland Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 01, 2002",
          "ean13": "4 988607 500030",
          "comments": "Hudson the Best release"
        },
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Neverland Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 17, 2003",
          "ean13": "5 030935 033588",
          "comments": ""
        },
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Neverland Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 17, 2003",
          "ean13": "5 030935 033588",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/186393-disney-s-party-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/186394-disney-s-party-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/186395-disney-s-party-gamecube-media.jpg",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    }
  ]
}