{
  "name": "Drome Racers",
  "shortName": "drome-racers",
  "description": "<i>Drome Racers</i> is a futuristic combat racing game based on the LEGO (Drome) Racers line of construction toys from 2002. <i>Drome Racers</i> features on- and off-road racing in vehicles that resemble their LEGO counterparts, with some designs being completely new. <br><br>The game focuses on the Career mode, where the player takes the role of Max Axel, the driver of the newly-formed Team Nitro, one of the six racing teams in Drome, a large elliptic racing arena with many different natural and urban surroundings. All drivers compete in a set of Multi Challenge Races (MCR), which are a series of connected races. At the start of each MCR, a drag race determines the pole position, while in all subsequent races, the position, and delay at which the driver approaches the starting line is determined by the results of the previous race. Hence, whoever wins the last race of an MCR, wins the MCR itself. There are 9 standard tracks available, and each one has A and B variations (up to half of the track can differ), and can be driven in forward or backward directions, resulting in 4 ways to drive on each track. Three MCR categories exist; Novice, Intermediate, and Expert, with the opening MCRs of each category unlocking new tracks. Different times of day and weather conditions are also featured.<br><br>After a certain number of MCRs, individual drivers will challenge Max to race in all four variations of a track. Finishing in fourth place or better (or just first in challenges) earns upgrade points (which can be used to improve the engine, turbo, aerodynamics, tires, and armour), and finishing certain MCRs or challenges earns build tokens, which can be used to unlock new cars. All cars can be driven with automatic or manual gear changing, except for manual-only drag cars. <br><br>Scattered on the tracks are health and weapon powerups, as well as accelerator pads. Each car has four measures of health - the less health it has, the slower it gets, and when it loses all the measures in the health meter, some (non-essential) parts can fall off the car. Various weapons add to the arcade nature of the game and help drivers maintain their position or press forward. <br><br>Joining Max in Team Nitro are Rocket, a retired driver who arranges practice and challenge sessions and gives tips on the game mechanics; Shicane, the team's mechanic who informs Max of the upcoming races and manages the garage (cars, upgrades, and unlocking); and Slot, the analyst who follows Max' statistics and enables saving/loading of the Career mode progress. They assist Max in winning the 2015 Drome championship and dethroning the current champion, Sever from Team Exo Force.<br><br>In addition to the Career mode, players can choose Arcade mode and the Quick Race mode (which is the same as Arcade, only with randomized settings). These modes only feature tracks that have been unlocked in at least one saved game from the Career mode and can be played by one or two players in local split-screen multiplayer.",
  "publishedBy": "LEGO Interactive",
  "developedBy": "Attention to Detail Limited",
  "released": "Sep 16, 2003",
  "alsoFor": "PlayStation 2, Windows | Combined View",
  "genre": "Racing / driving",
  "perspective": "1st-person, Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/drome-racers",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "LEGO Interactive",
          "developer": "Attention to Detail Limited",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 16, 2003",
          "ean13": "5 030931 034053",
          "comments": ""
        },
        {
          "publisher": "LEGO Interactive",
          "developer": "Attention to Detail Limited",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 16, 2003",
          "ean13": "5 030931 034053",
          "comments": ""
        },
        {
          "publisher": "LEGO Interactive",
          "developer": "Attention to Detail Limited",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 16, 2003",
          "ean13": "5 030931 034053",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/80416-drome-racers-gamecube-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "United States",
      "platforms": "GameCube"
    },
    {
      "link": "https://www.mobygames.com/images/covers/l/80418-drome-racers-gamecube-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "United States",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/80419-drome-racers-gamecube-media.png",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "United States",
      "platforms": "GameCube"
    }
  ]
}