{
  "name": "The Fairly OddParents!: Breakin' da Rules",
  "shortName": "fairly-oddparents-breakin-da-rules_",
  "description": "<i>The Fairly OddParents: Breakin' da Rules</i> is a 3D platformer game based on <i>The Fairly OddParents</i> cartoon. The game starts with Timmy’s parents leaving for a seminar weekend leaving the babysitter Vicky in charge. Timmy accidentally wishes he doesn’t have to follow the rules from Cosmo and Wanda’s fairy rulebook anymore. Cosmo grants this wish with the rulebook falling to the floor, but soon a news bulletin arrives that states that the first person touching the book will gain Cosmo and Wanda’s powers. Moments later Vicky picks up the book spelling trouble for Timmy and the fairies. Cosmo, Wanda, and Timmy are then summoned to the Fairy court. They are found guilty for losing the rulebook and are sentenced to retrieve the rulebook within 49,5 hours or lose their Fairy license forever.<br><br>In the game, you take control of Timmy Turner and have to retrieve the pages from the rulebook through a variety of environments ranging from cyberspace to a medieval castle. Gameplay includes platforming, defeating enemies, and puzzle-solving. As well as collecting wish stars (5 stars for a wish) and crowns (100 crowns for another chance at a failed task). All levels are accessed from different objects in the house.",
  "publishedBy": "THQ Inc.",
  "developedBy": "Blitz Games Ltd",
  "released": "Nov, 2003",
  "alsoFor": "PlayStation 2, Xbox | Combined View",
  "genre": "Action",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/fairly-oddparents-breakin-da-rules_",
  "visual": "",
  "gamePlay": "Platform, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "THQ Inc.",
          "developer": "Blitz Games Ltd",
          "ported": "",
          "country": " United States",
          "releaseDate": "Nov, 2003",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}