{
  "name": "FIFA Street 2",
  "shortName": "fifa-street-2",
  "description": "Take your skills out of the stadium and into the street in EA's second installment of the FIFA Street franchise. <i>FIFA Street 2</i> includes a new trick stick control mechanic, improved tricks, and a skill-testing juggle mechanic. You can dupe your opponent, juggle the ball on your knees and shoulders, and there are various new combos to show off. Pick from 20 teams from around the globe and watch over 300 of your favorite football stars duel it out in 4-on-4 match-ups. Select from 10 playable venues ranging from London's Westway Leisure Center to the sandy beaches of Brazil.<br><br>You can do quick matches (Play Now), change the looks and skills of players in the Creation Zone, and design your own venue. The main game modes include Friendly, Rule the Street (the career mode), and Skills Challenge where you can show off your football tricks. The career mode adds new goals in this version, based on acquiring a certain amount of skill points, scoring lots of goals, or scoring only with gamebreakers. You can select a radio station to play during the matches, mixing music with commentary.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Electronic Arts Canada",
  "released": "Feb 28, 2006",
  "alsoFor": "PlayStation 2, PSP, Xbox | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/fifa-street-2",
  "visual": "2D scrolling",
  "gamePlay": "Tricks / stunts",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts Canada",
          "ported": "",
          "country": " United States",
          "releaseDate": "Feb 28, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/66260-fifa-street-2-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Promotional",
      "country": "United Kingdom",
      "platforms": "GameCube"
    }
  ]
}