{
  "name": "From TV Animation One Piece: Treasure Battle!",
  "shortName": "from-tv-animation-one-piece-treasure-battle",
  "description": "<i>One Piece: Treasure Battle!</i> is a party game starring characters from the One Piece anime and manga series. The Straw Hat crew meets the reporter Rocky Hattari and agrees to compete in a Treasure Battle. In the Scenario (story) mode the player can choose between four difficulty levels. These are: easy with Luffy and Vivi, normal with Zoro and Ace, hard with Sanji with Nami and extra hard Usopp and Chopper. <br><br>In the scenario mode, the player will compete in a series of mini-games. These are:\n<ul><li>Treasure Battle – two teams fight over a treasure chest and have to get their ship to pick it up;\n<li>Battle Royal – the teams have to beat each other up scoring a point when the opponents live bar reaches zero;\n<li>Kung Fu Survival – the team that beats up the most seals wins;\n<li>Teamwork Rally – a chest must be passed between team members;\n<li>Cross Country – a race with sub-stages in which the players will race individually. The final position is determent by the results in the sub-stages;\n<li>Pirate Soccer – the teams play soccer with a gigantic ball;\n<li>Treasure Hunt – players wait until an arrow appears directing them to a treasure chest.</ul>\n",
  "publishedBy": "Bandai Co., Ltd.",
  "developedBy": "",
  "released": "Nov 01, 2002",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/from-tv-animation-one-piece-treasure-battle",
  "visual": "",
  "gamePlay": "Mini-games, Party game",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Bandai Co., Ltd.",
          "developer": "",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Nov 01, 2002",
          "ean13": "4 543112 107510",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}