{
  "name": "GT Pro Series",
  "shortName": "gt-pro-series",
  "description": "The Wii game <i>GT Pro Series</i> or <i>GT Cube</i> as the Japanese-only GameCube release, is a cel-shaded racing game that is a soft-simulation of real-world racing. The game allows you access to over 80 tunable vehicles from ten different Japanese manufacturers. Many of these cars are locked and must be obtained by playing through the game. In addition, there are several modes of play to use them on, which are Championship, Quick Race, Time Attack, Versus, and Drift-Combo.<br><br>A fairly standard staple in the racing genre, the Championship is a rather straight forward career mode. In this mode, you have four classes ranging from Beginner to Professional. Beginner is free to get in, but the next three classes require you to finish the previous class and then acquire a license by passing a series of driving tests. Certain races in each class have limits on what cars can be entered, forcing you to mix things up a bit and develop different strategies.<br><br>Quick Race is good if you just want to jump into the game and start. You can use any parts, cars, and tracks you've unlocked so far from the Championship mode.<br><br>Time Attack is a time trial mode where the object is to get the best time you can with the car and track you choose.<br><br>Versus is the game's multiplayer mode. Two to four players can battle it out with any unlocked cars and tracks.<br><br>Drift-Combo is a challenging mode that scores you based on how well you can drift on a selection of three drift courses. Connecting drifts raises your score and subsequently, your ranking on the board.<br><br>The Wii version is bundled with a steering wheel.",
  "publishedBy": "MTO Co., Ltd.",
  "developedBy": "MTO Co., Ltd.",
  "released": "Jun 20, 2003",
  "alsoFor": "Wii | Combined View",
  "genre": "Racing / driving",
  "perspective": "1st-person, Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/gt-pro-series",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "MTO Co., Ltd.",
          "developer": "MTO Co., Ltd.",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Jun 20, 2003",
          "ean13": "4 536478 000496",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}