{
  "name": "Madden NFL 2005",
  "shortName": "madden-nfl-2005__",
  "description": "The Madden series returns for another year with <i>Madden NFL 2005</i>. Besides the usual roster updates, the major gameplay changes in this iteration mostly concern defensive play. There are also expansions to the franchise mode and to online modes along various other additions and changes.<br><br>Major changes to defensive play include the introduction of the Hit Stick: it allows precise and context-sensitive tackling through the use of the second analog stick. There is now also defensive playmaker control (allowing on-the-fly position changes) and defensive hot routes. The offense was also expanded and now allows for formation shifts on the line.<br><br>The franchise mode now features the Storyline Central option, which features an &quot;EA Sports Radio&quot; show hosted by Tony Bruno, featuring news and reports around games and the league, interviews with players and call-ins from fans. There are also newspaper articles (featuring real licensed papers from around the US), emails from players and coaches and more. All of this is accessed through a redesigned interface resembling a PDA. Another new feature is morale for players, which changes throughout the season depending on their contracts, win-lose performance, being benched and more. The draft system has also been revised, and drafting new players can also affect the morale of existing players.<br><br>Another new feature is called Create-A-Fan: players can create fans with an editor, having them put on outlandish costumes and then watch them sit in the stadium during a game.<br><br>This year's edition is the first to feature online play for the Xbox via Xbox Live and introduces online league play for the first time on both PS2 and Xbox.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "EA Tiburon",
  "released": "Aug 09, 2004",
  "alsoFor": "PlayStation 2, Windows, Xbox | Combined View",
  "genre": "Sports",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "Football (American)",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/madden-nfl-2005__",
  "visual": "2D scrolling",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "EA Tiburon",
          "ported": "",
          "country": " United States",
          "releaseDate": "Aug 09, 2004",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/146083-madden-nfl-2005-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "United States  and Canada",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/146084-madden-nfl-2005-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "United States  and Canada",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/146085-madden-nfl-2005-gamecube-media.jpg",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "United States  and Canada",
      "platforms": "GameCube"
    }
  ]
}