{
  "name": "Major League Baseball 2K6",
  "shortName": "major-league-baseball-2k6",
  "description": "<i>Major League Baseball 2K6</i> is an update of it's previous <a href=\"https://www.mobygames.com/game/major-league-baseball-2k5\">years version</a>, featuring the obligatory roster updates as well as a three year report of all the teams and players in the game.  It also featured a brand new movement system as well as realistic player crashes and a morale system, where the better the player is, the more their teammates will perform better as well.<br><br>It has the standard modes, exhibition, season as well as a new feature letting players take on the role of an international team in the World Baseball Classic as one of sixteen international baseball teams in a tournament style play.  Players can also challenge umpires if they feel a call has been botched, this can also effect the teams morale, for better or worse depending on the outcome.<br><br>It also featured TV broadcast &quot;flashback replays&quot;, giving it a real feel of a TV presentation as well as being commented on by Jon Miller and the legendary Joe Morgan.  The Xbox 360 version was virtually the same as the previous generations, said for graphics and some extra dialogue and commentary.  Also, Derek Jeter endorsed and graced the cover on all it's console and handheld releases as well.<br><br>There is also online capabilities for each console version with the ability to download a friends profile using the V.I.P. (Virtually Identity Profile), with the ability to look at their stats and results of their own games, letting them gain an upper hand against their friends in online matches.",
  "publishedBy": "2K Sports",
  "developedBy": "Kush Games, Inc.",
  "released": "Jun 12, 2006",
  "alsoFor": "PlayStation 2, Xbox, Xbox 360 | Combined View",
  "genre": "Sports",
  "perspective": "1st-person, 3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Baseball",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/major-league-baseball-2k6",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "2K Sports",
          "developer": "Kush Games, Inc.",
          "ported": "",
          "country": " United States, Canada",
          "releaseDate": "Jun 12, 2006",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}