{
  "name": "Mat Hoffman's Pro BMX 2",
  "shortName": "mat-hoffmans-pro-bmx-2",
  "description": "Mat &quot;The Condor&quot; Hoffman and nine other world-class Pro BMX riders feature in this entry to the BMX racing series. Many gameplay features remain as before.<br><br>With the use of DVD technology, actual video footage of Mat and the crew was taken from their recent road trip and put into the game to give you a feeling of actually being there with them. Flatland tricks are another new addition. Also, there is the ability to tweak almost any stunt.<br><br><b>Single Player Modes:</b><br><br><b>Session</b> - Take some extra time to practice your tricks and routines in 2, 5, or 10 minute sessions on any of the levels that are unlocked. Scores can be saved to be put into the Hall of Fame.<br><br><b>Free Ride</b> - Like Session, you can use this time to practice your skills but with unlimited time. Any score you get for a trick is replaced by the points of the next trick. Since this is the case, no scores can be saved.<br><br><b>Road Trip</b> - This is where you take the trip with the guys to go around and compete around the country. Withine each level there are goals to reach to improve your skills, unlock new levels, unlock bikes, and secrets in the game.<br><br><b>Multiplayer Modes:</b><br><br><b>Trick Attack</b> - Compete against each other in a split screen competion to get the highest score you can in a certaon amount of time.<br><br><b>Free Ride</b> - Ride around showing off your stuff to your opponent.<br><br><b>Graffiti War</b> - Ride around and find the Spray Cans in the level, once you find them, perform a trick on the terrain. Once a stunt is completed your oppenent's screen  will be &quot;painted.&quot; The opponent can perform a higher scoring trick to clear the paint.<br><br><b>Tag</b> - The person that is &quot;it&quot; is the only one that can score points. Be the first to find the red ring to be it. While you're it score as many points as you can. The person not it must track the other down and knock into them to be it. If the person that is it bails then the other person will become it.<br><br><b>H.O.R.S.E.</b> - Just like the old game of HORSE for basketball. In this case you need to perform a higher scoring run to beat them for the letter. The one with the lower score with be given a letter. The first person to spell HORSE is the loser.<br><br><b>Treasure Hunt</b> - Race against each other to find the Golden Condor. Getting the Condor is the only way to score points.<br><br><b>Half Pipe Hell</b> - Up to 8 players can play HotSeat style. You must take turns tricking your way up a mountain of terraced half pipes. The only way to score is to climb to the top by transferring pipe to pipe.<br><br><b>Push</b> - This is like Trick Attack, but as you score more and more points your opponent's screen will get smaller and smaller. The loser is the one that gets push all the way off the screen.<br><br>The Pros in the game include Mat Hoffman, Joe Kowalski, Rick Thorne, Mike Escamilla, Simon Tabron, Kevin Robinson, Cory Nastazio, Ruben Alcantara, Seth Kimbrough, and Nate Wessel.<br><br>The locations you get to go to are Oklahoma City, Chicago, Las Vegas, New Orleans, Boston, Los Angeles, Portland, and Hawaii.<br><br>To enhance the game, there is also a park editor so that you can make your own dream areas to ride in.<br><br>Exclusive to the XBox version, you get to be able to ride in London, UK and have an extra rider - Chad Kagy.",
  "publishedBy": "Activision Publishing, Inc.",
  "developedBy": "Rainbow Studios, Inc.",
  "released": "Oct 08, 2002",
  "alsoFor": "PlayStation 2, Xbox | Combined View",
  "genre": "Action, Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/mat-hoffmans-pro-bmx-2",
  "visual": "",
  "gamePlay": "Tricks / stunts",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "Rainbow Studios, Inc.",
          "ported": "Gratuitous Games",
          "country": " United States",
          "releaseDate": "Oct 08, 2002",
          "ean13": "5 030917 017391",
          "comments": ""
        },
        {
          "publisher": "Activision Publishing, Inc.",
          "developer": "Rainbow Studios, Inc.",
          "ported": "Gratuitous Games",
          "country": " United States",
          "releaseDate": "Oct 08, 2002",
          "ean13": "5 030917 017391",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/15617-mat-hoffman-s-pro-bmx-2-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "United States , Canada  and Mexico",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/15618-mat-hoffman-s-pro-bmx-2-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "United States , Canada  and Mexico",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/15619-mat-hoffman-s-pro-bmx-2-gamecube-media.jpg",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "United States , Canada  and Mexico",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/51617-mat-hoffman-s-pro-bmx-2-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Finland  and United Kingdom",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/51618-mat-hoffman-s-pro-bmx-2-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Finland  and United Kingdom",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/51619-mat-hoffman-s-pro-bmx-2-gamecube-media.jpg",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "Finland  and United Kingdom",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/190912-mat-hoffman-s-pro-bmx-2-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/190913-mat-hoffman-s-pro-bmx-2-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    }
  ]
}