{
  "name": "NHL 06",
  "shortName": "nhl-06",
  "description": "New rules and updated rosters and season schedules feature in this update of the longrunning <i>NHL</i> series, as do many new features.<br><br>Deking is now performed using the left analog stick, with swift signature moves of star players that confuse opponents and reward skill. The same stick is used to increase the accuracy when shooting. While preparing for a shot, a bull's-eye appears in the enemy goal and you can quickly move the target to the corners for precision. To add to the individual qualities, statistics such as speed and size are now reflected during gameplay in the players' momentum and turning radius. To get past opponents quickly, you can generate momentum for quick speed boosts.<br><br>With the introduction of R.P.M. (Realistic Puck Momentum) dynamics, there is more randomness with the puck, as a shot off the mask can now stun goalies. Another small addition is the deformation of the ice during the match. In the player creation mode, where you can now apply bruises, broken noses, black eyes and scars to your players, the thumbstick is used for &quot;face sculpting&quot; - changing the different features.<br><br>All the regular game modes are present, of which the Dynasty Mode from the previous version is the most complete, with scouting and full management options, inside and outside the arena. Contrary to the last game, you can now intervene during simulated AI games and win the match for your team.<br><br>The PC, PS2 and Xbox version support online multiplayer games, and as a special bonus, the original <a href=\"https://www.mobygames.com/search/quick?game=NHL+94\">NHL 94</a> game, one of the first in the series, has been included with the PS2 edition.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Electronic Arts Canada",
  "released": "Sep 09, 2005",
  "alsoFor": "PlayStation 2, Windows, Xbox | Combined View",
  "genre": "Sports",
  "perspective": "Behind view, Bird's-eye view, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "Hockey",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/nhl-06",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts Canada",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 09, 2005",
          "ean13": "5 030931 045516",
          "comments": ""
        },
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts Canada",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 09, 2005",
          "ean13": "5 030931 045516",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/191103-nhl-06-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/191104-nhl-06-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Germany",
      "platforms": "GameCube"
    }
  ]
}