{
  "name": "Rayman Arena",
  "shortName": "rayman-arena",
  "description": "<i>Rayman Arena/Rayman M</i> is the first multiplayer game in the Rayman series. It's not a platformer like earlier games of the Rayman franchises but a race and arena battle game. The game is divided in five leagues (beginner, advanced, expert, extreme and bonus) the first four have each three racing tracks and three arena’s that increase in difficulty.<br><br>The racing mode is split in four different race types:\n<ul><li>Training: for exploring and practice of the racecourse and setting personal records;</li>\n<li>Race: up to four different characters race each other over several rounds with the first one crossing the finish line wining;</li>\n<li>Popolopoï: one must reach the finish line before the time that is counting down  reaches zero. Time can be replenished by shooting some kind of butterflies called a Popolopoï and no opponents are to be beaten;</li>\n<li>Lums: over three laps a certain amount Lums have to be collected  and one must beat the other opponents to the finish line.</li></ul>\nThe arena battle mode is split in three different battle types:\n<ul><li>Lum Spring: before the time runs out or the first to collect five Lums/crystals wins. Ice bullets can be fired at an opponent to temporally freeze them and beat them to the lum;</li>\n<li>Lum Fight: all players start with five hit points each that need to be shot of with weapons found around the arena. A point is scored if a player shoots of the last hit point of an other player. The first to reach a certain amount of points or the one with the most points at the moment the time runs out wins. When killed through one’s own actions a negative point is scored;</li>\n<li>Capture the Fly: the goal is to find and capture a Light-Fly. The fly follows you around and if a certain amount of time has passed a point is awarded. One loses control of the fly when hit by a bullet of an opponent. The first to reach a certain amount of points or the one with the most points at the moment the time runs out wins.</li></ul>\nPlayable character include:\n<ul><li>Rayman: the series main protagonist a creature without arms, legs and neck but with hands, feet and a head that can move independently from his body;</li>\n<li>Globox: some kind of frog and Rayman's best friend;</li>\n<li>Teensies: a pair of strange dwarfs working together;</li>\n<li>Tily: a cat like fairy;</li>\n<li>Admiral Razorbeard: the final boss of <a id=\"d9e245372f5acd6e3b58a167c492ad8c8\" href=\"https://www.mobygames.com/search/quick?game=Rayman+2%3a+The+Great+Escape\">Rayman 2</a>;</li>\n<li>Henchman 800: one of the Robo-Pirates from Rayman 2;</li>\n<li>Henchman 1000: an other Robo-Pirate;</li>\n<li>Razorwife: Admiral Razorbeard's wife.</li></ul>\nTo unlock rewards such as bonus levels, additional leagues, character skins, and new characters finishing first in races and arena’s is required.\n",
  "publishedBy": "Ubi Soft Entertainment Software",
  "developedBy": "Ubi Soft Entertainment Software",
  "released": "Sep 24, 2002",
  "alsoFor": "PlayStation 2, PlayStation 3, Windows, Xbox | Combined View",
  "genre": "Action, Racing / driving",
  "perspective": "Behind view, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/rayman-arena",
  "visual": "",
  "gamePlay": "Fighting",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Ubi Soft Entertainment Software",
          "developer": "Ubi Soft Entertainment Software",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep 24, 2002",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/81669-rayman-arena-gamecube-front-cover.png",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "United States",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/81675-rayman-arena-gamecube-back-cover.png",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "United States",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/81678-rayman-arena-gamecube-media.png",
      "scanOf": "Media",
      "packaging": "Keep Case",
      "country": "United States",
      "platforms": "GameCube"
    }
  ]
}