{
  "name": "Sqrxz III",
  "shortName": "sqrxz-iii",
  "description": "<i>Sqrxz III</i> is a 2D side-scrolling platformer with a focus on a very high difficulty level. Visually and acoustically the game is resembling platform games from the early 90s. You start the game with 6 lives, but due to tricky passages it's almost impossible to beat even the first level on the first run. In contrast to a few other games (e.g. <a href=\"https://www.mobygames.com/game/eryis-action\">Eryi's Action</a>) the difficulty is not caused by unforseen traps, but by the need of good reflexes and problem solving skills instead.<br><br>Like previous games in the series also this part has some basic back story to it: Our hero Sqrxz is on vacation with his girlfriend Yve, when an &quot;evil power&quot; suddenly kidnaps Yve and forces you to collect all rings spread in the 10 levels - when you missed a ring you will not be able to exit a level. The causes of death are numerous, among others touching spikes or enemies, drowning, being squashed or falling into a pit. When dying you have to restart from the beginning of the level or the last checkpoint - but you do have unlimited continues, with the only penalty loosing your score and having to restart the level from the beginning.<br><br>Controls are simplistic: You can only move to the left / right, jump and move slowly. Jumping onto some kinds of enemies will kill or stun them, and basic interaction with the environment is done by touching an item to activate it or pushing a crate to move it.",
  "publishedBy": "Retroguru",
  "developedBy": "",
  "released": "Apr 15, 2015",
  "alsoFor": "Amiga, Dreamcast, GP2X, GP2X Wiz, Linux, Macintosh, PSP, Symbian, Windows | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/sqrxz-iii",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Retroguru",
          "developer": "",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Apr 15, 2015",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}