{
  "name": "Surf's Up",
  "shortName": "surfs-up",
  "description": "<i>Surf’s Up</i> is a surfing game based on the movie of the same name. The game features 10 players in total (4 at the beginning and 6 more to unlock), 5 areas with 2-4 stages each and 3 basic modes for you to play. A Championship mode, a Multiplayer mode and a Leaf Sliding mode.<ul><li>Championship: The place where you can surf as much as you like and unlock all the characters and stages by successfully completing the challenges of the Championship races. These challenges include performing tricks to reach a set high score, passing through certain gates and collecting red penguin statues.</li><br>\n<li>Multiplayer: Multiplayer mode supports up to 4 players but you have to unlock the stages in Championship races.</li><br>\n<li>Leaf Sliding: In this mode you go down a volcano not on a surfing board but on a huge leaf instead and must reach the finishing line within a certain time limit.</li></ul>There is also the Extras option where you can see things you have unlocked like art, videos etc.<br><br>The PS3 version features an Exclusive Content option with additional film footage.",
  "publishedBy": "Ubisoft, Inc.",
  "developedBy": "Ubisoft Divertissements Inc.",
  "released": "May 29, 2007",
  "alsoFor": "PlayStation 2, PlayStation 3, Wii, Windows, Xbox 360 | Combined View",
  "genre": "Sports",
  "perspective": "Behind view",
  "theme": "",
  "nonSport": "",
  "sport": "Snowboarding / skiing, Surfing",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/surfs-up",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Ubisoft, Inc.",
          "developer": "Ubisoft Divertissements Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "May 29, 2007",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}