{
  "name": "Top Angler",
  "shortName": "top-angler",
  "description": "<i>Top Angler</i> is a single-player bass fishing game.The game features three lakes the lodge, the forest and the park which can be fished different seasons, times of day and weather conditions. There are four modes of play in this game:<ul>\n<li>Tournament: there are four tournaments, the Top Angler's Open, the Bass Challenge Invitational, The Bass Master's Championship and the Top Angler's Autumn Trail. The player starts on the Top Angler's Open and plays through the remaining three. At the end of each tournament the player may win additional lures and other prizes.</li><br>\n<li>Arcade: here there are three courses, Easy, Normal and Hard. The player must beat the course record on each in order to progress to the next. Each course consists of three timed rounds, one in each lake.</li><br>\n<li>Challenge: there are nine challenges which can be played in any order, they are based on catching either specific fish, such as 'Catch three super big bass only' and 'Catch ten bass without catching a blue gill', or to quantity such as 'Catch a total of forty pounds of bass', or Catch five smallmouth bass'</li><br>\n<li>Practice: in this mode the player can fish any lake, in any season, any time of day and in any weather</li></ul>In all modes apart from Practice mode the location, season and weather conditions are preset. The player starts with a minimal amount of lures for fishing on the top, middle, deep and bottom of the lakes and acquires more by competing in tournaments etc.",
  "publishedBy": "Xicat Interactive",
  "developedBy": "SIMS Co., Ltd.",
  "released": "2003",
  "alsoFor": "PlayStation 2 | Combined View",
  "genre": "Sports",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "Fishing",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/top-angler",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Xicat Interactive",
          "developer": "SIMS Co., Ltd.",
          "ported": "",
          "country": " United States",
          "releaseDate": "2003",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/191046-top-angler-gamecube-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Keep Case",
      "country": "Germany  and United Kingdom",
      "platforms": "GameCube"
    },
    {
      "link": "/images/covers/l/191047-top-angler-gamecube-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Keep Case",
      "country": "Germany  and United Kingdom",
      "platforms": "GameCube"
    }
  ]
}