{
  "name": "UEFA Champions League 2004-2005",
  "shortName": "uefa-champions-league-2004-2005",
  "description": "After many years under <a href=\"https://www.mobygames.com/search/quick?company=Eidos%2c+Inc%2e\">Eidos</a>/<a href=\"https://www.mobygames.com/search/quick?company=Silicon+Dreams+Studio+Ltd\">Silicon Dreams</a> ownership and development, EA releases the official Champions League game for the 2004/2005 season. <br><br>The last rehash of the engine debuted on <i><a href=\"https://www.mobygames.com/search/quick?game=FIFA+Soccer+2003\">FIFA 2003</a></i>, it draws most of it's gameplay elements from the <i><a href=\"https://www.mobygames.com/search/quick?game=FIFA+Soccer+2005\">2005</a></i> edition, but with some changes to gameplay such as a slightly more aggressive AI on attack (reducing the need to constantly push players forward using the <i>Off The Ball</i> controls, still present), new refereeing aspects such as some deliberate errors (as in occasional bad offside calls or throw-ins, not cheating the player through mistakes),  advantage rule and handballs and a new set piece system, which replaces the much criticized &quot;targeting&quot; and &quot;push and shove&quot; featured in 2005. This system is much less rigid and less formulaic, as a directional arrow and powerbars define how balls are crossed and there are four player movement setups, thus making each corner and indirect free kicks different. For direct free kicks, players have the option to take driven or curved shots or drop a pass to a nearby player to explore a gap in the defense. All options are available at all times, instead of being determined by the distance to goal. \nMany of these changes were later adapted into the new <i><a href=\"https://www.mobygames.com/search/quick?game=FIFA+06\">FIFA 06</a></i> engine, and it was also chosen as the match engine for subsequent <a href=\"https://www.mobygames.com/search/quick?company=Bright+Future\">Bright Future</a>'s  <i><a href=\"https://www.mobygames.com/search/quick?gamegroup=Total+Club+Manager\">FIFA Manager</a></i>. <br><br>The presentation takes notes from real television broadcasts, with goals, fouls and attempts on goal being recapped not only in the full-time highlight reel but also during game stoppages and PiP popups. As the game is presented in a faux letterboxed format, next to the scoreline some statistics occasionally popup, allowing to keep track of them for some missions. A very requested feature, the ability to see the energy bars of the closest players to the ball of both teams, was finally included, as well as icons for the special abilities (speed, shooting, dribbling or tackling) of the best players.<br><br>The Champions League, where the player leads one team to the Final in the Atatürk Olympic Stadium in Istanbul, in the quest to succeed FC Porto as European Champions, is one of the available modes, but not the most important. That honour goes to the &quot;The Season&quot; mode, where the player starts by creating his managing avatar, and then proceeds to a a series of 50 missions, with the first being a close last-week match against a Champions League spot rival, proceeding with a buyout of the club and increased expectations, and (hopefully) closing with the Champions League final.  This mode also allows players to unlock additional features such as balls, a stadium and special exhibition modes by fulfilling objectives set by the club president during the season, some of them crucial matches (which can result in a sacking if  failed), others simply a matter of balancing the squad. Other modes include the usual friendlies, &quot;home and away&quot; (a two-legged friendly), scenarios (where the player can create situations such as a defending a 1-0 nil for 45 minutes while two man down) and practice.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Electronic Arts Canada",
  "released": "Feb 02, 2005",
  "alsoFor": "PlayStation 2, Windows, Xbox | Combined View",
  "genre": "Sports",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "Licensed",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/gamecube/uefa-champions-league-2004-2005",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "GameCube",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts Canada",
          "ported": "",
          "country": " The Netherlands",
          "releaseDate": "Feb 02, 2005",
          "ean13": "5 030931 039829",
          "comments": ""
        },
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Electronic Arts Canada",
          "ported": "",
          "country": " The Netherlands",
          "releaseDate": "Feb 02, 2005",
          "ean13": "5 030931 039829",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}