{
  "name": "Cool Cool Jam",
  "shortName": "cool-cool-jam",
  "description": "<i>Cool Cool Jam</i> is a rhythm-based game released simultaneously with <i>Cool Cool Toon</i> for the Dreamcast. Players take control of Wave or Midi - Kids that got transported 1000 years into the future to a world full of colorful music loving characters in a town called Musey Town. Upon arriving to the town, you find out from Lan-K, a bass guitar player, that there's only one way to return to your world and that's to become a musical sensation and impress the Jazzy Egg. Thus, having only a bass player from the beginning, players have one week to form a band and achieve this goal.<br><br>Musey town is broken up into several areas each having their own theme and music genre and players will need to talk to various inhabitants and complete a mini-game involving clapping at the right time based on a tune's rhythm. Successfully completing this mini-game will get the attention of the characters which will then progress the story.<br><br>Apart from the mini-game, players will need to challenge various musicians and in that case, the game will have players hold their console in different orientations to play the instruments available in the game.<br><br>Apart from the story mode, the game also offers players to compete with each other or the CPU on playing some of the in-game tunes and each player can choose which instrument they would like to play.<br><br>If players link their Neo Geo Pocket Color to the Dreamcast, they can transfer the points they've earned in this game to unlock more costumes and characters in <i>Cool Cool Toon</i>.",
  "publishedBy": "SNK Corporation",
  "developedBy": "SNK Corporation",
  "released": "Aug 10, 2000",
  "alsoFor": "",
  "genre": "Adventure",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/neo-geo-pocket-color/cool-cool-jam",
  "visual": "2D scrolling",
  "gamePlay": "Music / rhythm, RPG elements",
  "setting": "",
  "release": [
    {
      "system": "Neo Geo Pocket Color",
      "releases": [
        {
          "publisher": "SNK Corporation",
          "developer": "SNK Corporation",
          "ported": "",
          "country": " Japan",
          "releaseDate": "Aug 10, 2000",
          "ean13": "4 964808 601783",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1042681-cool-cool-jam-neo-geo-pocket-color-screenshot-the-title-screen.png",
      "caption": "The Title Screen."
    }
  ],
  "cover": []
}