{"name": "Defcon 5", "overview": "As a \"cyberneer\" working for the fictional Tyron Corporation, the player is tasked with installing an automated defense software at the deep space mining installation named MRP-6F, a large compound located around the top of a crater in which mining operations take place. Its purpose is to defend the mining installation from hostile attack. For this purpose the installation houses six powerful defense turrets installed around the crater, as well as a myriad of support systems for power generation and munitions stores for those armaments.<br>The game is reminiscent of the System Shock series in terms of gameplay. The player must explore the base in order to find items which is needed to establish a line of defense and ultimately escape the installation. This involves fighting off the invading enemies by deploying the defense turrets effectively and using the installation's computer terminals (called \"VOS terminals\") in order to hinder the intruder's advance.<br><br>The computer terminals in the game offer an unusual wide range of interaction. Players can use them to remotely control the defense turrets, load ammunition and inspect the turrets for damage and deploy combat droids within the installation's perimeters. Doors can be controlled from the VOS terminals in order to control access to the installation's different areas. The player can use this capability to lock in enemy forces in parts of the installation.<br>A view of the VOS terminal GUI.<br><br>The game also allows the player to fight the invaders by shooting them, but this is discouraged by the fact that new enemies arrive with each passing wave of attacking ships. Also, any fighting in the installation greatly degrades the air quality in the immediate area once an enemy is destroyed. The computer might even seal doors to polluted areas, sometimes trapping the player. The player can dissolve the pollution by opening doors to adjacent areas, and the pollution levels can be monitored in the VOS terminal's environmental module.'<br>Defensive software being modified for improved performance.<br><br>The installation consists of two major towers with seven floors each (the administrative and domestic blocks), three hangars, a service level, six turrets and a control room. All these are linked by a subway-train like transportation system named \"LIMO\". Several elevator systems also connect the different levels. This complex layout enables players to avoid enemies by choosing an alternate route to their destination.", "platform": "3DO Interactive Multiplayer", "release_date": "May 17, 1996", "game_type": "Released", "esrb": "", "developers": "Millenium Interactive", "publishers": "Multisoft Co.", "genres": "Action", "max_players": "1", "cooperative": "No", "rating": "2.6", "wikipedia": "", "video_link": "https://www.youtube.com/watch?v=khZdnLJ3hdc", "launchbox_gamesdb_link": "https://gamesdb.launchbox-app.com/games/details/9709"}