{
  "name": "Downfall",
  "shortName": "downfall_",
  "description": "Downfall is an &quot;endless runner&quot; type of game in which the environment is constantly moving and control of the player is strictly limited. The player is controlling a little guy, travelling down over myriads of platforms which constantly scrolling from the bottom to the top. Moving is only possible from left to right, no jumping is possible. Leaving the stand on a platform, the player is starting to fall and must land on a deeper platform. Luckily, during flight limited horizontally movement is possible. The game ends if either the player reached the upper border (standing on a platform) or falls to the bottom border without landing on a platform.<br><br>Points are gained by simply surviving, having the score counter constantly increasing. There are different levels which change without interruption and are marked with differently looking platforms. Randomly appearing fruits reward extra points depending on the level, and rarely extra items can be found like balloons slowing the speed of the fall. Some of those must be activated, some are instantly active.<br><br>This arcade style of game was originally presented in the game <a href=\"https://www.mobygames.com/search/quick?game=Man+goes+down\">Man goes down</a> by <a href=\"https://www.mobygames.com/search/quick?developer=Alex+Herbert\">Alex Herbert</a> on the Atari 2600 and the authors of Downfall explicitly name this game as inspiration.<br><br>The game supports modified Jaguar gamepads featuring &quot;rotary control&quot;, means a paddle which can be endlessly turned left and right and therefore being a natural control for this game. The graphics are simple, but colorful multi-level parallax scrolling backgrounds are present in all versions.<br><br>Falling down, the game simply asks you: &quot;How low can you go?&quot;",
  "publishedBy": "Reboot",
  "developedBy": "Reboot",
  "released": "Apr 16, 2011",
  "alsoFor": "Atari ST | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/jaguar/downfall_",
  "visual": "",
  "gamePlay": "Arcade, Platform",
  "setting": "",
  "release": [
    {
      "system": "Jaguar",
      "releases": [
        {
          "publisher": "Reboot",
          "developer": "Reboot",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Apr 16, 2011",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/796164-downfall-jaguar-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/796165-downfall-jaguar-screenshot-starting-our-little-man-with-the.png",
      "caption": "Starting. Our little man with the yellow shirt is falling on the first platform"
    },
    {
      "link": "/images/shots/l/796166-downfall-jaguar-screenshot-reaching-top-border-on-a-platform.png",
      "caption": "Reaching top border on a platform is Game Over. So good I managed to leave the platform in time..."
    },
    {
      "link": "/images/shots/l/796167-downfall-jaguar-screenshot-these-long-platforms-can-be-tricky.png",
      "caption": "These long platforms can be tricky as you can only leave them left or right before they reach the top"
    },
    {
      "link": "/images/shots/l/796168-downfall-jaguar-screenshot-fruits-gives-extra-points-i-will.png",
      "caption": "Fruits gives extra points - I will miss that one for sure..."
    },
    {
      "link": "/images/shots/l/796169-downfall-jaguar-screenshot-reaching-level-2-no-pause-here.png",
      "caption": "Reaching level 2. No pause here, the game constantly progresses further (down)."
    },
    {
      "link": "/images/shots/l/796170-downfall-jaguar-screenshot-fetched-an-extra-item-the-balloon.png",
      "caption": "Fetched an extra item: the balloon reduces the falling speed. Listen carefully to the voice to notice when it's vanishing!"
    }
  ],
  "cover": []
}