{
  "name": "Out of This World",
  "shortName": "out-of-this-world",
  "description": "A young physics professor named Lester conducts a particle experiment. Suddenly, something goes wrong, a lightning strikes, and in a moment Lester finds himself in a strange alien world. Now he must fight for his life, first with his bare hands, then with a gun he finds. But what gives him courage is that he is not alone. One of the aliens who escapes from the prison together with him helps him on his dangerous quest. Friendship can overcome all the obstacles.<br><br><i>Out of This World</i> combines shooting, platforming, and puzzle-solving elements. The game is divided into stages; some of them are straightforward and can only be accessed one time, while others are connected to each other, constituting a larger environment. Exploration and problem-solving are emphasized. Many levels include challenges not seen in the previous ones. Tasks may involve environmental puzzles, timed sequences, precise jumping, and combat.<br><br>Typically, enemies are defeated by using an energy gun found in an early stage. The gun's regular function is shooting energy projectiles. By pressing down and holding the fire button the player can activate an energy shield which protects Lester from regular attacks, allowing him to fire from relative safety until it evaporates. Finally, by holding the fire button even longer the gun creates powerful blasts which can disrupt shields. Most enemies are equipped with similar guns and are able to perform the same actions as Lester. Fighting enemies therefore requires tactical usage of regular attacks, shields, and bombs, as well as learning enemy patterns.<br><br>Each level can be accessed by typing a code the player learns after having completed the level. If Lester dies, the level must be restarted. There is no on-screen interface and no in-game dialogue in the game. Vector graphics are used for creating the game's environments and animated cutscenes. ",
  "publishedBy": "RGC",
  "developedBy": "Delphine Software International",
  "released": "Dec, 2013",
  "alsoFor": "3DO, Amiga, Apple IIgs, Atari ST, DOS, Genesis, Macintosh, SNES, Symbian, Windows, Windows 3.x, Zodiac | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/jaguar/out-of-this-world",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Platform, Puzzle elements, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Jaguar",
      "releases": [
        {
          "publisher": "RGC",
          "developer": "Delphine Software International",
          "ported": "The Removers",
          "country": " Worldwide",
          "releaseDate": "Dec, 2013",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/582788-out-of-this-world-jaguar-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Worldwide",
      "platforms": "Jaguar"
    },
    {
      "link": "/images/covers/l/582793-out-of-this-world-jaguar-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Worldwide",
      "platforms": "Jaguar"
    },
    {
      "link": "/images/covers/l/582790-out-of-this-world-jaguar-manual.jpg",
      "scanOf": "Manual",
      "packaging": "Box",
      "country": "Worldwide",
      "platforms": "Jaguar"
    },
    {
      "link": "/images/covers/l/582791-out-of-this-world-jaguar-manual.jpg",
      "scanOf": "Manual",
      "packaging": "Box",
      "country": "Worldwide",
      "platforms": "Jaguar"
    }
  ]
}