{
  "name": "A Mind Forever Voyaging",
  "shortName": "a-mind-forever-voyaging",
  "description": "The year is 2031 and the world is near the brink of economic collapse. To avoid this, the president comes up with a plan to stop the disaster - but before applying it, the long-term impacts on the world need to be validated. This is done with a simulation visited by the computer project PRISM, designed to be a true AI. The game starts when PRISM awakes from a simulation of his own, human life and is told that he is in fact the world's first sentient machine. At this point, the player takes control over PRISM.<br><br><i>A Mind Forever Voyaging</i> is a text-based interactive fiction game. The player reads descriptions which detail the surroundings and communicates with the game by typing in commands. Most of the time is spent in simulation mode where the player repeatedly visits the town of Rockvil and needs to record situations of everyday or special activities going on. If the player has recorded enough, the game progresses and the simulation ten years ahead can be visited. However, the recording device has no unlimited capacity - when full, the player needs to exit the simulation and let the recordings review by the project leader. Then the current simulation can be simply started again from the start to find new situations - the same applies when dying.<br><br>Between simulations and toward the end there are situations outside the simulation, but overall the game is light on puzzle-solving and more about experiencing how said plan changes Rockvil and its people over time. Outside the simulation there are three more modes to enter: communications (switching to various video/audio units to examine other locations and people), library (various documents and other information to read) and interlace (communicating and giving orders to the own subsystems).",
  "publishedBy": "Infocom, Inc.",
  "developedBy": "Infocom, Inc.",
  "released": "Aug, 1985",
  "alsoFor": "Amiga, Apple II, Commodore 128, DOS, Macintosh | Combined View",
  "genre": "Adventure",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/a-mind-forever-voyaging",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Infocom, Inc.",
          "developer": "Infocom, Inc.",
          "ported": "",
          "country": " United States",
          "releaseDate": "Aug, 1985",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/38016-a-mind-forever-voyaging-atari-st-screenshot-intro.gif",
      "caption": "Intro"
    },
    {
      "link": "/images/shots/l/38017-a-mind-forever-voyaging-atari-st-screenshot-starting-location.gif",
      "caption": "Starting location"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/18183-a-mind-forever-voyaging-atari-st-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/249661-a-mind-forever-voyaging-atari-st-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/18184-a-mind-forever-voyaging-atari-st-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United States",
      "platforms": "Atari ST"
    }
  ]
}