{
  "name": "Alien Storm",
  "shortName": "alien-storm",
  "description": "The aliens are invading Earth, and it's up to the &quot;Alien Busters&quot; to wipe them out and destroy their creator. The Busters consist of Karla, Gordon, and Scooter. Each one of them have their own weapons and special attacks.<br><br>When you start the game, you can select any one of these characters to play as. There are six missions to complete (eight in the Genesis version) with several stages, and each mission has you blasting aliens all the way to the end, from the streets to the mother ship where you'll meet the mother of all aliens. Unfortunately, blasting these aliens will not be an easy task, as they get tougher in every mission, and are capable of hiding into objects such as plants, postboxes, trashcans, drums, and several others. Each mission has an objective such as rescuing people destroying an UFO.<br><br>When you deal with a few aliens, flying heads will appear, which you can shoot to collect life or energy (by the way, life is important to you, since if yours get empty, you're dead). However, rather than using your ordinary weapons, you can use the special attacks that are enough to kill aliens you currently see. These types of attack vary depending on the character you choose at the start of the game. For instance, Gordon summons a U.S. Air Force Jet that drop bombs across the street, while Scooter is able to teleport out of his present location, and leave a series of bombs that will blow up aliens on sight, he will then re-appear. However, using your character's special attack uses up a lot of energy, and if you have little or no energy, you can't use it.<br><br>At the end of some missions is an alien boss, which you must destroy in order to complete the mission. Also, at the end of every one, you have to enter buildings where you participate in a shooting gallery. The object is to kill aliens popping up from several locations with the building. <br><br>You can play <i>Alien Storm</i> by yourself, or with another person.<br><br>\n",
  "publishedBy": "U.S. Gold Ltd.",
  "developedBy": "Team Shinobi",
  "released": "1991",
  "alsoFor": "Amiga, Amstrad CPC, Arcade, Commodore 64, Genesis, Linux, Macintosh, SEGA Master System, Wii, Windows, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/alien-storm",
  "visual": "2D scrolling",
  "gamePlay": "Arcade, Beat 'em up / brawler, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "U.S. Gold Ltd.",
          "developer": "Team Shinobi",
          "ported": "Tiertex Ltd.",
          "country": " United States",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/321817-alien-storm-atari-st-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/321818-alien-storm-atari-st-screenshot-select-your-character.png",
      "caption": "Select your character"
    },
    {
      "link": "/images/shots/l/321819-alien-storm-atari-st-screenshot-mission-briefing.png",
      "caption": "Mission briefing"
    },
    {
      "link": "/images/shots/l/321820-alien-storm-atari-st-screenshot-level-one.png",
      "caption": "Level one"
    },
    {
      "link": "/images/shots/l/321821-alien-storm-atari-st-screenshot-ugly-aliens.png",
      "caption": "Ugly aliens"
    },
    {
      "link": "/images/shots/l/321822-alien-storm-atari-st-screenshot-someone-needs-my-help.png",
      "caption": "Someone needs my help"
    },
    {
      "link": "/images/shots/l/321823-alien-storm-atari-st-screenshot-clearing-out-a-shop.png",
      "caption": "Clearing out a shop"
    },
    {
      "link": "/images/shots/l/321824-alien-storm-atari-st-screenshot-level-one-complete.png",
      "caption": "Level one complete"
    },
    {
      "link": "/images/shots/l/321825-alien-storm-atari-st-screenshot-an-alien-snail.png",
      "caption": "An alien snail?"
    },
    {
      "link": "/images/shots/l/321826-alien-storm-atari-st-screenshot-firing-at-an-alien.png",
      "caption": "Firing at an alien"
    }
  ],
  "cover": []
}