{
  "name": "All About America",
  "shortName": "all-about-america",
  "description": "<i>All About America</i> is an educational game that teaches children American history and geography as well as the English language. It consists of two main activities: history lessons and map reading skills. Both of these can be played by one or two players.<br><br><i>History lessons</i> include 16 different stories about America's past. These can be played in any order and consists of two parts: one where the player gets to read and watch pictures of the subject and one quiz part based on the story. There are two question types: reading skills that tests what the player remembers from the story and vocabulary building that tests how well the player knows some of the words that appeared in the story. For both question types the player has three alternatives to choose from.<br><br>When testing <i>map reading skills</i> there are three map types to choose from: the thirteen colonies, America before the civil war and the present United States. Like in the history activity the player can choose to look and learn or to do a quiz. For each map type there are different types of questions. For colonies there are only questions about the name of the colonies while for the civil war map there are both state names and postal codes and for present day USA there are also quizzes for capitals and compass directions. ",
  "publishedBy": "Unicorn Software Company",
  "developedBy": "Unicorn Software Company",
  "released": "1987",
  "alsoFor": "Amiga, Apple II, Apple IIgs | Combined View",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/all-about-america",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Unicorn Software Company",
          "developer": "Unicorn Software Company",
          "ported": "",
          "country": " United States",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}