{
  "name": "Amberstar",
  "shortName": "amberstar",
  "description": "A thousand years ago, a young Black Magician named Tar valiantly fought the demon lord Thornahuun, who was revealed to be his own father. However, Thornahuun managed to possess his son's soul and corrupt it. Tar declared himself Lord Tarbos and brought terror to the land of Lyramion, before being locked away in a secure prison on the world's red moon. Now, a sorcerer named Marmion is trying to release him, with the intention of spreading horror through the land. A lone adventurer from the town of Twinlake must gather thirteen pieces of a powerful artifact known as Amberstar to prevent that from happening.  <br><br><i>Amberstar</i> is a role-playing game which uses a top-down view for overworld travel and most indoor locations, and switches to a first-person pseudo-3D perspective when exploring cities and dungeons. Initially the player creates a single protagonist with randomly assigned attributes and no class designation. During the course of the game, additional characters (up to six active party members) can be found in different cities and other locations and recruited. Some of these characters already belong to established classes and come with their own abilities. Guilds of various classes (fighter, paladin, ranger, mage, monk, and thief) can be visited, where the protagonist and his class-less companions (if any) can be promoted. Choice of classes affects attributes, character growth, imposes equipment restrictions, etc. When leveling up, characters can train in specific locations, increasing attributes of the player's choice.<br><br>Enemy encounters may occur at specific points in the overworld, or by approaching a visible enemy in a dungeon. The view then switches to overhead, with the combatants displayed on a small grid next to a window graphically presenting the enemies. The fighting is turn-based and offers various defensive and offensive options, including tactical movement on the grid and 90 different spells.<br><br>Although certain items must be procured and quests completed, the game is largely non-linear, and the player is free to roam the world of Lyramion from the onset. Besides traveling on foot, horses can be bought for safe crossing of shallow water, boats and rafts for sailing, and additional means of transportation as the game advances. The game features a multiple-topic conversation system with prominent NPCs, side quests to undertake, an auto-mapping feature in towns, a day-and-night cycle that may affect NPC movements and shop schedules, and usage of rations when camping to restore lost life points. Progress can be saved at any time, but there is only one save slot that is automatically overwritten.",
  "publishedBy": "Thalion Software GmbH",
  "developedBy": "Thalion Software GmbH",
  "released": "Apr 16, 1992",
  "alsoFor": "Amiga, DOS | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/amberstar",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Thalion Software GmbH",
          "developer": "Thalion Software GmbH",
          "ported": "",
          "country": " Germany",
          "releaseDate": "Apr 16, 1992",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/321807-amberstar-atari-st-screenshot-character-generation.png",
      "caption": "Character generation"
    },
    {
      "link": "/images/shots/l/321808-amberstar-atari-st-screenshot-loading-screen.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/321809-amberstar-atari-st-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/321810-amberstar-atari-st-screenshot-the-intro.png",
      "caption": "The intro"
    },
    {
      "link": "/images/shots/l/321811-amberstar-atari-st-screenshot-starting-location.png",
      "caption": "Starting location"
    },
    {
      "link": "/images/shots/l/321812-amberstar-atari-st-screenshot-moving-around-in-the-city.png",
      "caption": "Moving around in the city"
    },
    {
      "link": "/images/shots/l/321813-amberstar-atari-st-screenshot-a-locked-door.png",
      "caption": "A locked door"
    },
    {
      "link": "/images/shots/l/321814-amberstar-atari-st-screenshot-in-the-temple.png",
      "caption": "In the temple"
    },
    {
      "link": "/images/shots/l/321815-amberstar-atari-st-screenshot-a-inhabitant-of-the-city.png",
      "caption": "A inhabitant of the city"
    },
    {
      "link": "/images/shots/l/321816-amberstar-atari-st-screenshot-in-the-tavern.png",
      "caption": "In the tavern"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/101048-amberstar-atari-st-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/101053-amberstar-atari-st-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/260995-amberstar-atari-st-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "Germany",
      "platforms": "Atari ST"
    }
  ]
}