{
  "name": "Battle of the Atlantic: The Ocean Lifeline",
  "shortName": "battle-of-the-atlantic-the-ocean-lifeline",
  "description": "<i>Battle of the Atlantic: The Ocean Lifeline</i> is a strategic naval simulation of World War II.<br><br>Designed for 1 - 2 players, each player controls the major naval and naval air forces of either the Axis or Allied players.  A computer opponent is available for 1-player games.  The viewpoint is of the theater naval commander, and the player composes task groups, establishes missions and destinations for those groups, and responds to operational events.  <br><br>The game is text-only, and came with a board and physical pieces to allow the player to keep track of the location of theirs and enemy units.  All games begin in February 1940, and the player defines how long each game lasts.   Time passes in 2-week intervals, allowing the player to input new commands for their fleet, but will stop to allow the player to react to enemy movements.  Available ports will change over time based upon historical conditions.  <br><br>The player gives patrol locations for their vessels, and the ships will automatically take this route during the time interval, with the chance of encountering enemy ships.  When enemy ships interact, the player is given options to evade, shadow, or engage enemy vessels.  If two ships engage, combat occurs, and the player receives messages of the result of the battle.  Final scores are based upon the success of the player's naval tactics during the war.  ",
  "publishedBy": "Simulations Canada",
  "developedBy": "Simulations Canada",
  "released": "1988",
  "alsoFor": "Apple II | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "Text-based / spreadsheet",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/battle-of-the-atlantic-the-ocean-lifeline",
  "visual": "",
  "gamePlay": "Wargame",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Simulations Canada",
          "developer": "Simulations Canada",
          "ported": "",
          "country": " Canada",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}