{
  "name": "Bouncing Boubles",
  "shortName": "bouncing-boubles",
  "description": "The &quot;Bouncing Bouble&quot; aliens want to conquer the earth. The player has to prevent this by eliminating all enemies with the &quot;Super Bouble Blaster&quot;. <em>Bouncing Boubles</em> is an arcade shooting game inspired by early coin-op games like e.g. <a href=\"https://www.mobygames.com/game/arcade/galaga\">Galaga</a>. <br><br>On single screen levels, the player controls a small ship, which can be moved left and right and shoot straight up and is confronted with one or multiple enemies of four different types. The first two enemy types are bouncing, that means they fall down and bounce back up, but loose some height on each jump. The circle enemies have no weapons, while the other bouncing enemies drop mines. Both must be eliminated before they reach the bottom. Dropped mines explode at the ground and touching them before the explosion is completely over (indicated by an animation) is deadly. The other enemy types are shooting at the player, firing laser weapons if they are above the player's ship. The last enemy vessel type is the most dangerous one: it does not only shot lasers if above the players ship, but also throwing multiple mines diagonally.<br><br>In the first levels all four enemy types are introduced, in later levels they appear in mixed formations with increasing numbers and with more of the more dangerous types. There are 40 levels to be played. On loosing a life, the current level is restarted with all enemies. For each 300 points the player is rewarded an extra-life. There are two playing modes controlling the difficulty: in the single shooting mode you have to press the joystick button for each single shot, while in the easier setting your ship's cannon is auto-firing while the button is pressed.",
  "publishedBy": "",
  "developedBy": "",
  "released": "1987",
  "alsoFor": "",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/bouncing-boubles",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Arcade, Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/802749-bouncing-boubles-atari-st-screenshot-title-screen-showing.png",
      "caption": "Title screen (showing enemies from the last level)"
    },
    {
      "link": "/images/shots/l/802754-bouncing-boubles-atari-st-screenshot-first-enemy-type-the.png",
      "caption": "First enemy type: the circles are jumping and bouncing from the ground and walls. Destroy before they reach the ground!"
    },
    {
      "link": "/images/shots/l/802755-bouncing-boubles-atari-st-screenshot-second-alien-type-also.png",
      "caption": "Second alien type: also bouncing like the circles, but also dropping mines if above the player"
    },
    {
      "link": "/images/shots/l/802756-bouncing-boubles-atari-st-screenshot-you-can-shot-the-mines.png",
      "caption": "You can shot the mines while they are in the air -- which is always a good idea to do"
    },
    {
      "link": "/images/shots/l/802757-bouncing-boubles-atari-st-screenshot-the-third-enemy-type.png",
      "caption": "The third enemy type consists of many smaller ships. If does not bounce, but fires a laser weapon if above the player"
    },
    {
      "link": "/images/shots/l/802758-bouncing-boubles-atari-st-screenshot-you-have-to-destroy-each.png",
      "caption": "You have to destroy each part of the ship to destroy it completely"
    },
    {
      "link": "/images/shots/l/802759-bouncing-boubles-atari-st-screenshot-the-last-enemy-type-the.png",
      "caption": "The last enemy type (the &quot;bird&quot;): fires lasers and dropping multiple mines. Nasty one, eliminate them quickly"
    },
    {
      "link": "/images/shots/l/802760-bouncing-boubles-atari-st-screenshot-touching-the-mine-explosions.png",
      "caption": "Touching the mine explosions is an instant death -- so those multiple mines really block a wide range on the ground"
    },
    {
      "link": "/images/shots/l/802761-bouncing-boubles-atari-st-screenshot-in-later-levels-the-four.png",
      "caption": "In later levels the four enemy types appear in mixed formations"
    },
    {
      "link": "/images/shots/l/802763-bouncing-boubles-atari-st-screenshot-three-types-in-a-level.png",
      "caption": "Three types in a level"
    },
    {
      "link": "/images/shots/l/802764-bouncing-boubles-atari-st-screenshot-last-life-lost-game-over.png",
      "caption": "Last life lost: Game Over"
    },
    {
      "link": "/images/shots/l/802765-bouncing-boubles-atari-st-screenshot-instructions.png",
      "caption": "Instructions"
    }
  ],
  "cover": []
}