{
  "name": "Bridge Player 2000 with Tutor",
  "shortName": "bridge-player-2000-with-tutor",
  "description": "<h3>Back of Case - Amstrad PCW (UK) (from <a href=\"https://www.mobygames.com/game/bridge-player-2000-with-tutor/adblurbs\">Ad Blurbs</a>)</h3><b>At last</b>. . . . . a bridge player that gives you a challenging game with a really tough opponent. We can promise you hours of enjoyment as you pit your wits against this powerful program.<br><br>And now a superb new feature for the beginner and improver . . . . a special tutorial section devised by an expert to guide you through the intricacies of bidding and play with twenty set hands and detailed explanation.<br><br>This is a bridge player for both the expert and the beginner, with versatile bidding routines that really set a high standard, matched by the emphatically powerful play of the cards. The computer will play as either defender or declarer. Generates random hands and allows proper bidding in the Acol system, including the Stayman and Blackwood conventions.<br><br>Bid against the computer, then prove your skill as it takes you on playing both your opponents hands.<br><br>Make use of the many superb features - including one or to that can give you the edge against the machine!<br><br><b>OPTIONS INCLUDE. . . . .</b>\n<ul>\n<li>Tutorial section with 20 set hands, advice and explanation.</li>\n<li>Improve your game - Post mortem facility allows you to rebid and replay and hand.</li>\n<li>Review bidding or play to previous tricks while playing a hand.</li>\n<li>Input a contract of your own choice to test yourself.</li>\n<li>Peep at your opponents hands.</li>\n<li>Comprehensive on-screen information displays - contract, tricks won so far, cards played in current and last trick, score.</li>\n<li>Option to bias the deal to give you and your 'partner' more high card points if you prefer to play as declarer.</li>\n<li>At any time claim the rest of the tricks.</li>\n<li>Restart the play of the cards.</li></ul><br><br><br><br>\n",
  "publishedBy": "CP Software",
  "developedBy": "CP Software",
  "released": "1989",
  "alsoFor": "Amstrad PCW, DOS | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/bridge-player-2000-with-tutor",
  "visual": "Fixed / flip-screen",
  "gamePlay": "Cards / tiles, Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "CP Software",
          "developer": "CP Software",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}