{
  "name": "Conquest of Elysium",
  "shortName": "conquest-of-elysium",
  "description": "<i>Conquest of Elysium</i> is the original fantasy turn-based strategy game that spawned a long-standing <a href=\"https://www.mobygames.com/game-group/conquest-of-elysium-series\">series</a>, as well as the <a href=\"https://www.mobygames.com/game-group/dominions-series\">Dominions spin-off</a>. It can be played against one or more AI opponents, or between several human players at the same computer. Staring with just one castle and a group of followers, each player's goal is to vanquish all opposition and become the sole ruler of the realm of Elysium.<br><br>In many ways, the game is similar to other fantasy turn-based titles like Steve Fawkner's <a href=\"https://www.mobygames.com/game/warlords\">Warlords</a> or MicroProse's <a href=\"https://www.mobygames.com/search/quick?game=Master+of+Magic\">Master of Magic</a>, but offers considerable depth and variety by introducing a vast array of different factions, each with their own unique playing style. These are split into several categories: Warlord, Magic User, Priest or Non-Human, the latter including such fantasy races as trolls, elves, dwarves and so on. While the economy based on taxes and the recruitment of forces into the player's military is the same for all, faction specifics come heavily into play early on, and building up an undead army of a Necromancer for example is not remotely similar to the more straightforward approach of a Human Warlord.<br><br>There are pre-set scenarios, but games can be also played on randomly generated worlds that the player can customise by specifying map size, terrain features and the historical period (from early agricultural society to an empire and later monarchy). In addition to the warring players, there are numerous neutral entities that roam the world, from wild animals to brigands to fortified towns and villages. There are seasonal cycles that affect the game world as well: the population will be more cheerful in spring but much less so with the coming of winter. All these features contribute to a dynamic world in which the events of the game unfold.<br><br>On the whole, <i>Conquest of Elysium</i> has only minor differences from <a href=\"https://www.mobygames.com/game/conquest-of-elysium-ii\">its direct sequel</a>, which is essentially an updated port to IBM PC compatible platforms. However the latter introduced many changes to art (e.g. replacing almost every static screen), the interface design and layout, and tweaked certain playing mechanics. Several new player classes were also added, and some existing ones were changed compared to thefirst game.<br><br><i>Conquest of Elysium</i> was marketed as shareware, with the unregistered demo version only allowing to play games on customised random maps, with some player classes not available for selection by human players. The save/load game feature was also disabled.",
  "publishedBy": "Magical Science",
  "developedBy": "Magical Science",
  "released": "Mar 04, 1996",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Bird's-eye view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/conquest-of-elysium",
  "visual": "2D scrolling",
  "gamePlay": "Turn-based strategy",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Magical Science",
          "developer": "Magical Science",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Mar 04, 1996",
          "ean13": "",
          "comments": "shareware demo release"
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}