{
  "name": "Darklyte II",
  "shortName": "darklyte-ii",
  "description": "<i>Darklyte II</i> is a turn based combat game written in STOS and the sequel to <a href=\"https://www.mobygames.com/game/darklyte\">Darklyte</a>.<br><br>Your mission is to destroy the Darklyte forces. You take control of four droids and in every level you need to wipe out the enemy team and protect your commander droid. If you lose the commander droid it's game over. The levels in the game consists of a 9x9 grid of squares. Many of the squares contain puzzle elements. There are a number\nof pits, water, lava, and colour coded squares. There are also message squares about which can yield\nclues. The game comes with 4 worlds with a total of 22 levels.<br><br>Every time you make a successful attack you droid will be awarded with a specific number of experience points and gold. At the left side of the screen there are six icons: Attack, End turn, Transfer gold,\nScan enemy droid, Use equipment, and Show droid statistics.<br><br>In the original game there were six items that the droids could equip, now you have 12 items to play with:\n<ul><li>High power energy injection: Gives the droid full energy</li>\n<li>Acceleration chip: Gives the droid 9 moves.</li>\n<li>Power canisters: Gives the droid extra damage capabilities for 1 attack.</li>\n<li>Shield: Gives the droid greater defence capabilities for 1 defend.</li>\n<li>Confuser: Enemy droids will move towards the top of the grid and not to a players droid.</li>\n<li>Skull of banishment: Gives the droid 30 points of extra damage, next attack.</li>\n<li>Cloaking shield: For the next 3 turns enemy droids will have an 80% chance of not attempting to attack a cloaked droid.</li>\n<li>Teleport lines: Two of your droids may change place.</li>\n<li>Smart bomb: All enemy droids lose half their hit points. Wont work on last level.</li>\n<li>Devastator: An enemy will lose 2 armour if successfully hit by a droid.</li>\n<li>Cloud killer: Click on an enemy droid and it loses 20 energy units.</li>\n<li>Lightning: For 3 attacks the droid has 20 extra damage capabilities.</li></ul>",
  "publishedBy": "L.A.P.D.",
  "developedBy": "",
  "released": "Dec, 1993",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/darklyte-ii",
  "visual": "Isometric",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "L.A.P.D.",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "Dec, 1993",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/338273-darklyte-ii-atari-st-screenshot-info-screen.png",
      "caption": "Info screen"
    },
    {
      "link": "/images/shots/l/338274-darklyte-ii-atari-st-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/338275-darklyte-ii-atari-st-screenshot-world-selections-screen.png",
      "caption": "World selections screen"
    },
    {
      "link": "/images/shots/l/338276-darklyte-ii-atari-st-screenshot-first-level.png",
      "caption": "First level"
    },
    {
      "link": "/images/shots/l/338277-darklyte-ii-atari-st-screenshot-visiting-the-shop.png",
      "caption": "Visiting the shop"
    },
    {
      "link": "/images/shots/l/338278-darklyte-ii-atari-st-screenshot-one-of-my-droids-bites-the.png",
      "caption": "One of my droids bites the dust"
    },
    {
      "link": "/images/shots/l/338279-darklyte-ii-atari-st-screenshot-game-over.png",
      "caption": "Game over"
    }
  ],
  "cover": []
}