{
  "name": "Das Stundenglas",
  "shortName": "das-stundenglas",
  "description": "<i>Das Stundenglas</i> (“The hourglass”) is the first of three interactive fiction games by German developer Weltenschmiede (the others being <a href=\"https://www.mobygames.com/game/die-kathedrale\">Die Kathedrale</a> and <a href=\"https://www.mobygames.com/search/quick?game=Hexuma\">Hexuma - Das Auge des Kal</a>). It is entirely in German.<br><br>Upon jumping into a mysterious chest, you arrive in a beautiful fairy-tale world. Yet the serenity is spoiled: the enchanted hourglass that controls the flow of time is lost, and the world has been split into two realities. Both planes are the very same land, but certain buildings and people exist only in one of the two zones. On your quest to reclaim the missing artefact, you will have to travel between the two worlds and claim a magical coin from each of the twelve inhabitants; of course, all of them ask a little favor in return for their gift…<br><br>The game contains a (generous) time limit; you have to find the hourglass in 24 days. Consequently, there is a day-night-rhythm, and the characters will wander between certain locations in a daily routine. There are two graphics for most locations to reflect day and night.<br><br>You can download <i>Das Stundenglas</i> for free by now; check the links section.",
  "publishedBy": "Software 2000",
  "developedBy": "Weltenschmiede",
  "released": "1990",
  "alsoFor": "Amiga, DOS | Combined View",
  "genre": "Adventure",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/das-stundenglas",
  "visual": "",
  "gamePlay": "Interactive fiction / text adventure, Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Software 2000",
          "developer": "Weltenschmiede",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}