{
  "name": "Defender II",
  "shortName": "defender-ii",
  "description": "<i>Defender II</i> adds to the already established gameplay of the <a href=\"https://www.mobygames.com/search/quick?company=Williams\">Williams</a> arcade classic <a href=\"https://www.mobygames.com/game/arcade/defender\">Defender</a>.<br><br>The first important thing to set this game apart from its predecessors is that vertical control is via the mouse, with the mouse buttons acting as thrusters and to reverse direction of movement.<br><br>The game is split up in a series of 16 distinct, four wave sectors where each sector consists of either a mission or theme wave, followed by three regular attack waves. There are eight different mission waves, during which the player is required to achieve some objective specified at the start of the wave and eight theme waves, where a horde of a particular enemy type is encountered.<br><br>The game starts out with the player's craft equipped with lasers and a limited number of smart bombs plus a sidekick AI drone that moves along with the main craft to add to the firepower with its own compliments of lasers. Also available are special weapons that replace the drone when activated to dish out other types of punishment to the aliens, such as a more powerful &quot;toothpaste&quot; laser, bomb pods to carpet the ground with annihilation, shots that go diagonally up and finally a smart laser which arcs out from your craft like a lightning bolt in all directions, killing all enemies in sight. All the special weapons have a limited duration and are recharged every 10000 points, then ready to be used again. Various new enemies have been added and the graphics have been updated to conform with the standards of the time.<br><br>The craft flies over a jagged planetary landscape on a mission to protect the humanoids from evil alien marauders. The player navigates the two-way scrolling landscape in his craft,  disposing of different types of aliens, thus preventing them from abducting the humanoids. If the aliens manage to get a humanoid to outer space (top of the screen), it mutates and chases your craft down. You can rescue the humanoid by shooting the alien capturing it, but if it falls too far it will expire by the impact. To avoid that, the player needs to swoop in to pick it up and return it safely to the surface. Stargates hovering above the surface can be used to warp instantly to a different area of the level, if a humanoid is in distress you will warp to that location. At the end of each attack wave, each surviving humanoid gives you a bonus score and the humanoid population is reset after each sector. The top of the screen is dedicated to a long range scanner that shows the location of all enemies and humanoids on the level.<br><br>Also included are renditions of <a href=\"https://www.mobygames.com/game/arcade/defender\">Defender</a> and <a href=\"https://www.mobygames.com/game/arcade/stargate\">Stargate</a> with the option of original or updated graphics to match <i>Defender II</i>.",
  "publishedBy": "ARC",
  "developedBy": "Llamasoft Ltd.",
  "released": "1990",
  "alsoFor": "Amiga | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/defender-ii",
  "visual": "2D scrolling",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "ARC",
          "developer": "Llamasoft Ltd.",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}