{
  "name": "Dyter-07",
  "shortName": "dyter-07",
  "description": "In <i>Dyter-07</i>, Earth is attacked by alien forces. The player mans the advanced attack chopper Dyter-07 to drive them back and rescue scientists on the way. The game has eight levels with two alternating gameplay mechanics.  For each of the four tropical islands, the surface has to be cleared at first by flying around in a side-scrolling perspective, reminiscent of <a href=\"https://www.mobygames.com/game/choplifter\">Choplifter</a>. Alien opposition can be destroyed by shooting them, but after six hits the helicopter gets destroyed.<br><br>The basic goal is to destroy a number of robots which are found by using the radar. However, the chopper is not able to destroy those; that's why it carries the Battledroid, a tank.  When the chopper lands, the tank is detached and can be driven over the surface of the island. A side effect of destroying the robots is the rescue of human scientists which are held hostage in said robots. They can be picked up with the helicopter and brought to the base. While this is not required to finish the level, rescued scientists net vital upgrades like better weapons, a better shield or the ability to move underwater. All those upgrades can be either applied to the chopper or the tank.<br><br>After all robots are destroyed, a volcano opens up and the player moves right in. In the following section the game transforms into a vertically scrolling shooter. Gameplay in these sections is traditional, save for the fact that the player travels downwards from the upper part of the screen: dodging enemy bullets and shooting as many aliens as possible until the level end boss is reached and defeated. An upgraded chopper is important to survive these levels.",
  "publishedBy": "reLINE Software",
  "developedBy": "reLINE Software",
  "released": "1990",
  "alsoFor": "Amiga, Commodore 64 | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/dyter-07",
  "visual": "2D scrolling",
  "gamePlay": "Shooter",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "reLINE Software",
          "developer": "reLINE Software",
          "ported": "",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/591615-dyter-07-atari-st-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/591616-dyter-07-atari-st-screenshot-the-caribbean.png",
      "caption": "The Caribbean"
    },
    {
      "link": "/images/shots/l/591617-dyter-07-atari-st-screenshot-the-base.png",
      "caption": "The base"
    },
    {
      "link": "/images/shots/l/591619-dyter-07-atari-st-screenshot-flying-over-the-water.png",
      "caption": "Flying over the water"
    },
    {
      "link": "/images/shots/l/591620-dyter-07-atari-st-screenshot-an-enemy-tank.png",
      "caption": "An enemy tank"
    },
    {
      "link": "/images/shots/l/591621-dyter-07-atari-st-screenshot-a-power-up.png",
      "caption": "A power up"
    },
    {
      "link": "/images/shots/l/591622-dyter-07-atari-st-screenshot-i-got-shot-down.png",
      "caption": "I got shot down"
    }
  ],
  "cover": []
}