{
  "name": "Fiendish Freddy's Big Top O' Fun",
  "shortName": "fiendish-freddys-big-top-o-fun",
  "description": "The Big Top O' Fun circus is in deep trouble: due tonight is the payment of a $10.000 loan to the Big Greedy Bank. The evening's performance must bring in that money or the circus will be seized. The bank does not play fair, though: they send the evil clown Fiendish Freddy to sabotage the acts.<br><br>The performance consists of six different events. There is a practice mode for single events, and up to five players can compete in the full game, but must reach the $10.000 on their own, not together. The money is awarded by a jury after each act.<br><br>The acts are:\n<ul>\n<li>High Diving: Horace the High Diver must jump from a platform and land on a target down below. While falling, Horace must be kept spinning by moving the joystick while at the same time staying over the target. Once he is spinning fast enough, he must perform a pose indicated on the screen by pulling the joystick in a certain direction, after which a new pose is required, continuing until Horace hits the target (or the ground). If completed successfully, the next dive begins from a higher platform, giving Horace more time to perform the poses, while the target gets consecutively smaller. Money is awarded for performing poses if the target is hit. Freddy comes into play if Horace doesn't make a pose in time: he blows Horace off course with a giant fan.\n<li>Juggling: Jeffy Joe drives across the arena on a unicycle and must catch and juggle items thrown to him by his seal assistant. The act ends successfully after a time limit is up and fails if Joe drops five items. Joe must be maneuvered so that the items land in his outstretched hands. Pushing fire throws the item in his left hand and moves the items in the right hand to the left. In higher levels, a baby comes into play which Joe must throw in such a way that it lands in a carriage. Freddy tries to sabotage the act by distracting the seal and then throwing dangerous items like bombs and missiles. If either is dropped, the act is over. Bombs however can be thrown back to Freddy.\n<li>Trapeze: Finola must cross the big top by swinging on bars. She gains momentum through joystick moves and must then jump to the next bar by hitting fire at the correct moment. After a while, Finola must also maneuver through obstacles like paper targets and flaming hoops, which sometimes bob up and down. If Finola takes too long hanging on a bar without going forward, Freddy will arrive flying via helicopter blades and cut the ropes.\n<li>Knife Throw: Knancy Knife has been blindfolded and strapped to a rotating wheel along with a number of balloons. There is a time limit and a limited number of knives to throw. The goal is of course to pop all the balloons without hurting Knancy. If she is hit, she screams out and several knives are removed from the stock. Freddy tries to sabotage the act by occasionally throwing smoke bombs for confusion.\n<li>Tightrope: Tony Tiptoe tries to cross the tent on a tightrope. He is moved forward by pushing up on the joystick. He will soon begin to lose his balance and must be put back straight by corrective joystick movements to the left or right. If his balance gets really off, his balance pole turns red and he screams out &quot;Whoa&quot;. If he remains in this position for more than a second, he falls off and it's over. Freddy has several tricks up his sleeve in this act: if Tony takes too long too cross, he pulls out a cannon and blasts him out of the way. In later levels, he flies around the tent and tries to push Tony off or throws saw blades at him. These can be deflected with the pole by pressing fire.\n<li>Cannonball: Fernando, the Human Cannonball climbs into a cannon to be shot across the big top and hopefully land on his target. His assistant Lisa loads the cannon with a random amount of gun powder, which determines the thrust. Afterwards, the target must be placed somewhere along the tent, moving it closer or farther away depending on the amount of gun powder loaded. Once that is done, Lisa lights the fuse and the cannon starts rotating. It must be stopped at the right angle by pushing fire, which launches Fernando, hopefully towards the target and not the ground. Freddy comes into play when placing the target. Taking too long allows Freddy to put a giant cork into the cannon, with explosive results.\n</ul>",
  "publishedBy": "Mindscape, Inc.",
  "developedBy": "Gray Matter Inc.",
  "released": "Nov, 1989",
  "alsoFor": "Amiga, Amstrad CPC, Commodore 64, DOS, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "1st-person, Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/fiendish-freddys-big-top-o-fun",
  "visual": "2D scrolling, Fixed / flip-screen",
  "gamePlay": "Arcade, Tricks / stunts",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Mindscape, Inc.",
          "developer": "Gray Matter Inc.",
          "ported": "EZ Software",
          "country": " United Kingdom",
          "releaseDate": "1989",
          "ean13": "5 018247 005219",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/344338-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-title.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/344339-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-second.png",
      "caption": "Second title screen"
    },
    {
      "link": "/images/shots/l/344340-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-from-the.png",
      "caption": "From the intro: The situation looks grim"
    },
    {
      "link": "/images/shots/l/344341-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-loading.png",
      "caption": "Loading screen"
    },
    {
      "link": "/images/shots/l/344342-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-main-menu.png",
      "caption": "Main menu"
    },
    {
      "link": "/images/shots/l/344343-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-practice.png",
      "caption": "Practice menu"
    },
    {
      "link": "/images/shots/l/344344-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-selecting.png",
      "caption": "Selecting a player"
    },
    {
      "link": "/images/shots/l/344345-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-loading.png",
      "caption": "Loading screen for high diving"
    },
    {
      "link": "/images/shots/l/344346-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-what-a.png",
      "caption": "What a heroic pose"
    },
    {
      "link": "/images/shots/l/344347-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-hey-that.png",
      "caption": "Hey! That's not nice"
    },
    {
      "link": "/images/shots/l/344348-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-i-m-about.png",
      "caption": "I'm about to miss the tub"
    },
    {
      "link": "/images/shots/l/344349-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-juggling.png",
      "caption": "Juggling"
    },
    {
      "link": "/images/shots/l/344350-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-the-bad.png",
      "caption": "The bad guy just threw in a bomb..."
    },
    {
      "link": "/images/shots/l/344351-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-this-is.png",
      "caption": "This is what happens when you play with bombs..."
    },
    {
      "link": "/images/shots/l/344352-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-insert.png",
      "caption": "Insert Disk 4..."
    },
    {
      "link": "/images/shots/l/344353-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-an-embarrassing.png",
      "caption": "An embarrassing situation..."
    },
    {
      "link": "/images/shots/l/344354-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-player.png",
      "caption": "Player one, get ready for level one"
    },
    {
      "link": "/images/shots/l/344355-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-the-jury.png",
      "caption": "The jury is a very professional and competent bunch"
    },
    {
      "link": "/images/shots/l/344356-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-i-got.png",
      "caption": "I got a little more than $200 for that event"
    },
    {
      "link": "/images/shots/l/344357-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-ready.png",
      "caption": "Ready to swing in the trapeze"
    },
    {
      "link": "/images/shots/l/344358-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-oops-i.png",
      "caption": "Oops, I missed"
    },
    {
      "link": "/images/shots/l/344359-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-this-is.png",
      "caption": "This is harder than it looks"
    },
    {
      "link": "/images/shots/l/344360-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-this-is.png",
      "caption": "This is tricky"
    },
    {
      "link": "/images/shots/l/344361-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-hey-it.png",
      "caption": "Hey! It's not nice throwing bombs at people"
    },
    {
      "link": "/images/shots/l/344362-fiendish-freddy-s-big-top-o-fun-atari-st-screenshot-i-hit.png",
      "caption": "I hit the girl instead of a balloon"
    }
  ],
  "cover": []
}