{
  "name": "Final Legacy",
  "shortName": "final-legacy",
  "description": "This is a battle on three fronts. You are the captain of the ship Legacy. Your ultimate goal is to destroy the Warmongers' missile bases but you must also protect your cities.<br><br>You begin the game in command mode. You select your other modes with the joystick. Up for navigation,  down for torpedo, left for sea-to-air and right for sea-to-land. <br><br><b>Navigation</b><br>\nIn navigation mode, you will see an overhead map of the world. You will note that there is a black dot in a black circle. This is you and the circle represents your effective range.  You move the circle about the screen to target ships or known missile bases or to refuel at a city. You use fuel only when you are in navigation mode. When you are within range, or if an enemy ships comes within your range, press the space bar to return to the command mode then change to the desired mode.<br><br><b>Torpedo</b><br>\nIf you are within range of an enemy ship, switch to torpedo mode. In this mode, you will use the scanner at the bottom to line up your target. Move out of line to avoid a direct hit. Beware of war ship as they will chase you and have the most firepower. Hunter ships will also chase you. While their firepower is not as high as war ships, it is still fairly good. Intelligence ships have the  weakest firepower and will not chase you. They can be found on the right side of the screen. If one is destroyed and there are any hidden missile bases, there is a eighty percent chance a hidden base will be revealed.<br><br><b>Sea-to-land</b><br>\nIf you want to destroy a missile base or refuel, enter sea-to-land mode. To refuel, get near a city then enter this mode. When you are in sea-to-land mode, you will know you are within range if you see &quot;Dock for refueling&quot; on the screen. You then place the cross hairs on the base of the city and wait for refueling to complete, unless you or a city are under attack. Do not use the fire button to exit or you will fire on your city. To destroy a missile base, position your cross hairs using the scanner on the screen until you are on a missile launcher then fire. Be advised that when you fire on a missile base, they will shoot missiles at a city.<br><br><b>Sea-to-air</b><br>\nIf a city is under attach, switch to this mode. You will control a weapons satellite. Use you joystick, or the trak-ball , if you plugged one into port 2, to aim at an incoming missile and press fire to blast it. If it gets past you but has not reached your city, you get a &quot;Refocusing&quot; message and the view switches to a short range view where you will get one more try.<br><br> Be warned that ships can attack you no matter what mode you are in. On the easiest level, there are no hidden bases nor do you use fuel.",
  "publishedBy": "Atari Corp. (UK) Ltd.",
  "developedBy": "Atari Corporation",
  "released": "1988",
  "alsoFor": "Atari 8-bit | Combined View",
  "genre": "Action",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/final-legacy",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Atari Corp. (UK) Ltd.",
          "developer": "Atari Corporation",
          "ported": "Paradox Software",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/689937-final-legacy-atari-st-screenshot-title-picture-and-menu.png",
      "caption": "Title picture and menu"
    },
    {
      "link": "/images/shots/l/689938-final-legacy-atari-st-screenshot-selecting-difficulty-and.png",
      "caption": "Selecting difficulty and start game"
    },
    {
      "link": "/images/shots/l/689939-final-legacy-atari-st-screenshot-main-menu-in-game-switch.png",
      "caption": "Main menu in game - switch to map, land attack, flak and ship fight"
    },
    {
      "link": "/images/shots/l/689940-final-legacy-atari-st-screenshot-full-map-see-enemy-ship-movement.png",
      "caption": "Full map - see enemy ship movement and targets on land. Also you can move your ship very fast to zones of action."
    },
    {
      "link": "/images/shots/l/689941-final-legacy-atari-st-screenshot-attacking-a-target-on-land.png",
      "caption": "Attacking a target on land with a beam weapon. Quite modern, my ship to have such a thing."
    },
    {
      "link": "/images/shots/l/689942-final-legacy-atari-st-screenshot-the-pink-bars-are-the-radar.png",
      "caption": "The pink bars are the radar. If a bar is very small, the target is behind you and you have to move back."
    },
    {
      "link": "/images/shots/l/689943-final-legacy-atari-st-screenshot-sea-fight-a-ship-is-attacking.png",
      "caption": "Sea fight: a ship is attacking with a missile from distance."
    },
    {
      "link": "/images/shots/l/689944-final-legacy-atari-st-screenshot-even-if-the-enemy-ship-is.png",
      "caption": "Even if the enemy ship is far away, that does not mean I could not spend some shots on it."
    },
    {
      "link": "/images/shots/l/689947-final-legacy-atari-st-screenshot-the-white-bar-on-the-radar.png",
      "caption": "The white bar on the radar is quite full -- so a ship must be very near. Ah over there, and my first shot is hitting it too."
    }
  ],
  "cover": []
}