{
  "name": "Fun School 2: For 6-8 Year Olds",
  "shortName": "fun-school-2-for-6-8-year-olds",
  "description": "<i>Fun School 2: For 6-8 Year Olds</i> is an educational game part of the Fun School series with this version aimed at the ages of six, seven and eight. Parents can choose a difficulty level for each game and also enter their own words to use. There are eight activities for a child to play and these consist of:<br><br><b>Number Train:</b> A coloured train moves along the rails and the child has to stop it at the matching coloured station to drop off and pick up passengers. Once the train has stopped at the correct station, a maths problem appears and when the correct answer is typed the train moves on and changes colour.<br><br><b>Maths Maze:</b> The child has to move a frog around a maze full of creatures and when the frog touches a creature a maths problem appears and the correct answer is needed to move on.<br><br><b>Shopping:</b> The child has a shopping list and the child must move the frog to the correct shop from a choice of four to select the highlighted item on the list.<br><br><b>Treasure Hunt:</b> Treasure is hidden on an island made up of squares and the child must type in co-ordinates to move a frog to search that square. If the treasure isn't there then the computer says how close the frog is to the actual treasure by using cold, warm and hot.<br><br><b>Bounce:</b> A hand holds a ball and the child must adjust the position and angle of the hand to throw the ball and hit an apple in a room.<br><br><b>Animals:</b> This is a version of hangman where a child has ten attempts to guess the letters to make up the name of an animal. If the child guesses the word correctly then a caterpillar eats an apple. Run out of attempts and the child loses apples from a bowl..<br><br><b>Packing:</b> A square needs filling with a variety of shapes in the correct position to fill it. The child moves a frog to place shapes into the square.<br><br><b>Number Jump: </b> A grid of various numbers are shown to the child and a frog needs to be moved across the grid from left to right. The correct number to jump on has to be part of a multiplication table shown.",
  "publishedBy": "Database Educational Software",
  "developedBy": "",
  "released": "1989",
  "alsoFor": "Amstrad CPC, BBC Micro, Commodore 64, DOS, Electron, ZX Spectrum | Combined View",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/fun-school-2-for-6-8-year-olds",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Database Educational Software",
          "developer": "",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}