{
  "name": "Fussball.prg",
  "shortName": "fussballprg",
  "description": "<em>Fussball.prg</em> is a small football simulation game in German language. In a league with eight clubs your team is heading for winning the championship. The player takes the role of the club manager, who trades players and set some strategic decisions. For example, the amount of money to invest in your youth center can be set, as well as the amount to for medical services and public relations. Players can be traded freely. The players in the game do not have names, but values. The top players are valued 2.000.000, while a common player is only worth 250.000. Higher valued players propose better chances to win. Creation of the values of the player of a squad in the first place is mainly based on luck: for all the players in the player's team, a value between the lowest and highest can be played by a kind of slot machine. With very good timing this may be solved better, but in general it is random.<br><br>The matches are simulated by showing the goals but without any possible interaction by the player. After each match day, the coach can dismissed, if the teams performance didn't matched the expectations.<br><br>You can chose the leagues to play in from nine premade leagues in the beginning, but you can also create your own league and team with an external league editor program which is part of the package.",
  "publishedBy": "Poffel Products",
  "developedBy": "Poffel Products",
  "released": "1986",
  "alsoFor": "",
  "genre": "Simulation, Sports, Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "Football (European) / Soccer",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/fussballprg",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Poffel Products",
          "developer": "Poffel Products",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1986",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/803718-fussball-prg-atari-st-screenshot-game-start-the-files-contain.png",
      "caption": "Game start: the files contain the different league to play"
    },
    {
      "link": "/images/shots/l/803719-fussball-prg-atari-st-screenshot-your-first-team-is-created.png",
      "caption": "Your first team is created by random selection: the left values flicker and if you press stop, your team gets a player of the given price"
    },
    {
      "link": "/images/shots/l/803720-fussball-prg-atari-st-screenshot-i-had-a-lot-of-luck-so-far.png",
      "caption": "I had a lot of luck so far: many players with prices over 1.000.000 yet"
    },
    {
      "link": "/images/shots/l/803721-fussball-prg-atari-st-screenshot-team-view-as-the-players.png",
      "caption": "Team view: as the players have no names, they are represented by their value. So my team OSNARBRUECK has two players with value 2.000.000"
    },
    {
      "link": "/images/shots/l/803722-fussball-prg-atari-st-screenshot-the-club-bayer-uerdingen.png",
      "caption": "The club Bayer Uerdingen offers 1.750.000 for my 1.500.000 player. I will reject"
    },
    {
      "link": "/images/shots/l/803723-fussball-prg-atari-st-screenshot-overview-over-the-trading.png",
      "caption": "Overview over the trading activities"
    },
    {
      "link": "/images/shots/l/803724-fussball-prg-atari-st-screenshot-set-the-amounts-to-invest.png",
      "caption": "Set the amounts to invest in youth, medics, organization and public relations"
    },
    {
      "link": "/images/shots/l/803725-fussball-prg-atari-st-screenshot-match-view-time-is-ticking.png",
      "caption": "Match view: time is ticking and goals are shown (as text). I am quite satisfied with the current table"
    },
    {
      "link": "/images/shots/l/803726-fussball-prg-atari-st-screenshot-final-table-of-the-season.png",
      "caption": "Final table of the season -- I finished third"
    }
  ],
  "cover": []
}