{
  "name": "Hard Nova",
  "shortName": "hard-nova",
  "description": "A spaceship carrying a mercenary with the crew was hit by a meteor. Its hull was breached, and only the mercenary and the navigator A’kri Janr managed to escape. Gerard Kendall, the head of Starkiller Mercenary Group, gave the survivors a new ship. Now they have to find a new crew in order to complete their jobs. It's high time for mercenary work, as various groups are fighting for supremacy in the Four Systems. Meanwhile, the sun of a remote planet is dying, and only a miracle can save an entire race from extinction...<br><br><i>Hard Nova</i> is a sci-fi role-playing game with space exploration, spaceship customization and combat, and trading elements, somewhat similar in concept to <a href=\"https://www.mobygames.com/game/sentinel-worlds-i-future-magic\">Sentinel Worlds I: Future Magic</a>. There is no character creation in the game: in the beginning the player selects between the female mercenary Nova and the male mercenary Stark. They have slightly different attributes and may gain access to different dialogue lines as the game advances. Most other crew members have to be recruited from within the game world. Three of them can be taken to locations on various planets, where they may interact with other characters and participate in combat, where only the leader is controlled manually. On-foot combat is done in real time, with delays caused by weapon properties and the characters' proficiencies. Guns play a prominent role in battles.<br><br>Experience points are awarded for harming enemies. When a character levels up, these points can be manually allocated to improve their parameters. Each character has two sets of abilities, land-based and ship-based. Land-based abilities include general aptitude in improving through combat, agility, stealth, fitness, various weapon proficiencies, etc. Ship-based abilities include mechanics, programming, gunner skills, and others. Each crew member is assigned a role on the ship, such as pilot, engineer, technician, and so on.<br><br>The player is taken to a hovercraft when reaching the orbit of a planet. An exact location can be selected, where the hovercraft can be controlled manually. Only a few places can serve as hovercraft docks, and the player needs to manoeuvre the craft precisely to land it. The hovercraft may also be attacked by hostiles, which leads to action-based combat. <br><br>When leaving an orbit, the player can navigate the starship J-21C Delphenus through space. There are four star systems in the game: the powerful and militant Ariel, the Rouyn system known for its valuable minerals,  the Ciberan system with its supplies of water and fuel, and the Mastassini system, where the player starts the game. The systems are connected by stargates and each hosts several planets. The player-controlled spaceship may encounter hostile ships, which can be fought in arcade action style. The ship can be outfitted with various weapons, and improve in different aspects such as avionics, thrusters, etc. Better parts and fuel can be purchased on space stations. The player can also trade between star systems, using the money to buy better equipment for the crew and customize the ship.",
  "publishedBy": "Electronic Arts, Inc.",
  "developedBy": "Spaceport Malibu",
  "released": "1991",
  "alsoFor": "Amiga, DOS | Combined View",
  "genre": "Action, Role-Playing (RPG)",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/hard-nova",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Electronic Arts, Inc.",
          "developer": "Spaceport Malibu",
          "ported": "Abersoft Limited",
          "country": " United States",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/138173-hard-nova-atari-st-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/138174-hard-nova-atari-st-screenshot-choose-your-hero.png",
      "caption": "Choose your hero"
    },
    {
      "link": "/images/shots/l/138175-hard-nova-atari-st-screenshot-intro-screen.png",
      "caption": "Intro screen"
    },
    {
      "link": "/images/shots/l/138176-hard-nova-atari-st-screenshot-the-very-begining.png",
      "caption": "The very begining"
    },
    {
      "link": "/images/shots/l/138177-hard-nova-atari-st-screenshot-inside-the-base.png",
      "caption": "Inside the base"
    },
    {
      "link": "/images/shots/l/138178-hard-nova-atari-st-screenshot-flying-next-to-spaceport.png",
      "caption": "Flying next to spaceport"
    },
    {
      "link": "/images/shots/l/138179-hard-nova-atari-st-screenshot-flying-over-the-planet.png",
      "caption": "Flying over the planet"
    },
    {
      "link": "/images/shots/l/138180-hard-nova-atari-st-screenshot-on-the-orbit.png",
      "caption": "On the orbit"
    },
    {
      "link": "/images/shots/l/138181-hard-nova-atari-st-screenshot-in-the-space.png",
      "caption": "In the space"
    },
    {
      "link": "/images/shots/l/138182-hard-nova-atari-st-screenshot-station-services.png",
      "caption": "Station services"
    },
    {
      "link": "/images/shots/l/138183-hard-nova-atari-st-screenshot-crew-member-1.png",
      "caption": "Crew member #1"
    },
    {
      "link": "/images/shots/l/138184-hard-nova-atari-st-screenshot-crew-member-2-good-looking-one.png",
      "caption": "Crew member #2 - good looking one"
    }
  ],
  "cover": []
}