{
  "name": "Le Labyrinthe de Morphintax",
  "shortName": "le-labyrinthe-de-morphintax",
  "description": "The planet Morphintax has been an ally of the Planetary System Union (P.S.U.) for a very long time, until the machine that was managing the planet's greatest wealth, a giant library network, was corrupted by all this knowledge and became the power hungry entity known as 'The Master'. The three members of the council decided to sens a special P.S.U. agent equipped with only a laser gun and a mini-dictionary to face The Master.<br><br><i>Le Labyrinthe de Morphintax</i> is an edutainment game about French language. Different aspects of French such as etymology, homophones, absurd sentences and vocabulary are taught through various multiple choice questions. The player travels through a labyrinth in the hope of reaching 'The Master'. On the way, various fantasy creatures and robots will stall the player by asking questions, with different results depending on the chosen answer. Some creatures will even attack the player if the right answer is chosen, or ask for a gift in order to open the way. Help is available (either via an helpful character, or by using the mini-dictionary) for more difficult questions. Some puzzles are also found along the way; the answer chosen will determine which way the player will go. Such puzzles may be a choice between three animals, one of which must be chosen by associating the various species to the correct animal. Some events might even require the player to choose the wrong answer on purpose.",
  "publishedBy": "Retz",
  "developedBy": "",
  "released": "1991",
  "alsoFor": "Amstrad CPC, DOS | Combined View",
  "genre": "Adventure, Educational",
  "perspective": "3rd-person (Other), Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/le-labyrinthe-de-morphintax",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Retz",
          "developer": "",
          "ported": "",
          "country": " France",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}