{
  "name": "Life &amp; Death",
  "shortName": "life-death",
  "description": "<i>Life &amp; Death</i> is a game which casts you as a doctor in a hospital. Your job is to diagnose patients and administer appropriate therapies, or even perform surgery when necessary. <br><br>The game was created in conjunction with by Myo Thant, a Hematologist.  <br><br>To diagnose a patient, you have to press on his or her abdomen, to see which portions of the stomach cause pain. Based on triaging the patient (observation, medication or referring to another specialist), administering a X-Ray or ultrasound scan, you have to make a decision about the care, including surgery or medication.<br><br>In some cases, surgery will be necessary. You're the surgeon and you have to perform the operation very carefully, adhering strictly to the procedures, preserving hygiene, and maintaining care when cutting up the patient. <br><br>Should you mistakenly administer the wrong therapy, or kill your patient at the operating table, you're kicked into the medical school, where you're given hints as to what you've done wrong.",
  "publishedBy": "Mindscape, Inc.",
  "developedBy": "Software Toolworks, Inc., The",
  "released": "1991",
  "alsoFor": "Amiga, Apple IIgs, DOS, FM Towns, Macintosh, PC-98, Sharp X68000 | Combined View",
  "genre": "Simulation",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/life-death",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Mindscape, Inc.",
          "developer": "Software Toolworks, Inc., The",
          "ported": "",
          "country": " United States",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/62109-life-death-atari-st-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "United Kingdom",
      "platforms": "Atari ST"
    }
  ]
}