{
  "name": "Mafia: The Game",
  "shortName": "mafia-the-game",
  "description": "<em>Mafia: The Game</em> is an economical simulation in the world of crime. In a fictive city, the player can trade with real estates, take loans from the bank in the attempt to get more money. You can rent your flats to people, ensure you have discotheques and guest houses in all parts of the city. All those businesses require money and personal to run, which you can hire on the market.<br><br>But in this game, beside your bank account and official business, you also have black money deposit and can trade with drugs, weapons or information. Instead of giving your flats for rent, you can also hire some prostitutes and use the flat as a whorehouse. You can hire chemical staff to run drug production, install betting agencies and other non-legal businesses. If you hire some rowdies, you can send your gang for some protection money or directly to rob a bank. Finally, you can even send a killer to your opponents.<br><br>Each month you can set up your things and after this turn, you get a report how your business is developing. There are random events, like the police arrested some of your employees and you can decide to pay the bail money or not. Those random events can be created with an external program in the game package. Games can be saved and loaded. The difficulty of the game can be set by the amount of money you have at the beginning.<br><br>The game is only available in German languages and only runs on the monochrome monitor.",
  "publishedBy": "",
  "developedBy": "",
  "released": "1994",
  "alsoFor": "",
  "genre": "Simulation",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/mafia-the-game",
  "visual": "",
  "gamePlay": "Managerial / business simulation",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/803499-mafia-the-game-atari-st-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/803500-mafia-the-game-atari-st-screenshot-new-game-setting-difficulty.png",
      "caption": "New game: setting difficulty (amount of money) and goals to reach"
    },
    {
      "link": "/images/shots/l/803501-mafia-the-game-atari-st-screenshot-main-screen-with-information.png",
      "caption": "Main screen with information about your financial situation"
    },
    {
      "link": "/images/shots/l/803502-mafia-the-game-atari-st-screenshot-trade-flats-houses-guest.png",
      "caption": "Trade flats, houses, guest houses and discotheques in all parts of the town"
    },
    {
      "link": "/images/shots/l/803503-mafia-the-game-atari-st-screenshot-if-you-have-the-desired.png",
      "caption": "If you have the desired location, you can set up an betting office, casino, drug production or a whorehouse"
    },
    {
      "link": "/images/shots/l/803504-mafia-the-game-atari-st-screenshot-currently-there-are-some.png",
      "caption": "Currently, there are some drugs on the market (this is not the case in each turn)"
    },
    {
      "link": "/images/shots/l/803505-mafia-the-game-atari-st-screenshot-analyses-of-the-last-turn.png",
      "caption": "Analyses of the last turn: overview over normal accounts, black money, income, and employees"
    },
    {
      "link": "/images/shots/l/803506-mafia-the-game-atari-st-screenshot-we-hire-some-prostitutes.png",
      "caption": "We hire some prostitutes now"
    },
    {
      "link": "/images/shots/l/803507-mafia-the-game-atari-st-screenshot-as-i-am-running-out-of.png",
      "caption": "As I am running out of legal cash, I get a big loan"
    },
    {
      "link": "/images/shots/l/803508-mafia-the-game-atari-st-screenshot-and-as-i-require-even-more.png",
      "caption": "And as I require even more money, I plan a bank robbery. Even planning it is expensive"
    }
  ],
  "cover": []
}