{
  "name": "Manhunter 2: San Francisco",
  "shortName": "manhunter-2-san-francisco",
  "description": "Picking up immediately where <a href=\"https://www.mobygames.com/game/manhunter-new-york\">Manhunter: New York</a> left off, <i>Manhunter 2: San Francisco</i> has the player crash-landing their stolen ship in the City by the Bay after trying unsuccessfully to keep up with enigmatic serial killer Phil.  Left with no alternatives, the player assumes the identity of a local Manhunter and solves more crimes for the alien Orbs while searching for Phil and working for the local human resistance.<br><br><i>Manhunter 2</i> presents the same urban decay and oppressive alien invader regime as visualized in the original, this time using streets and landmarks from the Bay Area. The Golden Gate Bridge, Coit Tower, Alcatraz prison, and the TransAmerica Pyramid all receive alien makeovers. New puzzles, new characters, and new investigations await as the player tracks Phil by his string of strangled corpses.<br><br>All concepts and gameplay elements from <i>Manhunter: New York</i> return.  The player again uses the MAD tracking device to follow suspects provided by the alien Orbs and uses clues found through first-person location investigation to discover the suspects' name.  Occasional arcade sequences bring mixed challenges, and though they cannot be skipped, a new difficulty option has been implemented. The same point-and-click gameplay (no typing required) is used to navigate the game world.",
  "publishedBy": "Sierra On-Line, Inc.",
  "developedBy": "Evryware",
  "released": "Sep, 1989",
  "alsoFor": "Amiga, DOS, Macintosh | Combined View",
  "genre": "Adventure",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/manhunter-2-san-francisco",
  "visual": "",
  "gamePlay": "Puzzle elements",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Sierra On-Line, Inc.",
          "developer": "Evryware",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep, 1989",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/91859-manhunter-2-san-francisco-atari-st-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "United States  and Canada",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/91860-manhunter-2-san-francisco-atari-st-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "United States  and Canada",
      "platforms": "Atari ST"
    }
  ]
}