{
  "name": "Meurtres en série",
  "shortName": "meurtres-en-srie",
  "description": "The third game in the 'Meurtres' ('Murders') mystery series by Bertrand Brocard, published in French only.<br><br>Now we investigate a series of murders happening on the tiny island of Sark in the southwestern English Channel, off the coast of Normandy. We come here by boat at 11 o'clock in the morning - and we have only eight hours before the boat leaves. The island is small, but the cars are banned here, so traveling around by foot can take some time - unless we could find ourselves a bicycle. In difference from 'Meurtre a Grande Vitesse' and 'Murder on the Atlantic', the investigation process in 'Meurtres en Série' is time-limited - however we can always rewind the clock and replay the game following other paths.<br><br>The gameplay is still rather similar to other games in the series: finding people, listening to their testimonies and looking for clues, most of which were supplied in physical forms, as 'feelies' in the box of the game: such riddles and puzzles are to be solved mostly in our mind, as the game only checks some answers for them in a special test section that appears after we leave the island at 7 o'clock in the evening. There are 35 persons to interrogate, several murders to solve, and some great ancient treasure to be discovered. ",
  "publishedBy": "Cobra Soft",
  "developedBy": "Hitech Productions",
  "released": "1988",
  "alsoFor": "Amstrad CPC, DOS, Thomson TO | Combined View",
  "genre": "Adventure",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/meurtres-en-srie",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Cobra Soft",
          "developer": "Hitech Productions",
          "ported": "",
          "country": " France",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/990263-meurtres-en-serie-atari-st-screenshot-the-title-screen.png",
      "caption": "The title screen"
    },
    {
      "link": "/images/shots/l/990264-meurtres-en-serie-atari-st-screenshot-listening-to-a-person.png",
      "caption": "Listening to a person"
    }
  ],
  "cover": []
}