{
  "name": "Only! Valency",
  "shortName": "only-valency",
  "description": "<em>Only! Valency</em> is a puzzle game in which you have to reconstruct molecules. Each molecule is consisting of atoms in six different colors with connections to each other. On the lower border you have a strip with according atoms, which you can scroll left and right to select an appropriate color. You can only set atoms on spots connected to any atom already added to the molecule (and in each level at the beginning one atom is given). There are some constraints on adding atoms: beside a connection to an already added atom the nearest connection in the selected columns must be of the same color than chosen in the stripe below. Adding always go from the top to the bottom, and if any atom in the chosen column is lower than the free spot, this column is blocked. To reach free spots, you can rotate the atom in 90 degree steps and move the adding column left and right.<br><br>The goal in <em>Only! Valency</em> is strictly time based and the game forces you to add the atoms as fast as possible by rewarding better times with higher scores. But you have to be careful: if you have chosen a wrong color or adding to a blocked column, you are punished with fault points. Also, in some situations, you have to add atoms from the left or right, which is valid, but also increasing your fault score.<br><br>There are three playing mode: in &quot;Solitaire&quot; mode you have no time limit, but building the molecule faster gets you a higher score. In &quot;Tournament&quot; mode you have an overall time limit for rebuilding the molecule. In &quot;Fallout&quot; you have a maximum time per atom, which is reset after adding one atom. Both time limits in Tournament and Fallout can be chosen by the player. A high-score list keeps track of the players success. There are 300 levels which you can play in any order. Language in the game is either English or German.",
  "publishedBy": "",
  "developedBy": "",
  "released": "Dec 21, 1994",
  "alsoFor": "",
  "genre": "Action, Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/only-valency",
  "visual": "Fixed / flip-screen",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/800349-only-valency-atari-st-screenshot-title-screen-640x480x16-colors.png",
      "caption": "Title screen (640x480x16 colors)"
    },
    {
      "link": "/images/shots/l/800350-only-valency-atari-st-screenshot-options.png",
      "caption": "Options"
    },
    {
      "link": "/images/shots/l/800351-only-valency-atari-st-screenshot-instructions.png",
      "caption": "Instructions"
    },
    {
      "link": "/images/shots/l/800352-only-valency-atari-st-screenshot-starting-is-green-we-could.png",
      "caption": "Starting is green. We could add connected grey or blue to the left. Trying to add connected blue above would be a fault, as the column is blocked by the already added green"
    },
    {
      "link": "/images/shots/l/800353-only-valency-atari-st-screenshot-you-can-move-the-adding-column.png",
      "caption": "You can move the adding column to the left and right (as in the lower border also blue is selected, adding would be fine here)"
    },
    {
      "link": "/images/shots/l/800354-only-valency-atari-st-screenshot-adding-green-would-be-valid.png",
      "caption": "Adding green would be valid (both greens)"
    },
    {
      "link": "/images/shots/l/800355-only-valency-atari-st-screenshot-a-nearly-finished-board-but.png",
      "caption": "A nearly finished board. But take a look at my fault score!"
    },
    {
      "link": "/images/shots/l/800356-only-valency-atari-st-screenshot-some-rotating-is-required.png",
      "caption": "Some rotating is required in this level"
    },
    {
      "link": "/images/shots/l/800357-only-valency-atari-st-screenshot-impression-of-a-later-level.png",
      "caption": "Impression of a later level"
    },
    {
      "link": "/images/shots/l/800358-only-valency-atari-st-screenshot-another-high-level.png",
      "caption": "Another high level"
    },
    {
      "link": "/images/shots/l/800359-only-valency-atari-st-screenshot-high-scores-are-possible.png",
      "caption": "High-scores are possible in each level by taking the time into account"
    },
    {
      "link": "/images/shots/l/800360-only-valency-atari-st-screenshot-being-a-beginner-i-only-entered.png",
      "caption": "Being a beginner I only entered the high-score table in Solitaire (&quot;So&quot;) mode"
    },
    {
      "link": "/images/shots/l/800361-only-valency-atari-st-screenshot-in-both-tournament-and-fallout.png",
      "caption": "In both Tournament and Fallout mode you can set the time limit before the start"
    },
    {
      "link": "/images/shots/l/800362-only-valency-atari-st-screenshot-after-playing-some-levels.png",
      "caption": "After playing some levels, the game ranks your success with an overall &quot;IQ&quot; value. Lower is better."
    }
  ],
  "cover": []
}