{
  "name": "Orb",
  "shortName": "orb",
  "description": "<em>Orb</em> is a freeware conversion of the puzzle game <a href=\"https://www.mobygames.com/game/soko-ban\">Sokoban</a>. The goal of the game is to push boxes spread across a level on marked spots.<br><br>The game has not only converted the game mechanics, it even features the levels of the original game. The addition of <em>Orb</em> are some convenient and innovative approaches of control: clicking left on a field moves the player to the spot if no box pushing is required to reach the spot. Double clicking moves the player to that spot too, and pushes any box in the way. Up to four positions can be saved and the player can instantly return to them with the function keys. These functions do not alter the gameplay, but do make playing the game much faster, as by manually moving the player's avatar in <em>Sokoban</em>'s levels sometimes require repetitive moving. Classic control via joystick is also supported as well as an undo function for the last move.<br><br>The game is implemented as system friendly application, so it can even be played in a multi-tasking operating system. There are two zoom levels, so even on smaller monitors no scrolling is required (although the game can scroll the maps if required).",
  "publishedBy": "",
  "developedBy": "",
  "released": "1999",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/orb",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": []
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/797451-orb-atari-st-screenshot-game-started-640x480x256-colors.png",
      "caption": "Game started (640x480x256 colors)"
    },
    {
      "link": "/images/shots/l/797453-orb-atari-st-screenshot-level-1-with-small-icons-help-is-also.png",
      "caption": "Level 1 with small icons. Help is also displayed"
    },
    {
      "link": "/images/shots/l/797455-orb-atari-st-screenshot-the-graphic-set-can-be-zoomed-if-you.png",
      "caption": "The graphic set can be zoomed, if you have a graphic card for higher resolution."
    },
    {
      "link": "/images/shots/l/797456-orb-atari-st-screenshot-on-this-monitor-the-scrolling-makes.png",
      "caption": "On this monitor, the scrolling makes the game more difficult"
    },
    {
      "link": "/images/shots/l/797457-orb-atari-st-screenshot-level-2.png",
      "caption": "Level 2"
    },
    {
      "link": "/images/shots/l/797458-orb-atari-st-screenshot-the-game-also-runs-on-monochrome-monitors.png",
      "caption": "The game also runs on monochrome monitors (640x400)"
    }
  ],
  "cover": []
}