{
  "name": "Paragliding",
  "shortName": "paragliding",
  "description": "The game is an enhanced remake of the original <a href=\"https://www.mobygames.com/game/paragliding_\">Paraplane</a> for Amstrad CPC.<br><br>Different stages of player's skills allow you to play a different types of games. \nWhile Practicing you may complete the exercises to train yourself in main gameplay actions such as taking off, landing, flowing using air currents, etc. \nWhile Strolling you may explore the flags/balloons positions and relief of the four places of the world (Arabic Desert, Green Alps, Snow Mountains, and American Canyon), where paragliding events are set.\nWhile Competition you may, choosing one of eight nations of players (Japanese, English, American, Spanish, Russian, French, German, and Italian), to make a score, collecting the flags and balloons and taking into account the time flowing.\nWhile Championship you with up to 4 players may challenge each other completing one after another the different events such as speed, precision, technique, etc. \nHigh scores are saved in the Hi-Score Table.<br><br>The gameplay includes enjoying the intro music, taking off, paragliding using air currents and clouds, avoiding the static and dynamic obstacles, collecting the flags and balloons, and landing.<br><br>The game was made in French/English/German/Spanish.",
  "publishedBy": "Loriciel SA",
  "developedBy": "Atreid Concept SA",
  "released": "1991",
  "alsoFor": "Amiga, DOS | Combined View",
  "genre": "Action, Simulation",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/paragliding",
  "visual": "2D scrolling",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Loriciel SA",
          "developer": "Atreid Concept SA",
          "ported": "",
          "country": " France",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}