{
  "name": "Quadralien",
  "shortName": "quadralien",
  "description": "Quadralien is a real-time puzzle game in the tradition of <a href=\"https://www.mobygames.com/search/quick?game=Sokoban\">Sokoban</a>.<br><br>The future: Mankind's space stations throughout the solar system are powered by a huge space reactor, called Astra. Astra is about to break down. The enemy race of Quadraliens has captured the reactor; now, contamination is rising and total failure is imminent. The last chance are six remotely controlled droids, which are to clean Astra and destroy the Quadrailen mother in Astras core.<br><br>You're controlling two robots in each of the 19 levels, cleaning up the contamination on your way. Gameplay is a variation of Sokoban: You've got to push spheres in the right direction to clear the way. However, the spheres are magnetically charged, meaning that they repell or attract each other. You've got to consider chain reactions. <br><br>Before entering a level, you may chose which robots to take with you. Each droid has different abilities, like higher range of movement, higher capacity to carry contaminated materials, or a magnetic charge of its own.  You can blast your way out of hopeless situations with a limited number of detonators, and you may restart every level with already removed contamination staying removed. However, there's a time limit for the whole game in form of reactor core temperature and energy, so be quick! ",
  "publishedBy": "Logotron Ltd",
  "developedBy": "Astral Software",
  "released": "1988",
  "alsoFor": "Amiga, DOS | Combined View",
  "genre": "Puzzle",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/quadralien",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Logotron Ltd",
          "developer": "Astral Software",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/267569-quadralien-atari-st-screenshot-the-title-screen.png",
      "caption": "The title screen"
    },
    {
      "link": "/images/shots/l/267570-quadralien-atari-st-screenshot-the-first-level-right-in-the.png",
      "caption": "The first level right in the beginning"
    },
    {
      "link": "/images/shots/l/695951-quadralien-atari-st-screenshot-menu-for-starting-a-level-select.png",
      "caption": "Menu for starting a level: select droids and chambers"
    },
    {
      "link": "/images/shots/l/695952-quadralien-atari-st-screenshot-select-droids-to-use-in-this.png",
      "caption": "Select droids to use in this level -- each one has different abilities and you can take 2 with you"
    },
    {
      "link": "/images/shots/l/695953-quadralien-atari-st-screenshot-cooling-by-pushing-some-ice.png",
      "caption": "Cooling by pushing some ice in the ship's core (top right)"
    },
    {
      "link": "/images/shots/l/695954-quadralien-atari-st-screenshot-terminal-menu-in-the-level.png",
      "caption": "Terminal menu in the level: drop the collected waste, recharge energy, and gather some status information"
    },
    {
      "link": "/images/shots/l/695955-quadralien-atari-st-screenshot-while-the-red-balls-attract.png",
      "caption": "While the red balls attract each other and row themselves, the blue one detract each other and therefore get space between them when they get moved"
    }
  ],
  "cover": []
}