{
  "name": "The Return of Medusa",
  "shortName": "return-of-medusa",
  "description": "In <a href=\"https://www.mobygames.com/game/rings-of-medusa\">Rings of Medusa</a> Prince Cirion managed to defeat Medusa who threatened to overthrow his kingdom Morenor. Unfortunately she has a new plan: travelling to the future (2200) when Cirion is long dead. Of course he pursues her and now his quest of defeating Medusa begins anew. This time the main goal is finding thirteen keys which are divided over dungeons all over the country.<br><br>The change of scenario, the predecessor was set in medieval times, means that there is modern weaponry and technology. In order to find the keys, the player needs to build up an army and gather enough money to search for them and defeat Medusa's city. There are several ways to do this, the most important being trade. Other options are searching for treasure on the world map or playing roulette at a casino. Important for success is the assembly of the army as there are multiple races, classes and weaponry to choose from. The main addition in comparison to the predecessor are the dungeons which are shown from a first person-view. The player can take up to three companions into those dungeons and needs to solve puzzles and defeat enemies in real-time (ranged with firearms) in order to reach the goal. The game is also in real-time when travelling on the world map; only inside the cities where the management part takes place the time is stopped. There is also the occasional arcade sequence to solve.",
  "publishedBy": "Starbyte Software",
  "developedBy": "X-ample Architectures",
  "released": "1991",
  "alsoFor": "Amiga, DOS | Combined View",
  "genre": "Strategy / tactics",
  "perspective": "1st-person, 3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/return-of-medusa",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Starbyte Software",
          "developer": "X-ample Architectures",
          "ported": "",
          "country": " Germany",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/1034760-the-return-of-medusa-atari-st-screenshot-intro-title.png",
      "caption": "Intro title"
    },
    {
      "link": "/images/shots/l/1034761-the-return-of-medusa-atari-st-screenshot-credits.png",
      "caption": "Credits"
    },
    {
      "link": "/images/shots/l/1034762-the-return-of-medusa-atari-st-screenshot-start-of-game.png",
      "caption": "Start of game"
    }
  ],
  "cover": []
}