{
  "name": "Space Ace II: Borf's Revenge",
  "shortName": "space-ace-ii-borfs-revenge",
  "description": "Another Laserdisc conversion of one of Don Bluth’s cartoons: <i>Space Ace II: Borf’s Revenge</i> continues the saga of young cadet Dexter, who tries to free his love Kimberly from the clutches of the evil nemesis Borf. In critical situations, the meek Dexter can transform into his mighty alter ego Space Ace. Thus empowered, he has to defeat Borf’s minions.<br><br><i>Space Ace II</i> is a essentially a cartoon strip in which our hero will encounter numerous hazards. You have to avoid traps and enemies by pressing the right key at the right time: cursor keys for movements, Insert key to shoot. You never control Dexter directly, you just choose an appropriate direction. Each of the 27 seconds-long scenes requires one to three keystrokes. If your decision is wrong, the cartoon will end with a death animation, and Dexter will lose one of his three lives. So you’re basically trying to keep the strip running. Timing is crucial; you will need to press keys in the exact second. Luckily, you’re allowed to save your progress at four fixed points.<br><br><i>Space Ace II</i> is ported to the PC from the original arcade Laserdisc version. The result is a cut version due to space restraints. Although <i>Space Ace II</i> comes on 12(!) low density 5 1/4&quot; discs, most scenes are shortened noticeably. ",
  "publishedBy": "ReadySoft Incorporated",
  "developedBy": "ReadySoft Incorporated",
  "released": "1991",
  "alsoFor": "Amiga, DOS, Macintosh | Combined View",
  "genre": "Action",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/space-ace-ii-borfs-revenge",
  "visual": "",
  "gamePlay": "Arcade, Quick Time Events (QTEs)",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "ReadySoft Incorporated",
          "developer": "ReadySoft Incorporated",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1991",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}