{
  "name": "SpaceCutter",
  "shortName": "spacecutter",
  "description": "In <i>SpaceCutter</i>, the player is trapped inside the Whirligig (which is also the original European name of the game) and needs to find five so-called &quot;solids&quot; to create a portal leading back Earth. The solids are distributed over about four billion &quot;eigenspaces&quot; which are chained together by three to eleven star gates per space. Where they lead is mathematically defined which, coupled with the fact that the location of the solids is disclosed in the manual, means the player can plan the route beforehand.<br><br>Of course there are also the inevitable alien space ships which try to kill the player. The player's Meson-class fighter is equipped with two weapons with limited ammunition: heat-seeking missiles (if no enemy is targeted, the own ship will be hit) and chaff pods which are used to repel close enemies. The third resource is fuel, which is used up when steering, accelerating or braking; flying in a straight line is free. All three can be replenished by visiting space stations that are distributed over the spaces (also following a mathematical basis).\nThe space ship is controlled through mouse movements, e.g. pushing the mouse forward accelerates the ship, and the keyboard is only used for commands like pausing the game. While the spaces themselves are flat and multi-directionally scrolling fields, the objects have a three-dimensional look.",
  "publishedBy": "Rainbird Software",
  "developedBy": "Maelstrom Games Ltd",
  "released": "Sep, 1988",
  "alsoFor": "Amiga | Combined View",
  "genre": "Action",
  "perspective": "3rd-person (Other)",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/spacecutter",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Firebird Software",
          "developer": "Maelstrom Games Ltd",
          "ported": "",
          "country": " United Kingdom",
          "releaseDate": "1988",
          "ean13": "",
          "comments": ""
        },
        {
          "publisher": "Rainbird Software",
          "developer": "Maelstrom Games Ltd",
          "ported": "",
          "country": " United States",
          "releaseDate": "Sep, 1988",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/578743-spacecutter-atari-st-screenshot-loading-screen.png",
      "caption": "Loading screen."
    },
    {
      "link": "/images/shots/l/578744-spacecutter-atari-st-screenshot-title-screen.png",
      "caption": "Title screen."
    },
    {
      "link": "/images/shots/l/578745-spacecutter-atari-st-screenshot-let-s-go.png",
      "caption": "Let's go."
    }
  ],
  "cover": []
}