{
  "name": "Star Command",
  "shortName": "star-command",
  "description": "<i>Star Command</i> is a sci-fi role-playing game set in a vast fictional universe and featuring tactical space and squad-level combat, similar to SSI's <a href=\"https://www.mobygames.com/game/pool-of-radiance\">Pool of Radiance</a> released the same year and other games of the <a href=\"https://www.mobygames.com/search/quick?gamegroup=SSI+Gold+Box\">Gold Box series</a>. The game has nothing to do with <a href=\"https://www.mobygames.com/search/quick?game=Star+Command+Deluxe\">Star Command Deluxe</a> or <a href=\"https://www.mobygames.com/game/star-command-revolution\">Star Command: Revolution</a>.<br><br>The game plays in a distant future. Earth is a distant memory, having been destroyed long ago. The small human population is concentrated in a small portion of the galaxy, called &quot;The Triangle&quot; due to its form, and threatened from its neighbors: The Alpha border is plagued by pirates, recently united under a certain &quot;Blackbeard&quot;, the Beta border is frequently ambushed by an intelligent insect-like alien race who is thought to plan an all-out war. The third border leads to largely unknown territory with space-faring robots of unclear origin. The only hope for mankind is the Star Command, the headquarter of military forces. You control a spaceship crew, trying to secure peace by completing missions issued by Star Command.<br><br>The game starts at Startport Luna, where you first will have to assemble and equip your crew and buy a starship before rushing out saving humanity. Assembling the crew, i.e. character generation, is quite detailed and done by first recruiting and then training characters. Each character has seven basic stats like Strength and Intelligence. If the stats look okay, you select one of four classes (Pilots for flying ships and communicating with aliens, Marines for espionage, Soldiers for fighting, and finally Espers with strange psi powers). The character now has to be trained for eight years; each year, you select a skill to be trained, and, if you're lucky, the character increases his skill -- he may also learn nothing. Skills can be trained more than once, increasing the effective skill level. All in all, there are 18 skills, with a different set available for each class. Some trainings does not improve skills, but basic stats -- Special Forces, for example, increases speed and accuracy.<br><br>Character usually start out as Privates, but they the rank can be increased by going to Officer's school. There are 13 ranks up to Grand Admiral, with increasing pay -- money is sparse, so this may be a good choice. Then again, it may be not. Later in the game, with enough funds, you can create clones of your character to replace him when he dies. Character also age during play.<br><br>After you have created your crew, it's time to spend your money. First of all, you need a spaceship -- there are nine different ships, with different attributes like armor or fuel capacity. The ship may be upgraded by several systems, including from engines, guns, shields, drop ships, computers, etc. Finally, you have to equip your crew, again choosing among a vast selection of armor, weapons and miscellaneous items. Having a fully equipped crew at your disposal, you're now ready to get some mission from the Space Command and launch your ship.<br><br>While in space, you are shown a view of the environment, with commands at the bottom and the crew or ship status on the right. The galaxy is quite big, consisting of 32x32 sectors, each containing several systems, with each one having up to 10 planets. You can select the view, changing from Galaxy Scan (showing the whole galaxy) to Long Range Scan (showing 8x8 sectors) to Sector Scan (all systems and starports of a sector) to System Scan (the star and its planets) to Visual Scan (direct view of a planet, starport or space station with its statistics).<br><br>While travelling through space, you may encounter ships. The game then switches to turn-based tactical combat -- but that may include peaceful interaction. In each turn, you first have a selection of communication strategies -- bargain, plead, ask, demand, even impersonate a deity are possible. Then you can move and rotate your ship, and finally, you can fire. Some situations, for example when you're boarding an enemy ship or while travelling on land, you can engage in squad combat, which closely resembles spaceship combat, but is influenced gravity, atmosphere and terrain.<br><br>One some missions, you will have to explore underground complexes, which may contains traps and other specials events. There are 17 missions all in all, but they have no time limit, so you can do other things -- and you should, like trying to get some cash. Additionally, some missions are randomly generated, so each game differs somewhat. Character get training after each completed mission, but they can also pay for it, which is very expensive.",
  "publishedBy": "Strategic Simulations, Inc.",
  "developedBy": "",
  "released": "1989",
  "alsoFor": "Amiga, DOS, PC-98 | Combined View",
  "genre": "Role-Playing (RPG)",
  "perspective": "1st-person, Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/star-command",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Strategic Simulations, Inc.",
          "developer": "",
          "ported": "Andromeda Software",
          "country": " United States",
          "releaseDate": "1989",
          "ean13": "",
          "comments": "v1.1 (virus-free update)"
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/626980-star-command-atari-st-screenshot-title-screen.png",
      "caption": "Title screen"
    },
    {
      "link": "/images/shots/l/626982-star-command-atari-st-screenshot-menu.png",
      "caption": "Menu"
    },
    {
      "link": "/images/shots/l/626984-star-command-atari-st-screenshot-recruiting-personnel.png",
      "caption": "Recruiting personnel"
    },
    {
      "link": "/images/shots/l/626985-star-command-atari-st-screenshot-training-of-new-squad-members.png",
      "caption": "Training of new squad members"
    },
    {
      "link": "/images/shots/l/626987-star-command-atari-st-screenshot-recruiting-squad-members.png",
      "caption": "Recruiting squad members"
    },
    {
      "link": "/images/shots/l/626988-star-command-atari-st-screenshot-first-mission.png",
      "caption": "First mission"
    },
    {
      "link": "/images/shots/l/626989-star-command-atari-st-screenshot-buy-a-basic-scouting-ship.png",
      "caption": "Buy a basic scouting ship"
    },
    {
      "link": "/images/shots/l/626991-star-command-atari-st-screenshot-cool-i-get-that-panzerjaeger.png",
      "caption": "Cool! I get that &quot;Panzerjaeger&quot; rocket launcher for my Marine"
    },
    {
      "link": "/images/shots/l/626992-star-command-atari-st-screenshot-heading-to-mission-destination.png",
      "caption": "Heading to mission destination"
    },
    {
      "link": "/images/shots/l/626993-star-command-atari-st-screenshot-red-alert-three-freighters.png",
      "caption": "Red alert! Three freighters surrounding my ship"
    },
    {
      "link": "/images/shots/l/626995-star-command-atari-st-screenshot-i-better-fire-now.png",
      "caption": "I better fire now"
    },
    {
      "link": "/images/shots/l/626997-star-command-atari-st-screenshot-my-hypervelocity-rocket-destroyed.png",
      "caption": "My &quot;Hypervelocity Rocket&quot; destroyed one freighter"
    },
    {
      "link": "/images/shots/l/626998-star-command-atari-st-screenshot-scanning.png",
      "caption": "Scanning"
    },
    {
      "link": "/images/shots/l/627000-star-command-atari-st-screenshot-deep-scan-of-one-star-with.png",
      "caption": "Deep scan of one star with further possibilities"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/116205-star-command-atari-st-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "France",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/116206-star-command-atari-st-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "France",
      "platforms": "Atari ST"
    }
  ]
}