{
  "name": "Static",
  "shortName": "static",
  "description": "<em>Static</em> is an implementation of the card game <em>Patience</em>. But: it comes with a twist: it is not only the slow single player game to relax, it is also a hectic competitive multi-player game for up to four players, coming with extensions to the card game. The goal is to finish your four piles before any other player do. As there are some bonus items, you can encourage to finish faster than your opponents, or hinder the others to finish or even steal their cards.<br><br>The basic rules are like in the traditional Patience: each player has 7 columns with cards faced down and a deck. Any card at the end of a column or top of the deck can be turned face up. Turned up cards can be stacked by their number, but only if they have opposite color (a black 4 can be added to a red, but not to a black 5). By reordering the columns, additional card become turnable. Fetching an ace opens one of the four top piles, in which the sequence ace up to king of a single color must be laid down. The game is finished if all four kings are on the top piles.<br><br>The specialities of the multi-player games separates <em>Static</em> from other Solitaire games: in the deck jokers are hidden: in general you play joker cards on a single opponent. Some prevent the player from drawing cards, lock piles for adding cards and other affect your control of the game like slowing the pointer or even invert the controls. The &quot;Metamorphis&quot; joker let you take control of an opponent player's deck for a short time, letting you cause havoc there. The game offers to take control of any of the players, so as a single player you can play up against three computer controlled opponents.<br><br>The game's is highly configurable: for every single of the dozens of extras the amount of appearance can be set (or turned off). The playing strength of the AI can be configured in three levels. Four different graphical sets can be set for each player, the controls can be defined on the keyboard (if not using mouse, joystick or jaguar joypad), music and effects can be configured. The game is featuring a graphical high-score table.",
  "publishedBy": "Reservoir Gods",
  "developedBy": "Reservoir Gods",
  "released": "Jan 04, 1998",
  "alsoFor": "",
  "genre": "Strategy / tactics",
  "perspective": "Top-down",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/static",
  "visual": "",
  "gamePlay": "Cards / tiles",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Reservoir Gods",
          "developer": "Reservoir Gods",
          "ported": "",
          "country": " Worldwide",
          "releaseDate": "Jan 04, 1998",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/805474-static-atari-st-screenshot-title-screen-and-main-menu-falcon.png",
      "caption": "Title screen and main menu (Falcon, VGA)"
    },
    {
      "link": "/images/shots/l/805475-static-atari-st-screenshot-in-game-help.png",
      "caption": "In-game help"
    },
    {
      "link": "/images/shots/l/805476-static-atari-st-screenshot-you-can-adjust-the-rarity-of-each.png",
      "caption": "You can adjust the rarity of each of the joker cards (or turn them off completely)"
    },
    {
      "link": "/images/shots/l/805477-static-atari-st-screenshot-configure-the-graphical-card-sets.png",
      "caption": "Configure the graphical card sets for each player"
    },
    {
      "link": "/images/shots/l/805478-static-atari-st-screenshot-configure-player-control-amount.png",
      "caption": "Configure player control (amount of players, human or AI)"
    },
    {
      "link": "/images/shots/l/805479-static-atari-st-screenshot-starting-a-single-player-game-almost.png",
      "caption": "Starting a single player game: almost traditional Patience"
    },
    {
      "link": "/images/shots/l/805480-static-atari-st-screenshot-bad-luck.png",
      "caption": "Bad luck"
    },
    {
      "link": "/images/shots/l/805481-static-atari-st-screenshot-two-player-game-both-boards-are.png",
      "caption": "Two player game: both boards are displayed beside each other"
    },
    {
      "link": "/images/shots/l/805482-static-atari-st-screenshot-player-2-has-a-lock-effect-atm.png",
      "caption": "Player 2 has a lock effect atm (visible with the card beside the deck. The white bar shows the amount of time until the effect wears off)"
    },
    {
      "link": "/images/shots/l/805483-static-atari-st-screenshot-player-2-won.png",
      "caption": "Player 2 won"
    },
    {
      "link": "/images/shots/l/805484-static-atari-st-screenshot-final-statistics-about-the-game.png",
      "caption": "Final statistics about the game"
    },
    {
      "link": "/images/shots/l/805485-static-atari-st-screenshot-the-party-begins-four-player-game.png",
      "caption": "The party begins: four player game"
    },
    {
      "link": "/images/shots/l/805486-static-atari-st-screenshot-by-default-each-player-has-a-different.png",
      "caption": "By default each player has a different graphical tile set"
    },
    {
      "link": "/images/shots/l/805487-static-atari-st-screenshot-first-three-players-are-affected.png",
      "caption": "First three players are affected by jokers from other players"
    },
    {
      "link": "/images/shots/l/805488-static-atari-st-screenshot-later-in-the-four-player-game.png",
      "caption": "Later in the four player game"
    }
  ],
  "cover": []
}