{
  "name": "Web of Terror",
  "shortName": "web-of-terror",
  "description": "A spaceship has crash landed on Planet Arachnia, home of a giant web that catches all kinds of space junk and giant spiders that travel along the web. All of the spaceship passengers have been forced to evacuate onto the web where they find only hungry spiders waiting for their dinner. As Rock Bimhead, your mission is to rescue as many passengers as you can before they are eaten by the spiders. Your spaceship is equipped with radar to find the passengers, fast enough to dodge the spiders, and carries two types of missiles, silver and gold, to blast the spiders. You do not have unlimited fuel and you need to fly over fuel pods to refuel your ship, so watch your fuel gauge! Flying over the fuel pods will also change the types of missiles you are carrying. But the rescue mission is not that simple. When the spider finds a passenger it captures the passenger in a cocoon and when captured the passenger cannot be detected by your radar. When you find stranded or captured passengers (captured passengers will die, eventually), pick them up (only 4 passengers can fit in your spaceship) and take them to the transporter pod where they will be transported to safety and you will return again to the web to rescue the remaining passengers. Once all of the passengers are either rescued or eaten you can advance to another level with another web to search. There are 125 levels in all.",
  "publishedBy": "Impressions",
  "developedBy": "Vulture Production",
  "released": "1990",
  "alsoFor": "Amiga | Combined View",
  "genre": "Action",
  "perspective": "1st-person",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/web-of-terror",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Impressions",
          "developer": "Vulture Production",
          "ported": "",
          "country": " France, Germany, Italy, United Kingdom",
          "releaseDate": "1990",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": [
    {
      "link": "/images/covers/l/323658-web-of-terror-atari-st-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Box",
      "country": "France , Germany , Italy  and United Kingdom",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/323659-web-of-terror-atari-st-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Box",
      "country": "France , Germany , Italy  and United Kingdom",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/323660-web-of-terror-atari-st-media.jpg",
      "scanOf": "Media",
      "packaging": "Box",
      "country": "France , Germany , Italy  and United Kingdom",
      "platforms": "Atari ST"
    }
  ]
}