{
  "name": "Wizball",
  "shortName": "wizball",
  "description": "In <i>Wizball</i> the player takes the role of the friendly wizard Wiz who can turn himself into a green ball that is able to defend his world against the color-sucking enemies who have turned his once brightly colored Wizworld into a drab planet. With his trusty feline companion Catelite, the wizard will restore the colors to the world by retrieving them from defeated enemies.  There are eight levels to be completed.<br><br>The player starts out as a bouncing green ball that can shoot and be put into more or less heavy rotation to move slowly or faster, physically correct through the side-scrolling levels. The first task is to upgrade the ball by shooting the first non-moving enemies, and collect the green bubbles that are left by them. In order to stand a chance against the following moving enemy waves, some upgrades are a must. First and foremost, complete control over the ball should be activated (i.e. flying through the levels), a shield sheltering the top and bottom of the player's should be acquired, and two-way fire (left/right) should be obtained.<br><br>But the extra needed to advance in <i>Wizball</i> is your friend Catelite who will, once summoned, take the form of a small green satellite that will imitate the ball's movement, or can be directly controlled by the player. Besides upping Wiz' fire power, Catelite is able to collect paint drops left by a certain kind of defeated enemies until the respective color pot is filled up. There's three colors available (red, green and blue), and several different combinations of them must be collected to complete a level and restore it to former colorfulness. Every color combination collected will send Wiz to a bonus stage, then to his laboratory where one of the power-ups can be made permanently.<br><br>The game also features a bunch of multi-player modes, there's even a two-player cooperative mode amongst them.",
  "publishedBy": "Ocean Software Ltd.",
  "developedBy": "Sensible Software",
  "released": "1988",
  "alsoFor": "Amiga, Amstrad CPC, Antstream, Commodore 64, DOS, PC Booter, Thomson TO, ZX Spectrum | Combined View",
  "genre": "Action",
  "perspective": "Side view",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/wizball",
  "visual": "",
  "gamePlay": "Arcade",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Ocean Software Ltd.",
          "developer": "Sensible Software",
          "ported": "",
          "country": " France, Germany, United Kingdom",
          "releaseDate": "1988",
          "ean13": "5 013156 011856",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [
    {
      "link": "/images/shots/l/306623-wizball-atari-st-screenshot-introduction.png",
      "caption": "Introduction"
    },
    {
      "link": "/images/shots/l/306624-wizball-atari-st-screenshot-splash-screen.png",
      "caption": "Splash screen"
    },
    {
      "link": "/images/shots/l/306625-wizball-atari-st-screenshot-start-menu.png",
      "caption": "Start menu"
    },
    {
      "link": "/images/shots/l/306626-wizball-atari-st-screenshot-beginning-a-new-game.png",
      "caption": "Beginning a new game"
    }
  ],
  "cover": [
    {
      "link": "/images/covers/l/262309-wizball-atari-st-front-cover.jpg",
      "scanOf": "Front Cover",
      "packaging": "Plastic Case",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/262311-wizball-atari-st-back-cover.jpg",
      "scanOf": "Back Cover",
      "packaging": "Plastic Case",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Atari ST"
    },
    {
      "link": "/images/covers/l/262310-wizball-atari-st-media.jpg",
      "scanOf": "Media",
      "packaging": "Plastic Case",
      "country": "France , Germany  and United Kingdom",
      "platforms": "Atari ST"
    }
  ]
}