{
  "name": "The Wonders of The Animal Kingdom",
  "shortName": "wonders-of-the-animal-kingdom",
  "description": "<i>The Wonders of The Animal Kingdom</i> is an educational game for ages six to twelve that consists of six learning activities. The game intends to train a number of skills including reading comprehension, science knowledge, spelling, memory, logic and pattern recognition.\n<ul>\n\t<li><b>All About Animals</b> is not a game but allows the player to read about different animals and look at the pictures.</li>\n\t<li><b>Animal Spells</b> is a spelling game where the player is shown an animal and has to type in its name correctly.</li>\n\t<li><b>Animalgrams</b> is about unscrambling the names of animals. The animals habitat is shown with its name scrambled up. The player's task is to enter the letters in the correct order.</li>\n\t<li><b>What's Different?</b> is a game about choosing the animal that doesn't belong to the same family as the rest. Six pictures will be shown and the player has to click on the one that doesn't belong.</li>\n\t<li><b>Who am I?</b> is about guessing which of six animals correspond to the three sentences that appear on the screen.</li>\n\t<li><b>Memory Game</b> is a game where six animals are shown and then hidden. The player will then be asked to click on which gate each animal is hiding behind. It can be played by up to four players.</li>\n</ul>",
  "publishedBy": "Unicorn Software Company",
  "developedBy": "Unicorn Software Company",
  "released": "1987",
  "alsoFor": "Amiga, Apple II, Apple IIgs | Combined View",
  "genre": "Educational",
  "perspective": "",
  "theme": "",
  "nonSport": "",
  "sport": "",
  "misc": "",
  "country": "",
  "releaseDate": "",
  "url": "https://www.mobygames.com/game/atari-st/wonders-of-the-animal-kingdom",
  "visual": "",
  "gamePlay": "",
  "setting": "",
  "release": [
    {
      "system": "Atari ST",
      "releases": [
        {
          "publisher": "Unicorn Software Company",
          "developer": "Unicorn Software Company",
          "ported": "",
          "country": " United States",
          "releaseDate": "1987",
          "ean13": "",
          "comments": ""
        }
      ]
    }
  ],
  "shot": [],
  "cover": []
}